{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1869315",
      "video": false,
      "title": "Born Bad",
      "recommendations": [
         46452,
         54608,
         74915,
         147879,
         220677,
         71626,
         362434
      ],
      "backdrop_path": "/iaYzNwdmR2b2FqiJBGo9zbOHBxb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Katherine Duncan",
               "gender": 1,
               "credit_id": "52fe499dc3a368484e134b4d",
               "name": "Meredith Monroe",
               "profile_path": "/78MnZi3W8MkiAkcMSHElZMzQm2d.jpg",
               "id": 87934,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brooke Duncan",
               "gender": 1,
               "credit_id": "52fe499dc3a368484e134b51",
               "name": "Bonnie Dennison",
               "profile_path": "/jkrV9PiV4NQx7yym9XfSMUkj4oS.jpg",
               "id": 162541,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Denny",
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b55",
               "name": "Michael Welch",
               "profile_path": "/93sABnjY1mJyFLW12W51vJJ5lrr.jpg",
               "id": 56676,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Walter Duncan",
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b5f",
               "name": "David Chokachi",
               "profile_path": "/uZbeJhtih8JgodI4XzXcxCJXSdy.jpg",
               "id": 77321,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kyle Duncan",
               "gender": 0,
               "credit_id": "52fe499dc3a368484e134b63",
               "name": "Walter Duncan",
               "profile_path": null,
               "id": 935286,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kristin",
               "gender": 1,
               "credit_id": "52fe499dc3a368484e134b67",
               "name": "Amanda Ward",
               "profile_path": "/2vGQCriIAYbldbv62y7Le3Rvl9e.jpg",
               "id": 148683,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b6b",
               "name": "Bill Oberst Jr.",
               "profile_path": "/cBoVvgK2xwXQog8kByRFN3nv919.jpg",
               "id": 130768,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jose",
               "gender": 0,
               "credit_id": "52fe499dc3a368484e134b6f",
               "name": "Carl Donelson",
               "profile_path": null,
               "id": 84178,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Paramedic",
               "gender": 0,
               "credit_id": "52fe499dc3a368484e134b73",
               "name": "Christina Myhr",
               "profile_path": null,
               "id": 935287,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dana",
               "gender": 1,
               "credit_id": "52fe499dc3a368484e134b77",
               "name": "Donnabella Mortel",
               "profile_path": "/mwhD5ej80b75K0K5MVwtciIsAEd.jpg",
               "id": 935288,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "57251660c3a368305a001527",
               "name": "Paton Ashbrook",
               "profile_path": "/kniTjPNOnOO77DPhH6TsEwdcQ3t.jpg",
               "id": 1000757,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b5b",
               "name": "Jared Cohn",
               "profile_path": null,
               "id": 583932,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b7d",
               "name": "Jared Cohn",
               "profile_path": null,
               "id": 583932,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b83",
               "name": "Chris Ridenhour",
               "profile_path": null,
               "id": 128763,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe499dc3a368484e134b8f",
               "name": "Kristen Quintrall",
               "profile_path": null,
               "id": 109941,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134b95",
               "name": "Gerald Webb",
               "profile_path": "/ndeC3GwyeR8lPzzKld8DFP9hxIA.jpg",
               "id": 211900,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe499dc3a368484e134b9b",
               "name": "Drew Cookson",
               "profile_path": null,
               "id": 935289,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe499dc3a368484e134ba1",
               "name": "Amber Hamzeh",
               "profile_path": null,
               "id": 935290,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134ba7",
               "name": "David Michael Latt",
               "profile_path": null,
               "id": 30053,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe499dc3a368484e134bad",
               "name": "David Rimawi",
               "profile_path": null,
               "id": 236844,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5358e39d0e0a2606880090ce",
               "name": "Alexander Yellen",
               "profile_path": null,
               "id": 79392,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.23038,
      "production_countries": [],
      "id": 78403,
      "vote_count": 5,
      "budget": 0,
      "overview": "A young woman (Bonnie Dennison) falls for a mysterious man (Michael Welch) who reveals his dark side.",
      "similar": [],
      "original_title": "Born Bad",
      "runtime": 86,
      "poster_path": "/46VrtBXqDMp2wWykzddRJpbS0of.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-07-11",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jared Cohn"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Jared Cohn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1869315/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTc4Mzg2MTc5OV5BMl5BanBnXkFtZTcwNDQyNTA5Ng@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Meredith Monroe",
         "Bonnie Dennison",
         "Michael Welch"
      ],
      "reviews": [
         "An opening scene establishes pleasant-looking Michael Welch (as Dennis \"Denny\" Nelson) is actually a killer rapist. Then, we meet rebellious teenager Bonnie Dennison (as Brooke Duncan). She is unhappily moved to a smallish town and resents pregnant stepmother Meredith Monroe (as Katherine), who keeps trying to get chummy. \"My step-mom is trying to be my mom,\" she tells Mr. Welch, on their romantic first date. Wealthy father David Chokachi (as Walter) hopes his daughter and son Parker Coppins (as Kyle) will come to accept their new mom. Welch muscles his way into the family, then revels terrorist tendencies... Here is yet another reason for fathers to give their daughters' nice-acting boyfriends a second look - there could be a killer lurking behind that charming exterior. \"Born Bad\" presents the usual psycho situations, but with money and effort spent well. You've got to admit, this one really moves; the final half picks up a lot of steam, and keeps the suspense level high. Writer/director Jared Cohn (who also acts) has a future with this sort of thing. Allowing some slack, the fate of \"Bryan\" is too unclear, and although Ms. Monroe is directed to say Welch was \"checking me out\" in the car scene, the reverse is clearly true. Check it out. ****** Born Bad (7/11/11) Jared Cohn ~ Michael Welch, Bonnie Dennison, Meredith Monroe, David Chokachi",
         "The idea behind the film of your daughter falling for a charming man who turns out to the devil is probably every parents nightmare however this film was pretty poorly acted and some of the decisions taken by the teenage girl Brooke were just unrealistic, unbelievable and damn right stupid. The speed with which she falls for this guy she has just met and starts telling him her innermost feelings is unrealistic. There is a scene where Denny slaps Brooke and then he apologizes to her. They then go to the girl's house and everyone finds out he's bad and the stupid girl still goes with him. Perhaps he didn't slap her hard enough. I felt no sympathy for her and part of me wanted to slap her myself. The next unbelievable decision was when Denny and his robber friends are terrorizing Brooke's family and she escapes from being tied up in the car. Instead of running away and calling the police she decides to sneak into the house and rescue the family herself from three men armed with guns. Who on Earth wrote this unbelievable plot? A ten year old could probably write better. Despite all of these flaws it was still quite a fun movie to watch. I suppose the purpose of a film is to entertain and this does do that.",
         "This poor imitation of Fear (starring Mark Wahlberg and Reese Witherspoon) leaves much to be desired. Minimal character development and terrible acting do nothing to save a ridiculous story that cannot even qualify for the \"so bad, it's good\" category. We are taken on a wholly unbelievable ride with Denny (Michael Welch), a serial rapist and murderer, who meets good girl Brooke (Bonnie Dennison) and apparently falls in love with her just about instantly. Within two minutes of meeting each other, Brooke is opening up to Denny about her terrible relationship with her father and her stepmother and with a few cups of her face and some soothing dribble about how she's a good person, \"born bad\" Denny has her wrapped around his finger. Credit to Welch, there is an underlying creepiness to Denny even at his most charming befitting his homicidal tendencies, but he is given so little to work with here that one wonders what enticed him to take on the film in the first place. Denny seems to posses superhuman powers that would make the Jason Voorhees and Michael Myers of the world green with envy as he is stabbed, smacked and shot and somehow still manages to run around wrecking havoc. It is clear, however, the writers never intended for this film to be anything remotely like realistic with stupidity abound throughout the film. This is 86 minutes of my life I will never get back. Don't do it, folks.",
         "I actually registered just to write this review. I do not like how the relationship between Denny and Brooke starts off. The portrayal of the relationship just wasn't very realistic and it went to quickly in my opinion. I have to say that the script was awful. Michael Welch was very good with the acting, but the plot was predictable. As the movie kept going it got a little better, but for me the characters lacked in personality. The quality of the movie was poor in almost every way. I can't get over how boring and dull the script was. The one good thing that came from this movie is awareness to bad people out there and that your kid could be infatuated with one.",
         "Well of course the film Born Bad is not very realistic but it is noteworthy from an educational point of view. Teenagers, especially females, fall prey to older friends all the time in an effort to be accepted by their peers. Before it is too late, if teenagers were to see this film it may wake a few more of them up to falling prey to peer pressures. Yes, I think the film went to extremes by attempting to demonstrate how a disturbed young man named Denny played by Michael Welch, baits his young victims by treating them as that \"special one\" and once he has their trust he abuses them to his perverse satisfaction. I do think a lot of criminals work in tandem to get the upper hand on their unsuspecting and innocent victims. Such as in this case we have three men who enjoy breaking in to homes and robbing their victims of their valuables. The young innocent girl in Born Bad is named Brooke and she is played by Bonnie Dennison. As in real life, we all know of some families who after the father and mother split up, the family decides to move and the new step mother and step daughter have difficulties in accepting each other as they compete for their respective husband and father's attention. Young Brooke who is looking for attention from her father falls victim to bad boy Denny's trap and she soon discovers Denny is not the young man with good intentions that she thought he was. As I said, the movie is not very realistic but I do believe that some incidents that occur in Born Bad do in fact occur in real life. Upon watching Born Bad some families may be able to relate to how their own young teenagers first got in to trouble. If you do decide to watch this film with your teenagers there are a few lessons in life that your kids could pick up on and avoid some of the pitfalls that Brooke and the other young ladies fell victim to Denny's evil plans. Born Bad is not a classic film, but it could help your teenagers avoid being born stupid. It is worth a watch.",
         "This movie reminded me a lot of the 1996 movie Fear with Mark Wahlberg and Reese Witherspoon.The acting was also very good. I also had no idea when i started watching the movie that the bad guy in the movie was the same guy who was in the Twilight movies. In twilight, he plays a geeky character who couldn't hurt a fly.However in this movie he plays a very sadistic rapist and murderer. Very good acting from Michael Welch. He plays one of the most psychotic people I've ever seen. Plus he's also kind of hot. The last half hour is very thrilling and action packed! All in all a decent T.V. movie. I would be willing to watch it again if it was ever on again.",
         "While BORN BAD story-wise isn't better or worse than a thousand other Lifetime Originals, I liked one thing about it: the villain is motivated by just plain old-fashioned lust. This, in contrast to so many Lifetime villains who terrorize and kill because they've seen the original STEPFATHER movie and are obsessed with killing their way to the \"perfect family!\" Also, the filmmakers didn't stint on the action. Poor Meredith Monroe has to fight off three home invaders with her hands duct-taped part of the time, and with only minimal help from the rest of the family. Again, there's nothing original to be found here, but the pace is fast, the acting is vivid if never subtle, and the main guy playing the villain is enjoyably detestable.",
         "Extreme scenes open this wild ride of a film,Shows the audience a character\u0085Well who was BORN BAD. Michael Welch has a JAMES DEAN screen prescence, He controls his emotions and brings you into his reality. Great cast and plot that just flows with a ' Roller Coaster' of emotions drawing you into the jeopardy and sheer terror. Wanted to hate ( And probably was made to by plot) these bad guys from the start and feel for the family that they invade. Great cover (poster art) and to think Welch comes from the TWILIGHT movies,Huh,May have to watch one now to see in another role.",
         "Lots of classics and stereotypes here. Denny is a native American, as the line from the movie 'John Q' goes, he's a member of the slapaho tribe. He rapes and ganks a girl, utters the catchphrase \"gotcha\", and buries her body. The girl before she is ganked utters the stereotypical female in jeopardy line of how she will call the police. Didn't she realize when you are being attacked, the attacker will not stop so you can call the police? My early take was that he stays in shape by digging graves. Needless to say he's the Lifetime Psycho (LP) here. Body count: 1. I'll skip through the stereotypical rebellious teen and hands off parents to concentrate on the end which was really stupid funny (hence the high Lifetime movie score). Funniest line of the movie takes place when daughter/step-daughter Brooke asks LP if he is a psycho stalker and he says he is actually a rapist. +2 Lifetime movie points for that one. On Brooke's follow up call to LP, he is in the middle of having sex with Dana, but he drops her to take the call. LP stereotypically works his way into the family, but step mom has a bad vibe about him and puts in a call to his supposed employer. Somewhere in here he argues with Dana and ganks her the same way as the first girl, then buries her body. Oh yeah, she also used the 'I'm going to call the police' line while she is being attacked. Body count: 2. Step mom's follow up call is returned and she learns bad stuff about LP wile he is eating dinner with them. A big argument ensues and Brooke decides to leave with LP despite both 'parents' trying to stop her. At Denny's place Brooke sees a purse that belongs to Dana and wants to go home. He yells at her and slaps her again, then throws her onto the floor. I'm cheering for him: \"Gank her, gank her!' We see now how truly evil Denny is- he is a tobacco user! Brooke is taped & gagged, and they go for a ride. Dana's brother Bryan calls and LP arranges to meet him, LP puts a serious beat down on Bryan, then curb stomps him, using his catchphrase from earlier. Body count: 3. The family figure out that LP is a convicted sex offender. They call Brooke, not the police (another Lifetime movie stereotype), and when step mom tries to call the cops, the line is dead- LP ripped out the line! Dad has a cell, but the plan is to go to the cops and call on the way. Meanwhile, LP has entered via a convenient unlocked door. Bro sees the door open and says nothing, closing it. As they are leaving, LP grabs bro and has a knife. LP makes dad smash his phone. Instead of going to the guesthouse for that gun, they comply and LP has step mom use some convenient duct tape to tie them up. He then knocks her out via a head butt and tapes and gags her. LP makes a call to his gun thug buddies to rip off the family. He has another talk with Brooke, who has been sitting in the car the whole time. After she sees what is going on, she is able to free herself in like 30 seconds. Should she run to a neighbors home? See if the keys are still in LP's car and go for help? Nope, she goes back to the house. Gun thug #1 is distracted by loud music. Brooke picks up a knife in the kitchen. Eventually Denny threatens step mom, uttering the catchphrase while she's at gunpoint. Brooke plunges the knife into his back, a fatal wound in other movies, but a scratch here. I guess the two gun thugs were on a union work break, but then there is a comedic fight scene. Step mom whacks Denny with a pan and then instead of picking up his gun, runs out the door. Brooke is now duct taped again. Step mom ran towards the guest house, uses some clippers aided by her large pecs to free her hands, and now has the shotgun, but doesn't know how to use it. Gun thug #2 enters and another funny fight ensues. She ends it when a convenient garden tool to gun thug #2's neck. Body count: 4. Another ridiculous fight in the garage and gun thug Jose is ganked by Brooke, bro, and dad. Body count: 5. A cop shows up out of nowhere and is ganked by Denny. Body count: 6. Denny uses the stereotypical talk don't shoot with Katherine and then Brooke who finally does something smart by playing Denny until dad comes out and is shot by Denny. Step mom has instantly recovered the shotgun and a standoff ensues with more talking on Denny's part and no shooting- seriously, he just ganked a cop and shot dad, why doesn't he just gank step mom? After some more fighting, to include a you can't kill the boogeyman move after being gut shot by a shotgun, as he is again about to gank step mom, Brooke hits him with his car. Body count: 7 (?) Denny was still moving. The next day all is well, no therapy needed, as the dysfunctional family that slays together stays together. One last point, a classic is LP driving a third generation Firebird. I was disappointed when he didn't have a Camaro and a mullet haircut. Had to deduct 1 Lifetime movie point for that omission. Real movie score: 2/10 (higher is better). Lifetime movie score: 8/10 (higher is stupider).",
         "No votes as I have mixed feelings. The cast kept my interest. Especially Meredith Monroe who made it believable and touching on the family side. Papa is played handsome David Chokachi (Baywatch fame) and had very little to do but act tough and helpless. Each time he made an attempt to fix things he gets shot down. Wifey seems to do the work here. Then we have the obnoxious daughter played by Bonnie Dennison, who to me, was not the pretty thing worth all the fuss about. Kid brother played by Park Coppins cried a lot. Villains played by Michael Welch (over the top acting), Kaiwi Lyman (greasy idiot) and Carl Donaldson (a thug) were acceptable. Victims Donnabella Mortel and Tony Christopher had little to do but wait to get done in. And you waited for that to happen. Some of the acting kept me tuned in. Script was very predictable. You knew the ending in the beginning. Just had to painfully watch these poor actors deliver this dull uninteresting dialog. Not even the direction had any distinction. Too bad.",
         "\"Born Bad\" very apt name for this foul piece of work. However, I'm bumping UP my rating to a generous 3 out of 10 stars, due to the fact that I can't turn away from it! Somehow, the rice-paper thin plot, acting skills that don't even rival the likes of adult film stars, and a leading man who is far from credible are not enough to send me running for the remote and stop this madness from polluting my living room. Fortunately, trailers were included for other films generated from the same studio; arming the consumer with information needed to avoid the rest of their work like the Plague (the theme of another Asylum film, of course). Perhaps I'm actually enjoying how bad Born Bad is; after all I only paid $1 for it at Redbox, and you get what you pay for. See you again soon Born Bad, in Wal*mart's $5 DVD bin.",
         "The film had promise where a girl who dislikes her step-mother, meets a boy who seems to be the right guy for her. Of course, he has a terrible dark side. The film descends into madness and sheer terror once the guy finds out that her family is on to him. It becomes unbelievably violent as our culprit seems to have 9 lives. Violence abounds in this picture. Here we have a young lady who is defiant due to her dislike of her step-mother, who is pregnant by the way. We have the girl who realizes she has made a big-time mistake. Is it too late for her to rectify the situation? The picture also has the familiar tale of turning the tables.",
         "Since his childhood, I've seen Michael Welch appear in everything from American Son to Z Nation, and all that falls in between. This guy seems to be in everything, but it wasn't until I saw Born Bad, that I realized he's more than just some geeky guy in the background, he's got some real talent, playing every woman's worst nightmare. Brooke (Bonnie Dennison) is a rebellious teen, who is looking for love, and is immediately drawn to the older Denny (Michael Welch). At first he seems like the perfect boyfriend, but little did she know, he's actually a psychopath. To me films like this are scarier than any horror movie, because what's more likely to happen, a zombie apocalypse or coming across someone who isn't what the appear to be? As I said, Michael Welch was scary good in this film, portraying a man with two faces. On the surface, he's this really nice guy, but underneath, he is pure evil. Watching Welch balance the two and try to keep the real him at bay was really something to see. As far as the rest of the film, it's what you would expect, there isn't too much of a story here and little to no surprises, other than Michael Welch, who makes this film more than just something you'd turn off after ten minutes.",
         "Born Bad is far from a good movie by any stretch of the imagination- from this viewer's point of view anyhow- but it also could have been much worse. It does at least have two good performances, Michael Welch who is chillingly effective(at least for two thirds of the movie) and Meredith Monroe who makes for a movingly sympathetic mother figure. The production values are competent also at least, and the beginning rape and murder scene was very graphic and disturbing(which did give the impression that this could be a decent movie if done right), Lifetime's other movies are tame compared to this one scene. The rest of the acting is not so good though, the worst case was David Chokachi whose acting as the father was dull and veering on overwrought. Bonnie Dennison also doesn't have very much to do other than be all doe-eyed and naïve. And while Welch is fine for most of Born Bad, the final act was where the movie really started to lose steam and his acting became rather over-the-top with a lot of his lines literally screamed. Everybody else never get a chance to properly distinguish themselves. The soundtrack is rather monotonous and heavy, it rarely gains momentum and generally it's dreary and unimaginative to listen to. The characters are characterised and written stereotypically and with little development to them, and relationships between characters seldom ring true, especially between Welch and Dennison. Not helping them much is that the script gives them little to work from, especially in the final act it's lifeless and unintentionally cheesy(especially in the melodramatic parts), \"he looks like an alright guy\" is such a clichéd and cringe-worthy line. The story had a promising start but meandered very quickly, if anything it was here where Born Bad let itself down most. It lacked any kind of atmosphere, thrills, suspense and even total engagement, was way too rushed and was more predictable- incredibly so, you pretty much knew how the movie was going to end when it started- and hilariously stupid(somebody actually gets shot in the stomach and then they seem okay afterwards? Bad continuity that is) above all else. The direction lacks character and comes across as flat generally. So all in all, has its moments with two good performances, a promising beginning and competent production values, but mostly predictable, stupid, rushed, lifelessly scripted and just un-engaging really. 4/10 Bethany Cox"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Asylum, The"],
      "summaries": ["A young woman falls for a mysterious man who reveals his dark side."],
      "budget": 0
   },
   "movielensId": 137072,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-07-11",
      "dvdReleaseDate": null,
      "directors": ["Jared Cohn"],
      "runtime": 86,
      "movieId": 137072,
      "title": "Born Bad",
      "mpaa": "",
      "actors": [
         "Meredith Monroe",
         "Bonnie Dennison",
         "Michael Welch",
         "David Chokachi",
         "Walter Duncan",
         "Amanda Ward",
         "Bill Oberst Jr.",
         "Carl Donelson",
         "Christina Myhr",
         "Donnabella Mortel",
         "Paton Ashbrook"
      ],
      "imdbMovieId": "1869315",
      "originalTitle": "Born Bad",
      "genres": [
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": ["ujHDeAgWdhY"],
      "plotSummary": "A young woman (Bonnie Dennison) falls for a mysterious man (Michael Welch) who reveals his dark side.",
      "tmdbMovieId": 78403,
      "avgRating": 3,
      "releaseYear": "2011",
      "numRatings": 3,
      "posterPath": "/46VrtBXqDMp2wWykzddRJpbS0of.jpg"
   }
}