{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "refugee",
            "id": 972
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "immigration",
            "id": 1900
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "iraqi ",
            "id": 41179
         },
         {
            "name": "outback",
            "id": 157906
         },
         {
            "name": "journey",
            "id": 189092
         },
         {
            "name": "asylum seekers",
            "id": 208863
         },
         {
            "name": "coast",
            "id": 209135
         },
         {
            "name": "indonesian",
            "id": 241403
         }
      ],
      "imdb_id": "tt0452644",
      "video": false,
      "title": "Lucky Miles",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 568864,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Arun",
               "gender": 0,
               "credit_id": "5a5fca9992514159fb00a497",
               "name": "Kenneth Moraleda",
               "profile_path": null,
               "id": 1961988,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Youssif Al-Samer",
               "gender": 0,
               "credit_id": "5a5fcacdc3a36877cc00a4d9",
               "name": "Rodney Afif",
               "profile_path": "/wr1gTOcRcyKO4fYlUwsPLRlP7bn.jpg",
               "id": 1530814,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Ramelan",
               "gender": 0,
               "credit_id": "5a5fcb510e0a2650a500b274",
               "name": "Sri Sacdpraseuth",
               "profile_path": null,
               "id": 1961989,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Pvt Greg Plank",
               "gender": 0,
               "credit_id": "5a3b706d0e0a264cbe21adb2",
               "name": "Don Hany",
               "profile_path": "/lPBDbce97mNLC5hGh9lEYDsi0FI.jpg",
               "id": 79089,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Sgt O'Shane",
               "gender": 0,
               "credit_id": "5a5fcc390e0a26510100b159",
               "name": "Glen Shea",
               "profile_path": null,
               "id": 1961998,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Muluk",
               "gender": 0,
               "credit_id": "5a5fcc4f0e0a26506400b1b4",
               "name": "Sawung Jabo",
               "profile_path": null,
               "id": 1961999,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Abdu",
               "gender": 0,
               "credit_id": "5a5fcc689251415a2b00a9d1",
               "name": "Arif Hidayat",
               "profile_path": null,
               "id": 1962000,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Lisa (voice)",
               "gender": 1,
               "credit_id": "52fe440ec3a368484e00cf8b",
               "name": "Deborah Mailman",
               "profile_path": "/vkxMutzflPotsv14TvIH3N0Qbem.jpg",
               "id": 228704,
               "order": 7
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe440ec3a368484e00cf83",
               "name": "Geoff Morrell",
               "profile_path": "/pDKvveuKSMT3mxikAj3CPC5FogS.jpg",
               "id": 93119,
               "order": 8
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe440ec3a368484e00cf87",
               "name": "Rithy Dourng",
               "profile_path": null,
               "id": 1191826,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe440ec3a368484e00cf79",
               "name": "Michael James Rowland",
               "profile_path": null,
               "id": 79096,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe440ec3a368484e00cf7f",
               "name": "Michael James Rowland",
               "profile_path": null,
               "id": 79096,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a5fcece9251415a8600a24b",
               "name": "Helen Barnes",
               "profile_path": null,
               "id": 1962010,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a5fcf950e0a26507200ab87",
               "name": "Michael Bourchier",
               "profile_path": null,
               "id": 135227,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5fcfcec3a368780300add5",
               "name": "Jo Dyer",
               "profile_path": null,
               "id": 1691179,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5fd00b0e0a2650a500b5d9",
               "name": "Lesley Dyer",
               "profile_path": null,
               "id": 62873,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a5fd0629251415a5b00a221",
               "name": "Geoff Burton",
               "profile_path": null,
               "id": 72629,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.263733,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 21181,
      "vote_count": 4,
      "budget": 2600000,
      "overview": "It's 1990 and an Indonesian fishing boat abandons Iraqi and Cambodian refugees in a remote part of the Western Australia. Although most are quickly caught by officials, three men with nothing in common but their misfortune and determination to escape arrest, begin an epic journey into the heart of Australia.",
      "similar": [
         26405,
         9355,
         9659,
         8810,
         245846,
         294652,
         9555,
         157845,
         2759,
         36040,
         199534,
         17381,
         13041,
         66125,
         347196,
         337958,
         199818,
         403570,
         26178,
         28881
      ],
      "original_title": "Lucky Miles",
      "runtime": 105,
      "poster_path": "/wiqkLcAkLYCuClXnIXODAjw5rDO.jpg",
      "spoken_languages": [
         {
            "name": "Bahasa indonesia",
            "iso_639_1": "id"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "km"
         },
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2007-07-19",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": ["Michael James Rowland"],
      "runtime": 105,
      "synopsis": "In LUCKY MILES an Indonesian fishing boat abandons Iraqi and Cambodian refugees in a remote part of the Western Australia. Whilst most are quickly caught by officials, three men with nothing in common but their misfortune and determination escape arrest and begin an epic journey into the heart of Australia. Pursued by an army reservist unit, our three heroes wander deeper into the desert, desperately searching for civilization amongst the stones of the Pilbara. LUCKY MILES is foremost a buddy movie in the proud tradition of the three-guys-stuck-out-on-a-limb genre.",
      "writers": [
         "Helen Barnes",
         "Michael James Rowland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0452644/",
      "coverLink": null,
      "actors": [
         "Kenneth Moraleda",
         "Rodney Afif",
         "Sri Sacdpraseuth"
      ],
      "reviews": [
         "This film is a major leap forward from recent Aussie films, thankfully getting away from drug-raddled Western suburbs teenagers and quirky comedy clowns. The film-makers are willing to take on a big subject, a major global theme, that of displaced people and the extraordinary acts of quiet courage that so-called \"boat people\" are often required to perform simply to survive. It is very well directed, skillfully guiding an almost entirely unknown and inexperienced cast by not relying on too many long, challenging acting scenes but flick-passing from one story to the next in a way where the limited acting skills of the cast are best served. This is not a perfect film, it is too long at some points, and once in a while commits the cardinal sin of letting the audience get ahead of the film in knowing full well what will happen next. Another careful and unemotional edit, trimming eight to ten minutes of splashing in billabongs, tinkering with utes and trudging through scrub could only help. But these are minor quibbles in a film that achieves so much, that aims high and gets there. This and \"Clubland\" are without doubt the best two films so far in2007.",
         "The scenario is simple. A disparate group of refugees are dumped on the inhospitable West Australian coast by unscrupulous people smugglers. It may sound like the perfect recipe for a tale of woe and misery, but instead Lucky Miles is a comedy, and easily the most enjoyable Australian film I've seen for quite a few years. And the audience at the Sydney Film Festival certainly found plenty to laugh at. Writer Helen Barnes and writer/director Michael James Rowland, aided by a wonderful ensemble cast, have created a marvelous set of characters. They could have given us mere symbols of suffering and injustice, or ethnic stereotypes, but instead each character is gloriously human. The Iraqi and Cambodian refugees, the Indonesian people smugglers, and the Australian reservists tasked with rounding them up, all have laughable foibles. And it is the presentation of this common humanity that makes this film not only very funny, but also a powerful exploration of one of the most pressing issues of our time.",
         "Left to find their way over the sand dunes for a bus to Perth these wanderers have little understanding of how far they really are from a town. Such is the setting for this film looking at what it means to flee your homeland for another. Apart from the political environment, this film gives a new perspective to an old story - that of asylum seekers, refugees, queue jumpers or the myriad of loaded terms used these days to express a simple idea...fleeing a country due to crises, finding a new home or reuniting with family (father). A comic tale 'inspired by true stories' filled with moments of laughter, frustration and tears of relief. A variety of atmospheres are painted against the backdrop of the vast Australian landscape showing its beauty in the colour of the reeds and grasses, red soil and iridescent blue ocean. Three contrasting stories are told in parallel in the western desert complete with goanna and abandoned miner's hut. Sweeping views of the Australian desert landscape on the edge of the sea are like actors themselves. These stories are ripe for the telling with characters drawn in three dimensions, believable, brought to life as real people rather than stereotypes echoing our fears. This film celebrates the look of the outback, and is told with humour, sensitivity and empathy for those caught up in ordinary circumstances outside our own world view and yet closer than we think.",
         "This is a road movie with a difference. It really gets to the heart of the vastness that is the Australian continent. It is essentially a quest like all good movies but with many twists and turn along the way.The sometime serious subject matter is treated with humour. If you like Mad Max,Crocodile Dundee and Walkabout you will find elements of all these in this film. It also good to see an Aussie film that has something besides lots of whitebread \"skippy\" characters. In keeping with the trend in many films today there are several stories running as linked threads through the film and this keeps the interest for the audience. Would recommend this as a feelgood and heartfelt film with something to appeal to many groups.",
         "What a great little film and I mean that in the best way. Meaning it's not overplayed, over-acted, over-cut, over-the-top or any of the other \"we're over it's\" that fill most of the frames of blockbuster rubbish. This is a film that tells a great story, with compelling and real people that will have you laughing along and wishing them all a happy ending. Even better for an Aussie film, it's full of the great Aussie characters and they're not over-done or caricatures. yes it's a touch long and if it gets the 10 minute trim I and others think it deserves, Lucky Miles will be one of the great little films of recent times - go see it!",
         "Few films today dare to treat our border control issues with situational humor. Even fewer rely on a largely unknown cast, to carry a story that has very little to do with saving the western world or pointing any fingers. But almost none consider that coming to the western world could be worse than 'where ever it is they came from' for an asylum seeker. Lucky Miles is such a film. It takes the politics out of culture clashes and anchors conflict in the need for survival. It challenges stereotypes both international and indigenous without tippy-toeing or apologizing. Films like this one are long, long over due, and call the need for a shift in our attitudes to generating new Australian filmmakers. Lucky Miles is a leap forward in old fashioned cinema, and a beacon for commercial free stories.",
         "This is a (non-romantic) comedy, based on several true life stories. An Indonesian fishing boat-full of unauthorized male migrants from Iraq and Cambodia is put ashore by the villainous captain on the north-western coast of Western Australia. The migrants are told all they have to do is climb up from the beach to a road from where they can catch a bus to Perth. What the captain fails to tell them that Perth is 2000 km away and the nearest bus stop (of the \"Lucky Miles\" bus company) is in Broome, 300 km away. Discovering the fraud, the party breaks up. Boat people are no novelty in these parts and most of them are soon picked up by the authorities, but three of them, Arun, a Cambodian who is trying to get to his Australian father in Perth, Yousif an Iraqi engineer who has lost everything at home and Ramelan, a member of the fishing boat's crew get themselves lost in the desert. They are, however, not alone. A border patrol operated by Army reservists is on their trail, but the pursuit would have to be described as leisurely. One of the reservists, an Aboriginal, is quite at home in the bush and his superior tracking skills means his colleagues don't have to put themselves out very much. It is pleasant to record that the Army guys are actually concerned about the fate of their quarry. The lost trio on the other hand have nothing in common except that they are lost together and much of the comedy arises from their incompatibilities. They have to co-operate to survive, but it's a close-run thing. Outback South Australia stood in for the northwest of WA, but it is still a tough landscape. The film-makers very sensibly shot on location between June and August, but you can still sense the heat. I'd like to make this film compulsory viewing for those of our politicians and officials who equate boat people as criminals. In the year in which this film was set, 1990, asylum-seekers were not automatically locked up. The future of the people in this film was quite bright. Now, of course they would be removed from the mainland, and dumped in our rented Pacific hell-hole, Nauru until we can persuade some other country (New Zealand perhaps) to take them. Immigration politics aside, the central characters are well realized and we become involved in their fate. Some well-known names in Australian acting pop up in small roles, but the main roles are taken by relative newcomers. Kenneth Moraleda as Arun and Rodney Afif as Yousif really shine. Afif gives us a man who is angry all the time, yet eventually we understand and even like him. Moraleda is not so showy but equally sympathetic. There was some nice camera work and clever cutting though at times the story meandered a bit. Entertaining and thoughtful.",
         "One of my favourites of 2007 It is simply a really well put together film about boat people trying to sneak into, and then around, the Northern territories. Every situation is handled with suitable aplomb: there is plenty of genuine laughs as well as great character development as the main protagonists fall out with each other and gradually form real bonds. There is a lovely touch throughout of subtitling the speaker rather than the screen and this works superbly. For a film with such a small plot it delivers a real punch: it is far more human, and enjoyable than many bigger costume dramas,, or big budget efforts. It really is worth the view, and I can't wait to see the next effort by Michael James Roland because this one is seriously good: funny, poignant, exciting, and above all, a film about finding. Warmly recommended",
         "This film is without comparison. It stands outside genres because it is without formula. It demands that each viewer approaches it with our own native intelligence turned on to Go mode - as if we too are in the desert without a compass. We are compelled to sense out the tone, intention and stand point of the film with few clues other than a kind of \"existential compassion\". Curiously, and perhaps with a lazy dingo's ear to what the rest of the audience is doing, we find our ways with it effortlessly and quickly. We learn that the story speaks for itself through the uncompromising performances of the cast, the landscape and the narrative (\"whose\" performance we are reminded of in the visual use of sub titles). Added to this is a heart wrenching quality of ephemeral beauty - the quality of light, the sound track which is at times indistinguishable from the landscape, the loving clip on the ear, the joy of fresh water. It is about human rights to exist - but as measured across disinterested (is it?) geography rather than indignant legislation. That is, the measure of existence is three water bottles plus whatever happens to arrive to save the day, popping as it were, out of nowhere, and with no promises. We learn the power of endurance, cooperation, betrayal, foolishness and the synergy of happen chance. Tiny human attributes in a vast meaningless cosmology. This film has the hallmark of great artistic work: an original expression of a love of life and humanity.",
         "I am not voting 10 for the film because I was a cast member and had a role in the film, but because of how it blew me off whilst watching it at the premiere last week. I have done a fair few gigs and this one is by far the best of the best. I have never voted for work I have been a part of before, but this one is really a cracker of a picture and a very well told story. Michael's directions is wonderful and the narrative is held extremely well with the superb performances by the lead actors. I can't be reviewing the film, as it might sound one sided, however I am voting 10 because that is my genuine feeling towards the film. I have it as a top 5 Aussie films of all time. If I see it again, I will probably notice other positives/ flaws in the film and I will happily report them. OSAMAH",
         "LOVED the film ..the story line the cinematography....there were so many wonderful moments...loved how the Arun 'pan' like figure searched for his Father in spite of the odds...loved how the ute and the old shed scene ...felt the raw human emotion when Arun was in the headlights of the car driven by Gerard K...it was fate and luck as to whether the driver would be friend or foe...so well done! Loved how S.A. was made to look like W.A....and how the mean pirate seemed to be sending the message that \"He who is without sentiment or conscience will prevail\"...but did his karma-drama get him?..watch the film and find out! Loved Lillian Crombies brief appearance and how the army-tracker really captured the skill and simplicity of the Black-fellas perception of things...especially when they were all running left right and centre and he observed their histrionics. Thought it was funny when the Sargeant was showing his tracker skills by reading the obvious..... Really liked how the vulnerability of dispossession was portrayed and how Yousiff kept on going in spite of having lost his wife and brother and job and belongings...and how he looked after the others in spite of his anguish and frustration. And its true..bars in Asia are full of funny smelling Ozzies and the kind of humour you captured in the film. One of my favourite scenes was when someone said \"He has a gun\" and the camera panned right back to a synchronised retreat of all in the shot...well done! An AFI for this one I reckon!",
         "This film is for thinkers. The contrast and interaction between the 2 main characters alone, is priceless! Kind of a cowboy story where everyone is on their own selfish little trip, all a little lost in one way or another. Just when we think something terrible is going to happen, WHAM, a clever, witty remark or something unexpected happens. What a hilarious send-up of the Australian army. As The Sydney Morning Herald puts it, it's a bit like The Wizard of Oz minus Dorothy and the dog. The dessert, is so beautiful, and the music, well, I sure hope the soundtrack is available soon. Yes, the 'birds aren't very musical in Australia'. ;-D Lisa McIntosh",
         "This film depicts an Australia the Government doesn't want you to know about and the tourism industry will not depict in its advertisements. But the story incorporates truly comedic and heartfelt elements and Australians that we can all identify with. I challenge anyone to see this film and not be moved by it. Hrmm. My review needs to be 10 lines long. Lets see: This is an unmissable film! If you see anything in 2007 it should be Lucky Miles. Lock up your daughters and get to the cinema for Lucky Miles. I must be up to ten lines now....",
         "It was refreshingly funny, simply told, and yet really meant something. I went in to this film with my friends specifically because we wanted to see something Australian and fit around our work schedules. So with such high expectations i really didn't know what i was getting myself into, but was very pleasantly surprised. It has the subtle kind of humor, which in my opinion is so much better than all the cruid, outlandish humor used in all the blockbusters now a days. They didn't try to do to many things with the movie, to many little movie type tricks, or have to much going on, like most independent films I've seen tend to try to do. Overall, good movie. I would defiantly recommend.",
         "Diane and I saw this fabulous film yesterday and, as with most Australian movies, it will linger for many weeks in a mind that has trouble remembering what happened one hour ago. When I sit in a darkened theater, knowing nothing about the film I am going to see except that it is made in and takes place somewhere in Australia, I am obviously a little trepidatious not knowing anything of where I will be taken during the next hour. However, soon I get sucked into the action on the screen and Lucky Miles accomplished this subtly and brilliantly. The drama unfolds with great seriousness and no humour but eventually you, along with the other viewers, are laughing at the all-to-human situations with which these poor refugees find themselves confronted. It was of help knowing something about the geographical areas these characters found themselves in and it was of some help knowing of the people that they had to deal with before the movie ended but it is not necessary. To be alive and to have encountered these incidents is all this rich, insightful film requires of the viewer. How can you not laugh at a guy driving a broken wreck of a ute, minus a front wheel but still moving with the front bumper holding the vehicle in a rough straight line? Or the driver driving the ute backwards, sitting on the bonnet with his legs dangling over the dashboard while steering through the broken wind screen; he claims to be a Bassra, Iraqi with a PhD in mechanical engineering. This is a wonderful, rich look at a terribly serious subject punctuated with these bizarre humorous scenarios. A brilliant movie that should not be missed under any circumstances.",
         "This movie tackles the sensitive political issue of boat-people with laconic Aussie humour against the grandeur of the Western Australian desert and wilderness. The staggeringly beautiful and savage landscape is filmed to maximise the desperation of people who overcome all odds and somehow the director has managed to make it very, very funny.The well-cast motley crew of lesser known actors create multi-faceted rolls with which you can engage. Its a movie full of wonderful faces and intelligent thought. A little word of advice for intrepid travellers - should a largish lizard come hurtling towards you in the outback - do not stand still - as it will think you are a tree and climb!!",
         "The story and script are highly entertaining. The film examines the issue of asylum seekers in a non-confronting way, simply looking at it through the frame of immediate survival for the three \"buddies\". The acting throughout is also very convincing, and I will even give 3 out of 10 stars to South Australia for its portrayal of the Kimberley. There were some shots when the two stranded fishermen were walking along a beach under some red cliffs which could almost have passed for Cape Vilaret near Broome, but the \"inland\" shots mostly looked wrong in terms of vegetation and soil. It is sad that when the landscape is such a crucial character in a film, and when authenticity has been well-served in casting the humans, a similarly authentic approach could not also have been applied to that landscape.",
         "Lucky Miles is a movie which every Australian should see. It deals delicately and stylishly with the topics of illegal immigration, cross-cultural interconnectedness and isolation, while also presenting a gripping and sometimes beautifully humorous narrative. By presenting the stories of the two groups of boat people in a non-judgemental and value neutral manner this film could go a long way towards repairing Australia's generally xenophobic international reputation. The different, and yet intimately connected stories draw the reader in and immerse them in the stark reality of the Australian outback. As one character points out, it is hard to see this landscape as human, let alone as being part of a developed country. As the viewer joins the immigrants, locals and indigenous trackers through their travails of surviving this atrocious climate they are also led (metaphorically) through the intricacies of our immigration policy. See this movie with your eyes open people!",
         "Well, i don't really join the Hoo Haas on this one, I did have some good laughs but nearly yawn at others. I liked the music, I like the scenery, I liked the acting. But i'm not so sure about the whole mix, There were impossible situation and unrealistic too. One may find difficult to accept such fun in such desperate situations, the English a little too perfect for my liking and my migrant background. I was a little puzzled by the landscape and thought to cancel my hopes to go to Egypt one day on this basis, but after reading a comment about that landscape having perhaps being borrowed from somewhere else, I might wait to find the reality. I have traveled in Nth Qld, and from Darwin to Melbourne and saw a desert quite different. But I have never been to Nth WA so can't really tell one way or another. Warts and all I found it a very worthwhile work, but for me I found better value in some other Aussie movies. To each its own, but you have to see it if you want to know :)",
         "Well, blow me down... I loathe Australian movies... so I was taking my chances here... and for once, the reviews on IMDb were spot on... this fine little Aussie film is a masterpiece. I don't know if it would work as well for people who aren't Australian because it is the master of some subtle nuance, however, just a brilliant little film, with some very surprisingly hilarious moments... I'm still amazed as I write. This is a movie I could watch again and still thoroughly appreciate. Watch the beginning carefully... it links beautifully with the ending, but all the stuff in between, wonderful.",
         "Every so often we get to see a little film on TV not too long after its hardtop screening. And this one was worth the second look. It's another way of looking at the Australian outback, not for its awesome beauty but for the challenges it sets for people not used to such a landscape. Here we have such a challenge, the protagonists being asylum seekers who are victims of amoral people-smugglers. This is currently a political hot potato in Australia, as it has been for many years. But this film has a quirky edge to it, and the seriousness of the images is relieved hugely by the humour. It really is fun, and the way the Australians in uniform handle the reality is the fun that has come to be known as gallows humour. Imagine you're a cop or a soldier faced with a nasty situation. You grin, and relieve the tension by making light of things. Resourcefulness and mateship are supposed to be part of the Australian psyche, and this great little film has it in spades. Think \"Bush Mechanics\". Think \"Flight of the Phoenix\". And listen out for the voice on the radio. That's the beautiful Deborah Mailman, whom the casting agent would surely have loved to at least do a walk-on. See it on wide screen.",
         "Sometimes, ugly times produce beautiful art, and Lucky Miles is a beautiful film. I've lost count of the times a smirking politician has described how shockingly, insufferably bad things are in some of them nasty foreign places. They should be thankful we're carpet-bombing them, to restore some civility. Or so we're constantly told. At the same time it's argued that if some of the locals ever wanted to flee from the above-mentioned insufferably-bad places then there must be something suspicious about them. Politicians depict refugees as a kind of blood-sucking mix of sacrilege and explosives and use this kind of message to win elections. In one infamous Australian election campaign, the incumbent Liberal government headed by John Howard explained to a horrified electorate that refugees showed their true colors by throwing healthy babies into the ocean to drown. And they had photos to prove it. The electorate was stunned and offered sufficient votes to return the government for another term. It was only after the election that the whole story came out: the kids in the photos (and adults too) were in the water because their boat was sinking. Refugees are a fact of life, and with climate change set to inundate some of the most heavily populated coastal regions with salty water, the smart money says the issue is not going to fade away. There's no such thing as a country without borders and in a place like Australia, which is an island-continent the size of mainland USA, I think it's preferable being better informed about refugees rather than lied to. And so it is with an approach of casting a gentle and honest light on a mixed batch of refugees, dumped on a remote stretch of Australian coastline, that Lucky Miles begins its story. The refugees are not saints, and they're not villains either. In fact they seem to be remarkably human. Excited, frightened, insecure, and totally unfamiliar with their new surroundings, but at all times, human. There's one memorable scene where a group encounters an 'unexploded' tin can. The film doesn't mock their response. It just deals with it and moves on. And I love that. One aspect of the film which I've never seen used before, was the use of text translations positioned right alongside the speakers instead of always running on the bottom of the screen as subtitles. I hate thinking of all the foreign-language footage I've never seen over the years because I was tied up scanning only the bottom one-tenth of a screen reading the text. Placing the translations alongside the character not only allowed me to watch the film, but also made it crystal clear which character was talking - a feature which enhanced the long-distance scenes immeasurably. That subtle difference alone made me feel like spontaneously applauding. And that's what it's like to watch this film. You can peel away the 'spin' filters, canned laughter and smoke machines, and make up your own mind about the issues as the story develops. And it is a good story too, with real human drama. It is told with refreshing simplicity. It feels believable. Director Michael James Rowland truly shines in his role. I thoroughly recommend this film.",
         "This movie was actually a pretty good watch. The pacing of the plot was a little bit off for my taste, but it fit the plot of the movie quite well. The movie starts off a bit slow, but it picks up about halfway through. I was a bit shocked by the end of the movie and how quickly it was over, though. The end felt a little rushed, but other than that, the movie was perfect and the plot was completely original and felt 100% new and fresh. The characters were lively and interesting, especially Youssif Al-Samer and Sergeant O'Shane, who I thought were the most interesting and entertaining characters, respectively. I felt the portrayal of the characters was spot on perfect. They played their roles as if they were in the actual character, facing the challenges the movie presented them. Overall, the movie is a definitely a worthwhile watch, especially if you're looking for a good, home grown movie that's fresh and interesting."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Puncture Pty. Ltd.",
         "Blink Films"
      ],
      "summaries": [
         "An Indonesian fishing boat abandons a group of Iraqi and Cambodian men on a remote part of the Western Australian coast. Told there is a bus over the dunes, the men are abandoned to a desert the size of Poland. While most are quickly rounded up, three men with little in common but their history of misfortune elude capture and begin an epic but confused journey drawn on by their hopes amplified by the empty desert. Pursued by an army reservist unit more concerned with playing ball sports and music, our three protagonists wander deeper into trouble, searching desperately among the harsh beauty of the Pilbara for evidence of a western, liberal democracy. Or the promised bus.",
         "Three mismatched blokes are stranded in the Australian desert."
      ],
      "budget": 3100000
   },
   "movielensId": 137126,
   "movielens": {
      "languages": [
         "Bahasa indonesia",
         "English",
         "",
         "العربية",
         "Français"
      ],
      "releaseDate": "2007-07-19",
      "dvdReleaseDate": null,
      "directors": ["Michael James Rowland"],
      "runtime": 105,
      "movieId": 137126,
      "title": "Lucky Miles",
      "mpaa": null,
      "actors": [
         "Kenneth Moraleda",
         "Rodney Afif",
         "Sri Sacdpraseuth",
         "Don Hany",
         "Glen Shea",
         "Sawung Jabo",
         "Arif Hidayat",
         "Deborah Mailman",
         "Geoff Morrell",
         "Rithy Dourng"
      ],
      "imdbMovieId": "0452644",
      "originalTitle": "Lucky Miles",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["GIDjECVY1dg"],
      "plotSummary": "It's 1990 and an Indonesian fishing boat abandons Iraqi and Cambodian refugees in a remote part of the Western Australia. Although most are quickly caught by officials, three men with nothing in common but their misfortune and determination to escape arrest, begin an epic journey into the heart of Australia.",
      "tmdbMovieId": 21181,
      "avgRating": 3.5,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/wiqkLcAkLYCuClXnIXODAjw5rDO.jpg"
   }
}