{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1056101",
      "video": false,
      "title": "My Zinc Bed",
      "recommendations": [],
      "backdrop_path": "/iNv2Q5RvlEUnSIMZ5uYVCu7D71D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Elsa",
               "gender": 1,
               "credit_id": "52fe4953c3a36847f819478f",
               "name": "Uma Thurman",
               "profile_path": "/6SuOc2R7kXjq3Em24KTNDW9qblJ.jpg",
               "id": 139,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Victor",
               "gender": 2,
               "credit_id": "52fe4953c3a36847f8194793",
               "name": "Jonathan Pryce",
               "profile_path": "/dAgcoPcDtlhIUTrksPtsWdlfBX.jpg",
               "id": 378,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe4953c3a36847f8194797",
               "name": "Paddy Considine",
               "profile_path": "/fnVTS3GWIYEkKFaqzzNH49MGXmq.jpg",
               "id": 14887,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Finnoula",
               "gender": 1,
               "credit_id": "560149449251412285001578",
               "name": "Veronica Quilligan",
               "profile_path": "/4A2IttJgV4d0qh1wMSxFgFRtoR7.jpg",
               "id": 1144679,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "5601494b925141229a00186d",
               "name": "Olivia Poulet",
               "profile_path": "/sJlKZfppVe4ks1zfA1F2WsjjmhO.jpg",
               "id": 211395,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4953c3a36847f819478b",
               "name": "Anthony Page",
               "profile_path": "/hgQmWvsqcW4ZQCZkrS6nearUmnZ.jpg",
               "id": 39022,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56014932925141229000161b",
               "name": "David Hare",
               "profile_path": null,
               "id": 8403,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.532678,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 58075,
      "vote_count": 4,
      "budget": 0,
      "overview": "A recovering alcoholic becomes involved with his boss's wife, a former cocaine addict.",
      "similar": [],
      "original_title": "My Zinc Bed",
      "runtime": 75,
      "poster_path": "/zEhz3imSFRhCPp7HwrTFP4XBSbO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rainmark Films",
            "id": 3346,
            "origin_country": ""
         },
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": "/6in9uMqxXEHx5XgYgkeRBpZ4rPw.png",
            "name": "HBO Films",
            "id": 7429,
            "origin_country": "US"
         },
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         }
      ],
      "release_date": "2008-08-27",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Attraction. Temptation. Addiction.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Page"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["David Hare"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1056101/",
      "coverLink": null,
      "actors": [
         "Uma Thurman",
         "Jonathan Pryce",
         "Paddy Considine"
      ],
      "reviews": [
         "I registered on IMDb simply so I could share my appreciation of this marvellous production. The three main characters were performed to perfection by the brilliant cast. Thank you for bringing this wonderful play to our screens. Good in all things except perhaps the extent to which it felt more like a stage production than a televisual one. Paddy Considine particularly was spellbinding as his performance ranged from a man teetering on the brink of self annihilation, convinced his slightest misstep would result in his end, to conflicted. Presented with the stark depiction of a safe life without passion or a passionate life doomed to disaster his inner turmoil was made clear to us, and we felt his turmoil, fear and excitement.",
         "I watched My Zinc Bed last night on BBC2. I had high hopes for this one-off drama but quite frankly it was a truly awful piece of Television. It was clearly made for American TV. Everything about it felt fake: the over the top acting, the shots and the music. It was a adapted from a play, but why? It was boring. The story focuses on an alcoholic poet (Paddy Considine) who starts working for a millionaire businessman (Jonathan Pryce) after they meet for an interview. The poet then meets his wife (Uma Thurman) and the pair fall in love. Every conversation was about the same thing. Being addicted to drink. The characters just kept winding each other up, which led to me being wound up and wanting to stop watching it. It tried to be so clever and intelligent but it was just dull. I think it failed because it went for the \"less is more\" strategy: one conversation between Uma Thurman (what attracted her to this TV movie in the first place?) and Paddy Considine led to them kissing and then being in love. And the only way that the audience knew that was through the weak narration. Surely the BBC can do better in future.",
         "A quiet but tense piece, definitely not for those who hope for blatant excitement, being more a study of characters, each in his/her own privately nightmarish situation. Essentially a three-hander between Pryce, Considine and Thurman, all of whom turn in excellent performances of a solid script with many well observed turns of phrase and personality. Main weakness is how it dwells, for around 70 minutes, on alcoholic addiction to the exclusion of most else; but, if you know that going in, maybe you can handle it. Conversion from stage to screen works okay. FWIW, the end credits show it as co-production of BBC and HBO.",
         "Packed in a tight 75 + minutes, 'My Zinc Bed' follows a pretty simple structure. The film is mostly a chambre piece that is told through a series of conversations between three people: a recovering alcoholic poet, a businessman and his trophy wife. The director tackles the themes of alcoholism and desire through complicated relationships between the three characters. The tension is mostly built through dialogue. Paddy Considine, Jonathan Pryce and Uma Thurman deliver excellent performances as they get under the skin of the characters. Had lesser actors been cast, this would have been a borefest. Even though I find 75 minutes to be too short a time for a film's duration, I liked that the writer stays focused on the main story and its principle characters. Due to the complex themes, 'My Zinc Bed' may not be everybody's cup of tea and it has been an interesting and involving watch.",
         "This film is about a psychological tug of war between a rich guy and two recovering alcoholics. The first half of the film is just plain dialogs between people who do not even have any body gestures. To make matters worse, the scenes were shot with a statically positioned camera. The dialogs are probably meant to be sharp, crisp and challenging, but they turn out to be dull, repetitive and pretentious. Furthermore, the whole plot is so monotonous, pointless and narrow. It only repetitively talks about Paul's desire to stay abstinent despite Victor's challenges. And why did Victor challenge Paul in the first place? The filmmakers should have at least spend a little effort on character development. \"My Zinc Bed\" is a huge waste of time.",
         "Not quite sure what the film is trying to convey, but if it is implying that you have two choices - a life without passion in AA and life of passion and desire without AA and with active alcoholism, then that is incorrect and misleading. I don't understand why it is implying that joining AA to treat alcoholism is just a grim life of saying no to everything and denying yourself things out of fear of being triggered. That is not what AA is about. The goal is to be happy and functional. To flourish in all aspects of life. Some achieve it, some don't. The suggestion is to follow the tools of the program as fully as you can to achieve the maximum results. There's a reason they say \"stick around for the miracle\". People's lives improve in ways they never thought possible. Their lives get bigger. The grim life is either being an active alcoholic or gritting your teeth in abstinence but still being dysfunctional and miserable - a dry drunk. AA helps with much more than just stopping drinking. The real work begins after you stop the craving and stay sober. Then you use tools to maintain sobriety and deal with life \"on life's terms\". How can someone write about AA just by having friends in it, going to a few meetings or reading about it? If you don't get it, you don't get it. But it feels like someone saying probably all psychiatric medicine makes you a zombie and it's no life. That is not true either. Medicine can change and save lives. But you have to take it. Is this film positing that AA removes all possibilities in your life except a grim sobriety? It just isn't true. There is much joy, laughter, support and growth in AA. There is a whole syndrome behind alcoholism beyond drinking that is helped in AA: isolating, not asking for help, destructive behavior (\"character defects\"). Something feels very creepy in this film. As someone said elsewhere, if this film gives a suffering alcoholic a distrust of AA and causes them not to seek help, that would be an awful result.",
         "I missed this when it was on BBC2 last year because I forgot to set the video, or rather I messed up setting the video and recorded something else instead. It took till recently to get the chance to see it again and so I did. The film is based on a play about addiction and sees recovering alcoholic and poet Paul Peplow interviewing millionaire businessman Victor Quinn. The interview is a flop but it leads Victor to employ Paul in a job that Paul quickly learns is unimportant and not something he is suited for. As with the interview, Victor continues to needle Paul about his addiction and his supposed cure. Later Paul meets Victor's wife Elsa, herself a former addict, and the two fall for one another behind the back of this powerful man. Although I have not done a particularly good job of capturing it, this film did sound interesting to me and the cast especially seemed to offer much. At times the film appeared to be hitting this potential, with the tightly scripted and fast-paced dialogue that reminded me of David Mamet. Certainly the subject appeared to be of interest but yet somehow I found myself more interested in the occasionally pattern of speech rather than the characters or what was going on. In essence the subject of addiction and desire appears to be being discussed while also running it through the narrative but in reality it doesn't ever make it work as a discussion or a theme because it never feels real and never convinced me as a viewer to the point where I would have cared. We never really understand the motivations of the characters or the relationships between them – everything happens to fast or without any real reason, whether it is the probing/tempting of Paul by Vince or the sudden love between Paul and Elsa. This sort of atmosphere continues until the film reaches an end, which itself is quit unsatisfactory. This is not to take anything away from the performances though because they are roundly good and it is only the material that lets them down. Considine, Pryce and even Thurman all play their parts well and they deal well with the pace of the dialogue. In each of them there is enough to suggest to me that they knew their characters and understood what was happening behind and beyond the words – however this is not something that they are able to bring to the screen and, as such, the film still struggles even though it has an impressive trio in what is essentially a three-hander. It is a shame because the quality appears to be there and the potential is certainly there but the film cannot make it work. Maybe I would feel the same about the play, I'm not sure and may never know but certainly here nothing really ever rang true for me and the \"discussion\" in and around the nature of addiction wasn't strong or interesting enough to engage me, mainly because of the lack of any sort of clarity or focal point. Interesting for the flow of dialogue but flawed as a film.",
         "My Zinc Bed is a film written by David Hare, based on his play of the same name, which meditates on addiction, fidelity and friendship. It has a couple of very good performances, but a weak third lead and ambiguous themes keep it from achieving greatness. The film focuses on three people whose lives intersect over the course of a summer: Paul Peplow, Victor Quinn and Elsa Quinn, played by Paddy Considine, Jonathan Pryce and Uma Thurman respectively. Paul is poet and recovering alcoholic who is working in journalism to pay the bills. He is tapped to interview millionaire software magnate Victor, who eventually offers him a job. Victor is much more interested in Paul's alcoholism and his experiences with AA than in talking about himself, or in much else really. This causes some tension with Paul, particularly because Victor is very critical of the whole concept of AA, several times referring to it as a \"cult\" and claiming that those who attend meetings are \"addicted\" to the group. Things only get more complex when by chance Paul meets Elsa, Victor's much younger wife. The two develop an instant rapport, and end their first meeting with a passionate kiss, which Victor almost walks in on. Elsa herself was once an alcoholic, though she has eschewed the way of AA, apparently at the behest of her husband, and appears at least to be able to take the occasional drink with no ill consequences. As the film continues, the lives of these three become more and more entwined, which causes continued pain for all three. The wobbly third leg of this stool, however, is Uma Thurman. Her first problem is her accent, which is presumably Danish since Victor mentions meeting her for the first time in Copenhagen. The accent is clearly forced and seems to shift throughout the film, often sounding as if it might be Scottish or British. Perhaps straining for the accent retarded her usually competent acting abilities, because Thurman fails to reach the emotional levels necessary for her performance to be effective. The obvious gap between Pryce and Considine on the one hand and Thurman on the other makes for some uncomfortable viewing at times. Another issue, apart from the performances, is that the characters themselves are not particularly likable. It is possible that this was not a priority for the producers, but it is difficult to empathize with any of the three main characters. Paul is weak and inconstant. Pryce is manipulative at times and judgmental at others. Elsa is self deceiving and whiny. These people are interesting, but do not invite the viewer to invest himself in their fate. This lack of care for what happens to these three removes much of the power of the film's denouement. As for the exploration of alcoholism, and in particular the philosophy behind AA, the theme of the play could be best summed up by these words of Victor's, later repeated by Paul. \"If you were cured, you would be cured of the desire. And who wants to be cured of desire?\" This may reveal some inherent defects in twelve step programs, and AA in particular, but it leaves a lot unanswered and even unaddressed. Whether foregoing alcohol is worth the effort is at best skirted around. Paul is unable to write poetry when sober, and turns out brilliant verse when on the sauce, though he is then also subject to the humiliations of alcohol that he himself admits. Elsa as much as admits that her abandoning of AA has not cured her of alcoholism, and that she often spends nights in misery. What is being said here? It is not clear. This ambiguity leaves the viewer more confused than moved at the end of the film.",
         "I disagree that this film was a waste of time. This piece was glorious with so many depths and the most wonderful acting, how could anyone not come away from this piece without feeling challenged. I love Jonathan Pryce and he was at his usual best but I felt all three characters rose to the challenge and pulled you into there world. At the end I went to bed debating The whys and therefore of why they had all needed to meet and realised the cleverness of a torn mans need to know his loves real feelings. You realise that in all the sadness the alcohol is the true baddie and just want to watch on to see a happy ending for the forlorn poet. Uma Thurman is beautiful in her desperation and need to be loved and the ultimate love story in all this is truly sad but compelling. one for the greatest drama lists.",
         "I've been an avid movie fan for half a century and try to keep up with new releases. Tuesday is Neflix/Blockbuster online day IF I can find enough titles that interest me. I read a brief description of 'MZB' and noticed the cast...especially Paddy Considine and figured if Uma Thurman, Jonathan Pryce, AND Paddy had chosen to be in this movie, it MUST have some merit. I watched five DVD's before I put this one into the player. FIRST, I was astonished to see it was an HBO Film. HBO who doesn't miss and HBO who offers some of the best entertainment in the world. I was caught up in the plot during the first sixty seconds and my eyes stayed glued to the TV for the next seventy-two minutes. Perhaps a seventy-three minute film is not the usual box office fare, but this was one of the most brilliantly written, acted, and directed films I've seen all year. It could be Uma Thurman's best acting ever. Paddy Considine only gets better with each movie and has become one of my favorites. The problems of addiction to alcohol and love were equally expressed and portrayed by this wonderful small ensemble. David Hare, who wrote the stage play, adapted it for the movie and did a magnificent job. IF you're looking for sex and action, leave this one on the shelf of your favorite video store...but if you're a lover of serious drama...PUT THIS ONE ON YOUR LIST TO SEE! I can't wait to see new comments appear on this message board once the film has been noticed by the American audiences!",
         "Paul Peplow, a recovering alcoholic, is sent to interview rich man, Victor Quinn, who presides over a media company named Flotilla. Quinn, who has obviously learned about Paul's problem, tries to interest the younger man into having a drink with his lunch, something that Paul refuses. Quinn is curious about what the poet has gotten out of his treatment with A.A. The conversation does not lead into something a newspaper might like to publish, but Paul, evidently, interests Victor Quinn otherwise, when he offers him a job in his firm. As Paul begins to work for Quinn, he meets Victor's much younger, and beautiful wife, Elsa, a woman that the older man met at a bar while she was drunk in a sorry state. Victor liked what he saw and ends up married to the ravishingly beautiful woman. As the two meet late one day in the office, revelations about themselves come out. Paul and Elsa end up in a passionate moment as it seems they are attracted to one another. When Victor invites Paul to join he and Elsa at his home, Paul is a bit reluctant because his obvious interest in the wife. As the visit progresses Quinn wants to tempt Paul into trying one of his perfect \"Margaritas\", which the younger man resists, but the allure of the drink plays heavily on his mind and he accepts after the insistence of Victor. Needless to say, Paul begins a descent into his addiction, together with the no-win situation of ever having Elsa for himself. David Hare, whose play is the basis of the film, adapted the material for the BBC presentation, co-sponsored by HBO. Not having seen the play, we cannot offer any comments on what is shown in this treatment for the small screen. Anthony Page directed. The best thing in the film is Jonathan Pryce, whose take on Victor Quinn is excellent. Mr. Pryce, one of the best English actors of his generation, lends an elegant hand to the story. Uma Thurman, who speaks with a Middle European accent, makes an impression, as does Paddy Considine with his Paul.",
         "\"If you were cured, you would be cured of the desire, and who wants to be cured of desire?\" That one line from the movie, uttered by Jonathan Pryce, succinctly and brilliantly sums up why people with addictions keep falling of the wagon, and may make you wonder if it's possible that the addicted among us are in fact the ones who truly live and feel, to the point that it almost destroys them and those close to them. It's a tight, compact little movie, with solid, believable performances, especially from Paddy Considine and Jonathan Pryce. Uma Thurman puts in a good performance but seems to struggle with her European accent in parts, and holding her own against Considine's effortlessly convincing portrayal, thereby subtracting slightly from the overall impact of her efforts. Drugs and alcohol are the usual, but not the only addictions - Uma Thurman's character appears to be dependent on both alcohol and love. In spite of the slight inconsistencies of her performance, the weaknesses and struggles of her character spoke to me and left me in tears. Watch this if you've ever wondered about people who just can't say \"No\".",
         "I just want to state that I could not take my eyes off the screen until the very end of this fine drama. I had a vague recollection of having seen it before but fortunately no clear memory of how it ended. The ending actually is somewhat anti-climactic given the intensity of the previous scenes. Dialogue is quick: more often seen in a theatrical production than in a feature film. But this is not surprising given the source material. A true gem that took me out of time for just over an hour. Gee, I am short of the minimum ten lines ... So what else can be said? Well, Uma Thurman's accent was a bit odd but not enough to spoil the drama.",
         "Having read the poor rating that IMDb users gave this movie, it would be unjust of me to not chime in on this; I just felt that I had to say that this film deserved a much better score than it seems most people have given it here. If you require your movies to have explosions or nudity, then you won't like it; however if good acting and compelling dialogue that strives to touch upon deeper issues than most films dare to reach, then check this fine film out. Its' short run time flew by, leaving me wanting more from these 3 fine performers, and if any part of your life or of those you love has been touched by alcoholism I would say without reservation that it's a must see.",
         "staged play adapted to TV - always stirs up the mixed feeling - differences in all kinds and aspects and first of all, the target auditory. for me it is no wonder why it has got so low rating, confusion is the reason. the movie as well as the play, deal with one of the most complicated things in life - addictions and that is not just the case of merely a one specific kind - addiction to alcohol. i may only guess that it could be replaced with the other thing freely and still has the same meaning and sense - what is the nature of addiction, why we are addicted to something and the reasons of it. very often - i would not be exaggerating to say that practically always we have got the wrong ones, as it happens with one of the main characters - the poet. and here i just may lay my theory out, just as subjective as it can be. addictions are just the consequences of suppressed things in our own nature - it could be anything - feelings, emotions, wishes, willings, needs, various sorts of experiences and so on - you name it. you suppress it, you try to wipe it out, destroy, get rid of it and then you finally succeed, it would be most likely going to be replaced with something else - something much worse actually. and very often - yet again would not be a huge overstatement to say in all cases - it might lead to long way to self-destruction, total or near total elimination of any sense of living. i cannot say that for sure whether that movie or play succeeded to make that clear, i gave 10 out of 10 just because i believe that everyone who were engaged in making it tried to do their best to tackle with that notoriously sophisticated subject (well, the entire psychology was actually founded to explain it). and i may be mistaken but i can hardly remember a movie or a play that has dealt with more or less the same stuff. and much moreover of it i really enjoyed it much. the plot and the acting are much above the average - i believed them and felt empathy for the all of the characters. brilliant try but cannot be 100% certain if it was successful"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "BBC Films",
         "HBO Films",
         "Home Box Office (HBO)"
      ],
      "summaries": ["A recovering alcoholic becomes involved with his boss's wife, a former cocaine addict."],
      "budget": 0
   },
   "movielensId": 137110,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-08-27",
      "dvdReleaseDate": null,
      "directors": ["Anthony Page"],
      "runtime": 75,
      "movieId": 137110,
      "title": "My Zinc Bed",
      "mpaa": null,
      "actors": [
         "Uma Thurman",
         "Jonathan Pryce",
         "Paddy Considine",
         "Veronica Quilligan",
         "Olivia Poulet"
      ],
      "imdbMovieId": "1056101",
      "originalTitle": "My Zinc Bed",
      "genres": [
         "TV Movie",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A recovering alcoholic becomes involved with his boss's wife, a former cocaine addict.",
      "tmdbMovieId": 58075,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 3,
      "posterPath": "/zEhz3imSFRhCPp7HwrTFP4XBSbO.jpg"
   }
}