{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3687186",
      "video": false,
      "title": "Heaven Knows What",
      "recommendations": [
         172469,
         142106,
         174314,
         300176,
         40876,
         40562,
         324252,
         97406,
         15053,
         88052,
         365183,
         47889,
         253277,
         125034,
         102873,
         62006,
         82432,
         174376,
         26126,
         373453
      ],
      "backdrop_path": "/pNbSL1XEhg013TAEHjIexnFn9ho.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "581cfa9892514135d40016ac",
         "content": "**Homeless and drug addiction, with the backdrop of a little romance.**\r\n\r\nThis film reminds me the Al Pacino's 'The Panic in Needle Park'. The independent filmmakers Safdie brothers directed it that inspired by the real life story of Arielle Holmes, who also starred in the lead role. This is definitely a depressing film, seeing those faces, eyes, makes sick. But a very realistic film, kind of aimless plot, till the final quarter and then with a small twist, the tale comes to an end.\r\n\r\nI have seen it and if you ask me about the story, I say its hard to describe, but it can be only watched like a documentary film. Over ninety minutes, the film revealed the life of homeless people. Like from their day beginning to the nightfall, how they make it and their preferences. So it is not an inspiring film, though at least there's something you can learn about them.\r\n\r\nAfter knowing the theme, I thought there would be lots of violence like rapes, stealing, cops and maybe killing. Surprisingly, it was none of those, not exactly, except drug addiction and sometimes stealing to buy drugs. Looks like from this film, the actress got a breakthrough, particularly in her life. I hope its turnover from hereon. I appreciate the directors for that who made a difference in someone's life. Don't think it is a film for entertainment, watch it if you are interested in the documentary film. So it's not for everybody, but some will find it good or maybe decent.\r\n\r\n_6/10_",
         "url": "https://www.themoviedb.org/review/581cfa9892514135d40016ac"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harley",
               "gender": 1,
               "credit_id": "540f96010e0a261251000830",
               "name": "Arielle Holmes",
               "profile_path": "/zOixYGwi3v2bXbXiUR1YsOSMGkP.jpg",
               "id": 1362579,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ilya Leontyev",
               "gender": 2,
               "credit_id": "540f96100e0a261251000835",
               "name": "Caleb Landry Jones",
               "profile_path": "/a5RwSg8YN9JW0VZqekIbiJlLVhJ.jpg",
               "id": 572541,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Erica",
               "gender": 1,
               "credit_id": "540f961a0e0a26124e000860",
               "name": "Eléonore Hendricks",
               "profile_path": "/jFoOINkohB6sXWdSIb54M4EkvqC.jpg",
               "id": 53938,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mike",
               "gender": 0,
               "credit_id": "54db0c849251416195001167",
               "name": "Buddy Duress",
               "profile_path": "/8ONQ1A9dYiU8pFczU4BmPsduC2c.jpg",
               "id": 1425799,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Skully",
               "gender": 0,
               "credit_id": "54db0c8ac3a3682f24000ca5",
               "name": "Necro",
               "profile_path": null,
               "id": 1425800,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Isaac",
               "gender": 0,
               "credit_id": "59a7909ec3a3683ce600b62d",
               "name": "Isaac Adams",
               "profile_path": null,
               "id": 1879650,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Diana",
               "gender": 0,
               "credit_id": "59a790a692514157f600c3c6",
               "name": "Diana Singh",
               "profile_path": null,
               "id": 1879651,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Antoine",
               "gender": 0,
               "credit_id": "59a790b1c3a3683c8700c3b1",
               "name": "Benjamin Hampton",
               "profile_path": null,
               "id": 1879652,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Evan",
               "gender": 0,
               "credit_id": "59a790b992514157c600bf04",
               "name": "Manny Aguila",
               "profile_path": null,
               "id": 1879653,
               "order": 8
            },
            {
               "cast_id": 5,
               "character": "Tommy",
               "gender": 0,
               "credit_id": "540f96250e0a26125900088e",
               "name": "Yuri Pleskun",
               "profile_path": null,
               "id": 1362580,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Maynard",
               "gender": 0,
               "credit_id": "59a790cc92514157a500c335",
               "name": "Maynard Nicholl",
               "profile_path": null,
               "id": 1879649,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Brian",
               "gender": 0,
               "credit_id": "59a790d6c3a3683ce600b664",
               "name": "Brian Hodges",
               "profile_path": null,
               "id": 1879654,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Misty",
               "gender": 0,
               "credit_id": "59a790e3c3a3683c8700c3d8",
               "name": "Misty Mccall",
               "profile_path": null,
               "id": 1879655,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Marcos",
               "gender": 0,
               "credit_id": "59a790eb92514157c600bf3c",
               "name": "Mike Patellis",
               "profile_path": null,
               "id": 1879656,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "59a790f6c3a3683c7a00d61e",
               "name": "Russell James Peters",
               "profile_path": null,
               "id": 1879657,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Rasheed",
               "gender": 0,
               "credit_id": "59a79100c3a3683ce600b68b",
               "name": "Dash Privlej",
               "profile_path": null,
               "id": 1879658,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53de67220e0a265a900026fd",
               "name": "Benny Safdie",
               "profile_path": "/apFO0VfCE9pEd60WSukfJjIgiBT.jpg",
               "id": 227564,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53de672b0e0a265a8d00270d",
               "name": "Josh Safdie",
               "profile_path": "/7AtegMNFy7tOd226YCHyAAXmneA.jpg",
               "id": 129561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54db0c9b925141619b001056",
               "name": "Ronald Bronstein",
               "profile_path": null,
               "id": 227565,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55dc7a32c3a36865c000216f",
               "name": "Sean Price Williams",
               "profile_path": "/2NAYwfkuQ1p4i8gmzXOd464FnYr.jpg",
               "id": 1073579,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "55dc7d01925141699e0021af",
               "name": "Arielle Holmes",
               "profile_path": "/zOixYGwi3v2bXbXiUR1YsOSMGkP.jpg",
               "id": 1362579,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "55dc7d1e925141699e0021b1",
               "name": "Josh Safdie",
               "profile_path": "/7AtegMNFy7tOd226YCHyAAXmneA.jpg",
               "id": 129561,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55dc7d4e92514162c7002110",
               "name": "Benny Safdie",
               "profile_path": "/apFO0VfCE9pEd60WSukfJjIgiBT.jpg",
               "id": 227564,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55dc7d5692514162d700247c",
               "name": "Ronald Bronstein",
               "profile_path": null,
               "id": 227565,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55dc7d79c3a36865b80023ab",
               "name": "Sebastian Bear-McClard",
               "profile_path": null,
               "id": 1462979,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55dc7d8ac3a3680a46002acd",
               "name": "Oscar Boyson",
               "profile_path": null,
               "id": 1500310,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55dc7ddc92514162c7002126",
               "name": "Audrey Turner",
               "profile_path": null,
               "id": 1500311,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.065757,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 285024,
      "vote_count": 44,
      "budget": 0,
      "overview": "A young heroin addict roams the streets of New York to panhandle and get her next fix, while her unstable boyfriend drifts in and out of her life at random.",
      "similar": [],
      "original_title": "Heaven Knows What",
      "runtime": 94,
      "poster_path": "/edlo6REnoTEqSYVBO5woFwuhzMj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2015-05-29",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Benny Safdie",
         "Josh Safdie"
      ],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Arielle Holmes",
         "Josh Safdie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3687186/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZTkwYTNhODgtNDBkNC00NTVkLWExYzctNGI4Njg1ZmRiZGE3XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Arielle Holmes",
         "Caleb Landry Jones",
         "Buddy Duress"
      ],
      "reviews": [
         "I guess I'm writing this review after seeing the one and only other review. This film is actually really very good, and for what its showing: perfect. Time is different for some people. Those with heroin in their lives don't live as we do. For them time doesn't really exist. There is a flow and it is somewhat linear though quantum leaps here and there are possible at anytime. There is always need. The opening is a dream. One of Harley's perfect moments in 'time' smashed by a realisation. She has to kill herself for the man she loves? Combine this with Heroins ebb and flow and it becomes even more intense. Love unrequited but really Ilya loves Harley too... right? What will you do for love? Anything. What will you do for Heroin? Almost anything? The film flows through days and night though really we are just allowed to view their lives for a short train ride. The end is Malick in style - life just keeps on flowing. I read up a little on Arielle Holmes (Harley) - she has lived the lifestyle, and some parts of the film are based on her adventures! It's very realistic. Just watch it all, let it flow. Oh also, the use of modular synths and sound instead of voice (in parts) is very effective, the latter trying something new and it worked.",
         "Truly didn't expect anything out of this, which is why it was such a huge surprise. I don't think its flawless, but effective it surely is. I feel like its style is definitely going to out off a lot of people (quite a lot actually). I mean, even from the get-go it basically affirms the type of film it'll be and how it'll be presented, with its loud, throbbing score (which is both beautiful as an individual piece, but also really disturbing in the context of the film). The performances here are compelling, all of the main actors totally and fully committed. Arielle Holmes is a true talent though, what a fantastic performance. Raw and real and totally honest, no artifice or anything. This film is fully recommended.",
         "This is an incredible touching, intimate and stark film. You follow a young woman, who seems so fragile lost in a world we all fear filled with drugs, hopelessness and even more frightening: Love. We've all seen the passionate and outlandish arguments on the street between people that call it home, but we disregard it all as fleeting and inhuman. This film puts a human face to the people we turn away from so quickly. I commend the filmmakers for not making heroin sexy. It's a sad disease you contract that's taken three of my close friends. This film helps us better understand drug abuse and the people stuck in that cycle. It couldn't have felt more real.",
         "There are few films as unforgiving as Heaven Knows What. With its blistering soundtrack and rough in-your-face photography, you're either captivated or eyeing the exit. The Safdie brothers fictionalised retelling of Arielle Holmes life on the street, as played impressively by herself, is relentlessly bleak. The only joy is securing a dose of heroin. It doesn't keep track of names or days, just showing how she survives moment-to-moment. That kind of loose narrative thread void of character backstories can work if it holds together thematically, but Heaven Knows What isn't clear what it's trying to say besides showing the life of an addict. It latches onto hints of a theme of unrequited love, as demonstrated by Holmes' toxic relationship with her easy-to-loathe on-off-again boyfriend Ilya. Not that he has to be likable - the devastating first act where he encourages her to commit suicide is the film's finest stretch - but he's so loathsome that he drag the film down with him. Holmes has her own moments of venom, though it's balanced with vulnerability. Perhaps his purpose thematically is that he represents her relationship with heroin, but that's too on-the-nose and flimsy to bolster the film's quality. Instead, the film hinges on that docu-style commitment from both the directors and the cast. Certainly an emotionally exhausting experience with the aesthetics, I just wish it was more thoroughly explored on paper first. 7/10",
         "Very accurate portrayal of the life of NYC street kids. Has any underlying love story, but not your usual love story. Love the real feel it has to it. The casting was great. Arielle is going to be a star. It was nice to see many familiar spots in the city. I hope everyone gets a chance to see this. Has a little bit of everything.. violence, suicide, drugs, sex and hard style. What more could you ask for? Maybe a little drum and bass. Cudos to the actors and directors and everyone else involved making this. It was almost surreal watching this knowing several of the actors and knowing the lifestyle and then seeing it played out extremely realistic to how it actual was. Looking forward to the next movie Arielle is in to see what those acting chops can really do.",
         "\"Heaven Knows What\" (2014 release; 94 min.) brings the story of Harley and her friends. As the movie opens, we see Harley making out with her boyfriend Ilyou, only later to see her beg of him in the library \"what can I do for you to forgive me?\". Ilyou isn't moved and in fact eggs Harley on to kill herself if she wants to prove to him how much she loves him. Much to Ilyou's shock and horror, she slits her wrist right in front of him. An ambulance is called and Harley survives. At this point we're not even 15 min. into the movie. To tell you more might spoil your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: this movie is directed by bothers Ben and Joshua Safdie, who have made plenty of previous films (usual shorties), and is based on Arielle Holmes' book \"Mad Love in New York City\". Mad indeed! I had a hard time relating to the characters, and simply couldn't understand what this movie was about, other than Harley and her friends talking, arguing, shooting up, and repeat. After an hour or so, I simply gave up trying to care of understand what this incomprehensible mess was trying to get at. I don't mean to sound harsh, but it's been a long time that I have felt so utterly disconnected from a movie (and I see LOTS of movies). I got the sense that the Safdie brothers were going for that same vibe usually associated with Harmony Korine (\"Kids\", \"Spring Breakers\"), except that they lack the vision which Korine lays out in his movies (and you may or may not agree with his vision, but he has one). \"Heaven Knows What\" opened without any pre-release fanfare or advertising at my local art-house theater in Cincinnati last week. As a fan of indie movies, I took a flyer on this and, despite not knowing much of the movie, I went to see this a few days ago. The early evening screening where I saw this at turned out to be a private screening, as in: I was literally the only person in the theater. Had I known more about the movie beforehand, it surely would've been a completely empty screening. As it turns out, I made a mistake going to see this movie as it's not worth seeing. That doesn't mean you have to make that same mistake. There are so many deserving indie movies out there for our viewing pleasure. \"Heaven Knows What\" is not one of them.",
         "I began this movie in a state of repulsion: the characters live a stunted, grotesque life on the streets of New York. We are forced to bear witness to their pathetic lives, squabbles and desperate lust for drugs. However, I was struck by how strongly I felt about it. I realised the performances were raw, and without artifice, and brilliant. And I was being forced to consider a group of people I would usually shy away from, and reject without a moment's thought in real life. Characters come and go in a dreamy timeless stream of events. They are like wayward children: showing concern for each other's wellbeing one moment and scream obscenities at each other the next. They loudly proclaim tales of valour and adventure, eager for attention. Mike, ironically, lists the lethal dangers of driving on the back of a motorcycle as Harley rides around with a stranger. Ilya wanders up to Harley while she's listlessly having sex with someone in the gutter. Harley is vaguely entertained by a man doing tricks on a motorcycle. Ilya harasses Harley days after encouraging her to slash her wrists. They are dirty, mean, angry, violent, overly dramatic, desperate and lost. Arielle Holmes bring a fresh earnestness to the role of Harley. She is full of contradictions: vulnerable and hard, caring and disloyal, hopeless and hopeful. You can't help but look for signs of life, and potential in her eyes. Harley hints that Ilya was the reason she became a junkie. Her world revolves around her infatuation with Ilya, and her mind-numbing obsession with heroin. \"Don't you want to be your own person?\" Mike asks her. No. She is a shell of a person. There appears to be no hope of redemption for Harley. If you're a fan of great true-to-life story-telling and like a good art house flick, this is an excellent choice. The simplicity of these people belies a powerful story.",
         "Although it follows the lives of a group of young, homeless heroin addicts in New York, this deeply unsettling film is far removed from the typical Hollywood \"junkie flick.\" I have known people like the characters it depicts, and I was immediately struck by the film's raw authenticity. Only later did I learn that the directors hit on the idea for the film after befriending (becoming infatuated with?) Arielle Holmes, the lead actor who was then living on the streets; they encouraged her to write about her experiences, paying her by the page, and eventually convinced her to star along with her friends in a film adaptation of her writing. Despite what has been charitably described as a \"nano budget,\" \"Heaven Knows What\" is extremely well made. The score creates a sense of unease, and every shot in the film is expertly framed.",
         "This is one of the worst films I've ever watched. I cannot believe they made a film on this topic for a start. They then managed to top that with one of the worst storyline and some of the strangest characters ever. This is a truly strange film from start to finish where none of the characters are remotely likable. Truly a mess and utterly dreadful from start to finish. I cannot believe how highly rated this film is, absolutely shockingly bad. Stay well away is my suggestion. Nothing good about this film. Would give it 0/10 if I could.",
         "This film reminds me the Al Pacino's 'The Panic in Needle Park'. The independent filmmakers Safdie brothers directed it that inspired by the real life story of Arielle Holmes, who also starred in the lead role. This is definitely a depressing film, seeing those faces, eyes, makes sick. But a very realistic film, kind of aimless plot, till the final quarter and then with a small twist, the tale comes to an end. I have seen it and if you ask me about the story, I say its hard to describe, but it can be only watched like a documentary film. Over ninety minutes, the film revealed the life of homeless people. Like from their day beginning to the nightfall, how they make it and their preferences. So it is not an inspiring film, though at least there's something you can learn about them. After knowing the theme, I thought there would be lots of violence like rapes, stealing, cops and maybe killing. Surprisingly, it was none of those, not exactly, except drug addiction and sometimes stealing to buy drugs. Looks like from this film, the actress got a breakthrough, particularly in her life. I hope its turnover from hereon. I appreciate the directors for that who made a difference in someone's life. Don't think it is a film for entertainment, watch it if you are interested in the documentary film. So it's not for everybody, but some will find it good or maybe decent. 6/10",
         "this movie was very entertaining for me to watch.it made me cringe which turned me off from it, but something about its authenticity attracted me immensely. I enjoyed every minute of it even at the dullest moments. the realness and new york essence, was very relate able and i found myself drifting into my own alternative universe while watching it... maybe because i was really baked. anyway this movie is accurate and exposes a very dark surreal world that i have been peripherally exposed too. i enjoyed this movie a lot. To be honest the music and cinematography really made it for me, along with the gore factor, and plot. i think Ariel Holmes cud get it and maybe Ariel pink too... and that tall Safdie bro. anyway Im saying this movie is good, actually great, but To be honest the first time i saw it i was a little confused... and actually didn't really like it ... actually i saw it with my boyfriend in theaters... and i secretly hated it and felt really weird explaining why i hated it. i didn't hate the movie really, just the ending felt incomplete and arbitrary to me, then time passed. i tor rented it re watched it and was like \"WOW!\" this movie is str8 pi ff. i understood the ending and the movie more. note to self don't do drugs before seeing obscure artsy movies about doing drugs.... :-/ finally, if your going to see this movie, you should be some 1 who Can Deal with reality, syringes, blood, guts, emotions, paleness, concrete, broken glass, and soggy sleeves.",
         "If you are interested in the life of heroin addicts, Heaven Knows What should be for you. Brother directors, Ben and Joshua Safdie, discovered the film's star, Arielle Holmes, a heroin addict, panhandling on the streets and encouraged her to write her life's story down on paper. Holmes along with screen writing partner, Ronald Bronstein, wrote the script and Holmes stars as Harley, the film's protagonist. Bronstein has a supporting role as Skully who urges Harley to break up with her boyfriend Ilya, after Harley slits her wrists at Ilya's behest (he declares that he has no interest in dating her anymore). Shot in documentary style, the plot is rather lugubrious and has an unrelenting texture. In other words, this ain't easy to watch! We follow Harley after she shacks up with Mike, another addict and they spend time attempting to obtain money to support their habits (the usual means include of course panhandling, shoplifting and stealing). Mike gets into a fight with Ilya in Central Park and Ilya stabs him with a makeshift weapon but soon afterward Harley tells Mike that she's still crazy about Ilya. After Harley saves Ilya from an overdose, they decide to take a bus to Florida but Ilya abandons her on the way down and ends up consumed by a fire inside a vacant house. Nothing very much dramatic occurs at the denouement: Harley returns to NYC and watches Mike inside a fast food restaurant, as he boasts to his friends. There's not much more to tell here. The Safdies have done well here in bringing us Holmes' gritty narrative. But after a while, the actions of the principals mimic one another to the point where we're kind of happy it's all over. Holmes must be commended for overcoming her heroin addiction and now trying to break into the movie industry (probably harder to do than overcoming a heroin addiction!). For her next role, I'd like to see Holmes take a role that doesn't involve drugs. Then we'll see if she can really act instead of just playing herself!",
         "Just saw this on Netflix, and I thought it was extremely well done, but it just didn't seem like most of the things that happened in the film could have taken place in the Manhattan of today. Too much of it took place right in the open, and I don't see how that could go on in the Police/Tourist State Manhattan has become, as the result of 24 years of the dictatorships of Giuliani and Bloomberg. A film like Panic In Needle Park was done before the gentrification of Manhattan, so its Manhattan setting was quite believable, but the author of the 'book' this was based on, Ms. Holmes, said in an interview that most of the incidents this was based on were taken from her life in Bayonne, NJ. The brothers that made this flick met Ms. Holmes on the subway while she was doing some type of apprenticeship in the Diamond District. I suppose that Ms. Holmes decided to set, \"Mad Love in NYC\" in NYC, because who would care about a book called \"Mad Love in Bayonne\"? I had just seen \"My Beautiful Broken Brain\", and it seems to be a trend of having beautiful women who have gone through bad ordeals, starring in films about said ordeals. If both of these movies were about unattractive women, I doubt they would have had any marketability, hence probably wouldn't be made, but hey, it worked in my case; I wouldn't have watched either movie if their stars weren't so gorgeous!",
         "There are a lot of movies about drugs addiction. Heaven Knows What (2014) adds a new chapter to them. It is a small film, which shows the daily life of a number of addicts in a realistic manner. In addition to the struggle for life, love plays an important role. Heaven Knows What manages to touch the very soul, is fascinating and intriguing. And also acted well (or not) by real addicts. Heaven Knows What is extra special because of the story behind it. It is the story of Arielle Holmes. On her 12th she already smoked crack, because it was quite normal in her environment. She soon lived on and from the street, day to day, bag to bag. Filmmaker Joshua Safdie, drifting through the city in search of inspiration, came in contact and was fascinated by her. He asked her to write down her story. Every day one page. On loose pieces of paper. Later, he handed her his laptop (which was delivered back neatly by police ....). This is the way a book is created, which forms the basis for this film. Besides the story of her addiction, she tells the story of her love for Ilya. Ilya is played by the only professional actor (Caleb Landry Jones), because the real Ilya died during the shooting. In the film he falls asleep after a shot and his room catches fire. In the movie Harley (Arielle Holmes) attempts to commit suicide as proof of her love for him. Their relationship is not running very well, which is caused by the drugs. You always have a different priority. So Arielle Holmes also plays the lead role and she appears to be a natural talent. At the time of filming and writing the book she was hooked. Now she is out of rehab and has two other films on the role. It looks like a variant of the American Dream. From addict to actress. Arielle Holmes declared in an interview that the life of an addict also has its good sides and that she has trouble with ordinary life. No responsibility, living in the moment, just focused on eating, drinking and drugs. Little hassle and a lot of freedom. I can somewhere imagine that. Yet in the end it seems to me particularly stressful to start each day from scratch. It becomes harder every day to find relaxation. You need more and bigger shots and it becomes increasingly difficult to get the money. A negative spiral, which is hard to breakthrough. I wonder how she will develop because she's only 22 and not very long clean. If she can keep seeing things from two sides, she will manage. Because besides its authenticity a strength of Heaven Knows What is that it glorifies nor condemns."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Hardstyle",
         "Iconoclast"
      ],
      "summaries": ["A young woman struggles to reconcile her love for her boyfriend and for heroin, as she finds out that suicide is the only way for her boyfriend to forgive her for her misdeed."],
      "budget": 0
   },
   "movielensId": 137296,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-05-29",
      "dvdReleaseDate": null,
      "directors": [
         "Ben Safdie",
         "Joshua Safdie"
      ],
      "runtime": 94,
      "movieId": 137296,
      "title": "Heaven Knows What",
      "mpaa": "",
      "actors": [
         "Arielle Holmes",
         "Caleb Landry Jones",
         "Eléonore Hendricks",
         "Buddy Duress",
         "Necro",
         "Isaac Adams",
         "Diana Singh",
         "Benjamin Hampton",
         "Manny Aguila",
         "Yuri Pleskun",
         "Maynard Nicholl",
         "Brian Hodges",
         "Misty Mccall",
         "Mike Patellis",
         "Russell James Peters",
         "Dash Privlej"
      ],
      "imdbMovieId": "3687186",
      "originalTitle": "Heaven Knows What",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "Kw48KXuMxMA",
         "AVGNt5Y-foI"
      ],
      "plotSummary": "A young heroin addict roams the streets of New York to panhandle and get her next fix, while her unstable boyfriend drifts in and out of her life at random.",
      "tmdbMovieId": 285024,
      "avgRating": 3.54167,
      "releaseYear": "2015",
      "numRatings": 24,
      "posterPath": "/edlo6REnoTEqSYVBO5woFwuhzMj.jpg"
   }
}