{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "classical music",
            "id": 5783
         },
         {
            "name": "shapes",
            "id": 204091
         }
      ],
      "imdb_id": "tt0029350",
      "video": false,
      "title": "An Optical Poem",
      "recommendations": [
         126194,
         147676,
         175461,
         118014,
         126124,
         44357,
         176298,
         175457,
         127817,
         94512,
         126204,
         47466,
         203091,
         125602,
         117565,
         164596,
         146987,
         144674,
         190081,
         184894
      ],
      "backdrop_path": "/wFtE8um84qETjkKMC2Vsyihgxda.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4cd49251416c911018c5",
            "name": "Oskar Fischinger",
            "profile_path": "/ctFgXCEeyv0BTQMMVPgfhlEbk83.jpg",
            "id": 29549,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 0.906101,
      "production_countries": [],
      "id": 193652,
      "vote_count": 17,
      "budget": 0,
      "overview": "A dance of shapes.",
      "similar": [
         756,
         279,
         310593,
         31900,
         13932,
         108,
         6619,
         2054,
         9030,
         75964,
         1553,
         121879,
         26701,
         16373,
         4267,
         10541,
         221302,
         426410,
         1294,
         31148
      ],
      "original_title": "An Optical Poem",
      "runtime": 6,
      "poster_path": "/pokgqXg7jOX2NtAd7naE6ExpvoA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1937-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oskar Fischinger"],
      "runtime": 6,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029350/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Just about anyone who's ever made a music video \u0097 especially an abstract one \u0097 owes a debt of gratitude to Oskar Fischinger. This short film is a charming rendition of Liszt's Second Hungarian Rhapsody set to a dazzling series of colored dots, lines, flashes and vivid visual effects that often look like a Piet Mondrian painting come to life. Paul Marquardt's often cheeky orchestration \u0097 far different from the one usually heard \u0097 adds a quite inventive series of tonal effects to the film that only underscores the rambunctious appeal of Fischinger's animation. I remember seeing films like this from the 1960's and not realizing anyone had done anything this imaginative with the same format thirty years earlier \u0097 and I can't for the life of me imagine what unsuspecting moviegoers who caught this in 1937 on a program headlined by an MGM feature of the period made of it!",
         "What makes me chuckle about this short film is that MGM actually financed it! Who'd have thought that such attitudes were ever present at the big studios? The intertitle at the start calls the movie a \"scientific experiment\"*, gawd those guys were dumb. Anyway they let Fischinger get on with his business so I can't complain. The second time I watched it I really was dumbfounded by the MGM logo, for once, ars gratia artis actually meant something! Anyway the film is a visual accompaniment to Liszt's Hungarian Rhapsody no.2. Fischinger chose his music really well because there are lots of sea changes within the piece that allows him to do something totally different at the mood switches. He uses coloured paper circles and stop motion animation, to create a geometrical ballet. He must have done a lot of work because the movements are all very smooth. In fact it's really a masterpiece of technical craft and almost unbelievable how synchronised the animation is to the music. It brought a big smile to my face and that's really rare. * \"To most of us, music suggests definite mental images of form and colour. The picture you are about to see is a novel scientific experiment. Its object is to convey these mental images in visual form\"",
         "The tagline for Disney's 'Fantasia (1940)' read: \"Hear the pictures! See the music!\" This is, in effect, what Oskar Fischinger was doing with his animation – communicating music to the deaf, giving visual life to music using colours and geometric patterns. His approach, though later imitated by Walt Disney, was largely appreciated outside the mainstream. However, 'Allegretto (1936)' and 'An Optical Poem (1937)' were both commissioned by big studios – Paramount and MGM, respectively {however, the former film was inconceivably stifled into a black-and-white release}. It was a little novel, I'll admit, to see such an abstract cartoon presented under the MGM banner, and, indeed, it seems that the studio was understandably cautious; they bizarrely introduce 'An Optical Poem' as a \"scientific\" experiment. Fischinger's film uses patterns of oscillating circles, paper cutouts dangling from invisible wires, synchronised to Franz Liszt's \"Hungarian Rhapsody No. 2.\" The animation itself resembles a journey through outer space. The orbiting circles are akin to moons orbiting planets, planets orbiting the sun, and there's an unmistakable image of a comet hurtling across the night sky. The overall effect of the space-themed visuals and accompanying classical musical is not all that dissimilar to Kubrick's use of the \"Blue Danube\" waltz during '2001: A Space Odyssey (1968).' Fischinger seems to be suggesting that to fully articulate such magnificent music is beyond the grasp of our earthly minds – to do so, we must utilise objects far beyond our mortal scope. Most incredibly of all, Fischinger reconstructed these great objects using little more than coloured paper and wire.",
         "After years of favoriting this on YouTube, I finally watched this M-G-M/Oskar Fischinger colored paper-animated short there. Done to the music of Franz Liszt's \"Second Hungarian Rhapsody\" (the same music Bugs Bunny would play in Rhapsody Rabbit), we see lots of circles, rectangles, and other shapes in space moving and appearing/disappearing to that music. Quite fascinating to watch and maybe it may have been the inspiration for Walt Disney's later feature length Fantasia a few years later. This seemed to be Fischinger's only film work for a major studio. It certainly seemed possibly too avant garde for the tastes of the public of the time! How many even know about this one? Anyway, that's a recommendation for An Optical Poem.",
         "\"An Optical Poem\" is an almost 80-year-old animated film that runs for 6 minutes. Oskar Fischinger made this one for MGM shortly before World War II and if you know a bit about animation, you will certainly have heard of Fischinger. He made films already long before color and sound entered the scene, but he uses both to a significant amount for his work here. It felt somewhat strange to see the MGM lion early on for a film like this I must say. Basically, it is really all about the music here. Fischinger clearly made this film with the premise of adjusting his \"plot\" and animation to what we hear in Liszt's piece, which is exactly the other way around from what soundtracks usually work. The film gets made, then the soundtrack gets added. Oh well, he couldn't use an original soundtrack and make it work for his animation could he? Anyway, I thought this was a mediocre watch at best and I always find it funny when i see people give 9 or 10 stars here. Do you really think this was as good as your very favorite films? As for me, absolutely not and I do not recommend watching \"An Optical Poem\".",
         "I appreciated the soundtrack more than the abstract art, patterns of balloon-shaped dots that dance across the screen for six minutes while the 2nd Hungarian Rhapsody explodes with musical sounds. After a few minutes, the short becomes too repetitious to be really novel. In fact, it's the sort of thing the Disney studio was already experimenting with and led to several short subjects, as well as the full-length feature \"Fantasia\" later on, combining classical music with unique animation. But this was 1937 and the comparison to Disney was not made at the time. Nevertheless, I found it monotonous to watch and not unique enough, except for the exhilarating classical music performed.",
         "Optical Poem, An (1937) *** (out of 4) This 6-minute animated short is considered by many to have been the inspiration for Disney's FANTASIA. This film contains various animated images being played to Franz Liszt's Hungarian Rhapsody No. 2 and makes for quite a ride. In his day, director Fischinger was pretty much overlooked and after during down a job offer from Disney, he would eventually be fired by both MGM and Paramount. His animation career never took off in the movies but years later his work began to be reevaluated and today's he's considered one of the best. This, considered his best film, is pretty strong in terms of its visual style even though it's rather simple. A blue background with various circles, squares and other images. The film moves along quite well, although the six-minutes do start to get a bit long towards the end.",
         "This is from a collection of art films entitled \"Unseen Cinema: Early American Avant-Garde Film 1894-1941\". Unlike most of the other films in this set, this one is from a major studio--MGM. Somehow Oskar Fischinger was able to convince the MGM folks to sponsor this art film that consists of hundreds of paper cut-outs that are hung from invisible wires and which are shot, one frame at a time---all in synchronization with music from Franz Liszt. It's all in color and it's amazing that such a non-commercial sort of project was funded by this or any studio. While it's not at all fun, it is an amazing film to watch. Not only is it wonderfully synchronized, but works so very well. It's all very hypnotic and amazing--even when you see it today. It must have taken forever practically to make this--and perhaps this is why this is Fischinger's only film. Strange but well worth seeing."
      ],
      "genres": [
         "Animation",
         "Short",
         "Music"
      ],
      "productionCompanies": [
         "Loew's",
         "MGM Cartoon Studio",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": ["A dance of shapes. A title card tells us this is an experiment in conveying the mental images of music in a visual form. Liszt's \"Second Hungarian Rhapsody\" is the music. The shapes, all two-dimensional, are circles primarily, with some squares and rectangles, and a few triangles. The shapes move rhythmically to the music: receding from view or moving across the screen. Red circles on a blue background; light blue squares; white rectangles. Then, a red background of many circles with a few in the foreground. Red gives way to blue then to white. Shapes reappear as Liszt's themes re-occur. Then, with a few staccato notes and images, it's over."],
      "budget": 0
   },
   "movielensId": 137303,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-01-01",
      "dvdReleaseDate": null,
      "directors": ["Oskar Fischinger"],
      "runtime": 6,
      "movieId": 137303,
      "title": "An Optical Poem",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0029350",
      "originalTitle": "An Optical Poem",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "A dance of shapes.",
      "tmdbMovieId": 193652,
      "avgRating": 2.5,
      "releaseYear": "1937",
      "numRatings": 5,
      "posterPath": "/pokgqXg7jOX2NtAd7naE6ExpvoA.jpg"
   }
}