{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nudity",
            "id": 2483
         },
         {
            "name": "deputy",
            "id": 4204
         },
         {
            "name": "salesman",
            "id": 10332
         }
      ],
      "imdb_id": "tt0052920",
      "video": false,
      "title": "The Immoral Mr. Teas",
      "recommendations": [
         5744,
         5719
      ],
      "backdrop_path": "/a9YlDb8zmctkoNS1scKPeyCz4gU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Mr. Teas",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081457",
               "name": "Bill Teas",
               "profile_path": null,
               "id": 44592,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "The Waitress",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808145b",
               "name": "Ann Peters",
               "profile_path": null,
               "id": 44593,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "The Dental Assistant",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808145f",
               "name": "Marilyn Wesley",
               "profile_path": null,
               "id": 44594,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "The Secretary",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081463",
               "name": "Michele Roberts",
               "profile_path": null,
               "id": 44595,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "The Beach Beauty",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081467",
               "name": "Dawn Danielle",
               "profile_path": null,
               "id": 44596,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Audience Member",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808146b",
               "name": "Don Cochran",
               "profile_path": null,
               "id": 44597,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Burlesque Announcer",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808146f",
               "name": "Peter A. DeCenzie",
               "profile_path": null,
               "id": 44570,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Narrator",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081473",
               "name": "G. Ferrus",
               "profile_path": null,
               "id": 44598,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "The Therapist",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081477",
               "name": "Monica Liljistrand",
               "profile_path": null,
               "id": 44599,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Audience Member",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808147b",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Aufience Member",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808147f",
               "name": "Eric 'Mick' Nathanson",
               "profile_path": null,
               "id": 44600,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Nude in Window",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081483",
               "name": "June Wilkinson",
               "profile_path": "/tBPffJDvfH9Y311bOftZeHb52MT.jpg",
               "id": 44601,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081429",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808142f",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081435",
               "name": "Edward J. Lakso",
               "profile_path": null,
               "id": 16062,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808143b",
               "name": "Peter A. DeCenzie",
               "profile_path": null,
               "id": 44570,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081441",
               "name": "Edward J. Lakso",
               "profile_path": null,
               "id": 16062,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081447",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808144d",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081453",
               "name": "John F. Link Sr.",
               "profile_path": null,
               "id": 44591,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.510798,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5648,
      "vote_count": 9,
      "budget": 0,
      "overview": "Mr. Teas is a door to door salesman for dentists' appliances. Everywhere he goes he encounters beautiful \"well-developed\" nude women, which of course stir his interest. The only sound in the film is the voice of a narrator and a very monotonic musical theme played on the clarinet or some similar instrument.",
      "similar": [
         88,
         80752,
         9946,
         2770,
         9352,
         4247,
         4248,
         112160,
         81774,
         634,
         138697,
         106646,
         1278,
         1690,
         979,
         28468,
         567,
         1948,
         27,
         1813
      ],
      "original_title": "The Immoral Mr. Teas",
      "runtime": 63,
      "poster_path": "/3PUm9ikqfnztQUNKfow7utsX9Zi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pad-Ram Enterprises",
         "id": 1942,
         "origin_country": ""
      }],
      "release_date": "1959-01-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Russ Meyer"],
      "runtime": 63,
      "synopsis": null,
      "writers": [
         "Edward J. Lakso",
         "Russ Meyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052920/",
      "coverLink": null,
      "actors": [
         "Bill Teas",
         "Ann Peters",
         "Marilyn Wesley"
      ],
      "reviews": [
         "This is Russ Meyer's first venture into stimulating pleasantly adult films\u0085 For 1959, it was a big sensation\u0085 By today's standards, however, it is quite dull... It is a difficult film to rate because it is so delightful and adorable, but the story is almost nonexistent and certainly dated\u0085 The story is about a dirty-minded voyeur... Through the course of a day, he sees a number of good-looking, big breasted ladies, and tries to attract them for long periods of time... On the weekend, he goes to the beach where he comes across a photographer and a topless model\u0085 Russ Meyer was very careful not to place his characters in sexual situations, but concentrated on rousing the audience\u0085 Mr. Teas finds himself with a nude female analyst, for example, but does not try to seduce her\u0085 Such tease was a matter of the film's survival... For the very moment nudity turned into a sexual encounter, it would have certainly been censored\u0085",
         "Having spent his WW II military duty wisely, obtaining formal training in both photography and cinematography (ostensibly to document war scenes), Russ Meyer spent the intervening decade trying to gain foothold in Hollywood, contributing connecting footage for THE JAMES DEAN STORY, a pseudo-documentary rushed into production to pay homage to - or cash in on, depending one's views of mankind's moral fiber - the recently deceased iconic actor. Since such did not automatically lead to other assignments, Meyer made his own luck on the shady side of town, shooting sleazy B movies like Louis B. Appleton's THE DESPERATE WOMEN and striptease shorts like THE FRENCH PEEP SHOW recording the stage performance of legendary Tempest Storm for posterity. Meanwhile, nudist camp or \"naturist\" movies (as they were apologetically acknowledged) like Max Nosseck's 1954 GARDEN OF EDEN and - on the other side of the pond - Charles Saunders' NUDIST PARADISE had struck a blow for the legalized exposure of the unfettered female form, albeit in a resolutely non-sexual context. This in no way deterred audiences who couldn't care less about the supposed health benefits of \"au naturel\" sunbathing but merely came to ogle what was yet to become known as T&A. Nobody's fool when it came to spotting a money-making venture ahead of everyone else, Meyer simply went one step further, taking the nudity out of the family-friendly communal context and brazenly relocating it within everyday situations (though still dissociated from eroticism), giving birth to the short-lived \"nudie cutie\" sub-genre which begot THE ADVENTURES OF LUCKY PIERRE by Herschell Gordon Lewis and David Friedman (another eagle-eyed trend watcher and band wagon hopper) and NOT TONIGHT, HENRY from Ted Paramore, the man who eventually became hardcore mogul \"Harold Lime\". For the sake of historical accuracy however, giving credit where it's due, Russ got there first, kick-starting an unparalleled carnal cinematic career in as much as being the recipient of considerable critical praise long before its author's passing. The simple set-up for THE IMMORAL MR. TEAS has Meyer's army buddy Bill Teas playing a naive delivery man in dental appliances, faced with the temptations personified by the provocatively attired yet unattainable women he encounters on his daily route like the dentist's assistant who gives new meaning to the term \"plunging neckline\" and an absent-minded but tight-sweater-ed coffee shop waitress. Relaxing on a secluded strip of beach after a hard day's work, he spies on a glamor photographer convincing bikini-clad model Dawn Danielle to pop her top. A dose of laughing gas as part of root canal treatment, which must surely be considered some sort of fringe benefit given his line of employment, equips Mr. Teas with the uncanny ability to see through ladies' clothes as they obliviously go about their business ! Hence the previous teasing finally pays off and although (or precisely because) the girls' actions while naked are casual and devoid of any overt eroticism, the impact on audiences of the day must have been substantial. Meyer counter-balances these \"ignorant\" skin displays with situations where nudity would more naturally occur such as a stripper strutting her stuff at a house of burlesque (watch out for the director's cameo as an audience member) and even the odd jokey juxtaposition like cutting from a fruit stand overflowing with ripe melons to a headless shot of the ample wares - probably the sole set up to Meyer's subsequently well-documented taste in size - of popular British nude model June Wilkinson who went on to star in saucy '60s favorites as Doug Fowley's delirious MACUMBA LOVE and Harold David's CAREER GIRL along with major studio risqué fare like Albert Zugsmith's THE PRIVATE LIVES OF ADAM AND EVE and the Francis Ford Coppola-lensed inserts for the German THE BELLBOY AND THE PLAYGIRLS. While the character of Mr. Teas was conceived as a kind of naughty version of Jacques Tati's revered Mr. Hulot personage, most of the intended comedy falls flat due to poor timing, a rare exception provided by the scene in which an apparent prostitute literally tries to talk our beleaguered anti-hero out of his rumpled overalls, only to have her turn out as a housewife with too much time on her hands who just wants to do the Good Samaritan thing by ironing his clothes, much to his obvious disappointment ! Correctly if unceremoniously photographed by Meyer, who would flex his artistic muscles far more conspicuously on subsequent outings, the movie was shot without live sound. Instead, it has hilariously overblown narration - soon to become a directorial trademark - by prolific TV writer Edward J. Lakso who rather astonishingly also supplied an insanely catchy theme tune which should grate on your last nerve well before fade-out. Aside from never being particularly funny, the surprisingly extensive nude scenes in flick's second half make it hold up remarkably well half a century down the line. True, the rating on this one's a bit tricky, quite generous in light of the film's intrinsic qualities. The tremendous historical importance of Meyer's pioneering effort should not be underestimated however. Nudies gave way to \"roughies\" and \"ghoulies\" as the '60s progressed, mutating and evolving into the suddenly socially acceptable theatrically screened soft- and hardcore adult movies of the following decades.",
         "This is Russ Meyer's debut 1959 feature, a nudie movie typical of similar films of the time. For the brief 61 minutes running time, Mr. Teas wanders about his daily business as a dental supplies salesman, ogling improbably-dressed (for the time) receptionists, dental assistants and waitresses without a care that he might get caught (he never does). Amusingly, he usually does this with his pushbike at his side and his clipboard in his hand. Occasionally, he daydreams of more erotic situations where the girls are completely nude (but never seen full frontal of course, this is the fifties). These fantasies begin and end with an overlaid multicoloured swirl and a boingy sound effect. Seemingly though, he never wants to do more than look and pull silly faces. There is no sex here, Teas never gets to touch any of these girls, undoubtedly due to the limitations of what could be shown in a releasable film of the time. The women pose and undress but do nothing more racy than that. The pace is very sedate, nothing happens for five minutes at a time, we just see Teas riding his bike or getting the bus. Meyer fans used to the highly pneumatic girls in his later films might find the rather more conventionally-shaped women here disappointing, but they are generally reasonably good looking. The direction sometimes exhibits Meyer's trademarks, rapid cuts, cleavage close-ups and tilted angles, but is far more conventional than his later work. There is no dialogue here, just a voiceover that pops up from time to time to explain a few extraneous details. Overall, this is a sweet, meandering movie, a bit like a Jacques Tati film but with less jokes and frequent nudity. The humour comes in patches, sometimes it is intentional, sometimes not. Seeing Teas spying on an undressing lady virtually right in front of her eyes provides some daft laughs. Watch out for Meyer himself as a patron in a burlesque club, and June Wilkinson in a role which requires nothing more of her to be seen than her naked breasts at a window. 6/10.",
         "The existential Mr.Teas represents to me: avant garde 'Beatnik Art' so well parodied in the pages of 'Playboy' magazine circa.1959.He is a free-thinker: 'searching' for the inner meanings & thoughts subdued by the forced conformity of the 1950s.The mental undressing of the ladies he encounters is his statement of individuality in the doomed pluralist mediocrity of the San Francisco he inhabits. Mr Teas retreats from the disillusioned dentist delivery-man to his licentious alter-ego; fishing in the lagoon , cavorting in 'The Raincheck Room' & a diner with the waitress.Then with 'Nana',a sensational burlesque dancer that even Russ Meyer himself applauds vigorously. He seems to represent the repressed everyman in all of us.Mr Meyer began his illustrious 'sex-ploitation' film catalogue with an 'Tati'-esque artistic creation.A total masterpiece!.",
         "The Immoral Mr.Teas is the first Russ Meyer film, but fans of his work may find this one a bit slow. It's not black and white but with no dialogue it plays like a silent movie, with a quarky soundtrack. Considering it's 1959, this movie is impressive for it's imagination and daring nudity, but will probably only satisfy Meyer completists....",
         "This movie contains some nude scenes, but there is no frontal nudity, because of the time it was made (1959) Although the film has no dialogue , only narration, it's nice to see the way early adult films had to adhere to the strict codes of the 50's. The movie is about a dental parts salesman, who can't help but notice the sexy women in the dentist's office, at the bar and at the beach. Throughout the movie he imagines them nude, and pictures them in suggesting poses. Every time he daydreams about these women nude, he snaps out of it and goes about daily life. The movie is a must see for movie buffs and those interested in history or the American pop-culture of the 50's.",
         "Yep, my review has nothing to do with the gorgeous blonde swimming in the dirty surf ( due to the tide and sand, not pollution) or the fact that most of the film is about a guy on his bike delivering false teeth to dentists, or the gorgeous women of assorted facial features and builds...all a bonus. But mind you, this is PG 13 material in this film and harmless and quaint. No sexual situations, or any interaction physically. The reason this movie stands out, is the photography, Eastman Color...wow...these locations are awesome. Now if you have the chance to watch this movie on Ultra HD calibrated it gives you a personal and real feeling of LA and Brentwood before the glut. Many films of the day featured downtown LA, or the wonderful exotic parks. Rarely do we get a chance to see the rest of Cali, the places where people lived, caught the bus, and did their everyday living. The nice thing is as Mr. Teas rides around on his bike, we get a very exact time capsule of Cali, 1959. And for that, I say sit back and enjoy this afternoon break where the beautiful women are the icing, but not the cake..the location is.",
         "Russ Meyer's debut feature film caused a sensation on original release. It was incredibly risqué for its time and pushed the boundaries of what was permissible. What Meyer basically did with this film was to introduce breasts to the big screen. And for this at the very least many of us should be eternally grateful. Up until this point nudity was very scarce at the cinema, and when it did show up it usually consisted of people playing volleyball in nudist colonies. This movie brought in a much more overt eroticism to the mix. Needless to say, it made an absolute mint at the box office. Clearly these were more innocent times and The Immoral Mr. Teas isn't at all shocking now. Its nudity is really in fact somewhat charming. But historical context is everything in understanding the importance of this movie. And the fact is that this film was groundbreaking. Unfortunately, it isn't an awful lot of fun to watch now. Its plot is simple – a man discovers that he can see women naked as the side effect of some medication he is given at the dentists. It's basically an excuse to see boobs. But the movie in actual fact is a drag as a result primarily of the lack of synchronized sound and awful endlessly repeated music. There is a narrator who just talks drivel quite frankly. He sounded strangely like Criswell the TV astrologist and star of a couple of Ed Wood flicks. Even Meyer's photography – normally a guaranteed strong point – is below average. For me Meyer only became a good film-maker from Lorna onwards. Although it's a term I virtually never use, the early nudie-cuties are just a bit dated to really carry much impact. This one has historical importance for sure but it didn't do much for me otherwise unfortunately.",
         "It's a good thing I knew some of Russ Meyer's better work, because I wouldn't have bought a collection-box based on this one. Though some of the familiar Meyer marks are featured here, the 'stories' spread too thin and the actor playing main characters doesn't impress at all. The 'jazzy' soundtrack is only fun on a few occasions, but for the larger part it is merely annoying. The female appearances make for the big plus. Then there is an occasional okay joke, but the voice-over is boring within minutes. And so a high rating can't be expected, even if this one was a groundbreaking film on the level of frivolous nudity. 4 out of 10, which is probably generous.",
         "Hearing about Russ Meyer a year ago,I was disappointed to find the an Arrow DVD boxset containing 19 of his movies was being sold at a pretty expensive price.Thankfully,during the Holiday period,I found out that Arrow were having a half-price \"X-Mas sale\",which allowed me to at last get an eyeful, of Russ Meyer's debut film. The plot: Going around doing his local delivery's,Mr.Teas finds himself unable to focus on any of his work duties,due to having a weird attraction of looking down the top of any girl that he sees at the work places which he delivers to. Heading to the beach in an attempt to calm down,Teas quickly finds out that he is not the only person on the beach,when he becomes fascinated by a woman who is taking part in topless photos on the beach. View on the film: Keeping the running time to a trim 62 minutes,writer/co- editor/gaffer/cinematography and director (!) Russ Meyer includes just enough distinctive moments to keep the film moving at a pleasant,enjoyable pace. Backed by a pitch-perfect Public Info Film mocking narration from Edward J.Lakso, (who also gives the movie its smooth Lounge score) Meyer shows a real eye for the beautiful actress that fill the screen,and who also help to make the viewing of the movie one that is very,very easy on the eye. Along with the mock narration and gorgeous women,Meyer also gives the film a delightfully light satirical feel,as a number of well done fade ins/fade outs relate Mr.Teas's bicycle to some rather unexpected things,and also shows Teas attempt to calm his excitement by visiting a psychologist,as something that has an opposite effect on his eye- catching trouble.",
         "Yeah, I know\u0085 Strong Subject line\u0085 But it got YOUR attention! Now let me explain\u0085 First of all, this film is shot in such beautiful Eastmancolor, where reds look like candied apples, the greens have a luscious forestry about them and the blues are so vivid. Just like the Disney films of the late 50's-60's. The beginning of this film had some very beautiful shots of a forest, with a babbling brook running down the middle of it. It starts out like a Disney True Live Adventure! Second of all, this film is SO innocent! If admiring a woman's figure is \"immoral\", then every single male I know (and some females as well) are condemned to H E double Toothpicks! All Teas does is go around and takes in the eye candy that seems to be on every street corner & waiting room in his neighborhood. (I need to live there as well!) Note: He DOES seem a lil voyeuristic, but so are we\u0085 (We're watching this film, aren't we?) This film is shot so tastefully, I believe a male might get more excited coming out of an art exhibit. There is, like 30 seconds of frontal nudity, and you may see a girl's behind for about 30 seconds at the most. Even the hokey Jazz band/Marching cadence sounds like a cross between a New Orleans Jazz combo & Peter & the Wolf! (The part of Mr. Teas will be portrayed by the Clarinet!) (Parts of the music are actually more \"lecherous\" then the action on screen!) If ever there were such thing as a \"family friendly skin flick\", this is it. This is SO nonthreatening, I believe they could show this film to junior high school students! You'll find more \"immorality\" in Jersey Shore or hip-hop videos. Now, the film as a viewing experience, it was fun\u0085 Laughable. But thank God it was only 63 minutes long. Any longer and this film would have me fast asleep."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Pad-Ram Enterprises"],
      "summaries": ["Mr. Teas is a door to door salesman for dentists' appliances. Everywhere he goes he encounters beautiful \"well-developed\" nude women, which of course stir his interest. The only sound in the film is the voice of a narrator and a very monotonic musical theme played on the clarinet or some similar instrument."],
      "budget": 24000
   },
   "movielensId": 137557,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-01-01",
      "dvdReleaseDate": null,
      "directors": ["Russ Meyer"],
      "runtime": 63,
      "movieId": 137557,
      "title": "The Immoral Mr. Teas",
      "mpaa": "",
      "actors": [
         "Bill Teas",
         "Ann Peters",
         "Marilyn Wesley",
         "Michele Roberts",
         "Dawn Danielle",
         "Don Cochran",
         "Peter A. DeCenzie",
         "G. Ferrus",
         "Monica Liljistrand",
         "Russ Meyer",
         "Eric 'Mick' Nathanson",
         "June Wilkinson"
      ],
      "imdbMovieId": "0052920",
      "originalTitle": "The Immoral Mr. Teas",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Mr. Teas is a door to door salesman for dentists' appliances. Everywhere he goes he encounters beautiful \"well-developed\" nude women, which of course stir his interest. The only sound in the film is the voice of a narrator and a very monotonic musical theme played on the clarinet or some similar instrument.",
      "tmdbMovieId": 5648,
      "avgRating": 2.5,
      "releaseYear": "1959",
      "numRatings": 9,
      "posterPath": "/3PUm9ikqfnztQUNKfow7utsX9Zi.jpg"
   }
}