{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0067104",
      "video": false,
      "title": "Flight of the Doves",
      "recommendations": [
         115553,
         75364,
         71445,
         27142,
         120393,
         39428,
         45329,
         32122,
         327175,
         216436,
         86531,
         41166,
         17731,
         124096,
         39378
      ],
      "backdrop_path": "/91bhVF4YHaijBJMWgxTfvmrUUUy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hawk Dove",
               "gender": 2,
               "credit_id": "52fe48439251416c9108611f",
               "name": "Ron Moody",
               "profile_path": "/21sEsEm1yRmDO9UxrG1WNDVfwPl.jpg",
               "id": 41236,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Finn Dove",
               "gender": 0,
               "credit_id": "52fe48439251416c91086123",
               "name": "Jack Wild",
               "profile_path": "/7gXNk0oMlyvqkx8eoRL8gB8rcM7.jpg",
               "id": 140029,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Granny O'Flaherty",
               "gender": 1,
               "credit_id": "52fe48439251416c91086127",
               "name": "Dorothy McGuire",
               "profile_path": "/iGkamkWnIor7eYrTDQMxAjxoQbA.jpg",
               "id": 24815,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Judge Liffy",
               "gender": 0,
               "credit_id": "52fe48439251416c9108612b",
               "name": "Stanley Holloway",
               "profile_path": "/3pKWIEPNOSD0lMHrK07RYkVyde4.jpg",
               "id": 12727,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Derval Dove",
               "gender": 0,
               "credit_id": "52fe48439251416c9108612f",
               "name": "Helen Raye",
               "profile_path": null,
               "id": 593168,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tobias Cromwell",
               "gender": 2,
               "credit_id": "52fe48439251416c91086133",
               "name": "William Rushton",
               "profile_path": "/fbZ74VUgcwUgzsSxq1KwCBuj4l1.jpg",
               "id": 29492,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sheila",
               "gender": 1,
               "credit_id": "52fe48439251416c91086137",
               "name": "Dana",
               "profile_path": "/dfsyBgEgZG3S9vr8Tw1QK3woFmR.jpg",
               "id": 593169,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mickser",
               "gender": 0,
               "credit_id": "52fe48439251416c9108613b",
               "name": "John Molloy",
               "profile_path": null,
               "id": 75187,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Powder",
               "gender": 2,
               "credit_id": "52fe48439251416c9108613f",
               "name": "Barry Keegan",
               "profile_path": null,
               "id": 112977,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Michael",
               "gender": 0,
               "credit_id": "52fe48439251416c91086143",
               "name": "Brendan O'Reilly",
               "profile_path": null,
               "id": 593170,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Rabbi",
               "gender": 2,
               "credit_id": "52fe48439251416c91086147",
               "name": "Noel Purcell",
               "profile_path": null,
               "id": 33090,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Pat Flynn",
               "gender": 2,
               "credit_id": "52fe48439251416c9108614b",
               "name": "Tom Hickey",
               "profile_path": "/wmgEm09lbMS8ULcscHD7e9WJYhk.jpg",
               "id": 107729,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Sergeant O'Casey",
               "gender": 2,
               "credit_id": "52fe48439251416c9108614f",
               "name": "Niall Toibin",
               "profile_path": null,
               "id": 140230,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48439251416c91086155",
               "name": "Ralph Nelson",
               "profile_path": "/zRZtocgGZvCFwlNB1UOEREHYLNw.jpg",
               "id": 16888,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48439251416c9108615b",
               "name": "Frank Gabrielson",
               "profile_path": null,
               "id": 179468,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48439251416c91086161",
               "name": "Ralph Nelson",
               "profile_path": "/zRZtocgGZvCFwlNB1UOEREHYLNw.jpg",
               "id": 16888,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48439251416c9108616d",
               "name": "Ralph Nelson",
               "profile_path": "/zRZtocgGZvCFwlNB1UOEREHYLNw.jpg",
               "id": 16888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48439251416c91086179",
               "name": "Roy Budd",
               "profile_path": null,
               "id": 51883,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5612c5749251416b56001bab",
               "name": "Walter Macken",
               "profile_path": null,
               "id": 593171,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5612c5a7c3a368680e015752",
               "name": "John Jympson",
               "profile_path": null,
               "id": 7754,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5612c588c3a3686824014593",
               "name": "William S. Gilmore",
               "profile_path": null,
               "id": 13521,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5612c59b9251410d800080cb",
               "name": "Harry Waxman",
               "profile_path": null,
               "id": 83135,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5612c5b3925141478d00c3ca",
               "name": "Don Geraghty",
               "profile_path": null,
               "id": 1519073,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5612c5c0c3a3686817015c01",
               "name": "Frank Arrigo",
               "profile_path": null,
               "id": 161975,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5612c5d3925141705100040b",
               "name": "Theodore R. Parvin",
               "profile_path": null,
               "id": 77491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.269962,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 82191,
      "vote_count": 5,
      "budget": 0,
      "overview": "While fleeing across the Irish countryside, two orphans are pursued by their villainous uncle, a master of disguises.",
      "similar": [],
      "original_title": "Flight of the Doves",
      "runtime": 105,
      "poster_path": "/iJbk4SLG2tCNkWYiBgUgpvXIS6q.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rainbow Releasing",
            "id": 64862,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1971-04-02",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Something special is coming your way!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ralph Nelson"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Frank Gabrielson",
         "Ralph Nelson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067104/",
      "coverLink": null,
      "actors": [
         "Ron Moody",
         "Jack Wild",
         "Dorothy McGuire"
      ],
      "reviews": [
         "I first saw this film when I was about 5 or 6 on tv,and it stuck in my mind.Sadly I never got to see it again until 3 years ago when sky tv showed it.It was just as good as I had remembered it.What I really like about it is its not a silly kids film, it is sensible yet still has a little comedy element to it.It is about two orphans who run away from their cruel step dad.They run away to Ireland to try to find their grandma.Also coming after them is their uncle Hawk who wants to kill them, so that there grandfathers inheritance will pass to him. I can't praise this film enough, the acting is superb and the soundtrack is also brilliant.It really is an underated cinema gem in my opinion.It has to be one of my all time film favourites.Please see if you can.",
         "This British-made film cast from the Disney mold has a brother(Jack Wild) and younger sister fleeing their loutish stepfather in England to find their grandmother in Ireland. Along the journey they are assisted by a motley assortment of colorful characters, and are pursued by a menacing relative(an uncle, if I remember)who believes their appearance will deprive him of an inheiritance. The uncle, played by Ron Moody, affects a series of disguises to trick the kids, but always gets the shaft. A beautiful soundtrack score enhances the film. Not readily available, so catch it if you can on television.",
         "i, like some other reviewers just cant seem to get this movie out of my head. i woke up and googled it and to my surprise there it was. it has been at least 30 years since i have seen it(only once) and if i close my eyes i can still see the trailer from the movie theater in which 2001 a space odyssey was playing. i have nothing but fond memories of the movie and can still see jack wild (and wasn't mark lester in the movie also?) running around castles on the shores of ireland evading there step dad. i remember jack wilds character biting his step dad on his wrist to get away. did i remember that correctly? i am going on line to see if it is available so i can buy it for my daughter.",
         "A very well acted film by actors Ron Moody and Jack Wild who worked well together in the movie Oliver. Ron Moody is brilliantly funny and sometimes frightening with his disguises and different characters. Jack Wild is wonderful as the compassionate loving older brother who loves his younger sister enough to run away to Ireland so she can be truly loved by someone: their grandmother who is nicely portrayed by Dorthy McGuire. The adventures they encounter on their way to Ireland are wonderful as is the scenery of Ireland. This film was shot entirely in Ireland and the music soundtrack is as lovely as Ireland. A nice family film with a happy ending. Beats what is out there today.",
         "As a 43 year old watching this film after over 30 years, it brought a tear to my eye. The beautiful music by Roy Budd (which is available on CD in Britain) reminds one of a totally different era that is part of my childhood. Watching the film and seeing the ancient cars on the roads, the clothes on the ordinary people in the background, the hairstyles and fashions ...... the sweet innocence of the little girl is something that's gone forever, but captured in this charming little film made in 1970 on location in Ireland. It makes me sad to realise that it is an age which I look back with fondness whilst remembering my own childhood. But what will my own kids have to remember? Despite my best efforts, they live in a world of wall to wall television filled with violence and sexual innuendo masquerading as comedy, computer cyberspace, street gangs and stress caused by modern life and expectations of them to perform and excel. As kids in the 1960's and 1970's we had none of that - life was so much simpler and immensely more enjoyable. It is brilliant that this film is available on DVD for us to watch today. It deserves to be in the same league as those other classic British films made for family viewing at that period in British cinema history: \"Oliver!\", \"The Railway Children\", \"The Amazing Mr Blunden\", \"Black Beauty\" (1970 version!). The film features British character actor Ron Moody who excelled at the multi-disguises villain with a soft heart, a type of role he would play again 10 years later on the HTV series \"Into the Labyrinth\". What a shame that Jack Wild (Finn) died earlier in 2006 of throat cancer. And whatever happened to the delightful Helen Raye (Derval)? She never acted in anything again, but she should have done as she was as good in this role as Georgie Henley is in the current Narnia film. Even Irish songstress Dana appears in the film (the same year she won the Eurovision Song Contest) as a gypsy girl to sing a hauntingly beautiful ballad in Gaelic and English. My 9 year old daughter fell in love with this film when I showed it to her the other day. She still has that innocence, which I hold onto for as long as possible with her before she descends into the terrible tantrum-filled teen years that her brothers have already entered (and even they watched it and didn't moan!). A great film for kids to watch, and a wonderful wallow in nostalgia for those of us over 40 years of age!!!",
         "In the late 60s and early 70s, when cinematic boundaries were being pushed back, there were people working in the film industry who seemed to wrestle with a guilty conscience. To understand what I mean, look at the movies that some stars and directors made immediately after they had courted controversy in their more risky films. Soon after the extraordinary outcry that surrounded the graphic violence of 'The Wild Bunch', William Holden appeared in 'The Christmas Tree' which was one of the most lachrymose family movies of all-time. 'Wild Bunch' director Sam Peckinpah also mellowed out for his next film with the light-hearted and extremely gentle 'Ballad Of Cable Hogue'. Another director who had ruffled a few feathers around that time was Ralph Nelson, whose brutal 'Soldier Blue' had pushed the envelope further still, most notably in its infamous blood-soaked massacre. What did Nelson do immediately after 'Soldier Blue'? He made 'Flight Of The Doves', such a juvenile-orientated piece of blarney that it's hard to believe the two films could have been made by the same man in the space of a year. You can almost sense Nelson saying: \"look, I know I roughed-up the industry a bit with my last movie\u0085 so here's something sweet and sentimental that all the family can enjoy\". This film is the cinematic equivalent of an apology. Its main weakness is that it is actually too safe, too childish, too sweet-natured for its own good. Finn and Derval Dove (Jack Wild & Helen Raye) are a couple of young kids living in a working class English town with their cruel stepfather. They dream of moving to Ireland to join their grandmother O'Flaherty (Dorothy McGuire) on her picturesque farm. One evening, the two youngsters decide that they've had enough of their abusive home life so they run away from their house, planning to escape to Ireland. Around this time, their sinister Uncle Hawk (Ron Moody) – a master of disguise - arrives on the scene, plotting to kill the two children so that he can claim the sizable inheritance he stands to receive if anything happens to them. The Dove children make it to Ireland and have various adventures while searching for their grandmother's farm, pursued all the way by the law, their despicable step-father and the murderous Uncle Hawk. 'Flight Of The Doves' is loosely based on a popular novel by Walter Macken. The child actors are OK, albeit a little wooden, while the adult stars tend to mug their way through their roles. Moody in particular gives a desperately uneven performance, often behaving as if he's in an end-of-term pantomime (an acting style which may well work on stage, but proves frequently embarrassing under the glare of a movie camera). The film is perfectly enjoyable for children – anything with a plot about kids running away from cruelty and injustice makes an appealing premise for a family flick. It's not badly handled overall, just never truly magical in the way any family film should aspire to be. A couple of scenes seem utterly out of place – one is the 'You Don't Have To Be Irish To Be Irish' march which apes 'Consider Yourself' from 'Oliver!' without much success; the other is a frankly annoying comedy sequence involving a chase through a series of doors, reminiscent of something that Harold Lloyd or the Keystone Cops might have done, but desperately ill-fitting here. All things considered, 'Flight Of The Doves' is a harmless and inconsequential enough time-filler which kids will enjoy, though the sickly-sweet mawkishness might prove a bit much for the adults.",
         "One of my favourites - a fantastic adventure across Ireland - does anyone agree? Apparently I have to write at least 10 lines - no problem really I can remember huge chunks of the movie. Is it true Jack Wild has cancer ? also there were a few abusive emails flying around under the Flight of the Doves section - not what I expected as I tried to capture some childhood memories - what a cruel world - well anyway Il get over it. If I remember one quote from the movie from Ron Moody as he was driving along with the kids dressed as a lady_ \" I love Ireland the land of Shaw, Yeats , Robbie Burns... Hope I've made my quota - OK back to a lonely bachelor life in London..",
         "Although the film at times feels like an over cooked tourist ad it would be unfair to overlook some fine moments.Ron Moody shows off all of his remarkable skills in a series of ham characters,while Jack Wild is better than usual as Finn.I have just seen this film not having watched it since the seventies and I really liked Tom Hickey as Garda Flynn.The film is well worth a look and kids would immediately empathize with the two runaways.It also features a Synagogue which is a rarity in an Irish based movie.The narrative is a standard fugitive adventure and no more with plenty of twists and turns but some of the set pieces are poor,such as the dire parade and the cringe-worthy scene outside the church when the tour bus pulls in.Noetheless,Moody as Hawk keeps the tension alive throughout.",
         "I saw this movie in the cinema when I was about 10 years old and Ron Moody coming after the Doves with a cargo hook in his hand still haunts me. I am not that surprised the DVD is rated 18! but it was once a kid's movie. It has many good performances by well known English and Irish actors. The singer Dana both acts in the film and contributes a song to the soundtrack. I recall that the actor Matt Dillon once said in an interview that it was his favourite movie. I am surprised it isn't shown more often.Maybe it'll be seen again to show how good an actor Jack Wild was besides Oliver.",
         "I had the original book when I was a child and read it many times. In my head I had concrete images of the characters and places that the story described. A few years back I discovered that a movie had been made from the book, but had never been able to find a copy to buy or view. Then the other day it dawned on me to check You-Tube and I found it instantly. I was so excited to watch it! However, as many movie made from books can be, this one was somewhat of a letdown. Many of the interesting characters and scenes from the book are totally missing from the film and other things have been added that were never in the book. For instance, in the book, there is a character who is the \"children's uncle from America\". The character is a small one and mostly in the background of the plot and only for a short while. He does meet up with the children near the end of the story, but only briefly and then is gone again. In the movie, this character is blown out of all proportion into a villainous psychopath and whole new plot lines are created to give the character lots of screen time. The only reason I can figure that this was done is because the character was played by Ron Moody, a well-known actor, and they needed to make the part bigger for someone of that stature. Having read the book and knowing the original story, the revision of the story to make this happen really took away from the original. I left thinking, \"If they hadn't wasted time on this storyline, they could have focused on the adventures that actually took place in the book. There was also a scene that was reminiscent of keystone cops racing in and out of a series of doors in a wall. I think it was supposed to be humorous but, since it did not fit into or advance the story at all, it seemed very out of place. Also, the book had the character of Michael, the policeman who was \"on vacation\", portrayed as a caring \"overseer\", often in the background, watching the children as they made their way on their journey and making sure they were OK, but being careful not to \"help\" them. Michael was a major character in the book. He was also kind to the children, as were some other characters, such as Nickser (who was called Mickser in the movie). The movie version of Nickser was just another person determined to turn the children in to the authorities. In the movie, the Michael character was \"just a policeman\" and was just as bent on capturing the children as anyone else. The movie contained almost no characters that were kind to the children (the rabbi, being an exception, though again the entire synagogue and parade scenes made no sense and were not from the book, either). Several scenes from the movie were very good at capturing an almost exact replication of the book, such as when Finn and Derval blended into the family with all the children so they could get free transportation and again at the end when the children arrived at their grandmother's house. Actually, the scene of the grandmother's house from higher up on the hill (when the kids first see it) is just as I pictured it when reading the book. I began wondering about who from today's actors could be cast in the various roles if a remake were made. In thinking about that, I didn't take the actor's country of origin into account (as good actors can do an accent if they work at it), but rather who I saw fitting the physical and personality descriptions of the characters as they were given in the book. I didn't come up with suggestions for all of them, but here are a few: Finn: (Couldn't come up with anyone for this) Derval: The Fanning sisters came to mind, but they are both too old now. Uncle Toby: Mark Addy Granny O'Flaherty: I think Fionnula Flanagan would be perfect. Judge: Michael Caine Nickser: Colm Meaney Powder: Stephen Rea Michael: Paddy Considine, James Nesbitt, David Tennant, George Clooney Of course, if they did remake the movie, I would want it to follow the book and not some made-up plot lines to cater to a particular actor. Someone asked about the time-frame in which this story is supposed to be set. The movie makes it appear to be 1960's (though filmed in 1971). The book gave no date indication. It was generic enough that you could imagine it happening in various times. I personally had it set (in my mind) in the 1940's or 1950's. Because there is little indication of technological devices (the book does mention a boat and Nicker's van), and much travel seemed to be on foot or pack animal, it is easy to imagine it happening in various time periods. I think this gives it an insulating effect, making it \"timeless\" in a sense. It was fun to finally see the movie - it was just different than the book with which I was familiar.",
         "I saw this movie about 25 years ago, and the title has stuck with me all these years. The movie must have impressed me deeply. I remember two children fleeing, attempting to get to a relative some distance away. I was around 9 when I saw the movie, so I can only say it would probably appeal to a younger audience.",
         "I thought I was the only kid who saw this, let alone remembered it. I love the score of this film and tried to search for the music for years. As a kid, I was blown away by OLIVER, so when 3 of the cast members made another film together, well, I was there, THAT and the fact that my 12 year old sister had a crush on Jack Wild. Wow. I should try and rent the movie again.",
         "To most Irish people under the age of 50 this film is cringey at best. It represents an Ireland of the imagination and modern paddywhackery. It's clearly a kids film and I realise that is the benchmark for the crappy acting. I saw it as a child but to re-watch it as an Irish adult it seems borderline racist - the terrible accents and how it makes the Irish look archaic and simple. Particularly it makes a mockery of the Gardai (Irish police force). Maybe the book it's based on is good, but there's little to recommend in this film. I'll give it 2 stars cause of some nostalgia and images of Ireland in the 1970s, but otherwise - avoid.",
         "Charming film has smashing performances from Wild and Moody. Some touching scenes, but then there are others that are just too twee.. That's Hollywood Irish for you.The song \"you don't have to be Irish to be Irish\" might embarrass some natives of the emerald isle. Maguire overacts. One to curl up by the fire on Christmas day to.",
         "Why is this film not available on either Video or DVD in an American Format? I saw it back in the 70s in a movie theater and want my son and Grandson to see it, and also to show it to the Irish Movie fans in the local Irish History Round Table group studying Irish backgrounds! Is it available ANYWHERE in a US compatible format? I have checked with AMAZON and Ebay and have found it in the European format from several places. Any suggestions would be helpful! SUMMARY: It could be re-released in the US with sufficient publicity! Certainly the cast is now well-known and the plot is clear to the younger viewers and entertaining to adults!",
         "wow!!! I thought I was dreaming this film as everyone I asked had never heard of it.So I was most surprised to find this site with the film starred.My kids watched this many years ago and were glued to the TV so I am pleased its on DVD so I can get it and pass it on to THEIR kids.Was one of the nicest,gentlest,olde worlde films I have seen.Brought back memories of a \"sweeter\" time before violence...sex...drugs...horror flicks and the like.Would like to see this on TV a bit more.....much better than the usual Saturday and Sunday afternoon offerings don't think I would want a re-make the powers that be might introduce \"other\" things that would spoil this excellent kids movie",
         "This isn't really a review. Like others, my comments are the result of the strong impact I recall this movie having on me when I viewed it. I was 21 or 22 years old. The movie came to us on a ship-to-ship transfer while operating in the South China Sea--that's right, Vietnam era! It was either '72 or '73, as I was there on back-to-back deployments. It's 38 years later, and I've often wondered what the chances were that I'd ever be able to find out anything about this movie, or possibly be able to view it again. The other thing I recall is the music--the tune was VERY memorable at the time. You have to realize that life on board a small US Navy ship was rather basic back then--work, eat, sleep, work, and so on, with not much to break the monotony while at sea. Movies were one of the few pleasures we had while at sea...no e-mail, no cell or satellite phones, no computers, no Internet. Occasionally we would get mail from stateside. This is a quite old/stale discussion & review--not much interest in this movie--if ANYONE knows how I can get a US-format DVD, I would greatly appreciate a reply.",
         "I remember this film, I was just watching 'Oliver' and it was driving me nuts trying to remember this films' title, so i had to search it, and here it is! One of the things I remember is the disguises that Ron 'Fagin' Moody, got himself into, including dressing as a woman, to try to lure the children. I'm going to try and find this on video or DVD as I'm sure my kids will love it, mind you I was quite young when I saw it and I do remember being scared at a few bit of it, there's nothing bad in it, just the brilliantly sinister villain played by Moody. The rolling fields of Ireland are lovely too, what a backdrop! It will also be good to see the wonderful acting of the late Jack Wild too, such a shame he died too young.",
         "I read another comment posted on this sight that 3 people who stared in \"Oliver\" were also in \"Flight of the Doves.\" I know of Jack Wild and Ron Moody, who is the third? I checked the actor profiles of the entire given cast of \"Flight of the Doves\" but could not find another actor whose name also appeared on the cast list of \"Oliver\"! please can someone shed some light on the 3rd \"Oliver\" co-star? Was the person whose comment I read referring to crew instead of cast? if so, that would explain my confusion as I only scanned cast lists. However I am still fascinated to know the name of the Third person who is credited inboth films."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Rainbow Releasing"
      ],
      "summaries": [
         "After the death of their mother, two children in Liverpool run away from home to escape their cruel uncle who treats them harshly. They flee to Ireland in hopes of finding love and safety with their kindly grandmother. However, their uncle is a failed actor who is a master of disguise. He uses his skill to pursue them in hopes of finding them for his own financial gain. The children must rely on their wits and the kindness of strangers to stay ahead of him or their lives will be in mortal jeopardy.",
         "Following the passing of their mother, thirteen year old Finn Dove and seven year old Derval Dove become the ward of their cruel stepfather, Tobias Cromwell, who only wants what menial labor the children can provide for his home, rather than their loving maternal grandmother, Mary Magdalene St. Bridget O'Flaherty, the English court ruling largely due to the fact of the children already living with \"Uncle Toby\" in Liverpool, while Granny O'Flaherty lives in rural County Galway, Ireland. Dreaming of living with Granny, the children decide to run away to Galway County to be with her. The start of their journey is before they are able to discover that they are heirs to an estate, that substantial amount of money which will otherwise go to their maternal Uncle John Cyril Dove - an actor with the stage name Hawk Dove due to the hawk tattooed on his right inner wrist - if the children cannot be found. Learning that he will control the money until the children reach an age of majority, Uncle Toby enlists the assistance of a detective to get the children back, he in turn offering a small fraction of the inheritance as a reward. As mean as Uncle Toby is, Uncle Hawk is even worse as he is willing to kill the children to get the inheritance if he can find them. What is working in Uncle Hawk's favor is that he, as an actor, is a master of disguise, the only thing that may give him away under any of those disguises being the tattoo. Through it all, Granny hopes and prays the children make it to her loving home. The children get into one misadventure after another as they try to make their way Granny, while trying to evade the police, Uncle Toby and his detective, and Uncle Hawk. The children have to learn who to trust and not to trust, especially as they, without much money, have to learn how to survive on the road. Even if they can make it to Galway County, their story may not have a happy ending as they are still legally a ward of Uncle Toby in the eyes of the law, and as Finn states they may never be rid of potentially murderous Uncle Hawk, even if they are attending his funeral.",
         "While fleeing across the Irish countryside, two orphans are pursued by their villainous uncle, a master of disguises."
      ],
      "budget": 0
   },
   "movielensId": 137869,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-04-02",
      "dvdReleaseDate": null,
      "directors": ["Ralph Nelson"],
      "runtime": 105,
      "movieId": 137869,
      "title": "Flight of the Doves",
      "mpaa": "G",
      "actors": [
         "Ron Moody",
         "Jack Wild",
         "Dorothy McGuire",
         "Stanley Holloway",
         "Helen Raye",
         "William Rushton",
         "Dana",
         "John Molloy",
         "Barry Keegan",
         "Brendan O'Reilly",
         "Noel Purcell",
         "Tom Hickey",
         "Niall Toibin"
      ],
      "imdbMovieId": "0067104",
      "originalTitle": "Flight of the Doves",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "While fleeing across the Irish countryside, two orphans are pursued by their villainous uncle, a master of disguises.",
      "tmdbMovieId": 82191,
      "avgRating": 3.5,
      "releaseYear": "1971",
      "numRatings": 1,
      "posterPath": "/iJbk4SLG2tCNkWYiBgUgpvXIS6q.jpg"
   }
}