{
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 60,
      "synopsis": "A two-part adaptation of the Iain Banks novel of the same name, \"Stonemouth\" is a rite of passage tale set in the fictional Aberdeenshire village of Stonemouth which follows Stewart Gilmour (Christian Cooke), who returns to the village for his best friends funeral. Run out of town a year earlier by his girlfriends family, Stewart is forced to face up to his own past whilst uncovering the sinister truth behind his friends apparent suicide.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4274822/",
      "coverLink": null,
      "actors": [
         "Naomi Battrick",
         "Christian Cooke",
         "Chris Fulton"
      ],
      "reviews": ["Stonemouth is an adaptation of Iain Banks penultimate novel. Its the first to be televised since The Crow Road. Like The Crow Road it has a dark undercutting and plenty of flashbacks as well as on screen narration. Christian Cooke is Stewart Gilmour, returning to Stonemouth, a fictional port town for the funeral of his childhood friend Callum Murston who committed suicide and who helped Stewart out as a child when a mentally deranged boy ran amok with a sword. Callum's father, Don Murston (Peter Mullan) a local crime boss and his two other sons had chased Stewart out of town five years earlier for messing round with his daughter Ellie. Stewart has been allowed back in to attend the funeral and is expected to scamper back to London fast. However Stewart is suspicious of the death and decides to ask uncomfortable questions. He also gets together with Ellie thus incurring the wrath of the Murston's. Stonemouth the town is like a place from the wild west. Its run by Don Murston and his two sons are his lackeys and enforcers. The sons are referred to at one point as the Chuckle Brothers, seemingly incompetent and lacking in brain cells. No wonder then that someone else is easily manipulating them. I could never get over why they were so upset that Ellie who we see snorting cocaine and is caught fooling around with Stewart is expected to be so pure and kept away from boys. She is a good looking lady and Stewart is supposed to be Don's Godson. The two part series had an interesting set up. Plenty of good looking actors but not much cop in the acting stakes. For that you rely on the older cast members. The second episode got a bit silly. It relied too much on coincidence, luck and people doing stupid things. It all felt underwhelming and undercooked. The Crow Road although a longer serial was better."],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": ["British Broadcasting Corporation (BBC)"],
      "summaries": [
         "Mystery drama based on a novel by Iain Banks. Stewart Gilmour returns to his hometown after been driven out two years before by a local gangster. He returns for the funeral of his friend who recently committed suicide. He sets out to try and get the bottom of his friends death who also happens to be the son of the local gangster and the brother of Stewart's ex girlfriend.",
         "Stewart Gilmour returns to his childhood home and tries to discover the truth behind his best friend's death."
      ],
      "budget": 0
   },
   "movielensId": 137873,
   "movielens": {
      "languages": [""],
      "releaseDate": "2015-06-08",
      "dvdReleaseDate": null,
      "directors": ["Charles Martin"],
      "runtime": 120,
      "movieId": 137873,
      "title": "Stonemouth",
      "mpaa": null,
      "actors": [
         "Christian Cooke",
         "Charlotte Spencer",
         "Peter Mullan",
         "Gary Lewis",
         "Brian Gleeson",
         "Sharon Small",
         "Naomi Battrick",
         "Gilly Gilchrist"
      ],
      "imdbMovieId": "4274822",
      "originalTitle": "Stonemouth",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Based on Iain Banks's best-selling novel, this romantic mystery follows Stewart as he returns to his childhood home and tries to discover the truth behind his best friend's death.",
      "tmdbMovieId": 344560,
      "avgRating": 3,
      "releaseYear": "2015",
      "numRatings": 2,
      "posterPath": "/5t0eikCbLAVWfy1hggAdmwFvUpj.jpg"
   }
}