{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0246834",
      "video": false,
      "title": "The Other Me",
      "recommendations": [
         124111,
         122987,
         6980,
         111485,
         71885,
         109169,
         77921,
         73527,
         109167,
         72753,
         24020,
         92208,
         70773,
         70772,
         101514,
         62527,
         77606,
         108204,
         76212,
         26267
      ],
      "backdrop_path": "/a2AXcniubDS3og9PTgVvJYCDwQF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Will Browning / Twoie",
               "gender": 2,
               "credit_id": "52fe47079251416c91067c69",
               "name": "Andrew Lawrence",
               "profile_path": "/uRBbgjhqqWhxm7v61MGD9ze09OT.jpg",
               "id": 16479,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dad",
               "gender": 0,
               "credit_id": "52fe47079251416c91067c6d",
               "name": "Mark L. Taylor",
               "profile_path": "/uvqfJeuIQEHvbEDJWDZJcTBlzNy.jpg",
               "id": 78003,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mom",
               "gender": 1,
               "credit_id": "52fe47079251416c91067c71",
               "name": "Lori Hallier",
               "profile_path": "/p3idcs25JleLI06edPm8rDKPJAp.jpg",
               "id": 44203,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Allana Browning",
               "gender": 1,
               "credit_id": "52fe47079251416c91067c75",
               "name": "Alison Pill",
               "profile_path": "/lPH5UP2bRPat7Fxd3YTUH0wAjus.jpg",
               "id": 17486,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chuckie",
               "gender": 2,
               "credit_id": "52fe47079251416c91067c79",
               "name": "Brenden Richard Jefferson",
               "profile_path": null,
               "id": 54498,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Conrad",
               "gender": 2,
               "credit_id": "52fe47079251416c91067c7d",
               "name": "Joe Grifasi",
               "profile_path": "/cesXbWZaKHeOhsSdfbF9mB9750w.jpg",
               "id": 4887,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Heather",
               "gender": 1,
               "credit_id": "5630aaed925141284c00f937",
               "name": "Sarah Gadon",
               "profile_path": "/2wBgDSA2zk00KXpNSucdIGscu5b.jpg",
               "id": 190895,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Scottie DeSota",
               "gender": 0,
               "credit_id": "5630aafac3a3681b5200f61c",
               "name": "Tyler Hynes",
               "profile_path": "/x7msHX1Uahi1njZTfIxL8pWrslF.jpg",
               "id": 1224846,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Victor",
               "gender": 2,
               "credit_id": "5630ab089251414ad800da59",
               "name": "Scott McCord",
               "profile_path": "/4wCw1lnbuJwFbE2sDJfQxfiF3z2.jpg",
               "id": 124315,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Grandpa Mordechai",
               "gender": 0,
               "credit_id": "5630ab189251413b4600203b",
               "name": "Robert Buck",
               "profile_path": null,
               "id": 1239388,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Miss Pinkerson",
               "gender": 0,
               "credit_id": "5630ab26c3a3681b5900f58d",
               "name": "Andrea Garnett",
               "profile_path": null,
               "id": 1528365,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "VJ",
               "gender": 2,
               "credit_id": "5630ab36925141284c00f941",
               "name": "Joseph Motiki",
               "profile_path": null,
               "id": 1233631,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47079251416c91067c83",
               "name": "Manny Coto",
               "profile_path": null,
               "id": 41795,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5630aac392514129fe001fa9",
               "name": "Mary C. Ryan",
               "profile_path": null,
               "id": 1528362,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 2,
               "credit_id": "5630aacec3a3681b4b00ea5d",
               "name": "Jeff Schechter",
               "profile_path": "/16tfypSSvLUoJgl0vk2JJRIwyLx.jpg",
               "id": 238824,
               "department": "Writing",
               "job": "Teleplay"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.46067,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39242,
      "vote_count": 20,
      "budget": 0,
      "overview": "Will Browning accidently creates a clone of himself when working on a science project.",
      "similar": [],
      "original_title": "The Other Me",
      "runtime": 90,
      "poster_path": "/8XEWJB5YwLmdmyfl2MSZvpZ7IxF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Disney Channel",
         "id": 3213,
         "origin_country": ""
      }],
      "release_date": "2000-09-08",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Holy 'A' in Science Class - I made myself clone!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Manny Coto"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Mary C. Ryan",
         "Jeff Schechter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0246834/",
      "coverLink": null,
      "actors": [
         "Andrew Lawrence",
         "Mark L. Taylor",
         "Lori Hallier"
      ],
      "reviews": [
         "I really enjoyed this movie! Sometimes it helps when you have zero expectations, but this movie really turned out to be a surprise and I would have liked it anyway. The story was a bit far fetched, but no more than you average fantasy. However, it had some really great stuff going for it. Andrew lawrence did an impressive job. He was totally believable in both roles, and was in general a pleasure to watch. The writing was tight and the direction good. I like most kid movies that have a good story, message and a sense of humor. This one had all that and more. This is a kid movie that I think anyone can enjoy. It's creative, entertaining, insightful and has a number of good messages. Parents will enjoy it right along with their kids, but you don't need to be either to watch this one; it's just plain fun for all ages. It had a weak point or two - the villains were perhaps a little too silly, but in general was as good as could be expected for the type of movie it is. Highly recommended. Four stars out of five.",
         "The Other Me was good made for T.V. movie and much better than the Parent Trap (which might be due to the fact that Andrew Lawrence is a better actor than Linsey Lohan). The characters were good except maybe for the bad guys, they were kind of cheesy. Otherwise, it was cute, romantic, dramatic and of course funny!(especially the cafeteria dance scene). One of Disney Channels best, 7/10.",
         "This movie is very funny and extremly witty. It is about a 13-year-old named Will who has failing grades. To get a good grade in science, he purchases a ocean pet kit from Ocean Pets Inc. At the ocean pet labs, two of the workers discover how to \"hyper-clone\", and to test it, they clone a mouse. One of the workers leaves the cage door slightly open when they leave. The clone mouse notices, and pushs it open. A cat nearby pops out of it's cage and scares the mouse. The mouse tips over the beaker with the clone formula in it and it drips into the kit that Will gets. When he gets it, he pours the ocean pet liquid in and then can't find the stir stick. So he takes his comb and stirs with that(it has some hair on it). Since the clone liquid is in that, it creates a clone of himself. The clone is smarter than Will, and goes to school instead of Will. Meanwhile, the workers try to track down Will to get the clone....",
         "This is my absolute fave movie that I have ever seen!!!!!! Andy Lawrence is a great actor as Will, but he is hilarious as Twoie, the clone! I was laughing at every single scene. I have seen the movie at least 20 times!!!!!!!!!!!!!!!!!!!! The guy who plays Chuckie, Brenden Jefferson, is pretty funny, and I liked how Scottie DeSota became friends with Twoie when they bonded about not having dads! Allana is really a brat, but in the end, she comes through!!! I adore this movie, and anyone who likes to laugh hysterically should watch it. Also, notice that everyone who commented on this movie said it was great, and no one ragged on it.",
         "Rarely is a wholesome subject like this handled without being trite or boring. The literary device of the clone is up-to-date and shows that Will is capable of becoming more like Twoie. Of course, Twoie could have had the same effect on Will if he had actually been a cousin visiting from Belgium, but imagine how dull a movie that would be! Although the age group in the story is Jr High, Andy Lawrence is 12 and I think that age group would benefit more from seeing the movie.",
         "I relaxed in front of the TV tonight, and started to watch \"The Other Me\", The idea of having an identical duplicate of the main character, that they only know about has been around since Disney first made \"The Parent Trap\". Since then the formulae has been used so many times I have lost count, and few have been any good. For once though it works, this film is fun, amusing, well acted, and well worth watching. The crooks as always in Disney films are inept, but I would imagine are used that way as to not frighten the younger audience. The lead role, played by Andrew Lawrence shows he has real talent from the way he portrays the two different characters. There is no doubt that he makes the film work, and the supporting cast, do an amicable job. Well worth seeing if you get the chance especially as a family.",
         "i thought it was a great movie i liked the cafeteria part the movie it`s self is funny i`ve seen it atleast 100 times if not more the the bad guys were pretty cheesy but will browning was funny i wouldn`t want to go to that camp spartigus either i believe him i think it`s a prison camp his sister should go there for thinking that shes so smart twoie the clone is smarter than her. i liked the music video part where he tell will i got that from a music video.",
         "Double Lawrence is a great movie! Little Lawrence is quite a star! The parents were great actors and so were the criminals. They should all be on 7th Heaven!",
         "I think that \"The Other Me\" was an amazingly humorous movie and I recommend that when you get a chance to watch it you do. Andy Lawrence did a great job along with everyone else involved in the movie. If you cannot see the movie then I recommend reading the book and if you have seen the movie then you should read the book also if you've read the book then you should see the movie. I think that the movie was a great reflection of the book.",
         "I wasn't expecting much when I started watching this straight to TV kids film but was surprised about how good it was. The story of duplication has been done so many times but often turns out to be lackluster, not in this case as the film was funny and very entertaining. Andrew Lawrence did a great job and conveys both sides of himself well (he seems more and more like his brothers every time I see him). The supporting cast were also good including Mark L. Taylor (Honey I Shrunk The Kids, Innerspace & Arachnaphobia). Even the token bumbling bad guys were entertaining (a rare thing in these type of films). Although they did seem a bit too similar to Harry & Marv from Home Alone nearing the end. I definitely recommend this film to anybody really, it's better than you'd think!",
         "Okay first off, let's just discuss grandpa Mordechai. I wouldn't trust him with any of MY buffalo. (i own a buffalo ranch with 27 buffalo, including one domesticated buffalo) hE DOESN'T EVEN UTTER A WORD TO HIS ACTUAL FAMILY UNTIL THE CLONE CAUSES HIM TO BUST A NUT. SUSPICIOUS? I THINK YES. He does kind of become a cool dude though. Additionally, the highlighter orange lipstick color worn by Will Browning throughout the film has made it into my top 5 lipstick shades. I'm considering manufacturing the shade as part of my new buffalo-safe cosmetic line, \"Buffalicious\". The only thing I really found off-putting about this movie is that Andrew Lawrence doesn't appear to have a philtrum throughout the film, which is a bit concerning, but can be cosmetically fixed. (i recommend Buffalicious\u0099) The sick dance numbers and choreography included in this film added just enough pizazz to give me a whirl. Absolutely stunning. Let me begin my emotional outpouring on the dadless wonder, Scotty. He has led a troublesome life being that he lost his father at the age of 2 to the cruel, unforgiving world. Yet he is more than just the tough cookie he appears to be behind his gorgeous maroon suit. (who needs a dad when you're already a daddy?) He hides a world of emotion that he is able to channel through his love of dancing at the junior social. As someone whose ancestors are said to be from Belgium, I appreciate the reference Twoie made to Belgium when deciding where he'd pretend to be from. \"Amen!\"",
         "Seriously, this is my favorite DCOM (Disney Channel Original Movie), I like the plot, it kinda reminds me of Multiplicity, but with only one clone instead of three. Anyways this needs a DVD release really bad! Funny thing, I'm actually trying to pitch a series to Disney XD with a similar premise. It's basically Multiplicity meets The Powerpuff Girls. I think the Disney Channel should show this more often then they do with their cookie cutter crap like Camp Rock and Teen Beach Movie. Nickelodeon did a similar film to this last year called Splitting Adam. The boy in that film had like 5 or 6 clones whereas the kid in this film only had one clone. I also reviewed it as well but found it mediocre at best, with only a few good moments but found it not as bad as the other crap that is shown on Nick. So check this out or watch it online. It's a really good film. It's too bad Disney is sexist and doesn't make good films like these anymore. At least Disney XD ponders to boys since Disney Channel only seems to ponder to girls and I find that pretty sexist.",
         "If \"Johnny Tsunami\" is the feel-good film of 1999, then \"The Other Me\" has got to be the feel-good film of 2000. I like this movie for so many reasons, including that it's fun to watch, it has great music, and it teaches an important lesson without getting preachy. Andrew Lawrence proved that he can hold his own as not one, but two main characters, as well as proving that he is not just a pretty face in the camera. Everybody who is casted in the movie (including Brendan Jefferson) did a great job, too. When I saw this movie for the first time, I was amazed by what a good job they did, and when it was over, I want to see it again. The one thing that sets this movie apart from other D.C.O.M.s is that you can relate to Will Browning, because you know how he feels and what he has gone through. The message of the movie is that you have to be not just yourself, but your best self. I really love this movie, and I hope it goes out on Disney DVD.",
         "When I first saw the movie, I was only going to watch it because I knew Tyler Hynes would be in it. But when I started watching it I liked the movie because it was funny, not just because he was in it.",
         "When I was going to see this movie, I thought it was going to be a schmaltzy flick. But I was wrong. This movie was great! It was a little bit of everything. It was funny, dramatic, romantic and most of all, funny."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": ["Alan Sacks Productions"],
      "summaries": [
         "Will Browning is a slacker student who needs a good grade in science, or he has to go to a military camp for the summer. Attempting to get a good grade by ordering a product called \"Ocean Pets\" for his project. Accidently, some clone formula leaked into his package. When stirring the ocean pet (and clone) mixture with a comb, he accidently creates a clone of himself. He sends the clone to school, because the clone is a lot smarter than him. Everyone likes the clone better than Will...",
         "Will Browning accidently creates a clone of himself when working on a science project."
      ],
      "budget": 0
   },
   "movielensId": 138010,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-08",
      "dvdReleaseDate": null,
      "directors": ["Manny Coto"],
      "runtime": 90,
      "movieId": 138010,
      "title": "The Other Me",
      "mpaa": "G",
      "actors": [
         "Andrew Lawrence",
         "Mark L. Taylor",
         "Lori Hallier",
         "Alison Pill",
         "Brenden Richard Jefferson",
         "Joe Grifasi",
         "Sarah Gadon",
         "Tyler Hynes",
         "Scott McCord",
         "Robert Buck",
         "Andrea Garnett",
         "Joseph Motiki"
      ],
      "imdbMovieId": "0246834",
      "originalTitle": "The Other Me",
      "genres": [
         "TV Movie",
         "Family",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Will Browning accidently creates a clone of himself when working on a science project.",
      "tmdbMovieId": 39242,
      "avgRating": 3.3,
      "releaseYear": "2000",
      "numRatings": 5,
      "posterPath": "/8XEWJB5YwLmdmyfl2MSZvpZ7IxF.jpg"
   }
}