{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2140423",
      "video": false,
      "title": "Sorrow",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Mila Sweeney",
               "gender": 0,
               "credit_id": "554112f2c3a36877ee00176a",
               "name": "Vannessa Vasquez",
               "profile_path": "/j3oYm2MjH6qQQaWh1M084nrvVVu.jpg",
               "id": 1367285,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Chief Gonzales",
               "gender": 2,
               "credit_id": "55411309c3a3681d9c001f2f",
               "name": "Andrew Sensenig",
               "profile_path": "/oiPTOeTpMnEHq1sydiLgsMtwDVa.jpg",
               "id": 141226,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Salinas",
               "gender": 1,
               "credit_id": "55411331c3a3681d98001e89",
               "name": "Mélissa Mars",
               "profile_path": "/vuAmewXLwGo2O4DFdmqcRPtCcLs.jpg",
               "id": 572475,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Dale Rogers",
               "gender": 0,
               "credit_id": "55411347c3a3681d98001e8d",
               "name": "Eric Martinez",
               "profile_path": null,
               "id": 1460904,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57ce781ac3a3682448002315",
               "name": "Millie Loredo",
               "profile_path": null,
               "id": 1675373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57ce782992514119f3000702",
               "name": "Millie Loredo",
               "profile_path": null,
               "id": 1675373,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "57ce783092514119ce000770",
               "name": "Millie Loredo",
               "profile_path": null,
               "id": 1675373,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.371902,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 337879,
      "vote_count": 3,
      "budget": 0,
      "overview": "A couple depraved killers find themselves in a different situation when survivor takes matters into her own hands.",
      "similar": [],
      "original_title": "Sorrow",
      "runtime": 90,
      "poster_path": "/wD0yRrfR3O9v5PE4NCUI6qilCPB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Films Vérité Productions",
         "id": 52360,
         "origin_country": ""
      }],
      "release_date": "2015-04-21",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Every Good Feeds On Evil",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Millie Loredo"],
      "runtime": 91,
      "synopsis": "A young woman is imprisoned and brutally savaged by sadistic serial killers. Escaping her captors she exacts revenge, only to end up in a cat and mouse game with the detective pursuing her.",
      "writers": [
         "Millie Loredo",
         "Millie Loredo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2140423/",
      "coverLink": null,
      "actors": [
         "Vannessa Vasquez",
         "Andrew Sensenig",
         "Melissa Mars"
      ],
      "reviews": [
         "I gave it a chance & watched it all. It's time wasted that I can't ever get back. The actress who played the victim needs some more acting classes. The male hoods, there's no help for them, really they need lots of help to make it past these low budget films. What was up with the sex paraphernalia at the beginning, it wasn't explained anywhere. The gun shots were worse sounding than a starter pistol. When the car hit the tree it was daylight then he next shot of it was when it was night. What happened to the escapees that was mentioned near the start? I could go on but this film wasted too much of my time so I won't waste yours.",
         "I have to agree, this has been the worst movie I have ever watched, albeit only for 30 minutes. I also agree how long does the camera need to be on hair & tweezers? the camera appears to be pitched on someone's shoulders, bumping, jerking.....and the acting!!!! well that has to be the worst I have ever seen. The story jumps all over the place, from one scene to the next not making and sense. I watched this on the basis of the first review, and let me tell you it will be my last time I read a review without reading all the others as well. Then I cant/wont blame anyone else but myself. I must admit, I will give it another go tonight.......I'll start from the beginning.....but I doubt I will get through it. I give the movie a 1.......only because there was no zero.",
         "I would have given this movie zero stars if possible, do not waste your time. I am a huge supporter of independent and low budget films but this was seriously bad even for the genre. The acting was extremely sad and most of the time over the top and just plain awful, the best acting was done by the strip club security guard who had no lines. I am not sure if this was meant to be a revenge film or just another bad people do bad things kind of film but either way the plot and storyline (or lack of both) made no sense whatsoever. I could go on and on about how bad this movie is and from reading other reviews the majority feel the same way, so unless you are trying to punish yourself avoid watching this film at all costs.",
         "Blair Witch Project had a more steady camera than this garbage. Horrible writing, acting, lighting, cinematography, and directing. When a movie has the same writer and director, I'm always worried- having a different director allows for two visions to unite and for the second person to see any plot holes the writer may have missed. Clearly this plot holed waste of time was written, directed, and produced by the same person- because no one in their right mind would green light this \"film\"... It's almost worth watching just to see how horrible it is. A few notes for anyone trying to make a B-Rate horror flick... 1. Opening credits are not needed when everyone is a NO NAME- thanks for wasting more of my time to read names I don't know or care about. 2. Get to the point, don't drag dialogue that is meaningless 3. Character development is not needed, unless it's an Oscar worthy performance- do not \"try\" to character development more than 2 people, I'm watching b- rate horror for fun, scares, and gore - not some backstory that means nothing on 5+ characters. 4. Lighting, yes you can cheat camera angles and film in 2 different locations and have it appear to be the same location- BUT when one angle has a blue tint and the other has a red, it's beyond laughable... Or when it's extremely sunny on the white guys face but the black girl has zero visible facial features bc it's so dark in the same room as the white guy. It's just sad, I've seen high schoolers make better movies. Do not watch, unless you want NO GORE, BAD ACTING, PLOT HOLES, and GAPS in the FILM, COMPLETELY MISSING AND UNEXPLAINED... It's not even funny how bad this movie is.",
         "The acting is so bad we had to turn it off after 10 min. Seriously.... I'm not sure what these other guys were thinking when they posted good reviews about this movie because it's was actually painful to watch. The entire cast seemed to just be reading their lines. There may have been an opportunity to have a decent plot but honestly you'll be too distracted by the horrific casting choices. The filming style was clearly due to a low budget, which is not nearly as distracting as the poor editing. Seriously how long does the camera need to be focused on hair in tweezers? Honestly I tried to watch it 3 times and just couldn't do it.",
         "\"Sorrow\" is a thriller that's tough to follow, a little confusing, and ultimately disappointing. The film starts with a crime scene, where one man overdoses, another woman is shot in the head, another man is killed by police, and another woman (Mila) is shot in the shoulder and wounded. When the police go to question her, she had left the hospital. Then, in a series of flash-backs, flash-forwards, and (I think) flash-sideways, we find out that after a nasty breakup, Mila got kidnapped by a series of three nutjobs. They keep her trapped in a house while they bring women back to the house and kill them. We follow her attempts to escape her plight. Meanwhile, in the current timeline story, the police are trying to track Mila down to find out why she was in that house and what happened... I respect the effort here. The acting is pretty good. The cast is unusually integrated -- the bad guys are a Latino man, a white guy, and a Black woman. The creep's victims are two white women and two Black women. Some of the scenes are well done. But too many problems hurt it. Police work is tough to do in a low budget film given how well they are done in TV police procedurals. There are leaps in logic -- the film never fully explains how Mila know some important information and the police reference acts that we know nothing about. And finally, the film fails to resolve the basic mysteries and questions that it raised. I won't say to avoid it, but when all was said and done, I found it a bit disappointing.",
         "this is one to watch I love horrors and this one has most of what I love in a movie, the plot is simple live in a house away from civilisation start hunting victims to kill or kidnap. It starts off with an investigation of the deaths of three people in a house, we find out through the course of the movie how it came about, the main subject of the film is a girl kidnap who manages to escape, the music is at its best in movies like this. Quite a few twists on the way in the story which leads the viewer to think they know the ending but hey wait for it, good acting all round superb ending. I hope we see more from the writer and director of these type of horrors.",
         "I admit, SORROW does have a good advertising campaign. The video cover is provocative and the synopsis, about a victim going after a couple of serial killers, is intriguing. A shame, then, that the resultant indie drama is nothing like it sounds. This is a real bore, a poorly-made mess of a movie, heavy on the dialogue and light on everything else. There's a lot of close up conversations and a couple of perilous moments but mostly it just feels padded and cheap.",
         "Watch the movie Sorrow last night and i must tell you that this movie will give you lifelong horror freak. This movie don't even give a second to blink eye. Actor Vannessa Vasquez steals the show, even Mary Etuk leaves good impression on my mind. She was amazing in gray shades. The sense of direction that director Millie Loredo has shown through this movie is commendable. The story takes excitement when Mila escape from the Police authority and become the suspect for the murder of two beasts like human. Even the role played by Andrew Senseni is simply out of this world, i really fall for his character. Talking about its story, well it is about Mila who got kidnapped by unknown people and later subjected to physical as well as mental torture. With the twists and turns the story engaged me throughout the film. This movie give a good scare to many of my friends and i loved it. The work that director of the movie shown is commendable as this movie is made under an independent film production. The acting of Mary gives life to the movie, her danger looks and unpredictable skills add her in my favorite actor list. Well i am really impressed with the kind of the work the cast has shown in the movie. With the perfect story and perfect cast, this movie really worth of your time. I am really looking forward to watch it for the second time. Well done Sorrow team."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Films Vérité Productions"],
      "summaries": [
         "A young woman is abducted by serial killers and subjected to brutal treatment. She escapes from her confinement and finds a way to return to exact vengeance. She then becomes a prime suspect in the investigation of the killing of her captors. After she is caught by the police, she accuses the Chief of Police of having been instrumental in hiding the serial killings which were committed by his son.",
         "A couple of depraved killers find themselves in a different situation when the survivor takes matters into her own hands."
      ],
      "budget": 0
   },
   "movielensId": 138186,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-04-21",
      "dvdReleaseDate": null,
      "directors": ["Millie Loredo"],
      "runtime": 90,
      "movieId": 138186,
      "title": "Sorrow",
      "mpaa": "NR",
      "actors": [
         "Vannessa Vasquez",
         "Andrew Sensenig",
         "Mélissa Mars",
         "Eric Martinez"
      ],
      "imdbMovieId": "2140423",
      "originalTitle": "Sorrow",
      "genres": [
         "Horror",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A couple depraved killers find themselves in a different situation when survivor takes matters into her own hands.",
      "tmdbMovieId": 337879,
      "avgRating": 1,
      "releaseYear": "2015",
      "numRatings": 3,
      "posterPath": "/wD0yRrfR3O9v5PE4NCUI6qilCPB.jpg"
   }
}