{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "epilepsy",
            "id": 1944
         },
         {
            "name": "hysteria",
            "id": 5083
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "19th century",
            "id": 207928
         },
         {
            "name": "inspired by true events",
            "id": 228523
         }
      ],
      "imdb_id": "tt2098628",
      "video": false,
      "title": "Augustine",
      "recommendations": [
         99880,
         68774,
         259045,
         12799,
         284280,
         42020,
         76329,
         98574,
         188765,
         64414
      ],
      "backdrop_path": "/xe4ZODMiWqLLOw0ZxJlhlN6Tu3w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Augustine",
               "gender": 1,
               "credit_id": "52fe4b0ac3a368484e1748db",
               "name": "Soko",
               "profile_path": "/fCG0PijoA0C7c0QoRhaJdKzp2FB.jpg",
               "id": 113857,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Charcot",
               "gender": 2,
               "credit_id": "52fe4b0ac3a368484e1748cf",
               "name": "Vincent Lindon",
               "profile_path": "/ttfk7etXzELkW1gMSo5eH8aEzjY.jpg",
               "id": 5443,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Constance",
               "gender": 1,
               "credit_id": "52fe4b0ac3a368484e1748c7",
               "name": "Chiara Mastroianni",
               "profile_path": "/mBrsvkCKYEM2RAyDpLxx3Tdge1F.jpg",
               "id": 20710,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rosalie",
               "gender": 1,
               "credit_id": "52fe4b0ac3a368484e1748d7",
               "name": "Roxane Duran",
               "profile_path": "/qHB2yyVufR6sYUF4Je9lJOPyVTO.jpg",
               "id": 544666,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Bourneville",
               "gender": 2,
               "credit_id": "52fe4b0ac3a368484e1748cb",
               "name": "Olivier Rabourdin",
               "profile_path": "/6txdehoOPpGllEsU31WnBkvgRJa.jpg",
               "id": 49278,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Verdan",
               "gender": 2,
               "credit_id": "52fe4b0ac3a368484e1748d3",
               "name": "Grégoire Colin",
               "profile_path": "/dkz109o3fl5PL4mak1ZhhU5tI35.jpg",
               "id": 136170,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "52fe4b0ac3a368484e1748df",
               "name": "Sophie Cattani",
               "profile_path": "/rAN3aKm3z2TLjAE0eeOICXQWiPs.jpg",
               "id": 124072,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4b0ac3a368484e1748c3",
               "name": "Alice Winocour",
               "profile_path": "/6FRfzVFkIAqn2AR5X8npzhXsW55.jpg",
               "id": 1051327,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "598ce1b59251414c520022af",
               "name": "Alice Winocour",
               "profile_path": "/6FRfzVFkIAqn2AR5X8npzhXsW55.jpg",
               "id": 1051327,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.09456,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 127856,
      "vote_count": 13,
      "budget": 0,
      "overview": "Set in Belle Époque France, the story follows nineteen-year-old \"hysteria\" patient Augustine, the star of Professor Charcot's experiments in hypnosis, as she transitions from object of study to object of desire.",
      "similar": [
         112160,
         3134,
         858,
         82695,
         141,
         634,
         242224,
         281957,
         1631,
         43923,
         437557,
         297762,
         2539,
         27586,
         713,
         2771,
         59468,
         9587,
         11236,
         13075
      ],
      "original_title": "Augustine",
      "runtime": 102,
      "poster_path": "/trg8NDjXWGhlbecFTFc7uPqm4Z2.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dharamsala",
         "id": 6937,
         "origin_country": ""
      }],
      "release_date": "2012-11-07",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alice Winocour"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Alice Winocour"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt2098628/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTM2ODA4MzE3N15BMl5BanBnXkFtZTcwODE2NjA0OQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Vincent Lindon",
         "Stéphan Wojtowicz",
         "Soko"
      ],
      "reviews": [
         "Maybe not worth an Oscar nomination, but the French singer SoKo did a great job with this role (not unlike the young actress, Quvenzhané Wallis, who did a great job in an otherwise a painfully flawed \"Beast of the Southern Wild\"). \"Augustine\" does a great job of highlighting the attitudes and practices that existed during the 19th century as psychiatry was trying to become a science. And as backward and ignorant as the beliefs of Charcot will appear to many, who lack a sense or knowledge of history, it is even sadder to think that Charcot was actually a genius compared to most of the people of his era, and that he was a definite improvement over the entire rest of human history that preceded the 19th century. At least Charcot tried to break out of the ignorance that enveloped (and still envelops much of) humanity when it comes to the \"mentally ill\" and the epileptic. The worse part of the movie is the ending, that final encounter between Charcot and Augustine after Charcot's presentation of Augustine to a group of French scientists; it just didn't make sense. But overall \"Augustine\" is better than average...and nowadays that's a lot since even better-than-average films are so rare.",
         "This slow and subtitled French film that is based on actual events won't be one many are going to out-right enjoy although I found it to be rather interesting as I find its subject matter -- 19th century female hysteria -- to be most fascinating. The film is about Augustine, an illiterate young French housemaid (played by French singer/actress Soko), who suffers a debilitating seizure one evening while serving dinner that leaves her partially paralyzed. She is thus admitted to the Parisian psychiatric hospital, Pitié-Salpêtriere, where she is diagnosed as a hysteric (!) and treated by renown physician Jean-Martin Charcot (Vincent Lindon - Mademoiselle Chambon). The medical world of the 19th century was dominated by uber-intelligent men (that \"intelligent\" part could be debated) and it was common for a woman who experienced something that a man couldn't easily explain and/or understand to be diagnosed with \"hysteria\" (a \"nice way\" of saying a female sexual perversion). If a woman acted in any manner society found confusing or even slightly objectionable, she was a \"hysteric\" who could find herself institutionalized and subjected to some horrifyingly abhorrent and offensive \"treatment(s)\" at the hands of men who claimed a medical interest in her well-being. The time period and \"understanding\" of this predominately female ailment IS genuinely fascinating and if this topic sounds even remotely intriguing, I implore people to seek out the topic and read up on it as Augustine is merely about A case -- AN instance -- in this outrageously baffling era of medical (mal)practice when many male doctors found it to be en vogue and \"fashionable\" to make these diagnoses! The level of quasi-ignorance shared by these male \"geniuses\" in the medical field who simply did not understand women is mind-blowing. I think a better film would have focused more on the doctor and his evolving understanding of hysteria over the years that followed this brief amount of time spent with this one patient, Augustine. There is a reason the film was not entitled Charcot. Instead, the direction of Alice Winocour (a WOMAN!!!?!) has used a specific example to reveal a sad universal truth of the time and expose just how farcical this \"ailment\" was while subtly implying perversions may have lain elsewhere. As Winocour's first full-length feature film that is clichéd a time or two, she shows much promise. Diagnose that, Charcot! Again, the movie is hard to simply \"enjoy\" but it is one that could hopefully shed some more light on this bizarre chapter of modern medicine.",
         "This is rather a sensationalised and eroticized rendition of filmmaking loosely based on facts. Although well acted, well filmed and very intriguing throughout, it nonetheless did not treat the subject material in a way that fully depicted what countless many young women of the day endured: early sexual abuse and it's life-harming effects. One of the factual details that is notably absent from Winocour's film is the sexual assaults the young Augustine suffered at the hands of an employer with whom she was placed by her mother at age thirteen. The details of her rape do not get mentioned and neither does her trauma,or the information that the attacks began soon after. From the symptoms of her 'illness,' in this film, the causes or triggers for Augustine's episodes often feature in scenes of animal cruelty. The film does not treat her history of sexual abuse and it has Augustine enter the Salpêtrière at age nineteen, while, in fact, she was fourteen when she began her stay. Very much younger. Still a child. If the filmmaker had stuck to a factual rendition of how so many girls were sold or traded or sent off to work in situations where they were never protected, never able to protect themselves and where the theme of the day in most of Europe was early sexual abuse of horrific proportions, there may have been a film that explained how generationally women have been exploited, manhandled, marginalised and mistreated almost as point of course. A hugely wasted opportunity to make an important film.",
         "French screenwriter and director Alice Winocour's feature film debut which she wrote, is inspired by medical records regarding a French 19th century neurologist, who bestowed the eponym for Tourette Syndrome on behalf of his student named Georges Gilles de la Tourette, and his relationship with a patient. It premiered in the International Critics' Week Special Screenings section at the 65th Cannes International Film Festival in 2012, was screened in the Discovery section at the 37th Toronto International Film Festival in 2012, was shot on location in France and is a French production which was produced by producers Emilie Tisne and Isabelle Madeleine. It tells the story about a woman named Augustine whom after having a severe seizure in the house where she and her cousin named Rosalie is working, is sent to the Hospital De La Salpêtrière in Paris, France and told that she will have to stay there. At the same time, a professor at the hospital is studying a disease called hysteria. Distinctly and subtly directed by French filmmaker Alice Winocour, this finely paced and somewhat fictional tale which is narrated mostly from the two main characters' viewpoints, draws a refined and increasingly intriguing portrayal of a young woman whom after experiencing another one of her strange seizures at a modernized psychiatric hospital catches the attention of a prominent French neuroscientist who lives with his wife named Constance and their pet named Zibidie and who immediately begins examining her. While notable for its distinct and atmospheric milieu depictions, sterling cinematography by cinematographer Georges Lechaptois, production design by production designer Arnaud De Moleron, costume design by costume designer Pascaline Chavanne and use of colors and light, this narrative-driven story about coming-of-age, how hysteria was perceived in France at that time and particularly how this affected women who were those most likely to be suspected of having and being diagnosed with this mental illness, depicts two dense studies of character and contains a great and timely score by English composer Jocelyn Pook. This historic, austere, modestly erotic and consistently involving period drama and chamber piece which is set during a winter at an institution for women with variegated mental conditions in the capital city of France in the late 19th century and where a nineteen-year-old French kitchen maid whom is praying to be cured becomes infatuated with the person she believes can cure her and a middle-aged man named Jean- Martin Charcot whom is looking for funding from an academy finds a rare patient who might convince them to support him with his studies, is impelled and reinforced by its cogent narrative structure, subtle character development and continuity, poignant instrumental tones, scenes between Jean-Martin and Augustine and the reverent acting performances by French actor Vincent Lindon and French actress and musician Soko. An eloquently atmospheric, distinctly cinematographic and brilliantly romantic mystery and a whole-heartedly executed directorial debut.",
         "No aspect of filmmaking is less than terrific in AUGUSTINE. The acting, props, camera work and direction are top notch. The tale intrigued me from beginning to a surprising and spectacular ending. There's a scant half dozen COMMENTS so far for this film and I won't pass judgment on the ones that take issue with the substance of the film; i.e., female hysteria, 18th century ideas of treatment and civil liberty, male domination, etc. To me such are besides the point. It is what it is - or rather, was what it was. AUGUSTINE is driven by -no, is exclusively about- two individuals trapped in their settings and stations and the human chemistry that results. AUGUSTINE is the movie that A DANGEROUS METHOD wanted to be. I was fearful that French cinema was descending into Americanized garbage. AUGUSTINE eases such fears.",
         "**SPOILER FREE*** I couldn't write this entire review without spoilers but I'll write a short one without any. This is the story of Augustine, a 19 year-old woman who is sent to an asylum because she has crises and is apparently 'possessed.' She is treated by Charcot (Vincent Lindon) who was a real french doctor who worked with hypnosis to treat hysteria and made several advances in the field of Parkinson and sclerosis. Here however, Charcot's skills seem mostly to take off girl's clothes. Nothing is said about what Charcot really does or why he does it. He uses hypnosis to observe Augustine's crises but he doesn't really seem to care for the other patient. He quite obviously wants to sleep with Augustine and has a really nice monkey at home. That's what I walked away from. The film itself would have been quite good if not for major plot holes. Vincent Lindon whom I love, was quite fantastic in this, as usual, as was the girl playing Augustine. It seems the film is going somewhere until the very end when you realize it really isn't. It's too bad because, because Augustine was 'almost' a very good film. ***SPOILERS*** Augustine, following one of the biggest crisis is left with paralysis on her right side (it seems she can still move however, but she can't open her eye and she can't feel anything.) She is obviously sexually repressed and at age 19, still doesn't have her period. Charcot writes in his diary that she is starting to feel better. She had a dream that animals were being bled and now she has her period! Like magic, because Charcot really didn't do anything in the film, as far as we're aware. Then she has another crisis and the paralysis moves to her left side. But she can still move everything except for her arm. Charcot undresses her a few times and decides he wants to present her to the academy to get more funding. But just before the presentation, she falls down the stairs and can move her arm! So she decides that she is healed (even though her main issue was her recurring crises) and she fakes a crisis at the academy, going all out to touch herself while looking Charcot in the eye. Huge sexual build up of course, so Charcot leaves everyone at the academy to go have sex with Augustine and then he lets her escape the asylum. So what is the morale of the film? No one realized just because her paralysis is temporarily gone doesn't mean she is healed? Was she just so horny it caused her not to move? They had really good substance and wasted it to make this film a sexual affair between Charcot and Augustine. I did still enjoy the film beyond that, I am disappointed.",
         "This is beautifully acted but of course you would expect that from the likes of Vincent Lindon and Chiara Mastroianni. It seems that the female lead, Soko, is also a pop singer in France and if so, and if she continues to act in films it's good to know that whatever their respective abilities as vocalists (and I know nothing of either) she definitely outclasses Vanessa Paradis in front of the camera. Apparently there was a real neurologist in 19th century Paris named Charcot so the chances are he also treated a patient called Augustine. I'm inclined to question, as did the other two people who have written here, the actual point of the film. As I said it's beautifully acted and well photographed but it seems to lead merely to the ultimate 'transference' between patient and doctor that's less than credible. Despite having a beautiful and desirable wife in the shape of Chiara Mastroianni, Lindon seems totally indifferent to sexual attraction and totally absorbed in his work. He is also played as a person who is himself totally lacking in charisma and/or sex appeal and not the logical object of desire by a girl who, at nineteen, is young enough to be his grand-daughter. These caveats to one side the film did hold my attention and its heart if nothing else is in the right place.",
         "This film kept my attention from start to finish. Beautiful woman, mysterious ailment, reserved doctor, 19th century setting, beautiful costumes, beautiful settings and scenery. Sensuous undertones and a dash of smoldering sexually. I must watch again, this time with my lady. I am a man of letters and my review is more than adequate. Requiring ten lines before a review may be published does a disservice to those who write reviews and those who read (or more accurately, can not) the reviews. This film kept my attention from start to finish. Beautiful woman, mysterious ailment, reserved doctor, 19th century setting, beautiful costumes, beautiful settings and scenery. Sensuous undertones and a dash of smoldering sexually. I must watch again, this time with my lady. I am a man of letters and my review is more than adequate. Requiring ten lines before a review may be published does a disservice to those who write reviews and those who read (or more accurately, can not) the reviews. This film kept my attention from start to finish. Beautiful woman, mysterious ailment, reserved doctor, 19th century setting, beautiful costumes, beautiful settings and scenery. Sensuous undertones and a dash of smoldering sexually. I must watch again, this time with my lady. I am a man of letters and my review is more than adequate. Requiring ten lines before a review may be published does a disservice to those who write reviews and those who read (or more accurately, can not) the reviews."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Dharamsala",
         "France 3 Cinéma",
         "ARP Sélection"
      ],
      "summaries": ["A look at the relationship between pioneering 19th century French neurologist Dr. Jean-Martin Charcot and his star teenage patient, a kitchen maid who is left partially paralyzed after a seizure."],
      "budget": 0
   },
   "movielensId": 138234,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2012-11-07",
      "dvdReleaseDate": null,
      "directors": ["Alice Winocour"],
      "runtime": 102,
      "movieId": 138234,
      "title": "Augustine",
      "mpaa": "NR",
      "actors": [
         "Soko",
         "Vincent Lindon",
         "Chiara Mastroianni",
         "Roxane Duran",
         "Olivier Rabourdin",
         "Grégoire Colin",
         "Sophie Cattani"
      ],
      "imdbMovieId": "2098628",
      "originalTitle": "Augustine",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["irSSZumpYS4"],
      "plotSummary": "Set in Belle Époque France, the story follows nineteen-year-old \"hysteria\" patient Augustine, the star of Professor Charcot's experiments in hypnosis, as she transitions from object of study to object of desire.",
      "tmdbMovieId": 127856,
      "avgRating": 2.9375,
      "releaseYear": "2012",
      "numRatings": 8,
      "posterPath": "/trg8NDjXWGhlbecFTFc7uPqm4Z2.jpg"
   }
}