{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1863203",
      "video": false,
      "title": "The Employer",
      "recommendations": [
         60095,
         149592,
         124873,
         318666,
         228417,
         298296,
         129798,
         163440,
         204761,
         155391,
         99254,
         36868,
         113693,
         346079,
         34195,
         78088,
         292988,
         25212,
         203186,
         31605
      ],
      "backdrop_path": "/rLP1ktfRbFOmg8sWEdbfO1I9aZW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "The Employer",
               "gender": 2,
               "credit_id": "52fe4c789251416c910f5e87",
               "name": "Malcolm McDowell",
               "profile_path": "/lnVJ6J8szi86ssDTfyvZSl8lnlr.jpg",
               "id": 56890,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "James Harris",
               "gender": 2,
               "credit_id": "52fe4c789251416c910f5e8b",
               "name": "David Dastmalchian",
               "profile_path": "/3cdrnfthY40ZsIhq1FBEwGJq9mE.jpg",
               "id": 83854,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sandra Turner",
               "gender": 0,
               "credit_id": "52fe4c789251416c910f5e8f",
               "name": "Paige Howard",
               "profile_path": "/rLz572sfLnsVvV48p2RfSbcZIo0.jpg",
               "id": 210021,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Keith Caverns",
               "gender": 2,
               "credit_id": "52fe4c789251416c910f5e93",
               "name": "Michael DeLorenzo",
               "profile_path": "/dvLq2SvYF8XjS5ZbyDpPnVr49jZ.jpg",
               "id": 52422,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mike Drake",
               "gender": 0,
               "credit_id": "52fe4c789251416c910f5e97",
               "name": "Matthew Willig",
               "profile_path": "/qPWs6LInHJ5ioGUO2Ij0GJ7mbwH.jpg",
               "id": 92617,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Billie Lewis",
               "gender": 1,
               "credit_id": "52fe4c789251416c910f5e9b",
               "name": "Katerina Mikailenko",
               "profile_path": "/tjvyf6SzNag87zvGxbcAUcpNEpc.jpg",
               "id": 1031099,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Alan",
               "gender": 2,
               "credit_id": "52fe4c789251416c910f5e9f",
               "name": "Billy Zane",
               "profile_path": "/lkwvmo7vVL8TpMCDLRoHjZIkJQ4.jpg",
               "id": 1954,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Maggie Jordan",
               "gender": 1,
               "credit_id": "52fe4c789251416c910f5ea3",
               "name": "Nicki Aycox",
               "profile_path": "/nuq3ChJ6arKPgpM3MTnaE4bgavn.jpg",
               "id": 42374,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ted Simpson",
               "gender": 0,
               "credit_id": "52fe4c789251416c910f5ea7",
               "name": "Daniel Aldema",
               "profile_path": "/9CWbasmEcSAPoTgfYKwTIKm7DEn.jpg",
               "id": 1171645,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Police Officer",
               "gender": 0,
               "credit_id": "56ad08bf9251417e20006aa6",
               "name": "Tony Casale",
               "profile_path": "/fsq5pQtYBk3v2osMmGNdldr0CwQ.jpg",
               "id": 1570274,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Carrie",
               "gender": 1,
               "credit_id": "595a7c1fc3a36828a104898a",
               "name": "Erin Soto",
               "profile_path": "/rruITP2hauxbdgtZTLw42jRGGJD.jpg",
               "id": 1340944,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c789251416c910f5e7d",
               "name": "Frank Merle",
               "profile_path": null,
               "id": 562142,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c789251416c910f5e83",
               "name": "Frank Merle",
               "profile_path": null,
               "id": 562142,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2b40c3a3681604000cd8",
               "name": "Jonathan Hartman",
               "profile_path": null,
               "id": 1960721,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2b9492514154e4000d7f",
               "name": "Jon Mendenhall",
               "profile_path": null,
               "id": 1337217,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2ba40e0a263a2d000ec1",
               "name": "Sean Ludan",
               "profile_path": null,
               "id": 1636850,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2bce92514154e7000da6",
               "name": "Tiago Mesquita",
               "profile_path": null,
               "id": 1636840,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2c43c3a368162e000f58",
               "name": "Jennifer Grace Farmer",
               "profile_path": null,
               "id": 1960736,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a5d2c51c3a36815f1000e67",
               "name": "Malcolm McDowell",
               "profile_path": "/lnVJ6J8szi86ssDTfyvZSl8lnlr.jpg",
               "id": 56890,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2c900e0a263a33000f11",
               "name": "David Albert Pierce",
               "profile_path": null,
               "id": 1960737,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2caac3a368161e000f01",
               "name": "Chris Roe",
               "profile_path": null,
               "id": 1501538,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2cc8c3a36815fe000d10",
               "name": "Frank Merle",
               "profile_path": null,
               "id": 562142,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2ce692514154e4000ea3",
               "name": "Tiago Mesquita",
               "profile_path": null,
               "id": 1636840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2cfd0e0a263a1e000f83",
               "name": "Ross Otterman",
               "profile_path": null,
               "id": 1223227,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a5d2da30e0a263a3300102a",
               "name": "James Cooney",
               "profile_path": null,
               "id": 1423742,
               "department": "Directing",
               "job": "First Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.888456,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 191094,
      "vote_count": 14,
      "budget": 0,
      "overview": "Five highly qualified applicants interview for a coveted job with the Carcharias Corporation, a powerful conglomerate whose business practices are shrouded in mystery. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape. Soon the true nature of their situation is revealed when they receive a phone call from the mysterious CEO of Carcharias, known only as The Employer. He informs them that they are about to experience the final interview, but it's not at all what they were expecting.",
      "similar": [],
      "original_title": "The Employer",
      "runtime": 85,
      "poster_path": "/xmSyETSbaLBcgXsE1CT3hr2Y9VS.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hyrax Entertainment",
            "id": 99695,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vision Films",
            "id": 37208,
            "origin_country": ""
         }
      ],
      "release_date": "2013-06-07",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "How far will they go to get the job?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Frank Merle"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Frank Merle"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1863203/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE1MzU0NjE0MF5BMl5BanBnXkFtZTcwNzY2Mjc0OQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Malcolm McDowell",
         "David Dastmalchian",
         "Paige Howard"
      ],
      "reviews": [
         "Well that was boring, halfway through I began fast forwarding through the rest. The premise of people trapped in a room, is old. People trapped in a room for a job, has already been done too (can't remember the name of the movie though). The production value is inexistent. My HDCam makes better pictures than what I've seen here. Acting is bad, lighting is awful, score is generic, nothing in this movie is new. McDowell played 6 minutes in this movie, he probably just needed a morning to get the filming done. Well, lately he showed up in Z-Grade movies anyway. Seeing him casted is a strong indicator for a poor movie. Please excuse my low quality review, but I just did it to balance the 10/10 fake reviews written by the PR guys.",
         "I've seen so many of these types of movies. Cube (also has 2 sequels) was one of the earlier good ones (where random people are stuck in various adjoining rooms with \"puzzles to solve\"). A more recent one that is better than Employer is Exam (2009) - rated 6.8 and with many great twists. Other similar movies involving people killing each other off in a \"room\" include: Devil 6.3 (2010) - people stuck in an elevator, The Killing Room 5.7(2009) - people in an scientific experiment, Unknown 6.5 (2006) - people stuck in a warehouse, Fermat's Room 6.6 (2007 - foreign language) - 4 mathematicians in a rm, The Method 7.3 (2005 - foreign language) - interview process Overall Cube (the first one) wins with 7.4 rating and oddly enough being the oldest (1997). Enjoy these movies if you like the genre.",
         "This was truly a disappointing movie. When I read the description, I thought it would be something similar to that one movie about the test, where candidates compete with each other for a job position. I was expecting lots of twists and mind games that would keep me guessing who the winner will be. There was none of that. A weak plot with no explanation in the end. Characters also do not make sense. A strong muscular guy who gets choked to death with a tie who just got his head bashed in? He could have easily overpowered the strangler. Or how about a skinny girl who can easily disarm the muscle giant and pin him to the ground but cannot take on 2 defenseless person her size? Save your time and money for a better, deserving movie because there was nothing thrilling about this thriller.",
         "Another story about a group of strangers locked together in an enclosed space, hoping for a way out. In here, these five are job applicants; in the last step to join a powerful corporation, only one can leave the room with the job... and their life. I really like this kind of film; it is always such a psychologically heavy concept, often accompanied by interesting twists and thought- provoking mindgames... Unfortunately, 'The Employer' fails in that aspect. The movie is too short and moves too fast to create the necessary tension in the room scenes, and the characters/actors are so bad they are unable to create any interest in the viewer. And it is far from just the actors' faults (though they have their share on it): the characters are horribly conceived and developed, their actions not making sense and being overly ruthless/psychopathic to the point of being unbelievable/almost cartoonish. This makes the twists almost pointless and their impact almost nonexistent. The psychological aspect the film needed ends forgotten and ignored. Malcolm McDowell is the only one to do a good job, and his character is quite fun to watch (though equally bad). A sharp contrast to the otherwise terribleness. In the end, this film is far too moronic and badly made. It can't even pass as a idiotic, semi-gory thriller, as the anti-capitalistic stance the film seems to defend (considering the way they portray the big corporations) show they tried to make this have some kind of half-assed message. In other words, they actually believed this could be good. I give it a 4 just because I love this concept, which made me try to like it, but in the end it could very well receive a lower rating. Much better choices would be 'Exam', 'La habitación de Fermat', and even the 'Cube' franchise.",
         "I just caught this movie and it was a powerful look at capitalism. The monologue by Malcolm McDowell at the end of the movie helps to deconstruct the basic ideals of the corporate world. Endure with this murderous tale filled with hopes of a peaceful escape, where the gore is aptly used for effect, stereotypes questioned and the interview process taken to a whole new level (while still being relateable to the actual job market). The variety of roles, the differing characteristics of the main five characters; all fitted in with flashbacks to show \"how they got there?\" and the overlooking McDowell. With Billy Zane at the end, the use of music, good interview questions which foreshadow the coming violence and the simplicity of the characters and their lives help to fill out the 90 minutes extremely well. Watch it at night to help set the atmosphere, and for some reason reminded me of \"Cube\". 6/10 - got across what it set out to do with interesting shifts and entertaining, didn't try to do too much and built the characters slowly (but the interviewing flashbacks reveal future actions later in the movie).",
         "Can someone explain to me where the thriller part was? At least I have found the fast-forward button on the remote control. Put 5 people in a closed room with the following task : who leaves that room alive gets a decent job offer. And after that you can see how creative a person can be with a belt, a stiletto heel or a piece of a mobile phone. This was an incredible empty and dismal movie. The acting was so tragically bad you could start crying. Even the crying part of Willig was so pitiful. The rest of the candidates were third-rate actors to me. Very bad performances. Worst of all, the fact that McDowell joined this made me speechless. From \"A Clockwork Orange\" to this monstrosity ... how low can you fall. Probably a new trend in movie land: put a known actor on the DVD box so that there is a minority who'll do the effort to watch it. I also fell for this marketing trick. Something I have learned from this film: I'll be very suspicious when I'm applying for another job. I give this one a 1/10 just for myself because I did the effort to push the \"Play\" button ! More reviews at http://opinion-as-a-moviefreak.blogspot.be/",
         "Finding a job these days is tough, especially one that actually pays the bills. The search could even be described as a \"true horror story\" for some; even if you do land an interview, often you can get beat out by a more qualified candidate. Frank Merle, the writer and director of the new horror thriller, \"The Employer,\" takes this idea to a whole new level: in this interview, you either get the job or die\u0085 It's a now classic set-up. Five strangers wake up in a locked room. Before long, they realize they have something in common: they have all recently interviewed for a position at the mysterious Carcharias Corporation, and today is supposed to be their final interview. Unbeknownst to them, The Employer (Malcolm McDowell) has a very sinister way of choosing the perfect candidate for the job. You see, at Carcharias Corporation, having a well-rounded resume is only half the battle. What's the other half? It's killing the competition before they kill you first. Last one standing gets the job of their dreams\u0085 The great part about a film like \"The Employer\" is that it takes a familiar premise and gives it its own unique and rather intelligent spin. Yes, pitting people against each other in a locked room has created some pretty grisly horror films, but \"The Employer\" isn't about the gore; it's about the characters. Merle creates a group of very fleshed out young professionals who have every reason in the world to try to get ahead. It's more fun to get to know the characters first before they're brutally murdered as opposed to watching strangers get hacked up; it makes for a much more satisfying viewing experience. But while Merle crafts characters who are undoubtedly justified in their reasons to despise each other, he also brings out strong performances by five very talented actors. The scenarios he sets up for these interviewees are amplified by their terrific performances. Everyone brings something to the table, and everyone has a secret. James, played by David Dastmalchian, is our Everyman and is wonderfully naïve and hopeful that in this terrifying scenario maybe, just maybe, nobody has to die. It really feels like at any moment Dastmalchian could break out and become a recognizable face for frequent moviegoers, and a film like \"The Employer\" certainly allows him to show some great range. Opposite him is the beautiful Paige Howard who plays the kind and caring Sandra. It's hard not to root for these two; their chemistry is strong, especially when the going gets tough. Juxtaposed against this optimistic, seemingly level-headed pair are our other three captives: the sexy and ass-kicking Billie (Katerina Mikailenko), the bruising and massive Mike (Matthew Willig) and the loudmouth Kieth (Michael DeLorenzo). Five very different people in one nightmarish interview, \"The Employer\" creates a tense and unnerving experience that gets to be a real free for all with plenty of twists to keep you guessing who's going to get the job. Which brings us to our last and most important piece of this puzzle: The Employer himself, Malcolm McDowell. As the puppet master of this whole scheme, it's extremely fun to see The Employer get inside of the heads of these characters and find out exactly what makes them tick. It's always fun to see McDowell play a bad guy, but in \"The Employer\" he's even more dementedly charming than usual. Every time McDowell is on the screen he steals the show, which is understandable given his ultra-talent. He embodies the mission of the Carcharias Corporation and adds a level of mystery and intrigue that we can only hope for a sequel (or two) to expand upon. And maybe that's the real reason this movie was so enjoyable: the fact that it asks more questions than it answers. While Merle's intentions for making this film are unknown, \"The Employer\" raises a lot of questions not only about its own reality but also our own, and frequently plays with moral questions that we deal with on a daily basis. How often do we see people doing anything to get ahead of the competition, or a massive corporation treating its employees like pawns in its own sinister game? Merle has created a film that is modern, violent and full of nasty twists, \"The Employer\" grabs you and won't let you go. Lastly I'll leave you with this, the same thing that Merle told me before I watched the movie and the thing that probably intrigued me the most: at the end, only one person walks out of that room alive\u0085 Check out our other indie horror reviews at LAHORROR.COM",
         "I found out about \"The Employer\" from a friend's recommendation. And I'm glad I did! As the film begins, I am pleased to see Malcolm McDowell's cold, calculating dialogue – I became a fan of his from his work on HBO's \"Entourage.\" I enjoy his almost sinister and cut-throat portrayal of a powerful executive in that series. In \"The Employer\", there is nothing 'almost' sinister about his character\u0085 he truly is a villainous madman! I later did some research and found that McDowell stars in the infamous Stanley Kubrick film \"A Clockwork Orange.\" (I didn't know that! Pretty impressive.) The story unfolds as five job applicants wake up in a locked vault, after being drugged. They piece together that they all are vying for a \"life-changing\" job at the Carcharias Corporation. We soon find out that their supposed last interview is actually set up as a kind of death match by McDowell's character, The Employer. What I like about this film is that it uses character dialogue and flashbacks to tell the story. It's interesting to learn how each individual ends up in their current predicament. I also personally like the character 'Billie.' She's a tough, hot, sexy, ass-kicking brunette! Actually, I find that all the characters have something to offer, even the sociopathic 'Keith.' It's like each character reminds you of a part of yourself - that you either recognize or are in denial of, haha. Plus, the thrills, surprises, and violence in the story are what you come to expect out of a movie of this genre - supported with a cameo by none other than Billy Zane! Enjoy!",
         "I was tempted to watch this movie by nice and neat title and poster. And oh, God, this was terrible mistake. The plot is boring and predictable, because idea of kill-others-to-survive in this movie seen thousands and thousands times. The movie gives you almost nothing about the company, neither about the employer itself - what they're doing or why etc. So no strong background for the plot. And this is why this movie seems not as serious as others in this kill-to-survive category. Most of the flashbacks were not interesting, boring and almost unnecessary as they don't really untangle characters as much as you would want. I don't know if this supposed to be gore or psychological movie, but it really lacks both of those elements. You can't feel the intensity, suspense in this movie (like in Would You Rather, which I really liked). At all. Action in kidnap flashbacks is all the same. Well, IMHO, it could be more original than just grab-and-go. Half of the actors seems like they're don't know what they're doing here. I've seen hundreds of thriller movies, in which you can really feel what characters feel etc. Hell, even in Yotube short-movies you can see better acting. So I guess it is a one night stand movie with bad hangover. Not bad, but it could be far more intensive as it supposed to be thriller, right?",
         "Why does Malcolm McDowell keep doing these bad movies playing a cheesy cliché villain? He has acting chops and could do so much better. Most of the other actors are mediocre at best. This movie is like a bad play with five actors stuck in one scene. This has been done so many times before and it has been proved to require outstanding talent to pull it off. The premise of this movie is just ridiculous. Even the special gore effects look really fake like a joke horror film. All I enjoyed in this movie was the good looks and body of Katerina Mikailenko. This movie is the epitome of the idiotic Republican thinking (ruthless amoral selfish philosophy, and corporate scamming masquerading as \"Capitalism\") which has ruined this country. I just hope that its message was ridiculing and not extolling.",
         "Bunch of \"random\" people wake up locked in a room, and they are all lying about themselves. Sound familiar? it should this movie seems to come out every few months with a different name, group of people, and relative story, but it is the same movie. Yes, I agree we are all very lucky to have Malcolm McDowell acting, and voicing everything, I just wish more of it was good is all. He plays the Devil, or God, or an omnipotent figurehead of one form, or another all of the time, and we have seen all of those characters enough I think. This movie just does nothing new, and for the most part pulls it's own punches, and comes up very short on the realism, or motive enough for most of these people to even be there. Not a good enough movie for what they had to work with. I did not Enjoy this, and I do not think most people will either. The webs are unraveled, and you no longer care.",
         "Merle does an excellent job of synthesizing both drama and suspense to create one of the most interesting movies I've seen in a very long time. We're lead to believe that its characters don't meet by chance, there's a real reason behind the sinister plot that encourages a vicious, dramatic performance. We're lulled in slowly, as we discover the real reason the characters are there, what they were doing the night before, and the lengths they would go to acquire their position in the company. A lot of movies out there try to deal with the concept of Darwinism and natural selection, surely, but what happens when the business world adopts that mentality? Hasn't it already adopted that worldview? Success and profit mean everything, by whatever means necessary. The Employer is a fascinating story of human psychology, ethics and the latent animalism that lurks within us all. Seemingly ordinary people whose one goal right now is to become millionaires are put side-by-side to uncover one of the most startling revelations--if that were me, I'd have done what they did. We watch as a spectators, but we're really watching ourselves--this is exactly what we would do if we were forced in these circumstances. What're you waiting for? If you think Tom Cruise's Collateral had the natural selection argument, wait till you see The Employer. Let's get hired!",
         "\"Nobody Dies\" That is what James Harris (David Dasmalchain) tells the group of 4 other applicants when he discovers that in order to win a job at the mysterious \"Cacharais Corperation\" they must murder each other until only one remains. It is a high minded ideal, but will it win out against the cold realities of their circumstances? These are the brutal circumstances put forth by \"The Employer.\" Will they try to make it out together? or will their own fragile natures ensure their demise? Through flashback we see each of the characters interview with the mysterious Employer (Malcolm MacDowell)here we see their strengths, but more importantly their weaknesses. In addition to James the everyman there is the seemingly sweet and naive Sandra (Paige Howard), the stylish grad student Billie (Katerina Mikalilenko) the fast talking huckster Keith (Michael Delorenzo) and the gentle giant Mike (Matthew Willig) who has ample brains in addition to his brawn. After James declaration tensions arise and insecurity about survival starts to gnaw away at them. Add in a cameo from Billy Zane and you have a great thriller that utilizes character development and suspense, not cheap tawdry gore. \"The Employer\" adept commentary on our insecurity regarding today's job market shows that director Frank Merle is a bold new voice in not only the realm of horror, bit all of cinema. I wholeheartedly recommend it!",
         "\"The Employer\" is a psychological thriller. It's about five total strangers locked in a room together. They find out they are candidates up for the same position at the Carcharias Corp. \"The Employer\" is a thriller and full of suspense. The only way out of this final interview is if you are the last one to survive. It seems fear turns you into a killer rather quickly. All five candidates have different character qualities about them, some more ruthless than others. The scary thing is you can see yourself in these characters. And wonder could this ever happen to you. Yes it could, but hopefully you are lucky enough to slip by freaky companies like this one. I found myself rooting for a couple of characters in the film. You will too. You are rooting for them to win the position (which means you are rooting for them to be the last one alive). After watching this movie, I don't think I want to land any job interviews!",
         "Do you like claustrophobic horror flicks in which people's weaknesses are exploited so that the worst comes out in them, resulting in murder? If so you will like this film, I did. The Employer asks an honest question. What are you will to do for an awesome job that will allow you to get away with anything and to probably get really rich? The five contestants in this film are willing to do anything. In this case that means surviving this 5-way massacre/job interview, and more than likely killing a few people along the way. The film written and directed by Frank Merle, plays on the cold-heartedness of big business in America. I enjoy the polarities Frank draws between killing people, and killing businesses, which is what the Carcharias Corporation apparently does. I also found the death by stiletto heel to be very enjoyable, as was the performance by Michael Delorenzo, as Keith Caverns. Michael has a certain way of making you hate the character he portrays, which is exactly what the Writer/Director wants.",
         "What would you do to go from being in debt, to having a six figure position? What would you do to make a lot of money? These are the questions asked in Frank Merle's well thought drama, The Employer. We the viewer do not know what the job is; but the five candidates know exactly what is at stake. When the final interview takes place, we see how far some will go just to be the person hired. The concept of The Employer is in the realm of movies like Saw or The Hunger Games. There are five people locked in a room and the only way to get the coveted job is to be the last one alive. All five have been drugged or knocked out cold and wake up in the safe locked room. Some remember the last thing they were doing and some have no idea how they got there. A cell phone is found on one of our main characters, James Harris (David Dastmalchian). They receive a phone call from The Employer to let him know that they cannot call the police and that after each person dies, a code to the door would be given to unlock. Soon, they all realize that they have interviewed for the same position and the ambiguous Carcharias Corporation. One by one we are introduced to the different credentials that each candidate has. Strong. Hard Working. Devious. Cut throat. All of them have a story, and all of them need the job. It stars Malcolm McDowell as The Employer. He is the man who sits behind the desk and interviews the five candidates. McDowell has a natural presence about him. We of course all remember him from his breakthrough performance in Stanley Kubrick's A Clockwork Orange. He is the perfect actor for this film. He has mystery behind his eyes and his portrayal of power is calm and cool. He interviews the five candidates, one by one with precision and repetition. Asking similar questions to them and getting a similar response with a different answer. Merle has done an impressive job of letting McDowell portray power behind the desk. He is a character that does not show power through pointing a gun or using fists. He simply has power with words or a push of a button. Each candidate in the room is unique. James is a hard working shy guy. He believes that if the five in the room can work together and figure it out that nobody has to die. Along with him is the innocent and scared Sandra (Paige Howard; daughter of Ron Howard, sister of Bryce Dallas Howard); she is running away from something. She felt that getting this job would help her to get away from the past. Mike (Matthew Willig) is the man with muscle who wants to be acknowledged for his brain. Billie (Katerina Mikailenko) is the bad ass woman who has some insider information of the Carcharias Corporation. Last, is Keith Caverns (Michael DeLorenzo) who is the antagonizing loud mouth. All have different qualities and Merle shows these qualities during each individual interview. In the locked room is just the five candidates. There are no knives. No guns. No weapons. This is what separates The Employer from a movie like Saw. This is what I found to be the most intriguing. It was the characters and their personalities that would determine who lives and dies. As the film goes along I was surprised to see what items would be used as weapons. A belt, a tie, a high heel, and even a vent plate. Merle brings the animal out of all five humans. All of this for the sake of winning the job. Even after someone emerges there is still the person already working for Carcharias Corporation that may be the last one out. Alan (Billy Zane) has been loyal to the company for many years, but that does not mean he has job security. The Employer is a good film. Merle has a movie here that is a thriller that puts light on America's social situation of job security. There is more that is said when people are battling for a job that would put not only food in your mouth, but boost you a full pay grade. It is not a battle just for current survival, but a battle for potential security. These are things that all can relate to today. McDowell is the actor who gives a solid performance. Paige Howard and David Dastmalchian give performances that will certainly help their acting careers flourish. They show promise in their young careers. Billy Zane gives us somewhat a cameo for his short screen time, but his role proves that your job can never be safe even if you are the best employee at Carcharis Corporation. An intriguing concept and thrilling to watch! The Employer is a winning film! More reviews at AMOVIEGUY.COM",
         "Five applicants apply for a single job with a big powerful and mysterious company. On the night before the final interview, all are drugged and find themselves in a locked room with no visible means of escape. The phone rings and it's The Employer (Malcolm McDowell) who tells them the final interview will not be what they expected. Hope this is not scary. Well, it wasn't scary, but it was spooky and definitely not for everyone. All agree to work together to insure that no one kills anyone as they all believe that the company wants everyone in the room to kill one another and the last one alive will get the job. Ah, a plan! (um, that's 2-plans) We have: James: ( David Dastmalchian) who claims he is adaptable and is just out of college. Sandra: (Paige Howard) is someone running from her past and will do anything for this job. Mike: (Matthew Willig) as big as a football player and wants to be known for his brain, not muscles. Billie: (Katerina Mikailenko) she has a lot of information on the company and knows some secrets. Keith: (Michael DeLorenzo) a loud mouth who cannot keep his mouth shut, but knows how things work. The room has a door and will only open when the correct code is entered. When one person dies, a code (to open the door) is given via a cell phone. So you see where this is going? In flashbacks, we see The Employer interview each candidate with the last question always being: would you do be willing to do anything for the company? And, they all say YES except one who says it would depend on the situation. You would think that this would not be too interesting, but the pacing, the dialogues, the acting and timing of all in the room keep you wanting to know how this ends. These actors are very good. Malcolm McDowell is pure gold no matter if we see him in comedies, or in dramas. His eyes have that mysterious quality whereby you cannot take your eyes off him as we are not sure what he will say or do next. And, his quizzical facial expressions and sometime staccato deliveries keeps you attentive. Like I said: pure gold. As I said, this is not for everyone (not a family movie). Who do you think will get the job? Keep in mind the applicants are totally highly qualified. If truth be known I have already told you. (7/10) Violence: Yes. Sex: No. Nudity: No. Language: No.",
         "The main messages are: 1) more of the tired old socialist propaganda about the evilness of the free market, and 2) the fad feminist mythology that skinny little women can beat up men twice their size. Any Darwinist should agree that \"survival of the fittest\" is a natural law and is therefore good. If that is the way of progress, why do these Mercedez socialist (and Darwinist) writers/directors/actors hate the free market so? How can they think we don't see their hypocrisy in making themselves rich using the free market? The movie is ponderously slow and predictable. It also reminded me of the stupid exercises in Psych 101 teaching students Maslow's hierarchy and enticing them to dump their morals.",
         "I was quite enthusiastic of watching this movie when I learned of it. The plot reminded me heavily of a similar movie titled Exam. Thus, I was expecting a similarly thrilling emotional and psychological ride. I did not receive it. While the movie was entertaining to watch, I could not be helped but be irritated by some of the most illogical actions the characters took given their seemingly high intelligence. Overall, I could pretty much guess what would happen next and the ending was very very disappointing. I could think of at least three different endings that would have been much more intriguing, plot-twisting and unexpected. To sum up, entertaining for while it runs on the screen, but nothing mind-blowing and leaves you rather frustrated at the end.",
         "I think this movie is severely underrated. I really enjoyed the flick. I didn't know anything about the movie except what the description was and I found it to be really good. I liked how they provided back story for each character and showed parts of their interviews and when they got abducted. I didn't know the chubby girl had all the information about the others before going in. When I found out, it made sense that she woke up 1st. Then, I was mad when she starting talking at the end and basically gave away that she knew about the interview beforehand and was going to kill him. But that's just like bad guys to want to brag a bit. I loved the dark haired smoker guy. I was really rooting for him and was glad they got the muscle guy out the way fast. I know some reviews said it wasn't believable. But the muscle guy was intentionally beat up the night before and had a broken rib and etc. With the element of surprise, I've seen a lot of smaller guys take on bigger guys and win. I didn't like the guy with the glasses. The ending I think was bad, I really wanted the dork guy to kill the employer. Because in the end even though he killed Alan. He had no choice. Kill Alan or some guys will be at your door to kill you. I really don't think he has what it takes to be a part of the company. Overall, it was a good movie. Not movie theater worthy, but Saturday night DVD worthy for sure. I have watched a ton of movies and I guess I am not a snob. I expect a B or C movie to be a B or C movie. I do not expect the acting to be superb or the set to be spectacular. It's a low budget movie and for a low budget movie it was good. I cared about each character, except the ninja girl. When muscle head talked to his mom that was touching and when the last girl to die couldn't reach her sister I felt bad for her. I recommend this movie. IMDb has a way of rating a movie lower than it should be. This is definitely one where they go it wrong.",
         "For the biggest part of the movie i thought this was a five out of ten result at best. You have to find by yourselves why i changed my mind in the end and of course i 'll give you a clue: because of the relation between the first seconds of the movie and the movie itself. If you liked exam (2009) stop reading reviews and go watch it now. This movie has its audience. Nevertheless you can't avoid watching lots of clichés. As happens in almost every movie in the world (so why not in every review) there must be a subconscious message for you to stop watching this movie and go for a cigarette or to start smoking again if you have quit smoking. The music was fitting with the movie and i liked that there was also a low volume background music even when there were dialogs. Scenes outside the room made the film less claustrophobic. Don't expect an acting nomination.Katerina Mikailenko is mrs legs and David Dastmalchian is mr nerd face. Information for audiences with tennis knowledge : Matthew Willig ( with the bandana ) reminded me of Juan Martin del Potro which made him the funny character for me. Would you like to be in the same room with strangers? Would you like to watch others try?"
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Hyrax Entertainment",
         "Crafted Films",
         "Lone Morsel Productions"
      ],
      "summaries": [
         "Five highly qualified applicants interview for a coveted job with the Carcharias Corporation, a powerful conglomerate whose business practices are shrouded in mystery. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape. Soon the true nature of their situation is revealed when they receive a phone call from the mysterious CEO of Carcharias, known only as The Employer. He informs them that they are about to experience the final interview, but it's not at all what they were expecting.",
         "Five highly qualified applicants interview for a coveted job. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape."
      ],
      "budget": 0
   },
   "movielensId": 138566,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-06-07",
      "dvdReleaseDate": null,
      "directors": ["Frank Merle"],
      "runtime": 85,
      "movieId": 138566,
      "title": "The Employer",
      "mpaa": "NR",
      "actors": [
         "Malcolm McDowell",
         "David Dastmalchian",
         "Paige Howard",
         "Michael DeLorenzo",
         "Matthew Willig",
         "Katerina Mikailenko",
         "Billy Zane",
         "Nicki Aycox",
         "Daniel Aldema",
         "Tony Casale",
         "Erin Soto"
      ],
      "imdbMovieId": "1863203",
      "originalTitle": "The Employer",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["2YwHM7f2Xs8"],
      "plotSummary": "Five highly qualified applicants interview for a coveted job with the Carcharias Corporation, a powerful conglomerate whose business practices are shrouded in mystery. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape. Soon the true nature of their situation is revealed when they receive a phone call from the mysterious CEO of Carcharias, known only as The Employer. He informs them that they are about to experience the final interview, but it's not at all what they were expecting.",
      "tmdbMovieId": 191094,
      "avgRating": 1.33333,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/xmSyETSbaLBcgXsE1CT3hr2Y9VS.jpg"
   }
}