{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0871865",
      "video": false,
      "title": "I Can See You",
      "recommendations": [],
      "backdrop_path": "/1ZECFoQMA1a5hoqmkVT5r0qfcyc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Richards",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068eaf",
               "name": "Benjamin Dickinson",
               "profile_path": "/ouAzOPh1W2Yz79oEcyhBgfGMOkS.jpg",
               "id": 101810,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Doug",
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068eb3",
               "name": "Duncan Skiles",
               "profile_path": null,
               "id": 101812,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kimble",
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068eb7",
               "name": "Christopher D. Ford",
               "profile_path": null,
               "id": 101814,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Sonia",
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068ebb",
               "name": "Olivia Villanti",
               "profile_path": null,
               "id": 101816,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Summer Day",
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068ebf",
               "name": "Heather Robb",
               "profile_path": null,
               "id": 88549,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mickey Hauser",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068ec3",
               "name": "Larry Fessenden",
               "profile_path": "/ry1FD2hv1mop8QzPCVHzpDeCX1z.jpg",
               "id": 31268,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068e9f",
               "name": "Graham Reznick",
               "profile_path": "/qELx4pQq4SSpigYPGiTIo9Hka7B.jpg",
               "id": 101809,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068ea5",
               "name": "Larry Fessenden",
               "profile_path": "/ry1FD2hv1mop8QzPCVHzpDeCX1z.jpg",
               "id": 31268,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068eab",
               "name": "James Felix McKenney",
               "profile_path": null,
               "id": 97936,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.630626,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28741,
      "vote_count": 5,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [],
      "original_title": "I Can See You",
      "runtime": 97,
      "poster_path": "/aQZmnPjDeQI9yed6DEnT7DOIMfP.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Glass Eye Pix",
         "id": 1360,
         "origin_country": ""
      }],
      "release_date": "2008-01-06",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Graham Reznick"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Graham Reznick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0871865/",
      "coverLink": null,
      "actors": [
         "Benjamin Dickinson",
         "Duncan Skiles",
         "Christopher Ford"
      ],
      "reviews": [
         "Being a fan of psychological horror, I'm a little surprised at the current volume of reviews describing this film as incoherent and nonsensical. I Can See You is a film about obfuscation, and the cognitive filters which color our perspectives and influence our abilities to contextualize. (Think about the cleaning product designed to wipe away grime, and the camping trip which distances them from civilization and constant media stimuli) The film is like a swelling panic attack, where the players, and viewers slowly grow uncomfortable with the underlying motivations to certain behaviors. The writing, cinematography, and sound design are impressive. As is the pacing. I actually felt that despite being surreal, it wasn't too difficult to grasp some of the underlying themes threading the film. Definitely a \"filmmaker's movie,\" but as I am not a filmmaker myself, I still found it quite enjoyable.",
         "The first hour was an incredibly slow, boring movie with annoying characters. The last twenty minutes was an incredibly nonsensical movie with annoying characters. All of a sudden it became a mixture of a bad Eraserhead ripoff and one of those art student film clichés. Maybe I'm totally wrong and the movie just flew right over my head. But I seriously believe that there's nothing to \"get.\" Plus the acting and cinematography were awful. The guy who shot this needed to adjust his iris. Every single shot of nature was totally washed out. They looked like they were using a Handycam from Walmart. It completely defeated the purpose of those shots.",
         "I came beware of this low budget flick due my subscription to Fangoria and some horror webpages. So I tried to track down a copy, sadly it wasn't available here in Europa and even worser, they weren't able to send it out of the US by law. But of course after all those years I build up some reputation as a geek so I contacted Graham Reznick, the director. Thanks to him I got me a copy even signed by him. All of that isn't no reason to admire a movie, I still watch it without prejudice. Having watched it I can understand that this flick will have his pro's and contra's. It isn't your average slasher or torture porn. It's a movie that get's you but it take a while to get you. As seen in reviews they are talking about the slowness and not getting into the characters. Sorry, it is indeed slow but it has a reason. First of all, it never gives you the feeling that it is a low budget flick as stated. Being in the business myself, the editing is okay and the score works too. Indeed, you will have shots that are for some people boring or not understandable, for example, the shots on street with New York in the background is all filmed with an arty mind. But it isn't arty farty! And indeed, it takes almost an hour before things start happening but that hour before I never yawned. In fact, everything has a reason, when he doesn't wear his glasses everything is filmed out of focus. Some will be offended others will love it. There isn't almost no blood in it but still it is a kind of horror. And it surely has a lot of Lynch influences. Watch the last 15 minutes, you will know what I mean. Still I'm glad that I have it in my collection, a flick not for everybody but for the open minded geeks out there.",
         "The reason I rated this a 10 instead of a great 8 or 9, is because there is nothing I can compare it to. I have seen hundreds of movies called \"horrors\" over my 25 years and not once have I felt afraid. Most of these \"horrors\" are slasher flicks, gore or torture porn, or something with a lot of shadows in which someone falls onto a pianos keys every time something appears to startle me, the viewer. Being surprised is not the same as being scared. This movie does just what I need to feel afraid. Makes me feel like I'm seeing and hearing what I could imagine might be going on inside of an insane man's brain before he kills, or before he goes over the edge. I see many reviews of this are very low, but I must ask you to show me links or name some DVDs of movies I could watch that do this better. I agree the plot doesn't make sense and there seems to be no real reason for some of the characters losing their minds. However, once again I have nothing to compare this to. If there were even one thing that scared me or even tried to on a psychological level, I'd give this a 8, 7, or 6. I have never seen another movie that makes me feel I am seeing insanity and truly being afraid of the human mind. This leads me to being more lenient and feeling and hoping that this is a start towards something greater, hopefully many more of these types of movies. Although probably not, unfortunately. The only thing I have experienced that can compare is a video game. The first Silent Hill. Most of this was probably because of the low budget of that game as none of the sequels have been scary again. As far as the long start and scenes that some are saying were of nothing, I think this was planned as well, because for me that was a thinking period of what the heck is going on? You could call this cheap, yes, but what other ways can you make the viewer think for a few minutes instead of just showing exactly what is happening, leaving no mystery and no room for WHAT JUST HAPPENED? To those of you stating you have seen better horror movies than this, please I would like you to refer me to some DVD's because I love to feel this level of fear and am definitely tired of \"horror\" being girls screaming as they get cut apart by some disfigured or masked man. That is not scary, especially not the 50th time ha ha. Anyways, I don't write many things so I'm sorry if this review has strange structure or anything. I tried to at least paragraph out everything.",
         "AGAIN I was fooled by reviews. This is a poorly-written, poorly-acted, poorly-directed, and amateurishly shot film which wont even hold it's own against many semi-well-made student films from this year. It's little more then someone pointing a video camera at the action, which they previously wrote. Proper lighting? Sound? Editing? ANYTHING??? Aw hell no, dawg! Day is keepin it realz, yo! Ya, realz crappy. Don't be mistaken, this isn't a film in which a grand and brilliant statement was being made by circumventing traditional cinematic technical considerations to give the presumably \"non-conformist\" project a cool vibe. Nope. It's simply a case where amateurs did exactly what I stated, pointed a video camera at the action after writing it. (hoping, of course, that the complete and overwhelming lack of skill/talent would be interpreted as artistic). Go watch some of the excellent student films from this year and last. I am not exaggerating. This film was made on a level so insulting and (unintentionally) low-fi, that it makes films from even modestly/barely talented young film makers shine brightly by comparison. That I made it to the end, was a bit of an accomplishment. If you enjoy seeing a film which was made simply because someone had the motivation to make it, but without all the silly conventional things like skill/talent, or technical ability on ANY level whatsoever, then you'll get a kick out of this. To call this \"amateurish\", by today's standards, is slightly misleading....since the new-school amateur film makers are doing (sometimes) such excellent work. This is amateurish by early 1990's standards, no today's.",
         "Whatever it is that makes indie film makers think that disjointed nonsense, flashes of random things interrupting scenes, and question marks for endings make for good film was at full throttle in this painfully glacial waste of time. I clicked \"spoiler alert\" for this review because I am about to spoil the ending: IT DOESN'T MAKE ANY SENSE. I get paid to analyze literature and film, and here is my analysis again: IT DOESN'T MAKE ANY SENSE. All of the most important things about making a film, especially one with a low budget, were completely disregarded or, perhaps more accurately, intentionally bucked. A few of these are: characterization--the clichéd characters never amounted to anything emotional or engaging. The story--the only connection to anything else in the movie was a loosely running image of a cleaning product flashed onto the screen assaulting the serenity of the sleep that the first hour of the movie threw me into. Dialogue--everything word was forgettable...thank God (with the exception of the \"Spray It on Nightmare\". Catchy song). STEEEEERRIKE THREE. The only saving grace in this movie was that one of the characters got exactly what the audience was praying for: someone to gouge out his eyes so that he didn't have to watch the last 5-minute random image and sound blast. Weakly done. Don't try again please.",
         "As with any movie, the number one element has to be story above all else. Sadly, \"I Can See You\" just didn't have it. What little story there was did nothing to excite the senses. Furthermore, the narrative as well as one too many scenes were completely drawn out and laborious. Although Larry Fessenden shined as Mickey Hauser, there was little to feel for any of the characters. That lack of connection between audience and character did not leave much in regard to emotional attachment. And if the audience doesn't care about those who inhabit the film then there is no need to care about the movie at all. Dramatic horrors can be wonderful, strong and engaging (\"The Shining\" and \"Rosemary's Baby\" for example), but \"I Can't See You\" never generated enough tension or suspense to draw the audience in at all. Only rent this one if you require a sleep aide.",
         "I really attempt to keep an open mind with any sort of \"horror\" movie, but I simply couldn't open my mind up enough to accept this film...OK, I get that it's a low budget endeavor, and that isn't always bad, but where was the director going with this. The initial intro laid out a plausible groundwork, but then it seemed as though there wasn't any direction after that. I don't mind a film that leaves me pondering the intended ending, hey I actually found myself thinking about \"Shutter Island\" well after watching it, but here it just seemed as though the director had some sort of psychedelic flashback 3/4 of the way through the film and figured that special effects would suffice for the last 15 minutes. The plot was sorta there, the acting wasn't awful, but there was no connection with the characters, which is a death sentence for any film. If you're a horror aficionado, then give it a shot if you absolutely have 90+ minutes of your life that are worth wasting, otherwise keep looking. At least I watched it on Netflix and I didn't spend (waste) the money on a DVD.",
         "I think this film was probably harmed by the extremely high ratings that some people gave it, which makes some people hate it more than they normally would. What I liked: The vibe: I though it was genuinely creepy at multiple points. I had no idea where the plot was going, and had fun wondering. The actors were good at making me not like them. The creepy dude was creepy AF. They were definitely a good portrait of whack NY hipsters circa 2008. Also, there were some genuinely cool nature shots. I disliked: After getting me all curious, the end was a huge let-down. It was a lot of build-up for such an ambiguous end. All of a sudden I felt like I was in a hipster-horror version of the end of 2001. Which I have to admit being entertained by, but still, I think it was a cop-out. The low quality filming didn't ruin the movie, but didn't do it any favors either. Also, what was with the random flashes to scenes of a busy intersection? Was this the key to truly loving this movie and I somehow failed to grasp the significance? I doubt it.",
         "I really wanted to like this film, mainly because I think Larry Fessenden has an eye for talent, but unfortunately this one just really does not cut it. The story itself is all right, except for the execution. We have three young guys who obviously work for some sort of ad agency, or perhaps an independent group themselves. Their latest project has produced nothing but artistic block, so they try and get back to nature, back to clarity, as one of the boys puts it. They go on what's essentially a camping trip out in the woods, where they're soon joined by a group of friends (of friends), and after some possible love-life developments, some paranoid and dark feelings start to come out. One of the guys seems to be a tortured artist, lingering on a portrait of his father he is doing, which is troubling him- because he cannot \"see the face\". I felt as if this was a real let down. I was starting to think there was something real deep about the father's painting he was doing, and it just devolved into a lot of attempted psychedelics, resulting in a bit of a shoddy mess near the end. This could have possibly become a taut psychological thriller-turned-horror in the final moments, but instead it played out like an awful attempt at a psychological horror film better than it could ever be. I'll give this a 4 out of 10 stars, solely because I did think the premise was original and somewhat interesting, had it played out better, and I also did enjoy a few of the visuals near the end; though they amounted to nothing important by the time the credits stopped rolling. I wouldn't say this is one to search out- I did, and it wasn't worth the time. Honestly, I really enjoyed the cover art, and it led me to seek out a viewing. It isn't the first time I've been lead down the garden path by an interesting cover, or piece of promotional artwork, only to find a sub-par movie. I just keep hoping I'll hit an undiscovered gem. This one is just an odd-shaped rock in the dirt."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Aphasiafilms",
         "Glass Eye Pix"
      ],
      "summaries": ["Three young ad-men enter the woods for a photo shoot, but a girlfriend's mysterious disappearance sparks a harrowing descent into unreality."],
      "budget": 0
   },
   "movielensId": 138580,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-01-06",
      "dvdReleaseDate": null,
      "directors": ["Graham Reznick"],
      "runtime": 97,
      "movieId": 138580,
      "title": "I Can See You",
      "mpaa": "",
      "actors": [
         "Benjamin Dickinson",
         "Duncan Skiles",
         "Christopher D. Ford",
         "Olivia Villanti",
         "Heather Robb",
         "Larry Fessenden"
      ],
      "imdbMovieId": "0871865",
      "originalTitle": "I Can See You",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 28741,
      "avgRating": 3.28571,
      "releaseYear": "2008",
      "numRatings": 7,
      "posterPath": "/aQZmnPjDeQI9yed6DEnT7DOIMfP.jpg"
   }
}