{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1386492",
      "video": false,
      "title": "This Is Not a Movie",
      "recommendations": [
         263148,
         112295,
         116305,
         10121,
         91101,
         136466
      ],
      "backdrop_path": "/6PHLCHUV4ehIZtJhx6qUK89pbvi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Pete Nelson",
               "gender": 2,
               "credit_id": "52fe48409251416c9108598d",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Ghost of Jimmy",
               "gender": 2,
               "credit_id": "52fe48409251416c91085991",
               "name": "Edi Gathegi",
               "profile_path": "/nOkjzPRI2y3uDlWT5bGoRtEtcII.jpg",
               "id": 39391,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "",
               "gender": 2,
               "credit_id": "52fe48409251416c91085995",
               "name": "Peter Coyote",
               "profile_path": "/5zVvYZxE6T0OeL1iaFBBCzY3QOi.jpg",
               "id": 9979,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Executive",
               "gender": 2,
               "credit_id": "52fe48409251416c91085999",
               "name": "Julian Sedgwick",
               "profile_path": null,
               "id": 78328,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48409251416c91085983",
               "name": "Olallo Rubio",
               "profile_path": "/jqXke9arSKWD19UV5RKYBKD9xUT.jpg",
               "id": 593057,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48409251416c91085989",
               "name": "Olallo Rubio",
               "profile_path": null,
               "id": 593059,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.854354,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 82136,
      "vote_count": 9,
      "budget": 0,
      "overview": "Twisted, apocalyptic satire, THIS IS NOT A MOVIE envisions the end of the world through the bi-polar mind of a strung-out pop-culture addict. Starring Edward Furlong and Peter Coyote, with a jagged, atmospheric score from Slash.",
      "similar": [],
      "original_title": "This Is Not a Movie",
      "runtime": 99,
      "poster_path": "/81rpnMWWN3CqHMaLKFveBL1edkk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-01-28",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Olallo Rubio"],
      "runtime": 99,
      "synopsis": "With the end of the world imminent, Pete Nelson (Edward Furlong) locks himself inside a Las Vegas hotel. There, he tries to understand his confused reality influenced by film,TV, pop culture, disinformation, drugs and propaganda. The journey that follows is a surreal, psychedelic, apocalyptic quest where nothing is what it seems... THIS IS NOT A MOVIE.",
      "writers": ["Olallo Rubio"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1386492/",
      "coverLink": null,
      "actors": [
         "Edward Furlong",
         "Peter Coyote",
         "Miguel Ferrer"
      ],
      "reviews": [
         "I'm not sure I understand this movie, nor do I think I'll ever. Obviously, this movie grasps with deep philosophical stuff we don't normally deal with typical American movies. This movie really revolves around one man and his attempts to understand himself before the apocalypse... along the way he deals with appearances from his personalities, and he, they, and a ghost, debate about the meanings of life from his Las Vegas hotel room, as... the apocalypse looms in 47 hours and some minutes. I like Slash's soundtrack... that alone is worth bumping my vote up another point... The heavy stuff is broken up with promos for hypothetical parody films that make it worthwhile.",
         "'This Is Not A Movie' an almost perfect drama comedy there was just something about it. The film is not for the average film goer its very cerebral and complicated. The film is a very will made movie the writing is brilliant and witty the acting is all around good, the look and feel of the film has a very dark an beautiful tone, Edward Furlong is perfect in this role of a paranoid man with many deep questions that he wants answers to and he only has 48 hours to figure them out without leaving his Vegas hotel room. Like the Takishi Miike film 'Visitor Q' its a straight forward film where you know what is going on and you know the point of it all but it is still confusing you and you might have to watch the film over again. The film is very funny and well made and even very relate able for those looking for a good film that is cerebral, surreal and a great satire about modern society. 9/10 Similar films: 'Vistor Q', 'Bad Boy Bubby', 'Fear and Loathing in Las Vegas' and 'Eraserhead' to a point",
         "From the very beginning of the movie, it's clear that the intentions of the film are to make you think. Not always politically correct and loaded with both verbal and visual social and political commentary, This Is Not A Movie avoids being too heavy with the use of satirical shorts and awesome music well-placed throughout. Nonetheless, it can seem a little preachy if you're at a point in the film where you're not exactly sure what's going on, or if you happen to disagree with the film's message. As an actor, Edward Furlong was a pleasant surprise. It's a role that seemed to click with him, and he's convincing as an angst-y, anti-social and possibly mentally unstable main character who is struggling to resolve all his inner conflicts. Without giving away too much, I'll say the others could've used a little work, though. Overall, this is one of my favorites. The cinematography is very clean and focused for an indie film, despite the plot not always seeming the same--which I don't mind. The content can get a little dark and there's also plenty of fourth-wall breaking and poking fun at the movie itself. And most of the film takes place in one location with a very small handful of characters. If these are an issue for you, you probably won't like this film. Otherwise, it's worth one, two, or several watches.",
         "I get exactly why this \"movie\" is probably not up most people's alley but it really is a fantastic piece of meta-cinema. It breaks just about every movie convention. I've never seen anything quite like this and I've seen a lot of movies. Warped and twisted, check out Charlie Kaufman's work or the equally bizarre and more recent tired meta serial killer flick Rubber. Thing is though, these meta movies have very little in common with with this gem. I loved all the cutaways, music and monologues. I loved that he threatens the audience with a shotgun and says he hates us. I love that he wrote a part of himself as the writer of the script as a fictional character into the script. I love that he experiences death neurosis. The philosophical aspects of meeting a god who could kill himself and end your existence too are quite emotional. This explores how a fictional being becoming self aware of his plight of being constrained in a movie of \"shoddy\" craftsmanship, which the writer pointed out throughout the movie, by an incompetent, nilpotent \"god\" and the emotional devastation that it wreaks. This is seriously a fantastic movie on so many levels and should be taken more seriously than it is. But its f***ing hilarious, too! Philosophical, funny, absurd."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Kung Fu Films",
         "Mantarraya Producciones"
      ],
      "summaries": ["Twisted, apocalyptic satire, THIS IS NOT A MOVIE envisions the end of the world through the bi-polar mind of a strung-out pop-culture addict. Starring Edward Furlong and Peter Coyote, with a jagged, atmospheric score from Slash."],
      "budget": 3000000
   },
   "movielensId": 138784,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-01-28",
      "dvdReleaseDate": null,
      "directors": ["Olallo Rubio"],
      "runtime": 99,
      "movieId": 138784,
      "title": "This Is Not a Movie",
      "mpaa": null,
      "actors": [
         "Edward Furlong",
         "Edi Gathegi",
         "Peter Coyote",
         "Julian Sedgwick"
      ],
      "imdbMovieId": "1386492",
      "originalTitle": "This Is Not a Movie",
      "genres": [
         "Drama",
         "Comedy",
         "Science Fiction",
         "Foreign"
      ],
      "youtubeTrailerIds": ["ZsaSOLvmjWE"],
      "plotSummary": "Twisted, apocalyptic satire, THIS IS NOT A MOVIE envisions the end of the world through the bi-polar mind of a strung-out pop-culture addict. Starring Edward Furlong and Peter Coyote, with a jagged, atmospheric score from Slash.",
      "tmdbMovieId": 82136,
      "avgRating": 2,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/81rpnMWWN3CqHMaLKFveBL1edkk.jpg"
   }
}