{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "north korea",
            "id": 158538
         }
      ],
      "imdb_id": "tt4598848",
      "video": false,
      "title": "Dennis Rodman's Big Bang in PyongYang",
      "recommendations": [
         237960,
         163392,
         211078,
         190967,
         365183,
         78355,
         494264,
         268159,
         150043,
         42814,
         108614,
         51471
      ],
      "backdrop_path": "/jP0OOhRCf5c96vsbXKu8yNlCUCm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Dennis Rodman",
            "gender": 2,
            "credit_id": "55b498e4c3a3682ff901298a",
            "name": "Dennis Rodman",
            "profile_path": "/WnICmjnl9nrtaZrNbU2GHsNvgQ.jpg",
            "id": 21397,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55b499b29251411e0f0140ca",
               "name": "Colin Offland",
               "profile_path": null,
               "id": 1490473,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55b49a079251411e0f0140d6",
               "name": "Colin Offland",
               "profile_path": null,
               "id": 1490473,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.310247,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 338353,
      "vote_count": 11,
      "budget": 0,
      "overview": "Dennis Rodman is on a mission. After forging an unlikely friendship with North Korean leader Kim Jong-un, he wants to improve relations between North Korea and the US by staging a historic basketball game between the two countries. But the North Korean team isn't the only opposition he'll face... Condemned by the NBA and The Whitehouse, and hounded every step of the way by the press, can Dennis keep it together and make the game happen? Or will it go up in a mushroom cloud of smoke? For the first time, discover the true story of what happened when Dennis Rodman took a team of former-NBA players to North Korea and staged the most controversial game of basketball the world has never seen.",
      "similar": [
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         323677,
         86130,
         10474,
         1578,
         5925,
         12163,
         1367,
         1374,
         9614,
         107,
         612,
         45317,
         42888,
         9472
      ],
      "original_title": "Dennis Rodman's Big Bang in PyongYang",
      "runtime": 93,
      "poster_path": "/qQLs7mDSDhbcxVpZbgC7etgu9Rn.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2015-01-25",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.bigbanginpyongyang.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Colin Offland"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Matt Baker",
         "Colin Offland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4598848/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTczODAwNjgzNl5BMl5BanBnXkFtZTgwMDU5MTczNTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Matt Cooper",
         "Jong-Un Kim",
         "Dennis Rodman"
      ],
      "reviews": [
         "First, I'm shocked to be the first reviewer of this documentary. Second, this is a solid, substantial, entertaining and overall well-made documentary about Dennis Rodman's trip to North Korea to hold a basketball game between former NBA players and the North Korean team on Jan.8, 2014 for Kim Jong-un's birthday. Completely entertaining. The cameras are there for it all so we really get to see \"from the inside\" all that happened. And you do get to see a side of North Korea that's rarely seen. I mean their ski resort looks first-class. (too bad no one is there to actually get to use it except the party elite). The narration is spot-on, funny and keeps the documentary moving. The big question is: was this entire event a giant propaganda show for the benefit of a ruthless totalitarian dictatorship? The documentary pulls no punches but is quite fair in presenting both sides. I also give kudos the camera team who came off with some terrific shots, most notably when Rodman returns from North Korea the first time and is absolutely mobbed by the press. The camera captures every moment of what I would describe as a media riot. I love a good documentary that entertains and educates me as well as gives me something to think about. This should not be missed!",
         "This movie is both educational and entertaining. It shows some remarkable footage from North Korea and in some ways is a lot like The Interview \u0085 except this is all for real! Dennis Rodman comes off as both an inspirational figure and yet one who has many personal inner demons that he is struggling with. There is a lot of crazy heavy stuff that happens in the movie which is beautifully made light of by the very cheery and eloquent Irish narrator, without whom the film could have been much more dark and maybe a bit of a mess. The basketball matches Rodman manages to arrange and the coverage of them really hits you emotionally with regard to what he actually achieved. It was a historical event that will be remembered for a long time by all involved, and I'm so happy that the footage was captured, beautifully and allowed to be shown in this movie. This movie leaves me thinking that engaging with the North Korean people and leadership through this kind of activity is the only way anything is ever going to change. Although for the common people the kind of change which the west is looking for, is maybe not what is good or best for them. Apart from some of the regime's human rights and warmongering issues, it would be nice if the country were left in some kind of peaceful yet anti-globalist state.",
         "Pretty entertaining documentary about Dennis Rodman's trip to North Korea which was filled with good intentions but perhaps not with the best results. News-magazines went pretty hard at Rodman when it was revealed that he was in North Korea making friends with the country's dictator and US sworn enemy Kim Jong Un. But he did indeed have some good intentions trying to build a bridge between the 2 countries by staging a basketball-game between the US and North Korea. Now some of those intentions got lost after the public backlash and Rodman's ego and personal problems came in the way, but it's still a fairly engaging and interesting documentary. Needless to say though is that there is very little footage of Kim Jong Un as he doesn't really approve of anyone, especially American journalists filming him. But still, worth seeing.",
         "It's a truly modern saga, a strange mesh of the cult of celebrity, geopolitics and technology and the media's ability to connect disparate people all over the globe—not to mention the media's role in covering such intersections. Matt Cooper delivers the film's irony-inflected voice-over with an infectious Irish lilt that jauntily propels the narrative through its many unlikely twists and turns.",
         "BIG BANG IN PYONGYANG is a lively documentary that captures a 'moment in time' quite nicely. It involves Dennis Rodman and his idea to hold a basketball game between some retired American players (including himself) and a North Korean team in order to open up borders between the two countries. Everything doesn't go according to plan, of course, which is why it's an entertaining documentary. Things start off on a quite ordinary level, introducing the main players and depicting the strangeness of North Korean society. I wasn't too keen on the Irish narrator but he could have been worse. I only know Rodman from his short cinematic career but he's a larger than life figure whose flaws make him likable and almost tragic in places. Things become serious in the latter part of the production as politics intervene and it gets very heated, which of course makes for a fine and naturalistic documentary. And you don't even have to like basketball to enjoy it."
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": ["Chief Productions"],
      "summaries": [
         "Dennis Rodman is on a mission. After forging an unlikely friendship with North Korean leader Kim Jong-un, he wants to improve relations between North Korea and the US by staging a historic basketball game between the two countries. But the North Korean team isn't the only opposition he'll face... Condemned by the NBA and The Whitehouse, and hounded every step of the way by the press, can Dennis keep it together and make the game happen? Or will it go up in a mushroom cloud of smoke? For the first time, discover the true story of what happened when Dennis Rodman took a team of former-NBA players to North Korea and staged the most controversial game of basketball the world has never seen.",
         "An uproarious doc about Dennis Rodman's calamitous foray into North Korea."
      ],
      "budget": 0
   },
   "movielensId": 138719,
   "movielens": {
      "languages": [""],
      "releaseDate": "2015-01-25",
      "dvdReleaseDate": null,
      "directors": ["Colin Offland"],
      "runtime": 93,
      "movieId": 138719,
      "title": "Dennis Rodman's Big Bang in PyongYang",
      "mpaa": "",
      "actors": ["Dennis Rodman"],
      "imdbMovieId": "4598848",
      "originalTitle": "Dennis Rodman's Big Bang in PyongYang",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Dennis Rodman is on a mission. After forging an unlikely friendship with North Korean leader Kim Jong-un, he wants to improve relations between North Korea and the US by staging a historic basketball game between the two countries. But the North Korean team isn't the only opposition he'll face... Condemned by the NBA and The Whitehouse, and hounded every step of the way by the press, can Dennis keep it together and make the game happen? Or will it go up in a mushroom cloud of smoke? For the first time, discover the true story of what happened when Dennis Rodman took a team of former-NBA players to North Korea and staged the most controversial game of basketball the world has never seen.",
      "tmdbMovieId": 338353,
      "avgRating": 3.16667,
      "releaseYear": "2015",
      "numRatings": 3,
      "posterPath": "/qQLs7mDSDhbcxVpZbgC7etgu9Rn.jpg"
   }
}