{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1320296",
      "video": false,
      "title": "Shank",
      "recommendations": [
         256467,
         21900,
         65953,
         137752,
         171045,
         13202,
         127722,
         128110,
         225747,
         171688,
         306307,
         44646,
         47853,
         185497,
         41042,
         28793,
         37970,
         44862,
         81021,
         208495
      ],
      "backdrop_path": "/yLr4GayoHUunO1TVTXkuiCANt8x.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "57d94c83c3a36852e0005513",
         "content": "There's not a lot of love out there for _Shank_, but I for one quite enjoyed it. I understand it won't be for everyone, and I do come into it with a bit of a bias, but the only way you'll know for sure if you can appreciate _Shank_ (and decipher its various UK accents) is to watch it for yourself.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._",
         "url": "https://www.themoviedb.org/review/57d94c83c3a36852e0005513"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Junior",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d9171",
               "name": "Kedar Williams-Stirling",
               "profile_path": "/dhXjEwdKhhObMgU1Y8cA1MgZnUL.jpg",
               "id": 126169,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rager",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d9175",
               "name": "Ashley Bashy Thomas",
               "profile_path": "/oLbZ5x7HmxInNwT7hJ5yP240U3p.jpg",
               "id": 126170,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kickz",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d9179",
               "name": "Adam Deacon",
               "profile_path": "/rNoJV84bqr1kVfvkkb2FiqPWUul.jpg",
               "id": 78064,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Craze",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d917d",
               "name": "Michael Socha",
               "profile_path": "/oc4UDo2En0iBdnMHWh9ifnkdY8B.jpg",
               "id": 126171,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sweet Boy",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d9181",
               "name": "Jan Uddin",
               "profile_path": null,
               "id": 126172,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tasha",
               "gender": 1,
               "credit_id": "52fe45c3c3a36847f80d9185",
               "name": "Kaya Scodelario",
               "profile_path": "/1bveJ3wBjcpXKlsB1BHav2TBoax.jpg",
               "id": 115150,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ree Ree",
               "gender": 1,
               "credit_id": "52fe45c3c3a36847f80d9189",
               "name": "Jennie Jacques",
               "profile_path": "/9s3HMzaVWb7ZeqQ6GhzKpoxAar4.jpg",
               "id": 126173,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lexy",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d918d",
               "name": "Rheanne Murray",
               "profile_path": null,
               "id": 126174,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Tugz",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d9191",
               "name": "Jerome Holder",
               "profile_path": null,
               "id": 126175,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Papa",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d9195",
               "name": "Terry Stone",
               "profile_path": "/9PihHdZnK0ALXgrLNX80No29AfI.jpg",
               "id": 63071,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Beano",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d9199",
               "name": "Robbie Gee",
               "profile_path": "/sNjG7yCwwF6gMChC6gNfNuPUbwE.jpg",
               "id": 1119,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Breezer",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d919d",
               "name": "Robert Fucilla",
               "profile_path": null,
               "id": 119801,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Reggy",
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d91a1",
               "name": "Eddie Kadi",
               "profile_path": null,
               "id": 126177,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Whisper",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91b1",
               "name": "Luke de Woolfson",
               "profile_path": "/lsJ51EAV14lf0F39nGnlHz7CdM8.jpg",
               "id": 82636,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Boogie",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91b5",
               "name": "Colin Salmon",
               "profile_path": "/2RHy23vEDs0JRI4uy6IXNxKOrzL.jpg",
               "id": 5414,
               "order": 16
            },
            {
               "cast_id": 30,
               "character": "Bus Conductor",
               "gender": 2,
               "credit_id": "53d3ef3cc3a3686b88001721",
               "name": "Aml Ameen",
               "profile_path": "/9RVP50tleHVlqBH8jIjbluFzblw.jpg",
               "id": 78062,
               "order": 17
            },
            {
               "cast_id": 31,
               "character": "Phoenix",
               "gender": 0,
               "credit_id": "53d3fa27c3a3686b9a00181d",
               "name": "Gabrielle Ryan",
               "profile_path": null,
               "id": 1346549,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d91a7",
               "name": "Mo Ali",
               "profile_path": null,
               "id": 126178,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d91ad",
               "name": "Paul Van Carter",
               "profile_path": null,
               "id": 126179,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "536f79d7c3a368124100e865",
               "name": "Terry Stone",
               "profile_path": "/9PihHdZnK0ALXgrLNX80No29AfI.jpg",
               "id": 63071,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "536f79f0c3a3683bf9005882",
               "name": "Nick Taussig",
               "profile_path": null,
               "id": 1313548,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "536f7a09c3a368124a00e770",
               "name": "Daniel Toland",
               "profile_path": null,
               "id": 553096,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "536f7a1ec3a368122600e07b",
               "name": "Paul Van Carter",
               "profile_path": null,
               "id": 126179,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "536f7a3bc3a368122000e5aa",
               "name": "Jane Ripley",
               "profile_path": null,
               "id": 1313550,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "536f7a50c3a36839c1004836",
               "name": "Adam Frisch",
               "profile_path": null,
               "id": 1318503,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "536f7a68c3a368124a00e776",
               "name": "Chad Hobson",
               "profile_path": null,
               "id": 1196692,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "536f7a7cc3a3687e6c001906",
               "name": "Avigail Claire",
               "profile_path": null,
               "id": 1318504,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "536f7a91c3a368124100e86e",
               "name": "Damian Collins",
               "profile_path": null,
               "id": 1318505,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "536f7aa8c3a3687e6c00190b",
               "name": "Rob Nicholls",
               "profile_path": null,
               "id": 1318507,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "591d928292514149f301f148",
               "name": "Julian Tranquille",
               "profile_path": null,
               "id": 1819091,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.432298,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 41345,
      "vote_count": 31,
      "budget": 0,
      "overview": "Mo Ali’s futuristic knife-crime drama brings the dystopian environment of CHILDREN OF MEN and DISTRICT 13 to London’s East 17. SHANK delivers a ruthless vision of forthcoming urban life, where guns have been superseded by knives and are fiercely wielded by aimless youths. Amidst the chaos is the Paper Chazers gang, a rare morally conscious group who trade scavenged food for money. After Chazers gang member, Junior (Kedar Williams-Stirling), witnesses his brother, murder he must decide whether to get revenge of stick to the gangs moral code... In this superbly paced and artistic film, present-day social issues, and murky city streets, provide a perfect canvas for imagination and action.",
      "similar": [],
      "original_title": "Shank",
      "runtime": 90,
      "poster_path": "/otfAeskPNqnkfJIr21GTeEFNNuw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/jtH0etKssdTBMcxmVX5mVXsOvEE.png",
            "name": "Gunslinger",
            "id": 7352,
            "origin_country": ""
         },
         {
            "logo_path": "/yV5sxmYy4nBptmedJbsUKpr6W4M.png",
            "name": "Gateway Films",
            "id": 7353,
            "origin_country": ""
         }
      ],
      "release_date": "2010-08-21",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "If you're not one of us, you're a victim.",
      "adult": false,
      "homepage": "http://www.shankthefilm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Mo Ali"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Paul Van Carter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1320296/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNzMyNjYwMDExNF5BMl5BanBnXkFtZTcwMzM2NTYxMw@@._V1_UY268_CR87,0,182,268_AL_.jpg",
      "actors": [
         "Kedar Williams-Stirling",
         "Adam Deacon",
         "Ashley Thomas"
      ],
      "reviews": [
         "Walking out of a film half an hour before the end is a gesture I used to abhor. No matter how rancid a film appears to be, you should always see it through once you've started. Otherwise you're not quite in a position to properly criticise it. I've changed my mind innit. Shank was profoundly unwatchable. I saw it in a theatre with maybe another 50 people; I could hear sighs and groans coming from all directions throughout the picture. Every macho posture, every tedious shouting match, every useless camera jerk, every inept stylistic manoeuvre seemed to audibly destroy a part of someone in there. Myself included, which is why I got the hell outta there. I haven't seen Bullet Boy or Kidulthood, two other London-set youth violence epics which apparently bear a resemblance to this dirge, so I cannot compare them. I can only say that Shank is a stain on the good name of film. It consists of scene after scene of fantastically unappealing teen anti-heroes yelling at each other in grimy surroundings, punctuated by the occasional flashy chase scene or, in one instance, a dogfight captured in outdated computer graphics. Despite the digitally-enhanced nature of this scene, we don't actually see the dogs fighting, just about 5 minutes of close-ups of the deliriously screaming spectators - the film actually goes out of its way to be boring and repetitive; I simply cannot believe that this was an accident or oversight. I kinda have a thing for Kaya Scodelario, and the promise of her presence may have been the deciding factor in making me go to see this mush. But she couldn't save it for me; she didn't even show up until the film had battered me senseless for over an hour, and by then I had already accepted that the useless script wasn't gonna give her a chance to display the spunk and sex appeal she delivered in Skins. This useless film wouldn't even let Kaya be spunky and sexy! I walked out shortly after she showed up, when it became clear she was there only for the lead actors to harass her a little bit. I'm pretty much finished now. Thank you for reading. And please don't give the makers of Shank any of your hard-earned, or even hard-benefited cash. They must learn to try harder.",
         "Menhaj Huda & Noel Clarke have a lot to answer for because without the success of their 2006 film Kidulthood this piece of crap would never had seen the light of day. The worst thing is we'll be seeing a lot more of this kind of thing as people - I don't know who - are paying to see this, having opened to Top Ten Box-Office in its first week. I guess I was warned in the opening credits of this film it wouldn't amount to much. How so, well, it features a man taking a dump in the street and thats how I felt having sat through all 90 Minutes. What I'd like to know is what the likes of Colin Salmon & Robbie Gee were thinking to be associated with this. Set in a future London that looks a lot like, well, the city today. I'm guessing its supposed to say something about \"Urban\" life & the street. Ya get me!! The film I assume is trying to tell the viewer that violence is bad however everything it says the opposite. A dog fight played out as a video game & theft is alright as long as its for your \"Fam\". Even the climatic fight at the films end is botched cop out. As I said before we are going to see a lot more of this kind of thing before we see any decent Urban set films. Don't bother to pay good money to see this don't even get it on DVD. Wait to it shown on TV hopefully at about 1am on a cold Wednesday night. Absolutely rubbish. http://www.imdb.com/mymovies/list?l=14198203",
         "Have you ever heard of the phrase \"All the gear, no idea\"? This film is the definition of what it means. The idea of Shank is a great one and it could have been a brilliant gritty movie but it's executed very poorly. While the movie questions you to ask yourself \"what if this decision was made and this happened\" and tries to send strong messages about anti-violence and such, it fails to do so and succeeds in doing the opposite, just like 1 Day. So the movie is set in 2015 and the gangs have taken over, the story revolves around Junior who witnesses his brother Rager being murdered by Tugz and so he goes out on a vengeance mission to find Tugz and kill him. Shank had a brilliant idea and it was interesting that it was a British gang culture movie set in the near future but everything about it was just terrible, from the acting to the directing. Let's start with the plot, it's very thin and has been done loads of times before and done much better, you only have to watch Kidulthood or Adulthood as evidence to this. Shank starts off okay with Junior narrating about how tough life is on the streets of 2015 and how he's part of a non-violent gang known as The Paper Chaserz and how his brother, Rager, and his other 'brothers' don't condone the 'postcode war'. That is until Tugz, the leader of a rival gang, stabs Rager, the leader of The Paper Chaserz, and Junior wants to kill Tugz. That was when the movie started to go downhill. It just felt like an excuse to make a movie involving teen gang violence, stealing, drugs and sex. This movie is basically the Daily Mail reader's worst nightmare. The characters in Shank were just uninteresting, everything about them was unlikeable. Yes they may have did one or two things that the characters did that made you laugh a little but other than that, you weren't bothered about any of them and they remain unlikeable throughout the movie. Also, it seems that they can't make up their minds whether they want to be violent or not. One minute they're saying they don't want to stand and fight and the next, they're threatening other gangs and dog fighting. While we're on the subject about the characters in this movie, the names given to them are terrible and sound a lot like nicknames a ten-year-old would give to look tough. Junior is alright but Rager? Kickz? Tugz? Craze? Whisper? They sound a little bit childish. Also, the gangs were named a bit ridiculous as well: Slaughter Gurlz, Paper Chaserz\u0085what's wrong with the letter S? Is it against the law to use S on the end of names? Personally, changing Kickz to Kicks looks better to me. Another thing that annoyed me about Shank was when Junior introduces characters, he'd always say they're tough, mean or psychopaths. This is supposed to be Broken Britain when gangs are extremely violent and killing people, you'd think you get the picture without him telling us they're mean. The cast of Shank aren't the best actors in the world and they don't do the best job with their characters. Adam Deacon and Michael Socha do a couple of entertaining scenes as their characters Kickz and Craze but other than that, the rest of the cast doesn't bring much to the screens. The acting isn't terrible but it is quite bad, especially Kaya Scodelario which came as a surprise considering she's a good actress in Skins. The direction wasn't really great either, the whole movie just felt like a feature-length music video (well, it is directed by music video director Mo Ali, what do you expect?). Shank should have been serious, what with the story and the messages but there were a few things in the movie that took the seriousness away. This is because there were some scenes including a dog fight with computer-game beat-em-up energy bars (you don't see the dogs fight, just spectators screaming at the camera) and a confusing Grand Theft Auto-like scene when Junior steals a BMX. Another thing Shank didn't have was a decent script, the lines were very lazy and didn't aspire or mean anything bar a couple of scenes. Shank is a good idea and, in the hands of somebody like Noel Clarke who had written Kidulthood and Adulthood, could have been a great movie but in the end, it was dull, boring in most parts and offers nothing new. I really wanted to like this movie because I thought the idea was brilliant but unfortunately, I was very disappointed with this monstrous mess. Teenagers will probably love this movie but I doubt adults will like it. If you want to watch a better movie than this, watch Crank, The Warriors and Adulthood since it's those movies combined together. I pray British movies do better than this attempt from now on! Read more reviews at: www.dudedazzmoviereviews.wordpress.com",
         "British film is going down the pan, unless you're one of the few lucky Brits who get millions to play with like Ridley Scott or Neil marshall. All we ever seem to get are British gangster movies and they're always utter s##t, does no one have any other ideas?. This one in particular was the worst god damn thing iv ever wasted 20 min of my life on, i know team America said every film needs a montage but do you really need one every 5 min? i felt like i was watching MTV base......i was just waiting for that dizzy rascal guy to jump out and spin a rented medallion into the camera. I have no idea if this film got any better and frankly i don't care, every copy should be recalled and burned and anyone who actually spent money on this should get it back, unfortunately we cant get our lives back. If you have any sense at all you will put this back on the shelf and walk away and spread the word.",
         "I will have to be extremely short and punctual cause this flick doesn't even deserve more than 2 sentences. Absolute parody of a movie, bad screenplay, worse acting, cheap characters, and for Christ sake this is not English that is spoken, but some degenerated conceptual slang, that is absolutely impossible to get.Not only for jokes, but also simple lines. I'm absolutely glad its over, and will free my harddrive from this non- sense right away. Whoever understands 3 sentences in a row of the speech involved is a superhero according to me. Don't waste money on a sequel, and maybe offer with English subtitles, although I am not sure it will help.Boo",
         "I began this film with high expectations, thinking it would send out a moral message about drugs, crime and gang culture. But somehow this film ,even though it is supposed to send this message, fails and actually makes gang life look great. The filming is awful every scene starts with some ridiculous 'where the hell and what the hell is going on' filming and terrible music. I didn't pay £7.50 to see the camera shaken this much. Normally I don't mind swearing, but this film is actually worse than This Is England or 28 Days later. Every sentence is met with a 'F**k. I wouldn't care if the film was any good! The plot is just appalling, the most blatant plot and blatant ending, this film is trying to be groundbreaking, but unfortunately it's groundbreaking rubbish. There are so many pointless scenes of people smashing each others heads in and pointless sex scenes. The acting is terrible! One of the big cheeses actually sounds unbelievably fake I laughed. This film is laughable and just rubbish, the only good thing is the picture quality. Thats it though!!!",
         "OK, this will be a very short review. Only watch this movie if you are really, really into gang-type movies and just have to watch them all. And then do so with full knowledge that this might just be the worst you ever saw. Otherwise, save yourself the waste of time, I wished I had. And yes, the basic idea of a city like London being extremely divided in a poor and a rich segment is not that bad. But they could have made a way better movie about that if you ask me. Nothing good then? Well, the camera-work is not too bad, and use of colour is reasonable. But that really is it, in my humble opinion.",
         "With an opening sequence copied from DISTRICT 13 and an entire storyline and setting copied from KIDULTHOOD, there's nothing remotely original about SHANK. It juts and jumps all over the place, telling a storyline of revenge and brotherhood that's been done to death a zillion times already. It makes you feel like this particular genre of gritty, London-set gangster film is dead in the water, although a film came along a year later that proved there was still life in the genre yet: I'm talking about 2011's ATTACK THE BLOCK, of course. Sadly, SHANK is nothing like ATTACK THE BLOCK. The script is dead-headed stupid, the characters clichéd and the frenzied editing actually nausea-inducing. The obnoxious leading characters are repulsive in the extreme and their quest to undertake revenge seems to go absolutely nowhere; by the time the film ends, absolutely nothing has happened to any of them. There are no character arcs whatsoever. I don't know what's worse, actually: Paul Van Carter's wannabe-hip script or Mo Ali's drug-addled direction. Put together they provide a nauseating example of all that's wrong with British cinema when a successful film comes along and the inevitable rip-offs follow.",
         "I'm not someone who's met many of the rich and famous . One celebrity duo I have met was Dappy and Fazer from N-Dubz \" Who's N-Dubz ? \" yeah that's the exact same question I asked wondering why all my female teenage colleagues started resembling wild cats in heat because a couple of nobodies came in to have something to eat . N-Dubz - who were that day minus that bimbo who went on to judge X-FACTOR - were a mainstream rap act who would sing about life on the mean streets of Camden Town . Obviously having such tough lives where stabbings and shootings and gang warfare is everyday existence in the ghetto they felt the need to employ a big scary black geezer as a minder because they're entering a strange untamed land called Scotland where their reputation for being violent gangsta rappers might proceed them . Before they left one of my colleagues Nicola asked to borrow my lighter which she then proceeded to give to Dappy because being a hard gangsta rapper means only wimps buy lighters innit . As they left they passed by me and stopped to give me a dirty look so I gave them a wave . Why I did they stop to stare at me ? I don't know but it's easy to give strangers a dirty look when you've got a big scary minder with you . Two things I learned that day 1 ) If you're mildly \" famous \" and I use that word in its loosest , vaguest sense then teenage girls working in dead end low paid jobs think it's very exciting 2 ) There's something amusingly pathetic about middle class posers thinking they're hard nuts from a lawless Hell on Earth ghetto Bearing this in mind I sat down to watch SHANK released in 2010 and set in 2015 where Britain has suffered economic and social collapse and where a 14 year old boy is chased by a youth on a motorbike . The scene despite blink and you'll miss it editing seemed to go on forever . Two things I was able to discern from this long opening scene was 1 ) Britain will be guaranteed a gold medal at the 2020 Olympics 2 ) London council estates have motor bike access As the story continues a picture is painted that life is cheap and people have to run with the pack if they want to survive the streets - it's the law of the jungle and survival of the fittest as Junior the 14 year old boy from the opening sequence tells as about life and death in a factionalised London that is being devastated by gang warfare I didn't expect it to be like the all too convincing scenario Nigel Kneale used in his 1979 QUATERMASS serial but did get reminded of the 1994 film SHOPPING starring a young Jude Law . That was a painfully underdeveloped film but within a short space of time you realise SHANK is going to be much worse due to screenwriter Paul Van Carter using made up idiosyncratic street lingo innit and director Mo Ali using sharp editing , ramping and every other directorial technique he feels like along with a constant drum and bass soundtrack . If either of them are making any social comment it becomes confused and probably ironic . By the time we're introduced to a Somalian street gang where the stereotypical characters constantly chew Khat you're worried that SNATCH might be turning in to a recruitment film for if not the BNP then certainly UKIP One wonders if Mo Ali might have been aware of this because a third of the way through the whole tone of the film changes . The cast who up to this point have been the most laughably unconvincing street gang I've ever seen with Sweet Boy played by someone who'd look at home as leader of the Nu-Labour Party , start becoming subliminally conscious that they're a bunch of middle class thespians straight out of stage school and not street tough nihilists from a slum and start playing up to this . Actually they're a likable bunch of lads and when we get introduced to an equally unconvincing female street gang of slappers called The Slaughter Girls played by actresses that any dad would be proud to have as a daughter in law I found myself starting to enjoy the film for some reason . I guessing because the cast who are having so much fun are able to translate it the audience . Sure it's a dreadful film but at this point it's not supposed to be serious and the cast act accordingly . This leads me to ask why the ending features a violent act of revenge which again feels entirely different from what proceeded it ? This is a genuinely bizarre film . Certainly not a good film at all and I totally understand why people might be coming out with the \" worst film I've ever seen in my life \" cliché . It is a film that starts with serious pretensions of being a grim social commentary on broken Britain for the first third then gives up the ghost and one might actually think it satirizes pathetic middle class public school boys who are in to wigger gang culture ( Hi N-Dubz ) and is quite enjoyable at this point if you don't take it seriously but the final resolution is violent and downbeat which left me confused as to the point it was making . In its defence the characters are infinitely more likable than the ones in the not too dissimilar ATTACK THE BLOCK that came out a year later",
         "London 2015. Society has split in two leaving the economy and most basic services in the hands of private corporations. The city itself has been split between the well-off and the rest. Within the cut-off squalors of the capital's streets gangs of hoodlums divide and rule the limited wealth. Food has become the most important commodity: munchies are worth life and death. The Paper Runners, led by Rager (Ashley Bashy Thomas), is a small gang of misfits with a knack for getting stuff without bloodshed (don't cause any harm and no harm can come to you). Rager is a role model for his little brother, Junior (Kedar Williams-Stirling), a get-away specialist, as well as the remainder of the crew: Kickz (Adam Deacon), Craze (Michael Socha) and Sweet Boy (Jan Uddin). However in this dog-eat-dog world not everyone has such scruples and youngling Tugz (Jerome Holder) is the worst of the lot... \"Shank\" is an explicit orgy of sound and images pasted together with an initial headache reaction. After the initial onslaught the fast editing and video-clip montage on acid does recede a couple of notches, so the story can be fleshed out. But even than we are input sequence after sequence of rapturous music and occasional computer-inspired scenes drowning out the plot and most of the character development. At times the movie actually feels more like a filmed video game (or more like a singular mission/level of it), where occasional power bars and animations fit effortlessly as part of the experience. This all-action approach did however cause many key moments of the movies to lack enough contemplation - Mo Ali was unable to take a breath and let the moment sink emotionally into the viewers. The occasionally uninspiring derivative plotting and/or dialogue don't help to overcome this obstacles either... Nonetheless this unrelenting storytelling isn't all amiss, as in between this overzealous approach to innovative methods of telling a film story, you find a decent amount of subtexts and brilliant ideas. Unfortunately for Mo Ali his incapability to show restraint (and unwillingness to use some more classical artistic tools) hindered the intriguing concept of a boy being unable to properly identify feelings of emptiness and anguish, instead channelling them into revenge and anger. Also several scenes were extremely inspiring in their capability of mixing emotions or simple storytelling with a modern cutting edge freshness to them. Despite being uneven and at times lazy it does however warrant a look, as there are several gems hidden inside its chaotic shell. Despite everything said the movie is at least a brilliant score to the movie, which shows that England remains the epicentre of adventurous music.",
         "I really really try to view a movie on it's merits and go into seeing one with an open mind and watch it to the end. With this i couldn't, what can i say, it's a dog, simple as that, a dog with 4 broken legs would be more apt. Combine a poor plot, poor acting, great British stereotypes and you have Shank. The director must have been asleep and the editor obviously only did this project for the money, don't ask what the actors did. This would border on some of the worst, if not very worst piece of British cinema i have ever had the misfortune to see. I felt like i was parted from my money under false pretenses. It's not possible to rate this a 0 but i will anyway. Save your money and rent something else",
         "So i went to watch this film last night expecting it to be ANOTHER urban teen drama, but i was pleasantly surprised. I do however feel that the whole concept was aimed at a younger audience as the film was set out in a video game style format as the whole plot was like a mission/quest in a video game. Some people may not have grasped this concept but i personally thought it was very well carried out. This was a breath of fresh air for the urban movie scene as it broke the cliché of serious underground teen drama with its humorous twists throughout. It may have been difficult for some people to grasp that some of the more tongue in cheek scenes of the film were made on purpose in good humour. However, what let the film down was the suddenness of some of the key events within the film. Rather than building up to them, i felt they were rushed and poorly timed. Yet, some of the events that did cause some tension and ambiguity left me disappointed as the scenes where these buildups of tension climaxed, went in a completely different direction than i would have expected or therein wanted. In summary i thought this film good although it could have been better. One thing that people have to realise is the message Mo Ali is trying to send across to the younger audience who may be involved in postcode warfare. It tries to educate the youth in thinking about consequences before they act on something. Therefore i see this film as most people see Marmite. You either grasp the concept and comprehend it fully and in essence love it, or you don't grasp it and find some of the scenes pointless and therefore hate it.",
         "If you believe the marketing that is what this is. And in a way the marketing guys got it right. This is actually what you should expect from this movie. Maybe they also should have mentioned, that it is an extended music video. Every 3 to 4 minutes there is a song coming up, sometimes played as a story evolution or as a montage piece. But you will hear quite a few music pieces before the movie is over. And if you like the music, at least you will be entertained in one category. The question is if the director did music videos prior to this (though it seems like a given). The flashy cuts, the music, the style overall would suggest so. I wouldn't go as far as to compare it with Kidulthood. I don't think it could stand a comparison and it would be unfair to the movie. It's nothing big and has quite a few flaws and will only appeal to a certain group of people. But that doesn't mean it's completely bad. It has a few nice things going for it ... you just have to find them (and it won't be easy)",
         "OK normally id watch these types of films and within 5 minutes be completely hooked, (however) this was so dull that i would of happily turned off within the first fifteen minutes of viewing..... most of the acting was OK and especially by Adam Deacon (kickz) who i think is a great actor. Another actor who caught my eye was Bashy. (Rager) he was brilliant and will be looking out for in the future.. the story could of been so much better there was a few good ideas adding gaming style death o meter to the dog fight scene was classic.. i can only give this film four out of ten at the maximum any more id be lying and wouldn't be fair to anyone going to pay at the cinema. (this is my personal view only but be warned)",
         "Okay, take it from someone totally objective. I have nothing to do with this movie and could care less about what country a movie comes from. All I care about is whether or not a movie engages me from beginning to end. Shank has its flaws but what low budget movie doesn't. As far as low budget movies go, this is top notch. I really got a rise out of the juxtaposition between reality and the digital world. I especially enjoyed the pit bull fight that had life meters like a video game. This is not at all a complicated or thinking person's movie, just a low budget action packed tale about some angry youths seeking revenge. But this film doesn't steal from any vigilante genre pieces, instead creating its own stream of consciousness bleeding every trick of the low budget film for what it is worth, and it works just fine. I liked it. Enough said.",
         "Yes, London is deteriorating, thanks largely to these juvenile criminals whose life revolves around drugs and violence. Stay away from this movie: it has NO redeeming features, is a total waste of time, unless perhaps you are doing serious research into the mindset of these hooligans who threaten all of us. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. NOT recommended, deserves a ZERO reating. #",
         "Shank tries to emulate those urban Noel Clarke heavy films and again we have an underclass in tower blocks trying to make ends meet in an urban wasteland. At least Shank is set in the near future in a Britain suffering from economic collapse and food is scarce. The film follows Junior and his older brother Rager who is the head of the local gang, 'The Paper Chaserz' who have a moral code of refusing to kill and getting involved in violence. However a plan to steal goods from a van goes wrong as a rival gang called the Soldiers take over the attempted theft and as they chase Junior they end up killing Rager. Junior and his crew are now looking for revenge. The actions starts in a frenetic and heavily choppy edited fashion with Junior doing Parkour moves as he tries to get away from the Soldiers. However as suspected the film runs out of juice, the writer and director seems to think that all the youth of today want to hear is that every other word to have f@@K in it not helped by some too loud rap soundtrack especially near the end when all I wanted to see is the climax of the film and how they will deal with the thrust of their anti violence message if at all possible without being cack handed. Unfortunately cack handed it is as its a circle that cannot be squared. The actors do well especially Kedar Williams-Sterling but they are not helped by the screenplay.",
         "So i saw this in a completely packed cinema. There was a lot of hype around it and i'd heard about it anyways, so i paid my money to see it on the big screen. My initial reaction is that this is like a modern, urban version of Snatch, like a guy Ritchie movie made by the black British youth. And that's not a bad thing. I was sick to death of the adulthood type films, and the Adam Deacon crowd, but to be fair this is a very refreshing change. There's been harsh word about it, prolly because a) the reviewers don't get the grime scene, b) it is SO different from the adulthood films that some people including my mates didn't no what to make of it, and c) it is TOTALLY a kids film. But i like watching all kinds of films so i gave it chance. I gotta say it did look kind of low budget in a lot of places, but i was surprised by Adam deacon, he did a funny turn in this, Ashley Thomas turned in a strong performance, and the lead kid was very powerful. I do like Kaya Scodelario, so she was a very welcome surprise too. One of the MAIN things that makes this film very different, is that its been written like a video game, there's animations, and computer sequences, and music video bits from Tempa T and others, so in a way, its just taking all the gimmick that Guy Ritchie invented, and updating them for todays generation. I guess if I was a kid watching this it would be half like playing a new video game, and half like wathcing a new movie. Overall I think the director mo Ali has earned his place in new British film, and for a low budget movie i think this could well become a classic once all the hype dyes down. Maybe its kind of corny but then so was Warriors probably when that come out first.",
         "This film isn't for everyone. From the reviews this film has received on here I'd say that this film isn't really made for IMDb users specifically. The older generation that sees a good movie as a narrative with a quiet and linear plot line with some obvious sociological or spiritual statements would never understand this movie. I have been a film enthusiast for a long time. I've analysed a lot of movies but something like this I've never seen executed so well. Anyone that's spent any time of their lives holding angst will have music to reflect and indulge in. For different forms of people from older generations different forms of rock did the trick. Nowadays we have something different that speaks to the current teen generation (specifically that of England). That would be grime and Dubstep (wiki it). It's filthy, it's grimy, it's hard hitting and, for some reason, it seems to capture the perfect blend of dance, spirit, anger and violence that younger generations have grown up with. So what the makers of this film (and of Kidulthood/Adulthood) did is spill this blend on screen and express this in the best possible way possible to them.The film is filled with aesthetics that, after a while, become you. You become all that is tense, angry and grimy. Not that this movie is simply a Grime movie, there is a lot in the movie that people give it little credit for. While people were too busy pushing off this movie because of their natural dislike for anything new, many small things that resemble statements of maturity slipped by. So let me start with a rundown of the film. It's 2015 (not that far away) and London is divided between the have and the have-nots because of social, political and economic reasons (much like District B13). The film's protagonist happens to be a quiet boy called Junior who, with his money-chasing brotherhood, ends up running into senseless violence and has to watch his big brother die trying to protect him. This, of course, leads to a near death-wish lust for vengeance. So he sets off to find the thug that killed him in order to make up for his belittlement. His brotherhood isn't really happy with the idea (excluding Craze) but they go along anyway. Throughout the movie, his older peers-Kickz and Sweetboy, insist on telling him that it's never too late to go back and that absolute violence isn't the answer, same with a few older characters. However, these words do not reach Junior as he's stuck in a state of shock and has misinterpreted his feelings of mourning and insecurity as anger. So he goes through many of the older generations of people for help, who're either drunk or trying too hard to show off a sense of importance. They have very little to say and pitch into his lust for violence. Finally, after long walks back and fourth in the area, he comes to face his brother's killer and ends up giving up the shank for a clean heart. What the director was trying to express through the film was the confusion, anger and insecurity of having to grow up and live in a society brushed away from the eyes of an elite. Not only that but having to endure chaos while keeping a straight face. The movie makes several references to our need for violence by satirising video games. We see a video game sequence where Junior is running away from a helicopter on a bicycle but still get shot down. This is Junior giving narrative to his own anger and protagonising himself as the ultimate fighter but it ends in ruins when he falls down. We also see another sequence where Junior is dreaming of him fighting his brother's killer in animation-mode. This is another statement about violence in cartoons. However, Junior wakes up when the cartoon dream doesn't go his way and only ends up amplifying the horribleness of what really happened to him and his brother. There are more things like this in the movie for viewers to catch. This is the part where I note the drawbacks: -some parts (specifically with Whisper) were unnecessary -The editing in the club scene could've been leaner -Some characters were unnecessary -Junior's actor (Kedar)could've done a better job at being coherent when he talked. (I mean, srsly, how hard could it be to have a movie narration be fathomable?) Other than that Ali did a good job by keeping true to the Audience with the music, plot and actors while also pushing his raw expression with sharp, grainy, washed out photography and nauseatingly shaky cinematography. This movie builds upon Kidulthood and shows us the future of black British Expression. There is nothing to gain or lose with this film. It's simply expression to be felt, heard and seen. I don't expect anyone to understand this film now but in a few years this movie will be held up as a cult classic and a staple in a new emerging genre.",
         "i love this film, i have seen it twice, i don't know why people hate on uk actors and director, i love bashy and adam deacon and i though this was an amazing film. there is action and fights and a relevant story to what is happening on the streets these days, it can relate for a lot of people especially young people watching it. i thought the story was a bit short but it showed London in a new way and the cartoon bits was amazing too. i think i will get the DVD for this too, and you should buy it if you like kidulthood and bullet boy and also action films in this style, it is good drama scenes and also good action scenes. the music can relate for a lot of young people these days too as it is all dub and grime which i loved. if you are old you wont like it much but i recommend it for young people in uk today.",
         "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning From the makers of Kidulthood, proclaims this latest, modest budget slice of 'urban' life, and indeed, we're on very similar ground. Only set in the future, a very depressing, dangerous future that looks only too likely to be a reality, where knife crime and gangs have taken over a decaying London and it's a fight for survival that nothing short of a BNP government might have prevented. Shank does little to go in any direction other than any other film aimed at the 'yout'' culture of today goes, throwing all the common street lingo, slang and style in the face of it's audience, even the title a hideous term for stabbing somebody. It tries to throw in what it thinks is the odd little inventive touch here and there, but it is little more than another sad reflection of where our young people are today and where they're going. **",
         "From the upstart, this film does not know what it wants to be. In one instant, it tries to be a Noel Clarke 'ghetto' type movie, and in the next, it wants to be some steam punk movie from the eighties. It fails on every level, but it demands to be watched until the very end, because of its random set pieces, and really uncomfortable comedy. Set in the future, or five tears away, there is a shortage of food, and people now freerun or ride bikes for transport. Rich people still eat sandwiches, but hey, this film is aimed at the white collar wearing sun readers of the future, and this is another chink in its armour, it doesn't know how to treat the demographic its aiming at. So instead of sending out a message, it treats us to everyone's favourite screen hoodie Adam Deacon vomiting and talking the lingo he does in every. Single. Film. He's. In. there's a random CGI segment thrown in, and an animated segment to try and make it a little more cool, but again, it fails. The film has tried too hard to be something different, and this is destined to become obscure very, very soon.",
         "The film starts off with an eye grabbing first scene which sets up the chaotic nature of the story line and the rest of the film. I found the storyline and the concept of the film very intriguing and I believe this was one of it's high lights. People have criticized it as predictable but to be quite honest; I thought the death of Rager was ridiculously unpredictable. The ending is slightly predictable, but aren't most? I believe the script was the biggest let down for the film. The only decent scripting throughout the film is in our main character's (Junior) soliloquies type commentary in certain segments of the film. I believe the director did an excellent job. The film has a unique morbidity to it, and the editing and filming techniques are almost perfect for the type of film (excluding the fight scene which I thought was very poorly portrayed and edited). The soundtrack was great; with a grime feel. The film was also strongly criticized as a film that condoned and glamorized knife/gang violence but I think it did the opposite. Despite the fact there is a revenge message through out the film, we are also shown the desperateness and the corrupt nature of the setting (which may I mention is non-existent anyway), and that such violence is the norm there, not to mention the \"move on\" (anti-revenge) turn at the end. I enjoyed this film nearly as much as it's competitors Kidulthood and Adulthood and I feel it was too harshly criticized and is in fact; very underrated.",
         "there's something about this film that just says ballsy. yes its littered with flaws and week spots but for sheer energy and gutsiness it gets ten stars from me, mostly because williams-sterling emerges at the end as a possible movie star in the making, his range of emotion and energy just shatter the screen. he is a beautiful actor. i thought the music was top rate, just really drove the film along, and there was so many funny bits the rest of the cast was just hilairious. to sum this up i would say it is a new British film with great energy and action and stars to watch, the story really drew me in and if you not a fan of the British music scene maybe you wont like it as much but me and my friends loved it, i will defenitey buy the DVD.",
         "I watched this movie with Kidulthood, Adulthood in mind and its not quite on par with noel Clark's productions. I can honestly say i was a little disappointed with some of the characters mainly Kicks (adam deacon), i really enjoyed his performances in kidulthood, Adulthood. However he doesn't shine in this movie like he did in his previous performances. This isn't down to bad acting it was down to screen time he just seemed to be in the background. however Craze (Michael Socha) performance did make up for this in my eyes \"bloody northern monkey\". The cgi in the movie was poor to say the least, You could see what he was trying to do but the budget must of been way off what he wanted & looked more like something from the 80's. Obviously the writer didn't want to go the \"usual\" London gangster flick route. Instead it is set in the future (2015) Which for me didn't quite work. I would of much preferred a more real to life story. Be warned if you don't/cant understand London lingo then this will leave you trying to understand what is being said and will just sound like gobble de gook. Even with this in mind i am still going to give this movie a 6/10 just because i enjoy inner city gang films. So to sum up the casting & performances were good including the \"New boy.\" The story was mediocre. the OST was good. My top 10 Gangster/London Flicks 1.Rise of The Footsoldier, 2.Kidulthood, 3.Bullet Boy, 4.Adulthood, 5.Rock 'n' Rolla, 6.Harry Brown, 7.Sugarhouse, 8.Shank, 9.Essex Boys, 10.Cass Next review will be Bonded by Blood. Thx for reading, peace out."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Gunslinger",
         "Gateway Films"
      ],
      "summaries": [
         "Set in a dystopic future London in 2015, where society has fallen apart, gangs have taken over and the economy is in complete anarchy. The story follows Junior and his older brother, Rager, who are in charge of a local gang, \"The Paper Chaserz\". They try to stay out of trouble and refuse to kill as part of their 'moral code', which is especially enforced by the strong but defensive Rager. Rager leads his gang, \"The Paper Chaserz\" and they plan to steal goods out of a local van. The robbery is successful, but a rival gang called The Soldiers, who are notorious and bloodthirsty in trying to take-over all other postcodes in the London area, attempt a theft. The \"Paper Chaserz\" escape, except for Junior who is stranded and cornered by The Soldiers. Rager reappears and saves his brother by beating all the rival gang members, telling Junior to leave. As Junior flees, Rager is attacked by the crews leader Tugz, who stabs Rager in the back multiple times. Junior now teams up with the rest of his gang to get revenge on The Soldiers. The gang meets a trio of girls named Ree Ree, Tash, and Little Lexy, who agree to help them as they also have a reason to get revenge against Tugz.",
         "An action film for the youth generation, set in a decaying future London. A gang set out on a chase to avenge the murder of one of their own."
      ],
      "budget": 385000
   },
   "movielensId": 138794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-08-21",
      "dvdReleaseDate": null,
      "directors": ["Mo Ali"],
      "runtime": 90,
      "movieId": 138794,
      "title": "Shank",
      "mpaa": null,
      "actors": [
         "Kedar Williams-Stirling",
         "Ashley Bashy Thomas",
         "Adam Deacon",
         "Michael Socha",
         "Jan Uddin",
         "Kaya Scodelario",
         "Jennie Jacques",
         "Rheanne Murray",
         "Jerome Holder",
         "Terry Stone",
         "Robbie Gee",
         "Robert Fucilla",
         "Eddie Kadi",
         "Luke de Woolfson",
         "Colin Salmon",
         "Aml Ameen",
         "Gabrielle Ryan"
      ],
      "imdbMovieId": "1320296",
      "originalTitle": "Shank",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["kfapOIPCRik"],
      "plotSummary": "Mo Ali’s futuristic knife-crime drama brings the dystopian environment of CHILDREN OF MEN and DISTRICT 13 to London’s East 17. SHANK delivers a ruthless vision of forthcoming urban life, where guns have been superseded by knives and are fiercely wielded by aimless youths. Amidst the chaos is the Paper Chazers gang, a rare morally conscious group who trade scavenged food for money. After Chazers gang member, Junior (Kedar Williams-Stirling), witnesses his brother, murder he must decide whether to get revenge of stick to the gangs moral code... In this superbly paced and artistic film, present-day social issues, and murky city streets, provide a perfect canvas for imagination and action.",
      "tmdbMovieId": 41345,
      "avgRating": 2.6,
      "releaseYear": "2010",
      "numRatings": 5,
      "posterPath": "/otfAeskPNqnkfJIr21GTeEFNNuw.jpg"
   }
}