{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0461989",
      "video": false,
      "title": "The Magician",
      "recommendations": [],
      "backdrop_path": "/2OuDbywsFdsY1fA3TFgCzZIdD20.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ray Shoesmith",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062bad",
               "name": "Scott Ryan",
               "profile_path": null,
               "id": 76366,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tony Rickards",
               "gender": 2,
               "credit_id": "5458cf270e0a26115e001c65",
               "name": "Ben Walker",
               "profile_path": null,
               "id": 1381689,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Massimo \"Max\" Totti",
               "gender": 0,
               "credit_id": "5458cf48c3a36839a0001c1d",
               "name": "Massimiliano Andrighetto",
               "profile_path": null,
               "id": 1381690,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Benny",
               "gender": 0,
               "credit_id": "5458cf530e0a261165001bf2",
               "name": "Kane Mason",
               "profile_path": null,
               "id": 1381691,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Edna",
               "gender": 0,
               "credit_id": "5458cf5d0e0a26116f001af5",
               "name": "Nathaniel Lindsay",
               "profile_path": null,
               "id": 1381335,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Garage Victim",
               "gender": 0,
               "credit_id": "5458cf750e0a261162001bb8",
               "name": "Adam Ryan",
               "profile_path": null,
               "id": 1381692,
               "order": 5
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.365256,
      "production_countries": [],
      "id": 14096,
      "vote_count": 5,
      "budget": 0,
      "overview": "Following the dealings of a Melbourne-based hitman Ray as seen through the eyes of his ex-neighbour and friend Max, an Italian film student. Max and his camera witness Ray's work life as it unfolds from day to day, giving an insight into a world we rarely see, and at the same time developing an unusual friendship with his subject.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "The Magician",
      "runtime": 85,
      "poster_path": "/pRICa5CUsuoI5qXsrtJb9NuakGG.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2005-06-18",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "For the right money he can make anything disappear",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Ryan"],
      "runtime": 85,
      "synopsis": "The Magician follows charismatic, yet volatile hitman Ray Shoesmith (Ryan) around Melbourne while he is being filmed by a friend and neighbour. As he goes about his chilling business - threatening violence and in some cases making good on those threats - the camera continues to roll, fuelled by offbeat conversation, dark humour and emotional crises.",
      "writers": ["Scott Ryan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0461989/",
      "coverLink": null,
      "actors": [
         "Scott Ryan",
         "Ben Walker",
         "Massimiliano Andrighetto"
      ],
      "reviews": [
         "When Melbourne hit-man Ray Shoesmith discovers that his next-door neighbour is a film student, he commissions him to document his life - the footage is to be released à la Pauline Hanson in the event of his early death. Australian filmmaker Scott Ryan is writer, director and star of The Magician. It's not the violence that Ryan focuses on, but the conversation, the banalities and intensities of human interaction and obsessive interest in detail. The film shows us what makes Ray tick as we witness first hand his brutal efficiency. It's a fake documentary played straight. It's darkly comic and totally draws you in, to the point where you wonder if it's real. It's Ryan's marvellous performance that serves as the glue that holds everything together. His character is a killer, a man who'd as soon pull the trigger as not, but without smoothing out any of the rough edges the actor makes you like him when what you should be feeling is utter loathing. And that's no small achievement. Scott Ryan has a gift for the Aussie vernacular that ensures his remarkable debut (think Chopper meets Spinal Tap) is destined for cult status.",
         "I recently saw the world premier of this film at the Sydney Film Festival and I admit I wasn't expecting much. It was dubbed as some kind of Chopper-like film with no budget, no known cast and shot on the streets. I was surprised to find it quite entertaining and a real relief from the mostly poor uninspired films currently being made within the Australian Film Finance system. 'The Magician' has a real edge and it has one element lacking in most of the cinema produced in Australia, a strong, genuinely funny lead in writer/director Scott Ryan. Shot in digital video this is a mocumentary on Ray Shoestring, a Melbournian hit-man, a man that makes people disappear. We following him on his exploits see the reality of this profession. Full of improvised dialog and shot in a raw, realist style, you get an insight into the mind of a flawed killer. The character takes his time on camera, you see him thinking and he becomes disturbingly real. The funniest film I've seen come out of my native country in years. Its interesting to note, according to Scott, it was filmed in ten days on a self raised AU$3000. It is a testimate to the passion of the Australian filmmaker making what he can without the need for 'developement' money and 5 - 8 years of 'writing'. It's the most inpiring self funded work I've seen since Robert Rodriguez filmed 'El Mariachi' for $US6000 in 1991.",
         "The movie began with hand-held shots of a man sitting in his darkened car explaining to the camera that he's going to follow the bloke into the garage and then \"give him the good news\", and that he does. The Magician is a movie written, directed, produced and edited by Scott Ryan, oh, and he plays the lead as well. Reportedly he did so on a budget of only 3,000 Australian dollars and in only ten days, although reports suggest that he spent something in the region of five years writing it! It's an interesting tale of a filmmaker who makes a documentary of hit-man Ray Shoesmith and a few of his \"marks\", and that's really about all there is to it. Yet it turns out to be rather fun. It begins darkly and the latter half presents a more sobering tone, but the mid section is more about clever dialogue which, at times, can be extremely funny. Scenes such as the bet between the film maker and Ray if Clint Eastwood was in The Dirty Dozen, where Ray opens the boot to get the mark to list the actors are absurdly funny, and this is a pattern which follows for most of the lighter middle part of the film. However the darker sections are the more intriguing, the filming of the man digging his own grave in the middle of nowhere, Ray sitting explaining his planned hit in the darkened car, these scenes are thoroughly absorbing. It's in these darker scenes that I find the comic moments work the best, when the film maker and hit-man are chatting about some stupidly funny topic and then he turns to kill someone. The contrast of the normality of the situation and the friendship and banter that these two characters have built up with the inhuman, violent acts of the hit-man show the complexity of the character and the fact that he is normal just with a very unusual side! There's even the compelling caring side of Ray that appears when he tries to help the film maker get his stolen gear back. Listening to his somewhat late bout of morality as he pleads not to hurt the thief is actually very amusing, particularly Ray's face and calm manner when he returns after asking politely and being told to get lost. This scene, and Ray's reaction is just superb. Ryan takes over the movie and steals the show wonderfully, he's utterly engaging in front of the camera, and his slow, drawn out, casual style gives a natural performance. Although it's fair to say that at the beginning of the movie it takes a little while for both he, and the audience, to get into the stride of the movie. For me the natural side of the movie is pulled back by the performance of Massimiliano Andrighettowho plays the film maker, Max \"Massimo\" Totti. Considering the situation and the acts he's witnessing Ray commit, I found it hard to accept his open and often argumentative approach with the character. It didn't sit well for me with the image of a hit-man. I forever thought that Ray's patience would break and he would stop idle arguing with him to either kill him or beat him to shut up, yet perhaps this shows the measured and calculating Ray. Yet I could just not grapple with the idea that the film maker would be so fearless. This movie is about the superbly written dialogue and the very well acted Ray. However it tries to be a bit too comic for my tastes, and with the darker element attached it seems to be confused as to what story it really wants to tell. Very reminiscent of the banter and connection in the film Chopper, yet for me that pulled off the mixture of comic and darkness far better. Still entertaining though, and some of the dialogue will stay with you after you leave the cinema. Dark humour indeed.",
         "Scott Ryan has fashioned a spectacular debut film on literally the sniff of a wet rag. The Magician displays a level of ingenuity and confidence rarely seen in the Australian film industry. This film certainly makes a mockery of all the crud that has been churned out lately with significant AFC funding. The Magician is a very funny mockumentary about a hit-man, Ray. The film is really nothing more than a series of vignettes which show Ray carrying out his occupation and chatting with the documentary filmmaker, Max. This film really should have been an exercise in boredom. However, The Magician manages to be one of the most entertaining Australian films to see the light of day in a long time, almost entirely due to the efforts of writer/director/actor Scott Ryan. Scott Ryan is mesmerising as Ray. This character manages to be abhorrent, hilarious and strangely moral without ever slipping into parody. As well as making a convincing hit-man, Ray is also the perfect mouthpiece for Ryan's witty jabs at everything from the legalisation of drugs, to the prevalence of gays in Hollywood. One of the most enjoyable aspects of the film for me is that it is so Australian-centric, for want of a better word. This film isn't trying to imitate Tarantino (like ever other debut film featuring a gun fight), nor is it making a desperate grab for international attention, like most of the dreary \"quirky\" (i.e. crap) comedies receiving funding from the government. The result is a highly distinctive film that feels completely original. There are a couple of minor problems with the film that most likely stem from the tiny budget. With the exception of Scott Ryan's fine performance, and perhaps Ben Walker's engaging turn as Tony, the other actors are clearly amateurs. The character of Max is also somewhat perplexing. There is no explanation for his rather amoral and perversely non-judgemental approach to documentary film-making. The extensive use of Max's hand-held camera is also somewhat disorientating to begin with. My biggest complaint would have to be the film's ending, which seems forced and came around much too quickly. I'm glad that films like The Magician can still get made in this country and I hope that it works as a calling card for the outrageously talented Scott Ryan. I'm really perplexed why it (or \"Wolf Creek\" for that matter) didn't win a swag of AFI awards. I guess that both films made the mistake of actually being entertaining.",
         "This is the best Australian film I have seen in a long time. I saw it as part of the Sydney Film Festival 2005. It was made by Melbourne filmmaker Scott Ryan. He shot it over ten days over two years. It cost him about $3000 to make. The key to this film is STORY. Admittedly it took me about 10 minutes to really appreciate what I was watching, but then it got me. The story is quite simple - following hit-man, Ray Shoesmith, as he goes about business and chats about the industry he's in... it is dark - but the character, his dialogue, his way of thinking are so Australian and although quite funny at times, are also totally logical (well mostly logical). The character has quite the infectious smile too. At the end of the screening, Scott Ryan and producers Michelle Bennett and Nash Edgerton (who both came on after the film had been shot) did a Q & A. When Scott was asked if he thought the film would have been better with more money behind it, he said probably yes - but only in the sense that it would have allowed him to do more in the film, which he couldn't afford to do otherwise. Michelle Bennett then stepped up stated that she believes the key to this film is its story and its performances. I agree, they were exceptional and it is highly unlikely that money could have improved them. The film is edgy and occasionally jarring. As mentioned the performances are very well executed, particularly by Scott who (besides also being the writer and director) plays main character Ray. His acting is subtle and Scott doesn't rush to deliver his performance - he lets us see Ray think about things - pondering his thoughts and actions, it was really very impressive. The supporting cast was also excellent particularly Massimiliano Andrighetto who was also the films' cinematographer. This film is proof that here in Australia we do have some great stories to tell. Stories which go beyond an Aussie Battler struggling through life before he eventually (despite being a little on the slow side) triumphs at the end of the film. While Ray (in THE MAGICIAN) and I may not have a great deal in common, I recognised him. Knew his character, understood his way of thinking (a unique Australian way of thinking) and loved that I was watching a really original and very different Australian story to those I usually see at the cinema. I loved it, it kept me interested, made me laugh out loud and I can not wait to see it again. Highly recommended.",
         "The Magician was brilliant. Kudos to Scott Ryan! His portrayal of the \"thinking man's\" hit man really drew me in and had me slapping my knee and laughing out loud throughout the movie. With a budget of AU$400,000 (miniscule by Hollywood standards), a refreshing lack of special effects, car chases, explosions and the like, the super funny dialogue and utter moral conviction of hired heavy, Ray Shoesmith, transforms this diamond in the rough into a jewel of a film. The Magician, sure to attract a cult following, hopefully provides a platform from which writer/actor/producer, Scott Ryan, can entertain and delight us with further projects. Cheers, ozgal33",
         "Although it isn't magic he uses, not unless you count a count as a wand. He is a hit-man, working in Melbourne, and this documentary style film recounts a few of his jobs. The condition imposed on film-maker Max is that he won't release the film until after Ray's death. It is a strange film, but very enjoyable. The style is used to allow Max to question Ray about his actions. To have an outsider looking in wondering can Ray tone down the violence, or how much would he want in order to eat his own excrement. Did I forget to mention this is a comedy? The focus of the film is all on Ray. The rest of the characters are just their to provide him with something to interact with. And Max, the cameraman is never shown un-pixelated on screen, to protect his identity from the police no doubt. And Scott Ryan gives an excellent performance as the almost charming hit-man. His sense of timing is perfect and his delivery of the lines is spot-on. Of course he did write and direct it, so he should know everything about this character, but it is still a wonderful role. It is almost a buddy road movie, with Ray, Max and a possible target traveling across Australia to locate some money. There is a great discussion about Wayne Carey and whether sleeping with your vice-captain's wife could ever be regarded as merely a mistake. Probably more likely to turn out to be a cult hit than a blockbuster, if you get the chance you should try to catch this film.",
         "This is an amazing piece of filming, original made as a \"short\" by Scott Ryan, who was talked into making it into a full-length feature. Written, directed and the main actor Scott Ryan made this film a budget of $3,000. Australian Dollar. Awards and film festivals: Australian Film Critics association Awards 2005: Nominated: Best Actor In A Lead Role (Scott Ryan) Cinematic intelligence Agency Trenchcoat Awards 2005: Nominated: Best Australian film Edinburgh International film Festival 2005: World Première If Awards 2005: Nominated: best Actor (Scott Ryan), Independent Spirit (Scott Ryan, Michele Bennett, Nash Edgerton) Why this film wasn't publicised and advertised to the hilt is beyond my understanding. It is totally fascinating and crosses all age barriers. How can you so like a man who's profession is \"Hitman\" Witty and so matter-of-fact that you don't realise that you are empathising with a professional killer. You like him. 10/10",
         "In the same mould as Clerks, we follow the life of hit-man Ray, who prides himself on making people disappear. Set in a period where underworld violence was big news in Melbourne, this movie attempts to give an insight into the people behind the crime and not the crime itself. Just like Clerks, the characters debate trivial facts - such as Clint Eastwood's CV, the price of eating faeces - and it is in these conversations that we discover Ray's personality. On the opposite end of the spectrum, Scott Ryan (scriptwriter, directer and star) has restricted what we discover about Ray. We don't hear Ray justifying his line of work and we certainly don't find out the fate of his target, Tony (who offers to pay off Ray), almost until the end. Whilst the minimalistic feel of the photography may make some cringe, it certainly adds to the situation of the movie. The real winner in this movie is in the script and it's delivery. Without seeming to over-act, Ryan and Ben Walker's Tony give a realistic depiction of the situation. Scott Ryan has created an debut that (with a four figure budget) has fascinated Australian film-goers and kept us wondering what's next.",
         "The Magician is not as bad as some boring reviewer said it is. I didn't feel a lull at any point in the film and thought there were undercurrents of depth to do with Melbourne drug culture and dealing. The mundanity of it. The darkness. And a lead who is surprising in many ways. \"A fascinating and attractive man\" as Max says! Of course, you really do need to be familiar with Melbourne to get the street scenes. And Australian to understand conversations about Big M's and Wayne Carey. And is there anything wrong about making films for ourselves? And is there anything wrong with a filmmaker just getting out there and making something with no money, to get some experience, all for the love of it? NO! I hope this gives Scott Ryan a good go in the industry.",
         "This is a low or even no-budget film, and does suffer from some non-professional elements. However, for what it is, it's a really engrossing film that is both original and captivating. All of the actors are quite good, none seem to be acting and all possessing a natural presence necessary for the mockumentary to work. Some scenes are genuinely laugh-out-loud funny; others, should have been cut except then the 86 minutes running time would even be less. A movie about a hit-man needs to have more violence, and the Magician suffers from being too talky. Scott Ryan though really deserves credit, seemingly channeling Robert Carlysle as Begby. I think this is something like Clerks or Evil Dead that upon first viewing isn't overwhelmingly impressive but could gain cult status and gain a loyal fan base.",
         "This film is head and shoulders above many films because all of its characters are well rounded believable and interesting. Ryan's lead character is brilliant. The film balances brilliantly on a casual dread of this guy who kills people for a living, and could just as easily shoot you because you are inconvenient. Its edge of the seat viewing watching these characters interact and they are always believable, realistic and intriguing. Not one bad line, delivery or look. This movie is so well executed it could have been done by Ray the hit man, you'll never find the body. Come on Australia, this guy is a major talent. Don't let him go to waste.",
         "This film blew me away when i saw it. It may be an acquired taste but it is worth viewing if you enjoy dark humour and compelling performances. There are two moments of perfectly staged \"will he won't he\" tension, and this is one of the few films i have seen where i literally had no idea what was gonna happen next. The ending was one of the finest ever made, where 'The Magician' disappears into a crowd of people, never to be seen again. I am an englishman, and i suspect the humour might only appeal to British people and aussies - yanks won't get it - but that is the only slight criticism i can offer. This film is genius, nothing less. Repeated viewings are recommended. Enjoy!",
         "The Magician is a fake documentary about Ray Shoesmith who makes a living killing people. He is working as a hit-man for the different drug related organizations. The whole idea first sounds bizarre, and it is. Ray is not your slick \"in and out without a trace\" type of hit-man. This man feels like the real deal, he kills people in a violent and realistic way often by simply shooting them at pointblank and then hiding the body in the woods. Nothing about Ray's life is amazing or exciting, he eats burgers, he is not cool, he doesn't drop amazing punchlines before he hits someone or plants a bullet in their face. It reminds me a bit of a danish film called Pusher. It's the same kind of \"vibe\". The keyword for this movie would be realistic. The whole thing feels VERY real, and the actors are doing an amazing job. If we break it down not everyone will love this movie, it's very different, very different.",
         "\"The Magician\" is a quirky and darkly humorous mocumentary about the life of Melbourne-based hit-man Ray Shoestring. Followed around by his film-student friend, we see all the action through the lens of his ever-rolling camera. I find it hard to express what an achievement this film is. Scott Ryan- writer, director, producer *and* lead actor- pulls off a remarkable debut. His grizzly and hypnotic performance is frighteningly real. The depth of Ray Shoestring is a testament to the all-round skills of Scott Ryan. We can't help but feel close to Shoestring, even though we are left in no doubt about his dubious character. A large part of our sympathy with Shoestring is that, in true Big Brother diary-room style, all his thoughts, prejudices and passions are laid bare before the camera. \"The Magician\" is unusual in that it focuses less on the joy-riding, gun-toting, blow-things-upping side to being a hit-man, and more on the less glamorous sitting-around-in-a-car-and-eating-hamburgers element of assassinhood. A stunning debut \u0096 *not* to be missed. 8/10",
         "OK, so this film may be derivative. It owes a hell of a lot to Man Bites Dog, and more specifically The Last Horror Movie. But I enjoyed both of those, and this story about a hit-man who hires his film student neighbour to make a documentary about him is a) as dark as coal and b) funny as hell. There are differences between this film and the afore mentioned inspirations though. In Man Bites Dog and the Last Horror Movie, the protagonists were crazed killers, who attacked for no reason, and attacked constantly. In this, only 2 people are killed. The story is based around one of the leads 'jobs', and is indispersed with events and interviews based both before and after the job. The writing is both entertaining and moving, as the lead considers himself a man of some morals, just with a rubbish job. He goes and helps a friend take revenge on a former colleague who robbed him, because he considers it the right thing to do. He kills another friend in cold blood, because he believes it the right thing to do for his friend. Twisted logic and morality, but it's refreshing to find out why he kills. The film is worth seeing if the opportunity arises, and whilst it is a black as coal comedy, it's one that can make you think. And it's always good to see a film about killing where killing isn't the main feature.",
         "The only reason I am not giving it 10 out of 10 is that I got a couple of the characters mixed up at one point (the sequences are shown out of chronological order). It is also true, as other reviewers have pointed out, that the film gets a bit talky in the middle section. It is as if Ryan gets a bit seduced by his own script-writing. Well, it is hard to cut out writing. To my mind, the strength of this movie is the characterisation. Scott Ryan is a marvelous character - the antithesis of the wine-drinking, PC, environmentally-conscious middle-class intellectual elite of the Howard years. His accent is broad, he likes his 'chewy' and his 'Big M'. I was transfixed by the way he drank his McCoffee all up while seeming to wince with every mouthful. I don't want to make this a long boring review so I'll just make some final last observations: the crew double as cast in most if not all cases; stay for the end of \"I'll Be Gone\" by Spectrum and one last out-take after the credits are finished; Ryan has clearly been influenced by *Pulp Fiction* (and why not?).",
         "In a mock/documentary style, we travel around with Ray Shoesmith, a hit-man in the city Melbourne. After his latest hit on an unsuspecting man shot in his garage, Ray moves on to his next person. Tony is a drug dealer, who Ray's friend Edna has mixed up with. Grabbing Tony off the streets, throwing him into the car, drives off to the middle of nowhere for Tony to dig his grave. Jumping from Tony's ordeal, to other hits and Ray's rocky friendship with Edna, we start to see who this enigma of a man is. In recent times, films have been taking that step of raising life mundane aspects into a form of entertainment. The magician runs off a series of non-interconnected conversation, small banter, that ultimately has no end game; it doesn't bring much insight into the people we are watching. Gay actors, what car would you most want to own, would you eat your own excrement, Mardi Gras, etc. The dark humor that is entwined into these conversation stop The Magician failing into redundancy. Tiffs over how a dead man walking digs his own grave is nothing short of devilish. The problem with the conversations is they lack a lot of consistency. While many grab your attention, other fall flat and become mundane; much to the subject matter. For a hit-man, Ray is one unorthodox professional. Writer/director Scott Ryan spins the image of a hit-man from a suave, professional assign to an everyday Australian who you wouldn't pick from the crowd. Ryan never portrays Ray as an antihero, nor tries to make you feel sympathy for him, as he is an amoral person, in a amoral profession. Also taking the lead as Ray, Scott Ryan brings so much charisma to Ray. There is such a presence he holds, you don't want to miss a word he says. At times you are just wondering what is going on in his head. Ben Walker as Tony and Nathaniel Lindsay as Edna both give solid performances; both being amateur actors. The Magician does have it flaws, though they are overcome by some very interesting conversations with one strange man.",
         "The Magician is often compared to movies such as Chopper, Leon and Man Bites Dog (Cést Arrivé près de Chez Vous). Of those three, I would say that it comes closest to Man Bites Dog. Both movies are satirical and both movies have a killer followed by a camera. Still, though there are quite a few similarities, the Magician is certainly not a rip-off. Ray Shoesmith is a hit-man from Melbourne. His friend is making a documentary about him, as a sort of memento just in case he kicks the bucket a bit too soon. We follow Ray doing what he does. There are a few story lines woven through each other, with the mayor storyline focusing on a guy Ray is supposed to kill. Things take a different turn though and what starts out as a simple job ends up to be a bit more complicated. Instead of having it's main focus on violence, The Magician is much more about dialogue. And many of those dialogues are truly hilarious. Not in a typical comedy way, but the humor is much more in the normality of conversations between friends and conversations just to kill some time. Still, despite the humor and lightheartedness of some conversations, there is always that dark undertone. For example, at one point some fast food has to be ordered, which is quite an amusing scene. But at the same time, you don't forget that one of the guys is still Ray's mark. This makes it exciting all the way. At times you would almost think of Ray as just a normal chap, but certain scenes in the movie make clear that we do deal with someone who is a cold-blooded hit-man. The contrast between those sides of Ray is always there and make him a very believable character. He's charming, at times sensitive, but also a merciless killer, and often oh so real. Ray is brilliantly portrayed by director Scott Ryan himself. The acting is perfect, his performance outstanding. Some of Ray's facial expressions are worth gold. It;s quite a while ago since a movie really had me laughing out loud. I honestly can not find anything negative to say about The Magician. I can only say that this movie is absolutely worth your time and money. If you manage to get your hands on it, watch it. If you have a good sense of humor you definitely won't regret it. Kudos, Mr Ryan!",
         "The only thing I can really praise about this film is that for a feature film made with a $3,000 budget, it's a respectable achievement that should inspire other film makers that it is possible to make a film on a practically non-existent budget. And the type of film that Scott Ryan has made is perfect for a low budget film, a gritty documentary style. Its a style that suits the budget and available equipment. Other than that, however, there's not much else. This film tries to give the impression that it is a documentary following in the footsteps of a Melbourne hit man named Ray Shoesmith as he goes about his business: killing people. The documentary maker Massimo Totti follows Shoesmith around asking question and filming murders. In one key scene that typifies the whole movie, Shoesmith and Totti are driving in a car at night through the Victorian countryside with a drug dealer in handcuffs locked in the boot of the car. Shoesmith and Totti are arguing about whether or not Clint Eastwood was in The Dirty Dozen. Shoesmith stops the car, opens the boot with gun in hand and asks the captive in the boot if Clint Eastwood is in the movie. This is basically what the entire film is about: showing a hit-man and his victims casually talking and discussing pointless and irreverent topics like their favourite cars, football players and what they want on their hamburgers. Other glib scenes involve Shoesmith telling Totti that he's not going to share a bed with him in a motel if he takes his pants off. Scenes like this, of meandering vacant ramblings, are given a large amount of time in the movie, and my guess is they're supposed to be funny scenes. Other lengthy scenes involve Totti asking Shoesmith how much money would he have to be paid before he would eat human excrement and why has he never been to the Sydney Gay and Lesbian Mardi Gras. 85% of the film is made up of scenes like this and frankly it gets really boring. Scott Ryan gives a decent performance as Ray Shoesmith, but there is a problem which affects the whole movie. There are no characters or characterisations in this film. The characters are portrayed as superficially and rather clichéd. There is no depth in this film whatsoever. In this \"documentary\" we never learn why Shoesmith is a hit-man, we never learn who he kills and why or how he feels about it, we never learn who he works for and we certainly never learn what makes him tick. All we get to find out about him is that he hasn't the slightest conscience of killing people (in fact the whole thing means very little to him) and he thinks he's rather funny. He indulges in inane chit chat about pointless topics. I think what Scott Ryan is trying to do here is make a joke, the one joke this film is about: a hit-man who is an average bloke who talks about mundane things. Unfortunately it fails on almost all fronts. In fact, its the worst aspects of 3 different types of cinema. It's not particularly funny, it doesn't work as a 'documentary' because you learn nothing slightly interesting or fascinating about the characters nor do you gain any insight when you see them or him in action, and the acting is so unnatural that it comes across in some parts as a bad improvisation game, it doesn't work as a gangster film because the majority of the film is spent on dull conversation. This film is called the Magician because obviously like Shoesmith's dead bodies (which you never see but he does talk about) he makes things disappear, however a Hit Man knows how to hit his target, something this film certainly failed to do."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Blue-Tongue Films",
         "Cherub Pictures",
         "I Will Films Pty. Ltd."
      ],
      "summaries": ["A mockumentary that follows Ray Shoesmith, a Melbourne hitman who is simultaneously ruthless and caring, likeable and volatile. 'Filmed' by his media student neighbour for a university assignment, Ray is under contract to kill a low life of the Melbourne underworld when a more tempting offer is made..."],
      "budget": 0
   },
   "movielensId": 138892,
   "movielens": {
      "languages": [""],
      "releaseDate": "2005-06-18",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 85,
      "movieId": 138892,
      "title": "The Magician",
      "mpaa": "",
      "actors": [
         "Scott Ryan",
         "Ben Walker",
         "Massimiliano Andrighetto",
         "Kane Mason",
         "Nathaniel Lindsay",
         "Adam Ryan"
      ],
      "imdbMovieId": "0461989",
      "originalTitle": "The Magician",
      "genres": [
         "Comedy",
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Following the dealings of a Melbourne-based hitman Ray as seen through the eyes of his ex-neighbour and friend Max, an Italian film student. Max and his camera witness Ray's work life as it unfolds from day to day, giving an insight into a world we rarely see, and at the same time developing an unusual friendship with his subject.",
      "tmdbMovieId": 14096,
      "avgRating": 3.5,
      "releaseYear": "2005",
      "numRatings": 1,
      "posterPath": "/pRICa5CUsuoI5qXsrtJb9NuakGG.jpg"
   }
}