{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "animal horror",
         "id": 223059
      }],
      "imdb_id": "tt0108339",
      "video": false,
      "title": "Ticks",
      "recommendations": [
         45878,
         31263,
         36271,
         402516,
         40236,
         169644,
         34125,
         76450,
         430031,
         386123,
         80380,
         252281,
         87835,
         96648,
         177146,
         82315,
         90291,
         143901,
         28762,
         58797
      ],
      "backdrop_path": "/qcqAysZHR6S4fGgGEPzTj6SoC3f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Holly Lambert",
               "gender": 1,
               "credit_id": "52fe45539251416c9102e7a3",
               "name": "Rosalind Allen",
               "profile_path": "/ieIC7UyA4MTmE9WizyE8zvnBYJQ.jpg",
               "id": 102718,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dee Dee Davenport",
               "gender": 1,
               "credit_id": "52fe45539251416c9102e78b",
               "name": "Ami Dolenz",
               "profile_path": "/w1irpzUuR8CSOuy8V465zCXPP6m.jpg",
               "id": 41273,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tyler Burns",
               "gender": 2,
               "credit_id": "52fe45539251416c9102e78f",
               "name": "Seth Green",
               "profile_path": "/7ksgEtZZIhSkJmt7zMyVDOQfdxu.jpg",
               "id": 13922,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Charles Danson",
               "gender": 2,
               "credit_id": "52fe45539251416c9102e797",
               "name": "Peter Scolari",
               "profile_path": "/tLSgD0c7i2rpIS5kNfTysy6Sz0P.jpg",
               "id": 42363,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jarvis Tanner",
               "gender": 2,
               "credit_id": "52fe45539251416c9102e793",
               "name": "Clint Howard",
               "profile_path": "/d9QW5feIgNwDRdkKK1j7gmmOQXT.jpg",
               "id": 15661,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Melissa Danson",
               "gender": 1,
               "credit_id": "59d16bf9925141142f02c128",
               "name": "Virginya Keehne",
               "profile_path": null,
               "id": 1546547,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Darrel 'Panic' Lumley",
               "gender": 2,
               "credit_id": "52fe45539251416c9102e79f",
               "name": "Alfonso Ribeiro",
               "profile_path": "/7KwgJuTW68GbJqRxrmS8UGgjL8Q.jpg",
               "id": 169440,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Sheriff Parker",
               "gender": 2,
               "credit_id": "53832b24c3a36805a400821f",
               "name": "Rance Howard",
               "profile_path": "/i7tkpb7GLJXjwUNyrpOy63FiStt.jpg",
               "id": 22250,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Rome Hernandez",
               "gender": 0,
               "credit_id": "59d16c08c3a368786c029e53",
               "name": "Ray Oriel",
               "profile_path": null,
               "id": 192047,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "59d16c23925141143302bf59",
               "name": "Michael Medeiros",
               "profile_path": "/uTUSlzkYGjGA9GKjGHL2qYP5uUF.jpg",
               "id": 160849,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Sir",
               "gender": 2,
               "credit_id": "59d16c2cc3a36878c902a7c0",
               "name": "Barry Lynch",
               "profile_path": null,
               "id": 196358,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45539251416c9102e787",
               "name": "Tony Randel",
               "profile_path": "/4YUKLri68yTJdfMdqu8Qhok9cht.jpg",
               "id": 52194,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45539251416c9102e7a9",
               "name": "Brian Yuzna",
               "profile_path": "/71c5cOYzuDD8q0AZCNPFg7bcRP5.jpg",
               "id": 27992,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5835900ac3a3682f6c015528",
               "name": "Brent V. Friedman",
               "profile_path": null,
               "id": 96358,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58359037c3a3682f2a012a89",
               "name": "Steve Grass",
               "profile_path": null,
               "id": 1712992,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5835927b9251416c2e00fa0c",
               "name": "Leslie Rosenthal",
               "profile_path": null,
               "id": 1712995,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5835928bc3a3682f9d0167a0",
               "name": "Jack F. Murphy",
               "profile_path": "/etado8i7rV5Ab71jb8Jx40qzIHk.jpg",
               "id": 1147297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5835929e925141691b0165d7",
               "name": "Anton Tremblay",
               "profile_path": null,
               "id": 1712996,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "583592ad9251416a31016831",
               "name": "Kathryn Shemanek",
               "profile_path": null,
               "id": 1712997,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.384585,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34098,
      "vote_count": 44,
      "budget": 2000000,
      "overview": "Teens camping in a northern California retreat are terrorized by mutant insects created by evil, polluting pot farmers.",
      "similar": [
         578,
         9426,
         124905,
         332567,
         135397,
         929,
         244,
         4961,
         11237,
         9825,
         8869,
         9360,
         814,
         1678,
         13022,
         44037,
         9406,
         6488,
         3603,
         11071
      ],
      "original_title": "Ticks",
      "runtime": 85,
      "poster_path": "/eVYKvIylPIAIW5GOoERrxurb9RK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1993-10-12",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Something hungry is about to hatch.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tony Randel"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Brent V. Friedman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108339/",
      "coverLink": null,
      "actors": [
         "Rosalind Allen",
         "Ami Dolenz",
         "Seth Green"
      ],
      "reviews": [
         "If you are in the mood for a fun horror movie that doesn't take itself too seriously and has all the right gross out gimmicks- check it out. If it wasn't for a friend mentioning this movie title I would have passed it up. But I trusted his judgment since he is a horror aficionado- and I read some decent reviews in some of my old issues of Fangoria/Gore Zone. The acting is silly, but it is obvious that this is the way it was written. The key difference between a movie like Ticks (Infested) and some really bad Sci-Fi Channel movie is that everything is done in the Evil Dead 2/ Bad Taste slap stick kind of way. And they go for the gross out money shots in every other scene (lots of pulsating blistering skin waiting to explode, etc). And thank God this didn't have any of the cheesy computer animated gore and FX. I love the latex, goo, and prosthetic body parts of the old school- even if it does look fake. At least you know the actors are actually interacting with it rather then a \"green screen\". So, gather a few friends, kick back a few beers or Mountain Dews, and be prepared to rewind a few scenes so you can watch them again!",
         "This movie was pretty good, but the cast is classic! Seth Green, Ami Dolenz, and Alfonso Ribeiro. I bet Panic looks familiar, yeah that's because he's Carlton on Fresh Prince of Bel-Air. And the icing on the cake is Clint Howard. What an actor. He makes another great appearance in this film as a marahuana farmers. This movie is not too bad, but definitely entertaining. You'll love Ribeiro's character, especially since he is a hardcore inner city kid. This total contrast to Carlton make nearly everything he says a joke. If you're looking for a movie with a funny cast, check this movie out. What a sidetracker for a lot of these people's careers. Classic!",
         "I don't really understand the criticism about this film ; maybe if it had a 50 millions $ budget, everybody would find it \"cool\"? Tony Randel did his best and the movie still boasts good production value despite the numerous troubles they had on the set. This one's mean, politically incorrect (no \"back-to-the-nature\" crap) and without the shoddy humour and cute one-liners everybody seems obliged to include in his horror just because Freddy said so (c.f. \"Nightwatchers\"). I saw it three times with friends who enjoyed it as much as I did. And I don't care if some of the actors ended up in some moronic TV fodder for brainwashed teenagers. Not a great movie (unlike Brian Yuzna's \"Return of the living dead 3\"), but strong, however.",
         "I know that a lot of people are highly critical of this movie, because most of the plot is lacking and the acting is not impressive, but I still greatly enjoy this movie. Don't get me wrong, it is a \"B\" movie, but the superb direction and special effects more than make up for the lame plot. Seth Green is the main character and upon viewing this movie the first time about three years ago, I realized that he could actually act and now everyone is picking up this movie because of name recognition. That's fine by me, but to the Seth Green fans out there, he plays a total geek in this movie. Seth Green may be the main character but this movie is tailored to the die hard \"B\" movie fan, with Clint Howard and Ami Dolenz doing their usual bits and Peter Scolari (The other \"Bosom Buddy\") doing his best not to laugh as he delivers his lines. Oh yeah, the guy from \"The Fresh Prince of Bel Air\" is in this too, and I believe he and Howard did some of their best acting in this film. Unfortunately, Dolenz is wasted, as her character is never even remotely close to effecting the plot. She's there as something to look at and for the posters and box covers. Roselind Allen also goes through the motions and is also wasted in her role. Like I said at the start, this is a special effects and directorial masterpiece, but cheesy dialogue, a weak plot and limited acting ability hurt this film. Still if you're into effects, this movie is better than most, especially considering the perceived lack of a budget.",
         "Let's see...spiders, ants, piranha's, rabbits, bees...No, we didn't have giant murdering ticks yet. BRING 'EM ON !!! Maybe that's a bit rough, but in fact it's the basic idea behind this movie. The story is as old as horror itself but it still works and, more importantly, it's still fun ! Somewhere in a God-forsaken town, the local farmers found a new spray for their crops ( their crops are marijuana in this case. That's new! ) but of course the bugs start to grow to enormous size as well and begin to attack humans! A group of troubled teenagers who're there for some sort of consciousness-weekend become the main target. OK, Ticks is filled with the obvious \"monster-clichés\" but it's a well made and highly entertaining B-movie. I confess, director Tony Randall can't do much wrong in my eyes. This man made the very good Hellraiser sequel Hellbound, so I'm interested in all other films he made. Ticks also has a few familiar faces. Clint Howard to begin with. This guy is doomed again to play the weird loner who becomes the first victim of the killer bugs. Seth Green had one of his first major film roles in this film as well. He looks pretty dorky here, but it sure didn't stop him from building up a decent career in Hollywood. Alfonso Ribeiro is also a part of the cast but it's pretty laughable to picture him as a \"bad-ass\" from the ghetto, when you keep in mind he played Carlton in The Fresh Prince of Bel-Air for so many years. I didn't recognize the rest of the cast, but all the girls have sweet faces. Unfortunately, Ticks goes very much over the top near the end. But by then you already forgave Tony Randall and the rest of the crew for that stupid ending. Bad case of Writer's Block, I guess...",
         "Here's a delightfully fast-paced film from the director who brought us such pleasantries as 'Hellbound: Hellraiser II'. Originally and appropriately titled, 'Infested' is an icky, gooey good time as an experimental bi-product of a marijuana growing process accidentally infects tick eggs and caused the deadly little buggers to grow into abnormal sizes (approximately that of sea-crabs). Meanwhile, The L.A. city Wilderness retreat, a program designed to help troubled teenagers adapt to new environments, is plummeted directly into the infestation. This is a rip-roaring homage to the classic \"nature runs amok\" genre, and a talented, young cast and good direction make it all work. These nasty, killer critters are fast and furious and burrow under the skin just as this flick will for it's audience as a cast of likable (and unsavory) characters must use their wits to survive in a really horrifying situation. This has above-average creature effects combined with some nice touches. (the ticks' venom causes hallucinations in their victims to add to the mayhem!). The band of youths and their adult supervision must barricade themselves into a cabin along with a couple of despicable cash-croppers, and it all lunges towards an unforgettable climax where Alfonso Ribeiro (of 'Fresh Prince of Bel-Air fame') projects one humongous insect from his writhing corpse in a spectacular showdown. Other good genre performances include Seth Green as a resourceful juvenile and Clint Howard as a wacky pot-farmer. It's a perfect example of how imaginative plot devices and suspenseful set-ups used in the right brew can make for a fun, comedic horror film.",
         "A marijuana growing farmer played with devilish glee by a horror vet Clint Howard is using herbal steroids to increase his marijuana output.Some of the steroidal juice however manages to infest a tick larva and soon all the ticks are growing bigger and bigger,nastier and nastier.Enter a group of troubled teens led by Rosalind Allen and Peter Scolari who are off for a camping adventure right near the infested area.Soon the ticks are running around chomping on everyone.\"Ticks\" by Tony Randel is an above average animal attack flick with some disgustingly good special effects.The plot,whilst being silly and predictable,mainly consists blood,slime and all-out grossness,so I was pleased.So if you want cheesy gorefest you can't go wrong with \"Infested\".",
         "While I was watchng this movie I couldn't help but think that while Peter Scolari was filming this \"Friday the 13th meets Arachnaphobia\" low budget horror, his \"Bosom Buddies\" co-star, Tom Hanks, was off earning an oscar for Forrest Gump. Don't get me wrong...I like Peter Scolari; he just seems so out of place in this movie. That aside, if you're a fan of this genre, especially of the straight-to-video variety, you won't want to miss this one. It has everything for you: two-dimensional characters, gore, bad dialogue, gore, cheesy special effects, no plot or storyline what-so-ever, and, oh yeah, I almost forgot...gore. My only real complaint is that there is little to no camp. It's those moments of overdone camera work and melodramatic line delivery that make these \"B-movie\" romps real gems to have in one's video collection. The closest we get to any kind of decent camp is in the characters of Sir and his sidekick henchman, Jerry. Only these two offer us that overly theatrical style of acting that has the viewer thinking, \"they've got to be geniuses!\" You will also want to check this one out if you're a fan of Seth Green. Much of the action centers around him as he has quite a bit of screen time. A very talented actor, Seth is the only cast member that actually attempts to flesh out his character and add some dimension to the role. Unforunately, this venue won't allow him to do that. It is also fun to watch Seth not take the whole thing too seriously. Watch him carefully in the vet's office during the autopsy scene\u0096he's actually trying to hold back some laughter! All of this put together does make Ticks a worth while 85 minutes to spend watching it.",
         "The English video cover makes this look like some 'Alien' clone, but instead it turns out to one of those irritating man-tampers-with-nature half-baked horror films. A group of inner-city delinquents are taken out to the woods on a survival holiday. They find themselves attacked by blood-thirsty ticks which have grown to the size of large spiders as a result of steroids used on the local marijuana crop. Needless to say the film is derivative garbage, with no attempt to haul itself onto the lowest rung of the ladder. The cast seem to have a degree of ability but the script and storyline give them absolutely nothing to work with, and things stumble along to the inevitable conclusion as most of them escape BUT what is clinging to the underside of their van ?? This may have worked better with some 'Tremors'-like humour - the horror elements are too weak because of the one-dimensional characters; this is a film where you really do not care about anyone and the whole experience is like watching a cartoon. As such it is watchable to a degree, but leaves not the slightest lasting impression. If the horror genre continues churning out this kind of formulaic drivel for the empty-headed teenager heaven help us. I was rooting for the Ticks all the way.",
         "Infested, also known as Ticks, starts in a illegal marijuana growers hideout where a barrel of steroids, that is used to enhance the growth of their crop, begins to leak onto a tick pod which starts to pulsate... Jump to Los Angeles where Holly Lambert (Rosalind Allen) runs the 'Wilderness Project' which helps troubled teens by taking them on a trip to the great outdoors. Along with her partner Charles Danson (Peter Scolari) & his teenage daughter Melissa (Virginya Keehne) they pick up a traumatised boy named Tyler Burns (Seth Green), an idiot with an attitude Darrel Lumley (Alfonso Ribeiro), a couple of lovers Dee Dee Davenport (Ami Dolenz) & Rome Hernandez (Ray Oriel) plus a young rape victim Kelly Mishimoto (Dina Dayrit) & set off for the isolation of the woods. Meanwhile the tick pods have hatched & mutant ticks are running around all over the place laying more & more pods everywhere. Once the dysfunctional van load of teens arrive it's not long before they are menaced by the flesh eating, blood drinking ticks that infest the woods & their cabin... Directed by Tony Randel I must confess that I was somewhat disappointed by Infested, I thought it was OK nothing more. The script by Brent V. Friedman just wasn't what I was hoping for or expecting after hearing reasonably good things about it. Nothing really holds the film together, the clichéd teenage character's become very irritating after a while, the ticks barely interact with humans until the last twenty odd minutes & the first hour of Infested feels like a pre credits sequence stretched out. The contamination of the ticks which make them grow & then after they just sort of 'hover' in the background for what seems like ages, they never really do anything or cause anything significant to take place. Finally they just spring from nowhere & attack everyone during the climax, it feels odd & I got bored waiting for Infested to come to life. I mean you have this potentially great story, cool slimy giant blood drinking ticks, annoying character's who the audience want to die in the goriest way possible & the obligatory isolated location but Infested fails to take advantage of any of these things. Instead it would rather have lots of dialogue, no deaths, an unnecessary sub plot about drug growers & not much else. There is also a flashback scene of which nothing ever becomes of. Having said all that Infested is OK I suppose, it moves along at a fair pace & is watchable, if ultimately disappointing. Director Randel doesn't do anything to liven the film up, it's competently made but it has no real style or flair to it. The ticks themselves are OK, they are just puppets covered in slime, although I have no idea where the giant monster one comes from at the end. The gore is very sparse, there are plenty of slimy tick pods & the little critters running around but they only kill one teenager throughout the entire film, just one. They also kill three drug growers as well but when three of the four deaths happen within the last fifteen minutes you can probably understand why Infested becomes frustrating to watch. I mean I'm not watching a film about mutant killer ticks for the high drama, the emotionally driven wonderfully realised dialogue or the superb Oscar worthy acting am I? No I ain't, I want to see the mutant killer ticks do what mutant killer ticks do best, kill annoying teenagers. Technically Infested is alright even though it was made-for-video which is never a good sign, it's generally well made but nothing stands out as being particularly brilliant. Some of the special effects are fairly impressive while others are far from impressive. The gore is tame, someone's face & body splits open & a huge tick crawls out plus someone's leg is caught in a bear trap & there are a few splashes of blood here & there but that's it. I want my money & 85 minutes of my life back. The acting doesn't impress particularly. Infested is a clichéd, predictable, disappointing & frustrating film throughout. It could have been so much more. Average at best & only worth a watch if there's absolutely nothing else on or if you can get hold of a copy cheap, very cheap that is.",
         "...and this is a average one with a few real great scenes.The typical \"at camp\" when things go buggy story line that we are all comfortable with. Above average humour and effects makes this one worth watching,only the first fifteen miniutes were slow.",
         "One thing is for sure: Ron Howard must be ashamed of his brother after watching this film. Clint has a memorable role as a forrest bum that meets his demise from the Ticks. Peter Scolari must have needed the money to make a car note or something. And yes, the kid from \"Fresh Prince of Bel Air\" is in this one as a supposed tough kid from the Bronx or something, but comes across as a throwback from the mid-eighties breakdancing films. If you decide to watch this film, do it in the form of the \"MST3K\" guys and enjoy yourself!",
         "Insects make good horror movie material due to the fact that a lot of people are scared of them. There have been movies about giant spiders (Kingdom of the Spiders), scorpions (The Black Scorpion) and ants (Them!), and while ticks aren't exactly the most exciting insects around; their bloodsucking nature does make them a good subject for a film such as this. As you might expect considering the fact that this film was a direct to video release, most things about it aren't exactly brilliant. However, it's obvious that the most important thing about a film like this is the gore and Ticks certainly isn't lacking in that department! The story is obviously just a means to an end and sees a class of delinquents going out into the forest for some sort of moral building exercise. However, their little trip is interrupted by a bunch of bloodthirsty ticks that have grown to massive sizes because of chemicals put on weed plants to accelerate their growth. Unfortunately for the kids, the ticks' appetites have grown with them; and now they are on the menu... The film has a good basis for gore, as it's directed by Hellraiser 2 director Tony Randel (who also directed the less than impressive Children of the Night) and the executive producer is one Brian Yuzna, who every gore fan should recognise. The plot doesn't contain a lot of surprises, although it deserves some plaudits for staying interesting for most of the way through. The story progresses in the usual way for this sort of film - i.e. there are a few clues that something bad is going to happen, then bad things do happen and eventually everything gets out of control. The film doesn't pay a lot of respect to it's insect star as there aren't many references to real life ticks, but then again I didn't go into this movie expecting a natural history lesson. The cast is only notable for the fact that it stars a young Seth Green, although he really isn't that much of a highlight. Alfonso Ribeiro, who is more famous for playing Carlos in The Fresh Prince of Bel Air, also makes an appearance (which is completely unlike his TV persona) though he is underused. The film ends well, though too many people survived for my liking, but all the same this is good fun and recommended.",
         "Ticks is another entry in what seems to be an ongoing competition between B-grade film-makers to produce movies featuring the most harmless and innocuous of creatures turned into monsters- frequently made gigantic or at least larger than they normally are. Killer Ticks aren't the most ridiculous menace ever created in one of these movies as anyone has seen Night of the Lepus (killer bunny rabbits) or various 50's B-movies will attest but they certainly aren't convincingly threatening enough to be the monster in any movie. That is the main problems with Ticks, which is basically a serviceable B-movie. The Ticks are certainly icky little creatures which have gross-out value which is used to good effect here and the prospect of having one of them attached to you and sucking your blood is not a pleasant thought. The SFX used to portray the Ticks are actually pretty good and they are suitably gross little critters, a case of practical special effect doing a better job than CGI ever could and the gory scenes of them burrowing into the flesh of their victims are quite well rendered. My favourite scene was that of a Tick with a syringe stuck into it skittering across the floor, complete with the silly movie skittering sound. However, the Ticks could only be seen as a real threat in the most contrived of circumstances, which the movie does it's best to provide, via an area selective forest fire toward the end of the movie and are certainly not enough of a threat to pad out a 90 minute movie. It is clear the makers realised this and added in other elements such as the some human bad guys, in this case some gun wielding dope growers to generate some more conflict and danger (Not to mention running time) into the proceedings. None of this is particularly interesting nor is the clichéd character interaction between our group of main characters, some troubled teens from LA out in the woods with their counsellors on some kind of bonding. get back to nature program (The details are never made clear). The characters are barely sketched in and their interactions and conflicts are painfully hackneyed e.g. the teenage daughter of the lead counsellor who resents her father for dragging her along on these excursions and hates her step-mother. We don't even get a lot of detail about what the problems of these trouble teens are, in some cases none at all. The acting is pretty average and you get the impression that nobody is trying too hard. Despite this there is some fun to be had. The Ticks are actually pretty cool little creatures even if they aren't a believable threat and there is enough blood and goo around to liven things up between the bad character stuff. There are some really bizarre plot twists which succeed in making the movie more entertaining, such as the contrived circumstances in which the forest fire is started and the uber-ridiculous way in which an even bigger monster tick is created in the movies climax. I didn't know steroids could do that. I also liked the fact that the ticks became the way they were not because of government experiments or evil big companies dumping waste but because of weird growth agents being used by the Marihuana growers. It doesn't make much more sense but it is at least one lame cliché avoided. Then again it still has time for the lame clichéd kicker ending. I also got some entrainment from seeing a young Seth Green on screen, before he developed much personality and Alfonso Ribiero AKA Carlton Banks from the Fresh Prince of Bel Air. Anyone familiar with the character he is on the show will find his performance as the tough guy from the streets here most amusing.",
         "Being an outdoor instructor I have had my fair share of ticks. The thing is, I have been constantly amazed by the number of people who don't even know what they are. So if you don't know, here it is. They are little insects, about 2mm in size. As you walk through the hills or woods of Britain, they jump on to you from passing foliage and crawl up your leg / body. Then they try to find the darkest, warmest and juiciest part of your body (hmm..yep, somewhere around THERE), bury there heads inside you and drink your blood for a few days, before dropping off and finding another food source. If you ask anyone who spends a lot of time in the outdoors, it won't be long before you find someone who has a tick story about a disturbing place they have found one (or more ..). I have mine, but that's another story. So anyway, the movie. Well, for starters, I feel that this show is somewhat stolen by the rather entertaining character 'Panic' (because he never panics apparently). He seems to be trying to be a bad-ass Gangster come eighties break-dancer throwback. Now this guy swears, threatens to kill geeky kids, plays basket ball on wasteland, has violent outbursts, throw axes and wears a trench coat and shades (some of the time). All in all, he sounds like a bit of a hard nut. that is until he spends half the movie wearing pyjamas, and no matter how much effort (and believe me, he puts in too much effort) he puts into his role, he will always be Carlton from the 'Fresh Price of Bel Air'. hmm. The ticks themselves actually look like ticks. Except for the fact they are the size of your hand. But a movie about 2mm insects that suck blood out of your genitals wouldn't be that great a plot, and probably quite hard to sell to the movie companies. For a crap movie, though, the effects are pretty good. In fact, this movie is a little bit too good to be considered a real bad movie. But it's just too bad to be considered a good movie. Its one of those movies that float in the zone of watchable trash. Which is a shame. It had so much potential to be terrible. In Conclusion Worth a watch just to see Carlton in the final scene, and for the quote \"I'm infested!!\"",
         "Maybe when most people watch this film they don't understand that you aren't meant to sit there gripping the edge of your seat and shrieking with terror because, frankly, if you think that you're going to be disappointed. 'Ticks' has something that most horror movies have forgotten - we actually want to enjoy watching movies, not just be grossed out by ridiculous amounts of blood and guts. This movie is a hilarious take on horror films, with all the corny elements that viewers expect. It's aided by a brilliant performance on the part of Seth Green that really keeps the movie rolling. Ticks does fall down a little when the giant tick bursts out of Panic, but you can forgive a movie anything when it makes you laugh for 90% of the time. This is well worth a watch if you can get hold of it - up there near Idle Hands as a classic horror spoof. 8/10",
         "If you are a fan of cheesy horror flicks, then this movie is for you! This falls on the shelves with films like Sleep Away Camp, Pandemonium (1982), and Friday the 13th Part III. This is definately worth $2 to rent on a night when you feel like watching something fun, gross, and strangely entertaining. (-:",
         "The ONLY reason I rented this waste of videotape was because I wanted to see what Richard Lynch's (of Invasion USA and The Seven Ups) brother looked like! I payed two dollars and got my money's worth as Barry Lynch had a few good scenes. The script is banal, effects cheesy, but GROSS, the lighting was terrible too. The acting seemed okay, what I saw of it anyway, I ended up fast-forwarding to Barry's scenes! It's interesting to see Seth Green pre-Austin Powers and \"Carlton\" as a street tough (suppressing laughter here), but what were the Howard's thinking doing this? Can't Ron get them something better? Anyway, like I said, I wanted to see what Barry looked like and if he had any of his brother's immense talent. Makes one wonder if he went to acting school like Richard did. If not, it shows. Don't get me wrong, he was okay in his role of Sir, but not as polished as Richard is in the movies he does. The person I really feel sorry for is Peter Scolari, he's more talented than Tom Hanks IMHO, so why can't he get better roles in better movies? Ah well, I only paid two dollars!!",
         "I know this is a low budget horror film, but I liked it anyway. Not a lot of gore by today's standards, but the make-up and special effects were good. It was also enjoyable to look at Ami Dolenz, and to watch the bad guys get \"ticked\". Two thumbs up!",
         "They didn't really put a lot of thought into this movie. It has so much going for it- First off, the great Clint Howard grows dope that creates big ticks that explode when stepped on. Later we get to see Carlton from \"The Fresh Prince of Bel Air\" getting attacked by said ticks. There's a dog that gets turned into pulp and a creepy hick who looks like an inbred Bruce Springsteen. The cast features the scrumptious Ami Dolenz (wasted in a supporting role), a young Seth Green (showing none of the charm he would later in 'Austin Powers'), Rance Howard (Why wasn't Ron in this too?), and Peter Scolari, who should've had Tom Hanks' career. But despite all this, this movie is really lame. It's slow, it looks crappy, and everything is confusing. Characters are just barely sketched out, which is okay for a horror movie, but then they don't kill any of them! Hardly anyone dies in this stinkfest! The make-up and Tick effects look pretty good, but the whole thing is edited so poorly you never get a good sense of what scenes are about. And I might be going out on a limb here, but Carlton was NOT convincing as a street smart tough. \"I thought I would get it in a drive-by shooting- but my dog would be all right!\"",
         "Now remember guys this movie was made 21 years ago and I'm reviewing this in 2015. I believe the golden age for b-grade low budget creature movies have gone. Now all we are left with are a few gems like this one - 'Ticks'. Take it from the title which is a lot better than 'Spiders' or 'Big ass spider'. Low budget creature films nowadays have ruined the subject matter with muddled script, horrible acting and those cheap cgi effects. Filmmakers nowadays are not even making an effort to come up with at least a decent watch, which is why I urge viewers to stop investing time watching those movies. DO NOT go by the poster, go by the ratings/reviews, not all are fools. Take their advice and give old gems a try. Ticks being entertaining with a simple script and decent act has had me quiet impressed. Forget the cgi effects, doing it the old way has proved to be better than most. Filmmakers today should sit at home and study this movie before they step out to make movies not even worth rating. Thank You!",
         "This movie has some kids going on a retreat or something (been awhile since I have seen it). During their trip they run into these pot growers who don't want them there. In the place where they are growing pot somehow or another the ticks start to grow big and go on the rampage. Nothing to special in this one, but it is far from a boring and terrible movie. It moves pretty fast and there are some good kills in this one. There is also a rather cool scene where this one kid splits open. The ticks aren't to bad looking, and I don't think they were computer animated. The ending is the same old trick as in other horror movies and nothing to surprising. Though can anyone tell me why the one kid felt the need to take all those steroids when he was walking through the woods hurt? I don't believe they would have any positive impact that would help him.",
         "Not going to waste a lot of time on this one. Stay away. There is not one good thing I can say about this bad piece of work. The acting sucked, the effects sucked, and the ticks sucked (no pun intended). I keep asking myself, why they keep making movies this horrible. Why? What a tremendous waste of money and people's time. For God's sake, they could use their time more wisely by putting on orange vests and picking up trash along the I-10. PLEASE!!!!!",
         "Not yuk for the ticks--yuk for the movie. It's just about as lousy as you would expect a movie about killer ticks to be. Pretty much everything in this picture is 12th-rate, except for two things: the photography (which looks very good) and Rosalind Allen (who looks even better). Allen is just so stunningly beautiful, and is a good enough actress, that you wonder why she keeps getting herself trapped in low-budget junk like this when she can do, and has done, much better. She has the class, attitude and bearing of a Grace Kelly, which makes this cheap movie look even cheaper. If you're a Rosalind Allen fan, check it out. If you're not, then there is no reason on earth why you should come anywhere near this movie.",
         "If it wasn't for Seth Green this movie wouldn't have been worth the space it took to advertise it in the paper. It was one of those USA Network Bad Days at the Movies and I can see why, only Critter's was worse than this movie. I will be willing to bet that Seth will not list this film on his resume."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "First Look Pictures",
         "Republic Pictures (II)"
      ],
      "summaries": [
         "Problem teens in Los Angeles join an inner-city wilderness project in and attempt to get back in touch with life's priorities, led by do-gooders Holly and Charles. When they get to the campsite, they begin having problems adjusting to the wild life, particularly local marijuana growers using herbal steroids to accelerate plant growth, and the mutated ticks that the leaky steroid system has created.",
         "A group of troubled teenagers are led by social workers on a California wilderness retreat, not knowing that the woods they are camping in have become infested by mutated, blood-sucking ticks."
      ],
      "budget": 2000000
   },
   "movielensId": 138916,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-12",
      "dvdReleaseDate": null,
      "directors": ["Tony Randel"],
      "runtime": 85,
      "movieId": 138916,
      "title": "Ticks",
      "mpaa": "",
      "actors": [
         "Rosalind Allen",
         "Ami Dolenz",
         "Seth Green",
         "Peter Scolari",
         "Clint Howard",
         "Virginya Keehne",
         "Alfonso Ribeiro",
         "Rance Howard",
         "Ray Oriel",
         "Michael Medeiros",
         "Barry Lynch"
      ],
      "imdbMovieId": "0108339",
      "originalTitle": "Ticks",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Teens camping in a northern California retreat are terrorized by mutant insects created by evil, polluting pot farmers.",
      "tmdbMovieId": 34098,
      "avgRating": 2.875,
      "releaseYear": "1993",
      "numRatings": 8,
      "posterPath": "/eVYKvIylPIAIW5GOoERrxurb9RK.jpg"
   }
}