{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114618",
      "video": false,
      "title": "Target",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4ab0c3a368484e161d3d",
            "name": "Sandip Ray",
            "profile_path": null,
            "id": 1080311,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.001649,
      "production_countries": [],
      "id": 124639,
      "vote_count": 0,
      "budget": 0,
      "overview": "A subtle yet violent commentary on feudal lords.",
      "similar": [],
      "original_title": "Target",
      "runtime": 122,
      "poster_path": "/z0ezqAFMeGYd5mLEWaN8jC9eczF.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-08-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sandip Ray"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Sandip Ray",
         "Satyajit Ray"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0114618/",
      "coverLink": null,
      "actors": ["Stars: Mohan Agashe, Barun Chakraborty, Champa | See full cast and crew »"],
      "reviews": ["Target is unlike any Indian movie that you could possibly see, in that it is the only Indian flick where the protagonist with his speed and skill attempts a coup De grace..in a fashion that is more suitable and common in a western. And that comes as a shock against a slow \" art house\"- paced detailing ..thats more Ray than anything else. Believe me you would least expect Om Puri to do what he does in the end. The story is simple. In a sleepy and impoverished village Mohan Agashe the Zamindar rules unchallenged in a time that can be described as a transitory phase in Indian feudal history..a time when the Zamindari was first being questioned all across rural India. At such a time it was important that these Zamindars reassert their hold on their fiefdoms..and Mohan Agashe is one such zamindar.He suddenly realizes that his hunting skills don't inspire people around him any more,,,and they have started seeing him as an ageing old zamindar. ..so to prove his manhood and also to let the wretches know that he is still the boss..he hires om. Om's interview is an interesting scene when he hesitates to use his only bullet left, for a demonstration. But when coaxed he shifts ungainly and quite as a mater of fact gets the target in one go. Somewhat interesting on account of his body language that reflects the socio economic origin. The highlight of the movie is a final show down between cocky agashe and a wounded om..with one hand in plaster om loads , aims and shoots all in one motion..even before agashe could go for his rifle..a nice shiny modern double barrel as against a rusty well used om's single bar-ell. Sandip Ray has done a good job in making a, throughly alien theme like a gun drawing competition look all so natural in a subcontinental setting...Its more like Django comes to India..with a story line that the left could be proud of. All in all its entertaining scene for scene..Oh..but om accent of the dialect for the trained ear is not so convincing"],
      "genres": ["Drama"],
      "productionCompanies": ["Creative Entertainment Group"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 139,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-08-01",
      "dvdReleaseDate": null,
      "directors": ["Sandip Ray"],
      "runtime": 122,
      "movieId": 139,
      "title": "Target",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0114618",
      "originalTitle": "Target",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A subtle yet violent commentary on feudal lords.",
      "tmdbMovieId": 124639,
      "avgRating": 3.10417,
      "releaseYear": "1995",
      "numRatings": 48,
      "posterPath": "/z0ezqAFMeGYd5mLEWaN8jC9eczF.jpg"
   }
}