{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "colorado",
            "id": 1981
         },
         {
            "name": "fireworks",
            "id": 2407
         },
         {
            "name": "baseball bat",
            "id": 3605
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "cell phone",
            "id": 15156
         },
         {
            "name": "skateboard",
            "id": 33355
         },
         {
            "name": "fourth of july",
            "id": 159743
         },
         {
            "name": "suicide note",
            "id": 160035
         },
         {
            "name": "blow torch",
            "id": 162065
         },
         {
            "name": "rock concert",
            "id": 162066
         },
         {
            "name": "female singer",
            "id": 162078
         },
         {
            "name": "garbage dumpster",
            "id": 162079
         },
         {
            "name": "crutch",
            "id": 165171
         }
      ],
      "imdb_id": "tt0469111",
      "video": false,
      "title": "I'll Always Know What You Did Last Summer",
      "recommendations": [
         3600,
         10292,
         12212,
         3597,
         8997,
         7182,
         28739,
         23823,
         14913,
         11442,
         13186,
         10285,
         39862,
         71672,
         22007,
         32304,
         252189,
         26688,
         17038,
         29293
      ],
      "backdrop_path": "/e1pufGS4ly5Wb02WfJnckD22Zfh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Amber Williams",
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062fc5",
               "name": "Brooke Nevin",
               "profile_path": "/hUEokOUnjl6UnLSi4Fo8HUFXXwM.jpg",
               "id": 33292,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Colby Patterson",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fc9",
               "name": "David Paetkau",
               "profile_path": "/cJvE4rjqiBK53YdVJKRuWBp1y6O.jpg",
               "id": 33293,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Deputy Hafner",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fcd",
               "name": "K.C. Clyde",
               "profile_path": "/frp5cAHlYOFNpv7DS1spCrmxNyQ.jpg",
               "id": 33294,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Roger",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fd1",
               "name": "Seth Packard",
               "profile_path": null,
               "id": 33295,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062fd5",
               "name": "Torrey DeVitto",
               "profile_path": "/fXxgnqtygQXE9OQvNvqFCGWYJNI.jpg",
               "id": 33296,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lance",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fd9",
               "name": "Ben Easter",
               "profile_path": null,
               "id": 33297,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "P.J.",
               "gender": 0,
               "credit_id": "52fe43a0c3a36847f8062fdd",
               "name": "Clayton Taylor",
               "profile_path": null,
               "id": 33298,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Sheriff Davis",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fe1",
               "name": "Michael Flynn",
               "profile_path": "/46QxGvHhnyAl803ioYA3wtxUHcW.jpg",
               "id": 7144,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "The Fisherman",
               "gender": 0,
               "credit_id": "52fe43a0c3a36847f8062fe5",
               "name": "Don Shanks",
               "profile_path": "/tUUwp616WfWiDTMoZZ5h2A2PD4c.jpg",
               "id": 33299,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062f85",
               "name": "Sylvain White",
               "profile_path": "/99sxzF0USzoEkJFmcgX42p0hNWe.jpg",
               "id": 31119,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062f8b",
               "name": "Lois Duncan",
               "profile_path": null,
               "id": 33255,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062f91",
               "name": "Michael D. Weiss",
               "profile_path": null,
               "id": 33287,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062f97",
               "name": "Neal H. Moritz",
               "profile_path": "/cNcsEYmoS4niCz3UkVAA09dUIob.jpg",
               "id": 11874,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062f9d",
               "name": "Nancy Kirhoffer",
               "profile_path": null,
               "id": 33288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fa3",
               "name": "Erik Feig",
               "profile_path": null,
               "id": 11697,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062faf",
               "name": "Justin Caine Burnett",
               "profile_path": null,
               "id": 33290,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fb5",
               "name": "Stephen M. Katz",
               "profile_path": null,
               "id": 7183,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a0c3a36847f8062fbb",
               "name": "Shawn Dawson",
               "profile_path": null,
               "id": 33291,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062fc1",
               "name": "David Checel",
               "profile_path": null,
               "id": 31127,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56785019925141118c000358",
               "name": "Amanda Lewis",
               "profile_path": null,
               "id": 57029,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53465d310e0a265ff8001162",
               "name": "Judi McKee",
               "profile_path": null,
               "id": 1308581,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "53465d4c0e0a265fef001115",
               "name": "Amy J. Roberts",
               "profile_path": null,
               "id": 63103,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 11.013821,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3602,
      "vote_count": 104,
      "budget": 0,
      "overview": "Several teenagers in a small-town in Colorado concoct a July 4th prank based on a frightening legend that goes awry when their friend ends up accidentally killed; however, the teens agree to keep their involvement a secret from the authorities, who continue to search for the man who apparently killed their friend. A year later, with the July 4th celebration coming up again, the teenagers realize that they're being stalked by someone who clearly intends on keeping the horrible legend alive by killing them off.",
      "similar": [
         9373,
         10781,
         168098,
         341006,
         321258,
         300665,
         10285,
         948,
         238636,
         201085,
         381288,
         452507,
         298312,
         10585,
         588,
         3600,
         26466,
         765,
         663,
         56906
      ],
      "original_title": "I'll Always Know What You Did Last Summer",
      "runtime": 92,
      "poster_path": "/hYMAHn28MCkgbTBQom3UmvzUYhN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/bz6GbCQQXGNE56LTW9dwgksW0Iw.png",
         "name": "Screen Gems",
         "id": 3287,
         "origin_country": "US"
      }],
      "release_date": "2006-06-24",
      "vote_average": 3.9,
      "belongs_to_collection": {
         "backdrop_path": "/g7RBq92ijQg1MAF2hF69rWT6Ux8.jpg",
         "name": "I Know What You Did Last Summer Collection",
         "id": 3601,
         "poster_path": "/2g6Ui3CCNcDtL4wasCziivogpfW.jpg"
      },
      "tagline": "What he knows might kill you…",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sylvain White"],
      "runtime": 92,
      "synopsis": "In a small Colorado town, Amber Williams (Brooke Nevin), her friends Zoe (Torrey DeVitto) and Roger (Seth Packard), and her boyfriend Colby Patterson (David Paetkau) stage a prank at the town carnival, with Roger faking the return of the \"Fisherman\" killer. However, their friend P.J. Davis (Clay Taylor) is accidentally killed during the stunt, and to cover up what happened they burn the evidence and make a pact that the secret will die with them. One year passes after the group separates, and Amber returns to town to discover that Colby never left to pursue his college scholarship. She leaves the party angry, and goes up to the mountains where she encounters one of the officers who witnessed the accident, Deputy Haffner (K.C. Clyde). Later that night, Amber awakens to a sound, and receives 50 text messages reading \"I know what you did last summer\". She drives to Zoe's shack to find her band rehearsing for a concert, and after Amber apologizes for not contacting her, Zoe allows her to sleep there for the night. The next day they find Roger fixing ski-lifts gondolas; he angrily sends them away when they inform him someone knows what happened. Zoe goes to find Colby working as a lifeguard at a public pool; he dismisses her then returns to his post to find \"I know what you did last summer\" written in the ground. Amber is attacked on a ski-lift by someone wielding the hook, but Colby doesn't believe her. Later that night, a drunken Roger contemplates suicide while pulling out the hook from the prank, which he had salvaged from the fire. He investigates a noise when he is attacked by the Fisherman, who slits his throat after a chase. Colby goes to Lance and Zoe telling them that he believes them, so they go to warn Roger again but find him dead along with a suicide note and the hook. Deputy Haffner strangely shows up wielding his gun at them, accusing them of the murder, until he reads the suicide note. After their statements, they return to Amber's house to find pictures of them from the high school yearbook sliced up and stuck to the wall reading \"SOON\". They all stay at Zoe's place again and find Lance (Ben Easter) outside, who shows them a message engraved on his motorbike, and they agree to stay together for safety. Colby goes to the pool to do some laps after his shift, and is hooked in the ankle by the Fisherman, who disappears. The night of Zoe's concert, Amber and Lance stick together while Colby, who is now on crutches, sneaks off to get drunk. The Fisherman swings his hook at Colby but misses; Colby grabs a large butcher knife and stabs the Fisherman in the back, but he appears to be completely unharmed. The Fisherman eventually breaks through a window and hooks Colby in the mouth. Amber and Lance go back to congratulate Zoe but are attacked. Zoe breaks away and is stabbed in the stomach and then thrown over a balcony. As Amber and Lance make their way up to the balcony to find Zoe's corpse, P.J's father, the sheriff, comes in and finds Amber covered in blood. He assumes they committed the murders, but he gets pulled into the darkness and hooked to death. Outside, Deputy Haffner arrests Amber and Lance and escorts them to the back of his jeep; in the back lies Zoe's body. The Fisherman appears and makes his way towards Haffner, who fires several times, but the Fisherman doesn't budge and impales Haffner on a forklift. Amber and Lance get into the car and run the Fisherman down, but he immediately gets up and takes his mask off, revealing the decomposed face of Ben Willis, the undead man who brutally committed the original murders 10 years ago. He then immediately disappears into thin air. Amber and Lance go to get help but are again attacked by Willis and are chased into a warehouse. They make it out and lure Willis into a thresher, which appears to kill him. A year later, Amber is driving across the desert, talking to Lance as a tire blows out. She stops in the middle of nowhere and waits while she talks to Lance. She stands in the middle of the road, and looses reception. Which ultimately interupts her conversation with Lance; Amber then begins looking around as the camera cycles around her, a flash of Ben Willis is seen behind Amber, and then the film cuts to black as Amber's scream is cut off by the sling of the hook.",
      "writers": [
         "Lois Duncan",
         "Michael D. Weiss"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0469111/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODVlMDViZTgtMTUxNi00ZTcyLWJkZDAtZDI3NjQ0M2JjM2U3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Brooke Nevin",
         "David Paetkau",
         "Torrey DeVitto"
      ],
      "reviews": [
         "Apparently it can. I don't know why I decided to watch this movie, I think it was out of curiosity. I thought the first one was average, the second was terrible and I really did not expect much from the third (a STV sequel). Maybe I thought it would be one of those \"so bad it's good\" slashers. No, it was a \"so bad I would rather be castrated and burnt alive\" slashers. This movie honestly had no redeeming values apart from being unintentionally hilarious. The acting from everyone was just bad, the story was a rehash of the first and second, the kills were unoriginal and the editing was vomit-inducing. Five teens decide to pull a prank. Said prank does not go down so well for one of them, he dies. A year later, the four have *gasp* gone their own ways. Our lead girl gets 52 text messages which say *shock* \"I know what you did last summer.\" She decides to group up again and investigate and then one by one they are all killed off. I'm not going to spoil the revelation of who the killer is, but let me tell you now, it is without a doubt the stupidest twist you will ever see. It is nonsensical and to me, quite funny. There isn't much to say that hasn't already been said, everything is crap. The worst being the editing, it is unbearable, like watching a music video. Avoid like the black plague, I beg of you, do not watch this movie. 0/5",
         "After accidentally causing their friend to fall to his death, a group of teenagers is stalked one year later by a fisherman with a hook who knows what they did last summer. Will the gang find out who is behind the fisherman's mask in time to save themselves, or are they going to get what they deserve? As I say in my headline, this film was watchable for a video sequel. While not of the standard that \"Final Destination 3\" is, it comes close -- and didn't even push for a theatrical release. The story uses the same elements as the first movie without using any of the same characters (though it does reference the first two movies). That's not really different from what \"FD3\" did, so for those people who bash this one but give \"FD3\" a pass, you're not really being fair. My only real complaint with the plot is that I don't see why the kids deserved to be stalked. In the original, the kids are drunk driving, hit a man on the road and then hide his body. So we have three crimes: driving while intoxicated, vehicular manslaughter and hiding a corpse. Serious stuff. This time, the friend who died was in on the prank and fell to his own death on accident. No drinking, no pushing him to death, no hiding a body. A perfectly reasonable accident. Ignoring that, the characters are decent (although one -- Colby -- reminds me a bit too much of Jake Busey) and the story is told at a good pace. The inclusion of the Zoe character was a good move, as all horror films benefit from a punk or goth chick, especially one in a band. I draw your attention to Trash (Linnea Quigley) from \"Return of the Living Dead\" and rest my case. The movie has its faults and I admit I found aspects of the climax to be unsatisfying, but over all this was a good film. I have no strong urge to push for a fourth film, and hopefully we will never see one. But for a movie with no big actors and a recycled plot, this one is entirely adequate.",
         "On July 4th, in the small Broken Ridge, Colorado, the teenagers Colby (David Paetkau), his girlfriend Amber (Brooke Nevin) and their friends Zoe (Torrey DeVitto), Roger (Seth Packard) and PJ (Clay Taylor) play a prank with the legend of the Fisherman that kills teenagers with dirty little secrets with his hook in an entertaining park. However, when PJ jumps with his skateboard, there is an unexpected accident and PJ dies. The group stays together and makes a covenant to keep their secret. One year later, Amber receives messages in her cell-phone telling that \"I'll Always Know What You Did Last Summer\" and she gathers her friends to find who might have told about their prank. They find that PJ's cousin Lance (Ben Easter) also knows what they did. Sooner they find that a dark man wearing slicker is chasing them with a hook to kill each one of them. \"I'll Always Know What You Did Last Summer\" is an unoriginal collection of clichés. The forgettable story is very weak and a rip-off of the two other movies, only worse. The deaths are not original; the acting is average; the situations are predictable in accordance with the worse clichés of the genre and the conclusion is awful. My vote is four. Title (Brazil): \"Eu Sempre Vou Saber o Que Vocês Fizeram no Verão Passado\" (\"I Will Always Know What You Did Last Summer\")",
         "Having just seen a press advance of this movie, I thought I'd post my first impressions. I'll confess to being caught up in the teen slasher craze of the late nineties - movies like Scream and Urban Legend really floated my boat back then, and to a lesser extent, still do. I Know what You Did Last Summer and its over-criticised sequel certainly slotted into this category nicely. A sequel more or less in name only, the plot sees a group of teenage friends deciding to keep the death of their friend in a backfired prank a secret... one year later, in the days leading up to the tragedy's anniversary, the four receive ominous 'I Know...' messages before being picked off one by one by a hooded character in the 'Fisherman' outfit from the first two movies. Who could possibly know what they did? Is it someone out for revenge? Or is the original fisherman back to wreak more havoc? From the box art (and the seven year delay) it was clear that this was never going to have the same high production values or quality acting as those late nineties slashers, but I didn't quite expect as far a drop as this. White's direction, while lacking any genuine drawn-out suspense, is at least edgy and 'hip'; sadly, acting from all but the pretty lead Brooke is decidedly wooden. Four or five minutes into the movie, you can see why Sony decided to bypass a cinema release in favour of a straight-to-video one. That said, if taken as a low budget teen slasher in the vein of 'The Pool' and 'Lover's Lane', it actually works quite well. The true identity of the fisherman is well hidden, with various red herrings keeping the audience guessing. The special effects appear to have consumed a large chunk of the budget, too - one gutting, akin to the 'hook in the throat' from the first 'I Know...' movie, is particularly gruesome. Ultimately, I felt let down by the ending - but I would imagine everyone's opinion would really depend on their reaction to the killer's identity. As a sequel to what I consider two of the most enjoyable slashers of the late nineties, 'I'll Always Know...' fails miserably. Taken as a standalone low budget slasher, there's more of a hook. 2.5 / 5.",
         "I would have given it a zero if possible. The most pathetic suspense thriller I have ever seen. What made them do it? Isn't the money not dear to them or are they so full of it that they found out a way to waste it. I lost the interest from the very beginning of the movie. Basically there are two types of suspense thrillers. One that is very serious and the suspense is maintained till the end. You scream O my God at the end when the secret is out and you always go back and forth and analyse the events and know when to look for the clue. A fine example would be \"Final destination\" The second category is where its a total nonsense. There is no story but it has loads of humor. People watch such film without their brains so many enjoy them. I also like those. For eg \"Scary movie\". This movie falls in neither of the categories. It was full of craps but still tries to be serious. And when the secret is let out in this movie you are left frustrated and irritated and angry. You develop a strong urge to kill the makers of this movie. You feel cheated. The mystical figure would come out from no where and then vanish into no where. It was more surprising that the figure uses modern gadgets like Cellphone SMSs to scare his targets. Every thing in the movie was hard to swallow and total rubbish. The director and writer aren't aware of the term \"Reality\". This is a Humble request from me, Please don't watch this movie. If you can do anything (anything) else then thats always better than watching this movie.",
         "I come into this straight to video sequel of a franchise I never have been enthusiastic about, but with an open mind. I love to see new actors and actresses find their shine, you never know what talent is waiting out there with something a little new and untainted by cockiness and arrogance, still really feeling it, and giving 100% to the craft. The movie begins at an amusement park, and a discussion of the folklore killer known only as The Fisherman, a character you might know from the prequels in the series. A group of kids bored with their urban lifestyle, decide to shake things up with a prank, but things go horribly wrong, and once a cover up is schemed the folklore is awakened. You know what bothers me about the \"I know what you did last summer\" movies. The hook is just not a scary weapon. It does make you wonder, the way the fisherman comes and goes. It's as if he is merely a psychological embodiment of revenge. Going back to the fears on the occult, that what you resist persists, when it comes to ghosts and black magic, what you dwell on, opens doors, and beyond those doors lay our worst nightmares. The killer cannot be stopped by bullets or blades which is to be expected. Likewise, running him over with a car does no good. When you cut he him cries out like a wounded velociraptor and bleeds black oil. Also let it be noted that any time he is cut, he instantly vanishes using his super god mode powers of despawning. I think they eventually finish the movie by tossing him into a wood chipper. This movie is hilariously bad, but the acting is decent by both male and female actors, and the directing is decent... seems to be slightly influenced by Gore Verbinski, which is fine I love Verbinski's work. If I could have asked for anything different it would be better kills, and better editing, especially in regard to scene transition which was far too choppy for me, lacking a certain intelligence I like to see in films of the horror genre. Not enough time was spent creating atmosphere that's for sure. Rather unimpressive kills to be honest. Too quick and badly edited. Uninspired deaths. Definitely not as interesting as \"Urban Legend\"'s kills, but overall a somewhat light and enjoyable movie. I wouldn't say it scared me but it was nice to see some new talent. Brooke Nevin and Torrey DeVitto were great, and Ben Easter did a good job as well. I'd definitely look them up again. And you gotta love the use of Don Shanks as The Fisherman. That guy has done it all from Urban legend III, The Crow III, and Halloween V's Michael Myers. Rating 6/10 On a side note, why is it every time I get a new cellphone, the very next horror movie i watch has my cell phone in the film? First cell phone: Motorola Startac - The Ring, Naomi Watts' phone Second cell phone: LG 1400 - I'll Always Know, Brooke Nevin's phone",
         "I had low expectations when renting this movie. I am a huge fan of the first film, and of the book. The sequel \"I Still Know...\" was just okay and nothing life changing. I have learned the hard way - I didn't get my hopes up simply for the fact that whenever I get excited about a new horror movie (The Grudge, The Ring 2, and Audition come to mind) I end up disappointed, so sometimes it is better to not see the glass half full. Was I right to jump to this conclusion and go in half-hearted? Well yes and no. This review will contain spoilers. The negatives first. If you have seen the first movie in the series, then you have practically seen this one too. The characters, the storyline, even some dialog- it's very familiar. (The most illogical difference is that instead of North Carolina, we are now in Colorado. Just how does that work?) This time around- its more up to date. Instead of leaving notes, this time The Fisherman leaves text messages. I found it odd how all of the messages came from a blocked ID- I didn't know you could block your number while texting someone. Oh well. The death scenes, while violent and gory for the most part- are far too short. The best parts of horror movies are the chase/kill scenes- and they were all too rushed. Seeing as these people are almost carbon copies of the characters from the first film- I expected Zoe (who is a punk-rock version of Helen Shivers) to have a long chase scene. I was let down- as I was with all of the death scenes. They were all over before they even finished- and it didn't help that it was beyond see-through to know who had \"Victim\" stamped on their forehead. The editing, while neat at times, quickly became annoying. Is this a music video or is this low budget horror? The quick cuts and fancy editing did nothing for me but get in the way. Also, I'm not sure if my DVD was messed up or not, but some of the shots looked blurry and fuzzy, but it was not that big of a deal. Last but not least- the ending. The revelation of the Killer in these types of movies ranks right up there on top with death scenes. This was a let down. Though interesting to resurrect Ben Willis as some crazy zombie back for revenge -(it explains his supernatural ways and that text messaging problem I was having earlier)- it really doesn't make any sense. Just why would he come back for revenge halfway across the country after people who really have nothing to do with him? Sure, he wants to teach them a lesson- but give the guy some rest in his hellish afterlife- so every time something like this happens, he is going to come back and do it all over again? I mean, does he have to be like Jason Voorhees now? Argh. This means the ending of \"I Still Know...\" was a dream and Julie and Ray are alive, because Ben Willis \"died\" on Tower Bay Island. So then what was with that newspaper headline stating that 4 teenagers were killed in the Bahama's? Hmm? Okay- some good things. Torrey DeVitto is the best thing the movie has to offer. While she may be lip syncing during her song, she still does a damn good job at it. She was very likable, and I was saddened to see her go. The rest of the cast- meh. They were okay and no one was particularly bad. There were some decent scares- even though they lasted a few seconds and didn't hold up. And since I am such a fan of the first one, it was kinda nice to see it all done again with new people, even though they could never compare. Bottom Line: If you have nothing better to do, go out and rent it. I wouldn't buy it personally. If you haven't seen the others titles in the series, I do not think you will have much of a problem following it. Just remember- it is a straight to video release, and those are rarely great. 5/10",
         "This was a decent movie, nowhere near the quality or the caliber of the first two but it was okay. I don't like the direction they took with the fisherman (Ben Willis) character at all. I think it was pushed through and that's the main reason it went straight to video. They should have written a killer script and enticed the original remaining characters to return for one last go round. But they didn't and that's why they have a straight to DVD movie. Is it a good film? Sure it is, but remember one thing... When you're watching it, forget that it is part 3 of the \"I know what you did last summer\" series and just watch it as a horror flick. That's it, don't expect anything new, don't expect to be blown away, just watch it. Pop you some pop corn, turn out the lights, grab your honey and just watch it...",
         "I finally saw the movie today. Actually, I had purchased it from a local electronics store. Unfortunately, it was not as good as I expected...the way many people talked about it on here made it sound like a masterpiece. I found the movie, however, somewhat enjoyable. I do not regret buying it. There were many flaws though. One of the major ones being the camera angles. Some of them were fine, but others were completely terrible (For example, the opening on Roger's chase scene and Amber's face in the cart thing). Not to mention, most of Roger's chase scene was crap...Also, I hated how they had put together Zoe's quick dream, I found it quite unprofessional and I did not like how she looked when she was screaming, which sucked, being that Torrey DeVitto is a very good looking girl. Also, the deaths were obviously rushed too quickly, unlike how they were in the first two films. The chase scenes were short, and the deaths were quick, but painful and gory, which I do give credit for. When Zoe was sitting in the mirror admiring herself, it looked too staged. You know, like one of those obviously fake smiles on a Crest commercial. It wasn't the actress, it was how they had made her perform for her character, which didn't work out well in my opinion. The rest of the movie was great; the acting, violence, dialogue, settings, etc. I expected much more of it, but it was one of the best teen-flasher flicks I have seen in years, which I admire. I hope that they do not make a sequel, because it might mess up what they already have created, which is a good franchise.",
         "This is, for those who don't know, the third installment of the I Know franchise. This one follows a group of teens who hear of the legend that a man in a slicker with a hook takes to killing people every July 4th. They stage an attack at a carnival which leads to the accidental death of a young man, so they decide to cover it up. The cops and everyone else thinks that there is a madman out there who is responsible. They destroy the evidence and make a pact never to tell the story. But surprise surspise one year latter they start getting threatening messages that someone knows their dirty little secret. They do have a nice little \"who is the killer\" mystery going but the film fell HARD with the reveal of the killer. Here it is...IT IS THE GHOST OF THE KILLER FROM THE FIRST TWO BLOODY MOVIES! What the *rhyms with PUCK* was the writer thinking when he pulled that out of his bottom?!? You don't build up a mystery for an hour and a half and have the killer be someone completely unrelated to the story you have presented to the audience. I'd give the film 1/2 of a star out of four. I was never really a fan of the \"I Know\" series, but this was astonishingly bad. The big surprise reveal of the killer was mind numbingly stupid! I am ashamed to actually have seen this film. The first ones at least worked on the so bad they're fun level but this was just a mindless retread of the first up until the redic ending. What the holy hell were they thinking. They turned it into a Friday the 13th drone. If you haven't seen the flick yet, please for the love of balls DON'T!",
         "i watched this movie just the other day , i was kind of looking forward to it... shame i should'nt of had my hopes so high.... Personally i thought this movie was very bad.... Well maybe if they had changed the ending i thought the ending was ridiculous the rest of the movie was good just the ending totally messed it up!!!! And the killer only went after a few of the teen's in the film, i mean like there was more involved and they weren't even murdered!!!! and on the cover of the movie there is a blonde girl who is screaming on the cover who has NO part in this movie !!! although there where a few good death scenes in it i liked Zoe's ( played by Torrey DeVitto) death and i also liked Colby's death (pleayed by David Paetkau) but i really do NOT think they should have used the fisherman from 1&2 in this movie, like why!?!?!?! they could have used a number of the people to be the killer in the movie the ending was just pathetic and so predictable!!!! ..... should'nt have made it .... i was looking forward to wrong turn 2 ...but now..... it seems every sequel that is straight to DVD comes out crap.....",
         "Wow. My wife rented this DVD because she liked the previous two, but given that it lacked a theatrical distribution, we didn't have much hopes for it being entertaining. What a mistake! \"Always\" is a smart and well-crafted thriller, better than #2 and almost as good as #1. Yes, it's a little formulaic, but that seems to be what the studios require. What's surprising is the quality of the writing, which introduces some fresh characters and keeps them engaging despite this being a genre piece. The director is also pretty solid and keeps the story moving without getting too \"creative.\" The acting is also pretty good, despite my not having heard of half of these actors. Overall, this is a pretty solid film and a great guilty pleasure.",
         "For not having any of the original cast members of the previous I Know What You Did Last Summer films in this, it lives up to the previous two and i loved it. I just wish that this flick would of been released in the theaters, i think that it would of done real well. This movie had a terrific cast led by Brooke Nevin(2009's Infestation and The Comebacks), Torrey DeVitto(Killer Movie and One Tree Hill), David Paetkau(Aliens vs Predator 2, Final Destination 2 and Flashpoint) and other really hot cast members, running from an unseen serial killer, who stalks them one year after they cover up the accidental death of a friend and begins to strike without warning again and again. This flick is a great stalker shocker, guaranteed to thrill horror fans everywhere. I definitely recommend it!!",
         "I have been a fan of the 'Last Summer' series for a while now and have been anticipating this film for quite some time. After finally getting a copy, I watched it and thought it was another great addition to the trilogy. But don't except a film like the first. The first was one of the best modern slashers and the second, well the second wasn't that great. Then this film came along. It doesn't try to break the genre rules or anything, it just follows them and proves that you can still enjoy a pretty predictable movie. The acting was great especially from Brooke Nevin and Torrey Devitto. The directing was also great but the quick flashes got on my nerves a little (mainly when it took away from a really cool death scene). So if you're in the mood for a typical teen slasher and like the sounds of this one, rent it or buy it. You won't be disappointed.",
         "*MAY CONTAIN SPOILERS* (Though, I tried to avoid as much as possible) I was utterly torn on the scoring of this film, on one hand I wanted to give it a much higher score, but on the other I also wanted to give it a much lower one. Allow me to explain: I started watching this film quite dubiously, thinking it was quite a boring rehash of the original film, but about 20 minutes in, I really started to enjoy it. The characters were colourful and very likable, the dialogue was clever and interesting and the plot had me more than a little 'hooked.' (<- see what I did there?) I was all out ready to praise this movie to high heaven, already planning my IMDb review at the half way stage. It got to around 70 minutes into the film and I was thinking; wow, this film is excellent, I REALLY can't figure out who the killer is... (By this stage I had long dismissed the two main, big suspects as Red Herrings.) Then just at the climax of the film I thought; Brilliant, I get to find out who it is, I love films I can't figure out like this... Then the killer was revealed and I was left thinking: What....? I mean... WHAT?! What the hell is going on?! I spent the remaining 15 minutes scratching my head wondering why the hell it all suddenly changed from a really good 'whodunnit' slasher flick into a fairly cheesing and disappointing film. *WARNING spoilers follow here* I would like to know why exactly the director thought; I know! Instead of making this so far, very good and completely believable film into a fresh relaunch of the franchise, I'm going to make the killer a zombiefied demon/ghost/thing instead. Note to the director: it's been done. Slasher films with supernatural killers just do not work, see Urban Legends: Bloody Mary, if you don't believe me. In my mind I rewrote the ending into the killer being one of the other girls on the ferris wheel at the beginning, because that would have been more believable than what happened. So I gave it a 6 because up until the last 15 minutes or so, it really is a very good film, just after that it turns into a: what the hell did I just watch? - type of film.",
         "OK, first off.. straight up, this was a bad movie, compared to the first two. .. Just from the opening where the guy dies.. i was able to tell that this movie was gonna be stupid to watch. I mean, if that was intended to be a prank.. that was a horrific prank. The story seemed bad too, and the girl was really annoying with me. She was always freaking out and was trying to hook up with people while a killer was after them.. um yeah, try to get laid before you do stupid things. Unfortunately, i ended up watching the whole movie and found it a waste of time. Please, if you going to make a sequel to the original... Make it good -_-. I really disliked this movie. p.s. lucky lowest i can give is one rating u_u Also.. don't make it so predictable. =/",
         "Since \"I Know What You Did Last Summer\" came, I became a fan instantly. Not a year goes by, and \"I Still Know...\" was released. Unfortunately, it wasn't very good and fans including myself were really disappointed. But two years ago I found out that \"I'll Always Know...\", the third chapter in the trilogy, is going to be released without the original cast. You can assume I was very disappointed and that I had very low expectations since it was a direct-to video release movie... But soon something extraordinary happened. My friend bought my for my birthday \"I'll Always Know...\"! I was really satisfied and happy although I still had the feeling that it was gonna suck. And in my shock, not only that this movie didn't suck, but also that it was as good as the first one, and of course, way better than the second one! I was really shocked, but in a good way cause I knew the trilogy is finally complete. The movie has everything a good slasher horror movie should have: 1) Good acting, especially in Brooke Nevin and Torrey DeVitto's case. 2) Excellent ending, very similar to the original ending. 3) Good directing. 4) And finally, an excellent twist around the fisherman's identity. Anyway, if you were really disappointed after you saw \"I Still Know\", saw this flick cause you won't regret it! Recommended!",
         "When a harmless joke balloons into a deadly tragedy, wary friends vow to take their secret to the grave. But for some of them, the grave comes much sooner than they expected. I Know What You Did Last Summer and it's sequel are both guilty pleasures for me. They follow the slasher formula very closely yet they are still entertaining. I was a little skeptical about a direct to video sequel with none of the original surviving characters since it wouldn't be as interesting and the production value would be a lot less. I still gave it a shot and it ended up being very disappointing. I'll Always Know What You Did Last Summer is a lame, un-scary, boring and stupid slasher movie. It offered very little surprises and an awful ending that ruined almost every positive thing the series held. The director and screenwriters kept things simple and formulaic. It actually started off decently with the first thirty minutes being a little entertaining. The pacing was good and none of the characters were that annoying. During the second half, things got very tedious and nothing really happened. The story developed slowly and there were a bunch of fake suspense scenes. The last twenty minutes were flat out disappointing. The death scenes were average and forgettable. The suspense was nearly non existent and the special twist was horrible. I hated the way they made the killer super natural since it killed the first two films completely. It was a pointless idea and hopefully, there will be no more future sequels. The acting was awful which was expected. I know you shouldn't expect much from direct to video releases but there was no effort at all with the performances. The majority of the actors just sounded like they were reading their lines. Also, it was hard to care about the characters since most of them were unlikable and just too underdeveloped to really know. I had trouble remembering all of their names since most of them were indistinguishable to one another. Overall, this sequel (and I use that word in the loosest sense possible) is a messy bore and it's not worth watching. Rating 3/10",
         "This is really impressive for a straight-to-video, pretty better than 'Urban Legends: Bloody Mary' another straight-to-video that was also the third in its trilogy. There was real looking gore and death scenes that were nicely done. Its really decent and fans of the series will sure like this one. A group of friends are on a ferris wheel ride and they are telling the legend of 'The Fisherman.' Its just legend they say. Or is it? When a prank causes a deadly accident, the group keeps it a secret. A year later, that's when they face the menace. So look for this one in a video store near you. Its worth a rent.",
         "Still very decent. As someone who works in the movie-making industry, I know firsthand that it's become quite difficult to get filmmakers to come up with story lines that are good (hence the numerous and unnecessary remakes). Nonetheless, I'll always know is a breath of fresh air from all the depressing remakes and rehashes of ancient movies that deserve to be left alone. I'll always know starts with a July 4th prank that goes wrong and results of the death of a friend in a small town in Colorado. Much like the original, we have four kids, Amber (Julie), Colby (Barry), Zoe (Helen) and Roger (Ray). Again, they make a pact to take what has happened to the grave. One year later, a fisherman with a hook starts stalking and killing. Yes, there are times when the script is contrived and dull, but for the most part, the action is decent and keeps a good steady pace. The gore is immensity greater than either one or two. And, of course, everyone is a red herring. Although I enjoyed this movie, I know it won't be everyone's cup of tea- as I've seen from reviews I've read. For someone who is looking for a movie that is above Scream, below Wes Craven in the 70's and 80's, and just wants to see a horror movie that gives great gore, slightly above acting (esp. the ladies) and a script that's more intelligent than most, see this. For everyone else, avoid.",
         "Recently I have been noticing all the dodgy remakes and sequels floating around. So when I stumbled across this, I thought to myself, 'Oh dear.' The first two weren't very good at all, I mean number one was clearly rushed because of the 'scream' legacy storming the air. And the second was to justify the first. So why I hear you ask was this third instalment made, to make it a trilogy, is the answer. The third film is all based around a July 4th prank that goes horribly wrong. four friends agree never to speak the truth about the actual happenings of that day, but to cover up. And as predicted, as a year passes by they start to die, one by one. I liked the way the killer tormented each and everyone of the friends, and not just a couple bar the main scream queen. It had suspense, the directing was excellent and the acting wasn't second rate as is often associated with this type of horror. Watch it, I promise you it is so much better than you think its going to be.",
         "same old formula as old ones... so if you kind of liked the old ones you may enjoy this one... I particularly think that the producers did not need to make this movie at all, because it did not bring much to the table in terms of anything in specific .. bad actors, bad plot. ..same as the original one... with just one tiny difference in the end.. . to make it a little more interesting... just a little.... I just enjoyed a little because I like this kind of movies.... that's all...cheers hope you all like it at least a little bit they should have considered bringing back the original cast so as to make this film more appealing to the audience ..... then they should have considered a better script rather than coming up with one similar to the original script....I would be at least more interesting....",
         "I totally hated part II but this one is different! Sure it look like the 1st movie a lot but with the time, you can see some differences. The killer is a deadman. He's already dead so you can't kill what is already dead right? The fact that the killer disappear work in this one because it's more fantastic / horror than just a basic slasher!! Kudos to the director and I read their will be a sequel! I'm actually happy! Every actors and actresses work their butts in this movie!! Highly recommanded! If you are in the mood of a supernatural thriller, this is what you need. Forget the others movie, this is a new beginnng. It's different and it's what make this movie so good!!! B+",
         "As the third series of Urban Legend, Urban Legend: Bloody Mary (2005), the latest installment of I Know What You Did Last Summer (1997), I'll Always Know What You Did Last Summer, is a straight goes direct-to-video. Somewhat a poignant state, when the origins are considers as classic for the fans, as long as they predecessor, Scream (1996), back into the 90's. Now in the early 21st century, most horror movies from USA are remake, whether from the classics or the J-Horror. Yet they are gory or atmospheric, but nothing is really original or breakthrough. So, I guess when the old player like these series need a breath of life, they must goes back to a home video. I'll Always Know What You Did Last Summer (ILAKWYDLS) is a throwback to it origins. Plot is recycled. Images are re-used. No wonder it doesn't have a theatrical release. Surprisingly, not like the Urban Legend: Bloody Mary, ILAKWYDLS still delivers some chills and thrills that amusing to watch. Just not raise your expectation from this little movie, and you will get entertains. ILAKWYDLS is telling story a bout a prank of a small group of teens that goes wrong and kept it as secret. A year later they start receiving menacing note that said know what they did last summer. Things are getting worse when a hook wielding fisherman start to make a killing spree. That's it. That's the bottom line. Nothing's new. But the direction from Sylvain White is thriving to keep the suspense and make us contemplated the plot and try to guessing who the real killer is. Yes, we know the formula and by adding the element from the original is making us wonder, whether this movie are connected to its priors or not. Alas, during the finale, the story goes unbelievable and running wild like it's merged from different movie altogether. Acting is never expected the best from a movie of this genre, and ILAKWYDLS is no exception. But, at least they are not totally annoying that we wish the killer to kill them all. We still could relate to the characters even them somewhat unrealistic. It's also kind of nice when Brooke Nevin, who's played the main character Amber, is very resemblance to Sarah Michelle Gellar. In the horror segment, there's also some nice gore, if you like it. The killing's scenes are some kind brief but are quite effective and the F/X is moderately good. As conclusion, ILAKWYDLS is not really a bad piece of work. It's surprisingly pretty good as a direct-to-video and could be much better with bigger budget and should get more attentions if get any theatrical release."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Destination Films",
         "Original Film",
         "Screen Gems"
      ],
      "summaries": [
         "On July 4th, in the small Broken Ridge, Colorado, the teenagers Colby, his girlfriend Amber and their friends Zoe, Roger and PJ play a prank with the legend of the Fisherman that kills teenagers with dirty little secrets with his hook in an entertaining park. However, when PJ jumps with his skateboard, there is an unexpected accident and PJ dies. The group stays together and makes a covenant to keep their secret. One year later, Amber receives 50 messages in her cell-phone saying \"I Know What You Did Last Summer\" and she gathers her friends to find who might have told about their pact. They find that PJ's cousin Lance also knows what they did. Sooner they find that a dark man wearing slicker is chasing them with a hook to kill each one of them.",
         "A group of teens accidentally kill a fellow friend in a 4th of July prank. They all band together and decide to take there secret to the grave. Little do they know that they really will be taking there secret quite literally to the grave as one year later there secret comes back for revenge. Can they work out who's killing them off one by one or will they all take there secret to the grave.",
         "A group of teenagers in a Colorado find themselves being stalked and killed one-by-one by a mysterious figure with a hook, exactly one year after they covered up a friends' accidental death...",
         "After the accidental death of a friend during a dangerous prank, a group of friends decide to cover-up his death and act as if they didn't see anything (knowing that his Sheriff father will make sure they do time). However, one year passes and the friends are having their fair share of problems and haven't been together for a while. But they are soon bought together when somebody sends a lot of intimidating messages saying 'I Know What You Did Last Summer' and begins making the teens' lives hell. Soon, the friends find themselves being murdered one-by-one by a mysterious figure in a slicker and with a large hook as a weapon...",
         "The latest installment in the \"I Know What You Did Last Summer\" franchise focuses on a seemingly harmless Fourth of July prank that ends in the unexpected death of a friend of four teens from a small Colorado town who make a pact to keep the death a secret (despite one's desperate protest). Over the course of the following year, the four teens find their friendships all horribly strained and all but terminated completely from the trauma. Come the next Fourth of July, just before the town's annual carnival, the four teens all find themselves being victimized by a mysterious menace when they begin to receive intimidating calling cards indicating someone is aware of what happened before. The group suspect the cousin of the dead friend, only to discover they are very much on the wrong track. Can the friends survive and figure out the identity of their tormentor before they end up dead themselves?",
         "A group of teenagers in Colorado find themselves being stalked and killed one by one by a mysterious figure with a hook, exactly one year after they covered up a friend's accidental death."
      ],
      "budget": 0
   },
   "movielensId": 139056,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-06-24",
      "dvdReleaseDate": null,
      "directors": ["Sylvain White"],
      "runtime": 92,
      "movieId": 139056,
      "title": "I'll Always Know What You Did Last Summer",
      "mpaa": "R",
      "actors": [
         "Brooke Nevin",
         "David Paetkau",
         "K.C. Clyde",
         "Seth Packard",
         "Torrey DeVitto",
         "Ben Easter",
         "Clayton Taylor",
         "Michael Flynn",
         "Don Shanks"
      ],
      "imdbMovieId": "0469111",
      "originalTitle": "I'll Always Know What You Did Last Summer",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["8NwP8MFZqlk"],
      "plotSummary": "Several teenagers in a small-town in Colorado concoct a July 4th prank based on a frightening legend that goes awry when their friend ends up accidentally killed; however, the teens agree to keep their involvement a secret from the authorities, who continue to search for the man who apparently killed their friend. A year later, with the July 4th celebration coming up again, the teenagers realize that they're being stalked by someone who clearly intends on keeping the horrible legend alive by killing them off.",
      "tmdbMovieId": 3602,
      "avgRating": 2.14,
      "releaseYear": "2006",
      "numRatings": 25,
      "posterPath": "/hYMAHn28MCkgbTBQom3UmvzUYhN.jpg"
   }
}