{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "filmed opera",
         "id": 215505
      }],
      "imdb_id": "tt0079063",
      "video": false,
      "title": "Don Giovanni",
      "recommendations": [],
      "backdrop_path": "/fvdp0gy6CWaHb1uez3APuoWuDim.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "dnitzer",
         "id": "5305a3c79251413491157226",
         "content": "Frustrating rendition of Mozart's masterpiece.  The singers are all first-rate, and led by Lorin Maazel and the Orchestra of the Paris Opera.  But the direction by Losey and his team is unfocused, and seems to care more about making some confused socio-political commentary, and not so much about telling a clear story. (For just one example, what in the world has Losey done to the sextet in Act 2?  Does that scene make any sense?)  In short, here you will find magnificent Mozart, and lousy Losey.",
         "url": "https://www.themoviedb.org/review/5305a3c79251413491157226"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Don Giovanni",
               "gender": 2,
               "credit_id": "52fe465bc3a368484e08c44d",
               "name": "Ruggero Raimondi",
               "profile_path": "/upIpwGhtN4CVFl2UOtBWJEylupF.jpg",
               "id": 87269,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "The Commendatore",
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c451",
               "name": "John Macurdy",
               "profile_path": null,
               "id": 233462,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Donna Anna",
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c455",
               "name": "Edda Moser",
               "profile_path": null,
               "id": 233463,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Donna Elvira",
               "gender": 0,
               "credit_id": "56b38020c3a36806ec002383",
               "name": "Kiri Te Kanawa",
               "profile_path": "/8jLyvo2gAOuA7uxzmVW23n8GHlM.jpg",
               "id": 1225312,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Don Ottavio",
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c45d",
               "name": "Kenneth Riegel",
               "profile_path": null,
               "id": 233465,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Leporello",
               "gender": 2,
               "credit_id": "52fe465bc3a368484e08c461",
               "name": "José van Dam",
               "profile_path": "/oDrIlxbUF0o6fi50wc2Wrej2CTE.jpg",
               "id": 228092,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Zerlina",
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c465",
               "name": "Teresa Berganza",
               "profile_path": null,
               "id": 233466,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Masetto",
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c469",
               "name": "Malcolm King",
               "profile_path": null,
               "id": 233467,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe465bc3a368484e08c425",
               "name": "Joseph Losey",
               "profile_path": "/5OIfdtROzTqUxUCdzyOe5fM8GXl.jpg",
               "id": 39009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe465bc3a368484e08c431",
               "name": "Lorenzo da Ponte",
               "profile_path": "/vdYZXcNt1EaV6KsWTvkgRW3ATRs.jpg",
               "id": 233456,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c437",
               "name": "Frantz Salieri",
               "profile_path": null,
               "id": 233457,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c43d",
               "name": "Patricia Losey",
               "profile_path": null,
               "id": 233458,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c443",
               "name": "Frantz Salieri",
               "profile_path": null,
               "id": 233460,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe465bc3a368484e08c449",
               "name": "Rolf Liebermann",
               "profile_path": null,
               "id": 233461,
               "department": "Writing",
               "job": "Idea"
            },
            {
               "gender": 2,
               "credit_id": "52fe465bc3a368484e08c46f",
               "name": "Joseph Losey",
               "profile_path": "/5OIfdtROzTqUxUCdzyOe5fM8GXl.jpg",
               "id": 39009,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "5697daa49251412546000274",
               "name": "Wolfgang Amadeus Mozart",
               "profile_path": "/a1nI4wKbCFkcbCshUB8tn3JDtQB.jpg",
               "id": 18170,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.607659,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 61638,
      "vote_count": 4,
      "budget": 7000000,
      "overview": "Screen adapatation of Mozart's greatest opera. Don Giovanni, the infamous womanizer, makes one conquest after another until the ghost of Donna Anna's father, the Commendatore, (whom Giovanni killed) makes his appearance. He offers Giovanni one last chance to repent for his multitudinious improprieties. He will not change his ways So, he is sucked down into hell by evil spirits. High drama, hysterical comedy, magnificent music!  (and unfortunately poor direction by film maker Joseph Losey.  The final scene looks more like an industrial mishap than a supernatural event.)",
      "similar": [
         373585,
         164997,
         68201,
         71431,
         79448,
         417732
      ],
      "original_title": "Don Giovanni",
      "runtime": 176,
      "poster_path": "/mBOJppwdFVO8yGJNVGihchwgnOA.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
         "name": "Gaumont",
         "id": 9,
         "origin_country": "FR"
      }],
      "release_date": "1979-11-06",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joseph Losey"],
      "runtime": 175,
      "synopsis": null,
      "writers": [
         "Lorenzo da Ponte",
         "Francis Savel"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0079063/",
      "coverLink": null,
      "actors": [
         "Ruggero Raimondi",
         "John Macurdy",
         "Edda Moser"
      ],
      "reviews": [
         "A fascinating film that seems to be operating on several levels at once. It was hard for me sometimes to just listen to it as an opera, because I felt that there were so many messages being imparted through the sets, landscape and especially the extras who continually move about the scene as the main characters sing and act their stories. Others have observed that the common people are present everywhere, and yet just ignored by Don Giovanni; he even conducts his attempted seduction of Zerlina with half a village standing on the steps and watching. As an aristocrat, he doesn't even acknowledge the existence of these underlings, and can do what he wants without worrying about their opinion or their interference. Nor is this just the behavior of a bad man; Don Ottavio is much the same during one of his arias (I think it is 'Il mio tesoro') when he is walking about declaiming as peasants dot the lawn, taking their afternoon siesta. Perhaps the point is not so much to accuse anyone of being deliberately cruel, as to underline how absolutely divided the aristocracy is from the common people. Not only do the aristocrats ignore the commoners, the commoners seem to be pretty oblivious to the aristocrats, too. No matter what Don Giovanni gets up to, the work of the peasants just goes on - he may wander down to the kitchen once in a while to give a little speech and pinch a serving wench, but it makes very little difference to anyone if he's present or not. The whole of this society seems as artificial and fragile as Don Giovanni's lace sleeves; this is a world that is almost at the limit of its ability to hold together under the weight of its contradictions. Ruggero Raimondi is a terrific Don Giovanni - handsome, graceful and charming, but with a hardness in the line of his mouth and his eyes that creates a very disturbing feeling of danger. Zerlina, though attracted, seems to sense that there is something wrong about him, though she isn't quite sure where to attribute the feeling of fear he inspires in her. Teresa Berganza was my favorite of the 3 main ladies; Edda Moser seemed very grim after her opening scene, and Kiri Te Kanawa reminded me irresistibly of Madeleine Kahn in \"Young Frankenstein\", especially with that tall silver-powdered hairdo. The silent servant played by Eric Adjani was another one of the puzzles that I felt this movie kept posing me. He seems to be a younger version of Don Giovanni, and one who is present almost as Don Giovanni's spirit, when the actual man is not there. During moments of crisis, he almost always watches Don Giovanni, not the action that is taking place outside him, and only Don Giovanni seems to really look at him. In the finale, he is almost like Banquo's ghost, sitting in Don Giovanni's chair until the master confronts him, and when the Commendatore's statue appears, Don Giovanni almost seems to bid him goodbye as he passes. I think the servant is Don Giovanni's conscience, the age when Don Giovanni, as a young man, cast him off and turned to evil. Now he follows him like a ghost of himself, observing but unable to influence.",
         "Not only do we get a visual feast, but the singers are incredible, fleshing out the dramatic core of this opera and even delivering moments of genuine beauty and splendor. It stars Ruggero Raimondi as the seductive and sinister Don Giovanni, Edda Moser as Dona Anna, Kenneth Reigle as Don Ottavio, Jose Van Dam as Leporello, Kiri Te Kenawa as Dona Elvira, Teresa Berganza as Zerlina, Malcolm King as Masetto and John Macurdy as the Commandatore. In a minor/silent but seemingly important role as a servant in black is the youthful-looking Eric Adjani. The multiple dimensions of this film are too much to talk about but I will try to highlight some of them. First of all, Lorin Maazel as conductor is perfect. He brings out the dramatic content without sacrificing the melodic beauty Mozart wrote into the opera. The cinematography is gorgeous. It was shot in Venice (during the Overture we see the canals and opulent boats), Vicenza the countryside, crowned by Italian villas and palaces the Villa Rotunda is dismissed as a historic Italian landmark and becomes Don Giovanni's regal estate, and some indoors scenes were shot in the interior of the Olympic Theatre. Most of the movie is shot in fresh natural sunlight or moonlight. The powerful performances by the lead singers is extraordinary and each bring a colorful and individual portrayal. Ruggero Raimondi is a rare breed of \"high\" bass, capable of producing masculine chest voice but also a radiant, tenor-like top register. He is seductive but devilish in his portrayal. His eyes, especially, seem to give away his dark predatory soul. In Raimondi, we have one of the best Don Giovanni interpretations. He's lewd, he's lusty, he's murderous, he's a shameless libertine whose motto is \"Viva La Liberta!\" Long live liberty! The film has subtle symbolism and poetic imagery. For instance, during the Catalog Aria that Leporello sings to Elvira, he reads from a seemingly unending list in which the Don has written his conquests, a list that goes on and on, draping the stairs and rolling to the road toward the villa. During the Seduction duet \"La Ci Darem La Mano\" we briefly glimpse a huge Crucifix and we see a dog sleeping. These I took to represent the ethic and morals that Zerlina would compromise if she succumbed to the Don's passions- she would betray her Catholic faith by breaking her engagement with Masetto and being unfaithful unlike the faithful man's best friend the dog. Also, the Commandatore is evidently foreshadowing his vengeance on the Don as he is dying, when he is pointing at the Don. The complex Dona Ana' dilemma: she is possibly lusting after the Don and attempting to fight off her own desire for him and keep faithful to Ottavio. Whom is she mourning really when Don Giovanni is sent to Hell ? She is always claiming that she mourns her father's death but yet as soon as she hears that the Don has been sent to Hell, she postpones the wedding to Ottavio for another year. Very odd. Eric Adjani is the silent and mute strange servant in black. Who is this person ? Who's side is he on ? He is evidently one of the Don's many servants but during the Overture he is looking knowingly at Dona Ana as the fire furnace is being installed in the Don's home. Also, during the scary scene in which the Commandatore statue comes to dinner, this shady character shows no sign of being frightened and in fact one feels that he is in on it somehow, as if he is an avenging angel as well. He seems to have knowledge of something the audience doesn't know and his personage both opens and closes the opera literally as he closes the doors to the Don's villa. Edda Moser portrays a supremely dramatic Dona Anna. She is Wagnerian in her dynamic performance, a steely victim, a wronged woman who seeks revenge on a man we also feel she might possibly be attracted to, mainly because her fiancé, Kenneth Reigle's Ottavio, is so lackluster and dull. Now, I admire and love Kiri Te Kenawa in various other roles- she is the definitive heroine in Cappricio and perhaps even the most definitive Fiordiligi in Cosi Fan Tutte and a rather touching Countess in Figaro, but as Dona Elvira she lacks the fire and fury that is so vital to the role. Dona Elvira is the most Italianate heroine in the opera and she has arias and lines which focus on her feisty and fiery temperament. Kiri sings gorgeously but her emphasis is on the beauty and consequently comes off as too noble, too majestic and dignified. She should be outraged and obsessive, wanting more than anything to get back at Don Giovanni as well as to land him for herself. But Kiri does not show us any of this necessary dramatics. Teresa Berganza is an adorable Zerlina, cute and clever. Note how she is almost tempted to run off with the Don but wises up and decides to stay with her fiancé Masetto when she realizes Don Giovanni is a devil. Berganza is actually my first choice for the best Zerlina. Malcolm King, who is sexy as hell, is equally adorable as Masetto, especially when we see how jealous and easily provoked he is. Finally, Jose Van Dam as Leporello is quite good, especially because he's not just a loyal \"idiot\". He's in fact true to Mozart's concept of Leporello- a servant who is wiser than his master. Van Dam captures the noble spirit of Masetto, who is just a pawn to his master's schemes, but who on his own would definitely be on the side of the good guys.",
         "I enjoyed it very much. I'm fairly new to the whole wide world of opera but this was very entertaining. But what do I really comment on? Mozart's work, or the movie adaptation of it? Mozart of course is incredible. I love the opening scene, the closing scene and pretty much everything in between. My biggest problem, and I assume that this is true with opera in general is that once I passed the point that I had reached in familiarity from listening to a recording of it, the music was lost to me. I paid more attention to the words and what was going on in the plot than the music. As for the movie adaptation, aside from it being very strange to watch and listen to an opera written more than 200 years ago on my modern television, I found it enjoyable. Yes, the preceding comment is true that the expressions were exaggerated and more fit for a stage but I don't feel they were inappropriate either. As far as sets and costumes and quality, I have very little basis of comparison, as I have not seen it on stage, or any opera for that matter. In short, I found it to be very good, though I'm probably one of the very few sixteen year olds who would agree with that.",
         "To make a movie based on an opera is a different thing from filming an opera on stage. Cinema and opera are 2 different forms of art each one with its specific techniques. Nevertheless one can be at the other's service and if the match is excellent the merits of them both will be enhanced. That's what happens with this excellent movie where we can enjoy Mozart's music and the singing talents of such extraordinary artists like Kiri Te Kanawa and others besides a lot of gorgeous and dynamic movie images, sceneries, shots and superb cut and editing. The plot everyone knows: the adventures and misadventures of D. Giovanni the king of philanderers of all times and a more or less disguised attack on aristocracy and its immoral behaviour. We are on the eve of the French Revolution and as everybody also knows Mozart was a freemason and a democrat.",
         "This is a wonderful film, the only non-stage performance I've ever seen of this incredible opera. I saw it a million years ago in college and have probably watched it a dozen times over the years. Raimondi is demonically compelling as the Don, wicked, handsome, sardonic, and Van Dam plays off him as Leporello just wonderfully, balancing humor and pathos. Riegel's Ottavio is just as he should be, a humorless square, and Te Kanawa soars as Elvira. My only casting complaint is with Moser as Anna; she sounds very shrill. I liked the hint that perhaps Anna was, despite appearances, actually quite attracted to the Don as well; her protestations to the lumpish Ottavio that she thought it was actually he who'd come to her bedroom didn't persuade (and frankly, I've always wondered why he was such a putz as to buy it). The settings are lush and lovely, including Palladio's Villa Rotonda. Of course some of the lip-syncing is off a bit, but that's to be expected. I also eagerly await a day when this film is available on DVD.",
         "Sublime music and the filming on location in Vicenza -- Very well made adaptation of Mozart's masterwork. The settings create a visual feast to rival any operatic stage set. Although I did find Leporello a little dissapointing with its full comic potential not realised.",
         "I don't think I can add to what has been said(and so well) already but I will try my best. This is my favourite version of Don Giovanni, both sumptuous and dramatic and does justice to a wonderful, complex opera that is quite possibly Mozart's most complex and dramatic. The music is just wonderful. From the dark and dramatic overture, to the champagne aria to the duet between Giovanni and Donna Elvira and of course the final scene with the Commendatore which here was superbly done, it is a choc-a-block of some of the finest music in opera history. Joseph Losey's direction is well handled and secure and isn't overwhelmed by the complexity of the story. And of course this version is sumptuously filmed, with exquisite costumes, settings and scenery, undoubtedly one of the most gorgeously filmed film operas to be put on film. And the performances are excellent, with a superb Ruggero Raimondi, making Giovanni handsome, graceful and charming, yet sinister, devilish and seductive, and a genuinely imposing John Macurdy as the Commendatore. Jose Van Dam stays true to Mozart's concept of Leporello, Edda Mosser is a lovely Donna Anna, Kiri TeKanawa is a fiery Donna Elvira and Teresa Berganza is an adorable Zerlina. Overall, wonderful, sumptuous, complex and dramatic. 10/10 Bethany Cox",
         "Filmed opera can be shot either on stage (one lead example is \"The Magic Flute\" by Ingmar Bergman, but there are many others), either on site as in a fiction movie. (Rarely, it combines both elements, for instance \"The Tales of Hoffmann\" by Powell and Pressburger.) \"Don Giovanni\" is a masterpiece of the latter kind. Granted, the film is not the first opera off-stage: among others, we must mention at least the memorable \"Tosca\" by De Bosio (1976), shot in the actual Roman locations where the action is supposed to take place. However \"Tosca\" was a TV movie, while \"Don Giovanni\" was a full-scale cinema movie with live recordings. As such, it has set high standards and a trend that was imitated later on: \"La Traviata\" by Zeffirelli (1982), \"Carmen\" by Rosi (1984), \"Madame Butterfly\" by Mitterrand (1995). Unfortunately, these films are rare because of costs (settings, singers mobilised for a long period, important crew, dedicated orchestra, etc.). Hence stage filming is more common because it is cheaper to produce: apart from royalties, there are few additional costs than stage production. Even if you are not an opera amateur, you will probably like this movie: it is loaded with action and drama, settings are impressive, costumes are gorgeous. And the music, ah the music, anybody would love it. Mozart is eternal. Where to start with such a masterpiece? Since it is an opera, with the most obvious: the singers are top class. Ruggero Raimondi is a fabulous lead role. He conveys an intense aura throughout the movie, he gives everything to the character, he strips figuratively and literally; he does not play Don Giovanni, he IS Don Giovanni. We knew he was a great singer, we now know he is a great actor. José Van Dam is a colourful, stylish, smart Leporello. It is a bright idea to attribute this role (that was then frequently considered secondary) to such a talented singer: the character and plot gain depth. Teresa Berganza is a prodigious Zerlina: although she was more than 40 when the movie was shot, we believe she is a young peasant. Despite her small role, she is the most convincing of the female singers. Most other performers are remarkable, but these three break the house down in terms of singing and acting. The orchestra, directed by Lorin Maazel, is a firm support to these great artists. To be honest, it is not the best interpretation but does the job for the purpose of the movie, with its dynamic tone and sharp texture. (For information, the reference recordings are by Giulini, which has my preference, and Krips. I would also recommend Jacobs, an elaborate version, or Gardiner, a red-blooded account). At the time, the acoustic was somewhat flawed, which raised criticisms, but has been corrected since. Settings and costumes do more than illustrate the plot: they give it an altogether new dimension. Note the movie does not aim for historical accuracy (as the above-mentioned \"Tosca\"): it was shot in Veneto, Italy, while the action is supposed to take place in Sevilla, Spain. Losey aims here for maximal aesthetic effect. On the one hand, details enhance the feeling of reality: peasants working, eating, sleeping; a lively wedding; a lush party. On the other hand, remote surroundings, elaborate costumes and mysterious masks create a timeless and abstract atmosphere. This gives the movie its universal dimension, which makes me believe it will never be surpassed. In such an environment, the fabulous arias rise to artistic stratosphere. \"Madamina, il catalogo è questo\" is illustrated by Leporello unwinding a huge manuscript down stairs and a hill: we can barely believe what is happening, we are bewildered like Donna Elvira. This brilliant idea has since been imitated numerous times on stage, in different forms. \"Là ci darem la mano\" is sung in a beautiful, sunny house, surrounded by friendly folks: we believe, as Zerlina, that Don Giovanni will love her for ever. \"Dalla sua pace\" is sung by Don Ottavio in a boat floating among marshes: the calm and surrealist surroundings increase the character's loneliness and melancholy. Likewise later on with \"Il mio tesoro\", where he wanders alone in deserted gardens. The overture, where there is no action, always is a tricky part: what to film as the music plays? Losey imagines a splendid and clever scene: Don Giovanni visits a glass fabric. We see him behind a fire, an illustration of his devilish character and an anticipation of the fact he will be devoured by the flames of hell. Losey even manages to beautify the epilogue (after Don Giovanni dies), clearly not Mozart's best piece of music. The duel, the wedding, the love scenes, the party, the cemetery, Don Giovanni's death, etcetera, etcetera: all scenes are impressive and flawless. The movie is a long string of perfect pearls. Enhanced by this artistic vision, the opera's themes are better than illustrated: they are transcended. Desire, love, ambiguity, humour, social constraints, domination, money, destiny, fate: it is rare to see a movie that is at the same time so enjoyable and so profound. Regardless if you are a connoisseur or not, \"Don Giovanni\" will change your vision of filmed opera, opera in general, classical music, music in general and even cinema. Already outstanding at the time, it has now become a must-see classic.",
         "An inspired, if occasionally peculiar production, shot on location with a terrific cast. Raimondi's Don is an extraordinary conflagration of deceit and sexual magnetism, tourettish violence and charm; I watch the film assuming he's going to get away with everything (I once worked with a girl who had learnt the entire libretto in Italin from repeated viewings of this film alone at the age of 8, despite not speaking the language. She was reasonably addicted to the anti-hero). Losey undermines expectations though setting the opera in a (period) rural estate with the principals operating with urbane sensibility. Nothing is quite what it seems and the supernatural forces that begin to take hold are far from unexpected. Far from killing the operatic experience (as films are prone to do), Losey's film manages to set the drama free. Absorbing if not as menacing as its potential. 6/10",
         "This is such an outstanding display of cinematic and operatic talent that it should be seen by anyone with any interest in either. It introduced me to opera when it came out so I am eternally grateful. I'm waiting for the DVD and check here regularly for news. I thought that it had finally arrived in Germany, judging from the display on the iMdb page. Alas, that seems to be a different animal altogether, so we're still waiting. I'll try to get them to fix the link. Who does one lobby to get a DVD released?"
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Gaumont",
         "Caméra One",
         "Opera Film Produzione"
      ],
      "summaries": ["Screen adapatation of Mozart's greatest opera. Don Giovanni, the infamous womanizer, makes one conquest after another until the ghost of Donna Anna's father, the Commendatore, (whom Giovanni killed) makes his appearance. He offers Giovanni one last chance to repent for his multitudinious improprieties. He will not change his ways So, he is sucked down into hell by evil spirits. High drama, hysterical comedy, magnificent music!"],
      "budget": 7000000
   },
   "movielensId": 139060,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1979-11-06",
      "dvdReleaseDate": null,
      "directors": ["Joseph Losey"],
      "runtime": 176,
      "movieId": 139060,
      "title": "Don Giovanni",
      "mpaa": "",
      "actors": [
         "Ruggero Raimondi",
         "John Macurdy",
         "Edda Moser",
         "Kiri Te Kanawa",
         "Kenneth Riegel",
         "José van Dam",
         "Teresa Berganza",
         "Malcolm King"
      ],
      "imdbMovieId": "0079063",
      "originalTitle": "Don Giovanni",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["GoLv5Tn7eFw"],
      "plotSummary": "Screen adapatation of Mozart's greatest opera. Don Giovanni, the infamous womanizer, makes one conquest after another until the ghost of Donna Anna's father, the Commendatore, (whom Giovanni killed) makes his appearance. He offers Giovanni one last chance to repent for his multitudinious improprieties. He will not change his ways So, he is sucked down into hell by evil spirits. High drama, hysterical comedy, magnificent music!  (and unfortunately poor direction by film maker Joseph Losey.  The final scene looks more like an industrial mishap than a supernatural event.)",
      "tmdbMovieId": 61638,
      "avgRating": 3,
      "releaseYear": "1979",
      "numRatings": 2,
      "posterPath": "/mBOJppwdFVO8yGJNVGihchwgnOA.jpg"
   }
}