{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "white house",
            "id": 833
         },
         {
            "name": "usa president",
            "id": 840
         },
         {
            "name": "national security agency (nsa)",
            "id": 3635
         },
         {
            "name": "danger",
            "id": 15017
         },
         {
            "name": "sable",
            "id": 169028
         },
         {
            "name": "writ",
            "id": 169046
         }
      ],
      "imdb_id": "tt0117119",
      "video": false,
      "title": "My Fellow Americans",
      "recommendations": [
         17207,
         16814,
         40490,
         16384,
         14577,
         9099,
         25330,
         26156,
         2612,
         2620,
         29739,
         14441,
         19357,
         14550,
         5709,
         1775,
         27224,
         11718,
         33152,
         26261
      ],
      "backdrop_path": "/i83Tbpb1hry1IUsVATbYYRHUyeZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "President Russell P. Kramer",
               "gender": 2,
               "credit_id": "52fe47479251416c75093c4b",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "President Matt Douglas",
               "gender": 2,
               "credit_id": "52fe47479251416c75093c4f",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "President William Haney",
               "gender": 2,
               "credit_id": "52fe47479251416c75093c53",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vice President Ted Matthews",
               "gender": 2,
               "credit_id": "52fe47489251416c75093c57",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Joe Hollis",
               "gender": 2,
               "credit_id": "52fe47489251416c75093c5b",
               "name": "Wilford Brimley",
               "profile_path": "/t0TLF4qXgXiroirvjVWWP88B0GD.jpg",
               "id": 11065,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Margaret Kramer",
               "gender": 1,
               "credit_id": "52fe47489251416c75093c5f",
               "name": "Lauren Bacall",
               "profile_path": "/kolRFeufmFpcdRJL6v44FHkqdbJ.jpg",
               "id": 7570,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kaye Griffin",
               "gender": 1,
               "credit_id": "52fe47489251416c75093c63",
               "name": "Sela Ward",
               "profile_path": "/87ojeHcrqVWtImOOOzRAwFpvl4A.jpg",
               "id": 6068,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Carl Witnaur",
               "gender": 2,
               "credit_id": "52fe47489251416c75093c67",
               "name": "Bradley Whitford",
               "profile_path": "/66brylvzWLg94TRMd6QFrVyMOei.jpg",
               "id": 11367,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Col. Paul Tanner",
               "gender": 2,
               "credit_id": "52fe47489251416c75093c6b",
               "name": "Everett McGill",
               "profile_path": "/qeNdO3yN3cWVWgKQqQOKU812iiR.jpg",
               "id": 5616,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Charlie Reynolds",
               "gender": 2,
               "credit_id": "57f49e0ac3a3680542001c41",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Rita",
               "gender": 1,
               "credit_id": "57f49e12c3a3680542001c46",
               "name": "Esther Rolle",
               "profile_path": "/qC1k4WhH9vULIKucdBbgfiQ5bmD.jpg",
               "id": 5700,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "57f49e1fc3a368053d00201c",
               "name": "Jack Kehler",
               "profile_path": "/huxiFLWgthatgaEIT4u36muUJMg.jpg",
               "id": 1240,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Genny",
               "gender": 1,
               "credit_id": "57f49e26c3a368054e001ce5",
               "name": "Connie Ray",
               "profile_path": "/yJriGT19J24uceLCxVLbE70pd9p.jpg",
               "id": 35517,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "NSA Agent Wilkerson",
               "gender": 2,
               "credit_id": "57f49e3c9251411c71002070",
               "name": "Tom Everett",
               "profile_path": "/nxrCAB3xL79EdWLwBUMwXj7FtI3.jpg",
               "id": 140250,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Chet",
               "gender": 2,
               "credit_id": "57f49e4ac3a368055d001db8",
               "name": "Wayne Duvall",
               "profile_path": "/zCgi06IEyC3BM36PuscNdcXCTAC.jpg",
               "id": 1470,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Ernesto",
               "gender": 2,
               "credit_id": "57f49e6cc3a368053d002045",
               "name": "Michael Peña",
               "profile_path": "/oqlIKSglghuX7kSTalODn71nlOd.jpg",
               "id": 454,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Ben, Caretaker",
               "gender": 2,
               "credit_id": "57f49e7fc3a3680559002076",
               "name": "John O'Leary",
               "profile_path": "/4DWRI16denoba5UJkwJ7jh4fH6Q.jpg",
               "id": 53552,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47479251416c75093c47",
               "name": "Peter Segal",
               "profile_path": "/sR43dLCaaPbfImGenqOwB8vcJ4e.jpg",
               "id": 13426,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47489251416c75093c71",
               "name": "E. Jack Kaplan",
               "profile_path": null,
               "id": 160243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47489251416c75093c77",
               "name": "E. Jack Kaplan",
               "profile_path": null,
               "id": 160243,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe47489251416c75093c7d",
               "name": "Richard Chapman",
               "profile_path": null,
               "id": 192727,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47489251416c75093c83",
               "name": "Richard Chapman",
               "profile_path": null,
               "id": 192727,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47489251416c75093c89",
               "name": "Peter Tolan",
               "profile_path": "/hsQpWuaVMYvfcru1lXlr0r03WJF.jpg",
               "id": 18268,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5aa5285ec3a3687c32021a3b",
               "name": "Tony R. Medina",
               "profile_path": null,
               "id": 1995913,
               "department": "Crew",
               "job": "Propmaker"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 7.93352,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17795,
      "vote_count": 56,
      "budget": 21500000,
      "overview": "They used to run the country. Now they're running for their lives! Two on-the-lam former Presidents of the United States. Framed in a scandal by the current President and pursued by armed agents, the two squabbling political foes plunge into a desperately frantic search for the evidence that will establish their innocence.",
      "similar": [
         16314,
         75,
         8839,
         9772,
         1562,
         44943,
         18885,
         9440,
         66,
         9386,
         586,
         301348,
         13969,
         302401,
         32302,
         11566,
         14844,
         10523,
         40508,
         9895
      ],
      "original_title": "My Fellow Americans",
      "runtime": 101,
      "poster_path": "/9QXLq2dcpzgrU7zUHQc6P2cuYdq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Peters Entertainment",
            "id": 16774,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Storyline Entertainment",
            "id": 8797,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-12-20",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A comedy about life, liberty and the pursuit of two ex-presidents.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Segal"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "E. Jack Kaplan",
         "Richard Chapman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117119/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MzAyODU1Nl5BMl5BanBnXkFtZTcwNDA4NDAzMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, James Garner, Dan Aykroyd | See full cast and crew »"],
      "reviews": [
         "In the 1990s there were a slew of films in which Jack Lemmon and Walter Matthau appeared together. The first two were GRUMPY OLD MEN, and it's sequel GRUMPIER OLD MEN, both of which had good box office. Then came THE GRASS HARP, which is technically one of their joint films, but is actually a dramatization of a fine novel by Truman Capote that had an excellent ensemble cast, and that only had one scene with the two actors together. OUT TO SEA was another Lemmon and Matthau romp, and finally came THE ODD COUPLE II, which was a weak (but amusing) sequel. Technically, between THE GRASS HARP and OUT TO SEA there was to be this film. It was to star Matthau as a Democratic ex-President, whose one term in office was following the one term of his rival, Republican ex-President Lemmon, and both would be followed by Republican incumbent Dan Ackroyd. But Matthau could not be in the film, presumably due to health problems. Instead, his role was filled in by James Garner. Although one likes watching the chemistry of Matthau and Lemmon in their comedies, the substitution of Garner is probably for the best. Garner's character is like Bill Clinton or John Kennedy, a ladies' man type. In fact, his wife is divorcing him during the film (we only see her briefly when he is elected President). Somehow Matthau could not have fit that type of role. The 1990s also saw several pictures that tackled the problems of the Presidency. The best of these was THE American PRESIDENT, wherein Michael Douglas tries to balance his job's duties, with his performance ratings, and his falling in love with a woman whose political agenda can be used to bash him (Annette Benning). There was also DAVE, which was a variation on an old Akim Tamiroff film THE MAGNIFICENT FRAUD, wherein a double (KEVIN KLINE) finds he must continue to play the role of the President when the President (who is corrupt) has a devastating stroke. There the double finds himself falling in love with the First Lady (SIGOURNEY WEAVER - who reciprocates), and fighting an unscrupulous, power-hungry chief of staff (FRANK LANGELLA). MY FELLOW Americans fits in with this pair of films in continuing the trend. Lemmon wins his term as President by defeating his Democratic rival Garner. But four years later Garner defeats incumbent Lemmon. But four years after that Garner is defeated by Lemmon's former Vice President Ackroyd. In the third year of his term, Ackroyd is told by his chief of staff, Bradley Whitford (ironically a member on the television series THE WEST WING currently), that a major financial scandal involving Ackroyd is about to be revealed, and will finish him politically. Ackroyd and Whitford decide to kill the scandal by framing Lemmon for taking the bribes involved. But Lemmon is tipped off about the scandal by news reporter Sela Ward (seeking an exclusive), and Garner learns of it from Democratic Party head Wilfrid Brimley (and encouraged to check into it with the possibility of being renominated for the Presidency again). When the key man in the scandal is shot and killed by a rogue CIA man (Everett McGill, in an exceptionally good, creepy performance), the lives of the two ex-Presidents are in danger. They are forced to join forces to prove Ackroyd's perfidy. They are also forced to confront each other and their own failings. The reason the film works is it forces the audience to think of what is wrong with the political system. The initial ten minutes, with it's rapid turnover of one term Presidents, mouthing the typical clichés, reminds us that our leaders (with rare exceptions) rarely do more than protect their political hides by not doing anything that would really rock things. This is similar to the situation in THE American PRESIDENT where Douglas will not confront his Republican rival, Richard Dreyfus, who is questioning the influence of Benning on the President's policies, and who is willing to make a deal to pass some cosmetic, worthless \"crime bill\" instead of tackling the pro-gun lobby. In MY FELLOW Americans the moment of truth is when both ex-Presidents learn that their mediocre policies cost a nice family their job and their home. Garner finally shows how fed up he is, towards the end, when he tells Lemmon that he is sick of thinking of how little he really accomplished in the four years he was President, and how he wants to demolish Ackroyd's corrupt administration because it is what the starry eyed believers of Democracy expect their Presidents to do. The cast was quite in the film, but one wishes Lauren Bacall had had more scenes with Lemmon (her husband in the movie), and that Esther Rolle had been in a few more scenes as the White House cook. But otherwise it is a good Garner/Lemmon comedy, even though it was to have been a Matthau/Lemmon film.",
         "I have to say that I totally disagree with the last comment I read on this movie. I think it's a very funny, well acted comedy. I think I watched it about six times in the last four years and it never fails to crack me up, I've enjoyed it as much the last time as the first time. Jack Lemmon is a great comedy actor and so is James Garner. It splashes of the screen that they had fun playing their parts. They play very well of each other. The script may not be the best written script ever, but it certainly contains a whole bunch of very funny one-liners, as well as a good deal of visual comedy. The casting is good also the supporting roles from Jon Heard, Dan Aykroyd, Wilford Brimley and Lauren Baccal. All in all it is a very entertaining film, witch I recommend to anyone who is seeking for an evening of letting all tensions gliding of you and having many good laughs. On a scale 1-10, I give it an 8.",
         "So many professional actors, so much sophomoric humor. You gotta love it. \"My Fellow Americans\" features Jack Lemmon and James Garner as ex-presidents on the run when they discover a cover-up with the present Chief of Staff (Dan Aykroyd) in the middle. This isn't a movie anyone's going to take seriously, and well they shouldn't. There are lots of moments here that will elicit a laugh or two, maybe three. And what plot there is whizzes by at such a fast pace that there's more time to concentrate on the guffaws. Lemmon and Garner play their parts as you'd expect. That they go the dumb route is no surprise; in fact, it makes their presence here all the more entertaining. Aykroyd basically plays the heavy here, so there's no real chance for him to generate any laughs. A shame, since he's usually so good at that. Then there's the fact that real gems like Bacall and Brimley and Ward are just given throw-away parts; it's good to see them, of course, but you'd figure they'd have more to do (especially Bacall!!). Kudos, though, to John Heard as the dim-witted Vice President. Some of the biggest laughs in this movie (for me) came from him. His eulogy at the funeral scene early in the movie always makes me laugh out, as does his pithy observations such as \"Hey, a hat!\". Beats me why he isn't in more movies. As I said, the laughs are there, and if you demand nothing more from a comedy than to laugh, you'll want to do your political duty and rent \"My Fellow Americans\" - the one movie that insults both parties equally. Seven stars, plus one extra for putting up an excellent \"fakade\".",
         "My husband and I both love this movie, for a number of reasons. 1. We are fans of James Garner in particular, and Jack Lemmon also. As other reviewers have noted, they play off each other extremely well. 2. In NJ, we have two former (rival)governors who share a political column. Every time I see this movie, I think of the column, where they share a grudging respect somewhat like the characters in the movie. 3. None of the reviewers have said much about the \"king among the commoners\" theme. During their cross-country trek, the two former Presidents find out who their \"fellow Americans\" REALLY are - illegal immigrants, homeless families looking for a job, gay security guards, etc., etc. That's what this movie's REALLY all about. -Earth Mother",
         "Jack Lemmon and James Garner are in top comedic form in My Fellow Americans. They, respectively, play former President Russell Kramer (Republican) and former President Matt Douglas (Democrat), who have spent the last thirty years hating each others guts. \"It's always sad when another good Democrat dies,\" Douglas says to a Secret Service Agent while on the way to the funeral. \"I believe that the deceased was a Republican, sir,\" he replies. To that, Douglas says, \"Oh. Then this might not be so bad.\" The current President, Haney (Dan Aykroyd) took kickback while Kramer was president. And Haney's trying to pin them on Kramer. Kramer and Douglas both know about it and Haney's going to try to kill them. When that proves unsucessful, Kramer and Douglas end up stranded alone in the middle of nowhere. So the two people, who loathe each other, must work together to tell thier fellow Americans while seeing the effect of their presidency on the general people. There are too many political movies. There aren't many political comedies. There are even less raunchy political comedies. In fact, it seems that My Fellow Americans should have been raunchier to warrant an R rating. Peter Segal wanted it to be ribald, but it would have been easier to write for if they didn't have an PG-13 rating in mind, so they could open up the humor a little. I really like the two leads. They had great chemistry together, I thought they actually hated each other. Lemmon and Garner had a great sense of comedic timing. The movie knew it was a comedy, but tried to take itself in a serious way, which has a great result. Other characters, however, pop up and then leave. Kay Griffin (Sela Ward), the reporter, has about two scenes, and Ben just pops up out of nowhere. It was extremely funny. Its raunch mixed in with tries-to-take-it-serious humor: \"Now, if you'll excuse me, my salad's getting cold.\" I can't really think of anything else to say. My Fellow Americans is very funny with great leads. Look for it! My rating: 8/10 Rated PG-13 for salty language and innuendo.",
         "When this film first came out, the trailers did not interest me in the least. I actually avoided seeing it so as to avoid seeing two cool actors make asses out of themselves (in a bad way). The film was rather poorly marketed, in other words. It looked like Beavis and Butthead with two old guys (in a bad way). In other words, I'm glad this was the film shown on an Amtrak train a few years back. I think I was laughing harder than anyone else in my car. Frankly, I think a few jokes sailed over people's heads. I remember in particular that the hilarious mispronunciation of \"facade\" by Dan Ackroyd's clueless VP didn't merit a titter. A few people looked at me oddly when I laughed at it. This isn't brilliant film-making, mind you. It's simply a vehicle for a lot of very talented comic actors to have fun with some ripe material. It may dip into preachiness now and again, but that is always redeemed ASAP by an entertaining round of rapid-fire bickering. On an aside, I have to say that I've been in love with Lauren Bacall since I saw The Big Sleep for the first time. It was great to see her in this and even greater to see that she still has a knack for the sharply delivered one-liner. Also, for someone born in the 20s she looks amazing. You heard me right. At 82 years, Lauren Bacall is still hot. Bogie was a very lucky man.",
         "I love this movie. It's one of the best movies I've ever seen. It's awesome to see old farts running for their lives. It's funny how they actually survive. Jack Lemmon and James Garner are great in this movie because you never know what's going to happen next with them and Dan Aykroyd makes the perfect president. John Heard was also great playing the dimwitted Vice-President Matthews. In this movie though I didn't like the character of Col. Tanner. I also didn't like the women truck driver, but I do like the characters that President Kramer and Douglas meets like Charlie Reynolds, Wayne, Genny,Carl Witnaur, Lt. Fleming, and Joe Hollis. This movie is definitely a classic. So I am sure that this fantastic film definitely gets a 10/10.",
         "Those two old pros, Jack Lemmon and James Garner, in their only film together provide quite a few laughs in what would normally be a very serious subject, a constitutional crisis. Two former presidents, Lemmon a Republican and Garner a Democrat, have a real nasty rivalry going. But when current president Dan Ackroyd tries to pin a kickback in a defense contract scandal on his fellow Republican Lemmon things get good and nasty. Garner gets into it when he starts checking on which Republican really is the crooked one and stumbles on the murdered defense contractor. After that when the two presidents are nearly killed when a government helicopter blows up, they are on the run. They are forced into an alliance of convenience. Despite this description, it is in fact a comedy with these two men who even as ex-Presidents are used to having everything done for them. Quite amusing indeed when they're forced out on their own. It's funny, but there are some trenchant comments about the state of politics and life in general in America at the turn of the new millennium. Lauren Bacall is in this oh too briefly as Lemmon's wife and Dan Ackroyd is the current president with John Heard as his Dan Quayle like Vice President. Republican or Democrat most viewers will vote thumbs up for My Fellow Americans.",
         "We just happened upon this movie a couple of years ago when looking for some movies to rent. Somehow we had missed it when the movie had been released and it was new to us. We figured with Jack Lemmon and James Garner it couldn't be too bad. We thoroughtly enjoyed the movie and think it is one of the funniest movies around. Lemmon and Garner play against one another perfectly. After seeing it the first time, we went ahead and purchased the movie. We have watched it more than a few times and have never grown tired of it. There are some favorite scenes that we still laugh about even thought we know what is coming. We highly recommend this movie to anyone who is the mood for some good laughs and even some thoughtful moments. You might not want children to see this because of language and a couple of scenes in bedrooms.",
         "Peter Segal's My Fellow Americans, a kind and genial little film, has coined the term \"Grumpy Old Presidents' over time with good reason. Had Walter Mathau been cast in the role of Democratic Governor Matt Douglas and not James Garner, we would've been calling this \"Grumpiest Old Men,\" as if it were a sequel to the inspired comedies Jack Lemmon and Walter Mathau made in the mid-nineties. But I digress. This is an equally inspired comedy, that knows its tone, knows its audience, and makes good use of its entire cast, especially its lead, Lemmon and Garner, who are unbelievably charismatic together as two bitter political rivals that have proudly clung to this white collar, boyhood way of fighting for decades now. Lemmon plays Republican Senator Russell Kramer and Garner is Democratic Governor Matt Douglas, who have both endured four years in office, first being Kramer defeating Douglas, and then four years later, vice-versa. Now incumbent Douglas has been defeated by former vice president William Haney (Dan Aykroyd) and his vice president Ted Matthews (John Heard). Up to speed? The last few years have been quite quiet for Kramer, who has been publishing books left and right and speaking at various schools and even for insurance companies. Douglas has endured a rougher road, working on publishing a book that is a sub-par effort according to his editor and is in the mix of a long divorce battle. On a plane to a funeral at Air Force One for a fallen Republican, the two men quibble all throughout the plane-ride and cement the fact to us why they have been bitter rivals for so many long years. When a serious scandal goes on that a man by the name of Charlie Reynolds (James Rebhorn) offered current president Haney kickbacks when he was a vice president, the Democratic Party plots to frame Kramer. But when Charlies is assassinated and Kramer and Douglas are put on a helicopter allegedly headed for Camp David under the order of Haney, but shipped into the middle of nowhere, the two cantankerous old presidents must learn to get along and attempt to stop the kickback scandal currently at hand in the White House. It's easy to say this film is never boring. What impressed me immediately was how dialog-driven and event-assisted this film became during the middle of its first act and how it never ceased to become lengthy and ponderous. The film uses its two men not as fiery weapons, but as human characters as they try in work through an incomprehensible situation paired with someone they are not fond of. The film continues to throw in different little twists, to keep its slender plot interesting, and never do they seem obligatory and forced. They are all little pieces attributing to the larger conflict at hand and all come to a close nicely. Writers E. Jack Kaplan, Richard Chapman, and Peter Tolan are too concerned with infusing satire into this material rather than have the characters remain presidential archetypes. Had they not gone for a more satirical effort, depicting corruption in the White House, brutal honest among elected officials, and widely different outlooks on both characters all attempting to cater to the same goal, this could've been a relatively strained, dull, unimportant effort. Yet largely because of the way the film injects little humorous quirks that make both Republicans and Democrats tick is the reason for My Fellow Americans' success as a film and as a whole. One could argue the film plays it too safe for a comedy directed at satirizing and lampooning American politics. I agree; the film relatively works in an inconsequential light and its prime goal isn't to offend or promote further hatred to one side or the other. But this could work in part of its success too, since we're so accustomed to each side bitterly debating with each other and the almost deliberate and apparent contention each side holds with one another that maybe a \"safe\" satire on politics is kind of what we need. A fun, free-spirited kind of take on the issue. It doesn't need to be completely offensive, and the film isn't always as safe as it would appear. Yet in the long run, Republicans shouldn't be too offended at the jabs at their stinginess and Democrats shouldn't be offended at the punches at their free use of money. My Fellow Americans is written efficiently and played nicely by its three writers and directed with a nice loose grip by Peter Segal, who too directed the joyously fun, quick-witted comedy that was Tommy Boy, that emphasized on the snappy worldplay that this project heavily relies on. Both films work well in the same fields, giving us two likable main characters, two talented screen-performers, an easily-digestible script, competent writing, solid direction, and overall, a cheeriness about a subject that we need and should cherish in current times. The whole exercise works on its own merits and that could be the reason you like or dislike this film as a whole. Starring: Jack Lemmon, James Garner, Dan Aykroyd, and John Heard. Directed by: Peter Segal."
      ],
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Peters Entertainment",
         "Storyline Entertainment"
      ],
      "summaries": [
         "Kramer and Douglas, two former presidents from opposite ends of the political spectrum, become reluctant allies when they become the target of a conspirator in President Haney's administration. The two ex-presidents realize they have an enemy within the government and set out to find evidence that will clear their names. The search takes them across the Southern Appalachians; along the way they meet a homeless couple, thwart kidnapers in the parking lot of a fast-food restaurant, and find themselves marching in a gay pride parade.",
         "They used to run the country. Now they're running for their lives! Two on-the-lam former Presidents of the United States. Framed in a scandal by the current President and pursued by armed agents, the two squabbling political foes plunge into a desperately frantic search for the evidence that will establish their innocence. As the scramble through the real America, they get an unexpected crash course in how their policies affected the citizens.",
         "Two former U. S. Presidents, hated rivals, join forces to expose the current, corrupt President at the risk of their lives."
      ],
      "budget": 21500000
   },
   "movielensId": 1390,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-20",
      "dvdReleaseDate": "1997-06-17",
      "directors": ["Peter Segal"],
      "runtime": 101,
      "movieId": 1390,
      "title": "My Fellow Americans",
      "mpaa": "PG-13",
      "actors": [
         "Jack Lemmon",
         "James Garner",
         "Dan Aykroyd",
         "John Heard",
         "Wilford Brimley",
         "Lauren Bacall",
         "Sela Ward",
         "Bradley Whitford",
         "Everett McGill",
         "James Rebhorn",
         "Esther Rolle",
         "Jack Kehler",
         "Connie Ray",
         "Tom Everett",
         "Wayne Duvall",
         "Michael Peña",
         "John O'Leary"
      ],
      "imdbMovieId": "0117119",
      "originalTitle": "My Fellow Americans",
      "genres": [
         "Comedy",
         "Adventure"
      ],
      "youtubeTrailerIds": ["B8NNXi4-yxQ"],
      "plotSummary": "They used to run the country. Now they're running for their lives! Two on-the-lam former Presidents of the United States. Framed in a scandal by the current President and pursued by armed agents, the two squabbling political foes plunge into a desperately frantic search for the evidence that will establish their innocence.",
      "tmdbMovieId": 17795,
      "avgRating": 3.25478,
      "releaseYear": "1996",
      "numRatings": 1727,
      "posterPath": "/9QXLq2dcpzgrU7zUHQc6P2cuYdq.jpg"
   }
}