{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt3417870",
      "video": false,
      "title": "The Price of Gold",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "5303ddf59251412195689c59",
               "name": "Tonya Harding",
               "profile_path": null,
               "id": 1233580,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "5303de0992514161a23e617a",
               "name": "Nancy Kerrigan",
               "profile_path": "/rjwHXsOa1vLdgjFxGG9HJXAh3If.jpg",
               "id": 166931,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4e179251416c911261d1",
            "name": "Nanette Burstein",
            "profile_path": "/2FSwFLtjklTI2CWiNIozXCPj3l.jpg",
            "id": 96439,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.557287,
      "production_countries": [],
      "id": 251425,
      "vote_count": 3,
      "budget": 0,
      "overview": "The world couldn't keep its eyes off two athletes at the 1994 Winter Games in Lillehammer - Nancy Kerrigan, the elegant brunette from the Northeast, and Tonya Harding, the feisty blonde engulfed in scandal. Just weeks before the Olympics on Jan. 6, 1994 at the U.S. Figure Skating Championships, Kerrigan was stunningly clubbed on the right knee by an unknown assailant and left wailing, \"Why, why, why?\" As the bizarre \"why\" mystery unraveled, it was revealed that Harding's ex-husband, Jeff Gillooly, had plotted the attack with his misfit friends to literally eliminate Kerrigan from the competition. Now two decades later, \"The Price of Gold\" takes a fresh look through Harding's turbulent career and life at the spectacle that elevated the popularity of professional figure skating and has Harding still facing questions over what she knew and when she knew it.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "The Price of Gold",
      "runtime": 78,
      "poster_path": "/sYbc74tb2r9JWXCOszqsjzHlFih.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-01-16",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://espn.go.com/30for30/film?page=thepriceofgold",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nanette Burstein"],
      "runtime": 78,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3417870/",
      "coverLink": null,
      "actors": [
         "Oksana Baiul",
         "Mahlon Bradley",
         "Vincent Buscemi"
      ],
      "reviews": [
         "This is a fascinating look at a figure skating drama that obsessed America a generation ago. Figure skating is a controversial sport (there's a whining loser at every Olympics; the most recent is no exception) largely because its judging is highly politicized, image obsessed, and often just simply corrupt. Despite recent reforms of its judging and scoring processes, figure skating hasn't changed (The Russian girl controversially won Olympic gold at the Russian hosted Olympics. Hmmm.). So a sport that appears ethereal is really just another version of scripted pro wrestling. Tonya Harding pretty much laid bare the hypocrisy of figure skating long before her ex-husband's cohorts bashed Nancy Kerrigan's knee. She wasn't the crown princess anybody in figure skating wanted as a US or international champion. She never fit the desired image. She never fit in. She got as far as she did only because at one point her talent couldn't be denied. I've never been convinced Harding masterminded or was involved in planning the attack on Nancy Kerrigan, and this film hasn't changed my opinion. Rather, I still strongly suspect she guessed immediately when it happened it was instigated by her ex-husband because of something she heard beforehand and either discounted or ignored. She covered for these losers because she did nothing to stop them. Harding appears to be happy with a family and a stable life now. As for Kerrigan, her husband (who appears in the film) was a married man with two very young children when Kerrigan began an affair with him during her preparations for the Olympics. She wasn't the sweet innocent either figure skating or the film would have us believe.",
         "Fascinating retrospective documentary on the infamous attack on US figure-skater Nancy Kerrigan in the run-up to the 1992 Olympics, allegedly planned by rival skater Tonya Harding and her entourage. In the end, Harding pleaded guilty to knowledge after the fact, not beforehand, which act effectively kept her out of prison but also finished her ice-skating career at age 24 and become remembered ever since as the trailer-trash tomboy who would do anything to improve her gold medal chances. Of course the premise is easily set up as the statuesque, clean-living Kerrigan is contrasted with the mousy, street-hardened Harding, although in truth they weren't that far apart in social class. Using loads of archive footage, the film skilfully builds up to the Olympic final, where Harding singly under-performed but ironically Kerrigan was surprisingly pipped to the gold herself. It's a shame of course that Kerrigan chose not to participate in this film, after all, she was the victim, all the stranger when her husband and manager does in her place, but I suppose that left more time for Harding to fill the space, trying ever harder as it goes on to vindicate herself, even after a so-called childhood-friend comes down off the fence near the end to find her guilty too. The film doesn't make the final judgement on Tonya Harding, leaving it to the viewer in the end to make up their own mind. Personally I find it hard to believe that Harding herself was behind such a hare-brained plot and probably got sucked in by her user-loser husband and his crowd, but sometimes she overplays her hand, especially when she tries to portray herself as the victim and significantly makes no modern-day apology to Kerrigan for what happened to her. Sport truly is stranger than fiction I guess, the irony for both is that their own names will forever be linked together over the sabotage-plot that went wrong, with Harding in particular sharing the damning infamy of the likes of Ben Johnson, Mike Tyson and Hansie Cronje. Whether she deserves this vilification is for the viewer to decide, a task this well-balanced documentary makes more difficult than you'd imagine,",
         "30 for 30: The Price of Gold (2014) *** 1/2 (out of 4) Anyone over a certain age will certainly know the story of Nancy Kerrigan and Tonya Harding. Perhaps everyone knows the story of the bizarre events where the two rivals were heading towards a showdown when Kerrigan was viciously attacked. Harding's husband and his friends were convicted of planning the attack and the big mystery going into the Olympics is what part Harding had in everything. I still remember these events quite well and over the past twenty-years I was always somewhat curious what Harding had to say on the matter. I didn't really have any feelings towards her one way or another and this includes watching her on those cheap TrueTV shows that she does. I didn't have any feelings towards her but that certainly changed after viewing this documentary. I'm not sure what the goal of director Nanette Burtstein was but if it was to make people hate Harding then she certainly succeeded. I really can't explain how much my blood was boiling while watching this film and not just because of the attack but how ignorant Harding remains about the entire thing. I try not to personally attack people in documentaries but man was this woman downright stupid, ignorant and every rude comment made about her back in the day certainly seems true today. The event was billed as Kerrigan's Snow White versus the \"White Trach\" Harding and this aspect of the story is discussed. After listening to Harding it's easy to see she still doesn't get it and it's easy to see that she's still very much jealous of Kerrigan. Listening to her badmouth Kerrigan because she wouldn't talk to her weeks after the attack is without question one of the dumbest things I've heard from anyone in my life. Again, going into this film I really didn't have any feeling towards Harding but afterwards you really can't find one decent thing to say about her. The documentary starts off trying to make us feel sorry about her early childhood but this quickly goes away once we get to the main event. There's nothing good to say about the event and Harding certainly didn't do herself any favors here.",
         "This film is about the infamous relationship between Tonya Harding and Nancy Kerrigan--mostly told from Tonya's point of view. I am not sure why this was done this way--perhaps Kerrigan simply didn't want to rehash this awful story, and I certainly can understand this if this is the case. If it isn't, I cannot see why the filmmaker gave Harding this platform--especially because she admitted in court that, at the least, she hindered the prosecution in the case. Whether she knew about the attack BEFORE it occurred or learned about it later and said nothing isn't conclusive and I am certainly not willing to guess about this. It's simply a case of 'he says/she says'. The first portion of the film is all about the career of Tonya Harding--including discussing her abusive mother and her being an outsider, of sorts, in the skating world. Much of this consisted of interviews with Harding, her trainers and friends--as well as archival footage. Oddly, Kerrigan's career was only mentioned in a much briefer and more superficial manner but the film described her as more the type of personality the skating world loved. Though, with her working class background, this seemed a bit unfair since she and Harding actually were pretty similar apart from their look and style. The next portion is about the attack on Kerrigan, the investigation, the stupidity of the conspirators as well as the subsequent competition between Kerrigan and Harding at the Olympics. Again, Harding was interviewed recently about all this for the film and Nancy Kerrigan is only shown in archival footage. As for Tonya Harding, she mostly talked about how she was a victim of the conspirators as well. And, if she was, it did make me wonder why she admitted to having knowledge of the conspiracy and pleading guilty in court. I guess that this is a tough film for me to watch compared to most \"30 for 30\" documentaries. This is because I normally have only a cursory knowledge about the topics in these films and little in the way of an opinion before seeing the films. In this case, however, I already had a strong bias as I felt back in 1992 that Nancy Kerrigan was royally screwed. I remember media folks joking about the attack and teasing apart Kerrigan's EVERY action (such as making fun of her crying when she was attacked or her comments at Disney World) even though she was the victim--and I thought it was all rather disgusting. Here, two decades later, it's all churned up again and I couldn't help but wonder how Kerrigan feels about such a documentary as well as the film's focus. It seems that without giving her a platform that the film probably shouldn't have been made--and since the film indicated she didn't want to be interviewed, I wish they hadn't made the documentary. And, for her part, Tonya Harding in these interviews really seemed insultingly clueless. Even if she was ONLY the wife of the guy responsible for this vicious attack, you wouldn't think she'd have the nerve to badmouth Kerrigan today and to demand that Kerrigan accept her as a friend and teammate following the incident like she did in this film!! Among the more egregious commends made by Ms. Harding: \"She was the cry-baby who didn't win the gold, you know. I'm sorry, I've never said this before but shut up! You got a silver medal at the Olympics...\". Clueless and annoying from start to finish. And because of this attitude and her ugly comments, I really cannot recommend this film."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History",
         "Sport"
      ],
      "productionCompanies": [
         "Asylum Entertainment",
         "ESPN Films"
      ],
      "summaries": ["The world couldn't keep its eyes off two athletes at the 1994 Winter Games in Lillehammer - Nancy Kerrigan, the elegant brunette and Tonya Harding, the feisty blonde engulfed in scandal. Just weeks before the Olympics on January 6, 1994 at the U.S. Figure Skating Championships, Kerrigan was stunningly clubbed on the right knee by an unknown assailant and left wailing, \"Why, why, why?\" As the bizarre \"why\" mystery unraveled, it was revealed that Harding's ex-husband, Jeff Gillooly, had plotted the attack with his misfit friends to literally eliminate Kerrigan from the competition. Now two decades later, The Price of Gold takes a fresh look at the worldwide spectacle that elevated the popularity of professional figure skating and has Harding still facing questions over what she knew when she knew it."],
      "budget": 0
   },
   "movielensId": 139114,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-01-16",
      "dvdReleaseDate": null,
      "directors": ["Nanette Burstein"],
      "runtime": 78,
      "movieId": 139114,
      "title": "The Price of Gold",
      "mpaa": "",
      "actors": [
         "Tonya Harding",
         "Nancy Kerrigan"
      ],
      "imdbMovieId": "3417870",
      "originalTitle": "The Price of Gold",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The world couldn't keep its eyes off two athletes at the 1994 Winter Games in Lillehammer - Nancy Kerrigan, the elegant brunette from the Northeast, and Tonya Harding, the feisty blonde engulfed in scandal. Just weeks before the Olympics on Jan. 6, 1994 at the U.S. Figure Skating Championships, Kerrigan was stunningly clubbed on the right knee by an unknown assailant and left wailing, \"Why, why, why?\" As the bizarre \"why\" mystery unraveled, it was revealed that Harding's ex-husband, Jeff Gillooly, had plotted the attack with his misfit friends to literally eliminate Kerrigan from the competition. Now two decades later, \"The Price of Gold\" takes a fresh look through Harding's turbulent career and life at the spectacle that elevated the popularity of professional figure skating and has Harding still facing questions over what she knew and when she knew it.",
      "tmdbMovieId": 251425,
      "avgRating": 3.60938,
      "releaseYear": "2014",
      "numRatings": 32,
      "posterPath": "/sYbc74tb2r9JWXCOszqsjzHlFih.jpg"
   }
}