{
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 225,
      "synopsis": null,
      "writers": ["Jim Henson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092383/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTIwMDQzNTYxMV5BMl5BanBnXkFtZTcwMzc4ODUyMQ@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "John Hurt",
         "Brian Henson",
         "Frederick Warder"
      ],
      "reviews": [
         "This is the best television series for children (and adults) ever. John Hurt is a great actor, with many excellent performances over many years, but he was born to play the storyteller. The scripts for almost every episode are superb pieces of craftsmanship, and the productions run the gamut of the emotions, being alternately funny, sad, happy, exciting, and always hauntingly beautiful. It is hard to pick a best episode from so many excellent contenders, but \"The Soldier and Death\", with its timeless pathos, is unbeatable. It is a series to watch with your children, over and over again.",
         "I remember watching this show as a kid. It made quite an impression on me, to be honest I was absolutely spellbound. Quite recently I obtained a DVD-release and was somewhat amazed: It was just as good as I remembered it! This is not simply a bad case of nostalgia, this show is definitely something above the ordinary. We might have struck gold here.. The show is in nine stand alone episodes based on nine old folktales. (Mostly Russian or German) Not so \"kidified\" as most recent versions, just a little bit cruel, but always with a happy ending (with 2 exceptions) The special effects (especially the creature effects ) still look really good even in this time of photo-realistic computer animation. If you take into account that this is a TV-production from 1987 the effects are absolutely outstanding! They give a much more living impression than many computer generated creatures I have seen of late. The actor performances are maybe not always of academy award winning standard.. but I can live with that, and most probably so can you. Not all nine episodes are masterpieces either, but some come very close to being just that. \"The Soldier and Death\" is in my opinion one of the best and appears to be the first choice of most other reviewers. \"Sapsorrow\" (their version of Cinderella) is also worth mentioning. Maybe not for it's greatness but for the most enjoyable Disney reference. Very amusing. When this was aired it had the added title: \"Stories for grown up children\" and that is a good description of what this is. Maybe not for the very youngest but perfect for anyone else. Especially anyone interested in folktales or anything fantasy-like. Highly recommended.",
         "i loved this series when i was 6 and now i own it on dvd i love it even more.The key to this(and all the other jim henson fantasies)is that if they had recreated all those monsters with a computer, it might have looked okay then but by now it would of been laughed at by any critical viewer.The stories are all so beautifully created they are extremeley hard to forget, and who said the title music was corny!! my favourite of all the stories is probably the three ravens in a close tye with the soldier and death. the only episode i dont like is hans my hedgehog, this can be forgiven as it was made as a pilot and probably had smaller budget, the camera is shakey storytellers makeup is different and hans mum and dad are two terribly annoying actors but all the rest are great buy and enjoy edward",
         "Series as a whole - Jim Henson's best work. John Hurt *is* the Storyteller. Often Oscar-caliber screenplays, not surprising when you consider Minghella doing the writing. Oscar-caliber acting, always. Sapsorrow - Everybody loves 'The Soldier and Death,' but something about 'Sapsorrow' pushes it an iota higher in my favor. In the first ballroom scene, the costumes, the music - perfection. Hurt and the dog typically semi-interact with the story, but this time Minghella pushes it up that extra notch in the 'ring' scene between Hurt and Sapsorrow. The chemistry between characters is especially well-developed, more so than usual in the series, in reference to the friendship between Straggletag and the prince. Seen it? See it again. Pay more attention (to those of you who don't fanatically adore this 22-minute piece of cinematic perfection). Never seen it? I am so, so sorry. Luck Child - not as sophisticated as Sapsorrow, but very clever in its own right. This is a story about irony. Irony upon irony, within irony... I love it. Every character is acted to perfection, with the exception of the ferryman. He was doing drama; everyone else was doing romantic comedy. I forgive him. This is my favorite of the primarily comedic episodes, 'Sapsorrow' and 'The Soldier and Death' being examples of more dramatic episodes. Side note: Greek Myths. What it lack in Minghella subtlety (different writer) it partially makes up for in boldness as it portrays the four chosen myths with more sympathy and respect and history than is usual. Also check out the Jim Henson Hour if you can get your hands on it. For Storyteller adicts, it features The Man Himself introducing the myths, the lion from 'True Bride,' and... No Annoying Opening Theme! Half Storyteller, half pure, unadulterated muppet wit.",
         "Although the Soldier's story was the best - they were all marvellous. Good stories, well told, and despite the animatronics, taken seriously by the actors. It was tucked away on Channel 4 in the UK. I missed one or two of them, but where as most rubbish gets repeated ad nausium - Storyteller wasn't. Typical. Do not miss out. If this is on - tape it !",
         "The Storyteller is a series that will age well, despite some use of primitive computer generated effects. It appeals to young and old, as long as there is still a sense of wonder and magic in the individual. It is beautifully, lyrically written and based on ancient stories that have been thoroughly researched. The actors are magnificent, as are the creatures which Jim Henson's team creates. The medieval score lends an authenticity to each episode and is thoroughly enchanting in its own right. There is a richness to the series that is not found in Disney, as there is no attempt to dumb down the stories for children. The best episodes are \"The Three Ravens\", \"Straggletag\" and \"The Soldier and Death\".",
         "Beautiful art direction, excellent editing and wonderful stories make this some of the best television ever produced. The fact that it was relatively short lived is sadly reflective on the state of television. I highly recommend snatching these up as they're released, you'll love them.",
         "Despite its pedigree, the most interesting things about this series are not the animatronics or puppetry, which, while charming, are little more than sideshows, at least in the story I saw, A STORY SHORT. In fact, loathe though I am to admit it, the programme's chief pleasure lies in that most ancient art, storytelling. John Hurt, in Rowley Birken QC-mode, grotesque, medieval make-up, relates a story about story telling, seated by the fire, accompanied by a cynical dog. One winter's day, starving and poor, he spots a fellow beggar thrown out of the Royal Kitchen by the nasty cook. The Story Teller tricks this latter into giving them an excellent soup. Furious, the Cook pleads with the King for permission to boil the villain, but, pleased with the Story Teller's wit, the monarch offers him a reprieve - for 100 nights, he must tell the King a new story: if he fails to do so, he will hand him over to the cook. The story may be old, but it's told with great gusto. Anthony Minghella's script is excellently dramatic (as befits a playwright), witty, and with some disturbing concerns beneath the fun, such as fears for the self, or the culturally self-generating power of storytelling, linked to the continuation of ideological power. For a programme aimed at children, it is bracingly self-reflexive (with little nonsense about film being the new oral culture); despite the Americanised style, there is a charming sense of medieval bustle, its grotesqueness and arbitrary terror, as well as its magic and power.",
         "I wish I could remember more of this fabulous series. My memory is patchy, but I DO remember it being one of the most inventive, beautifully made and acted series ever shown on British television. It is insanity that they don't repeat",
         "its been years since i have seen these shows. i have been searching years for anyone else that has seen these or know anything about them. i thought i made them up. the one i remember most is the soldier and death. i'd ask movie fanatics if they had seen these, mentioning its a Jim Henson and people still didn't know. these are great fables. i was very young when i was these, not even 10 and it left a lasting impression on my life and beliefs. i would recommend anyone to watch these, just remember they are from the 80's so they don't look like the movies today. just give them a shot. Jim Henson was way ahead of his time and died to early.",
         "As many people already said - this series is a one of the nicest memories of my childhood. Honeltsly speaking, i hardly remember any content of stories today - 20 years later, but it's spooky and weird atmosphere are as alive and shivering like i watched it yesterday! There are only 4 things i remember in fact: 1. the atmosphere 2. the face of the storyteller himself 3. the dog 4.the fact that it was the best children programme me and my friends ever watched. I will certainly get myself a DVD, put it on my \"top 20 shelf\", and watch it over and over again.",
         "This series is wonderful. It was bought for me when I was little, and I still love watching it. I know all the stories by heart, but I still get carried away in the magic and beauty of it all. It's hard to pick a favourite episode, but I'd have to say Sapsorrow is way up there. I guess I've always loved the pretty dresses and the mysterious way the beautiful princess transforms into a hideous creature. And the two bad sisters!- you can't help but love to hate them, and Jennifer Saunders is brilliant! And whoever said that this series is 'insane' must be insane themselves, and have absolutely no idea about culture or about the magical world of stories.",
         "I was mistakenly sent the DVD of \"The Storyteller\" by Sony (Columbia TriStar), apparently for review at DVD Town, but since Sony is one of the studios I no longer handle, another reviewer does, I was slow about watching it. Knowing nothing about this 1987 made-for-TV series, I was loathe even to put it on, thinking it was going to be so corny. But, lo and behold, every episode was wonderful! If you haven't seen them, and there are stories in all, I recommend them strongly and without hesitation. The stories are all old fairy tales narrated by John Hurt as the storyteller and peopled by some terrific British actors (including Sean Bean in one of the many tales that features a handsome Prince). The stories are beautifully told, lasting about twenty-odd minutes each. Some of them moved me unexpectedly and immensely. Highly recommended, to say the least. John J. Puccio, Review Editor",
         "\"The Storyteller\" is hands down,the BEST (and not to mention under-rated)of Jim Henson's creations!I loved every minute of it.My favorite episodes outta the bunch is \"Fear Not\",where a boy doesn't get scared until a strange occurence happens,\"The Luck Child\",where an unfortunate man has to serve a fearsome Gryphon and \"The True Bride\",where a pretty white Lion has to save the young Anja from the Troll Woman.Not to mention that there is also a really twisted version of \"Cinderella\",where the poor servant girl turns herself into a beast(!) I really wished that they have this on video!",
         "The Storyteller is excellent on so many levels. It tells fables or fairy tales from a variety of cultural sources and \"universalizes\" them somewhat for people who don't understand the particular cultural context. It's filmatic techniques are fantastic, such as the many clever segues from scene to scene. And, the creature effects are still better than anything anyone else has tried to do. The entire series is a testament to the creative genius of Jim Henson that has, unfortunately, been lost with him.",
         "Absolutely the best presentation on TV or movies of classical stories. If you want something magical you must see this. John Hurt is perfect as the storyteller as he retells the stories, often blending into them. Wonderful effects as paintings and shadows dance as the Storyteller enspells us. A definite must to own, especially if you have children, but a series *everyone* should see.",
         "Great series. Watch every episode you can. Wonderful. One of a kind. Wish they'd make more.",
         "Man, oh man... This series is one of the best I have seen. John Hurt is simply incredible as the storyteller. Here in Sweden I don't think it got enough attention, because it was called \"Sagor för stora barn\" which translates roughly into \"Stories for big children\". Sucks, huh? There are some beautifully designed creatures and, of course, the stories are timeless.",
         "Jim Henson always seemed to put out wonderful television shows. This was sadly one of the shortest lived. It was endearing to hear each tale with their delightful morals. Each episode was a new story, with new characters. John Hurt did a wonderful job playing the Storyteller, and the sarcastic tone of Brian Henson as the dog was always enjoyable. The set designs and costumes were very well done. The Muppet work, when required, is classic Jim Henson work. You know it is a Muppet, but it's endearing appearance more than forgives. You find yourself enchanted and compelled. When each episode comes to an end, you realize that you were quite entertained. An entertained that is fulfilling, not the kind that wears off after a few moments. You sit back and think about each episode, realizing that each story is indeed timeless, and presents a strong tale of morality. I have yet to show this to my own children, but this is indeed a series that is more than family entertainment. I implore you to find it on DVD, and snatch it up. If you can't do that, then just find it some how.",
         "Sadly, every single person I ask about this series says they've never heard of it. I remember it fondly from my early childhood (I wasn't quite 10 when it came out). My favorite story was \"A Story Short\". Something about the way the \"stone soup\" story was woven into a greater story gets me every time. And then the storyteller explains why he has no story to tell, and it becomes a story itself. I've always been a fan of Jim Henson, and this is just one reason why. I'm adding this DVD on the self with Labrynth, The Dark Crystal, The Neverending Story, The Princess Bride, The Last Unicorn, Willow and MirrorMask. These are all DVDs I share with my siblings who are 6, 5, and 4 yrs old.",
         "Each story has a lesson for young and old. But what more I have to say may spoil a future story. But, I believe what I have to say is for everyone; just for one particular episode: The Soldier and Death. Okay... of all the stories the one that sticks out for me is \"The Soldier and Death\" because is was the point in my life I realized that life was terminal. I am not kidding. The airing was on my 8 1/2 birthday... and I will always remember it. I didn't remember its title until tonight, but I new the synopsis. (May 15th, 1988) It is always difficult to explain that Death is a natural part in Life. It is also difficult for adults to accept that children can accept this fact. I am living proof (currently 28 yrs old) that children can accept this fact and from time to time remind adults... I write this with tears in my eyes. Heath Ledger - a wonderful actor my own age - died today. It kinda reminded me of many lessons I have learned in my life. So I write this as a reminder to Young and Old... no one is immune to whatever is in store for us. I hate to say that Death is going to happen, but this Story was the first time I saw Death as not a bad thing; but a part of Life, was quite literally in this story. I can't help it. It was a life changing moment for me and will alway be. And for that... I love you Jim Henson (and I still remember much of your work in life up until the day you died, and your memorial Muppet Show) and thank you Brian Henson for keeping the Workshop alive!!! Honest, I do thank you, all of your co-workers, editors, and interns. The stage is just a stage/ And a show is just a show/ But Imagination will create Magic/ That Forever the world will Know. Thank you!!! (And for all who doubt me... Dance, Magic Dance)",
         "I remember my dad hiring these episodes on video. My whole family loved them, and now that I have moved away from home and have my own life I am trying to share these fabulous Jim Henson creations with my Husband and stepson but as I am starting to find out not everyone is a Henson fan. Which is a pity since it means they will just have to put up with me searching for this series. But even though they don't find these interesting, I would highly recommend anybody getting hold of the Storyteller. You will be lost in a world of tales from a time when people could only talk about unexplained situations through stories and how people need to care if they were ever confronted with these situations.",
         "\"The Storyteller\" was a very important part of my childhood. Since I was a kid, I loved the way in which this series made a dark portrayal of fairy tales, in a sharp contrast with the colorful adaptations of such kind of stories I used to watch when I was a little kid. However, this series wasn't only dark, but it was also incredibly beautiful and captivating at the same time: In many ways, I think that it was thanks to this show that I started to appreciate the beauty of many other \"dark\" films and television shows that I saw in later years. Now that many so-called \"dark\" fairy tales have been released in the recent years (Like for example, that awful \"Snow White and the Huntsman\" and the \"Hansel & Gretel: Witch Hunters\") I think that it would be good for young viewers to see a magical and inspiring series like this. 10/10",
         "I am a big fan of Jim Henson, his Muppet movies, The Muppet Show, The Dark Crystal and Labyrinth are classics that still look splendid, have great music, are always entertaining, have memorable characters and show great values. The Storytellers is no exception, in fact I'd go as far to say it is one of Jim Henson's overall best in his entire career. I love all the stories. They all are wonderfully constructed, interesting and have a sense of wonder. Soldier and Death especially is filled with pathos and give The Storyteller its timeless classic status, and I adore Sapsorrow too for especially its production values in the first ballroom scene. All the characters are memorable with great, endearing personalities. The show was also beautifully written, sometimes funny, sometimes emotional yet always engaging if somewhat obscure, and adeptly directed. The Storyteller still looks great. The photography is very skillful, and the puppetry is first rate. And the sets, effects and landscapes still look splendid and rich. The score is perfectly enchanting, medieval in tone, yet both haunting and beautiful and evoking the atmosphere of each story and scene wonderfully. The acting is great, John Hurt was made for the role of the Storyteller, and Brian Henson also does a wonderful job as Storyteller's Dog. Overall, a timeless and wonderful series and it is sad to see that this series was so short-lived. 10/10 Bethany Cox"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Henson Associates (HA)",
         "TVS Television"
      ],
      "summaries": [
         "A variety of European folk tales are retold in nine new stories. A soldier captures Death in a magic sack. A fearless young man sets out to learn to shudder. A boy with a destiny that frightens a tyrant is sent on an impossible task that will see him wed the princess, or dead. A storyteller must spin tales to stay alive. A woman bears a hedgehog-child who grows up to live alone in a castle until he does a king a favor and gets the princess's hand in return. A princess must keep silent while she works to free her brothers from an evil spell. A princess runs away from wedding her father and disguises herself as an ugly forest creature. A young boy must overcome a heartless giant. A princess searches the earth for her stolen bridegroom.",
         "An old storyteller tells European folk tales to his sarcastic dog."
      ],
      "budget": 0
   },
   "movielensId": 139195,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-04-28",
      "dvdReleaseDate": null,
      "directors": ["Jim Henson"],
      "runtime": 215,
      "movieId": 139195,
      "title": "Jim Henson's The Storyteller",
      "mpaa": "",
      "actors": [
         "John Hurt",
         "Brian Henson"
      ],
      "imdbMovieId": "0092383",
      "originalTitle": "Jim Henson's The Storyteller",
      "genres": ["Fantasy"],
      "youtubeTrailerIds": [],
      "plotSummary": "An old storyteller tells European folk tales to his sarcastic dog.",
      "tmdbMovieId": 141334,
      "avgRating": 3.82857,
      "releaseYear": "1989",
      "numRatings": 35,
      "posterPath": "/jxRGSryS92ZA9PVmc777ocbW4NU.jpg"
   }
}