{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt3882000",
      "video": false,
      "title": "Microbe and Gasoline",
      "recommendations": [
         296865,
         109391,
         290544,
         334636,
         147684,
         343702,
         15342,
         128592,
         209357,
         93188,
         15436,
         14720,
         41271,
         255824,
         116231,
         344475,
         381353,
         10541,
         123243
      ],
      "backdrop_path": "/EgKMhLa2cCCBYm25yQSOB8liPP.jpg",
      "revenue": 63802,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marie-Thérèse Guéret",
               "gender": 1,
               "credit_id": "553e832e92514137f9003ae3",
               "name": "Audrey Tautou",
               "profile_path": "/pKfmpmZgH2LDPK4l1GbtnCWTukf.jpg",
               "id": 2405,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Le prof de russe",
               "gender": 2,
               "credit_id": "553e8384c3a3685c65001b36",
               "name": "Sacha Bourdo",
               "profile_path": "/atkezsosmJoUhIODou4cDdYLw0U.jpg",
               "id": 4288,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "M. Guéret",
               "gender": 0,
               "credit_id": "553e83dc925141125600e319",
               "name": "Fabio Zenoni",
               "profile_path": "/yhoAnAg6M0MbQtUzQUjmPjmMj6D.jpg",
               "id": 21668,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Le dentiste",
               "gender": 2,
               "credit_id": "553e84b9c3a3685c65001b4d",
               "name": "Laurent Poitrenaux",
               "profile_path": "/ySw61lhJqjKN0X6YMQu8r7N8pPH.jpg",
               "id": 1066144,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "L'organisateur du concours de dessin",
               "gender": 1,
               "credit_id": "553e85bb9251411435003dcf",
               "name": "Étienne Charry",
               "profile_path": null,
               "id": 1044525,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Théo Leloir, dit Gasoil",
               "gender": 0,
               "credit_id": "553e860ec3a3683c48006a39",
               "name": "Théophile Baquet",
               "profile_path": null,
               "id": 1460152,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Daniel Guéret, dit Microbe",
               "gender": 0,
               "credit_id": "553e8638c3a368784500f19d",
               "name": "Ange Dargent",
               "profile_path": null,
               "id": 1460153,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "553e827fc3a3685c65001b28",
               "name": "Michel Gondry",
               "profile_path": "/a0uLwuRoAiELs02gJhNX14WqzV9.jpg",
               "id": 201,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "553e829cc3a368784500f14c",
               "name": "Michel Gondry",
               "profile_path": "/a0uLwuRoAiELs02gJhNX14WqzV9.jpg",
               "id": 201,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.538197,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 337677,
      "vote_count": 45,
      "budget": 0,
      "overview": "Two young friends embark on a road trip across France in a vehicle they built themselves.",
      "similar": [],
      "original_title": "Microbe et Gasoil",
      "runtime": 103,
      "poster_path": "/xSIl7zldSG75nXVvtsZL7hJ2M0Y.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         },
         {
            "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
            "name": "StudioCanal",
            "id": 694,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Partizan",
            "id": 1784,
            "origin_country": ""
         }
      ],
      "release_date": "2015-07-08",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michel Gondry"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Michel Gondry"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt3882000/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjQzMTk5OTg2Nl5BMl5BanBnXkFtZTgwOTIzNzI5ODE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Ange Dargent",
         "Théophile Baquet",
         "Diane Besnier"
      ],
      "reviews": [
         "Sorry for my bad English. I wanted to write in Portuguese only to show the scope of this incredible film of Michel Gondry. At least the films co-produced by France I have been watching, seeking simplicity to tell a simpler story of characters that easily identify. This is the case here, too. Forget Gondry full of tricks is in The Science Of Sleep or Mood Indigo. Gondry just want us to know two amazing figures and this plays attention entirely on them. Sure, it's Michel Gondry. Their follies are there too. Whether in an airplane landing gear aft or own \"car home,\" but still holding on is Theo, is Daniel. It's an honest story - honest conversations, honest performances - which depicts a phase of our lives that we should not tarnish what we're building inside of us. It is without doubt the best Gondry script. The dialogs are an amazing naturalness; well placed jokes, drama in some extent anyway. It's about life, but not at any time try to understand it, but I went with it with all the questions we encounter along the way. I hope the next Michel Gondry's work is so personal and sincere as this road movie. I even love the One Mind Eternal Sunshine Spotless or The Science of Sleep, I think this idea so simple has captivated me more than I can imagine. Even Gondry understood the need to be simple, because maybe that's what it's about life. The simplicity of a friendship.",
         "Microbe is the nickname for Daniel as he is the smallest in his class. A thinker and a bit of an artist he doesn't really fit in all that well with the other kids. Then one day a new boy starts school. This is Theo and he has to help his father in his shop, so turns up at school smelling of petrol – and thereby gets the nickname 'Gasoline'. They know they are unappreciated in a sea of mediocrity with their fellow class mates but can not think what to do about it. However Theo is also a bit of a mechanic and they hit upon the great – if unoriginal idea – to run away; or rather drive away from home. What follows is a very entertaining and engaging road trip of a movie but with an awful lot of differences and some great performances too. This is well made and does have some laugh out loud moments but it is not a rip roarin comedy extravaganza. That said I really enjoyed it – director Michel Gondry manages to capture that fleeting innocence and anomie that causes kids to bond with each other – recommended to fans of European cinema and those who just like a feel good film.",
         "This movie feels a lot like Gondry channels his youth here. He may not have experienced everything that is depicted here and maybe only dreamed of certain things, but it really feels like a kids movie. Well apart from an adult drawing (a naked woman, genitals and all) that is. And while some may feel that it was unnecessary to put this in (no pun intended) the movie is also about sexuality and what \"little boys\" feel and their incapability to express certain things. There's also a self pleasuring scene, so before you go ahead and show this to your kids and then blame IMDb, me or someone else because of the stuff this has and your moral standards being different than the ones Gondry and the producers have, think twice. Just a fair warning. But if you embark on this ride, it will be a pleasure (again no pun intended). It may not be his best movie, but it could be one of his most personal ones ...",
         "Microbe and gasoline is a comedy about two teens from Versailles who decide to run away in a car they built disguised as a house. The dialogue and events can be pretty funny at times but in some other scenes it just drags on and can be a little boring. It feels like it just doesn't go anywhere until it's about 40% done. But what gives it it's feel is how it embodies the adventures kids would dream of going on, running away and doing whatever you want. But the biggest driving force of the movie is the 2 main characters and their interactions. Daniel is a lonely do-nothing wimp, until he meets Theo, a new student who is like the driving force of the duo, a confident, idea filled, wise cracker. Both characters are somewhat untouched by reality, and don't seem to realize how the world works, which only adds to their charm. Though the story is sometimes slow and boring, the characters are what most make this film worth watching.",
         "Excellent adventure/coming of age story that is both honest and very entertaining. The two boys were about as real as you get and quite delightful too. The pacing of the story was smooth and their different adventures worked well. I laughed out loud quite a few times. The photography was very natural, and the dialogue between the two boys felt real. I highly recommend this movie, especially for anyone who has less than fond memories of their early teen years. Enjoy the show. I know I certainly did.",
         "In their original context new French movies seem to be better than the ones that show up in the Australian multiplexes. It will be interesting to see if this one, LOVE or LE TOUT NOUVEAU TESTAMENT make it here. M&G is an agreeable departure. The disaffected school boy chums build a car out of junk scrap metal and are disappointed that they can't register it but they still hit the road, disguising it as a timber shack - great moment of the vehicle we thought was a write-off rolling to the rescue in a cloud of smoke. The switch to a serious ending helps the piece stay in the memory. Audrey Tatou has a minor part to further disorient the viewers."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Partizan",
         "StudioCanal",
         "Canal+"
      ],
      "summaries": ["Two young friends embark on a road trip across France in a vehicle they built themselves."],
      "budget": 0
   },
   "movielensId": 139124,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2015-07-08",
      "dvdReleaseDate": null,
      "directors": ["Michel Gondry"],
      "runtime": 103,
      "movieId": 139124,
      "title": "Microbe and Gasoline",
      "mpaa": "",
      "actors": [
         "Audrey Tautou",
         "Sacha Bourdo",
         "Fabio Zenoni",
         "Laurent Poitrenaux",
         "Étienne Charry",
         "Théophile Baquet",
         "Ange Dargent"
      ],
      "imdbMovieId": "3882000",
      "originalTitle": "Microbe et Gasoil",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["KtmsmPt01jQ"],
      "plotSummary": "Two young friends embark on a road trip across France in a vehicle they built themselves.",
      "tmdbMovieId": 337677,
      "avgRating": 3.52,
      "releaseYear": "2015",
      "numRatings": 25,
      "posterPath": "/xSIl7zldSG75nXVvtsZL7hJ2M0Y.jpg"
   }
}