{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2318158",
      "video": false,
      "title": "9.79*",
      "recommendations": [
         327016,
         211088,
         59248,
         25248,
         256836
      ],
      "backdrop_path": "/nNMjGPDDjyOPCAdHuzVHObgbX2K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4ad19251416c750ef387",
               "name": "Ben Johnson",
               "profile_path": null,
               "id": 1121623,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4ad19251416c750ef38b",
               "name": "Carl Lewis",
               "profile_path": null,
               "id": 1121624,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4ad19251416c750ef38f",
               "name": "Robson Caetano",
               "profile_path": null,
               "id": 1121625,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4ad19251416c750ef393",
               "name": "Calvin Smith",
               "profile_path": null,
               "id": 1121626,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ad19251416c750ef383",
            "name": "Daniel Gordon",
            "profile_path": null,
            "id": 89889,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.344717,
      "production_countries": [],
      "id": 142161,
      "vote_count": 6,
      "budget": 0,
      "overview": "A look into the 100-meter final at the 1988 Seoul games.",
      "similar": [],
      "original_title": "9.79*",
      "runtime": 79,
      "poster_path": "/7lbjv35841Z563uwYoLKowul4RT.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-10-09",
      "vote_average": 8.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://espn.go.com/30for30/film?page=9.79",
      "status": "Released"
   },
   "imdb": {
      "country": null,
      "color": null,
      "budgetCurrency": null,
      "directors": ["Daniel Gordon"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Daniel Gordon",
         "Nick Packer"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt2318158/",
      "coverLink": null,
      "actors": [
         "Don Catlin",
         "Linford Christie",
         "Robson da Silva"
      ],
      "reviews": [
         "30 for 30: 9.79* (2012) *** 1/2 (out of 4) Very good entry in the ESPN series takes a look at the 1988 Olympic games in Seoul, South Korea where the 100m race was won by Ben Johnson who defeated his rival Carl Lewis only to have the Gold taken from him when it came out that he was on steroids. 9.79* just really proves that it seems everyone in sports was taking steroids back in the day. With the recent stuff dealing with Lance Armstrong and the past decade of issues in baseball, it's just becoming more and more clear that the majority of people were using something at some point in their careers. This documentary not only covers that one race but also the previous years when Lewis was a king and Johnson was pretty much a nobody but we then see what happened to the two men over the next three years. What's so great about this is that director Daniel Gordon managed to interview all eight runners from that Olympic race and it was very interesting hearing from them all these years later. It's clear that Lewis is still extremely upset over the stuff while it appears Johnson has found peace with it. Fans of the sport or documentaries in general should really enjoy this as it contains some great human drama.",
         "This time we're delving into the 1988 Summer Olympics and the much-publicized sprinter's duel between Ben Johnson and Carl Lewis in the 100m final. The film is an oral history of sorts, with interviews from all eight participants in the race, but often devolves into finger-pointing and contradiction. In some respects that's revealing in and of itself - clearly, nobody wants to take any blame for the sad state of affairs that led to such a high-profile blowup, when they're each partially responsible - but in others it's maddeningly frustrating. With their athletic days now long behind them, the only thing many of these former runners have to hold onto is their legacy, and they stomp all over that by slamming Johnson for his positive test, then sheepishly fessing up to their own PED suspensions near the end of the picture. As a historical panorama, this is entertaining - particularly in the build to the race itself - but when the central debate flares up and the runners each begin painting themselves as the victim, nobody's there to hold their feet to the fire.",
         "I enjoy ESPN's \"30 for 30\" sports documentaries, though occasionally they have shown one where I really had a hard time liking any of the folks featured. This didn't make the film bad--just perhaps a bit less enjoyable than usual. \"9.79*\" is definitely an example of one of those tough to like group of athletes, as by the end I pretty much hated them all! The film is about the 100 meter final in the 1988 Olympics in Seoul. Although Canada's Ben Johnson won the race, he was later disqualified due to performance enhancing drugs. The film is about this as well as the general problem of such drugs in the 1980s. What did I learn from this film? Well, most of the finalists in the 100 meters are total jerks! Not surprisingly, Johnson makes a lot of excuses and comes off like a kid who is sorry...only after it's been proved conclusively that he's a cheater. And, he clearly is a cheater. His excuse seems to be 'everybody's doing it'--and after seeing the film, you come to think that this might be true--as MANY of the finalists were later caught cheating as well, but in other competitions. And, many of them also whine and make excuses. Overall, this is the sort of sorry group who make folks like me hate sports and watch less and less and less of the Olympics as the years pass. A great example of a bunch of pathetic 'athletes', but still a well made film. Just because these runners are weasels doesn't mean the filmmakers didn't do an excellent job!!"
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History",
         "Sport"
      ],
      "productionCompanies": [
         "ESPN Films",
         "Passion Pictures",
         "Terra Vermelha Films"
      ],
      "summaries": ["In the history of the Olympics, there's never been a controversy quite like what ensued over the 100 meter race at Seoul in 1988. The match brought together Carl Lewis (USA) and Ben Johnson (Canada) who had been fierce competitors. Lewis was known as a savvy careerist who became an American hero at the previous Los Angeles Olympics. Johnson was his chief rival, considered an underdog due to his recovery from a pulled hamstring. In less than 10 seconds, Johnson edged out in front of Lewis to win the Seoul race. But that wasn't the end. Three days later, in a reversal of fortune, the Olympic committee announced that Johnson had failed a drug test, losing his medal to Lewis in disgrace. A mystery still shrouds the race. Was Johnson exceptional in his drug usage or merely the fall guy for a widespread practice? Six of the eight finalists in the 1988 race have since been implicated for drugs -- although some still deny any wrongdoing. Filmmaker Daniel Gordon, digs into the controversy, conducting extensive interviews with Lewis and Johnson as well as their competitors, coaches and Olympic insiders. He uncovers layers of intrigue, deception and favoritism that change our perception of the way this story has previously been told. The Seoul race wound up being the world's wake-up call to drugs in sports. Now the problem runs rampant throughout professional and amateur athletics. As drug-testing gets more sophisticated, so do means of evading it. This powerful story forces us to question what we expect from our athletes as they pursue records in the name of national pride. This story from the past is vital to understanding the future of sports."],
      "budget": 0
   },
   "movielensId": 139104,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-10-09",
      "dvdReleaseDate": null,
      "directors": ["Daniel Gordon"],
      "runtime": 79,
      "movieId": 139104,
      "title": "9.79*",
      "mpaa": "",
      "actors": [
         "Ben Johnson",
         "Carl Lewis",
         "Robson Caetano",
         "Calvin Smith"
      ],
      "imdbMovieId": "2318158",
      "originalTitle": "9.79*",
      "genres": [""],
      "youtubeTrailerIds": ["sPPfYtFE6og"],
      "plotSummary": "A look into the 100-meter final at the 1988 Seoul games.",
      "tmdbMovieId": 142161,
      "avgRating": 4.33333,
      "releaseYear": "2012",
      "numRatings": 3,
      "posterPath": "/7lbjv35841Z563uwYoLKowul4RT.jpg"
   }
}