{
   "tmdb": {
      "original_language": "nl",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "gothic",
            "id": 33505
         }
      ],
      "imdb_id": "tt1859603",
      "video": false,
      "title": "The Guest House",
      "recommendations": [
         186579,
         381108
      ],
      "backdrop_path": "/8ZdXO2uLZFo6gFf2T0kQEgzA13x.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe4bbac3a36847f82117f5",
               "name": "Ruth Reynolds",
               "profile_path": null,
               "id": 1065754,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Amy",
               "gender": 1,
               "credit_id": "5ac4894a9251416018084335",
               "name": "Madeline Merritt",
               "profile_path": "/565B6611IpfhzC0qhofaDiJX9W8.jpg",
               "id": 1183608,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4bbac3a36847f82117fd",
               "name": "Tom McCafferty",
               "profile_path": null,
               "id": 180066,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe4bbac3a36847f8211801",
               "name": "Jake Parker",
               "profile_path": null,
               "id": 89560,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bbac3a36847f82117eb",
               "name": "Michael Baumgarten",
               "profile_path": null,
               "id": 226342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bbac3a36847f82117f1",
               "name": "Michael Baumgarten",
               "profile_path": null,
               "id": 226342,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Romance",
         "id": 10749
      }],
      "popularity": 0.810519,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117618,
      "vote_count": 13,
      "budget": 250000,
      "overview": "Before leaving for college, a recently dumped goth girl's life changes forever when she falls in love with a smart and professional college grad who is staying in the family's guest house.",
      "similar": [
         24420,
         1259,
         258480,
         1643,
         339397,
         17612,
         1024,
         50546,
         46705,
         13,
         38,
         86331,
         19913,
         272693,
         114,
         319,
         449176,
         401898,
         398818,
         1903
      ],
      "original_title": "The Guest House",
      "runtime": null,
      "poster_path": "/cJP4NTlvMJJ69vry11nAw5DUBU6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wolfe Releasing",
         "id": 5537,
         "origin_country": ""
      }],
      "release_date": "2012-06-18",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "Love has its own place",
      "adult": false,
      "homepage": "http://wolfereleasing.com/info/title/guest-house-the/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Baumgarten"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Michael Baumgarten"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1859603/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ2MTIyNTM0OF5BMl5BanBnXkFtZTcwOTEwNjA4NA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Ruth Reynolds",
         "Madeline Merritt",
         "Tom McCafferty"
      ],
      "reviews": [
         "Let me enumerate my issues on this topic: 1) There is zero chemistry between the stars. I cannot stress this enough. I could not believe in their love because neither seemed to be in love. It was almost like two heterosexual actresses pretending to be lesbians. 2) There is never a single touch beyond kissing (even the kissing seemed lifeless) except a close up of an ass with 2 hands grasping it. Once the ass was wearing jeans, the other time it wore panties. All of the touching was PG and, judging by the lack of sexual chemistry, I doubt it was even performed by the actresses. 3) There is never a nipple, or the tender caress of a breast or naked ass. While I can appreciate that I do not need to see full frontal nudity, I think that some semblance of physical intimacy would be a must. 4) NO WOMAN ON EARTH would have naked, wild, passionate sex in a bed and fall asleep in her lovers arms THEN wake up the next morning wearing a bra and panties. WOMEN DO NOT wear a bra to bed. BOTH of these two woke up sometime during the night, put a bra and panties on, then got back into the bed to snuggle and sleep. 5) If I give my female partner oral sex in a jacuzzi, i have to actually submerge my head below the level of her belly button and remain there for more than 5 seconds. 6) I have never been in a club where a singer is performing and been able to hear a pin drop....unless the place was empty. Apparently LA and San Fran are full of unique little places like that, because it happens twice. All in all....it was contrived, poorly acted, and atrociously written. It would have been more inspiring if played by the cast of Team America: World Police. It really seemed like it was a Lesbian movie, written by ultra conservative religious zealots to show how insipid and banal lesbian relationships are.",
         "The Guest House is not, by any stretch of imagination, a \"good movie.\" However, it is an enjoyable, easy to watch romp in lesbian fantasy-land. If you are looking for flowing dialog, lack of cliché's, though- provoking storyline conflict, then this film is not for you. However, if you would like to check out of the real world for a while, and watch two beautiful women fall in love Romeo and Juliet style (minus the suicides, plus the sensual sex scenes) then by all means, this film is worth your time. Sure the plot is predictable. Sure the dialog is a little clichéd. And I'll admit, the giggles are a little annoying. But sometimes, that's all you want in a movie, right?",
         "I would recommend you gouge your brain out with a spoon if you still want to see this movie ... acting is terrible story is already predictable and the production quality is dismal to say the least The movie starts off with slow pace and promising beginning but meanders and loses course in mid you can guess the ending straightforward ... well the lesbian scenes are sensuous but I m guessing if I really want some good soft core pornography i would rather order a DVD than waste my time on it which makes me wonder why i wasted 1hr and 22 min of my life on this utter piece of crap ... well perhaps to warn you good folks to save your time and mind",
         "Worst acting I have seen possibly ever. I could not bring myself to watch more than 15 minutes. I'm shocked I made it that long. God awful. I seriously don't know how these actors could be so unconvincing. It's not even mildly entertaining, because the poor acting is so distracting and annoying. Also, the dialogue is pathetic. Trite garbage. The characters are out of the box, unimaginative, and two-dimensional. I don't know why anyone would waste the money or time to make this movie. I would highly advise you skip this one. I am never motivated to write a review of a movie, but I needed to let others know that watching this is a complete waste of a couple hours of your life. I hope that helps illustrate just how horrible this movie is.",
         "Okay, not only is the movie fully predictable(you know the end about 5 minutes in) the acting is absolutely awful(absolutely not convincing) the actresses are trying to convince you that there is a connection when there really is nothing at all, the dialogues are cliché, and redundant. It'a all marshmallow and sweet and vanilla....but, the story...I mean...falling-no wait- being in love, after knowing the person for a day? being a couple after a day, breaking up after 2....WHAT? How is that a story you can relate to? I know, people talking about love at first sight but...this isn't it...somebody explain how this got good reviews...I am a lesbian, yes the girls are kinda sorta cute, but that doesn't cope for the rest... the story and, the whole movie, is nothing close to good...",
         "This movie is HORRIBLE. The acting was so bad. If I could give it negative stars I would. I was pretty excited about the plot at first. I love movies about forbidden love. I was extremely let down. The love scenes were so awkward and totally fake. I know it's all acting but come on at least try to seem interested. I've seen elementary school plays with better acting. I'm so glad I watched it on Netflix. If I spent any sort of money on this movie alone I would have been upset. Don't waste your time! Watching paint dry would be a better use of time than watching this movie. The only character I liked was the boyfriend in the beginning. He was actually really funny. He wasn't supposed to be funny though so he did a terrible job acting as well. I don't know how (or why) but I managed to sit through the entire thing. I guess I was hoping it would get better? It didn't.",
         "I have never seen more terrible acting in my life, the lines are awful, the sound is awful the whole \"film\" is as amusing as watching 2 snails completing a 10 mile race, i will never forgive this film as it has robbed me of 1 hour and 20 minutes of my life. The people that made this monstrosity can not make a film, they are possibly the most terrible film makers in all of existence and i would really like to know what they were thinking when they made this pile of sh*t I am begging anyone watching this or myself from the past to not watch this, you would have more enjoyment just staring at a blank wall for 2 hours and it would most likely be more productive. 0/10 would not watch again.",
         "Seriously. The acting isn't perfect, but I fell in love with these characters, maybe it's because I'm a lesbian, I know love isn't perfect, and it comes in all shapes, sizes, orientations, ethnicities, and religions. Love isn't biased. This movie shows you that even while someone is suffering, someone else is able to help them overcome that by love. It's quirky, sexy, honest, and open. I LOVE it. Honestly, I think the only way to truly understand this movie, is if you're a lesbian. I love my gays, and y straights. But only lesbians understand lesbians, or bisexuals. Etc. if you're not into that, it's not the movie for you.",
         "Great movie. Pretty good acting. If you're looking for something to look at with great chemistry and soft core sensual lesbian scenes then go for it. It has a great ending and I hope for a part 2 :)It's something cute for a movie night with your girlfriend and the explore each other deeper than just in the sheets. They try to learn about each other before anything happens which is astounding since some movies don't do that they just skip straight to the sex which gets old fast. However, this movie I was engaged and intrigued throughout! Great storyline. I just wish the acting was a bit better. Hopefully they'll make a part 2 and it'll have better acting, an even better storyline, and a better insight on a lesbian relationships",
         "The worst part of this movie was the production value. It honestly seemed like a high school student made this movie for a project. The camera work and angles were horrible and even the sound was off. The acting, while not stellar, wasn't as bad as I thought it would be. There are really only about four characters in the film. Two of them are atrocious, one is just bad, and the other is actually fairly decent. The plot is also not terrible. There isn't much that goes on but if the acting and camera work were better, it would actually be a solid, intimate story. Overall, this isn't a good movie but with a higher budget it could be more watchable.",
         "Just that - in any way. The story is so that you could actually make something out of it and the film manages to fail miserably in every regard. The acting is beyond bad - not for a second did I feel any authenticity in both actresses' play (or any other character for what it's worth). And the sex scenes are so forced as to show not the tiniest bit of possibly bawdy nudity that it's just grotesque. Granted, not every movie with a girl-girl story can be \"Room in Rome\", but please, if you actually feel that the actresses' biggest concern during a sex scene is not to show an uncovered breast, just leave it out. And the fact that Rachel and Amy wake up in the morning after spending their first night together wearing bras and panties does not really help there too. Besides, there are movies with very sensual and authentic lesbian love scenes that do not include full nudity (such as \"I Can't Think Straight\"), so it's very well doable. But again, you would need good actresses for that. The movie has a single decently funny scene - that is when Rachel's ex-boyfriend calls and accuses her of having stolen her phone. That is 60 seconds where the movie actually produced an emotion in me in the form of a smile. The rest is simply awkward. I sat through the whole thing because I made it a principle to always finish watching a movie after I started it. Had it not been for that, I would have turned it off and forgotten about this thing after 10 minutes into the movie.",
         "There are worse films out there I suppose, but where \"The Guest House\" falters is not its production values or low budget, but the fact that the love story between the two characters is so empty and their affection is so forced. I don't know if these women were uncomfortable with the homosexual aspect, if their acting was just *that* bad, or if the director had an unnatural vision of what women in love really looked like. They would go from sweet nothings to forceful, aggressive making out; they would be having a random conversation about life and suddenly one of them would pounce on the other...lesbians or not, *people* don't do this. There was zero sensuality during any given encounter. No tenderness no softness, no sweetness. It was more like drunken lust, but even all the a** grabbing and rough kissing looked awkward and struck me as that of rushed, groping teenagers. The end result comes off as attempt at eye candy under the guise of of male's vision of what two women look like. Now I *might* could suspend belief long enough when it came to this weird forced eroticism if the rest of the story had been convincing...but it isn't. Apart from the the father, there is absolutely NOTHING driving the plot. These girls fall in love with each other in a complete vacuum. There are no friends around, no jobs to go to, no competition for affection, and no parents aside from the last few minutes. Nothing really happens - there's nothing to drive their relationship forward or test their limits or to develop them as characters that we can care about, relate to, and understand. Really, how much of a story is there about two people falling in love who are almost completely cut off from the outside world? About the time that the film would've gotten interesting, when the couple hits their \"speed bump\" in the form of dad, we cut a few months later, gloss over it, and everything's fine. Even when the film gives us conflict, we don't really get any. The dialog is pretty bad too, and this ties back into nothing much of any interest occurring. The writers try to give the girls character through these long winded conversations amounting to \"what's your favorite color\" for half the film which is painful to listen to. After some skin we move over to mostly endless pillow talk. And it never lets up. These ladies communicate through the most banal remarks about how much they love other. What they sound like are, like the sex scenes, uncomfortable teens. They don't really know each other so they make nervous small talk that is unbearable. And so we have what might look like a sweet little love story that ultimately has very little humanity left in it. We don't know the characters, their story happens outside of real life, and there's just nothing for the audience to connect with. A real love story, between 2 people of any sex, should be able to speak to anybody (except perhaps the severely homo or heterophobic) because we're able to relate to how they get to know each other and their search for happiness. But that vibe just isn't here. There is nothing to hang on to, and what's left in its stead is almost impossible to sit through.",
         "So this love story happens over a weekend. I mean there is nothing wrong with a story about love at first sight but this just felt really forced. So the browned haired woman( can't remember her name) moved into her bosses'guest house and immediately starts to have really private conversations with her bosses's daughter, the blond hair goth girl( again cannot recall her name). Not only that, she also showers in front of her. This in itself would be inappropriate but okay..... Then they film each other for hours with Canon hand-held cameras. Which could have been a nice idea and a creative way to save money, if it was done in a better way. But they just keep talking and talking, i think they told the actors to just improvise. This only works, if you have really good actors( will come back to this later). Then they have sex but they way they have sex is the funniest part of the whole movie. They are portraying this \" passionate love making\" but both of them constantly make sure, that you cannot see their nipples. Followed by more sex and a hilarious scene with the ex boyfriend. Later they go to concert and i wonder if the people that made this movie, have ever been to a concert. The audience sites down listens, nod( because they approve of this great music!!) and only once the music stop, will they applause and continue talking. Rock n'Roll!!!They get a tattoo and the blond goth girl that already has a Tattoo ask, if it hurts. She later sings a terrible song, that goes on for hours .Oh yeah and after that great and necessary song, they have sex. The dad comes back and goes into the guesthouse to surprise the brown hair girl with a breakfast and here is the shocking twist, the dad and the brown hair girl had a one night stand! What? What? This makes no sense! A) You are not suspicious at all that ONS lets you work for his company and that he lets you life in his guesthouse which is on his property B) okay let's imagine that the brown hair girl is really naive, then why don't you try to keep a distance from his daughter? She never tried to keep a distance. She is the one showering in front of her, she is the one telling her that she think is cute. You never notices that she was in a moral dilemma C) let's even ignore this fact and imagine that the brown hair lady forgot about everything that happened. The dad still knows. He is a successful business man so he needs to be good in planning. So he hired his ONS let her live in his guesthouse which is on the property because he thinks that he still has a shoot with her. While a little over the top, still somehow makes sense. What dosen't make sense is, that he goes on a business trip when she arrives. Why didn't't he invite her to the business trip. He is more likely to hit that in a hotel room then in house with his daughter around. I mean yeah might have been strange, but not as strange as having your new employee spend a weekend with your 18 year old daughter. Especially if you want to seduce her!! That story makes no logical sense, the characters motivation even less. Especially as most of it, happens over a weekend. Acting: Boyfriend: I don't know if he was suppose to have such a poor line delivery and over the top acting or if this was just poor acting. If it was on purpose, kudos to the actor. You really succeeded in pretending to be a terrible character. Blond Goth Girl: She was better then the brown hair girl but that is not saying a lot. i think that this is what 50 year old people think a teenager behaves like. Furthermore, i don't want to discourage anyone but maybe you shouldn't' consider a career in singing and/ or acting. Brown Hair Girl: Don't look directly at the the camera!! So many times when she was suppose to be looking at the her partner, she is looking directly at the camera. Like staring at it. Also when she had her dramatic scene at the end( the one you can see her nipples), at least try to cry, if you can't then hide your face in your hands so it looks as if you are crying. Anything besides what she did. Dad: Just terrible Camera I am not a big expert on Camera work. I don't care if people use certain angles, zoom out or in too much but even i notices that the camera work sucked. In the beginning it looks okay but sometimes it looks like someone was filming it on their own home video camera. This excludes the scenes, where the two ladies were filming each other. Especially the shower scene is shot in a really wired angle. It appears that the two woman were in two different rooms. They could have shot the scene in two different locations which is fine if the scene wasn't't suppose to take place in the same room to build erotic tension. So in conclusion, this movie isn't good and i am not going to give it a pass because it is a lGBT movie and because of the low budget.A low budget has no impact on the plot or the acting. The movie had potential but sometimes a good idea isn't enough. PS: You do see nipples 10 minutes before the end.",
         "I wish I'd read some of these reviews before watching this very frustrating movie. The acting was wooden, the script/plot toe-curlingly poor. I've seen better acting in porn films. This travesty of a film would have redeemed itself if there had been some real sex and straight forward nudity. I can only imagine that, by not showing all, the director thought it was elevating the film to that of a proper romance, but he would have needed a decent plot and some proper acting to do that. They should've gone all out for a proper X-rated full-frontal romp and then it would have at least had something to redeem itself with, because I should imagine that most people coming to this film would be wanting to see that.",
         "This is the first movie that I have rated, frankly it's because I was disturbed at how critical and ruthless other people were when it came to rating this movie. I gave this movie a 10 because it made me feel good and I walked away smiling and pondering the good things about relationships and second chances at not losing a love to time or bitterness. So it has a predictably happy ending. So? As far as falling for someone in the span of a weekend... ...I have, and so I feel sorry for those people who cannot or have not experienced that type of engulfing infatuation that it can bring, regardless of whether it lasts or not. Also, I really liked Ruth Reynolds acting and her portrayal of her character. Good Job."
      ],
      "genres": ["Romance"],
      "productionCompanies": ["Baumgarten Films"],
      "summaries": ["Before leaving for college, a recently dumped goth girl's life changes forever when she falls in love with a smart and professional college grad who is staying in the family's guest house."],
      "budget": 250000
   },
   "movielensId": 139239,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-06-18",
      "dvdReleaseDate": null,
      "directors": ["Michael Baumgarten"],
      "runtime": 0,
      "movieId": 139239,
      "title": "The Guest House",
      "mpaa": "",
      "actors": [
         "ruth reynolds",
         "Madeline Merrit",
         "Tom McCafferty",
         "Jake Parker"
      ],
      "imdbMovieId": "1859603",
      "originalTitle": "The Guest House",
      "genres": ["Romance"],
      "youtubeTrailerIds": ["mqr_2U7gaOU"],
      "plotSummary": "Before leaving for college, a recently dumped goth girl's life changes forever when she falls in love with a smart and professional college grad who is staying in the family's guest house.",
      "tmdbMovieId": 117618,
      "avgRating": 2,
      "releaseYear": "2012",
      "numRatings": 4,
      "posterPath": "/cJP4NTlvMJJ69vry11nAw5DUBU6.jpg"
   }
}