{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "man vs machine",
            "id": 312
         },
         {
            "name": "truck",
            "id": 9276
         }
      ],
      "imdb_id": "tt0120380",
      "video": false,
      "title": "Trucks",
      "recommendations": [
         147128,
         89940,
         47662,
         36560,
         105401,
         47044,
         49231,
         390991,
         161620,
         47628,
         153998,
         39862,
         63706,
         79678,
         20125,
         84942,
         94540,
         35664,
         48836,
         114740
      ],
      "backdrop_path": "/xFCHIhL7u0o30f42g3vaMK1zv3s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4e5",
               "name": "Timothy Busfield",
               "profile_path": "/8sQr5B1h0wJ4kOcTgwWyCDfzzYq.jpg",
               "id": 23881,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Hope",
               "gender": 1,
               "credit_id": "52fe47059251416c7508b4e9",
               "name": "Brenda Bakke",
               "profile_path": "/nhTQaWKjWnTpYvTN1Le8piHTN0w.jpg",
               "id": 32290,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Trucker Bob",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4ed",
               "name": "Aidan Devine",
               "profile_path": "/aq6ZhaqQnhQnvHOtdyeeNSVuPNR.jpg",
               "id": 237,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Thad",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4f1",
               "name": "Roman Podhora",
               "profile_path": "/bsLXnsfdwKkeQw7Q6vCFb5SD2Wv.jpg",
               "id": 55588,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4f5",
               "name": "Jay Brazeau",
               "profile_path": "/oSFswqMxjLCAwVpEG2yK6NzLUiP.jpg",
               "id": 63791,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Logan",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4f9",
               "name": "Brendan Fletcher",
               "profile_path": "/pt6kjBmnhamO1nvc1YqX3AczYpS.jpg",
               "id": 32205,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Abby",
               "gender": 1,
               "credit_id": "52fe47059251416c7508b4fd",
               "name": "Amy Stewart",
               "profile_path": "/s2oxa3wfJ13dYFP2s2aQygQfooa.jpg",
               "id": 27561,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe47059251416c7508b501",
               "name": "Victor Cowie",
               "profile_path": null,
               "id": 81238,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "June",
               "gender": 1,
               "credit_id": "52fe47059251416c7508b505",
               "name": "Sharon Bajer",
               "profile_path": null,
               "id": 81239,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4d5",
               "name": "Chris Thomson",
               "profile_path": null,
               "id": 81237,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4db",
               "name": "Brian Taggert",
               "profile_path": null,
               "id": 64821,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47059251416c7508b4e1",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.40964,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 17100,
      "vote_count": 22,
      "budget": 0,
      "overview": "Based on the short story by Stephen King, this tells the tale of trucks suddenly coming to life and attacking their owners.",
      "similar": [
         605,
         604,
         9980,
         603,
         8810,
         296,
         12244,
         9659,
         19,
         622,
         241239,
         2048,
         62,
         46705,
         664,
         9584,
         9323,
         334074,
         4597,
         6978
      ],
      "original_title": "Trucks",
      "runtime": 95,
      "poster_path": "/n3RMGYD47AVh69YSyMENvCWL8KX.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Credo Entertainment Group",
         "id": 3254,
         "origin_country": ""
      }],
      "release_date": "1997-01-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Thomson"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Stephen King",
         "Brian Taggert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120380/",
      "coverLink": null,
      "actors": [
         "Timothy Busfield",
         "Brenda Bakke",
         "Aidan Devine"
      ],
      "reviews": [
         "If you're looking for a horror movie so bad that you are reduced to laughter, then Trucks is for you. If you're looking for a 'good' movie, you're in the wrong place. Check it out, and pay special attention to my favorite character, the little remote controlled truck - vicious little guy. Think a low budget Maximum Overdrive. It's not well written, well acted or even a well conceived idea, but it's fun if you're looking for a laugh with friends. It's possibly one of the worst movies I've stumbled across at the video store. I enjoy introducing my friends to the wonder that is the ridiculous level of idiocy in this movie. Grab some popcorn and enjoy.",
         "Director Chris Thomsen does superb work in bringing the Stephen King story to the screen as a truly exciting work of cinema. With excellent special effects and stunning cinematography, this is what King's own directorial effort with Maximum Overdrive should have been. Here, King's vision is fleshed out and fully realized as never before. The cast is terrific as well, with Timothy Busfield giving one of his most powerful performances. The tension is unrelenting and beyond endurance at times but those who stay with this fine film until its shattering climax will be richly rewarded by the incredible cinematic experience that is Trucks.",
         "It's not a remake of Maximum Overdrive, it's an unmake - what that film should have been. Trucks is based pretty closely on the short story, which is one of King's best in his Nightshift collection. The action is constant. It never lets up. And for a TV movie, there seems a lot of explosions, or budget in other words. Apart from The Car (1977), or Killdozer (1974), it's a unique movie - well, trinique - being the only films of vehicular possession that I recall. Woops I forgot Christine (1983). Quadnique. A few times it snaps reality, when, I think, adding ideas King maybe didn't. It was a relief and pleasure seeing the ideas King developed faithfully appear as the movie progressed, making me remember the story I read ages ago. The acting, especially at-times-terror-stricken Timothy Busfield, and character, is de-fine. And about the people who can't believe it, or the intriguing and various hard trying attempts at explanation, which added more fun, depth, and reality to the black magic of the story, I think of what Stephen King said when he heard of people who can't believe in these stories: I feel a kind of sadness. Now if they just unmake The Mangler in the same way, which was the best story in that book...",
         "This movie is based on a Stephen King short story which surprisingly isn't about a writer in Maine who is stuck for ideas, which is his usual hero. Instead there's some people in a truck stop who get menaced by trucks that come alive. Already you've got a plot that wouldn't look out of place in a Garth Marengi novel. In the short story there is little explanation as to why the trucks have turned hostile and that kind of works, well it works better than any explanation a rational person could come up with because it's patently a bit silly. Better to just leave it as a mystery hey? So what does the movie do? Delves right in there looking for answers. Various explanations come up, each more risible than the last. One fat guy thinks the trucks have come alive because of pollution or something, someone else thinks its to do with aliens. What I love best about the explanations is the way the actors look totally shamefaced as they say their lines. They know this is the lowest point in their probably now dead careers. You've already got one shiny nugget of comedy gold right there even before you factor in the bad acting but wipe it against your sleeve and you'll see it really shines with much more. A guy gets attacked with the most rubber looking axe in the history of film making. Honestly, I swear I had to watch that bit five times. Another guy gets attacked by a toy truck he could easily drop kick across the street and has to pretend to be knocked over so it can ram him in the head a few times. This is priceless straight-faced comedy the like of which you rarely see these days. It's so poor it really deserves a 1 but I can't bring myself to give it less than 2 because it made me laugh so much. If you love bad movies this one needs to be on your shelf. I would love to have seen Stephen Kings face when he first saw this aired.",
         "Stephen King's sole directorial effort MAXIMUM OVERDRIVE (1986) apparently wasn't silly enough (or didn't bomb hard enough) to kill the will of producers to remake his short story \"Trucks\" just over a decade later. In this incarnation, folks are held captive by the title beasts in a rustic truck stop run by Ray (Timothy Busfield). This was made-for- TV with a low budget and is decidedly less goofy so one has to wonder, \"Why bother?\" I mean, outside of the obvious, \"We'll put Kings name on it and make a ton of money.\" The cast of mostly Canadians is fine and the illogical scenes are abound (if machines are turning on you, why is your plan to ride a motorcycle to steal a helicopter from the Army base? ). The funniest bit is a truck using its mirrors to spy on someone and then trying to play it off when someone catches it. And since when do cars with unexplained sentient powers need to see from the driver's viewpoint? There are a few gory and unrelated kill scenes that look like they were added in post-production, seemingly confirmed by an \"additional scenes\" end credit. Interestingly, they were produced by William (SCARECROWS) Wesley.",
         "A group of people at a truck stop are terrorized by possessed trucks. This is another attempt at Stephen Kings' short story. But this time,with few exceptions, only the trucks are possessed. No evil electrical knives.pop machines, or arcade machines. Its not as entertaining as Maximum Overdrive,but it is still interesting. Except, we still have truck drivers who cant out think or out maneuver a bunch of lumbering trucks. Bob and Pete;quit looking at Hopes' ass,get out there and start puttin' crowbars in radiators. Then blind them by smashing out their headlights. A running man can accomplish this in no time flat. Gene Pyrz drives the Western Star 18 wheeler. An Unknown Actor drives the Freightliner chemical big rig. That Unknown Actor and Gene Pyrz are permanent A list actors. Brenda Bakke and Sharon Bajor are hot. Brenda Bakkes' performance was outstanding!! erldwgstruckermovies.com",
         "You heard me. It's so bad. The way the cars honk at each other to communicate will make you laugh. If you want to see a movie where a spirit possesses an unmoving object and kills people, see Child's Play. Don't waste your gas seeing this movie (pun intended).",
         "Why bother re-making 'Maximum Overdrive'? This is just another of the universe's imponderables, but stick with this movie, your patience will be rewarded with what must be the funniest movie death ever: a gormless mailman is battered to death by a Tonka toy, and the gore sprays like raspberry jam from a doughnut. In the cast is the marvellous Brendan Fletcher, one of the finest actors of his generation, and again the question recurs:WHY WHY WHY?",
         "Trucks does stephen king very little justice. It is a film about a small town of people terrorized by unmanned trucks. It is basically a standard length movie, it is compiled of a cast including sharon Bajer and Jay Brazeau. It also has a notable Cameo of Alexander Cowan who is the lead guitarist in the group \"Michelle Bear\" This film has a number of parts which somewhat resemble maximum overdrive, including the truckstop e.t.c. But I watched this film and now that it is over I am anxiously awaiting a sequel.",
         "Trucks! \"U-Turn U-Die!\" More like \"U-CRAP U-WORSE THAN 2FAST 2FURIOUS\" If you watch this film you will want to shoot the television. If you are a Steven king fan you will want to shoot the television and shoot the producer. If you like the story however, you will still hate this movie. One could say that it is not a bad movie, in the same way Hitler was fond of fluffy kittens and donating to charity. This film is terrible, but it has one strong point, it has the temptation no other crappy horror film that i have ever seen has. It makes you want to keep wasting it. Hit it with an axe. Time and time again and you will never get bored.",
         "What do you say when you seem to be one of the few people who enjoyed a particular film, and everone eles loathed? I loved the acting, the charecters and the action scenes, but so many others have blasted this film. I guess all I can say is, rent this one and see what you think. It's definetly worth a look, at least.",
         "I'm sorry to say this but, this movie is one of the worst movies I've seen so far. And that includes the movie with the magic crab that brings you loooove ... I'm a BIG Stephen King fan (Much to my brothers discomfort), and I defend him EVERY single time my bro tells me that he's the \"King of bad-horror movies\". Because that's not true, and Stephen King so does not deserve it. But this movie, it's just .. a bad horror movie. But then again, I'm not sure that he has so much to do with this movie, more than that it's his story it's based on. But hello, honking trucks that can drive their self and want to kill everything in it's way, I just don't find it scary, I Actually find it hilarious. But that's just me. But I practically laughed my ass of for an whole half an hour because of this film. And I think, the funniest must have been all the roaring the trucks did, it was freaking hilarious! But there was one great scene thought, the one with the plastic toy truck kills the mailman. I loved it. I just loved it. I bought this movie not knowing exactly what it was about, and buying it, it something I really don't recommend if you're not a big Stephen King fan. But I give it credit thought for the good laugh, and maybe the 1 or 2 so good scenes. Dear brother, and everyone else out there who wants to teach us Stephen King fans that he suck or anything else. It's so not worth it, so don't bother, because we wont listen. Right guys?",
         "Trucks starts in a junk yard just outside the small American town of Lunar whose only claim to fame is that it is located near the infamous Government/Military facility Area 51. As Phil (Harry Neeken) the owner goes about his business an old rusty wreck of a truck suddenly develops a life of it's own & kills Phil. A short time after a large refrigerated truck seems to take control of itself & locks it's driver (Gene Pyrz) in it's trailer & sets off for the nearby town of Lunar where the local mechanic Ray (Timothy Busfield) his son Logan (Brendan Fletcher), two truck drivers Bob (Aidan Devine) & Pete (Rick Skene) are trapped inside the towns diner run by George (Victor Cowie) by the numerous trucks that have gathered & now circle outside ready to run anyone down stupid enough to leave the diner. Meanwhile a guide named Hope (Brenda Bakke) & three hikers on a camping trip Jack (Jay Brazeau), Thad (Roman Podhora) & his young bratty daughter Abby (Amy Stewart) stumble across Phil & are almost killed themselves by a truck, upon their return to Lunar & the diner they discover that all the trucks in the area seem to have a life of their own & aren't friendly towards humans... This Canadian made-for-cable TV production was directed by Chris Thompson & is pretty average stuff although I liked it in a dumb sort of way, I suspect the only real reason I say that is because I was in a good mood when I watched it. The script by Brian Taggert based on the short story by Stephen King has obvious similarities to King's own Maximum Overdrive (1986) & in fact could easily be described as a remake. A remake of Maximum Overdrive? Great, just what the world needed! I will say no more & concentrate on the film in hand, Trucks moves along at a fair pace to start with but slows down considerably as our bunch of stranded clichéd character's emote with each other & seem to sort all their personal problems out, you know the sort of thing Father makes peace with Daughter whom he has neglected blah blah blah you can probably fill in the blanks yourself. Besides this no explanation is given for anything that happens in the film whatsoever, can someone please tell me why every truck in Lunar & the surrounding area suddenly develop the power to drive, think & even communicate with each other? Why can't they attack the diner & motel rooms? Why do they just circle it for hours? Why does this mysterious force not effect normal cars & motorbikes? What has the mysterious Area 51 have to do with anything? So many questions so few answers... Now for the (slightly) good stuff, namely the scene where the toy dump-truck comes to life attacks & kills an unlucky postman by ramming his ankles & then repeatedly driving into his head! This is a scene that words can't do justice to, by the end of the scene the toy truck is covered in blood & bits of flesh! There is another scene in which a contamination suit comes to life & hacks two men to death with an axe in the films only gory moment, I have no idea why an empty suit would inflate, start walking around & killing people with an axe I just don't & I doubt anyone involved with Trucks did either. What it all boils down to is that Trucks isn't a masterpiece but it just about kept me entertained for 100 odd minutes in a silly lame sort of way. Trucks was made-for-TV & it shows with it's bland cinematography, low key small scale stunts & action scenes which consist mostly of trucks smashing into plywood buildings, forgettable music & a general OK but nothing special feel about it. The acting is average & of TV soap opera quality. Maybe I'm being a bit lenient on Trucks but I found it a fairly decent watch if nothing spectacular, I don't think I'd sit through it again anytime soon. Worth a watch just for the scene when the toy truck smashes the postman's head in, although the scene itself is psychically impossible as a plastic truck simply wouldn't have the weight to generate the forward momentum need to crush someone's skull, would it? Then again it is only a film...",
         "I recently bought this film on DVD, and I have to say it's a great movie. This film is some what a remake of Maximum Overdrive (1986), a film Stephen King wrote and directed, but disrespected the original story, Trucks. Now this movie is more like the story, and at least this time the same title was used. There was no Green Goblin truck this time, I thought that was stupid, and this time the lead truck so to speak is a huge white freezer semi. The film ended the same way I was gonna do if I were to write a Trucks 2 screenplay, with the helicopter, but I guess that's trash in my book. I watched it twice now, and have an urge to watch it again.",
         "TRUCKS is based loosely on Stephen King's short story of the same name. This same story line was used in MAXIMUM OVERDRIVE(1986), so I guess this is a cheap remake for TV. Toned down language; violence is throttled. There seems to be a lack of power...no overdrive. And trucks...dump trucks, tanker trucks, wrecker trucks, semi-trucks mysteriously take control of themselves and run amok attacking their owners and drivers. A group of people are trapped in a truck stop and it isn't Emilio Estevez to the rescue, but a more mature Timothy Busfield. Busfield tries to convince trapped vacationers, truck drivers and some good-old-boys to stay calm until a plan for a rescue is devised. Let's see...let them run out of gas, duh. How about shooting out their headlights, so they can't see where they are going. Like I said, the excitement and urgency of MAXIMUM OVERDRIVE is not here. Rounding out the cast: Brenda Bakke, Victor Cowie, Brendan Fletcher, Amy Stewart and Jonathan Barrett.",
         "In this riveting tale, semi-trucks take over a gas station and trap several people inside. Character development is both interesting and uniquely presented to the viewer. Special effects are Grammy caliber. The powerful acting of the lead actress, Sharon Bajer, will keep you on the edge of your seat throughout the films entirety. The movie portrays the viewpoint of the truckers as they cope with the loss of their trucks to the evil Refrigerator Truck who is the Lord of Evil Trucks. A heartwarming display of a father's fight to save his son is manifested by the lead actor Timothy Busfield will bring tears to your eyes and bring you back to the days when YOUR father saved you from killer trucks and other inanimate objects of Satanic proportions. Truly a must see film. As a side note: I know Timothy Busfield.",
         "I guess it's safe to say that \"loosely based\" is a good thing. What I'm talking about is that, according to Wikipedia, Maximum Overdrive (which is an EXCELLENT movie) was \"loosely based\" on the short story \"Trucks\". I don't really know if this story was meant as a remake of MO, but it should have been left in the can and burned. The acting is deplorable, and overall just not worth wasting your time on. For a really good \"killer vehicle\" movie, take this back to the video store and exchange it for MO...you'll be glad you did. In fact, break the disc on the way there and tell them it was damaged when you got home..that way no one ELSE will make the mistake of renting it.",
         "No really, you have to see this movie. If for no other reason than all the awful reviews. I actually enjoyed this movie. It was entertaining. I liked the characters. They made sense... well I guess if you consider the trucks as characters that kinda makes my statement invalid. I swear, the Sci-fi channell looks for the worst movies ever. I am, however, standing by my review: not worse than \"Night Shift\". I'd even say it was better than that because the characters were entertaining. There was nothing good about \"Night Shift\". It was horrible. You should really see that one too. Awful. Nothing redeemable in \"Night Shift\".",
         "Working at a local truck-stop, a woman and a small gang of residents realize that all the vehicles and machines around them are behaving without human operators, and eventually trap them inside when they realize that a deadly chemical spill is responsible and try to get past the homicidal machines. This one here isn't that bad when it really tries to. The film's best feature is that it's pretty packed with action in here which manages to score some big points for all the big sequences. The big opening sequence where the big rig comes to life and chases them through the junkyard is a really enjoyable start to this one, and from the fun of the several thwarted escape attempts at the diner which includes the great corralling inside the motel to the several close-calls and chases of the group trying to get to their trucks or back inside the diner have a lot going for them. Away from the truck-stop, the early action out on the highways is pure greatness, from the encounter in the RV to the chase through the countryside leading up to the diner makes for some fun, and the scenes of the workers attempting to clean up the accident give this some. Throw in a genuinely creepy moment where two victims try to escape from a collapsing tunnel guarded by trucks which turns into a nice rescue attempt and the stellar sequence where they tackle the escape attempt while getting out of the diner into the wilderness provides plenty of destruction and mayhem that leads into the fast pace with a lot going on to keep it moving. The last bit that works is the cleverly-built beginning that successfully makes for a good mystery and a really creepy tone which are the film's good points even though this one does have a few problems. One of the bigger factors that hold it down is the PG-13 rating which is something big to get over. It really neuters the film a lot, since the big body count is taken out by being run over in the distance or by being blown up in an explosion and there's practically no blood at all due to the fact that the kills won't allow it to happen. All of them done with the action forces that to happen, and by being restricted to the truck- stop for the majority of the film, it doesn't offer opportunities for other details. The fact that it is a retread of the original, with the storyline being taken straight out and set against a few new scenes here and there. That the set-up is still pretty much the same and with a few new differences to put in place in here is something to get over. The last big flaw in here is the family drama that consumes so much of the film, whether it be the father-and-son story or the heroine's story or even one from the people stuck in the truck-stop have a sort of family drama about them, and with so many in here having a similar sort of problem take up so much screen-time is a big waste, since it just makes the film look all the weaker for featuring something that is continually brought up that wasn't fun to experience the first time. Beyond these, though, the film's other flaws are what hold it down the most. Rated PG-13: Violence and Language.",
         "A totally unnecessary remake of MAXIMUM OVERDRIVE, an '80s movie which manages to be fun, cheesy and exceptionally bad at the same time. TRUCKS, however, is a television movie, and we all know the arid desert of creativity and originality that television movies are. Yes, here we have a plot less, incredibly dull movie where nothing much happens, a few people die bloodlessly and lots of stupid things happen to some incredibly stupid people. If you get the feeling I didn't like this film, you'd be right. I don't think much needs to be said about the static direction or basic nature of this film - if you're unsure of what I mean, just watch one of the endless killer nature/haunted house television movies to have come out in the past decade and you'll be there. Remember how in MAXIMUM OVERDRIVE we witnessed people getting killed by coke machines, boys being run over by steam rollers and the like? There's nothing of that here. What little violence there was has been cut out of the version I watched on TV, making this a worthless experience. This just consists of people either running around, waiting or \"bonding\". Yuck. The cast is a particularly bad one. I've found that I usually recognise at least one or two people in a television movie, with the rest being unknown to me. Here I noticed Brenda Bakke, that tireless beauty who has toiled through trash like TALES FROM THE CRYPT PRESENTS: DEMON KNIGHT for the good of mankind, getting by on her looks alone. It's sad when she's the best thing in a movie. Timothy Busfield is the geeky hero, there's an obnoxious teenage girl who reminded me of Molly Ringwald in SPACEHUNTER and was no less irritating, a boring old man who you just know is going to get killed, an annoying little kid who looks like Alfred E. Newman, and two dumb rednecks who manage to blow themselves up. And that is this film's entire cast. At least MAXIMUM OVERDRIVE had something of a plot, with the trucks planning to take over mankind. This is like they took the first half hour of that film and stretched it out to one and a half hours. There isn't even a conclusion, just a silly twist ending where our heroes board a helicopter which they think is rescuing them, only to find out nobody is flying it. How overdone, how stupid. I liked a scene towards the end where a repairman gets electrocuted, which seems to have been inserted just to pad out the running time and has no connection with the rest of the film at all. This is a film where lots of buildings explode in huge clouds for no reason whatsoever, where there's 90% talk and 10% action. This is an uninspired and dumb mess. The one moment I did like in this film happens about halfway through, where we see a truck fill a contamination suit with air, and uses the suit to axe a couple of unfortunates to death. This two minute scene is the ONE moment of creativity that this film has to offer. Give it a miss!",
         "OK first of all, this is a poor remake of Maximum Overdrive. You can say what you want about the original, but at least THAT movie has become a cult classic, unlike this one. All this one suffers from is very lazy directing, and mediocre acting as a result of that directing. Well, that and the fact it has NO AC DC! This one is an OK watch, but no where near as good or well done in any way compared to Maximum Overdrive. Sure it has a lot of action, but the chase scenes are So obvious the cars and trucks are doing 30 mph when they are supposedly going 80, and the crashes aren't all that exciting. The dialogue is OK but not great, and the characters are somewhat boring and unbelievable due to the lame dialogue. In my opinion, if you are sitting at a table with people who have the means to make a movie, and the idea to re-make a cult classic comes up, don't do it. It NEVER is as good as the original!",
         "Let me start off by saying this: I love Stephen King! He's one of my all-time favorite writers, and no one else can match his imagination. Now, many of his novels and short stories have been turned into films. Some are great, some are so-so, some are bad, and some are horrifically bad. Unfortunately, this film falls into the latter category. Both this film, and 1986's \"Maximum Overdrive\" were based on a short story that King had published. Many, many people have claimed that \"Maximum Overdrive\" is the all-time worst Stephen King adaptation ever made. In my personal opinion however, that's really unfair. Because trust me, you can do a WHOLE lot worse than \"Maximum Overdrive\". I've seen many Stephen King movies over the years, and I must say: this movie is beyond a shadow of a doubt, the worst one I've ever seen in my life! Worse than \"It\", worse than \"The Tommyknockers\", worse than \"Sleepwalkers\", worse than \"Golden years\", worse than \"Thinner\", worse than all those movies combined! If you think that \"Maximum Overdrive\" is King's worst, then you clearly haven't seen any of the movies I mentioned previously, or this movie. comparing \"Maximum Overdrive\" to this film, is like comparing a Calzone to a Totino's pizza roll! The reason why \"Trucks\" fails where \"Maximum Overdrive\" succeeds, is because \"Max\" doesn't take itself seriously. The concept is ridiculous, so it just has has fun with it. which is basically what the movie is, a \"turn your brain off\" fun movie. \"Trucks\" is about as \"fun\" as watching paint dry! \"Trucks\" also plays the concept totally straight. I suppose they were trying to make it scary, but it's not, it's just stupid! Not to mention the fact, that the film lacks everything that made \"Max\" good. No good actors, no intriguing characters, no awesome soundtrack, and no big bad killer truck! I can only guess what the filmmakers were trying to accomplish with this movie. Maybe they thought \"Maximum Overdrive\" was a mistake, and were trying to make up for it, but you can't make up for a \"mistake\", by making a bigger, far worse, one!",
         "Really, the plot is very similar to King's earlier film, Maximum Overdrive. Trucks suddenly start coming to life, driving themselves and pursuing people with lethal intent. A group of travelers and locals are imprisoned inside the truckstop diner. There they plot various means of escape from the prowling trucks outside. It is theorized that the trucks could have been activated by debris from a passing comet, a toxic pollution spill or military experiments at the nearby Area 51. A toxic pollution spill, seriously? You know, you can slap the name Stephen King on any movie, good or bad, and people will watch it if they're a fan. Granted his short story was much better, but I've seen a ton of trash Stephen King movies like Firestarter 2: Rekindled and I've also seen some films of his that were excellent, like Pet Sematary. It makes no difference who wrote the books, if the movie was badly made than the author has nothing to do with it. Trucks is very boring in the beginning, and though I love Canada, Manitoba isn't the type of place to film a movie. Dolores Claiborne, filmed in the beautiful province of Nova Scotia, has much better scenery material. The soundtrack was dull and the acting was generally very bad... but on the bright side, Amy Stewert, who had the role of Amanda Benson in the spectacular TV movie Welcome to Dead House that same year, played the minor role of Abby very well in Trucks. I was about to rate it two stars but I thought that to be a little unfair, so I give it 4/10.",
         "...it's a 90's re-make (of \"Maximum Overdrive\" from 1986) that was dumped straight to video in our country and the VHS cover (not shown here) just looked so cheap on the rental shelves, copying the uninspired 'artwork' of many other action fodder rentals at the time. \"Trucks\" just seemed a waste of time and rental money. I have to admit though, that tagline always made me giggle (\"U-Turn, U-Die!\") Years later, when video rental stores just were all too happy getting rid of their old VHS tapes, I just selected me a cheap lot of ex-rentals, and took \"Trucks\" home with me. And yes, not much later I had this strange urge to watch both \"Maximum Overdrive\" and \"Trucks\" back to back. And I'll be damned if this re-make (or re-telling, if you want) wasn't as decent (or poor, you be the judge of that) as the original. Same crazy plot (cars, trucks and whatnot else type of machinery coming to live) with no real explanation and a bit more background concerning the main characters. Adding even some silly but highly entertaining killings this time (the little toy-truck smashing the head of the mailman; the anti-radioactive protective suit inflating itself, then grabbing an axe and...). The main location in \"Trucks\" is also a gas station, so it's not like this remake was doing anything worse here. If you liked the original, then you'll also have some fun with this one. It's as simple as that. I can add that the ending is just a little bit different. Although I saw it coming, I liked it more (than the 80's version)."
      ],
      "genres": [
         "Horror",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Credo Entertainment Group",
         "USA Pictures"
      ],
      "summaries": [
         "A small town truck stop is taken over by driver-less trucks. Possibly caused by a toxic spill in the city. After the trucks cause numerous deaths, the remaining survivors (two teens, their fathers, and another lady citizen) are forced to escape the truck stop. They find it's very difficult to out-smart the trucks.",
         "Based on the short story by Stephen King, this tells the tale of trucks suddenly coming to life and attacking their owners."
      ],
      "budget": 0
   },
   "movielensId": 139219,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": null,
      "directors": ["Chris Thomson"],
      "runtime": 95,
      "movieId": 139219,
      "title": "Trucks",
      "mpaa": "R",
      "actors": [
         "Timothy Busfield",
         "Brenda Bakke",
         "Aidan Devine",
         "Roman Podhora",
         "Jay Brazeau",
         "Brendan Fletcher",
         "Amy Stewart",
         "Victor Cowie",
         "Sharon Bajer"
      ],
      "imdbMovieId": "0120380",
      "originalTitle": "Trucks",
      "genres": [
         "Drama",
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["XXP87WW5HoM"],
      "plotSummary": "Based on the short story by Stephen King, this tells the tale of trucks suddenly coming to life and attacking their owners.",
      "tmdbMovieId": 17100,
      "avgRating": 2.5,
      "releaseYear": "1997",
      "numRatings": 8,
      "posterPath": "/n3RMGYD47AVh69YSyMENvCWL8KX.jpg"
   }
}