{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1748051",
      "video": false,
      "title": "Identical",
      "recommendations": [69396],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Rich Washington",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f8216071",
               "name": "Jonathan Togo",
               "profile_path": "/i5nt6th0CMwPDdINIo5O6PFIcvY.jpg",
               "id": 4743,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Young Yaakov Washington",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f8216075",
               "name": "Pascal Yen-Pfister",
               "profile_path": "/raMPMWn011k3qTzVE58LBapOB2a.jpg",
               "id": 1067718,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Shelley Worth",
               "gender": 1,
               "credit_id": "52fe4bd7c3a36847f8216079",
               "name": "Emily Baldoni",
               "profile_path": "/qayfOsHfyE1RGW3zcEIniLwocl4.jpg",
               "id": 209200,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Carla Campanele",
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f821607d",
               "name": "Kelly Baugher",
               "profile_path": null,
               "id": 1067720,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216067",
               "name": "Daniel Bollag",
               "profile_path": null,
               "id": 1067715,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f821606d",
               "name": "Daniel Bollag",
               "profile_path": null,
               "id": 1067716,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216083",
               "name": "Seo Mutarevic",
               "profile_path": null,
               "id": 1016856,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216089",
               "name": "Yumiko Bollag",
               "profile_path": null,
               "id": 1071531,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.209077,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 118397,
      "vote_count": 3,
      "budget": 2000000,
      "overview": "Identical twins are born, one is good and one is evil. They need each-other to exist, but they deeply resent the others existence. They both fall in love with the same woman. A love triangle forms which leads to murder.",
      "similar": [],
      "original_title": "Identical",
      "runtime": 90,
      "poster_path": "/grdKkKH1uuv3kiGHI8JKoo1u5ZM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-12-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Murder love",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Daniel Bollag",
         "Seo Mutarevic"
      ],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Daniel Bollag",
         "Yumiko Bollag"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1748051/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTA0NTg5MDQ2MTheQTJeQWpwZ15BbWU3MDQ2MDU4OTc@._V1_UY268_CR12,0,182,268_AL_.jpg",
      "actors": [
         "Jonathan Togo",
         "Emily Baldoni",
         "Aaron Refvem"
      ],
      "reviews": [
         "My brother and sister-in-law wanted to watch this movie because they like the actor. It plays like a made for TV movie. No surprise that it didn't make it into the theaters. The story was slow and confusing, and the ending was predictable. We called the ending less than half way through the movie. The previous reviewer who said the actor's speech was slurred and difficult to understand hit the nail on the head. So frustrating to sit through. We watched the whole movie despite our disappointment because we were hoping for a big payoff at the end and we were very let down. There are too many good and even mediocre movies out there to waste your time with this one. The only bright side is that now we can make fun of the movie tomorrow...",
         "first of all, by claiming this movie was 'inspired by true event' is a total joke. and then, the screenplay writer(s), the director and the actor who play the twin brother role, all did unconvincing jobs, resulting this movie turned out to be a total mess. the actor who played the twin brothers got a very serious speaking problem. all the dialog he delivered sounded like his mouth got several marbles in it, there's no way to hear clearly what he said, every word, every sentence are just blurring, there's no way to quite understand what he's talking about. as to the movie itself, what a messy screenplay we got here. we did not know why the mother who bore these twins hated them so much, and why the father treated them like someone else sons. one evil and one good, but after seeing this pathetic movie, neither was good, and both were evil. then came the poor directing followed by the poorly crafted screenplay, the twin brothers were so confusing, sometimes you felt there's just one brother who got 'split personalities' problem; or there were indeed two look-alike brothers, both got mental problems, or one of them was serial killer. there were so many gray areas that confused the audience to the extreme. there were so many scenes that were totally unnecessary and purposeless. the whole movie simply turned weirder and weirder, more confusing as the movie continued. at first, there's some promising moment that this movie might be good and different from the usual movies in the similar genre, but in the end, just another ridiculous and messy crap that you carelessly ate up without knowing before it's too late. i strongly suggest that this actor who played the double images of the twin brothers go find some speaking specialist to adjust and correct his blurring speaking problem.",
         "First problem I had with this movie was that they set it in a Jewish neighborhood that was very clearly Hasidic and when the mother gave birth they allowed it to happen on the sidewalk AND random men were touching her. Men and Women in Hasidic culture are not allowed to touch in public even if you know them, even your husband. The Second problem I had was how slow it was. The Third problem I had was the TERRIBLE acting. Jonathan Togo was all over the map and not in the way his character was written but his acting would be good in one scene and bad in the next or worse in some scenes one moment was good and the rest bad. Emily Foxler should find another profession all together, she was just embarrassing to watch...Lifetime shouldn't even hire her. And my Fourth and biggest problem was the terrible writing and plot. Daniel and Yumiko Bollag ripped off parts of Face Off, Fight Club,The Omen and several other movies slapped on some \"Jewish\" beginning and said let's see if anyone is stupid enough to watch this. Which unfortunately I was. Do yourself and the world a favor and break all copies you find of this film. Bollag's you now owe me 2 hours of my life, the 1.20 I payed at redbox and 24 trillion in emotional damages. You also owe royalties to A LOT of people.",
         "It is always very awkward doing a review on a movie based on a novel. The novel, or book will always take precedence. In this case, - well- this movie had me reeling from one minute to the next..Still very hard to explain that without giving the whole story or a spoiler. It is very well done and i like the fact that is not cheaply done in a one room or on stage production. (not that i don't like that in the right context) . Plenty of light and open air filming.The story about one mans fight within himself sort of sums this up. Well worth the watch if you have the time to absorb the story. If you are looking for- Action - not a lot here. More for the people looking to solve and absorb.",
         "Terrible, terrible plot. The acting is absolutely abysmal. I'm surprised that this (reluctant to even use the term \"film\") hasn't been thought of as a form of torture! Come to think of it, if I was given a choice between water-boarding and watching this film, I'd take water-boarding hands down! Please, if you've got anything else to do in your life aside from watching this movie (reluctant to use term again), even if you're contemplating pulling out your nails with a set of rusty pliers, that would be better time spent! My only hope is that I can spare you the pain I've endured. Now my only other regret is beginning this review as I've just found out that I have to spend more time writing a minimum of 10 lines so as to submit this \"review\". Still, it may be worth it if it prevents only one person from subjecting themselves to such an atrocity.",
         "This movie got my attention because of the actor who plays the main character. I'm a big fan of Jon Togo so I thought it was worth a shot. I'm glad I decided to pick it up because my favorite kind of movie is the kind that keeps your heart racing and your mind guessing as well as your palms sweating. It had a perfect amount of mystery and twists, even the end surprised me. In a way I saw it coming but they made it original. It was worth watching and I'd watch it again. I think the male and female lead did a great job with their part. It must have been interesting to throw themselves into these characters. Overall, great film. Unique.",
         "\"Identical\" was billed as a film that was \"inspired by true events.\" Apparently, the true events were the biblical story of Cain and Abel. But the storyline was hopelessly confused, and, as it developed, it veered far way from the original story in the Book of Genesis. The film opens in Borough Park, Brooklyn. The year is 1974. A woman is walking along the street, then drops to the ground and begins delivering a baby. Following the joy of the moment, the woman recognizes that she is about to pop out a second baby. She does not look pleased at all with that prospect. As the two little boys in this middle-class family are growing up, it is clear that the parents loathe, mistreat, and even abuse one of the boys. While the details are murky, it appears as though one of the two boys later pushes the mother down the stairs to her death. Fast forward 20 years: The boys are now men in their twenties residing in New York. One is a successful executive involved in fraudulent business activities. The other is a bohemian type who is an artist. Thus far, the film's idea had potential in developing the Cain and Abel archetype. But at this point, the screenplay ran off the rails because it was never clear if Mark (the executive) was Cain and Rich (the bohemian) was Abel, or vice versa. Both characters were freaks! The unpleasantness of this film was truly appalling with far too much violence. Ed Asner appeared in two scenes as the father. But even Asner could not salvage this stinker of a film. SPOILER FOLLOWS: At the end, there is a plot twist revealed when the birth certificate of Mark/Rich is pulled out. There is also a touch of the paranormal with a little boy following the villain around as his \"conscience.\" Finally, the villain turns himself in at the police precinct. But the cops are too stupid or too slow to interview him, and he walks out of the building. A final scene with more paranormal activity in the home of the psycho caps off this turkey. It was difficult to come up for a title for this review. The film never developed a theme for its biblically inspired subject matter. So, like the writers of the film's screenplay, I just pulled up for random a phrase that sounded biblical: \"The Sins of the Father Are Visited Upon the Son.\"",
         "I thoroughly enjoyed this movie, I must admit at some points I was confused on what was going on, the last part was AMAZING!! Such a twist!! I think Jonathon Togo's acting was brilliant (as was everybody else's)although some conversations were hard to here and understand if you REALLY pay attention to the rest of it you should be able to catch on. I only watched it because Jonathon was in it (and I love him from CSI: Miami) and in my experience watching films because there's someone in it you like doesn't always mean the film is good but this film showed me the complete opposite. All in all this movie was exciting, gets you on the edge of your seat and intrigues so from minute 1! I wouldn't recommend it to people who prefer easy story lines.",
         "Review of Daniel Bollag's \"Identical\" by Stefanos Sitaras Identical is a movie that will surprise you, on many levels. Every 10 minutes or so, there's a disturbance of some kind, an unexpected event, which thwarts all pre-existing narrative trajectory out of orbit, spiraling viewers into a realm of uncertainty and continuing fascination. It's fresh, artful, complex, dark and twisted, and yet, wholesomely entertaining. Be prepared for an intense experience, with powerhouse performances, intelligent twists and turns, a riveting sense of unease and suspense, with well-rounded character work that gives this whole psychological labyrinth a hue of truth and humanity. It is an independent film that sets example and offers encouragement to all us aspiring indie-filmmakers; no matter the circumstance, the difficulties, or the limitations, with a good enough story, a first-rate cast and a vigorous vision, it's all possible. Writing this review is doubly beguiling for me, both as a member of the audience and a filmmaker myself. I came out of the theater completely satisfied. \"Identical\" takes you on a dark and complex ride of identity, betrayal, and sibling rivalry. The premise of the movie sets the tone and intricacy of the narrative by itself: two identical twin brothers fall for the same woman. But of course, it's so, so much more than that. It's a morality tale about identity, obsession, greed, redemption, and reality. Two identical twin brothers are born, and, to keep in touch with the whole mythology of it, one is good and one is evil. The film begins with a gorgeous prologue sequence that sets the film's tone, and the narrative's main conflict. Young actor Aaron Refvem is pitch-perfect in embodying both personalities, making the prologue one of the film's strongest segments. Keep this name in mind, you'll be hearing great things about this kid very very soon, I'm sure of it. The children grow up to become adult versions of themselves. The dynamic stays the same, and the mythology of the prologue residues on the entire story. The evil brother, Mark, is a ruthless businessman whose world of deceit and corruption is on the brink of collapse, and he will fight for it till the end, exposing the most sinister sides of his personality. Richard is the good brother, who, despite his well-heartiness and benevolence, is a lost soul. He is an artist and a wanderer, a poet and a lover. Truly, no words can adequately praise John Togo's performance as both brothers. He is simply breathtaking in every single frame he's in, and thank God, he's in almost every one. Not only is he wholesomely convincing as both characters, but he goes above and beyond that. He becomes two people so seamlessly that, not for a single moment was there a doubt in my mind as to who I was watching at any given scene. It's an award-worthy tour-DOE- force performance, and Togo becomes a leading man of such cinematic proportion, that he makes the film completely irresistible, despite its psychological labyrinth and attention- demanding plot, one that will challenge you to question reality as you can't take your eyes off screen. Of course, there are many other things besides Togo that you can't take your eyes off. Chief among them, the beautiful, elegant, and 21-st century femme-fatal Emily Foxler, who is outstanding as Shelly, Mark's secretary, who both brothers inevitably fall in love with. She is entirely lovable from the first scene she's in. In a way, she plays two characters in her own right. With Mark, she is composed, chic, elegant, and serious, all the traits of a secret-affair-secretary who knows her place. Richard, the good twin, is able to charm that facade away, which is incredibly audience-satisfying, because, through identification (no pun intended) we feel like we are flirting our way into her heart and true personality as well. And once that side of her is out in the open, we want to see it again, hence we root for that relationship to continue. She is an incredible actress, in full control of her body-language and facial expression. Watch her eyes as she performs.. Fixed and cold when she is with Mark, playful and full of life when with Richard. Shelly is funny, cute, entirely lovable, and of course, the starting point of a love triangle that propels all characters into a quandary, one which is impossible to speak of without spoiling the movie, so, if you want to know what happens next, you'll have to watch it."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Washington Sq. Production"],
      "summaries": ["Identical twins are born, one is good and one is evil. They need each-other to exist, but they deeply resent the others existence. They both fall in love with the same woman. A love triangle forms which leads to murder."],
      "budget": 2000000
   },
   "movielensId": 139253,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-12-01",
      "dvdReleaseDate": null,
      "directors": [
         "Daniel Bollag",
         "Seo Mutarevic"
      ],
      "runtime": 90,
      "movieId": 139253,
      "title": "Identical",
      "mpaa": "R",
      "actors": [
         "Jonathan Togo",
         "Pascal Yen-Pfister",
         "Emily Baldoni",
         "Kelly Baugher"
      ],
      "imdbMovieId": "1748051",
      "originalTitle": "Identical",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["xe6vogn0QuE"],
      "plotSummary": "Identical twins are born, one is good and one is evil. They need each-other to exist, but they deeply resent the others existence. They both fall in love with the same woman. A love triangle forms which leads to murder.",
      "tmdbMovieId": 118397,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/grdKkKH1uuv3kiGHI8JKoo1u5ZM.jpg"
   }
}