{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "post-apocalyptic",
            "id": 4458
         }
      ],
      "imdb_id": "tt4530832",
      "video": false,
      "title": "Road Wars",
      "recommendations": [
         29474,
         3030,
         53463,
         30936,
         46202,
         244852,
         261047,
         344796,
         31549,
         232731,
         121572,
         39564,
         137955,
         44038,
         56529
      ],
      "backdrop_path": "/pnm0dnlJ3v9z8m35qxzMx2pQLyI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Thorne",
               "gender": 0,
               "credit_id": "551a2a319251410932000435",
               "name": "Cole Parker",
               "profile_path": null,
               "id": 1447852,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Nakada",
               "gender": 1,
               "credit_id": "551a2a4092514165b700077f",
               "name": "Chloe Farnworth",
               "profile_path": "/lCg97JdpG2tsiD5K3gbFGeYoGnK.jpg",
               "id": 1406755,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dallas",
               "gender": 0,
               "credit_id": "551a2a5892514165b7000786",
               "name": "John Freeman",
               "profile_path": null,
               "id": 55217,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sylvia",
               "gender": 0,
               "credit_id": "551a2a649251410932000441",
               "name": "Angela McNamee",
               "profile_path": null,
               "id": 1447853,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Susan",
               "gender": 0,
               "credit_id": "551a2a93c3a36823dc0007e0",
               "name": "Jane Kim",
               "profile_path": null,
               "id": 1447854,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Macon",
               "gender": 0,
               "credit_id": "551a2aa6925141658e00078c",
               "name": "Nikki Bohm",
               "profile_path": "/15fvmISh96RunQmcJKlvlACwmA2.jpg",
               "id": 1101695,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dirk",
               "gender": 0,
               "credit_id": "551a2ab492514165f80007e3",
               "name": "Kelcey Watson",
               "profile_path": "/cFTlpudiIAXGpE4wAln7uDERXUs.jpg",
               "id": 1407170,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mandheim",
               "gender": 0,
               "credit_id": "551a2acd9251410932000459",
               "name": "Michael Foster",
               "profile_path": "/95ryOqzUloB7V3IElsNC6TrZD3A.jpg",
               "id": 1331237,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Riever",
               "gender": 0,
               "credit_id": "551a2ada925141658e000796",
               "name": "Micah Fitzgerald",
               "profile_path": null,
               "id": 1354874,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Ason",
               "gender": 0,
               "credit_id": "551a2af392514165b700079d",
               "name": "Tonia Marie Rosée",
               "profile_path": "/vXUYmnBZJ8NiCtiG3XQZeB60Up6.jpg",
               "id": 1447857,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Deerhead",
               "gender": 0,
               "credit_id": "551a2b03c3a36835c100111f",
               "name": "Jerry G. Angelo",
               "profile_path": "/szUFCcEuhjwBv0zRGdWHNqZ0sW2.jpg",
               "id": 104488,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Emily",
               "gender": 0,
               "credit_id": "551a2b189251415c9700080d",
               "name": "Victoria Clare",
               "profile_path": null,
               "id": 1447858,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Orsini",
               "gender": 1,
               "credit_id": "551a2b26c3a36835c1001128",
               "name": "Marianne Bourg",
               "profile_path": "/gN47MVT7eR7AH6MLBefMsDJvGRR.jpg",
               "id": 1379512,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "551a29ca9251410932000416",
               "name": "Mark Atkins",
               "profile_path": null,
               "id": 81297,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "551a29d3c3a36835c10010c5",
               "name": "Mark Atkins",
               "profile_path": null,
               "id": 81297,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "551a29e2c3a36835bf000f38",
               "name": "Erica Steele",
               "profile_path": null,
               "id": 1447850,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "551a29f6c3a36835c10010d3",
               "name": "Chris Cano",
               "profile_path": null,
               "id": 1320530,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5929bf5bc3a36877df052dcf",
               "name": "Mark Atkins",
               "profile_path": null,
               "id": 81297,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 3.059756,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 333545,
      "vote_count": 14,
      "budget": 0,
      "overview": "After the earth’s water supply is depleted, the survivors form roving road gangs, armed to the teeth and desperate to find and protect water supplies. But when a new breed of blood-drinking humans emerges, the survivors must contend with a whole new threat to their existence.",
      "similar": [
         38321,
         36647,
         36648,
         49017,
         7131,
         6479,
         8810,
         861,
         1576,
         12244,
         9659,
         277,
         8698,
         534,
         76341,
         198663,
         263115,
         755,
         294254,
         101299
      ],
      "original_title": "Road Wars",
      "runtime": 90,
      "poster_path": "/n0gbMzfMSWRg9Mja8J3XAxc1vUC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ic2bTizdzRLDVzAvN7MXdUg3WQV.png",
         "name": "The Asylum",
         "id": 1311,
         "origin_country": "US"
      }],
      "release_date": "2015-05-05",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "WELCOME TO HELL!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark Atkins"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Mark Atkins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4530832/",
      "coverLink": null,
      "actors": [
         "Chloe Farnworth",
         "Cole Parker",
         "John Freeman"
      ],
      "reviews": [
         "Mark Atkins directed, editor, writer? What happened, did they withhold your paycheck? This isn't even a comical event of errors. Cars driving in the background at the mining city, new trucks parked in front of buildings, (i guess the owners wouldn't move them unless they were paid) and what happened to Dallas,(Spoiler?) the lead actor? Forgot him at the end? (maybe he was in the trunk!) This is not even worth a B movie category. Shame on yourself Mark Putting Mad Max and 28 days in the same review as this movie is a disgrace. Better off watching Doomsday with Rhona Mitra. The only person who closely represents a professional actor is Cole Parker, but even he should stick with stand up comedy. The beginning of the movie, at the gas station, actually started out OK, but then rapidly disintegrated. This is the type of movie you keep watching, thinking it might get better. If you want to watch a slightly better caliper theme, turn on Z-Nation on SYFY. At least that is only a 43 minute show and the acting is better. then again, almost any acting is better than this trash.",
         "I often wonder how these movies ever get made ,let alone why studios pay to have them made. This movie takes place in an abandoned California Gold mine town, there is a loose story, and I mean loose. In fact I would say someone has watched a Mad Max movie and a Zombie movie and come up with a really bad Script involving Weird people, Zombies, Guns, flamethrowers and Average /bad actors. The only good thing about this film was the ending, It was over and No more time was wasted watching Garbage. Also the music by Ilir Zenili was pitiful and performed by Peg leg something. Head banging garage band stuff. So in reflection, don't waste 90 minutes of your time watching the rubbish,wait for the new Mad Max Fury road.",
         "Obvious attempt to cash in on Fury Road, and it's from Asylum, so you know to go in with low expectations. But, I'm a fiend for post-apocalypse road war stuff, so I had to give it a chance. And... it was okay. It benefited from low expectations. The cars are at least good enough to have maybe passed for extras in some of Fury Road's crowd scenes, so there's that. Unfortunately, they don't really get to do much. There's only one real chase scene and it's brief and doesn't entail much except driving around, with no real stunt work. The cover shows lots of vehicles and explosions. You get about five or six cars, and no explosions. As for the driving scenes, director's never going to be confused with George Miller. Plot-wise it's Mad Max cross-pollinated with I Am Legend. Society's broken down and the few survivors and scavenging for everything. Gasoline seems to be more plentiful than water, though, since petrol's the one thing they don't seem to fret about much. A lot of people have become victims of a \"vampire virus\" and, since they luckily have a biochemist on their team, they're trying to work on a cure. One guy who may be immune shows up; the filmmakers are so desperate to make him seem like Mad Max that he has an Aussie accent, and they even have him wearing a black leather jacket with one shoulderpad. Their big problem is they're running out of ammunition to fight off the nightly attacks from vampires, and to look for more they'd have to leave the only known source of water. Mostly they sit around talking about this, when you'd rather they were driving. It's not really that difficult to make one of these movies more satisfying -- just get decent-looking cars (which they did) and show them driving around a lot (which they didn't). So, it's not very good, but it's still better than most of the Italian Road Warrior ripoffs that swarmed the video stores back in the days of VHS, so, I cut it some slack. Production values aren't bad, the survivors looked suitably skangy, and the acting's not great but isn't painful, either. And the plot's not compelling, but there is one and it's not overly clumsy. It's an okay way to kill 90 minutes as long as you're not expecting too much. Better than most Asylum films, but that's damning with faint praise.",
         "Slow, boring, stupid. I understand the filmmakers didn't have a huge budget to work with, but they could still come with something better than this. Yeah, it's a Mad Max ripoff, but there has been a bunch of those, and at least some of them are entertaining! This one has nothing going for it, with the exception maybe of the cars, which look nice (the \"hero\" car is horrible, though), but what's the point of a Mad Max clone where NONE of the cars get trashed? There are no car stunts, either! Guys, those cars were supposed to be ruins on themselves, don't tell me you couldn't destroy at least one or two for your \"epic\" movie! I guess the cars were rented from real-life fans who built their own \"Fury Road\"-like vehicles, since most of them have working tail-lights (a necessity when you are driving through the wasteland, I suppose) which suggest that the cars were street-legit, which wouldn't make sense for this kind of vehicles. I have seen other Asylum titles just for the fun of watching an unintentional bad movie. This one is just bad, not funny. Avoid like the plague. If you really want to see a Mad Max movie, grab the old ones or go see Fury Road.",
         "This is another Asylum knock-off and it shows. Which brings me to a little story... See, a little while ago a friend took me to task over my singling out Asylum for these sorts of films. He went so far as to point out that popular movies have always attracted plagiarism and opportunistic attempts to cash in on them. He even used Star Wars as a prime example, and rightly so. But then I pointed out that the difference between movies like for instance, Starcrash, which was made to cash in on Star Wars, is that they came out well after the blockbuster they attempted to ape. With Asylum, that is not true. Asylum movies usually arrive just before a big movie opens, promising the same thrills as the AAA movie, but delivering something entirely horrible instead. In this case, Road Wars was released on 5 May 2015. Fury Road on 7 May 2015. Can you see how their nefarious opportunism works now, friend? They turn out movies before, or at the same time as the movie they have mimicked. All of their marketing and promotional material is essentially paid for by the bigger movie. I suppose I should admire them for their gall, but all the process really does is just paint them with a very large brush. And it is a brush that has been used to clean toilets with. Anyway, enough ranting. Is Road Wars any good at all as a movie, despite being the product of Asylum? Well, no, of course it isn't. The budget is non-existent for things like car stunts, though the cars are reasonably well done in and of themselves. There are no crashes, no smashes, and no hits. In fact, most of the time you get little more than scenes of aimless driving. Scenes of aimless talking and... well... that's about it, really. Even if none of the Mad Max movies had existed this would still be a sub-par, boring movie that even the 80's VHS era would have been embarrassed to field. The acting is very weak here indeed and the story is simplistic and almost pointless. Do yourselves a favour and give it a miss. SUMMARY: Rip-off Asylum at work again! No fun, no real action, cars that don't get damaged. Acting at a high-school drama level. Not worth the effort.",
         "yes I watched this last night , found an online copy. it wants to be mad max 2/road warrior meets resident evil. this is just my op. ... it fails miserably on both accounts. weak soundtrack, weak hook... by hook i mean, in the first five minutes a movie -or book- should hook the reader/viewer, so they want to continue. my ratings hinge on re-watchability... i had to fast forward through most of the movie-- weak acting-- weak dialogue-- weak story line-- the movie quality is good, the filming. but everything else is \"b\" movie grade. the cars , the acting etc. I wish i hadn't watched it in the first place, if fast forwarding is even watching. It will not be re-watched. there is a lot of sitting in the desert, driving in the desert. pointless dialogue and stuff that doesn't make sense. I have no doubt that someone will say \"this movie is epic\", well, to that , i say ... every turd has its punchbowl. hey , i am gonna use that in my thread from the sandbox message board entitled \"the poop group\". check it out. comment , bring all your poop slinging to my poop group in the sandbox message board I thought you said you weren't insane anymore?",
         "B-movie? Try D. This flick is cheap, lower than low budget with serious issues with scenography (brand new trucks against supposedly post- apoc buildings), costumography (neatly trimmed, fresh looking actors in supposedly post-apoc world). However, despite bad acting the movie has some good points. No CGI, all is done with cool MadMax-esque vehicles. Attempt at Aussie accents is also sort of a bonus (for being an homage) if not a slight comic relief. The best in this movie is the story. It doesn't have a beginning. Audience is waking up into a nightmare (just as main character does). It doesn't have an ending either. What kind of ending is there after the end of the world? In between the moment lights come in and lights come out, we see an authentic, believable story about survivors. they have hopes, doubts, they have issues, they love beyond death, they are just trying to do their best to survive. I the end, they are defeated. Again, by love...",
         "It's not a horrible flick,Yes,Derivative of a '70s genre and playing those Mockbuster games with a Aussie – sounding doppelganger of a lead actor. The cars are very cool and for not being cgi OR in a video game,They do awesome things on screen. Liked the other lead John Freeman, He has a Robert Rusler look and was a rodeo cowboy so comes with that rugged look of Post Apocalypse naturally. Wish they didn't use The Zombie cheat/cheap shot,Because then you sprinkle your screen with Walking Dead almost cast. One accolade to Mark Atkins, You did it all buddy,And that is a impressive feat,No matter the results."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": ["Asylum, The"],
      "summaries": ["When an amnesiac wakes up in a post apocalyptic world ravaged by a rabies type virus, he must band together with a small group of survivors."],
      "budget": 1000000
   },
   "movielensId": 139311,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-05-05",
      "dvdReleaseDate": null,
      "directors": ["Mark Atkins"],
      "runtime": 90,
      "movieId": 139311,
      "title": "Road Wars",
      "mpaa": "NR",
      "actors": [
         "Cole Parker",
         "Chloe Farnworth",
         "John Freeman",
         "Angela McNamee",
         "Jane Kim",
         "Nikki Bohm",
         "Kelcey Watson",
         "Michael Foster",
         "Micah Fitzgerald",
         "Tonia Marie Rosée",
         "Jerry G. Angelo",
         "Victoria Clare",
         "Marianne Bourg"
      ],
      "imdbMovieId": "4530832",
      "originalTitle": "Road Wars",
      "genres": [
         "Science Fiction",
         "Action"
      ],
      "youtubeTrailerIds": ["9h_TzJDGABQ"],
      "plotSummary": "After the earth’s water supply is depleted, the survivors form roving road gangs, armed to the teeth and desperate to find and protect water supplies. But when a new breed of blood-drinking humans emerges, the survivors must contend with a whole new threat to their existence.",
      "tmdbMovieId": 333545,
      "avgRating": 3.375,
      "releaseYear": "2015",
      "numRatings": 4,
      "posterPath": "/n0gbMzfMSWRg9Mja8J3XAxc1vUC.jpg"
   }
}