{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4026562",
      "video": false,
      "title": "Hollows Grove",
      "recommendations": [
         31549,
         192415,
         364088,
         32540,
         50376,
         186359,
         137756,
         28640,
         24116,
         45347,
         332278,
         30342,
         40770,
         167514,
         97794,
         120194,
         201426,
         92395,
         203186,
         74008
      ],
      "backdrop_path": "/mrleaXqihNCGt2XtQynokZoIqyu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Bill",
               "gender": 2,
               "credit_id": "544795dcc3a3686d9600220b",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "F.B.I. Agent Jones",
               "gender": 2,
               "credit_id": "544795ea0e0a2672eb0021ac",
               "name": "Mykelti Williamson",
               "profile_path": "/8TTxzpuvvpw2tB8xZBCDslYupNU.jpg",
               "id": 34,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Harold Maxwell",
               "gender": 2,
               "credit_id": "544795fe0e0a261120001d63",
               "name": "Matthew Carey",
               "profile_path": "/6lQqbn9VGcTvJXqPB9eyFxLwIaD.jpg",
               "id": 17040,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Roger Rafkin",
               "gender": 2,
               "credit_id": "54479609c3a3686d840022f1",
               "name": "Sunkrish Bala",
               "profile_path": "/zxjpvOA8aeBpnPBRgS5WB0ciy97.jpg",
               "id": 105658,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Julie Mercade",
               "gender": 1,
               "credit_id": "56c89eab9251414a7a0003c9",
               "name": "Bresha Webb",
               "profile_path": "/ymSAqpgPdBxiODIFzzOAEq0LizT.jpg",
               "id": 1377385,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Hector Gustavo",
               "gender": 2,
               "credit_id": "56c8a13c9251411735003625",
               "name": "Eddie Perez",
               "profile_path": "/nxXXSx3vpWt9QNZoeuE0OFluFCY.jpg",
               "id": 1031469,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Homeless Man",
               "gender": 2,
               "credit_id": "56c8a437c3a368409c003439",
               "name": "Gary Sievers",
               "profile_path": "/7C8ttoBnxwD7RJ7vQCEPQrEAcmX.jpg",
               "id": 1580574,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "George",
               "gender": 2,
               "credit_id": "56c8a46b925141173500370a",
               "name": "Tanc Sade",
               "profile_path": "/iPvIVpaNxGtB0dDiOxCzaHOlCV1.jpg",
               "id": 191260,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "56c8a485c3a368408c003bc0",
               "name": "Lindsey Smith-Sands",
               "profile_path": "/irg7znlc62aEC6SFfnYqDfH7O76.jpg",
               "id": 1580581,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Chad Groan",
               "gender": 0,
               "credit_id": "56c8a9e2c3a36840950039f3",
               "name": "Val Morrison",
               "profile_path": null,
               "id": 1101862,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Tim Royce",
               "gender": 2,
               "credit_id": "59c69377c3a3681403049ad5",
               "name": "Matt Doherty",
               "profile_path": "/TbQLvFVZ0XUhNfMTCPerGg2c3N.jpg",
               "id": 148637,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5447961ec3a3686d840022fa",
               "name": "Craig Efros",
               "profile_path": null,
               "id": 1376505,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "544796290e0a2672e40022b2",
               "name": "Craig Efros",
               "profile_path": null,
               "id": 1376505,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 1.128605,
      "production_countries": [],
      "id": 298609,
      "vote_count": 16,
      "budget": 0,
      "overview": "A young filmmaker documents his ghost-hunting, reality show friends as their routine investigation of an abandoned orphanage turns into a nightmare from which they can't escape.",
      "similar": [],
      "original_title": "Hollows Grove",
      "runtime": 81,
      "poster_path": "/lbuWseZvjyxaEulKrETPdg25YD5.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-10-21",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Craig Efros"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Craig Efros"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4026562/",
      "coverLink": null,
      "actors": [
         "Mykelti Williamson",
         "Lance Henriksen",
         "Matthew Carey"
      ],
      "reviews": [
         "I was lucky enough to see a pre-screening of this movie, but I have to say that if I paid too see it in theaters, I wouldn't have been disappointed. For a scary movie, especially a low budget one, this is really good. Initially everybody watching it with me complained about the slow build and the fact that we were sick of the flood of \"home movie\" style scary movies. But this movie made up did it all very well. For starters, the home movie style isn't the same as in most movies. The camera isn't constantly running, shaking, flipping, and falling. It's steady for about 90% of the movie, and I thoroughly appreciate that. And the slow build I spoke about earlier is necessary, it helped me to settle in before it scared me. Which it definitely did. It didn't do it with crazy cheap scares or jump scenes, but with that slow build I mentioned earlier. It built the tension and then cut through it. The characters are pretty well developed and the acting is good. Nobody is going to win any Oscars for this, but I wasn't left wanting anything from the actors. Everybody played their part, and they played it well. The story is the usual \"we go to a haunted place and discover it's actually haunted\" but the perspective is pretty different. Though the movie was semi-predictable, it kept me and everybody I watched it with on the edge of our seats, especially near the end. My only real complaint about this movie is the beginning and end scenes with the detective. It made it seem too much like an interactive movie at Universal Studios or something. But stay after the credits, and the bad ending scene makes up for itself.",
         "The acting is pretty bad. The guy who plays Chad is the best of the lot I'd say. Matt Doherty is up there in the absolute worst horror movie actors I've seen. I actually looked him up on IMDb just to see who he was and what other acting jobs he'd gotten, which is when I decided to leave a review. There were a couple scenes where I laughed out loud from the absurdity of his acting. The plot and script are decent. Overall, if it's a rainy day, you've blown through everything on Netflix that looks good to you, and you have nothing else to do, give it a look. There are some okay jump scares and a few creepy moments. Lance Henriksen was a pleasant surprise. It's always interesting to see where he'll pop up.",
         "This is how it should be done - mostly. Most important is they build up characters, well played, with good humour. The tension is built well in the hospital, but I had a problem with the documentary film because they didn't seem to be much good at producing a product they're supposed to make lots of money from. I've seen stuff like this where the ghosts are only suggested. This one does have manifestations, maybe too much - especially with the frequent children's voices. The night vision kids were good, and the skull girl. A few mis-steps. The caretaker's death was not believable. They ran upstairs to immediately figure out they needed to go down. And they had to caption on screen that it was Tim's camera at the climax of his story. For the genre it's good, but nothing new.",
         "Oh look, another paranormal sub-genred' film to look into. Most people may already be scared away by the two unlikeable facts, those being number one, this involves a team going into an abandoned area, clichés. Number two, you probably already guessed it! It's found footage. Two horror movie factors most more than likely can't stand. But does that turn this film, suddenly, into a bad one? Absolutely not. \"Hollows Grove\" succeeds in being a tense, creepy horror film, actually. First off, the plot is new, and actually quite interesting. Instead of taking the heavily clichéd route, that being the action of throwing this group of characters together as supposed friends with camera into this abandoned area. We actually follow a rookie cameraman of which has just joined this team of ghost hunters; the entire film sets it up to where it all seems fake; the film shows them going to mechanics and such just to prop up they're supposed \"ghosts\". I found it really intriguing with this pleasant change. I love how the cameraman is completely oblivious the entire time, and has / had no idea of these ghost hunters actually being fake. It was interesting to see, all this time he was built up toward believing it was all fake, until the entire team, to their surprise, got way more than they all bargained for. The plot managed to solidly execute a change toward the typical cliché - fest of which plagues the paranormal sub genre. The plot turned it around, and made it into something different, something rather pleasant. I felt as if the atmosphere in this film was quite good, you got your creepy, unnerving atmosphere that gives those unsettling vibes, for example, as soon as the crew enters the abandoned orphanage, you already feel the vibes kick in, pleasantly. Something many found footage films fail to do, for the most part. With that being said, another nice surprise that awaited in this film was the camera work. Yes, the guy holding the camera. He wasn't shaky, shaky, ALL over the place like most other films. To my surprise, the camera actually got decent shots of activity that befalls, instead of shaking all over the place when it's occurring! Finally, I felt as if the film had a heart along with it. The film, overall just seemed unique, in terms of the over all aspects of this film. It managed to be unique, and even comical it times, but successfully, and pleasantly, for the most part an eerie, dark - like influence that set the mood for the film in a very great way. In conclusion, this film was fun. I felt as if it was a decent, solid, and even great found footage, paranormal film. It surprised me with it's unique elements, turning itself into an interesting little gem. The characters are decent, stories great, as well as plot. The entire story itself has some interesting, good, refreshing turns that paid off in the end, and the entire film has heart, giving emphasis instead of chopping to the point. I'd recommend giving this one a chance, it surprised myself, and what seems to be other reviewers' as well. It's an intriguing, great little flick, and I would recommend it to horror fans looking for a small gem. P.S! For those who do watch this film, make sure you wait the entire thing out! Sit through the credits! The film has a small trick up its sleeve..",
         "Lance Henrikson has become a horror icon. He's protected the Antichrist, fought the Terminator, battled demons, Aliens and Predators. He's been in over 200 movies and now he's in a found footage horror movie. Too bad he only has 2 scenes. I went into this thinking it would be along the lines of Grave Encounters, which I really like, and it sort of is. The problem is that it's missing most of the scares. Whereas Grave Encounters went right for the jugular, this one has most of the spooky stuff happening off camera (singing and whispering heard, things disappearing when an area is returned to). The setting is creepy and some genuinely frightening stuff happens near the end, but it is almost too late by then. Hollows Grove did keep me interested throughout however and is definitely worth a watch for fans of these types of movies. 6.5/10.",
         "By the box the movie looks like it will just be another shabby found footage film but instead it is a creative, unique and freighting experience. While the writing towards the end did get a little lazy, all in all it was one of the few movies that gave me the creeps just for watching it! It did not rely on petty jump scares to get a thrill out of its audience; it's just simply creepy. I'm not sure why it has such a bad review as it is a very surprisingly scary movie! The actors aren't annoying, there are decent special effects, the camera work isn't bad and better yet the script while being a found footage film is 100% original and even funny at some points.",
         "I don't even like the hint of anything happening to an animal, and the first half hour of this film was almost a deal killer. There was an incident with a cat inside the asylum. But...it ended up being okay and fake enough to not be too upsetting and the fact that the Humane Society was on hand to monitor, redeemed the film, to a degree. Parts of the dialogue were hilarious and I actually laughed out loud. The dialogue was real, hip and believable. The ghost kids and creepy asylum were old, tired, clichéd and seriously, eh, but it was the typical story, so I could deal with that. But...what killed this movie for me, was the ending. What a useless ending and a total letdown.",
         "I can't believe the good reviews here, the only good thing I can say about this haunted hospital mess is that it might be slightly better than that nepotistic abomination from Oliver Stone's kid and some other movie that tried way too hard for lovable characters and scares and failed on both, and that one was set in a prison hospital, so if you want to be picky then it doesn't count here. I also can't recall the titles of those movies and don't care enough to find them again, so they may actually be better than Hollows Grove. First, the dialog the characters use for their show's narrative is so insipid, inane and uninformative that I could almost believe it was intentionally done as a statement on the stupidity of the typical reality show, but I don't know if I can give the writers that much credit, since the characters' dialog is just as bad in their interactions with each other. The film also feels like it takes forever to get anywhere, focusing too much and too long on building cliché characters who ultimately contribute nothing to the story beyond a body count. I did wind up giving the film three stars for some of the better effects, but I think I was feeling too generous. And I won't even talk about the FBI ending, as that was bad enough to cause the entire film to lose a star, now that I think about it. You want the same storyline? Just watch Grave Encounters again.",
         "I saw this for free on Hooplah. It's actually an okay \"found- footage\" film, albeit a bit too short. The acting's good: There's great camaraderie amongst the cast which really helps sell some of the humor. Lance Henriksen makes a relatively brief cameo as the \"spooky effects\"-guy, and is -- of course -- awesome to watch (whatever someone might think of his film choices). The camera-work is good: neither too jumpy nor too focused like in a real camera shot. The special effects are what they are given that -- I'm assuming -- the film was probably given a paltry budget. The conceit of the whole movie is that the F. B. I. is using the footage to get help in solving the murders of the crew of a paranormal T. V. show, called S. P. I. T. (the \"Spiritual and Paranormal Investigative Team\" . . . or, something like that). That part was kind of stupid. Spit?! I mean, . . . c'mon. I failed to see any humor in it, if that were the intent. The F. B. I. connection was also, in my humble opinion, totally unnecessary. It added nothing to the story and even confused it. Why was the Bureau involved at all? We know that the members of the crew were killed . . . but, were they missing, too? And, would their disappearance have even mattered, when the tapes showed their deaths? (I thought, the F. B. I. looked for missing people whom they hoped to be ALIVE.) At the end, the F. B. I. person reveals some screen (?)/box (?)/whatever, that only confused things further. I won't say what it is, because I honestly am still not sure what it was meant to be. Anyways, it felt like a moment of amateurism on the part of the writer, like: \"Hey, let's throw in some weird stuff at the end to creep out the audience.\" It just so happens that some guy is also following the crew around in order to film them for his documentary. So, having two cameras allows for some more possibilities: In other words, the documentary guy catches things that the \"paranormals\" don't while they tape their canned script to their own cameraman. But, it also has the effect of making the film feel more like a movie, rather than an authentic \"found footage\" experience. That might annoy some people. There's no real blood, guts, or gore, except for a rather explicit throat-cutting. The film relies more on atmosphere, on which it pretty much delivers. The film has a lot of missed opportunities. I do wish that it had done more -- a lot more -- with all the possibilities. I mean, you've got a place where: children were brutalized and molested . . . multiple suicides had occurred . . . doctors performed excruciatingly painful experiments on the inmates . . . a little seven year-old psychopath would go around slitting people's throats . . . and, a disbelieving film crew from a paranormal T. V. show that thinks it's all a bunch of laughs and \"wind-blowing-through-cracks- in-the-walls.\" I mean: Where do you start? It's a comfortable, easy film to watch. It's not boring . . . but, just don't expect too much.",
         "Other reviewers have already summed up much of what can be said. It is a quite good \"found footage\" style horror movie. The one aspect of note that has yet to be mentioned is that there are some incredibly long, unbroken, shots. These are especially effective as the movie picks up pace. It tends to give the last 45 minutes a real haunted house at the fair feel as we follow our unfortunate cast from location to location within the building. The effects were pulled off well during these unbroken shots which very much helped with feeling that you were along for the ride. While the getting to know the characters portion at the beginning may have benefited by the cutting of a few of the sophomoric jokes the payoff is worth it as it grows from silly to creepy and then on to frantic and finally horrific.",
         "Yet another movie trying to take advance of the presence of this God of cinema called Lance Henriksen, putting him almost on the cover but not so much on the screen. Don't know why he puts up with this, he can and always will do better than this! Now about the movie: I've seen too many like this. Nothing new out of production, acting, plot, scares, ideas, only difference between movies like this or SxTape, Grave Encounters and so many others simply consist on the director's decision or sometimes on the length of the film. Here, they kept it short, I do appreciate quality over quantity but as said they brought absolutely nothing new. Reason to recommend it? Only to pass the time if you are in the dying need of a time killer. No point in saying more than needed, watch it, don't watch it, it all comes up to you. If you do so, expect the expected, you'll get just that. Another typical found footage film, with a crew going inside an abandoned hospital where strange things begin to happen. Ba da dumb! Cheers!",
         "Five members of a documentary crew go to a long-abandoned children's' orphanage to see if there are any ghosts. Before they get inside, they have an argument with the grounds' keeper. He doesn't want to let them inside because of \"incidents\" that have happened in the past. They inform him that they have permission from the owners. Grudgingly, he moves aside and lets them pass. Once inside, they begin filming in the kitchen. Shortly thereafter, the needle on their equipment starts going crazy, and pots start shaking. They think their special effects man, Bill (Lance Henriksen), rigged that to happen. When they're about to leave the kitchen a cat is slammed dead into a wall. That and other incidents that are hard to credit Bill with start making the crew's stay in the hospital very ominous. It doesn't help matters that they haven't seen him since they arrived. I can't really say anything else without giving away spoilers. I have to be honest, I was not very interested in seeing this movie. I read a very brief synopsis of it, and when I read it took place in an old orphanage, I passed on it earlier. I was bored, so I decided to give it a chance, but I wasn't expecting much. At first, the haunts were very mild. Later, they became so much more, as did the movie. The acting was very good, as was the directing and storyline. It's not that original, because there have been many movies that take place in abandoned institutions such as hospitals and such. However, they developed fun characters - especially Julie :D I recommend this movie. I gave this a 7-star rating. This is how good horror films should be done, and it's the first one that I've seen in a long time that I felt really impressed by. My one problem with this is that I really don't like found-footage films very much, because they say that what it is at the beginning, making it obvious everybody dies. I prefer to see that for myself as the movie plays out. Anyway, there's an added scene after the credits, so stay tuned for that.",
         "This film while having no lead stars is one of the best found footage films we have ever seen. With the right amount of tension and surprise this film leaves you satisfied unlike many high budget films nowadays. Leading into the film I can assure you do not know how it is going to end. Craig Efros should be hired by Magnolia to produce their films, his talent really shows in this film and whoever did the set design deserves props as well, no not actual stage props but koodos to the set designer! Special Effects and makeup were great for this indie film - Everyone really deserves the publicity (hopefully) this film will get them.",
         "On the surface, Hollows Grove has cliché written all over it. I really didn't expect to see anything other than a lousy Grave Encounters rip-off. Thankfully, I was proved wrong. Hollows Grove is actually creepy, and doesn't resort to cheap scares. They set the orphanage up quite well from the start and it all unravels at a steady pace. It's not quite edge of your seat, but given the budget it doesn't need to be. Character building is actually done quite well which is a nice change from other films of this sub-genre. Enough time is spent getting to know the crew and their varying maturity levels. It's clear their operation is on quite a small scale and doesn't take itself too seriously - it is called S.P.I.T. after all! It adds a nice humour element which fits in well with the theme of the film. The acting could've been better though, and sometimes it just felt too forced. At one point, I wasn't sure whether the crew were being ironic or serious. Lance Henriksen was probably the only shining light and I wish he was part of the camera crew (maybe instead of Matt Doherty who was hilariously bad) so we could see more from him. Overall, Hollows Grove is a decent horror flick which fulfils it's expectations, whilst avoiding the pitfalls that other found footage titles fall into. I think it merits a watch as you might just find yourself surprised like I did.",
         "It has been a very, very long time since a horror movie made me jump in any way. This one did. The actors were well chosen and believable. I even liked the sexist pig with the inappropriate humor. I loved that the main host, Tim, was a complete skeptic, telling his friend Harold (Potter *chortle*) that it was all smoke and mirrors. Lance Henrickson as the prop master Bill was especially wonderful. He's campy and creepy and all around excellent, even though he is woefully underutilized. The jump scares were plentiful, and very effective, and there were several points during their exploration where my hands were clasped firmly over my mouth to prevent me from making any loud noises and disturbing my neighbors at 1:30 a.m. The ghostly children were rarely seen, which made their appearances more spooky. There's nothing scarier than truly creepy children, and the one who played Lilah the throat slasher was especially creepy. The special effects were well handled, without being overused. It was mostly atmosphere and anticipation that made this a truly enjoyable horror film.",
         "Usually These Ghost Hunter \"Paranormal\" \"POV\" Movies Leave Me Wishing I Had Watched Something Else ... This Was Pretty Scary ... The Movie Starts With An F.B.I. Agent Asking For Your (Yes You The Viewer) Help In Watching The \"Found Footage\" And Helping Them Determine What Happen ... I Thought That Was A Little Silly, But It Caught My Attention And I Watched Closely ... The Movie Uses Really Well The \"WTF Was That\" Moments And The \"Crap My Heart Skipped A Beat\" Special Effects To Near Excellence ... The Script Was Small So The Emotional Acting Was In High Gear And Done Well ... The Last 3 Minutes Of The Movie (Back At The F.B.I. Office) Was Kick Butt ... If That Isn't Enough Watch To The End Of The Credits Where There Is An Extra Scene That Made Me Drop My \"Popcorn\" ...",
         "With their tongues firmly in their collective cheeks, a crew of television ghost hunters (lead by the diminutive and highly irritating Tim Royce, played by Matt Doherty) are reluctantly given permission to investigate an abandoned children's orphanage. One of the benefits of this style of found-footage stories is that, as the characters acquaint the viewers of their filmed footage with information about the building, we – the audience – are also being fed information that feeds our own feelings about the scenario. Equally useful is the less-than-serious attitude of the characters; when strange things begin to happen, they all assume one of their number is responsible. After all, they are filming a ghost-hunting entertainment show. The creaks and shadows are probably the work of their resident effects man, Bill (an underused Lance Henriksen) \u0085 well, aren't they? No matter how puerile their humour is to begin with, the crew's hi-jinks serves a purpose too. The contrast between that and their more panicked, more real reactions later on is marked. And matters do become persuasively creepy. 'Grave Encounters', a similar project from 2011, seems to have been set up as a benchmark for this kind of film, and there are pleasing similarities – with a TV crew in an old abandoned building, there are bound to be. The cast is very good. Only the breath-taking Bresha Webb as producer Julie fails to convince, although there is a post end-credits sequence that redeems her performance somewhat. You'll probably have seen this kind of thing before, but not always this enjoyable in the execution.",
         "Good effort at a found footage. The setting is great and despite how cliché the plot has become thus far, it had everything to be an awesome title in the genre. But... the acting is very bad. Lance Henriksen is the only actor here; the others look as though they are performing in a school play. The agent scenes are cringeworthy and cheesy as hell - as is the actor's job here. Most of the effects are also pretty cheap and the overuse of children's voices and sounds aloud ruined the mood for me. The script is also not free from the biggest pitfall of the genre: when the characters get face-to-face with some weird and scary stuff they simply do not react as any ordinary human being would in the same situation, i.e.: freak out and run the hell away. They end up doing it, eventually, but it takes a whole lot of time and one even gets courageous enough to venture into dark rooms after hearing his name - knowing for sure that it couldn't have been none of his friends who was calling. That being said, the major shooting of the TV show sequence is actually entertaining, as if we are watching the making of Ghost Adventures. The appearance of the bloody girl with the knife is also a very, very nice touch. Had the movie bypassed the flaws that killed its impact and power to scare, this really could have been THE scene. Overall, it accounts to an okay film.",
         "This was an above average \"B\" Horror movie. The actors had me laughing through out the whole movie. Which is a good thing!!! It had a predictable plot but it played out well. The scare anticipation was really good as well as the special effects. A lot of it was Cheesy & Cornball but that added to the movie. And...you have to stick around for all of the credits at the end. Or you will miss out on the Kick Ass music & The last 5 minutes of the story. All in all...it wasn't the best. but it was above average & entertaining!"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Hollows Grove"],
      "summaries": ["A young filmmaker documents his ghost-hunting, reality show friends as their routine investigation of an abandoned orphanage turns into a nightmare from which they can't escape."],
      "budget": 0
   },
   "movielensId": 139301,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-10-21",
      "dvdReleaseDate": null,
      "directors": ["Craig Efros"],
      "runtime": 81,
      "movieId": 139301,
      "title": "Hollows Grove",
      "mpaa": "",
      "actors": [
         "Lance Henriksen",
         "Mykelti Williamson",
         "Matthew Carey",
         "Sunkrish Bala",
         "Bresha Webb",
         "Eddie Perez",
         "Gary Sievers",
         "Tanc Sade",
         "Lindsey Smith-Sands",
         "Val Morrison",
         "Matt Doherty"
      ],
      "imdbMovieId": "4026562",
      "originalTitle": "Hollows Grove",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A young filmmaker documents his ghost-hunting, reality show friends as their routine investigation of an abandoned orphanage turns into a nightmare from which they can't escape.",
      "tmdbMovieId": 298609,
      "avgRating": 2,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/lbuWseZvjyxaEulKrETPdg25YD5.jpg"
   }
}