{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1430620",
      "video": false,
      "title": "Kiss the Abyss",
      "recommendations": [],
      "backdrop_path": "/qtPHRMpTIvKgIBMN8lmuIcOJx8E.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Lesley (as Nicole Moore)",
               "gender": 1,
               "credit_id": "52fe47b2c3a36847f814353d",
               "name": "Nikki Moore",
               "profile_path": "/1GdDqcSGmntSTs1mVzCz1tcWC9C.jpg",
               "id": 1261684,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Stephen",
               "gender": 0,
               "credit_id": "52fe47b2c3a36847f8143531",
               "name": "Scott Mitchell Nelson",
               "profile_path": null,
               "id": 143112,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Harold",
               "gender": 0,
               "credit_id": "5353f8b20e0a265611004d46",
               "name": "James Mathers",
               "profile_path": "/32TmiKQXA988Gh0pl32OY7EgheQ.jpg",
               "id": 1311598,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Garrett",
               "gender": 2,
               "credit_id": "52fe47b2c3a36847f8143539",
               "name": "Mark Craig",
               "profile_path": null,
               "id": 143113,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe47b2c3a36847f8143541",
               "name": "Scott Wilson",
               "profile_path": "/uAPQD3zXThKHXaYELx3ePSzeWwM.jpg",
               "id": 6914,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47b2c3a36847f8143521",
               "name": "Ken Winkler",
               "profile_path": null,
               "id": 143108,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b2c3a36847f8143527",
               "name": "Eric Rucker",
               "profile_path": null,
               "id": 143109,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b2c3a36847f814352d",
               "name": "Ken Winkler",
               "profile_path": null,
               "id": 143110,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.110629,
      "production_countries": [],
      "id": 49960,
      "vote_count": 2,
      "budget": 0,
      "overview": "When a young woman is brutally killed by an intruder, her husband and estranged father conspire to bring her back from the dead with the help of a mysterious desert dweller. Soon after she awakens, she begins to realize that something is horribly wrong...",
      "similar": [],
      "original_title": "Kiss the Abyss",
      "runtime": 88,
      "poster_path": "/5eZzKgIOgltqiXF7IqXcF8xPs69.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-11-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Death is Only the Beginning...",
      "adult": false,
      "homepage": "http://www.kisstheabyss.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Winkler"],
      "runtime": 88,
      "synopsis": "When a young woman is brutally killed by an intruder, her husband and estranged father conspire to bring her back from the dead with the help of a mysterious desert dweller. Soon after she awakens, she begins to realize that something is horribly wrong...",
      "writers": [
         "Eric Rucker",
         "Ken Winkler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1430620/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgyOTQzMDg5NF5BMl5BanBnXkFtZTcwNzIyMjIyOQ@@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "Nikki Moore",
         "Scott Wilson",
         "Scott Mitchell Nelson"
      ],
      "reviews": [
         "To be honest, I had pretty low expectations for this movie when I saw the box cover. They were blown out of the water pretty quickly though. From the unusual premise, to the solid acting, to the wild characters, to the narrative style, there were plenty of surprises. As a whole, it was pretty outlandish concept with some over the top acting. But it really sucks you in as there are some truly unique moments that were very fun to watch. Everything worked well from a technical perspective. The effects were good enough not to detract from the story. The production values were high. I'd give this film a strong recommendation to any horror fans (and people who like weird movies).",
         "Reanimation takes on a life of its own in Kiss the Abyss, a unique indie horror that's full of surprises. By melding the things we learn from stories of Frankenstein, vampires, and zombies into one horror tale, the film provides an interesting bit of macabre that provides several neat turns. Our story starts in the middle of things, as Mark (Scott Wilson) heads into the desert on a secret mission with what we soon learn are his father-in-law and brother-in-law. As the film moves forward, it also works backward to reveal the events that put Mark on this journey, culminating in the death of his young wife Lesley (Nicole Moore). As you can guess - especially if you can read the poster - death is only the beginning. The group's desert destination is the home of something of a magic man, a cowboy named Gus (Douglas Bennett) who uses a couple of simple injections to bring Lesley back to life. In the process, he makes sure to point out that he has no return policy. The three men attempting to restore Lesley to her previous state should take this as a bad sign, but those blinded by love rarely see things clearly in this kind of situation. (Just ask that Victor Frankenstein fellow.) Lesley awakes shortly after the treatment, but she quickly realizes that her life is no longer what it was. She first begins to suspect something when she hears her husband and father arguing about whether or not they should tell her what happened, but things truly get interesting when she begins to notice changes in her behaviors and desires. I won't go into details here, as much of the film's intrigue comes from watching her plight evolve, but it's safe for me to say that the Lesley that came back is not the same as the one Mark married. While the monstrous hijinx are Kiss the Abyss' calling card, I found myself very impressed by the film's attention to the relationships between the characters. Mark and Lesley are at the foreground of all the film's events, but their interactions with others - particularly the difficulty Mark has with his father-in-law - provide added depth to the proceedings. Like other horror tales that grow from good intentions, we're shown two people who are interested in the preservation of Lesley, but the disconnect between them adds to the drama. There are also some interesting twists involving Lesley's siblings that add to the film, and the actors work well within the script to represent the human drama of the story well. The evolution of Lesley's character after the accident is handled very well, and the film uses practical special effects to highlight the changes in the character that drive us toward the film's bloody conclusion. As the film returns to that desolate ranch - you had to assume that no return policy comment meant something, didn't you? - the film speeds up and offers a barrage of carnage that provides plenty of thrills. The introduction of two more undead characters in the final act is a nice touch, as the shifting odds certainly add another dimension to the film's climax. In the end, Kiss the Abyss resonates with me as a thoughtful piece of horror that is confidently made. Director Ken Winkler and his crew have put together a well-made film that is a fantastic slice of modern day mad science, and the cast presents the story quite well. The film still feels a bit hollow - most of the characterizations fit into roles we've seen in other films - but Kiss the Abyss still manages to be wildly entertaining and deceptively thought-provoking. It's more fun than I've had with a new horror film in some time.",
         "Please don't pay attention to the other reviews because they're misleading; this movie is bad. If you're a true movie fan you'll be able to tell within the first five minutes the movie is going to suck; the acting is third class...at best. Don't waste your time unless you don't have anything else to do with an hour and a half of your precious life.",
         "One part coming of age and one part Frankenstein's monster, Kiss the Abyss is a film that is more character study than pure horror. Well, at least until the end that is. Our film starts off with a trio of men driving in a Rolls through the California desert. We aren't really given a 'why.' However, interspersed are a few scenes of one of the men, a young man back home lying in bed with his wife. Slowly, we start to piece things together. After all, she's the only one missing from the car's passenger seating. Along with a distraught look from the young man, you start to think that something terrible has happened. We come to find out through a continued series of flashbacks that these two young love birds lived next to another couple. The boyfriend was terribly abusive and their daily ritual of shouting matches unnerved our other young pair. On one particular day, he takes things too far and starts beating his girlfriend outside. The love bird couple take it upon themselves to try. But it doesn't come without its consequences. Our enraged drunken neighbor comes over that night with bat in hand but instead of taking revenge with the young man, he accidentally kills his wife. Flash forward to our 3 men driving out to the desert, they arrive at a small house and are eventually greeted by a crass, cowboy-ish man who holds the cure for what ails them. As you could probably guess, the dead girlfriend is in tow and she's taken out of the back trunk and taken to the man's shed which doubles as his mad laboratory. Our man, who acts the part like a cross between Billy Bob Thornton and Dr. Frankenstein, is given a bag of money by her father and brother (the other two travelers being revealed as such). They are given a strict direction by our mad doctor of 'no return policies.' All oblige and he shoots her up with some sort of serum. She comes to and the small group leave to continue on with their lives. But they soon learn that they're getting a lot more than they've bargained for. I won't go to much into the rest of the details of the film as I don't want to play the spoil. But as you can imagine, our revived wife becomes too much to handle in her newly 'transformed' state. And our dedicated husband with his undying love is left with a choice to make. A refreshing film that delicately balances the relationships of all of our on screen characters (without getting too cheesy) along with some really horrible happenings (one scene in particular is pretty brutal), Kiss the Abyss is continued proof positive that original film making and story telling isn't dead.",
         "Originally posted on www.allthingshorroronline.net Watching Kiss The Abyss, I couldn't help but catch references to other classic stories. The film has Shakespearian overtones, not only with its theme of star crossed lovers, but also in a powerful patriarch's inability to loosen his grip on his family, and how it ends up costing him everything. The movie also recalls O Henry's The Money's Paw in ways that will seem obvious once you see the film. Lesley (Nicole Moore) and Mark (Scott Wilson) are a young couple that makes up what for what they lack in wealth by being head over heels for one another. As they eek out an existence against the wishes of Lesley's overbearing father, they also have to deal with their loutish, abusive neighbors. After Mark beats the snot of the his next door neighbor for putting his hands on his girlfriend one time too many, Lesley ends up paying the price at the receiving end of a Louisville Slugger. That's when things take a turn for the weird. Mark joins forces with Lesley's father and brother (Scott Mitchell Nelson) and the trio share an uncomfortable car ride out to the desert. For a bag full of unmarked bills, the local witch doctor will happily bring Lesley back from the dead, no questions asked. The problem is, he's not willing to answer any questions either, and he has a definite no returns policy. It's difficult to categorize exactly what Lesley is when she wakes up. She craves human blood, but direct sunlight seems to have no effect on her, so she's not quite a vampire. She looks rotted away and her flesh continues to deteriorate, but she's also self aware, so she's not quite a zombie. She's definitely dangerous, as it becomes increasingly difficult for her to control her bloodlust. While the violence comes in quick outbursts, what's there is brutal and looks gruesome. Lesley looks more horrific as the film marches on, eventually peeling off layers of skin from blackened and exposed veins. (FX artist Jenn Rose won a well deserved \"Best FX\" work at the 2010 NYC Horror Film Fest for her work here.) The film builds quietly over the first two acts before it all goes to hell once the action returns to Gus' home in the third. We see exactly the how in Gus' magic show. We're also introduced to his wife, a comically filthy and obese woman that provides some outstanding \"What The?\" moments. Co-writer and director Ken Winkler does a remarkable job in the first act of keeping the audience on its toes by flashing back to the happier times between the couple leading up to Lesley's death then cutting back to the present day out in the desert, and the desperate attempt to revive the girl. The film works due to the strong performances of Moore and Wilson as the leads. You believe them as a couple, and there's a hint of Romeo & Juliet levels of tragedy for the pair as family pressure seeks to keep them apart. Even in her later form as a blood-craving monster, Moore exudes a vulnerability that leaves the viewer more sympathetic than horrified at her plight. Fans of Lost should pick up on the villainous vibe of James Mathers brings to his role as Harold, Lesley's father who disapproves of her relationship with Mark. He brings a very Charles Widmore vibe to the role. Not only does he resemble that character physically, he has enough wealth an influence to buy off the law, and eventually death itself. The film takes great pains to slowly reveal his layers of villainy. While depicted at the outset as a man that simply wants to separate the couple, the film gradually reveals his corrupted nature and moral turpitude. On the other end of the baddie scale is an immensely entertaining performance by Douglass Bennett as Gus. Bennett channels a hyper kinetic Harvey Keitel in his role as a Podunk Shaman. He's responsible for bringing Lesley back from the dead, though he conveniently leaves out the side effects of the process. As far as he's concerned, the group can chalk up any incidents to buyer's remorse. The above two characters provide a terrific contrast to Moore's Lesley. She's more of a tragic figure than a monster. The film does a credible job of mixing in sympathy for the girls' plight along with the horror of her subsequent actions. Due to events outside of her control-first at the hands of her neighbor, followed by those of her lover and family, she comes back as a monster by nature. Her father and Gus are different animals completely. Harold's wealth and influence afford him power over others. Morality is something that can't be excused by waving dollars at it, so it never enters in to his decision making process. Gus is simply weird. He has the means at his disposal to play god, and he's simply giddy with power, consequences be damned. Kiss The Abyss works because of its restraint. It focuses more on the relationships between its characters and provides a pair of human monsters whose evil far outstrips that of its central creature. It works in moments that keep the audience off kilter, and it benefits from strong performances across the board. It's a different sort of indie horror-where a lesser film would focus on the blood and gore, Winkler's much more interested in exploring what really makes a monster. The film is that much stronger for that effort. Seek this one out.",
         "This is more than just another horror film. There are complexities intertwined in the story that include the deep devotion of young love, the corruption of character that money can sometimes cause, and how power over life and death, in the wrong hands, can make a person crazy. The characters are both believable and colorful and ultimately ones you won't soon forget. it is refreshing to see the effort at character development was as important as the shocking action scenes and the horror of Leslie's descent into darkness. The film's creepy aspect was intensified by the unique monster, and the desert dwelling couple that will make your skin crawl. I would like to see more from this young writer / director.",
         "When it comes to indie horror movies, each one has a different draw to it. Some are cheesy and over-top while others are more suspenseful. \"Kiss The Abyss\" is a suspense horror by Risen Pictures. This film is a tragic tale leading to a dubious ending, written and directed by Ken Winkler, starring an emotional cast of players, and featuring impressive make-up F/X that draw you in till the very end. We start out with a young married couple, Leslie and Mark. They struggle with money and do not live in a very safe neighborhood which results in Leslie's unexpected death. A mysterious man in the middle of the desert is able to bring her back to life but with dire consequences. She begins to thirst for blood and transforms into something, but it's not what you think. Also co-written by Eric Rucker, \"Kiss The Abyss\" is the first major effort from both men and it's a decent one, even earning high praise at the 2010 FreakShow Film Fest (which is where we first saw this film) in Orlando, Florida. Together, they create a mixed-bag of emotional characters. While some characters were excellent, their development was not. They receive little explanation as to their relationships to each other, and it takes some time for us to learn names which is exacerbated by the rather choppy opening. The film opens in the middle of the time-line and flashes back frequently to before and to the point of Leslie's death but never explains what happened during the three day gap. The 2nd act is when the plot really gets going. Leslie and Mark were played by Nicole Moore and Scott W. Wilson respectively. Their performance was very heartfelt and tender. They were clearly the best choice for this picture. While Moore and Wilson were the heart of the film, Douglas Bennett stole the show as the back woods necromancer, Gus. Bennett's scenes were often humorous in creepy way. His performance did not over blow the character's \"redneck\" nature and he seemed to be more intelligent than your average horror movie hillbilly. James Mathers plays Leslie's corrupt rich father, Harold. Mathers tended to overact his part, seemed devoid of any emotion, and overall was just not believable. Finally, we come to the make-up. The blood and the injury effects were professional grade which has become standard for indie horror movies these days. What really makes the film stand out is the effects of Leslie's transformation, progressing with each new scene. This really makes the film more suspenseful as you wonder how she will change next and what she will become. This theme is reminiscent of \"The Fly\" (1986) as the audience watched Brundle's transformation. This film has a hidden theme which reiterates the age old question \"what makes a monster?\" Was it the literal and physical monster of what Leslie was becoming or the metaphorical monster of Gus and Leslie's selfish father? It may be a story told before, but this film tells it in a unique way. Overall, not too bad of a film, and an excellent first effort. If you like \"Cat People\" or \"The Fly\", you'll love \"Kiss The Abyss\". Definitely an indie gem well-worth checking out! Reviewed by: Dave Mongeni www.stiffmag.com"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Risen Pictures"],
      "summaries": ["After a young woman is brutally killed by an intruder, her husband and father conspire with a mysterious desert dweller to awaken her from the dead. Soon after she awakens, she begins to realize that something is horribly wrong."],
      "budget": 0
   },
   "movielensId": 139555,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-11-14",
      "dvdReleaseDate": null,
      "directors": ["Ken Winkler"],
      "runtime": 88,
      "movieId": 139555,
      "title": "Kiss the Abyss",
      "mpaa": null,
      "actors": [
         "Nikki Moore",
         "Scott Mitchell Nelson",
         "James Mathers",
         "Mark Craig",
         "Scott Wilson"
      ],
      "imdbMovieId": "1430620",
      "originalTitle": "Kiss the Abyss",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["UQWO2GZjhKQ"],
      "plotSummary": "When a young woman is brutally killed by an intruder, her husband and estranged father conspire to bring her back from the dead with the help of a mysterious desert dweller. Soon after she awakens, she begins to realize that something is horribly wrong...",
      "tmdbMovieId": 49960,
      "avgRating": 0.5,
      "releaseYear": "2012",
      "numRatings": 1,
      "posterPath": "/5eZzKgIOgltqiXF7IqXcF8xPs69.jpg"
   }
}