{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "literature",
            "id": 2132
         },
         {
            "name": "brotherhood",
            "id": 3156
         },
         {
            "name": "connecticut",
            "id": 6981
         },
         {
            "name": "morgue",
            "id": 10326
         },
         {
            "name": "lacrosse",
            "id": 10825
         },
         {
            "name": "coroner",
            "id": 156179
         },
         {
            "name": "initiation",
            "id": 156180
         },
         {
            "name": "lecture",
            "id": 156181
         },
         {
            "name": "ducati",
            "id": 156182
         }
      ],
      "imdb_id": "tt0278723",
      "video": false,
      "title": "The Skulls II",
      "recommendations": [
         10594,
         220353,
         78051,
         70024,
         11478,
         49597,
         249391,
         66192,
         27885,
         45102,
         55377,
         36868,
         24585,
         35683,
         117904,
         39158,
         10055,
         1959,
         5458,
         41671
      ],
      "backdrop_path": "/aEjfP4DWshIDPhEFaFUq3W4XhXC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ryan Sommers",
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a34dd",
               "name": "Robin Dunne",
               "profile_path": "/933wsoMxTv9ovQxzX5U1Jie3nOs.jpg",
               "id": 43426,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Parker Neal",
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a34e1",
               "name": "Nathan West",
               "profile_path": "/k57Ho1zta5p76jegUbR0JmYkzHB.jpg",
               "id": 55115,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ali",
               "gender": 1,
               "credit_id": "52fe44abc3a36847f80a34f7",
               "name": "Ashley Tesoro",
               "profile_path": "/oOslnZlJsUEaopSum6piX6WFyju.jpg",
               "id": 55875,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Kelly",
               "gender": 1,
               "credit_id": "52fe44abc3a36847f80a34fb",
               "name": "Lindy Booth",
               "profile_path": "/q1UqBcQT3nKTsMIe4rOmb2Fp7K1.jpg",
               "id": 51936,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Greg Sommers",
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a34ff",
               "name": "James Gallanders",
               "profile_path": "/sLnNV5VEU27kiJJFkQyBzJq0nnu.jpg",
               "id": 55876,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Winston Taft",
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a3503",
               "name": "Andrew Gillies",
               "profile_path": "/u2kf1FH3GsniNA5QwPOCx0xzfiT.jpg",
               "id": 55877,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a34e7",
               "name": "Joe Chappelle",
               "profile_path": "/c8FjB7yev0pGHSyFbxWc2N2ZIaJ.jpg",
               "id": 55116,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a34ed",
               "name": "Hans Rodionoff",
               "profile_path": null,
               "id": 55873,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44abc3a36847f80a34f3",
               "name": "Michele Colucci-Zieger",
               "profile_path": null,
               "id": 55874,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44abc3a36847f80a3509",
               "name": "Steve Danyluk",
               "profile_path": null,
               "id": 55878,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.041015,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8460,
      "vote_count": 29,
      "budget": 3800000,
      "overview": "After joining the Skulls, Ryan Sommers (Robin Dunne) is warned not to betray any secrets about the organization or its high-powered members. However, when Ryan witnesses a murder within the Skulls' private chambers, he finds that the closer he gets to revealing the truth - the more dangerous life becomes.",
      "similar": [
         2196,
         1024,
         309
      ],
      "original_title": "The Skulls II",
      "runtime": 99,
      "poster_path": "/8KKSRseqzteQ6lUu4U48eUvHBpC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Universal Home Entertainment",
            "id": 6384,
            "origin_country": ""
         },
         {
            "logo_path": "/5xUJfzPZ8jWJUDzYtIeuPO4qPIa.png",
            "name": "Original Film",
            "id": 333,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Newmarket Capital Group",
            "id": 506,
            "origin_country": ""
         }
      ],
      "release_date": "2002-04-09",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/mTPVUQJ87z7FzJvtmCjXixJb8iD.jpg",
         "name": "The Skulls Collection",
         "id": 8647,
         "poster_path": "/t2O0jkYLVRBfZpT7btzJv3lzPh1.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Chappelle"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "John Pogue",
         "Hans Rodionoff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0278723/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTY0MTA5OTU2MF5BMl5BanBnXkFtZTcwNjYzMzUyMQ@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Robin Dunne",
         "Nathan West",
         "Ashley Tesoro"
      ],
      "reviews": [
         "The premise of the Skulls and it's sequel is that we are looking at the inner workings of one of America's (fictional) secret societies. Unfortunately because it is a sequel it will be compared to the original. This film has the same premise as the first film. A young college student who is 'tapped' to become one of the elite of the elite, a problem crops up and there is a lot of running in fear for the life of our hero. This installment offers up more sexual energy and more likable (and well played )dislikable characters, a few minor changes in casting could have been made. For instance the abundance of overly WASPish pretty boys. Without debating how ethnically diverse secret societies are, I'm sure all the younger members are not all pretty boys. The story, what little of it was there, does turn the previous movie on it's ear, sort of. Which would have been more refreshing had it had the sence of suspense and wonder of the original and excluded the somewhat rushed-wanna-be-a-cool-plot-twist-but-wasn't ending. Make no mistake though, I am not saying that the first one had a lot of suspense, it just seemed to have more.Unfortunately the performances of the young actors could not bring this movie to life. All in all, I would recommend it if you are not looking for much depth or story.If you're looking for a movie to satisfy look for something else. I would give it a 3 out of 10.",
         "So, where should I go with this one? I am pretty sure that most can realize how bad of a film this was without needing me to spell it out for you, but then some of us do need guides, so here it goes. The Skulls II is a classic example of a movie company trying to monopolize on the semi-success of the original. Using the rules of low-budget sequel making, they get lesser-known actors to replace the better known actors from the original. They repeat several select scenes that resemble the original so that the audience doesn't get confused, while all the while continuing with a similar story from the original. At first glance, you may not realize that there is a difference between these two films outside of the grade D actors that are trying to make a name for themselves. When will Hollywood realize that they need to stop doing this? The original Skulls film was not a box-office sensation, so why suck even more money from an already dried well? Then to see that there is already another film released for those of us that are foaming at the mouth to get more of this secret society makes me sick. Why Hollywood, why? Let me begin by getting the shredder out. The acting was horrible. I mean, I have seen some bad acting in many of the films that I have seen over the years, but that done by Robin Dunne and Nathan West was despicable. It was obvious from the opening sequence that they were more excited about being in a film than the overall quality of the film. This was not a good sign. The only successful task that these young actors did for me was taking me from minute zero to minute ninety-eight. The progressed the film, if that is what you want to call it. Of course, how can you act if you are handed shoddy material anyway? None of these characters were developed or better yet underdeveloped. I would have been happier with underdeveloped characters because I could have blamed the writers, but instead I have found that both are to blame. For lack of a better word, the actors in this film were lazy. They accepted bad parts for money, and that is never a way to boost your career. If you have noticed, these guys haven't gone further with their jobs, and I would be blaming this film if I were them for their lack of good employment. Another aspect to toss in the shredder is the concept of continuity. When one directs a film, you must possess within your bag of goodness the ability to move the characters from point A to point B fluently. For those of you that have seen this film, you will probably agree with me that director Joe Chappelle did not have this talent. There were so many holes in this story that he tried to fill with scenes from the original that forced Chappelle to shoot himself in the foot. I could not get involved with the plot of this film because one moment the organization was doing something, and the next they were doing something completely the opposite. Perhaps it was the laziness of the characters that opened these holes, but we cannot leave out Chappelle. He should have pushed his team further and used his leadership abilities. I have spoken before that I felt as if the actors were there to collect a paycheck and jump-start their careers, I feel the same about Joe Chappelle. Could he not see the overall awfulness of this film? When did he finally look at the finished product and say, 'We have an Oscar winner here!' If he said this, then I would question Chappelle's ability to direct. Finally, I would like to make a quick comment about the use of CGI in this film. For those of you who have seen this horrible, horrible film, you probably missed it because of the burning sensation coming from your eyes. It says something about a film when the only use of CGI is on a trashcan. A trashcan being hurled towards a person is a waste of studio money and viewers patience. I laughed hysterically when I saw this because I could see Chappelle getting excited about this scene. What kind of damage could a plastic trash can do to anyone? It is a tough question, and I am thankful that hard-earned money went towards the creation of this piece of cinematic history. Overall, I have had enough about this organization. For this series to continue, the creators, directors, or film studios will have to completely break the norm and go out on a limb. As I can see from the next one it looks like they have a woman that wants to join the organization. That is not the limb that I am talking about. This (now trilogy) was failed from the beginning, yet the Hollywood recycle factor chose to release it over and over again. It was sad to see these actors and director fail, but it should have been obvious from the beginning when they were handed the direct-to-video release script for The Skulls II. I encourage you to avoid this film at all costs. There is nothing redeemable in it at all. Grade: * out of *****",
         "Excellent film that is much better than the original. Robin Dunne has so much more appeal than Joshua Jackson. I wonder why Dunne doesn't get better roles? Maybe he needs a new agent. The film features Dunne as Ryan Sommers, an Ivy League stud who is tapped for a secret society called The Skulls. Joining this club is a dream come true for every hot-blooded college man and at first all is well. Then when Ryan witnesses the death of another student, all kinds of danger and deception occur. This film is so good, it makes me want to go back to high school and study more for the SAT so I can get into Yale. Anyway, Sommers' love interest Kelly played by Lindy Booth is also very appealing. Listen to the closing credits music as well. It's quite good. I definitely recommend this film to others.",
         "Wow, was this movie not worth seeing. After the first Skulls, I was excited to see the second one. What a let down. The sequel has nearly the same story line as the first one except with lesser known actors. Definitely not worth the rental fees on this one.",
         "A young college co-ed seeks to join an all male fraternity following the death of her brother, as she also seeks the approval of her father who has never been anything but cold to her because of her gender. In her quest, she endangers the lives of every and any body who is close to her, including her best friend roommate as well as her boyfriend. When she is denied access into the cult, she threatens to take a civil action against the leaders and is granted temporary access to be tapped as an inductee. Someone on the inside certainly doesn't want this outside in there and so makes life extremely uncomfortable for the inductee as she makes her rounds, hoping to become a full fledge member. Things go terribly awry on campus when she makes it into the fraternity as its only female member.",
         "As far as sequels go, it is par for the course. Here they had a great plot, and excellent possiblities but I think they could have taken it farther. There are tie-ins with the first and takes the conspiracy deeper. It's always good to see a lone wolf rise up and rage against the machine. Good times.",
         "My God, what can be said. This doesn't even stand up to the usual poor quality of horror/thriller sequels. The really unfortunate thing is that the script actually stood a chance, but the flick itself went into the dumper the first five minutes and never recovered. Just to begin with, what is with all the beautiful people in the same place at the same time...? Is this like a Baywatch Goes to College movie? Then there's all the \"secret societies\" on the campus of this college. Does anyone ever go to class, or do they just run around in robes, hosing beautiful coeds wearing bras that push their boobs up under their chins? Then this \"secret society\" passes out rulebooks with the person's name on it that owns it? Gee, there's a really brilliant idea. I don't say this often, but I truly feel as if I've been robbed of 99 minutes of my life I'll never get back.",
         "This Skulls sequel is much better than the first! I didn't have much faith in it when i rented it, but it ended up being an exciting suspenseful thriller, with a great story line. I loved Lindy Booth in it, she's adorable. I recommend this movie to anyone who liked (or hated) the first. I really liked it. 10 out of 10.",
         "I consider myself very open minded, my boyfriend was telling me about how awesome the Skulls trilogy was and that I would probably love it too. He had all three movies so we watched them together and the first film was just alright, it was clichéd and predictable but overall harmless and had some good moments. The second Skulls movie I was told that it was decent enough to watch so giving it a fair chance I was honestly not that impressed, however I think this was a better attempt at the story vs. the first film because it wasn't as predictable and they tried to give it better twists and turns. However the film really couldn't hold my interest that well, so I think like the first film, it just needed a little more loving and could have been a much better movie. Like most sequels, it does fall a little flat not holding up to the original. The action is good, the story is better, it just needed to be executed correctly and had more focus. The red-robed Skulls are at it again. The exclusive, sinister secret society that makes hazing seem like pillow fights inducts Ryan Sommers, who later secretly witnesses what appears to be the death of a woman at the hands of a Skull member. But of course, he can't tell on a Skull because the motto is \"A Skull above all others,\" which is how some of these guys get to be high government leaders and megalomaniacal industrialists. Ryan's conscience bothers him anyway but once he begins investigating how to report the crime, his girlfriend, Ali, rejects him and seemingly everyone in a position to help him is a Skull. With the inspiration of lovely, good-hearted Kelly, Ryan proceeds to do what's right, even if it's wrong for him. The Skulls 2 has the opportunity to be much better than the first film however due to low budget, writing, direction and the bad actors; it wasn't given the proper attention. There is too much going on at times for you to really catch on and enjoy the film. However, like I said, this story does work a little better for me. I like the idea that this guy not only wants to get into this club, but that he enjoys everything about it and he just finds himself in the wrong place at the wrong time, going in a little too deep vs. the typical \"too good to be true\" scenario. The government being evil plot is way over used in movies and The Skulls trilogy had a good chance to make this a little more entertaining since this secret society supposedly does really exist, however it's just not well written. I found the relationship between the two leads a little forced and somewhat made for TV. Especially when he sees the girl that he liked originally, Ali, and she walks up to them crying hysterically, I thought that was more meant to get a cheap thrill from the audience. I felt that we knew what was coming to her and should have just left it at that. I don't know if I'd recommend the film, I watched it just to see if it would offer anything good over the first film; it does alright, but just could have been way better. 3/10",
         "Absolutely one of the worst sequels I have ever seen. The plot, almost an exact copy. The first 20 minutes, almost a precise replay from the first movie. The characters, lousy and cheap casting. It all ends up so predictable. Leaves me with one question: Have the people who paid for making this movie actually seen the first one ??",
         "OK, I respect anyones opinion of this movie... although those who haven't seen the first film will not understand the second! For one... the money the society gets is from all the previous members... it explains in the first film that it is a rule that once they leave school and get a job some of their earnings belong to the skulls society! Like I said I respect anyones views on any film but before you consider to judge the second in a trilogy and get confused then you need to learn to watch them in order before judging the film! I love the full set of films although the first one was my favourite since it gave more information about the secret society and its rules!",
         "I enjoyed The Skulls a good deal on account of some charismatic acting by a number of individuals led by Paul Walker. It was not, however, as enjoyable a film as I had been led to believe but curiosity resulted in my watching The Skulls II. Was I disappointed? Certainly not! This film is much better than the original. The actors are certainly no less charismatic. The plot is infinitely better and the interplay between the characters leaves the first film looking worse than it had seemed at the time. I expect that most people will dismiss this film without watching it, as a sequel to an unspectacular film does not exactly draw the crowds. It would, however, be their loss if this were so. I am certainly pleased that I have seen it.",
         "sometimes, coffee tastes like being brewed twice, so does this movie. first part was not more than average, second part was not more than the worst. same scheme allover the movie, this movie is just for killing your time!",
         "This is one of those movies that you just sit in front of, it just happens to you, like a nap, and twenty minutes after it is gone, it is hard to even remember what it was all about. I will try... We are, in a total retread of the original, dealing with a pretty, young, rich, white male, trying to enter the secret 'Skulls' society, that exists in Ivy League schools, and control the world, or something. *Minor Spoiler* The movie has little in the way of internal logic. The leaders of this society are willing to call the police over a death in a secret ceremony involving knives. But go to extraordinary measure to cover up, a drunk woman falling off a roof, something the police would assume was an accident anyway. So once again, top secret ceremony 'death' = call the police, total accident = cover up. *Spoiler* Everything you expect to happen, happens, with the exception of the 'slutty' female getting nude. Which isn't a good twist. Avoid unless you like pretty young things, who can barely act, in unbelievable plots. Or if like me, you just can't resist a bad movie...",
         "An improvement over the first one. This entry has almost the exact same plot as the first one. A student is killed and The Skulls set about covering up the death, but a student witnesses it and tries to bring The Skulls to justice. Nothing really remarkable, but the film is decently paced, and has an appealing enough cast and some sexy moments. Plus it isn't nowhere near as cliched and over the top as the first one. Rated R; For One Scene of Partial Nudity.",
         "**SPOILERS** Being tapped by \"The Skulls\" to be inducted into their secret bone-head society is something that every young collage student in this unnamed Ivy League school has been dreaming of and young Ryan Sommers, Robin Dunne, is one of the lucky few who's been chosen. Instead of taking his role seriously as an up and coming Skull Ryan pulls off a joke on the \"Skulls\" during one of their secret ceremonies that. This bone-head prank lands him and his \"Skull Soulmate\" Jeff Colby, Christopher Ralph, on the Skull Sh*t-list and has Ryan and Jeff doing toothbrush duty at the \"Tombs\", the Skulls headquarters, attic. Hearing some noise Ryan notices, outside the attic window Skull member Matt \"Hutch\" Hutchinson, Aaron Ashmore, fooling around with the captain of the collages Womans Lacrosse Team Dianna Rollins, Margot Gagnon, and after getting good and drunk she loses her balance and fall off the roof. It's then when all hell breaks loose with top and senior members of the Skulls moving heaven and earth to keep Dianna's death from going public and implicating their secret society; which no one is supposed to know even exists. There's a lot of huffing and puffing and nothing else as Ryan is put through the ringer in an effort to first quite and then later terminate him to keep this incident from reaching the newspapers and exposing the mysterious Skulls in the most unflattering way. It's hinted in the movie, with references to the first Skulls film, that killing is nothing new and surprising with the Skulls. So why are they so panic-stricken now when with their total control of the media police doctors lawyers as well as local and state politicians to cover-up of Dianna's death! We have instead of a powerful society totally controlling Ryan and later his turn-coat brother Greg, James Gallarders, having to go all-out to shut them up before they spill the beans on them and possibly exposing their secret society. Even the evidence of Dianna's death that was covered up by the local coroner Dr. Sprague (Simon Reynolds), who faked it up to be a traffic accident, is so shabbily hidden that a schoolboy could have found and stolen it. Dr. Sprangue wasn't that effective either in hiding his report on Dianna's death by leaving his office opened as he was checking out the latest, and most well-developed, female students for the towns collage next semesters Anatomy class. Poor Ryan loses his up-tight and scheming girlfriend Ali, Ashley Cafagana-Tesoro, who only loved him because he was a Skull and someone who can open doors for her in the world of power politics. As soon as he wasn't Ali threw Ryan out of her dorm and her life and hooked up with Hutch who killed Dianna. Ali later even threatened to press charges against a confused Ryan for giving her a shinier on her left eye! Something she got from tickling Ryan not him purposely belting her. In the end all the dirty laundry about the Skulls comes out in the wash due to Ryan and his new girlfriend and Ali's dorm-mate Kelly, Lindy Booth. With the not now so secret secret organization facing criminal charges in Dianna's, as well as who knows how many others, death they get their big guns out as they gather together in the Skulls secret \"War Room\". There they decide to put an end to all this shenanigans once in for all by kicking out the person who they feel is the reason for all this bad publicity they've been getting lately. As usual the skulls screw up again, in trying to protect themselves and the future of the secret Skull society by dumping on the very person who would have saved them all this embarrassment. The person who tried t keep the all-too-normal and clear thinking, for the Skulls, Ryan from being taped into their lame-brain society in the first place.",
         "Okay, So I don't really remember that much about the first Skulls, but what I do remember is Paul Walker, and that's enough for me. And, although, I don't think Joshua Jackson is that cute, in my opinion, I did think that he had a certain charm in the film. However, I never though that Paul Walker would be in danger of being the less hotter of the two, but Robin Dunne, makes that a reality. He is one of the HOTTEST actors of our time, or at least in my generation. But, other than how hot Dunne was in the movie, which is a big part of the film, the movie itself, was quite surprising. I was happy to find that this movie was just as good, if not better than the first Skulls. It had some great intense scenes, and some great plot twists. It kept you guessing as to what was going to happen next, and made you stick around for more. With more than a few chase scenes, and sexy boxers and bras, the movie really helps show off Dunne's great acting ability. Which, you might be surprised to find, already knowing that he is hot, and can't even being able to imagine that his acting could be as good as his looks. The two female leads were good. The brunette was probably better at playing a bitch, than the blond was at playing sweet and innocent. But I liked both, and was jealous of both, not only because they got to share the same air, as Robin, but also because they both got to kiss Robin! But, all in all, I think that the film was definitely worth watching, and I'm glad I gave it a chance instead of pawning it off as just another dumb sequel. So check it out...you'll like it.",
         "This movie is even worse then the first. The script is very standard. The acting is poor. In my opinion they try to get the most beautiful people in the same place. The characters don't go to class and don't have a reason to be in university what so ever. It is interesting to see a movie about a secret club. In the Netherlands of course no such thing exist.. there are society's of course, but they just drink too much and have too many parties. They don't go around and kill people. For me this is a disgrace to the genre. Just another teen thriller. This is done too many times, but there are only a few really worth watching. this is not one of them."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Universal Pictures Home Entertainment (UPHE)",
         "Original Film",
         "Newmarket Capital Group"
      ],
      "summaries": [
         "After joining the Skulls, Ryan Sommers (Robin Dunne) is warned not to betray any secrets about the organization or its high-powered members. However, when Ryan witnesses a murder within the Skulls' private chambers, he finds that the closer he gets to revealing the truth - the more dangerous life becomes.",
         "Sequel to The Skulls has another underachieving college student, Ryan Sommers, and his friend, Jeff Colby, who are tapped to become members of the mysterious secret society \"The Skulls\" at the urging of Ryan's older brother Gregg, who is already a member. But when Ryan witnesses the murder of a local college girl by another member of the society and it's covered up to look like an accident, Ryan risks his life and freedom in an attempt to expose the truth and in so doing, finds himself in way-over-his-head trouble where no one, not even his best friends, his girlfriend Ali, or his enemies can be trusted when they put some blackmail leverage on Ryan to keep him quiet about the incident.",
         "After a college student is tapped to join the elite secret Skulls fraternity, he witnesses a girl's death and his life starts falling apart."
      ],
      "budget": 3800000
   },
   "movielensId": 139799,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-04-09",
      "dvdReleaseDate": null,
      "directors": ["Joe Chappelle"],
      "runtime": 99,
      "movieId": 139799,
      "title": "The Skulls II",
      "mpaa": "R",
      "actors": [
         "Robin Dunne",
         "Nathan West",
         "Ashley Tesoro",
         "Lindy Booth",
         "James Gallanders",
         "Andrew Gillies"
      ],
      "imdbMovieId": "0278723",
      "originalTitle": "The Skulls II",
      "genres": [
         "Action",
         "Comedy",
         "Thriller",
         "Romance"
      ],
      "youtubeTrailerIds": ["YOIJl-ahy-k"],
      "plotSummary": "After joining the Skulls, Ryan Sommers (Robin Dunne) is warned not to betray any secrets about the organization or its high-powered members. However, when Ryan witnesses a murder within the Skulls' private chambers, he finds that the closer he gets to revealing the truth - the more dangerous life becomes.",
      "tmdbMovieId": 8460,
      "avgRating": 2.25,
      "releaseYear": "2002",
      "numRatings": 14,
      "posterPath": "/8KKSRseqzteQ6lUu4U48eUvHBpC.jpg"
   }
}