{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "champagne",
         "id": 5165
      }],
      "imdb_id": "tt3544048",
      "video": false,
      "title": "A Year in Champagne",
      "recommendations": [
         347264,
         130410,
         329155
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "535da34a0e0a264fd800572f",
               "name": "David Kennard",
               "profile_path": null,
               "id": 103414,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "535da3960e0a264fe50059b7",
               "name": "Jamie LeJuene",
               "profile_path": null,
               "id": 1314391,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.515251,
      "production_countries": [],
      "id": 267091,
      "vote_count": 6,
      "budget": 0,
      "overview": "The exploding cork. Endless tiny bubbles floating up and up in the glass. An indulgence. A celebration. A seduction. A triumph. This is the essence of Champagne, isn’t it?  But it’s not just bubbles in a glass that makes the wine, or the mystique. Only sparkling wine produced within the boundaries of the Champagne region is truly “Champagne.” At first glance, the region is not an obvious source of romance. Champagne’s history is grim and bloody, swept by war and destruction from Attila the Hun to the filthy trenches of WWI and the Nazi depredations of WWII. The environment for winemaking is desperately hard — northerly latitude, chalky soil, copious rain, frost, rot. Yet it’s these difficulties that help make the wine unique.",
      "similar": [
         6620,
         12657,
         17281,
         13704,
         458651,
         17824,
         24197,
         14215,
         16539,
         471942,
         256412
      ],
      "original_title": "A Year in Champagne",
      "runtime": 82,
      "poster_path": "/tMK7nD2fEpVLXc6geZ1JTJ3YqTs.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-02-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Discover the Intoxicating Story Behind the World's Most Famous Wine.",
      "adult": false,
      "homepage": "http://www.ayearinchampagne.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Kennard"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["David Kennard"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3544048/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjIyMTQzNTk1N15BMl5BanBnXkFtZTgwNjg4MDIwNDE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": ["Martine Saunier"],
      "reviews": [
         "I knew the basics for how they made champagne--the region of France, the three grape varieties they use and the process by which they removed sediment from the bottles. But this is only talked about in detail at the very end of the film. What's before that is a look at the life of the champagne producers from several different houses--and how incredibly obsessive-compulsive they all are. This is NOT a process for folks who aren't obsessive....and the rules, rules, rules are often seemingly arbitrary. But all this make for a nice little film. Combining this story with lovely classical music, nice narration and rate glimpses at the families who live, breath, drink and think champagne all make a lovely film--one best savored by those who love this heavenly drink.",
         "Subtitles are particularly crappy in this snail-paced look at Champagne. (Example: the \"liqueur d'expedition\" is NOT \"liquor\" but sweet wine.) For all the time spent ballooning over the vineyards and watching machinery turn, there's no single coherent explanation of what Champagne actually is, why there's a need to remove sediment after the second fermentation, etc etc etc. And what's Martine Saunier doing here? She imports one of the central characters into the US but not a peep from her about how Americans perceive Champagne. Writer-director David Kennard is also responsible for the equally dreary \"Year in Burgundy.\"",
         "With all your rules and regulations (ridiculous pretentiousness) you still can't live down California wine. It has beaten French wine and Champaign to a bloody pulp since the early 1970s. Wine made by total hippies from 60's era Northern Californians. Judged by the French to be the best of the best. You should all chill out and tour Marin and Sonoma County take a limo-driven tour and see the American Redwoods for all their glory. It won't take long to figure out you're in God's country It would do all winemakers a true solid. Seriously, it's not that serious and it's not rocket science. The love of the art does so much more than pruning all your vines like your neighbor. Don't knock California. We make the best wine in the world. I challenge anyone, anywhere, simply because we are the best."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "Renowned wine importer Martine Saunier returns as our guide in the second installment in a trilogy of wine films. Here we get a rare glimpse behind the scenes into the real Champagne through six houses, from small independent producers to the illustrious houses of Gosset and Bollinger. In the vineyard, 2012 threatened to be 'the year of all our fears.' But most Champagne is not just the product of a specific year and its weather. Signature house styles are creations that happen behind closed doors and in the miles of cellars beneath Champagne. Pull back the curtain and see how the people of a cold, tough land with a grim history triumph in producing the drink of joy, seduction and celebration.",
         "The exploding cork. Endless tiny bubbles floating up and up in the glass. An indulgence. A celebration. A seduction. A triumph. This is the essence of Champagne, isn't it? But it's not just bubbles in a glass that makes the wine, or the mystique. Only sparkling wine produced within the boundaries of the Champagne region is truly \"Champagne.\" At first glance, the region is not an obvious source of romance. Champagne's history is grim and bloody, swept by war and destruction from Attila the Hun to the filthy trenches of WWI and the Nazi depredations of WWII. The environment for winemaking is desperately hard - northerly latitude, chalky soil, copious rain, frost, rot. Yet it's these difficulties that help make the wine unique. With renowned wine importer Martine Saunier as our guide, we get a rare glimpse behind the scenes into the real Champagne through six houses, from small independent makers like Champagne Saint-Chamant, where each and every bottle is still turned by hand in the cellars, to the illustrious houses of Gosset and Bollinger which have been instrumental in shaping the image of Champagne around the world.",
         "With renowned wine importer Martine Saunier as our guide, we get a rare glimpse behind the scenes into the real Champagne through six houses, from small independent makers to the illustrious houses of Gosset and Bollinger."
      ],
      "budget": 0
   },
   "movielensId": 139871,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-02-01",
      "dvdReleaseDate": null,
      "directors": ["David Kennard"],
      "runtime": 82,
      "movieId": 139871,
      "title": "A Year in Champagne",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "3544048",
      "originalTitle": "A Year in Champagne",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "zhJ6lC2Tr3k",
         "GQGjXj9fREw"
      ],
      "plotSummary": "The exploding cork. Endless tiny bubbles floating up and up in the glass. An indulgence. A celebration. A seduction. A triumph. This is the essence of Champagne, isn’t it?  But it’s not just bubbles in a glass that makes the wine, or the mystique. Only sparkling wine produced within the boundaries of the Champagne region is truly “Champagne.” At first glance, the region is not an obvious source of romance. Champagne’s history is grim and bloody, swept by war and destruction from Attila the Hun to the filthy trenches of WWI and the Nazi depredations of WWII. The environment for winemaking is desperately hard — northerly latitude, chalky soil, copious rain, frost, rot. Yet it’s these difficulties that help make the wine unique.",
      "tmdbMovieId": 267091,
      "avgRating": 3.4375,
      "releaseYear": "2014",
      "numRatings": 8,
      "posterPath": "/tMK7nD2fEpVLXc6geZ1JTJ3YqTs.jpg"
   }
}