{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1748016",
      "video": false,
      "title": "Brother's Keeper",
      "recommendations": [
         32601,
         62149,
         64566,
         16020
      ],
      "backdrop_path": "/3AwQwX24n6uvGZeGbI9dnWasgxa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Pete Goodwynn",
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e5f",
               "name": "Alex Miller",
               "profile_path": null,
               "id": 211654,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Andy Goodwynn",
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e63",
               "name": "Graham Miller",
               "profile_path": "/hqJNLfoCxQkEeM4seubYpAZ2mPA.jpg",
               "id": 210520,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Herbert Leemaster",
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e67",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Gordon Leemaster",
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e77",
               "name": "Daniel Samonas",
               "profile_path": "/biOJTwud45vx9CeF8VQZt7R3XFC.jpg",
               "id": 204686,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Chief Carver",
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e6b",
               "name": "Michael Rooker",
               "profile_path": "/bvmf7TIjCyRPrBNrmZ5qyePTL5y.jpg",
               "id": 12132,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Turner Monroe",
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e6f",
               "name": "W. Earl Brown",
               "profile_path": "/ygTJtQVn9R2NgE1YPybsgk33jBm.jpg",
               "id": 6951,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Macaire Leemaster",
               "gender": 1,
               "credit_id": "52fe4df3c3a36847f8275e73",
               "name": "Robyn Lively",
               "profile_path": "/yzA4nQguvbrPRKx5TTVOfRWGlEz.jpg",
               "id": 15905,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Maggie Malloye",
               "gender": 1,
               "credit_id": "52fe4df3c3a36847f8275e7b",
               "name": "Mackenzie Mauzy",
               "profile_path": "/wKRz7tYo4COSpzfjNXGWV2cyttJ.jpg",
               "id": 1218238,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Ginny Wonders",
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e7f",
               "name": "Noell Coet",
               "profile_path": "/inxZ3MEYTM5YDKJQSSQWdUX85WB.jpg",
               "id": 1051408,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "News Anchor Frank Mills",
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e83",
               "name": "Josh Mills",
               "profile_path": null,
               "id": 1081135,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Nicholas",
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e87",
               "name": "Peter Boulware",
               "profile_path": null,
               "id": 1270035,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e3d",
               "name": "T.J. Amato",
               "profile_path": null,
               "id": 1131199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e43",
               "name": "Josh Mills",
               "profile_path": null,
               "id": 1081135,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e49",
               "name": "Briana Hartman",
               "profile_path": null,
               "id": 1270003,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e4f",
               "name": "Scott Peck",
               "profile_path": null,
               "id": 967020,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df3c3a36847f8275e55",
               "name": "Bill Brown",
               "profile_path": null,
               "id": 9425,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4df3c3a36847f8275e5b",
               "name": "Jeff Murphy",
               "profile_path": null,
               "id": 582621,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.029058,
      "production_countries": [],
      "id": 231616,
      "vote_count": 5,
      "budget": 0,
      "overview": "Identical twins Andy and Pete Goodwynn have been side-by-side since the womb. But that’s about to change… As their high school graduation nears, Pete plans to marry Maggie, the love of his life, and head off to school to become a preacher. Andy, who wants  nothing to do with God, has no plans, no direction, and seemingly no future. But in a cruel twist of fate—orchestrated by a rival for  Maggie’s heart—their lives are forever altered. Can the brothers gain vengeance on those who have taken away from them all that matters?",
      "similar": [],
      "original_title": "Brother's Keeper",
      "runtime": 118,
      "poster_path": "/3ABpgmyYdoJreGikQSn4WCi1v91.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-04-05",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "T.J. Amato",
         "Josh Mills"
      ],
      "runtime": 118,
      "synopsis": "\"Be kind and compassionate to one another, forgiving each other, just as in Christ God forgave you.\" Ephesians 4:32 (NIV) BROTHER'S KEEPER Sometimes the Greatest Revenge is Forgiveness Andy and Pete Goodwynn have been side-by-side since the womb. But that's about to change forever ... The identical twins have grown up watching out for one another while avoiding the glares and whispers that come from a small-town tragedy like the one that left them orphans at a young age. Yet despite their incredible bond, Andy and Pete couldn't be any more different. While Pete readily turns the other cheek, Andy prefers an eye for an eye. As their high school graduation nears, Pete has big plans to marry Maggie, the love of his life, and head off to school to become a preacher. Andy, who wants nothing to do with God, has no plans, no direction, and seemingly no future. Yet all of this is also about to change. Instead of becoming engaged to Maggie, Pete hears his love say no to his proposal. In a dizzying turn of events, he ends up in jail ... framed for murder! As Pete wrestles with God about this cruel twist of fate-orchestrated by the most powerful family in town-Andy struggles to find a way to help his brother ... even if it means coming to peace with God and abandoning his hopes for revenge. Coming to theaters in fall 2012, BROTHER'S KEEPER takes moviegoers on an incredible journey through rural Georgia in the 1950s: from Main Street to the State Penitentiary ... from young love to a heinous crime of passion ... from counterfeit justice to forgiveness forged through pain ... from God's mercy to the ultimate sacrifice. The first feature film from Desert Wind Films, BROTHER'S KEEPER is co-directed by Josh Mills and T.J. Amato and stars Alex and Graham Miller as Pete and Andy. The cast also includes Daniel Samonas as Gordon, MacKenzie Mauzy as Maggie, Ray Wise as Herbert, and award-winning singer Travis Tritt as Eddie. Will Andy be able to help Pete gain his freedom? Will the brothers seek vengeance on those whose corruption and deceit have taken away from them all that matters in life? While revenge may seem sweet, BROTHER'S KEEPER is a powerful reminder that only forgiveness can truly heal. BROTHER'S KEEPER In Theaters Fall 2012 BrothersKeeperFilm",
      "writers": [
         "Briana Hartman",
         "Josh Mills"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1748016/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzNjMjhhMzktNmM5MC00MjZhLTgzODEtYWM5OTBkNWE1OWY1XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Michael Rooker",
         "Ray Wise",
         "Travis Tritt"
      ],
      "reviews": [
         "The only good thing about the film is Michael Rooker. He is the only actor that convinces you of what's happening on screen. The idea that you need religion to seek forgiveness or redemption is an archaic notion. Within the Christian community I'm sure there are a lot of people that will enjoy the film regardless of how poorly made it was, but to grant this film a good review based upon religious foundations is plain silly. It is safe to say that this movie will absolutely not seek any kind of critical acclaim from any serious critic. The Christian community will do more than enough to provide viewers of \"Brother's Keeper\" IMDb page with the idea that this film is some how a \"cinematic master piece.\"",
         "We really like the new release, \"Brother's Keeper Film\", produced by the industry's up and coming Steven Camp, Josh Mills and TJ Amato of Desert Wind Films. It's a period piece set in the late 1950's that takes advantage of gorgeous Georgia scenery in the southeast, U.S.A. The theme - forgiveness - is of universal appeal. The cinematography and musical score are absolutely enchanting. Adam Grant and band \"Bad Horse\" debut a fantastic rendition of an old time favorite, Amazing Grace. A talented slate of actors compiles a cast that brings this faith-based movie to life. Michael Rooker (The Walking Dead's Merle), Country's Hit star - Travis Tritt, Ray Wise (look him up - oh yeah!), athlete Peter Boulware, Shaun Clay, Daniel Samonas (Disney's Wizzard of Waverly Place)... the list goes on and I haven't even mentioned the leading roles played by twins Alex and Graham Miller! In the movie to keep track of which brother is which ... think Pastor PETE and Angry ANDY. That little tip helped me :) Just under 2 hours in length, this is wholesome entertainment at it's finest. Limited release in a dozen markets Nov. 1st. Intended for a broader release in 2014.",
         "With so many movies and games romanticizing murder, revenge, stealing cars, etc..... it is wonderful to see a movie address a major moral dilemma that our society struggles with heavily, and offer a wholesome and healthy solution. Bad things happen to good people and good things happen to bad people but if you let Him, God will make the best of the situations we give him. And in the bigger picture He redeems even the most hopeless of circumstances. This movie has laughs, tears and if you let it, helps us reach deep inside and do something healthy with our unforgiveness. The movie is a blend of veteran actors with some new talent and overall they deliver the story with passion and conviction.",
         "well IMO whether you believe or not i suggest watch the movie first based on story then you can actually have a better review aside from whatever you believe and be honest with yourself how good this movie really is,look you don't have 2b religious to actually like this movie,however you might get the strong message. i thought this is very powerful yet a very good structure and most of all underrated. this is from a person who loves movies especially the good one and is my first time to write a review about movies in any sort,believe me i have never done this b4,is just that the movie was so good that made do this for the very first time,i hope you 2 will like it as i did. P.S i'm aware that are so many good movies out there and i pretty much have watched them all and this is certainly 1 of them.",
         "I saw this as part of a preview audience. Some movies come together, the writing, directing, and acting take you on a journey. Brother's Keeper is not one of those movies. It was overacted and almost felt like it was directed by two different people with different visions of the film. The casting of Ray Wise's wife was strange, as Robin Lively not only looks younger than she is, she is already over 20 years younger than him. Since this is not a plot point, it just left me wondering why such a mismatch. This was just one of many points of this movie that were painful (over acted court scenes, formulaic \"spoiled rich boy\" character) My friend who invited me is a closeted man who works for an ultra conservative energy (oil) company and I believe he got the tickets from work. I had the impression that the tickets to the preview were handed out at a megachurch based on the rest of the audience. I was one of the few who walked out of the preview wanting the two hours of my life back, while I heard others muttering and praising its \"God\" focus. I never saw this movie get a distribution around the Dallas area, so I assume it never found a distributor or never got a wide distribution. All I can say is maybe that was God's will keeping others from suffering through this stinker.",
         "This filled me with inspiration, hope, love, forgiveness, and a great sense of the presence of God unlike any movie I've seen before. The ending captivated me, and although it was not what I hoped for it inspired me to action, and to live a life of true love and forgiveness. I recommend for every family in America to see this film. You will forever be changed. Every actor does an excellent job bringing the story to life, but I was beyond touched by Alex and Graham Miller. Their acting captivated my emotions, and moved me to the core. I've never felt the sense of fear, and upsetness to see an actor die on screen as much as I did when Graham Miller died. My heart wrenched with grief, wishing something would change, but then I realized the moment Alex began to preach that it was all meant to be, and I would be forever changed!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["DesertWind Films"],
      "summaries": [
         "Identical twins Andy and Pete Goodwynn have always been there for each other. But in a cruel twist of fate, orchestrated by the town's most powerful family, their lives are forever altered. Can the brothers gain vengeance on those who have taken away from them all that matters? While revenge may seem sweet, Brother's Keeper is a powerful reminder that only forgiveness can truly heal.",
         "Andy and Pete Goodwynn have been side-by-side since a family tragedy left the twins orphaned as young boys. As their high school graduation nears, Pete plans to marry Maggie, the love of his life, and head off to seminary to become a preacher. Andy, a rebel at heart, has no plans, no direction, and seemingly no future. In a shocking turn of events, Pete is thrown in jail - framed for Maggie's murder. Andy struggles to find a way to save his brother from Death Row - concocting a desperate escape plan that shocks his brother and alters both of their futures forever."
      ],
      "budget": 1600000
   },
   "movielensId": 140014,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-04-05",
      "dvdReleaseDate": null,
      "directors": [
         "T.J. Amato",
         "Josh Mills"
      ],
      "runtime": 118,
      "movieId": 140014,
      "title": "Brother's Keeper",
      "mpaa": "PG-13",
      "actors": [
         "Alex Miller",
         "Graham Miller",
         "Ray Wise",
         "Daniel Samonas",
         "Michael Rooker",
         "W. Earl Brown",
         "Robyn Lively",
         "Mackenzie Mauzy",
         "Noell Coet",
         "Josh Mills",
         "Peter Boulware"
      ],
      "imdbMovieId": "1748016",
      "originalTitle": "Brother's Keeper",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["vzKD9Z_rjVE"],
      "plotSummary": "Identical twins Andy and Pete Goodwynn have been side-by-side since the womb. But that’s about to change… As their high school graduation nears, Pete plans to marry Maggie, the love of his life, and head off to school to become a preacher. Andy, who wants  nothing to do with God, has no plans, no direction, and seemingly no future. But in a cruel twist of fate—orchestrated by a rival for  Maggie’s heart—their lives are forever altered. Can the brothers gain vengeance on those who have taken away from them all that matters?",
      "tmdbMovieId": 231616,
      "avgRating": 5,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/3ABpgmyYdoJreGikQSn4WCi1v91.jpg"
   }
}