{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "ritual",
            "id": 4720
         },
         {
            "name": "cult",
            "id": 6158
         },
         {
            "name": "human sacrifice",
            "id": 10864
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "private detective",
            "id": 155790
         },
         {
            "name": "dismemberment",
            "id": 157444
         },
         {
            "name": "egyptian mythology",
            "id": 163338
         }
      ],
      "imdb_id": "tt0095312",
      "video": false,
      "title": "Hollywood Chainsaw Hookers",
      "recommendations": [
         26943,
         27481,
         68180,
         28676,
         25028,
         42468,
         85165,
         5796,
         87710,
         68964,
         28090,
         29692,
         54803,
         27509,
         85024,
         46297,
         186320,
         224626,
         78218,
         171703
      ],
      "backdrop_path": "/uL4kslrqgePcfSieTq29AqdOnYk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "The Stranger",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e05125b",
               "name": "Gunnar Hansen",
               "profile_path": "/bwqo7HNyvYqPCnTWlOHSUnstg2F.jpg",
               "id": 27804,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Samantha",
               "gender": 1,
               "credit_id": "52fe4547c3a368484e05125f",
               "name": "Linnea Quigley",
               "profile_path": "/s9B3j05yyuaIqSTab9tvkYCSnT2.jpg",
               "id": 97619,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Jack Chandler",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051263",
               "name": "Jay Richardson",
               "profile_path": "/oMCoIJkGziZpGlKmgHkF9ZXeMeo.jpg",
               "id": 97697,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mercedes",
               "gender": 1,
               "credit_id": "52fe4547c3a368484e051267",
               "name": "Michelle Bauer",
               "profile_path": "/nGbCOkBl2rhPR4qchHJqR0hj1rx.jpg",
               "id": 97698,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Lori",
               "gender": 1,
               "credit_id": "52fe4547c3a368484e05126b",
               "name": "Dawn Wildsmith",
               "profile_path": "/eCcaRztus48JCKCDhPFl7mc2NdW.jpg",
               "id": 97699,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lisa",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e05126f",
               "name": "Esther Elise",
               "profile_path": null,
               "id": 97700,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Hermie",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051273",
               "name": "Fox Harris",
               "profile_path": null,
               "id": 97701,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bo Hansen",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051277",
               "name": "Jimmy Williams",
               "profile_path": "/artkCCvx9D2MlcKLfmw2rg8Mzvf.jpg",
               "id": 42090,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jake the Bartender",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e05127b",
               "name": "Michael Sonye",
               "profile_path": null,
               "id": 97868,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Harrison",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e05127f",
               "name": "Dennis T. Mooney",
               "profile_path": null,
               "id": 106288,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Nubian",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e051283",
               "name": "Gary J. Levinson",
               "profile_path": null,
               "id": 98620,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Murphy",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e051287",
               "name": "Jerry Miller",
               "profile_path": null,
               "id": 106289,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Kid in Bar",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e05128b",
               "name": "Christopher Ray",
               "profile_path": "/IVnfqEPMcsFUksVAX78gQMJsb5.jpg",
               "id": 97901,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051245",
               "name": "Fred Olen Ray",
               "profile_path": "/vHcV6RYDAT1kh3RGRah8tiNrDyK.jpg",
               "id": 31155,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e05124b",
               "name": "Fred Olen Ray",
               "profile_path": "/vHcV6RYDAT1kh3RGRah8tiNrDyK.jpg",
               "id": 31155,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051251",
               "name": "Fred Olen Ray",
               "profile_path": "/vHcV6RYDAT1kh3RGRah8tiNrDyK.jpg",
               "id": 31155,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e051257",
               "name": "T.L. Lankford",
               "profile_path": "/h0iZPpkRK9X92WF7NeQ6cDWM3km.jpg",
               "id": 97696,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e051291",
               "name": "James Golff",
               "profile_path": null,
               "id": 102178,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e051297",
               "name": "Nick Marino",
               "profile_path": null,
               "id": 98615,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e05129d",
               "name": "Salvatore Richichi",
               "profile_path": null,
               "id": 98616,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e0512a3",
               "name": "Gary J. Levinson",
               "profile_path": null,
               "id": 98620,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4547c3a368484e0512a9",
               "name": "Nancy Paloian",
               "profile_path": null,
               "id": 100266,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4547c3a368484e0512af",
               "name": "Dawn Wildsmith",
               "profile_path": "/eCcaRztus48JCKCDhPFl7mc2NdW.jpg",
               "id": 97699,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e0512b5",
               "name": "Corey Kaplan",
               "profile_path": null,
               "id": 98607,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e0512bb",
               "name": "Dan Golden",
               "profile_path": null,
               "id": 97895,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4547c3a368484e0512c1",
               "name": "Gary Graver",
               "profile_path": null,
               "id": 30683,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e0512c7",
               "name": "Tony Malanowski",
               "profile_path": null,
               "id": 47095,
               "department": "Crew",
               "job": "Post Production Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.309038,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27412,
      "vote_count": 30,
      "budget": 23000,
      "overview": "A L.A. Private Eye is hired by a worried mother to find her missing runaway daughter, Samantha. As Private Dick Jack Chandler searches for her whereabouts he will have the misfortune of encountering an evil cult that worships an Egyptian god, the methods of human sacrifice using chainsaws their choice of appeasing their deity. What Chandler learns is that Samantha has revenge in store for \"The Master\" and his bevy of blood-thirsty, chainsaw-wielding hookers.",
      "similar": [
         25983,
         9373,
         10781,
         201085,
         452507,
         10585,
         588,
         3600,
         26466,
         16307,
         56906,
         1923,
         4771,
         949,
         1586,
         320,
         189,
         10528,
         2832,
         281
      ],
      "original_title": "Hollywood Chainsaw Hookers",
      "runtime": 75,
      "poster_path": "/59NMlN67QOsoD7aj4D0KE8MYJWG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "American Independent Productions",
            "id": 4701,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Camp Video",
            "id": 16932,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Savage Cinema",
            "id": 16933,
            "origin_country": ""
         }
      ],
      "release_date": "1988-03-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "They charge an arm and a leg!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Olen Ray"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Fred Olen Ray",
         "T.L. Lankford"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095312/",
      "coverLink": null,
      "actors": [
         "Gunnar Hansen",
         "Linnea Quigley",
         "John Henry Richardson"
      ],
      "reviews": [
         "\"Hollywood Chainsaw Hookers\" is one of the best examples of those trashy, cheesy, horror/spoofs of the 80s (Toxic Avenger and Blood Diner would be included in there as well) that I so fondly adore. The movie is short, sweet, and to the point but I enjoyed every excruciatingly bad B-movie moment, which by the way, is accompanied by the corniest one-liners you've ever heard since Freddy Krueger. Hollywood Chainsaw Hookers concerns (what else?) a cult of chainsaw massacring babes who use fresh limbs from their victims to serve to their \"master\" (I'm assuming this is where Gunnar Hansen comes in). And boy does he look embarrassed. One classic scene involves a nude Michelle Bauer messily hacking up some poor old sap while listening to Elvis Prestley. The look on her face is priceless. Blood, a wooden Gunnar Hansen, laughs aplenty, cheesy rock music, scream queens Michelle Bauer and Linnea Quigley (her shining moment is the \"dance of the double chainsaws!\") all wrapped into one...don't miss it.",
         "Hollywood Chainsaw Hookers is easily one of the best films of the d-grade comedy-horror genre. It's a send up of film noir thrillers with offbeat comedy in the vein of \"The Naked Gun\" films and is genuinely hilarious from start to finish. The story revolves around Jack Chandler, a private eye in Hollywood who is hired to find a missing girl. However, his search leads him to a cult of chainsaw weilding prostitutes led by none other than Gunnar Hansen (Leatherface from The Texas Chainsaw Massacre). There are plenty of weird and wacky scenes, pieced together by corny film noir narration and music, and the narration and dialogue in the film is extremely witty. Definitely one of the best films of its type. If you are after a fun little comedy/horror film with the typical fix of nudity, corny one liners and gore which is genuinely funny and clever, this should be on top of your list.",
         "A cult of chainsaw-worshipping prostitutes headed over by pleasantly plump guru \"The Master\"(Gunnar \"Leatherface\" Hansen\") are out to make human sacrifices to their god \"Anubis\" and cut into poor guys just looking for a good time. Jay Richardson (very funny here) is dry, thick-witted detective Jack Chandler, who's searching for a young runaway (Linnea Quigley) and stumbles onto the cult. The film is played out as both a spoof of film noir (with some Columbo/Perry Mason-style detective shows thrown in) AND horror films (naturally THE TEXA S CHAINSAW MASSACRE), and it actually succeeds! Of course, you also have to be willing to deal with some bad lighting and grainy photography associated with budget restraints, but that's forgivable, I think. I agree with the mention of choreography--this has two hilarious (and damn sexy) dance sequences with Michelle Bauer and Linnea Quigley in the buff (the latter doing the \"Virgin Dance of the Double Chainsaws\"), that should please their fans. Richardson is a howl and Hansen gets a few funny moments in there as well, though he's not nearly as animated as the leading ladies or Richardson. Nearly every line of dialogue is extremely campy and whoever scripted this thing has a playful ear for puns and wordplay. There's also plenty of blood/gore (I think Steve Johnson did some of it), a few AIRPLANE-style gags and a great mock- Elvis song for Michelle to dance to. In short, a must see for fans of B-movies and probably Fred Olen Ray's finest hour. Score: 7 out of 10.",
         "With its tongue firmly planted in its cheek, this camp B-movie horror, by Fred Olen Ray, manages to be fairly infectious fun, delivering everything one could wish for in a movie with such a delightfully trashy title: a ridiculously silly plot, a half dozen women willing to strip off in front of the camera, some crap special effects (plastic body parts and a few gallons of fake blood), and a running time just short enough to ensure that the film doesn't outstay its welcome. Jay Richardson plays Jack Chandler, a sleazy private-eye searching for missing teenager Samantha (Linnea Quigley). During the course of his investigations, he meets Mercedes (Michelle Bauer), a sexy, but murderous hooker, and subsequently discovers the existence of a chainsaw worshipping cult, led by The Stranger, (Gunnar Hansen). With its deliberately cheesy film-noir voice-over, some very bad comedy, frequent nudity from scream queens Quigley and Bauer, and some daft OTT power-tool dismemberment, Hollywood Chainsaw Hookers isn't as unwatchable as the title suggests. If you're in the mood for a spot of unpretentious low-budget fun, then check out this entertaining 80s cult classic.",
         "One of the auteur Olen Ray's finest works is this little gem. It features two of the Eye Candy Hall of Fame All-Century team members, Linnea Quigley and Michelle Bauer. Every synopsis or review seems to contain the words camp, horror-comedy, and gore. While it is all that, we would like to comment on the nifty dance numbers. The auteur Olen Ray has added some eye-popping choreography which allows Ms. Quigley and Ms. Bauer to put their bodies in motion. The sultry Ms. Quigley performs the Virgin Dance of the Double Chainsaws. We fell like a virgin Brazilian rainforest watching her. The majestic beauty Ms. Bauer does a striptease to an Elvis tune that is pure graceland. Proving she ain't no hound dog, Ms. Bauer's character will take you to Heartbreak Hotel but that's alright. As a word of warning, you might feel like a giant Redwood as you view this film, but both these ladies wield a wicked chainsaw and can cut you down to size.",
         "A few reviewers did not find this movie any good. Well, too bad for them and their loss. I loved it! And many with me. It serves up 70 minutes of hilarious and grotesque high-quality film noir. The script is ridiculously entertaining (or maybe even more entertainingly ridiculous), the dialog is totally over-the-top and most of the jokes/puns are truly fantastic. This film gave me almost as much fun as computer games like Day of the Tentacle and Sam & Max did. Save it for a rainy day (emotionally or just literally) and be sure to have a smile put back on your face. Without a doubt one of the best motion pictures from it genre!",
         "This is the Fred Olen Ray of his golden era, before start making soft core skinnemax flicks. An homage to The Chainsaw Texas Massacre, with the original Leatherface (Gunnar Hansen) and a chainsaw duel between two eighties b-movie goddess. What more do you want? Some gore? you got it. Cheese? this is beyond cheese. Fred Olen Ray is a b-movie fan and here he delivers entertainment from a fan to all the fans. Hope he come back to make this kind of stuff. Im a big fan of his old stuff like this one, like Evil Toons and all that kind of stuff. OK, the eighties are gone i understand it but the spirit of it can live. I heard that he will make a sequel to this movie. Hope so.",
         "With cheesy B-movies, I normally stay away from rating them for tech stuff, simply because its' silly...They probably put as much in this movie as I pay for half the utilities every month! What I do look at is sheer entertainment factor. I've felt I've gotten my moneys' worth with quite a few z-grade schlockfests, what they have that big budget poo barns lack is energy and enthusiasm, and lack of pretension...(How much money did they put into the latest \"GODZILLA\"?) With this film, you know within the first few minutes that you cant take it seriously in any way shape or form...(A hooker is interrogated by police, where she describes a chainsaw as, 'a sexual enhancement device') The filmmakers dont hide the fact that they're making crap, they reveled in it! And you can tell they had fun making this twisted little gem, it's all in the actors' smiles...they look like they're about to burst out laughing at any moment. A simplistic plot about a P.I. on the search for a runaway threads the movies together. It turns out the runaway is apart of an ancient chainsaw worshipping cult, when he tries to infiltrate thats when things get really sticky. His voiceover narration is funny, and provides 50% of the laughs in it. A silly piece of crap, but hey, what do expect? 10 out 10 on the B-movie scale By the way, this does have quite a bit of nudity in it, so if you're easily offended, look elsewhere for cheesy thrills...",
         "*SPOILER ALERT* *SPOILER ALERT* All B-movie fans should see this movie. Even if you can't make it through the whole thing, the best scene is in the first ten minutes. Michelle Bauer strips while dancing to Elvis. She gets her room ready for some chainsaw action while naked. She's putting plastic sheeting over her Elvis painting, putting on a shower cap so she doesn't get blood in her hair, etc. See Michelle's naked body drenched in blood while she's holding a chainsaw! B-movie nirvana! Michelle Bauer and Linnea Quigley make this movie happen. Bauer has an unbelievably tight body. I could watch that strip scene over and over. OK, I admit it. I have watched it over and over. Mmmm...Hookers chainsawing. And I don't know what it is about Linnea Quigley. She has got this great body with this innocent little face. It works. Her dance of the two chainsaws at the end is another highlight. The outfit she wore during her dance is something special. They both get naked in the flick as do a number of other women. You can't go wrong. OK, sure. They may not be the greatest actresses in the world. So what? They get an A+ in my book for getting into the swing of things and embracing the art of being a Chainsaw Hooker. The detective who was investigating the chainsaw murders had some funny lines. The best line? Michelle and the detective are at a bar. She says, \"Jack? I'm going to **** your brains out.\" The Detective thinks to himself: \"I didn't like the sound of that.\" If you like B-movies about hookers with chainsaws, you've got to see this flick!",
         "I first saw Hollywood chainsaw hookers at a friends house,i thought it was wild cheesy silly and gory.and during the 80s i was a huge fan of Linnea quigley,who was one of the stars of chainsaw hookers,it also stars Fred olen ray regular jay Richardson as a private eye poking fun at the 1940s private eye movies.also the original leather-face from Texas chainsaw massacre(gunner Hansen)as the leader of the chainsaw wielding hotties.cult scream queen Michelle Bauer plays a hooker named Mercedes,who does a totally nude dance to an imitation Elvis Presley tune.just before hacking up a client with a chainsaw.look for tough girl actress dawn wildsmith as a cackling bubble headed blonde hooker named Lori.as with most Fred olen ray movies its fun but not Oscar material who cares b-movies are great without them we would have to suffer with a-movies. that are not always good.i personally liked Hollywood chainsaw hookers.kudos to Fred olen ray for his unique style he brings to his movies.call me crazy but i give Hollywood chainsaw hookers 8 out of 10.",
         "Hollywood Chainsaw Hookers is a definite cult movie. There's a chainsaw in the title, so I guess Fred Olen Ray, the director, decided to cast Gunnar Hansen. Hansen was better as Leatherface, in this he just stands there and seems very inanimate. I liked this movie for what it is, a definite attempt at cult status. I think Olen Ray's Soroeity Babes In The Slime Bowl-A-Rama is a better film however.",
         "Raymond Chandler re-done as a cable cheapie. Mr. private eye's narration was an attempt to give this mess a little class. It succeeded, it gave it only a little class. Seeing Gunnar Hansen (Leatherface, as if you didn't know) play the cult leader was a trip. But I think I understand why he doesn't get many speaking roles. He looked great, but the delivery was hammier than a pig farm. The ladies, including a then famous Linnea Quigley, looked gorgeously evil too. And sexy as well. The ending was hardly a surprise, it was just a case of WHEN was it going to happen. And I liked seeing the late Fox Harris aka Jerry Fox in a cameo.",
         "The legendary, hard-bodied Scream Queen, Linnea Quigley stars in this sleazy B-movie horror-comedy that truly delivers all the sexy stripping and chainsaw wielding glory! Directed by Fred Olen Ray, this dime-store classic is a tribute to the Texas Chainsaw Massacre and belongs in the same realm as the sequential Texas Chainsaw Massacre part 2 which has the same unique 80s look and feel. The big city of L.A. is the setting, and a crazed religious cult of hookers worship chainsaws and hack up unsuspecting johns according to the ceremonial rituals established by leader (Gunnar Hansen), who was 'Leatherface' from the original Texas Chainsaw Massacre. All throughout the madness, fed up but determined private eye Jay Richardson chases L.A.'s night life with pretty girls and severed body parts all leading up the center of the evil sect's most important ceremonial rite. This has all of the elements of the typical 80s horror camp comedy; cheesy gore FX, plenty of nudity, and it never takes itself seriously enough to be confused with later chainsaw venues. Linnea Quigley is in her prime, and the gorgeous Penthouse Pet and B-movie goddess, Michelle Bauer shines as the deadly, Elvis-loving 'Mercedes' with the perfect body, charm and demented eyes. The action is combined with humor to form the perfect blend of political satire, goofy quotes and in-jokes all adding up to the an impressive climatic performance entitled; 'The Virgin Dance of the Double Chainsaw'! Beneath all of the dirty L.A. sleaze and slime, this little flick has a charming quality about it that still entertains its audience 20 years later.",
         "I wholeheartedly agree with earlier reviewers that said this movie is one of the best of its genre--unfortunately that genre is worthless crap. This is an early example of horror/comedy \"scream queen\" movies, featuring two of the more ubiquitous screams queens Michelle Bauer and Linnaea Quigley, and directed by one of the pioneers of these kind of films (along with Dave DeCoutea and Jim Wynorski)--Fred Olen Ray. This movie, however, is surprisingly creative and long on plot, and it actually has more than one set and a budget that approaches whole numbers. It is also genuinely funny in places. These kind of films were largely inspired by the 70's Roger Corman-produced films like \"Hollywood Boulevard\" or \"Caged Heat\" (Jim Wynorski actually got his start with Corman--thank's a lot, Roger), but there's a good reason many of the directors of those films went onto bigger and (usually) better things while the three amigos here have kept doing this same thing year after year. There's a big difference between seriously making schlocky films that nevertheless demonstrate real talent, and just mugging your way through self-consciously campy \"cult films\" in attempt to disguise a total lack of it. Olen Ray, at least, has a genuine love of film which shows in some of his best work (Wynorski, as he himself brags in every interview, is more interested in improving his own dating life than in making good movies, while the openly gay DeCouteau is just a hack by any standard). As for the \"scream queens\", Quigley and Bauer, they certainly camp it up as usual, but make enough of effort that they seem more like genuine actresses than strippers here. This is the kind of the movie that really floats to the top of the HUGE pool of worthless crap movies that have been churned out since the early 80's, but it also, mind you, doesn't quite float ABOVE that pool. If you like these kinds of movies, of course, you won't want to miss it. And for everyone else?--well, you could do worse, I guess.",
         "Hehe, apart from chainsaw-horror completists, this should also be viewed by silly b-movie/exploitation fans. With quite enough blood and at times funny quotes, this is for an easy night with friends and beer. Again, don't take this for serious horror because that;s not the case! Serious horror fans could actually hate this.",
         "This is up there among cultish cheesy movies. With the wonderful special effects consisting of red water in squirt guns (look in the corners of the screen) to the flying \"body parts\" (sneakers and arms) as people are \"chainsawed\" , this is a great movie to laugh the night away at for its cheesiness.",
         "To say that this is Fred Olen Ray's best film doesn't quite cover it. It's the only half-way decent movie he ever made. The movie has - gasp! - actual characters you can tell apart from a block of wood, and doesn't spend - gasp! - over an hour of screen time showing said characters running around doing nothing. Furthermore - gasp! - the script is cheesy and entertaining in the best way, filled with ridiculous one liners and double entendres in a spoof of film noir. The guy who plays the main character, \"Jack Chandler\", actually has a face and manner to suit the hard boiled detective, and the movie also benefits from the scream queen double bill of the beautiful Michelle Bauer and Linnea Quigley. Genre fans will appreciate Gunnar Hansen's appearance in another movie to do with chainsaws, though his \"performance\" makes you wish he'd stuck with the mask and apron. The plot is something to do with a chainsaw worshipping cult from ancient Egypt - no kidding - who cut people up to sacrifice them to their deity. Bauer has a great nude scene as one of the hardware worshiping minions, hacking a guy up and getting her beautiful naked body sprayed with fake blood. She is so sexy right from her first appearance in the movie, in which she happens to be clothed, that it makes you wish other starlets in b-flicks could study her performance and realise it's about more than just taking your top off. Linnea Quigley is also fantastic as the good girl gone bad, the role she was usually most comfortable in. If you're a fan of b-horror movies and haven't seen this one, it's well worth checking out. It's typically low key and low budget, but the starlets light up the screen, and it's entertaining throughout.",
         "Look, I was blown away by this movie. Your expectations should be set pretty low and cheesy according to the title, so I couldn't believe how much exploitation fun this delivered. This goes way above the \"so bad its good\" films, this is clearly satire, intentionally satirical, and it delivers Chainsaws, Hookers and a hard-boiled Hollywood crime reporter. Plenty of boobs and blood, excellent picture quality on the blu ray from the Slasher Classics Collection in the UK that has clearly not been monkeyed with because some flaws in the print can be seen, which is terrific. Audio is a bit disappointing, probably because of the low budget production conditions, but its pretty muddy and difficult to hear. There's a rockin' soundtrack that still sounds good though. Overall amazing. A+++",
         "Fred Olen Ray was the reigning emperor of trashy low-budgeted B-movies during the late 1980's, so with his reputation and a fabulous title like \"Hollywood Chainsaw Hookers\", this movie was destined to become a cult classic even long before anyone had seen it! The film is quite bad, of course, but also irresistibly charming, effectively tongue-in-cheek and massively entertaining in case you dig campy and brainless horror guff. Writer/director Fred Olen Ray and his entire ensemble cast noticeably had copious amounts of fun with this production, and there's no reason we shouldn't have either, thanks to the light-headed atmosphere, plentiful of gratuitous nudity, amateurish gore and a handful of hilarious and inventive gags. Jay Richardson pretends to be a bona fide Humprey \"Maltese Falcon\" Bogart in his role of chain-smoking and deep voice narrating private detective Jack Chandler. He's looking for a runaway teenage girl named Samantha (Linnea Quigley, who was 30 at the time) in the raunchy and perilous streets of Los Angeles. Jack crosses paths with a dangerously crazy cult of which the members are prostitutes worshiping the chainsaw and hacking up their customers' bodies in front of their spiritual leader. The latter is none other than Gunnar \"The Texas Chainsaw Massacre\" Hansen; who will presumably remain personified with chainsaw horror until his dying days. Jack fears that Samantha needs to be rescued from the cult, but the girl has her own personal and hidden agenda. At times, \"Hollywood Chainsaw Hookers\" is a little bit tedious and intolerably cheap, but throughout most of the (relatively short) running time it's a successful parody and trash flick. You can't but chuckle with certain dialogs and situations, like Hansen's extended speech bringing an ode to the chainsaw, and the grotesque nude massacre sequences are downright hilarious. This film that is also partially responsible for the huge popularity of B-movie actresses/scream queens Linnea Quigley and Michelle Bauer. In what's arguably the best scene of the entire movie, Michelle Bauer dances naked to the tunes of an Elvis Presley song with a gigantic chainsaw in her hands. She mangles her hapless victim, but not before carefully protecting a poster of her singer idol with plastic wrapping. Classic! Definitely not recommended for about 99% of the world's population, but compulsory viewing for avid cult/horror fanatics.",
         "\"I stumbled into the middle of an insidious cult of chainsaw worshiping maniacs. \" A LA Private eye is hired by a worried mother to find her missing runaway daughter, Samantha (Linnea Quigley, smokin' hot as always). As Private Dick Jack Chandler (Jay Richardson, with 12:00 shadow and grizzled PI look, including trench coat, fedora hat and loose tie, narrating the story) searches for her whereabouts he will have the misfortune of encountering an evil cult that worships an Egyptian god, the methods of human sacrifice using chainsaws their choice of appeasing their deity. What Chandler learns is that Samantha has revenge in store for \"The Master\" (Gunnar Hansen) and his bevy of blood-thirsty, chainsaw-wielding hookers. Playful Fred Olen Ray horror comedy is a joyously goofy satire on The Texas Chainsaw Massacre, with little really in common with Tobe Hooper's film, other than the use of the chainsaws and Leatherface himself without the mask (Hansen plays his orchestrator of bloodshed very straight, never cracking a smile or winking at the audience which I thought added a humorous spin to his wacko). While I admit that I watched this initially for the fun title and Linnea's presence in the movie, it was Michelle Bauer, as hooker Mercedes, who really captured my attention, because she knows how to deliver slutty lines with just the right touch of sexy and seductive—it also doesn't hurt that she is uninhibited and gets completely nude when she's hacking one pour soul to bits and pieces, a relish on her face offering a demented glee in butchering unsuspecting johns not prepared to be sliced and diced. As expected, there are plenty of flying body parts, spurting blood, sexual innuendo (less than subtle innuendo), and stripteases so, yeah, I had a good time. Not to mention, Jay Richardson has lines like \"The Kid talked like a Frosted Flake but she had the nicest set of knockers I had seen in a long time.\" His narration is often tasteless and crude, but is spoken in such a serious tone as to poke loving fun at noir films where the detective communicates to us about his case as it progresses. You even get, during the cult ceremony at the end, Linnea (her practically naked body covered in body paint) performing the \"Virgin Dance of the Double Chainsaws\" leading to her saving the day as Chandler appears to be on the verge of becoming a sacrifice to some false god. Instead she gives a couple villains, as Chandler calls it, an \"unscheduled appendectomy\" with a chainsaw. Seeing Quigley and Bauer in a fight of \"dueling chainsaws\" was enough to make me happy, but their liberated willingness to remain scantily clad only added to my overall experience. What I love about Quigley are these cute expressions she makes with her eyes and face during periods of excitement or in an exuberant state—whether a sex kitten or profane, wisecracking chick with an attitude, I find Quigley irresistible. Richardson always had a knack for playing these macho male characters against absurd situations in Fred Olen Ray joints, unlike Hansen, he nudge, nudge, winks, winks at the audience that these movies are meant to be tongue-in-cheek entertainment. Oh, and by the way, if you chuckle at \"dismemberment jokes\", this film will not disappoint.",
         "Incredibly cheap, incredibly talky horror comedy that's amusing in the schlockiest way imaginable. It's one of those films that are known as \"deliberately\" bad (like \"Attack Of The Killer Tomatoes\"), which means they are easier to take than films that were meant to be good and turned out bad....but they're still bad films, make no mistake about that. This one has a sense of humor that makes \"Naked Gun\" look subtle (the private detective/hero: \"I guess being a dick is a 24-hour job\"), but unfortunately not quite as many laughs. (*1/2)",
         "Low-rent private eye Jack Chandler (nicely played to the scuzzy hilt by Jay Richardson) runs afoul of a deadly cult of crazed chainsaw-worshiping hookers while searching around Los Angeles for runaway teen Samantha (the ever-adorable Linnea Quigley in peak perky form). Director Fred Olen Ray, who also co-wrote the witty tongue-in-cheek script with frequent collaborator T.L. Lankford, whips up one doozy of a hilariously campy horror splatter trash hoot that pokes merry fun at both vintage 40's film noir detective yarns and choice cheerfully cheap'n'cruddy drive-in fare alike. Gunnar Hansen makes for a suitably mysterious and menacing villain as the evil cult leader. Better still, this flick sure doesn't skimp on the tasty plentiful female nudity: the luscious Michelle Bauer performs a sizzling full frontal striptease prior to carving some hapless guy up with a chainsaw, Quigley dances topless in a seedy dive bar (Linnea's legendary scorching Virgin Dance of the Double Chainsaws likewise seriously smokes), Esther Elise poses nude for some racy photos, and Tricia Burns bares her breasts. Scott Andrew Ressler's rough, grainy cinematography further enhances the movie's considerable grungy charm. The groovy retro 50's-style rock soundtrack, Michael Perilsten's cool rollicking score, and the endearingly tacky gore effects all hit the funky spot. Popping up in neat bit parts are Ray's onetime wife Dawn Wildsmith as brassy deranged prostitute Lori, Michael Shoyne as cynical bartender Jake, and Fox Harris as slimy voyeur baseball bat salesman Hermie. A sensationally schlocky treat.",
         "Number 4 on Maxim's list of the 50 coolest B-movie's of all time, this is not deserving of such an honor. Yes, Michelle Bauer does hold a chainsaw at her waist while killing a John in ecstatic glory as she gyrates to a rockabilly song. Linnea Quigley does the \"Virgin dance of the double chainsaws,\" which isn't as much fun as it sounds. How much can you dance with two chainsaws? Gunner Hansen only seems to be a real boy when introducing Linnea's dance. Jerry Fox, Fox Harris?, has one of the hookers pose topless for his little league calender. Then you have Jay Richardson delivering bad one liners while doing a Humphrey Bogart impression. All in all, it's only good for a couple of laughs. P.S. Fred, if I save up enough of those cards, can I get Katie?",
         "Good plot, deep and well made characters, symbolic, creeps, hookers",
         "After a string of recent murders, a private detective asked to look for a missing teenager in Los Angeles finds the girl has gotten mixed up in a cult of chainsaw-worshipping hookers gathering potential targets to offer in a sacrificial ritual and must save her before it's too late. This here was quite the fun and goofy effort. One of the finest points in this one is the fact that there's very little shame in the absolutely cheesy and silly atmosphere here. The sense of humor here is incredibly fun, making this one quite easy to watch as there's a lot of humorous jokes, quips and situations that manage to provide plenty of laughs here, as well as the utterly unneeded voice-over narration that goes against everything usually found during the particular sequence. As these come about mainly from the utterly ridiculous plot line that comes about here, which has so many oddly intertwined story lines here that it manages to bring out the crazy situations rather nicely here with all that it includes so many goofy times here. Connecting ancient Egyptian folklore to that of a chainsaw-worshipping society disguised as hookers leaves such a silly taste here that it really drives the film forward rather nicely here by engaging in so much extreme silliness with the incredibly fun scenes found in the later half when it really takes advantage of the situation. Taking place in the abandoned warehouse filled with the low-rent artifacts to make it look like something set in that kind of location which becomes all the more fun with the fun action taking place throughout here from the special ceremonial rituals that take place featuring the chainsaws being refueled by the women to the gathered masses seeing the different means of preparation that they go through which sets up the big finale with the chainsaw-wielding girls going through the big dance that lets this one end on a high note. As well, this one features all the fun and cheesy gore and nudity with the series of encounters they have with their clients while pretending to be hookers before turning the tables on everyone which allows this to indulge in those elements rather freely which help to give this a rather cheesy atmosphere. These here manage to hold this up over it's small and somewhat unimportant if still present flaws. The main issue here is the fact that the film really doesn't have any real plot-point to talk about as there's a series of unrelated and unconnected scenes that come together to form a coherent story. This one just rambles along at a decent pace with a series of scenes that don't really feel like part of the same story overall since the goofiness of it all makes no sense. It never makes any kind of connection between the need for the Egyptian nature of the cult or the love of chainsaws, and it causes this one to feel quite clumsy. Along with the rather cheap looking feel that runs throughout this one, these here are what hold it back. Rated Unrated/R: Full Nudity, Graphic Violence and Graphic Language."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "American Independent Productions",
         "Savage Cinema"
      ],
      "summaries": ["A man comes across a gang of chainsaw-wielding prostitutes who hack people up for their cult."],
      "budget": 23000
   },
   "movielensId": 140133,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-03-01",
      "dvdReleaseDate": null,
      "directors": ["Fred Olen Ray"],
      "runtime": 75,
      "movieId": 140133,
      "title": "Hollywood Chainsaw Hookers",
      "mpaa": "R",
      "actors": [
         "Gunnar Hansen",
         "Linnea Quigley",
         "Jay Richardson",
         "Michelle Bauer",
         "Dawn Wildsmith",
         "Esther Elise",
         "Fox Harris",
         "Jimmy Williams",
         "Michael Sonye",
         "Dennis T. Mooney",
         "Gary J. Levinson",
         "Jerry Miller",
         "Christopher Ray"
      ],
      "imdbMovieId": "0095312",
      "originalTitle": "Hollywood Chainsaw Hookers",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["3R78TB5t4g0"],
      "plotSummary": "A L.A. Private Eye is hired by a worried mother to find her missing runaway daughter, Samantha. As Private Dick Jack Chandler searches for her whereabouts he will have the misfortune of encountering an evil cult that worships an Egyptian god, the methods of human sacrifice using chainsaws their choice of appeasing their deity. What Chandler learns is that Samantha has revenge in store for \"The Master\" and his bevy of blood-thirsty, chainsaw-wielding hookers.",
      "tmdbMovieId": 27412,
      "avgRating": 2.53571,
      "releaseYear": "1988",
      "numRatings": 14,
      "posterPath": "/59NMlN67QOsoD7aj4D0KE8MYJWG.jpg"
   }
}