{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "pokémon",
         "id": 11451
      }],
      "imdb_id": "tt1160525",
      "video": false,
      "title": "Pokémon: Giratina and the Sky Warrior",
      "recommendations": [
         39057,
         50087,
         25961,
         150213,
         36218,
         34065,
         16808,
         12600,
         34067,
         33875,
         115223,
         227679,
         88557,
         350499,
         10991,
         303903,
         12599,
         415796,
         36897,
         382190
      ],
      "backdrop_path": "/hoI79HOlCIa9xFjUSCAHnBt9XMt.jpg",
      "revenue": 43300000,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe472ac3a36847f8126bd3",
            "name": "Kunihiko Yuyama",
            "profile_path": "/9z3LqqCMRZWyptfIZnlAdG7CnaZ.jpg",
            "id": 65429,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.3228,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 47292,
      "vote_count": 47,
      "budget": 0,
      "overview": "The film opens with Shaymin as Dialga appears. Then, in the Reverse or Distortion World Giratina senses Dialga's presence, and flies up to the Real World to capture him. Dialga drinks, just as Giratina's portal opens up. Giratina then drags Dialga into the Reverse World. Shaymin is also catapulted into the Reverse World. As Dialga and Giratina fight, Zero observes the battle in his ship. Shaymin absorbs a dark gas and uses \"Seed Flare,\" tearing a hole in the Reverse World and escaping. Dialga fires a laser at Giratina, enveloping her in a time loop and trapping her in the Reverse World. As Dialga escapes, Shaymin falls into a river.",
      "similar": [
         10228,
         436931,
         36897,
         10991,
         34067,
         25961,
         382190,
         34065,
         245170,
         4935,
         8392,
         16859,
         51739,
         128,
         129,
         372058,
         430447,
         149871,
         10515,
         81
      ],
      "original_title": "劇場版ポケットモンスター ダイヤモンド&パール ギラティナと氷空（そら）の花束 シェイミ",
      "runtime": 96,
      "poster_path": "/jluzl3scaiz35fMX49LWChPSjj.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2008-07-19",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/iGoYKA0TFfgSoZpG2u5viTJMGfK.jpg",
         "name": "Pokémon Collection",
         "id": 34055,
         "poster_path": "/j5te0YNZAMXDBnsqTUDKIBEt8iu.jpg"
      },
      "tagline": "In a Reverse World, A Legendary Battle Rages On...",
      "adult": false,
      "homepage": "http://www.pokemongiratina.com",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kunihiko Yuyama"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Satoshi Tajiri",
         "Junichi Masuda"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1160525/",
      "coverLink": null,
      "actors": [
         "Rica Matsumoto",
         "Amy Palant",
         "Ikue Ôtani"
      ],
      "reviews": [
         "\"Pokémon: Giratina and the Sky Warrior\" is the English title for the eleventh theatrical movie spin-off from the popular \"Pokémon\" TV series. The movie was a big hit in Japan last summer and the English-dubbed version premiered recently on the Cartoon Network, where I watched it. As a fan of the series and an advocate in print for nearly all the previous Pokémon movies, I have to confess I have mixed feelings about this one. On the plus side, it's arguably the most visually impressive of all the movies, and I'll go into greater detail on this, but on the negative side, I never really got a handle on the chief antagonist, a power-hungry student named Zero, and what motivated him. You need a formidable villain for these movies to work and this entry just doesn't have one. The movie's basic premise centers around the existence of a \"Reverse World,\" a kind of alternate universe designed to correct imbalances in the \"Real World.\" Five years before the events of this movie, a research scientist named Newton Graceland apparently discovered the Reverse World and its sole resident Pokémon, Giratina, a winged, six-legged, metallic dinosaur-like creature. He then tried to tap Giratina's power with the help of a young assistant, Zero. When Newton had a change of heart, Zero broke with him and struck out on his own to try to trap Giratina by using a machine that Newton designed to absorb Giratina's power so that he, Zero, could gain control of the Reverse World and enter and leave it at will. None of this made much sense to me since there doesn't seem to be much in the virtually empty Reverse World to want to control and Zero doesn't seem to have much trouble getting in and out of the real world when he wants to anyway. Series regulars Ash, Dawn, and Brock, along with their regular Pokémon companions, get roped into all this through the intervention of a cute, grassy little Pokémon called a Shaymin, who's on its way to the \"flower garden\" for the \"flower-bearing\" ritual with other Shaymin. Shaymin can communicate telepathically so we can hear its articulated thoughts, making it one of the very few Pokémon (outside of Meowth and Mew) who can actually \"talk.\" It may be cuddly and vulnerable and all, but it gets pretty arrogant towards Ash and his crew as it loudly demands an immediate escort to the flower garden. However, once Shaymin transforms into its \"sky form,\" enabling it to fly above the breathtaking landscapes they travel through, even Ash starts to warm up to it. Shaymin's connection to Giratina and the Reverse World has something to do with its ability to render toxic material harmless via some internal process. Giratina seems to need Shaymin's help and constantly pursues it, provoking fear in Shaymin and its companions until Newton, who enlists Ash and his friends to help him, finally figures out what Giratina wants. The background designs of the \"real world\" are all based on locations in Norway (according to Wikipedia) and are easily the most spectacular I've yet seen in a Pokémon movie (which is saying a lot when you consider the artwork in some of the others, including JIRACHI WISH MAKER and LUCARIO AND THE MYSTERY OF MEW). Especially awe-inspiring is the glacier valley they pass through on a cruise ship, including some high waterfalls and a delightful scene that results when Ash's pokémon fly up with the transformed Shaymin, while Dawn's Piplup dives into the water to meet lots of water pokémon who've clustered around the boat out of curiosity. Later on, the big battle with Zero in his massive, not-so-streamlined retro-style flying craft takes place against the backdrop of the glacier valley and culminates in the arrival of scores of native pokémon trying to avert catastrophe from a sliding glacier. The Reverse World sometimes looks like a mirror image of the real world seemingly above it, but with distorted streetscapes of the village that Ash & co. are visiting and strange pillars of rock supporting upside-down pieces of land with grass on them. Gravity plays tricks on the characters as they pass though it. It's an interesting-looking place, but I never quite grasped its symbiotic relationship with the surface world. The only time we see a concrete example of this is when Zero starts using his flying craft to crash through ice pillars in the Reverse World, which then causes the aforementioned glacier to start sliding up above. It's never adequately explained what appeal the Reverse World holds for Zero other than that he gets to be alone in it, not exactly a compelling motivation for a movie villain. I imagine that other Pokémon fans may have less difficulty with this one than I did, although I have to admit I was starting to have trouble on this score with the last Pokémon movie, THE RISE OF DARKRAI, when I couldn't quite understand the nature of the conflict involving Darkrai, Palkia, and Dialga (who makes an appearance here in the first sequence). It's all starting to get a little too abstract for me. Also, I'm still not comfortable with the new English-language voice cast used for the main Pokémon characters, even though I've had about three years to get used to them. A subtitled Japanese-language edition would be preferable. In any event, this latest Pokémon movie is filled with the kind of visual spectacle we've come to expect from these movies, so it's still worth seeing if you've enjoyed any of the other recent ones.",
         "Back in 2009, I stopped watching Pokémon shortly before this movie came out and moved on to other things. I did it because of how the series was losing its steam and was not going to end anytime soon. Watching this movie for the first time recently reminds me of why. This is definitely one of the weaker entries in the series. Shaymin is one of the if not the most annoying Pokémon ever. He totally got on my nerves. If he is the \"gratitude Pokemon\", why was he so full of himself and such a jerk to Ash? The emotional \"goodbye\" at the end despite him and Ash's hate/hate relationship had me cringing. Zero (that's the best name they could come up with?!) is one of the most boring, generic villains the series has to offer. He is mostly a rehash of the villain from \"Pokémon 2000.\" Even Vicious from \"Pokémon 4Ever\" was a more interesting villain than him. His motives were also pretty questionable. What is so great about ruling the reverse world? I will admit, though, that the reverse world was really cool and interesting. Giratina is one of the best and most \"legendary\" legendary Pokémon. However, the inclusion of Regigigas was totally unnecessary and added nothing to the story. There are some good action sequences throughout, but nothing that truly stands out. The animation is as good, however, and I love \"It's a Beautiful World.\" While not without a few highlights, I still can't say that this movie is a success. It's a mediocre Pokémon film all the way, and probably the fifth worst of the series. Recommended only to Pokémon fans. RATING: C",
         "Due to my personal Pokémon Movie Marathon, it's easy to tell how much Pokémon films have improved over the years due to the creators' efforts and that means Giratina and the Sky Warrior (2008) is different from the rest of the older Pokémon films! It has unique concepts and the creators of this animated feature evidently paid more attention to details such as the Pokémon movements, feelings and personality. The CGI is much better too. Most of all, the creators have played with interesting point of views and angles as well, which allows us to see through the characters' eyes and have a fun experience! Honestly, I will never hide this one fact; Pokémon films can be disappointing no matter how promising they can be sometimes but they are just going all out for their specific target audiences and guess what... I am immensely delighted with this Diamond & Pearl trilogy! The Diamond & Pearl trilogy films have impressed me before and rewatching them again to write about them on my film blog is certainly my pleasure as they have shown improvements in various aspects especially the plot compared to all the older films and are quite entertaining to watch. So for Giratina and the Sky Warrior (2008), I would say it easily is one of the best Pokémon films and like the rest of the trilogy, it is pleasantly interesting! This is just a short version of my review but I must say this: Giratina and the Sky Warrior (2008) is filled with both new and recurring likable characters, endearing Pokémon and a well thought out world concept which can be easily enjoyed by all. It is a great family film and animated feature based on video game; you should watch this especially if you love Pokémon!"
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "East Japan Marketing & Communications Inc.",
         "GAME FREAK",
         "Media Factory"
      ],
      "summaries": ["When a new Pokèmon emerges able to create parallel dimensions, it's up to Ash Ketchum and his friends to stop a mysterious stranger from using its powers for evil!"],
      "budget": 0
   },
   "movielensId": 140228,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2008-07-19",
      "dvdReleaseDate": null,
      "directors": ["Kunihiko Yuyama"],
      "runtime": 96,
      "movieId": 140228,
      "title": "Pokémon: Giratina and the Sky Warrior",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "1160525",
      "originalTitle": "劇場版ポケットモンスター ダイヤモンド&パール ギラティナと氷空（そら）の花束 シェイミ",
      "genres": [
         "Adventure",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["HSSEiFSTxEY"],
      "plotSummary": "The film opens with Shaymin as Dialga appears. Then, in the Reverse or Distortion World Giratina senses Dialga's presence, and flies up to the Real World to capture him. Dialga drinks, just as Giratina's portal opens up. Giratina then drags Dialga into the Reverse World. Shaymin is also catapulted into the Reverse World. As Dialga and Giratina fight, Zero observes the battle in his ship. Shaymin absorbs a dark gas and uses \"Seed Flare,\" tearing a hole in the Reverse World and escaping. Dialga fires a laser at Giratina, enveloping her in a time loop and trapping her in the Reverse World. As Dialga escapes, Shaymin falls into a river.",
      "tmdbMovieId": 47292,
      "avgRating": 3.21053,
      "releaseYear": "2008",
      "numRatings": 19,
      "posterPath": "/jluzl3scaiz35fMX49LWChPSjj.jpg"
   }
}