{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0175122",
      "video": false,
      "title": "Rikki-Tikki-Tavi",
      "recommendations": [
         20806,
         74437,
         84364,
         37485,
         42321,
         26533,
         44001,
         26805,
         45975,
         36461,
         90391,
         35546,
         73595,
         29467,
         28561,
         47623,
         42294,
         35957,
         47305,
         41551
      ],
      "backdrop_path": "/7DiulEJcoiiBH8dn828wkrvVNRv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Narrator / Nag / Chuchundra (voice)",
               "gender": 2,
               "credit_id": "52fe45669251416c75055177",
               "name": "Orson Welles",
               "profile_path": "/k7a0gp3HKWT5uBmfirM74vackiV.jpg",
               "id": 40,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Father (voice)",
               "gender": 2,
               "credit_id": "52fe45669251416c75055167",
               "name": "Les Tremayne",
               "profile_path": "/mWXxR42D22b4vRLCUOqC4zyIPs.jpg",
               "id": 2648,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nagaina the Cobra, Wife of Nag / Teddy's Mother / Darzee's Wife (voice)",
               "gender": 1,
               "credit_id": "52fe45669251416c75055163",
               "name": "June Foray",
               "profile_path": "/rb4iVQ5kP6m138i7CME4Uw5fzc7.jpg",
               "id": 15098,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Teddy (voice)",
               "gender": 0,
               "credit_id": "52fe45669251416c7505516b",
               "name": "Michael LeClair",
               "profile_path": null,
               "id": 49943,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rikki-Tikki-Tavi the Mongoose (voice)",
               "gender": 2,
               "credit_id": "52fe45669251416c7505516f",
               "name": "Shepard Menken",
               "profile_path": null,
               "id": 121617,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Darzee the Tailorbird (voice)",
               "gender": 2,
               "credit_id": "52fe45669251416c75055173",
               "name": "Lennie Weinrib",
               "profile_path": null,
               "id": 90298,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45669251416c75055153",
               "name": "Chuck Jones",
               "profile_path": "/6JpwLPN4ugD5sw5Z0zjPQf6nhh8.jpg",
               "id": 100888,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45669251416c75055159",
               "name": "Chuck Jones",
               "profile_path": "/6JpwLPN4ugD5sw5Z0zjPQf6nhh8.jpg",
               "id": 100888,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45669251416c7505515f",
               "name": "Rudyard Kipling",
               "profile_path": "/jdUjE86nlIm7BcN73vO7DZbhrPU.jpg",
               "id": 14744,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 1.165857,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13415,
      "vote_count": 7,
      "budget": 0,
      "overview": "Rikki is a young mongoose who is adopted by a human family after nearly drowning in the river. He returns the favour by protecting them from two murderous cobra.",
      "similar": [],
      "original_title": "Rikki-Tikki-Tavi",
      "runtime": 24,
      "poster_path": "/3M9d0zL3BmWzcHXNuX7C5HGn8Y0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Columbia Broadcasting System (CBS)",
         "id": 4898,
         "origin_country": ""
      }],
      "release_date": "1975-01-09",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chuck Jones"],
      "runtime": 30,
      "synopsis": null,
      "writers": [
         "Chuck Jones",
         "Rudyard Kipling"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0175122/",
      "coverLink": null,
      "actors": [
         "Orson Welles",
         "June Foray",
         "Les Tremayne"
      ],
      "reviews": [
         "RIKKI-TIKKI-TAVI, the Indian mongoose, takes on the responsibility for keeping the big bungalow belonging to an English family safe. But with the deadly great cobras Nag & Nagaina on the prowl, how long will Rikki be safe himself? This is a very fine adaptation of one of Rudyard Kipling's non-Mowgli tales from The Jungle Books. Directed, produced & written for the screen by master animator Chuck Jones, the story sticks quite faithfully to the original and keeps the requisite cartoon silliness to a minimum. Much credit should go to Orson Welles, who narrates as well as voicing Nag & the nervous muskrat; also to June Foray who gives voice to all three female roles. Together, these two old pros add a great deal to the success of the film. In order to maintain the `cuteness quotient' Rikki is not drawn exactly to scale. Any mongoose who could fit effortlessly in a child's breakfast spoon would certainly be no match for an enraged, adult cobra. The Indian gray mongoose, or Herpestes edwardsi, can commonly live more than 20 years in captivity, with a head & body up to 26 inches long. They are indeed renowned for attacking large poisonous snakes, and they usually win these battles due to their great agility & speed, as well as their very thick coats, through which the snakes' fangs have trouble penetrating. There are many species of mongoose - among them the African meerkat. Children enraptured by Rikki should know that mongoose importation into America as pets is prohibited, due to these little carnivores predilection for hunting & destroying useful animals & birds.",
         "I remember being so excited when I would learn this was going to be on. This and the White Seal were two of my favorites. I feel sorry for kids now days who don't have this sort of anticipation. Now they have them on video and can watch them whenever they like. Part of loving x-mas was that Frosty and Rudolph and the Grinch were going to be on. I haven't seen this in a long time, but since this was created for children I will rate this as I would as a child. It was scary and the snakes posed a real threat. It was incredible that such a sweet fluffy animal would be so deadly. I love this film as I love most things Chuck Jones has done.",
         "When I was growing up, Rikki-Tikki-Tavi was one of those films the teachers and teacher's aides at my elementary school would pull out of the AV room and spool around on film projectors during inclement weather. I can still here the clacking of the film spools wind around even when I watch on my DVD. By middle school and high school, I had all but forgotten about Rikki-Tikki-Tavi until I saw it for sale on DVD. Now that I'm an adult (or something close to resembling one), I can appreciate the stylization Chuck Jones put into crafting Rikki-Tikki-Tavi. This animated short has chills, thrills, spills, and it has enough for the adults that won't make them sick viewing after viewing, which is why I think the teachers would pull Rikki-Tikki-Tavi out of the closet every time the weather was bad and needed to keep us indoors. I saw this film first in the early '80s, and I was somewhat astonished that it was made in the mid-70s, but that makes sense seeing as to how my elementary school was built in the late-70s. Rikki-Tikki-Tavi holds up well and looks as though it could be shown on Cartoon Network next to today's kids cartoons. It's a must see for anyone with a kid or has been one!",
         "Based on Rudyard Kipling's classic tale, this 1975 version of Riki-Tikki-Tavi is one I remember with great fondness from my childhood. You can't go wrong with a Chuck Jones cartoon narrated by Orson Welles. It's a well crafted tale exploring the meaning of friendship set in turn-of-the-century British Colonial India. At only one half hour long, the story moves quickly. I recently had the opportunity to watch it again and was just as entranced as I was as a child, although I had remembered the \"scary\" and \"sad\" portions as being much longer and more tension filled than they turned out to be this time around. It's enough to make you want to go live in India just for the chance to have a house mongoose of your very own.",
         "Like many of the other reviewers on this site, my earliest memories of seeing this cartoon were created in my after-school program, with the film being shown on an old projector. I remember Rikki-Tikki-Tavi to be one of the coolest films that we were shown as kids back in the mid '80s. This cartoon classic had everything: adventure, humor, suspense, just a touch of evil (with the two cobras, Nag and Nagaina) to make things interesting, a great story, and a happy ending. Fast-forward to the present day. By chance, I saw this video for sale at the local Wal-Mart, and the memories started to come back into my mind. Needless to say, I bought the video and watched it again this afternoon. Everything was almost exactly as I remember it from back in the day. Plus, since I've grown wiser with my years, I came to recognize this cartoon as a real classic piece of work. The animation is solid and consistent, just what you'd expect from Chuck Jones. All of the voice work is good, but the stand-out performance has to go to Orson Welles as the narrator, Nag, and the sniveling muskrat. Not only do I now know about Welles being the mastermind behind \"Citizen Kane\", I also respect his work from his later years, as he provided narration for a couple of killer Manowar songs. I'm glad that I bought the video, as it will most likely become a well-loved addition to my collection. See this with your kids and let them create their own memories of this great cartoon!",
         "As a fan of cartoons, I hold \"Rikki-Tikki-Tavi\" to a high regard. When I saw this working in day care last summer, I instantly remembered this classic cartoon, even though I hadn't seen it in over ten years. Chuck Jones, the genius behind \"Cricket in Times Squae\" and \"Looney Tunes\" capitalizes on the popular story by Rudyard Kipling. A mongoose named Rikki-Tikki-Tavi lives with his British family in India in the 1800s, and protects his young master from two deadly cobras, who slither into the family's home in the middle of the night. The animation, though corny, is delightful, mainly because I was young during a time when cartoons didn't need to be one in 3D on a computer to amuse me. Simple animation has always been in good taste to me. This is one of those gems that kids today may or may not appreciate, because of the recent successes of films like \"Shrek\" and \"Toy Story 1 and 2,\" which rely on computer animation. Don't get me wrong, I love these computer animation-based flicks, but I also love the simple classics too. My favorite part is when Rikki-Tikki-Tavi fights off the cobras. I loved how the cobras talked, stressing their s-es. (\"And we'll attack while he's s-s-s-sleeping.\") This is a GREAT film for an educational setting, because it teaches students about culture, plus it is too much fun to watch, plus it is cute. Take it from this 19-year old, see \"Rikki-Tikki-Tavi,\" and get to know a great animator's work. Chuck Jones may be gone, but his legacy lives on in his animated classics. This is one of them!",
         "I am 34 now but I remember watching this when it came on television in 75. My whole family watched. This was a great adaptation..I remember being so afraid of the snakes and really wishing i had a pet like rikki. This is a great film, high drama and scary but appropriate for kids",
         "Chuck Jones took a great story and combined it with a great cast to give us an outstanding animation feature. Orson Welles narrates and supplies the voice of a cowardly muskrat as we see Rikki the orphaned mongoose become a hero to his adopted family in 19th century India. The versatile June Foray provides the voice of Rikki, the boy's mother,the mother bird, and the evil cobra Nagaeena. The text is taken largely from the Kipling story, with whole passages used verbatim. Even the tailor-bird's song is from the original story, with a catchy tune created for the story. This is Chuck Jones' other side: no slapstick. Just a touching, memorable story which captures Kipling's period feel and sentimentality seen through the eyes of the young boy who must live with his colonial family on a distant continent. If you can find this animation on video, your kids ages 5 and up will enjoy it, and you will appreciate the wonderful production and characters.",
         "When i first read the story and saw this film as a child, something happened, that was surely not intended to be happen; neither by Kipling nor by the producers of this film... Of course, the direction, how the viewer shall see this movie and for who he shall cheer up is clearly given... but damn it... i was dragged to \"the dark side of the force\"... i felt strong sympathy and pity for Nag and Nagaina! But why? They was supposed clearly enough to be the bad guys of the story... what forced me to cheer up for the bad guys?? Today i guess, the reason are the characters of Nag and Nagaina. Both are deeper and more interesting than the character of the hero. Both are only want to defend their home, and later, Nagaina want to revenge her husband... who would not try to do the same as Nagaina in such a desperate situation?? A similar situation was given, for example, in \"Road to Perdition\"... and here the audience is clearly on the side of the \"bad guy\" (remember, the hero was a killer!) who want to revenge his murdered wife! A final revenge, that may include the own death too... and at last Nagaina lost the final fight... but damn it, at least she had tried it! She did not run away, nobody was on her side, nobody helped her. She lost her husband, her eggs/babies... she was alone! On the other side, Rikki Tikki had a lot of friends, like Darzee, that helped him in this fight. This did not mean, that i hate Rikki Tikki, he did his job, and he did it good! But you can tell me, i am on the \"wrong side\", i know, that i am standing on the \"wrong side\", but i can't help... i always see the story through the (snake)eyes of the \"wrong side\"! This little movie was really well made, it follows almost literally the book (this story is a part of \"The Jungle Book\" by Rudyard Kipling). The narration of Orson Welles (he made the famous radio broadcasting of H.G. Wells \"The War of the Worlds\" too) was very good. The story seems to be a bit too dark for younger children in some parts, but compared with a lot of crap that was made today, there was a real story behind it, and the makers did not shy away to show the darker parts too. I saw it again a few days ago on TV after many years... and yes, i am still standing on the other ssssside...! ;-)",
         "Thinking back this was one of my favorite movies as a kid, after seeing it for the first time, I remember dragging my mom to every movie rental store in the town, but could never find it. I have seen it maybe 3 or 4 times in my life, but when ever it would come on, I was instantly glued to the TV. It is a story about a mongoose, who is swept out of his den, by a flash flood, and is then adopted by a caring family, who drys him, cleans him, and fattens him up with bananas. In return for the kindness they have shown to him, he saves the family from 2 evil cobras living in their gardens. I would recommend this movie to any Chuck Jones fan, or anyone who loves classic cartoons, and also to check out his other classic 'The White Seal'.",
         "Technically, yes, this is a dark tale. And it can be a little frightful to some children. But I wouldn't worry. There is a happy ending. I remember watching this when I was a child. Not in 75, more like '90 or '91. Sorry, just wanted to make that clear. :D But I loved this cartoon. It was so interesting to me. Sometimes it scared me a little. But even when I was a kid, I loved scary stories. So, I would highly recommend for adults and kids. But if the kids scare easy, you might want to warn them. But also read the book. Yes, even though I am adult now, I still enjoy these classic cartoons. It's a great one. 10/10",
         "A few years ago... I read this story for an English class where they made us over analyze it, make observations, and write poems about the outcome of this story. I didn't so much understand why we needed to do so with this story, as it is for young children. None the less, any small child would adore the cute Rikki-Tikki-Tavi, and admire his courage. However, if your children have a huge fear of snakes, especially cobras, then it's best to keep your distance for a while. This was a cute story, that would appeal to a G-Rated audience. r i k k i t i k k i t a v i r i k k i t i k k i t a v i r i k k i t i k k i t a v i.",
         "This was a cartoon I would absolutely fear watching as a child, but I still watched it with fascination and awe every year during its brief network run. An excellent adaption of the Kipling classic, and a fine example of animation as storytelling. Well worth the purchase, though the snakes are remarkably frightening--again, courtesy of Chuck Jones' genius--so, it may be a little too 'tense' for some children.",
         "SPOILERS To be honest, actually, I am kind of nervous commenting on Rikki-Tikki-Tavi. Maybe it is because I have not seen this television movie in a long time, two years to be exact. Luckily this tale is memorable. You will not forget a film like this for the rest of your life when you see this. The plot is also pretty simplistic. This is also quite close to the facts. I mean, despite the fact that mongooses and cobras do not talk, mongooses do have some sort of grudge against cobras, and they do indeed kill them. I also can not believe that Orson Welles narrated this. First War of the Worlds, now this. Here is the plot of this \"tale.\" When a family moves to India they find a mongoose that has almost drowned. They nurse it back to health. They then keep it as a pet. They name it Rikki. After a battle with a snake the family discovers that Rikki can protect them against snakes, which is a good thing since two dangerous cobras named Nag and Nagaina want to kill the family. In the family's bathroom one night Rikki catches Nag and the father of the family kills him. Nagaina is not too happy with that. She threatens the family. Rikki finds out a way to kill Nagaina. He does kill her, but they do not show it. He and the family live happily ever after. Overall, this is a fantastic tale of a mongoose and a family and a cobra. This is also quite dark in some sort of way. I mean, two cobras want to kill a little mongoose and a little boy and a family. I also like the climax with Rikki and Nagaina. They have a fight in a hole. You do not see the fight, and it is very suspenseful. You are worrying if Rikki will come out of the hole alive. You also have to wait for about ten seconds. Anyway, this is a great television show that you must watch. It is a great film for the whole family. 9/10 Recommended Films: The Jungle Book.",
         "This movie makes a great children's movie for any home or educational setting. The great narration, character voices, and music lend itself to an entertaining and informative video that all kids truly enjoy. The minimization of violence and the accuracy of what happens in nature promote fine discussions on bravery, fantasy, foreign culture, etc, etc, etc.",
         "I remember watching this in the early '90s as a little girl. It would occasionally appear on Nickelodeon. I had completely forgotten about it until several years ago, when I received The Jungle Book for Christmas. With the book, I became reacquainted with \"Rikki Tikki\", as well as \"The White Seal\". This was my first exposure to Rudyard Kipling, although I didn't know it at the time. Because of this cartoon, and others, I became quite a fan of Kipling and still am to this day. Wonderful movie that brings out the four-year-old in me.",
         "I never saw this until today. I remember reading the book & enjoying it greatly. Like another viewer, I felt sorry for the mamma snake, she just wanted to protect her babies. But, She also wanted to kill the whole family. I sort of got a view of it in real life. My cat, Orbs, brought home a baby rattlesnake & was playing Rikki-Tikki-Tavi with IT. I managed to grab her & my dad killed it & buried it. I felt sorry for that one too. He was just minding his own business when my crazy cat abducted him.",
         "\"Rikki-Tikki-Tavi\" is an animated 30-minute movie from 40 years ago and it was directed and written by the legendary Chuck Jones (in his 60s) based on Rudyard Kipling's tale. This is maybe also why it looks a bit older than 1975 as Jones of course had his great years in the decades before that already. Mel Blanc is not in this one, but this is not a problem as the narrator is Orson Welles and the rest of the voice acting is done by prolific (voice) actors such as June Foray. The story is about a little mongoose who becomes the pet of a boy. Initially, the parents are skeptical, but then he keeps protecting the entire family repeatedly (especially the boy) from a pair of poisonous cobras. A good watch for the entire family. The violence is not too graphic and everybody involved with this one did a fairly good job. Thumbs up.",
         "I remember first watching Rikki-Tikki-Tavi as a child but I didn't see it again until some time in 2006 and it brought back some memories for me watching it as a kid. The story follows a Mongoose named Rikki-Tikki who almost drowns only for a boy named Teddy and his father to find him him along with his mother brought him back to full health and becomes apart of the family. Rikki quickly learns that two cobras named Nag and Nagaina live in the garden of the family's home, after they saved his life he feels it is his duty to protected them from the snakes. Chuck Jones and his team made a great artwork for this 30 minute movie. Very good background and the designs for the snakes were very evil and creepy. And the animation they did for Rikki and his quick movements was perfect timing. The voice acting is well done with Orson Welles, June Foray, and Shepard Menken being the best picks for the characters they had voice. The music matches the story and setting of the film and it's location the music was very smart. Overall Rikki-Tikki-Tavi is a very well thought out well told and well animated classic that shouldn't be miss. I give Rikki-Tikki-Tavi an 8 out of 10",
         "I felt compelled to comment on a little film I found lurking around youtube because, aside from it's ludicrously lame material, it oozes potential as something that could be brilliant incorporated into a future full length film. Rikki-Tikki-Tavi is an admittedly inspired adaptation of a pretty silly and insensate fable from The Jungle Book by master animator Chuck Jones. It follows the story of a mongoose who gets rescued by a family of rich European colonists and gets named the short animated film's title. Just the family's luck in timing, they acquire the animal that's known for being successful at defeating venomous snakes right at the same moment some cobras, for no logical reason other then maybe not adopting Rikki's fruit-a-vore diet even though nature suggests otherwise, start causing trouble. When Rikki isn't busy attempting to eliminate India's indigenous snake population, he's talking to birds and muskrats (instead of eating them), snuggling by his master the young boy who discovered him, and being consistently successful in deterring the deadly evil snakes. He of course gets constant praise, and the film's tone never changes. He fights he wins, he fights he wins, he fights and, wait for it...he wins. The message ends up being: snakes are evil, and animals that are naturally capable of killing them are heroes. Appropriately Rikki has an annoying voice that makes him sound like some buff superhero. The characterization's of protagonists and antagonists seem to be dictated on the general consensus of how cute and warm blooded the animals are, and killing solves everyone's problems. Okay, the real problem with the film is it's core idea of sympathizing with British imperialism, but that's not enough reason to write the film off; because you don't agree with it's ideology. However, the film's simple-mindedness messes with it's impact and makes it empty. It's a quickie short without a heart, and has no appeal except for it's oddness and nostalgia; it's better off left in the books. I'm one of the lucky ones to not have encountered this cynical little tale in my childhood."
      ],
      "genres": [
         "Animation",
         "Short",
         "Adventure",
         "Family",
         "Musical",
         "Thriller"
      ],
      "productionCompanies": ["Chuck Jones Enterprises"],
      "summaries": [
         "An English family living in India discovers a mongoose living on the estate. They decide to keep him as pet, in the hopes that he will keep them safe from the many cobras that live in the surrounding jungle. Their new pet quickly begins earning his keep, as two cobras make the family their new target.",
         "\"This is the story,\" says the narrator, \"of the great war that Rikki-Tikki-Tavi fought single-handed through the bathrooms of the big bungalow in Sugauli cantonment in India. Darzee, the tailorbird, helped him. And Chuchundra, the muskrat, who never comes out in the middle of the floor but always creeps around by the wall, gave him advice. But Rikki did the real fighting.\" An English father and his son save Rikki-Tikki-Tavi after the poor mongoose nearly drowns. Rikki quickly becomes a cherished member of the family. The mongoose's motto: run and find out. And what Rikki finds out is a plot by two cobras to kill his newly adopted family.",
         "A young mongoose protects his human family from two murderous cobrae."
      ],
      "budget": 0
   },
   "movielensId": 140367,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-01-09",
      "dvdReleaseDate": null,
      "directors": ["Chuck Jones"],
      "runtime": 24,
      "movieId": 140367,
      "title": "Rikki-Tikki-Tavi",
      "mpaa": "NR",
      "actors": [
         "Orson Welles",
         "Les Tremayne",
         "June Foray",
         "Michael LeClair",
         "Shepard Menken",
         "Lennie Weinrib"
      ],
      "imdbMovieId": "0175122",
      "originalTitle": "Rikki-Tikki-Tavi",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "Rikki is a young mongoose who is adopted by a human family after nearly drowning in the river. He returns the favour by protecting them from two murderous cobra.",
      "tmdbMovieId": 13415,
      "avgRating": 3.2,
      "releaseYear": "1975",
      "numRatings": 25,
      "posterPath": "/3M9d0zL3BmWzcHXNuX7C5HGn8Y0.jpg"
   }
}