{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "intellectual disability",
            "id": 194413
         }
      ],
      "imdb_id": "tt0140785",
      "video": false,
      "title": "About Sarah",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary Beth McCaffrey",
               "gender": 1,
               "credit_id": "52fe4c7dc3a36847f8230e09",
               "name": "Kellie Martin",
               "profile_path": "/ey8rv3wW0SxTfNVdYrLaKb80c3Q.jpg",
               "id": 93663,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sarah Elizabeth McCaffrey",
               "gender": 1,
               "credit_id": "52fe4c7dc3a36847f8230e0d",
               "name": "Mary Steenburgen",
               "profile_path": "/yJhfuqS3yXW7kLSyvRU6n3b35mq.jpg",
               "id": 2453,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lila Hollingsworth",
               "gender": 0,
               "credit_id": "52fe4c7dc3a36847f8230e11",
               "name": "Diane Baker",
               "profile_path": "/vnCHQAyRIxr3JQjhAUzivIfRDB.jpg",
               "id": 6930,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Grandma Rose McCaffrey",
               "gender": 1,
               "credit_id": "52fe4c7dc3a36847f8230e15",
               "name": "Marion Ross",
               "profile_path": "/mdUQH7zZVP9yYeeSD97d1HWYi5a.jpg",
               "id": 75355,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Claudia Avery",
               "gender": 1,
               "credit_id": "58c9c43ac3a3682f8200030b",
               "name": "Aloma Wright",
               "profile_path": "/50kyJVGDV5Oxsf0Izk2M284AgKw.jpg",
               "id": 49551,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "58c9c452c3a3682fe1000313",
               "name": "Nick Searcy",
               "profile_path": "/v9GX9SeQsWwAzRIw5RUB0eG8VT8.jpg",
               "id": 12538,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mike",
               "gender": 0,
               "credit_id": "58c9c462c3a3682ff20002dc",
               "name": "Chad Christ",
               "profile_path": null,
               "id": 1030602,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c7dc3a36847f8230e05",
               "name": "Susan Rohrer",
               "profile_path": null,
               "id": 185917,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58c9c492c3a3682fbf00035d",
               "name": "Susan Rohrer",
               "profile_path": null,
               "id": 185917,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 1,
               "credit_id": "58c9c4a2c3a3682fca000371",
               "name": "Nancey Silvers",
               "profile_path": null,
               "id": 108899,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "58c9c4ed9251414e4f0003f9",
               "name": "Tim Reid",
               "profile_path": "/o5euxJdZMwtQJ37AiaklK8jHKuM.jpg",
               "id": 27771,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.454482,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 164652,
      "vote_count": 1,
      "budget": 0,
      "overview": "When the matriarch of the family suddenly dies, the custody of a mentally retarded mother is inherited by her young daughter.",
      "similar": [
         334,
         8272,
         11631,
         2539,
         8967,
         2024,
         858,
         111,
         634,
         1164,
         13,
         88,
         142,
         773,
         2288,
         4347,
         244772,
         39254,
         112160,
         277216
      ],
      "original_title": "About Sarah",
      "runtime": 93,
      "poster_path": "/taZe0iejd0q8CRYXXpTRA81jEva.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "PGP Productions",
         "id": 22367,
         "origin_country": ""
      }],
      "release_date": "1998-10-04",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Susan Rohrer"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Susan Rohrer",
         "Susan Rohrer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140785/",
      "coverLink": null,
      "actors": [
         "Kellie Martin",
         "Mary Steenburgen",
         "Diane Baker"
      ],
      "reviews": [
         "Kellie Martin is great in this movie,not that we've come to expect any less from her but this is one of the best moving dramas made for tv.It's about a normal girl who gets custody of her mentally retarded mother .A tearjerking drama worth seeing 8/10",
         "Who says only Hallmark Hall of Fame can make wholesome, heart-warming films. \"About Sarah\" is one of the best movies I've seen on television in a very long time. Kellie Martin's performance was just what we've come to expect from her -- sincere with just the right dose of angst thrown in for good measure. The real star of this movie though, who deserves all the accolades she'll rightly receive for her performance, is Mary Steenburgen. What a great performance! If she isn't at least nominated for an Emmy, there is no justice.",
         "this is a very moving and heartwarming made for TV drama.i'm sure many people cringe when they here the words 'made for TV.i think that's too bad,because there are a lot of well made TV dramas.this is certainly one of them.it is as i said heartwarming,but it also has its sad moments.it concerns a mentally challenged woman named Sarah(hence the title)played by Mary Steenburgen.she is in her 40's and has a normal daughter.Sarah can not look after herself,so she is looked after by both her mother Rose(Marion Ross) and also her daughter Mary Beth(Kellie Martin)rose dies and it becomes Mary Beth's responsibility to look after her.she has some help in the form of Lila,Sarah's aunt Lila(Dianne Baker).anyway,the movie details the struggles they have in looking after Sarah.the movie does play on your emotions,but that doesn't matter because it has the goods to back it up back it up.there are few surprises in the movie and a revelation or 2 that you might or might not see coming.the acting is superb on all fronts,but it'Mary Steenburgen who turns in a superb performance as Sarah.she is very believable and credible in the role.Kellie Matin is also very strong as Mary beth.all in all,this is a very well made production.i can't find anything wrong with it.\"about Sarah\" is a definite 10/10",
         "Bravo! Mary Steenburgen presented a very believable and touching performance. The movie had all the critical elements: comedy, suspense, conflict, grief. It was heartwarming, but not \"mushy\"; wish they made more movies like this...",
         "This was one of those rare films that didn't really seem to have any major weaknesses. Usually, when one breaks down a good movie into individual components (the story, the direction, the casting, each performance, the writing, etc.), one starts to realize that there is one element that is making up for other weaknesses (e.g., the direction of \"Dead Poets Society\" makes up for its predictable story, the performance of Kellie Martin in \"All You Need\" makes up for its uneven writing, etc.), but this is one of those rare films (along with films like \"Amadeus,\" \"JFK\" and Kenneth Branagh's \"Hamlet\") that seems to improve when it's broken down. Probably the strongest good point of this film is its excellent acting. Mary Steenburgen is hurt a little in the mind of the viewer when watching by having to play a person with a mental handicap (Anybody who has to do that now has to contend with Dustin Hoffman's performance in \"Rain Man,\" and who can really do that?) but manages to pull it off excellently and even nearly outshine the incredible Kellie Martin. Notice the word, \"nearly,\" there, though. I think one of the most interesting things about watching her movies is that one can easily see her progress over time, and this film is a good example. I watched this on the same day that I first watched \"The Face on the Milk Carton\" and when I consider these in comparison to one another, it is obvious that she had improved greatly by this time. While it is not on the level of her utter brilliance in \"All You Need\" (which was three years later and one of the absolute greatest performances I have ever seen), her performance in this film is nothing short of the excellence one would expect of Hollywood's most respected stars such as Robert DeNiro and Dustin Hoffman. The world's most beautiful woman actually seems to be improving with each performance, which means that she may actually end up catching Emma Thompson for the title of \"best female actor on Earth,\" in my opinion, and \"About Sarah\" includes one of her finest performances. The other acting is well done, though none of the other roles really requires much. Now, I must praise director/co-writer/story-creator Susan Rohrer. She came up with a plausible but somewhat original and very powerful story and executed it wonderfully. While the direction is not striking like Kenneth Branagh's in \"Hamlet\" or Oliver Stone's in \"JFK\" or even Randy Ser's in \"All You Need,\" that type of direction is not warranted for this film. What is warranted is what is given: simple. She allows the brilliant ensemble performance to give the film its depth by using shots that let the actors' emotions come out without pushing it into the viewer's face. The storyline is powerful and plausible but still somewhat original, and it is written well. The dialogue to this film is done so realistically as to give it a power not unlike the power of the completely unrealistic but brilliantly written dialogue of \"JFK.\" Overall, \"About Sarah\" is a very good movie. It's not a masterpiece, but it's not too far off. In fact, it's even good enough that I would say it's my favorite Kellie Martin movie that I have yet seen (though I was so impressed by her performance in \"All You Need\" that even her excellent performance here seems almost disappointing). The direction and the writing give it a subtle power that cannot help but call to mind the master of subtlety, Peter Weir, and the performances are nothing short of brilliant. You should not be disappointed from watching this movie. I do have to say one thing about it that may not seem worthwhile, though. At one point, Mike says to Mary Beth, \"You're one of the prettiest, smartest girls I know.\" How in the world does this guy know anyone prettier than Kellie Martin? I'm not sure that's humanly possible.",
         "Such a beautifully acted tearjerker. Kellie is superb in this film. It is the story of a young woman, Kellie, who becomes guardian of her mentally retarded mother. This is a positive, uplifting film about not giving up on people.",
         "This is a feel-good TV drama about a daughter who was given custody of her mentally-disabled mother after the matriarch of their family passes. This movie generated some emotion for me as I watched the mother (Mary Steenburgen) being cared for by her daughter (Kellie Martin) and other relatives. It reminds me of the hurdles and obstacles a family goes through in life at times, and how sometimes sacrifices are made for the love of another. The acting by the cast of characters really delivered in making this movie heartfelt and believable. I am not a real hardcore fan of drama, as the plots really go at a slow pace at times, as evident in this movie. However, overall, the heart-warming and courageous scenes about one's daughter care for her mother will sure move your heart and probably bring you some tears as well. Grade B"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Procter & Gamble Productions (PGP)",
         "TeleVest Entertainment",
         "Tim Reid Productions"
      ],
      "summaries": ["When the matriarch of the family suddenly dies, custody of a mentally disabled mother is inherited by her normal daughter."],
      "budget": 0
   },
   "movielensId": 140377,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-04",
      "dvdReleaseDate": null,
      "directors": ["Susan Rohrer"],
      "runtime": 93,
      "movieId": 140377,
      "title": "About Sarah",
      "mpaa": "G",
      "actors": [
         "Kellie Martin",
         "Mary Steenburgen",
         "Diane Baker",
         "Marion Ross",
         "Aloma Wright",
         "Nick Searcy",
         "Chad Christ"
      ],
      "imdbMovieId": "0140785",
      "originalTitle": "About Sarah",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When the matriarch of the family suddenly dies, the custody of a mentally retarded mother is inherited by her young daughter.",
      "tmdbMovieId": 164652,
      "avgRating": 5,
      "releaseYear": "1998",
      "numRatings": 1,
      "posterPath": "/taZe0iejd0q8CRYXXpTRA81jEva.jpg"
   }
}