{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "comedy team",
            "id": 10957
         },
         {
            "name": "three stooges",
            "id": 10990
         },
         {
            "name": "hollywood",
            "id": 12396
         },
         {
            "name": "docudrama",
            "id": 15061
         },
         {
            "name": "vaudeville",
            "id": 157768
         },
         {
            "name": "stroke",
            "id": 157769
         },
         {
            "name": "the three stooges",
            "id": 228195
         },
         {
            "name": "biopic",
            "id": 235193
         }
      ],
      "imdb_id": "tt0214698",
      "video": false,
      "title": "The Three Stooges",
      "recommendations": [19505],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Moe Howard",
               "gender": 2,
               "credit_id": "52fe493c9251416c910a6d65",
               "name": "Paul Ben-Victor",
               "profile_path": "/80xWsGSGwTektmHd9xcPdqeOmlI.jpg",
               "id": 85142,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Larry Fine",
               "gender": 2,
               "credit_id": "52fe493c9251416c910a6d69",
               "name": "Evan Handler",
               "profile_path": "/oiu7zC085auAl1XDZruvrj9srY4.jpg",
               "id": 3212,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Shemp Howard",
               "gender": 2,
               "credit_id": "52fe493c9251416c910a6d6d",
               "name": "John Kassir",
               "profile_path": "/d6zZiJ7t3Ve41Ny0ow4PhCyqfMw.jpg",
               "id": 31365,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Curly Howard",
               "gender": 2,
               "credit_id": "52fe493c9251416c910a6d71",
               "name": "Michael Chiklis",
               "profile_path": "/fkJnjCERaqOky0gJrSHmwjQ9oOZ.jpg",
               "id": 19654,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Tom Cosgrove",
               "gender": 2,
               "credit_id": "58a15d0792514136700010f4",
               "name": "Joel Edgerton",
               "profile_path": "/lkOkaMKSRRGLMgkLaCzR9sYgTgx.jpg",
               "id": 33192,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Ted Healy",
               "gender": 2,
               "credit_id": "592ddfe4c3a36808d20017d0",
               "name": "Marton Csokas",
               "profile_path": "/g36Ydyv0YbwXLOQ2KzGjFfkCDo1.jpg",
               "id": 20982,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Joe Besser",
               "gender": 2,
               "credit_id": "592de001c3a36808d20017ed",
               "name": "Laurence Coy",
               "profile_path": "/vUKdooDCikGuFzrGmiQ44EenIRy.jpg",
               "id": 1633566,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Joe DeRita",
               "gender": 2,
               "credit_id": "592de018925141692b0017ee",
               "name": "Peter Callan",
               "profile_path": "/5Kth1LCSwEPl8GXiIx6snxMgqQA.jpg",
               "id": 78567,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mabel Fine",
               "gender": 1,
               "credit_id": "592de275925141692b0019b5",
               "name": "Anna Lise Phillips",
               "profile_path": "/twNiQKAmpyVBJmuuXR75xDFN6DI.jpg",
               "id": 75713,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe493c9251416c910a6d77",
               "name": "James Frawley",
               "profile_path": "/2mIAtwNYmCOb599FVkAXDX8uDWg.jpg",
               "id": 68457,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe493c9251416c910a6d7d",
               "name": "Michael Fleming",
               "profile_path": null,
               "id": 1283931,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe493c9251416c910a6d83",
               "name": "Janet Roach",
               "profile_path": null,
               "id": 21279,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe493c9251416c910a6d89",
               "name": "Kirk Ellis",
               "profile_path": null,
               "id": 1243076,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "57811332c3a3685922000842",
               "name": "Nancy Young",
               "profile_path": "/45Ofa9fi7lCiYoe52SaC2mU6244.jpg",
               "id": 1332245,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "592de0b492514168d700187c",
               "name": "Jim Lemley",
               "profile_path": null,
               "id": 20720,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "592de0c592514168f00017ee",
               "name": "Mel Gibson",
               "profile_path": "/4IsmIFUgoJgUZjen8Ldxnw5YQvG.jpg",
               "id": 2461,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.482863,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85411,
      "vote_count": 5,
      "budget": 0,
      "overview": "A biography of the Three Stooges, in which their careers and rise to fame is shown throughout the eyes of their leader, Moe.",
      "similar": [
         509,
         74643,
         188222,
         11176,
         10242,
         22692,
         294167,
         5122,
         36606,
         117553,
         86816,
         67363,
         115803,
         513937,
         269802,
         467096
      ],
      "original_title": "The Three Stooges",
      "runtime": 88,
      "poster_path": "/dnv8w7jTZp2uZuoCc16U9nN9waz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Storyline Entertainment",
            "id": 8797,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Icon Productions",
            "id": 152,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         }
      ],
      "release_date": "2000-04-24",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Their comedy made us laugh out loud, but their lives were pure drama.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["James Frawley"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Michael Fleming",
         "Janet Roach"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0214698/",
      "coverLink": null,
      "actors": [
         "Paul Ben-Victor",
         "Evan Handler",
         "John Kassir"
      ],
      "reviews": [
         "I did like the fact that the film didn't dwell so much on the comedy part of the Stooges.. although the re-creation of some of their classic routines was excellent.. The film was entertaining because it was a story about the Howard brothers.. Not to forget Larry. I was fortunate to meet Larry when I was a child. He was doing a personal appearance at Hess's Department store .. and as a 7 year old who loved seeing the Stooges on TV.. he was a very nice and also a very gracious man. I do think that it could have been a bit longer .. the film seemed to rush from Curly's stroke in 1947.. right to 1955 with very little about Shemp.. Also there was very little about Joe DeRita.. However all in all .. a very enjoyable film.. even for the non-stooges fan.. whoever you are :)",
         "One of the better biographical TV movies, \"The Three Stooges\" suffers from the main failing that most such movies do: taking \"liberties\" with the facts. There are few things more annoying than watching a movie about people you know something about, and seeing an incident or event portrayed as having occurred that you KNOW never happened, or information given as \"fact\" when you KNOW it is completely wrong, and that happens several times in this film. Overall, though, it was somewhat better than I expected it to be. Paul Ben-Victor was very, very good as Moe. He had Moe's \"Stooge\" character down pat, and was surprisingly effective with Moe's off-screen character, although he didn't play Moe as quite the savvy businessman he was in real life--most of the Stooges' real money was made in personal appearances, and Moe made certain that some of Larry's and Curly's income was invested for their future, as they were both notoriously loose with their money (Curly on women, Larry on horses). Although the film for some reason shows Moe as living a sort of lower-middle class existence after his career ended, in reality he had made some shrewd investments over the years and by the time the Stooges broke up, he was a very wealthy man. Michael Chiklis had the most difficult job--Curly has always been everyone's favorite Stooge, and most viewers would be paying a lot more attention to how he played Curly than how the other two actors played their characters. To Chiklis' credit, he acquitted himself extremely well. Curly, like his fellow comics Lou Costello and Oliver Hardy, was quite graceful for a heavyset man--they'd have to be, to do the kind of physical comedy they did--and Chiklis shared that trait, too. He also had Curly's mannerisms and voice patterns down pat, although his voice wasn't quite as high-pitched as Curly's was. Overall, Chiklis did a terrific job. The one thing that really did surprise me, though, was how badly Columbia Pictures, and especially studio owner Harry Cohn, came across--and deservedly so, given the studio's shabby treatment of the Stooges and how it screwed them out of untold amounts of money. I figured that the filmmakers would pretty much whitewash, or at best just gloss over, Columbia's almost criminal treatment of the comedy team that basically put the studio on the map, but they didn't do that at all, which was refreshing. If you're a Stooges fan you'll definitely like this movie, and even if you're not, it's a pretty good story of one of the most beloved comedy teams in film history. Check it out.",
         "It's a fact of life: Men think the Three Stooges are hilarious, and most women just don't get them. But women might want to give them a second chance after seeing this touching biography. The thing that struck me most about the Three Stooges movie was its tone. This was a film made by people who genuinely cared about the Three Stooges, people who wanted to express their appreciation by giving the world a glimpse of the men behind the laughs. The Stooges were comic geniuses, but they were human and fragile, just like the rest of us. Sure it was sappy at times, and sometimes seemed to gloss over or omit certain events, but hey--you can't show thirty years in two hours without missing something. Especially poignant was the relationship between Moe and his \"little\" brother Curly. Told mostly in flashbacks, The Three Stooges follows the boys from their Vaudeville days with Ted Healy to their triumphant return to the stage after the first TV showing of their two-reel shorts. The reality was that Columbia pictures was making a mint off the Stooges films, but their contract cut them out of any profit-sharing. Anxious to get back to the stage and enjoy some of the fame they've earned, Moe, Larry, and Joe \"Curly Joe\" DeRita agree to make the first of many personal appearances at a TV station. The final scene has Moe, Larry, and Curly Joe taking the stage for the first time in years. I'm not ashamed to admit it: When the curtain went up and the surviving Stooges looked out at the packed house, I cried. Maybe because the Stooges are a part of my history--a good and happy part--the way they're a part of the history of every kid who grew up watching their antics. It's not perfect, but it's the best there is. At the very least, it's a good Stooges primer and a stepping stone to further Stooge research. The Stooges will never go away, because let's face it: As long as men are men, the Three Stooges will be their comic heroes.",
         "My father always loved The Three Stooges. He would often pay full price at a matinée just because they were showing one of the Stooges shorts. So you might say that I grew up in a house where Moe Larry and Curley were a revered prescence. I recently got a chance to see this film on the AMC channel and it is a really fascinating biography of the comedy trio that has become one of our cultural icons. After all, when your talking about three stupid people you know, haven't you often said \"they are a regular Moe, Larry and Curley\". There was an auction a few years back of historical photos and I wanted to share an interesting tidbit. There was a photo of Richard Nixon, Gerald Ford and Jimmy Carter and one of The Three Stooges. The Stooges photo brought four times the price of the Presidential photo! Paul Ben Victor gives a fine performance as Moe in this film. It begins in the late 1950's after the Stooges were considered \"washed up\". A young man tries to get him interested in a reunion and Moe rebuffs him at first but eventually warms to the idea. You sense Moe's bitterness at the way the Stooges were treated. Our greatest comedy teams like Abbott and Costello and Laurel and Hardy were allowed to make feature films while the Stooges were just \"banished\" to short films. I feel that the studio system, most notably Columbia's tyranical President Harry Cohn, were terrible in the way they treated Moe Larry and Curley. They cheated them out of a fortune and it is particularly galling when you think of the outrageous sums of money they pay people like Jim Carrey today. It was only in the 1960's that the Stooges were allowed to make feature films, in one of them, for you trivia lovers, they co-starred with Adam West. Can you imagine that, The Three Stooges Meet Batman! The person who really made this film for me is Michael Chiklis as Curly. The people who know him best as the brutal and corrupt cop on The Shield would get the shock of their life if they could see him as our favorite Stooge. He captures Curley perfectly to the smallest mannerism. The re-enactments in this film of the shorts are taken word per word and it is just amazing. The tragic thing is that Curley and Shemp both died very young, Curley of a stroke and Shemp of a heart attack. Chiklis should have gotten an Emmy for his great job, as they say at one point in the film, Moe may have been the brains of the act BUT Curley was the heart.",
         "Seeing this ABC TV Movie changed the way I looked at the Stooges. I still found them to be very funny (who didn't?) but this showed how they were really ripped off. Paul Ben-Victor, Evan Handler, Michael Chiklis and Jon Kassir do an excellent job of portraying the famous Stooges. This was a drama about the classic funny men. It really was a sad tv movie with not as much humor as you might expect. On the bright side, the film's ending was on a high note for the Stooges.",
         "The Stooges newsgroups were ablaze with postings that blasted the movie before even seeing it. Paul Ben-Victor did a very nice job as Moe. He was stronger in the Life sections then in the On Screen sections. Jon Kassir was very good as Shemp. Michael Chiklis did the best he could with the toughest job; Curly is by far the most famous and sharply defined character of the bunch. Chiklis's main failing is one he really can't help: during the \"Take Off Your Hat\" scene, he was attempting to look puzzled and frustrated, but his own particular eye-squint came across as angry and mean. Evan Handler was an absolutely wonderful Larry. As written, he is the most easy-going stooge, and only slightly hen-pecked by a blonde-bombshell of a wife. (Sidenote: Larry really was the only Stooge to have a babe for a wife, on whom he allegedly cheated frequently. *Larry*?!) Handler and Annalise Phillips, who played Mabel Fine, had a wonderful, complex rapport. And there was a nice rapport between the Stooges. The movie took the usual liberties with time and space, but for the most part it had a very good feel for the Stooges and what they went through to survive in comedy. Two bits of major criticism: 1. Sloppy Motivation. Upon hearing of Ted Healey's death, Curly snaps, \"Healy's not dead.\" Larry: \"He's not dead?\" Curly: (indicating Moe, with whom he's been having a tiff) \"He's right here.\" Nobody, upon hearing the news that someone you knew and worked with just died violently, is going to maintain a snit (even if, according to this movie, Curly never worked with Healy, which he did in real life.) 2. Bad Routines. The movie gives the impression that the Stooges, on their own after breaking with Ted Healy, went the Martin & Lewis nightclub route, winging it with no set routine. The Stooges had a complete, set act, which was meticulously timed and rehearsed. They *had* to, or they would have killed each other.",
         "What movie could concievable take the Stooges we know and love and bring them into the real world - this one. It's a very heart warming film into the boys we thought we knew and a fresher look at the Hollywood of their day. Paul, Evan and Michael recreate the Stooges routines perfectly and even uncannily look like them in some scenes. I think they'd be a great trio to remake the old episodes for the next century even with John Kassir popping up as Shemp!",
         "An avid Stooges fan I have been since I was a little kid. (I'm a rarity among Stooge lovers too. Shemp has always been my favorite) I remember watching this movie with great anticipation. I was highly disappointed with the historical aspects. Now, of course I know it's a movie, but there was a great deal of misinformation presented to the viewer... The first being Shemp's phobias... Everyone knows he was a phobic wreck, but Shemp was not scared of train travel. They also have him looking perfectly comfortable in a car, and this is not true. Shemp was terrified of being in a car. This coming from an accident he had as a teenager while trying to get his license. They also get his age of death wrong. He was 60 not 59. Curly is also run through the mill. They portray him as childlike. This is not true at all. He was the one who cut his hair and didn't babble like a baby at getting it cut. There are other misinformations presented, but too numerous to mention. What was good was Paul Ben-Victor's performance as Moe, and Michael Chiklis' portrayal of Curly (no matter how screwed up the script was). Evan Handler makes a serviceable Larry, while John Kassir is a poor Shemp. Paul Ben-Victor portrays Moe, much the way Moe was in real life. A quiet homebody. Chiklis has every mannerism of Curly down pat, and truly acts the part, but the role was written poorly. There are some bright and warm moments in this, but for stooge die-hards, some of what they present is hard to swallow. ** out of ****",
         "In all the comments I have read before this one, not one mention of the man responsible for the production was Australian actor, Mel Gibson. Gibson, a life-long fan of the Stooges, was the executive Producer of the Film and put up most of the money for the production.(He even did a Stooges routine in the opening scene of Lethal Weapon). And it was filmed entirely in Australia. It is a shame that no American Studio thought enough of them to make the film. The film was a wonderful tribute to the Stooges and the portrayals were magnificent. Here it is two years later and the movie is still not available on Video. How fortunate I was to tape the movie (less commercials), so that I have enjoyed it time and again since I first saw it. I do hope ABC will repeat it or Cable will pick it up to screen on the TRUE Channel. JohnnyReb",
         "A fairly decent made for TV movie, which depicts the beginnings and rise to fame of The Three Stooges. The film concentrates mainly on the behind the scene part of the Stooges lives and career. From their early days with Ted Healy who is portrayed as a somewhat tyrannical figure. The discovery of Larry Fine, the departure of Shemp and the addition of Moes younger brother Curly to the act. Their signing with Columbia Pictures to make the now classic shorts. The sad loss of Curly which led to the return of Shemp to the trio. The lean years before a return to a new generation of fans. The film covers several years and is compressed well for a two-hour movie. It also shows that behind the zany antics the Stooges were known for it wasn't nearly all fun and games. They were entertainers who paid their dues, encountered ruthless studio bosses and even at times the general public who could confuse what they saw on the screen with reality. After seeing this made for TV picture you'll still laugh when you watch the old Columbia shorts and films the Stooges appeared in. You may however find yourself having a greater appreciation for these entertainers whose profession was comedy and took as much pride in what they did as any other professional in the world of show business.",
         "Some of the classic Three Stooges routines are lovingly and precisely recreated in this story of the real life Moe, Larry, Curly, Shemp, and Joe. The sad ups and downs of the master slapstick clowns are well portrayed by the cast. Getting the timing of the comic bits down was craft enough, but we also get the heart and soul that made these people so enduring as artists. The finale is touching considering the terrible misuse and abuse that they suffered from greedy people seeking to get rich off their work. The final victory belongs to the Stooges who still reign as some of the great comic kings of America.",
         "Stephen King TV movies can go 5 or 6 parts and no one complains, right? So why give the Stooges only 96 minutes? I'm not asking for a PBS mini-series, but would a two parter had killed anyone? The movie steamrolled over events that should have been mentioned and mentioned events that could have been omitted. I do want to give a salute to the performances of the stars...they had a tough job because they didn't really look like the Stooges, but the spirit was there. After watching the movie, I pulled out a tape from American Movie Classics that had the real deal on it and laughed myself silly. The movie was pretty tough emotionally, especially after Curly has the stroke and Moe needs to keep the business going. When Curley started crying I lost it...Like I said, the movie was good, but could have been and SHOULD have been much, much better. Maybe it's fitting though...the Stooges got ripped off when they were alive and now, 25 years later, it happens again.",
         "I remember vacationing in Florida when this movie aired. I had set up my VCR to record it. The anticipation was killing me. I had known about the movie ever since it was announced some half a year earlier. We came back from Florida 4 days after the movie aired, and I immediately watched it. I tried as hard as I could to like it, but I didn't. I am a HUGE 3 stooges fan. And as such I know quite a bit about them. So it wasn't like I was expecting to learn anything from the movie, and I didn't. I was more interested with the portrayals and seeing how accurate their information was. There were many things wrong with this film. The actors, the script, the reenactments, ALL could have been much better. Paul Ben-Victor is a tremendously talented actor. But let's face facts, Moe Howard was WAY out of his reach. He doesn't look like him, he doesn't sound like him, and thus, he can't act like him. Michael Chiklis is also very talented, but his portrayal of Curly didn't quite score with me, although when Curly becomes ill he did very well at that. John Kassir's portrayal of Shemp could've been rehearsed better. It was more of a bad impression than a portrayal. Worst of all was Joe Besser. They made him skinny, and more annoying than he really was. It was just plain laziness. I don't like the Joe shorts, because, as the movie illustrates he hardly EVER got hit. But he wasn't that annoying, and DEFINATELY wasn't that thin. The best performance belongs to Evan Handler. He had the most accurate stooge portrayal. The problem with Larry's character, his hair is WAY too frizzy and WAY too red. I know that's too technical, so I won't count that on my list of why I didn't like this movie. Back to Shemp, who just so happens to be my favorite stooge. He is written as a whining, quivering, chicken. True, he had many phobias, but he wasn't that bad. He didn't leave the group initially because he was afraid of Ted Healy, although he didn't like him, Shemp left because he received an offer from another studio that he simply couldn't turn down. Instead of the truth, this movie chooses to make him wet the bed, on Larry no less, run into a closet, and shamefully bow out of the group. Another problem is that Shemp made nearly as many Columbia shorts as Curly did as a stooge, but only one, Fright Night, which was his first short, is shown. His career was almost completely ignored. Plus, lousy editing caused a terrible and most unforgivable error. Shemp was born in early 1895, and died in late 1955. That would make him how old at death? Well, here's a hint, it's not 59 as the movie states. Now for the writing, which I think was flawed only because this movie was rushed out. Some of the lines are dumb and could be developed and/or introduced much better than they were. The one line that really got me was at the very end of the film, when Moe is showing the promoter how the eyepoke is done. \"That's how we do it, make contact with the brow bone, not the eyes, looks real on film though.\" this line was poorly written and poorly placed in the film. It's meant to be one of those lines that make the audience say OH! In amazement and I'm sure it did with some people, but the very end of the movie was not the place for this line. A better place you ask? How about when they show up at Columbia for the first time and are introduced to the sound effects machine. I know initially there was no sound for the eyepoke, but Moe for instance could have said, \"What about this?\" and eyepokes Curly or Larry. Jules White then says \"Are you okay?\" or \"How'd you do that?\" There were a lot of misplaced lines in this film which is a clear sign that the script was rushed out. Another one involves the origin of the name Shemp, although that one isn't as bad, and so I will let that one slide. What does this film do well? It illustrates how the stooges were screwed by Columbia, which they were. I'm not sure if Moe was an errand boy, but that was the kind of dramatization stuff that is meant to get the viewer sympathizing with them. I know this film was a dramatization. I know not everything is going to be crisp and clean and absolutely perfect. However some of the stuff they made up and the real stuff that they ignored were in serious conflict with each other. For instance Curly's stroke is not even close to the way it happened in real life. I know, I know, dramatization, but the purpose of dramatizations is to make real events more dramatic. Curly's stroke in real life is more dramatic than what they showed in the movie. Here's what really happened. Curly was sitting in a chair off screen while a scene was being shot, they called him for the final pie fight scene but there was no response. Moe went to go get him and discovered his little brother head slumped, half paralyzed, unable to speak, and tears streaming down his face. Moe then said \"Babe?\" and tried to help him out of his chair. Poor Curly drops to his knees. Then the ambulance was called. All in all, this movie wasn't terrible, but it certainly wasn't good, or even OK. This film portrays the stooges helplessly and inaccurately and sometimes goes overboard with dramatizations. There is a very, VERY long list of inaccuracies in this film. If you don't believe me, check out a fella named Stooge's list at the threestooges.com news forum. It is about a page and a half long. Some things in the movie I can let slide. But others were unforgivable. The Three Stooges were geniuses, and a lot of today's comedy is based off of what they did. Don't believe me? Check out the Simpsons, and more so Ren & Stimpy. But this film fails to capture their genius. It more so inaccurately captures their hardships, which is important, but if the title of the film is gonna be the Three Stooges, it has to portray their ingenuity and originality more than anything.",
         "The surprise is, or should have been, anyway, that a film about comedy legends is as morose and depressing as this one. Maybe given the usual pandering level of made for TV biographies, this isn't that surprising. After all, everyone 'knows' that every comedian is a noble, weeping clown. Right? --Or if not, it's just the sort of juicy, clichéd skew the makers of biographies can't resist. I would classify the entire film biography form as one of the last bastions of detectably (not delectably, unless you're John Waters) unselfconscious, pre-ironic Corn. As such, it is an area riper than most for satire and parody. To much of the modern audience, this will pose obvious problems. So I wondered, as I caught more than enough of this film, who can be the typical viewer for this kind of thing. You don't go to film biographies for the truth, the inside scoop, and you don't go there (and certainly not in the case of this film) for a feel-good wallow. Why DO you go there? This film highlights two critical problems faced by all makers of film biographies, those for the cheap screen (TV) and those for the too-expensive screen (aka The Big Screen). One is finding an apt impersonator for a high profile person whose mug, body language and delivery are seared into the brain of several generations by high level exposure to their shtick. Those casting these films (like the recent Lucille Ball/Desi Arnaz TV flick) can cleave two distinct ways: Accommodate the literal-minded by casting physical dead ringers (the trade-off being that they may not project the subject very well at all) OR pick someone who is not a physical match, but seems to capture the essence (the obvious problem there is how someone who looks nothing like you captures your essence; not out of the question, but seldom pulled off). The casting here is only serviceable. The way you know this is about the Three Stooges is because of their hair. Period. (One is reminded of the Stooges short wherein Moe, playing Hitler, shouts at the guy who swipes his mustache \"You've stolen my personality!\") The other big problem is the telescoping or condensing of what may have happened over days or weeks into one impossibly pregnant instant. These instants (which seem to happen only in film bios and really bad drama TV series and made-for-TV movies) always remind me of the moment in those late 30s musicals when Mickey Rooney rallies the kids with \"C'mon kids, let's put on a show!\" and on the spot everyone agrees, and everything falls right into place. --Where in real life a muddled period of investigating options and making plans would lead more or less ploddingly to a breakthrough. These films cheat NOT by cutting to the chase, which is always necessary in film, but in the WAY they cut to it. Highly condensed moments never happen this way in real life. It's just bad writing. I know art is not real life, but really good film manages to convey the feel of the way things happen in life. Sometimes total fiction films do it. That's part of the art of film. (Really good comics manage to do it too, even if you can count on the fingers of one hand the strips or books that have managed to rise to that level.) The trite stuff, the rubbish, always rings false, usually comically so. An example: '1955' the screen says. Two of the Stooges are obviously at a funeral. Larry asides to Moe \"Shemp always gave his best; he really put his heart into everything he did.\" Moe back to Larry, with a sanctimonious smirk: \"Yes, but he was always overshadowed by Curly.\" Fade out. That's the entire funeral scene. Now hold on there. I realize some condensation has to take place if you are showing entire lives in a couple of hours. That isn't my complaint. It is the unlikeliness and poor positioning of dialog such as this one that undercut the entire form. If Larry and Moe sat and reflected half an hour a day for two weeks after Shemp's funeral, a fly on the wall might digest what they were saying into \"Yes, but he was always overshadowed by Curly.\" But who can believe for an instant that anyone would speak those words over a coffin? And when Moe pretends to two-finger poke a new manager in the eye, he immediately takes a moment out to explain to the manager --but, duh, really to us-- that \"That's how we do it, make contact with the brow bone, not the eyes; looks real on film though.\" Hoo-boy. Even big films like Pollack have had the same sort of problem. When art phonies corner Pollack between benders and affairs, and simper on about how he is creating \"the only meaningful painting these days\", you don't believe it for a second. In real life, Pollack would have dismissed these knuckleheads who talk like they write, rolled out the yard goods, uncapped the paint and called up a liquor store that delivers. Not in film bio land, though: When fools talk, mouthing the most absurd dialog ever, everyone listens with a straight face. All film biographies, even the big ones, seem to exist in an abstract never never land that feels like a gloss and collage of newspaper clippings. They are uninspired highlight reels.",
         "Although the production value and the acting is great, the story- line keeps this movie from being great. Any die hard fan of the Three Stooges will want to watch this, but most fans will be left disappointed with how bad this movie got the story wrong. With what they could produce in under 2 hours, the movie showcases a multiple bio picture with thirty years of show business history thrown in. Still, how the Stooges are depicted and how history is depicted, leaves the audience the argument to disagree with every scene in the movie. Curly's health is touched upon, but his redemption as a Father and Husband is never discussed. Larry's back-story is hardly shown. This makes the movie central focus being Moe Howard. Still, much of Moe's background is never talked about. His depiction of a \"has been\" after the 1950's short series was far from the truth. Moe Howard was never un-employed or ever retired. The movie gets this wrong since Moe Howard was always working most of his professional career. In the end, the issue of money, fame or importance is never resolved. It is important that the movie mentions how bad the Stooges were treated by the Studio, but we never get to see the Studio's side to the story. The movie does show the human side to the Stooges which is good. Then again, depicting Shemp as a wimp and Joe Besser as a jerk is far from the truth. This is a fictional depiction of the three stooges and far from an accurate depiction of how these men truly were. Then again, compared to the 2012 Comedy the Three Stooges, this movie is much much better.",
         "If one is looking for the TRUE story of The Three Stooges, one should read either the rare book \"Moe Howard and the Three Stooges\" or the more recent and easily available \"The Complete Three Stooges Filmography.\" Or even Wikipedia The Three Stooges, you'll get the truth. This film relies heavily on anecdotal stories, and suffers from an over simplification of their story. This is a case where the real story is far more interesting than what is seen here. For instance, in the sequence where Jerome Howard shaves his head, in real life he did it of his own free will after being turned down initially by Ted Healy. Ted complained of Jerry not being right for them, so he left, and within an hour had shaved his face and head, and immediately created a new impression on their boss Healy. Jerry said \"Don't I look girly?\" to which Ted Healy thought was Curly, and the name stuck. In this film, Curly is basically forced into it by Larry and Moe, who have, in the film, already broken off from Ted Healy. Incidentally, the film skips over their film work with Healy at MGM. Even how they get signed by Columbia is pure fabrication. The truth was far more interesting, where both Moe and Larry had signed two separate contracts on the same day. Columbia happened to get to Moe before Universal got to Larry. And when The Three Stooges join Columbia in the film (1934), Harry Cohn says that Buster Keaton is working for him, but that didn't happen until 1939. And the pathos re: Curly is pretty heavy, even making him fall down while during \"Half Wits Holiday\" (1947), when in fact he had a serious stroke off stage before the final pie fight was filmed. However, if one could stomach pass such failing of fact for fiction, this film is pretty entertaining, and for someone who knows next to nothing about the Stooges, this may be factual enough for them. The performances are decent. Michael Chiklis's Curly is pretty decent and fun to watch. Paul Ben-Victor is also charismatic enough being the protagonist of a film. It's odd to see how Evan Handler's Larry is running around with his Stooge character's hair while out in public. Doubt Larry Fine walked around with his hair like a porcupine. It goes through the story quickly, and with good comic moments. The reenactments are okay, but nothing could replace the real thing. The moments of them on stage are better because they can't be compared to the real Stooges. The framework is decent, cutting back and forth to an older Moe Howard dealing with his new life, and the coming revival. Overall, enjoy it for what it is: a TV biopic. It's about a great story that should be told more often.",
         "The mark of a good Biopic is when you forget you are watching an actor and remember you are watching a character who was actually a real person. This film did okay, for the limited medium it had, telling the \"Stooges\" (a career that spanned decades) in a two-hour movie with commercials. Paul Ben Victor is completely believable as Moe Howard, who really was the driving force behind the act. They started with their tutelage under Ted Healy (implying, incorrectly, Healy was nothing without the stooges when he enjoyed a pretty good career without them in film and stage.) It also portrayed Moe as a guy who was looking out for his partners even when they weren't looking out for themselves. If the film has a weakness, it was in how they portrayed the later stages of their career. Shemp's return to the act was quickly washed over. (In fact, Shemp was with the act for nine years after Curley's debilitating stroke, and two more in the shameful years after his death when Columbia used a double and clips from other shorts.) Joe Besser and Curley Joe DeRita are mentioned, but not really characterized. It was a harsh look at pre-SGA Hollywood, where actors were treated poorly and didn't share in the profits.... Although the stooges did better than most. Overall, a fun film for Stooges fans.",
         "I just stumbled upon this film on YouTube recently, I was pretty moved by the back story about their rise, fall and rise again career. Most of what the movie showed though was not totally accurate, but otherwise an excellent feature for anyone who wants to know behind the stooges. I'm surprised that Michael Chiklis pulled off Curly's likeness, his performance was simply amazing. I did not know that this was a TV movie until I read about it even further, I'm a stooge fan since I was a kid, and their features never change. Overall, not totally accurate with certain events based on what happened on their heyday, this is a film for anyone who is a big Three Stooges fan and wants to see a real tearjerker.",
         "I will say I like The Three Stooges, they are very funny and never fail to make me laugh. This film is an affectionate, well played and efficiently directed memoir to Moe(whose perspective the film is told in), Shemp and Curly Howard. It details of how the comedy act made countless Columbia shorts with little award, the physical toll the trio's routines took and more obviously their comic legacy. This is all made possible by the efficient direction from James Frwaley, a good script and above average production values. The performances are excellent, Paul-Ben Victor and John Kassir are great as Moe and Shemp, but the real star is Michael Chiklis as Curly. Curly was my favourite Stooge, and Chiklis made every effort to stay true to what Curly was like, and I appreciated that, especially in the more poignant parts such as when Curly has his stroke and when he realises that his face is the property of the studio and not himself. Of course, the film is too short and the studio politics sequences with the monstrous mogul Harry Cohn don't quite work. That said though, I enjoyed this. 7/10 Bethany Cox",
         "I hope that one part of this does not actually spoil anything, but in keeping with the etiquette of IMDB, I am warning of a possible spoiler. Growing up with the Stooges, I have come to see them from different age perspectives. From chortling at their slap stick silly antics as a child, to guffawing at the one liners so slyly thrown in, particularly by Curly, I have come to appreciate that they weren't just buffoons, but comic intellects. For those who may say \"intellects? give me a break! They were idiots!\" let me 'splain. If one has ever heard a person perform either singing or playing an instrument badly, guess what? They actually can play those instruments or sing much better than average! Ever watch Laurel and Hardy? Abbot and Costello? Martin and Lewis? The Smother's brothers? The dumb one on stage was actually the brains behind the success! 'Nuff said. On to the movie. From all the stuff I had read about the boys, this movie was pretty close to history... except... According to what I have read, Curly was Curly only when the film was rolling. This film has Mr. Chiklis acting as Curly throughout, except in the touching scene where he is serious... near the end... that is all I will say. Curly was a shy recluse. But overall I give this a very much deserved two thumbs up for the actors' performances. Unlike the critics of Jim Carrey when he played an extremely convincing Andy Kaufman (after all, acting *is* imitating, no??? Yikes! Some critics can be real jerks!) who said his performance wasn't acting (Id like to see THEM try it!) *I* say these guys convinced me in many a scene that they were the resurrection of the boys. And I *was* an actor for awhile (plays)! That said, with nothing more to write, I quote my second most favorite Stooge line \"I'm tryin' to think but nothin' happens!\" My most favorite, and one I happened to use in a similar scenario: Customer \"are you sure this will be in competent hands?\" Curly: \"Soitn'y, were ALL incompetent!\" As a computer engineer, I had a guy come to my team and say almost the same thing. \"I know I have left this in competent hands,\" to which I replied the Curly line \"soitnly! We're all incompetent!\" All were practically in tears laughing! Nyuk, Nyuk, Nyuk! Gabe",
         "Although the telepic is a real treat for Stoogephiles, it is ridiculously short. The actors do a creditable job re-creating classic and not-so-classic (Joe Besser, anyone?) Stooge shorts, especially Michael Chiklis--late of the horrible John Belushi biopic \"Wired\"--as Curly. I would have liked to have seen more of the period in which Shemp re-joined as the third Stooge, but overall, the movie was absorbing and heartbreaking. But what can you say when the Temptations get a two-night miniseries event, and these giants of slapstick are relegated to a one-nighter?",
         "Well done biopic that condensed much of the Stooges long career, is still exceedingly good. The acting is top notch, and doesn't pull any punches when is comes to the often shabby treatment handed to these funnymen by the studio. Just about everyone can quote certain lines or a memorable scene from a Three Stooges short, and to show much these gentlemen are part of popular culture. It was great to see the movie explore their unique and very human complexities.",
         "The movie was a pleasure to watch if you are a fan of the Stooges. The story is told from the point of view of Moe Howard and his relationships with his brothers Shemp and Jerome (Curly) Howard, also the life long friendship with Larry Fine. The movie deals mostly with the off camera high points and pit falls of the Stooges multi decade career. The casting director and makeup artist did a fair job of finding actors who resembled the famous ensemble. The actor who plays \"Curly\" Howard did a fine job of portraying the on camera antics of the most beloved Stooge. A must see for any fan of Three Stooges shorts.",
         "I liked this one a lot but found it to be to short. You really needed to be familiar with the history of the Stooges to follow the film. They could have developed Larry and Curly a lot more than they did. They really glossed over the Healy years and could have done more there tool. They ended the film abruptly at the comeback but do not show the feature films or the cartoon series. The very end also told you what happened to each Stooge but it flashed so fast that I was only able to read about half. They did an excellent job recreating scenes from the shorts that we know. It was interesting that the foley work was done instantaneously, unlike today where it could be done over a period of months in a studio. One thing I remember in Moe's book which was not shown was the day Curly suffered his stroke, the heartless executives insisted that Moe and Larry finish the short they were working on later in the same afternoon! You might remember that one as a big pie fight that doesn't have Curly in it. Curly did appear briefly in one of the Shemp shorts as a sleeping passenger on a train. I know there was big animosity to Joe Besser and that Moe had always wanted Joe De Rita to be the third Stooge. This was shown well in the film."
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Comedy III Productions Inc.",
         "C3 Entertainment Inc.",
         "Columbia TriStar Television"
      ],
      "summaries": [
         "In the late 1950s, Moe Howard, the leader of the Three Stooges, is at a low point of his life with his film career apparently over, and he won't earn a dime from the impending big profits when his films are shown on television. In addition, he is being pestered by a young television executive who wants his team for a live show at his city. Amidst all this, Moe can't help but think back to the past starting from the beginning of the team's career with Ted Healy and their break from him to eventually having a successful film career in shorts. Yet that can't obscure the tragedy of Jerome \"Curly\" Howard's stroke and death or the death of his other brother Shemp. While he reminisces, Moe must decide whether to gamble on whether there will be a new generation of fans who will let the team to enter a new phase of their career.",
         "Dramatization of the lives and careers of the legendary slapstick comedy team. Performing comparatively menial work at Columbia Studios, the site of his greatest success, Moe Howard reminisces in 1959 about the previous thirty years. He remembers his early vaudeville days with his brother Shemp and Larry Fine as stooges to comic Ted Healy, the breakup with Healy and Shemp's departure from the act, Shemp's replacement by brother Jerome (\"Curly\") and their triumphs (and low pay) as the top comedy team in Columbia's shorts department, and the sad departures from the act and the apparent demise of the team. However, Moe must decide whether to gamble on whether there will be a new generation of fans who will allow the team to enter a new phase of their career.",
         "Behind the hilarious slapstick comedy of the infamous Three Stooges lies a deeper and more dramatic story found in their off-screen lives. We are first introduced to the men in their early days of vaudeville, struggling to make ends meet. Then Hollywood calls and their years of hard work pay off, taking them to the \"big time\". However, struggles between each other and health issues create obstacles for the comedy group, yet somehow the group survives and becomes the legend we know and love.",
         "A biography of the Three Stooges, in which their careers and rise to fame is shown throughout the eyes of their leader, Moe Howard."
      ],
      "budget": 0
   },
   "movielensId": 140381,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-04-24",
      "dvdReleaseDate": null,
      "directors": ["James Frawley"],
      "runtime": 88,
      "movieId": 140381,
      "title": "The Three Stooges",
      "mpaa": "",
      "actors": [
         "Paul Ben-Victor",
         "Evan Handler",
         "John Kassir",
         "Michael Chiklis",
         "Joel Edgerton",
         "Marton Csokas",
         "Laurence Coy",
         "Peter Callan",
         "Anna Lise Phillips"
      ],
      "imdbMovieId": "0214698",
      "originalTitle": "The Three Stooges",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A biography of the Three Stooges, in which their careers and rise to fame is shown throughout the eyes of their leader, Moe.",
      "tmdbMovieId": 85411,
      "avgRating": 3.5,
      "releaseYear": "2000",
      "numRatings": 5,
      "posterPath": "/dnv8w7jTZp2uZuoCc16U9nN9waz.jpg"
   }
}