{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt0102674",
      "video": false,
      "title": "Pistol: The Birth of a Legend",
      "recommendations": [
         81024,
         32845
      ],
      "backdrop_path": "/zD0qjCHUXAWaDEzMCl5knyBSqKk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Helen Maravich",
               "gender": 1,
               "credit_id": "52fe47c9c3a36847f814840b",
               "name": "Millie Perkins",
               "profile_path": "/av89VopRGnsRRLgBCIt1hSKNd2g.jpg",
               "id": 26142,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Press Maravich",
               "gender": 2,
               "credit_id": "52fe47c9c3a36847f8148413",
               "name": "Nick Benedict",
               "profile_path": "/cJ1kqGAHBK0Wnj2p2fAhHk6F8X9.jpg",
               "id": 160757,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pete Maravich",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f8148417",
               "name": "Adam Guier",
               "profile_path": null,
               "id": 583190,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Coach Pendleton",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f814841b",
               "name": "Murrell Garland",
               "profile_path": null,
               "id": 583191,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Pete as adult",
               "gender": 2,
               "credit_id": "52fe47c9c3a36847f814841f",
               "name": "Tom Lester",
               "profile_path": "/th07njtfltVgmI3FTVTlTb57vgx.jpg",
               "id": 198415,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Buddy Pendleton",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f8148423",
               "name": "Buddy Petrie",
               "profile_path": null,
               "id": 583192,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Carl Connfield",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f8148427",
               "name": "Darrel Campbell",
               "profile_path": null,
               "id": 583193,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sandy",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f814842b",
               "name": "Wendy Leblanc",
               "profile_path": null,
               "id": 583194,
               "order": 7
            },
            {
               "cast_id": 2,
               "character": "Moose",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f814840f",
               "name": "John Richardson",
               "profile_path": null,
               "id": 99796,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Rachel",
               "gender": 0,
               "credit_id": "52fe47c9c3a36847f814842f",
               "name": "Melinda Walsh",
               "profile_path": null,
               "id": 583195,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe47c9c3a36847f8148435",
            "name": "Frank C. Schröder",
            "profile_path": null,
            "id": 583196,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.002889,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50503,
      "vote_count": 13,
      "budget": 0,
      "overview": "A story about the great basketball player \"Pistol\" Pete Maravich when he was in the eighth grade. He plays on the varsity basketball team at Daniel High School but has some very difficult obstacles standing in his way of playing. The only support he has is from his father, retired basketball pro Press Maravich.",
      "similar": [
         13416,
         9655,
         10637,
         22881,
         8923,
         9291,
         2300,
         323677,
         86130,
         4942,
         10474,
         9563,
         2323,
         12163,
         15070,
         1578,
         1374,
         45317,
         42888,
         8456
      ],
      "original_title": "Pistol: The Birth of a Legend",
      "runtime": 90,
      "poster_path": "/aG7U4YRc79GQb2CsyIl7ZRyPTMo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "L.A. Film Partners",
         "id": 8105,
         "origin_country": ""
      }],
      "release_date": "1991-09-29",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "The story behind the life of one of the greatest basketball players of all time.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Frank C. Schroeder"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Darrel Campbell",
         "Peter Maravich"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102674/",
      "coverLink": null,
      "actors": [
         "Millie Perkins",
         "Nick Benedict",
         "Adam Guier"
      ],
      "reviews": [
         "This is about as clean a story as you could find: a nice story about the famous basketball player \"Pistol\" Pete Maravich in his earlier days. An incredible talent, Maravich went on to star at LSU and then in the professional NBA. This particular story centers around young Maravich as an eighth-grader playing basketball for his high school team. The first half of the film was fascinating as actor Adam Guier was very credible exhibiting Maravich's tremendous ball-handling skills for a kid his age. There also is some nice photography in here. The second half of the movie became a little too Hollywood-cliché ridden. I wish they had gone into Pete's college and pro career and ended with his conversion to Christianity before his untimely death. It could have been a very powerful movie instead of just a nice after-school-type TV film. (Just reading another review here, I am glad to learn some of that material is included in the DVD. My only look at this was on tape about a dozen years ago.)",
         "The guy from Chicago doesn't know what he's talking about. He is probably looking for special effects and watches too many star wars flicks. The movie is a great family film and I was captivated from beginning to end. The young Pete has a lot of talent too. The movie should motivate kids to shoot for the impossible and dreams can be realized as well. The movie was heartwarming and I liked the characters very much. The DVD also contains actual clips when he was a player and also has Pete's testimony as a born again Christian. He shares his faith and this is what is important to him. There are many other clips or extra's that give you a feel for what the man has accomplished and to understand how great an athlete he was.",
         "This film is one of the few & best movies made to portray any type of sporting legend! The Pistol follows the dreams, struggles & inspirations of a young Pete Maravich growing up to eventually become the master showman and basketball legend we all know him by today. As a kid myself (at the time i first saw this film) living in Australia who loved and played a lot of basketball, i was totally unaware that Pete Maravich even existed. After watching the film with all its captivating drills and challenges between Pete and his father, i was not only glad to have been introduced to Pete's story, but i will never want to forget it. With the films dazzling basketball scenes of a young pistol (played by Adam Guier) out-training and out-performing everyone in the basketball community, this movie carries a simple and memorable message of following ones dreams with the guidance of those closest to you. As a well travelled basketball player in Australia, i was surprised that many of the country's young and elite talents have not heard of Pete Maravich. This is unfortunate, as his real life story portrayed in this film is really inspirational and shows the appreciation Pete played in the history and shaping of todays game - worldwide. Perhaps a little conversation as well as some recommended viewing of the released DVD on my part will hopefully shed some light on the Pistol Pete story! or at least here downunder. I definitely recommend this film to anyone who has an interest in basketball and everyone else due to its family orientation as well. 10 OUT OF 10",
         "Great film, and Adam Guier really acted well, showing the great determination of Pete, along with the talent of the writers and directors, who really made you feel like you were part of Pete's story. It is not a well known film, but this does not mean it is bad, or obscure or anything like that. It really inspires me and it can be easily watched over and over again. I will never get tired of this film. It is a fantastic piece of cinema that I think deserves more recognition than it gets. I would recommend it to anyone, even non-basketball fans. If you ever get a chance to see, rent or buy this film, don't pass it up, I promise you, you will not regret it.",
         "I enjoyed this video. The movie-making quality is not the highest, and the acting is undoubtedly less than stellar. However, I found that this movie had a lot of heart. It is a much better family movie than many others out there, with no profanity and little violence. I'd recommend this movie to anyone who has an interest in Pete Maravich and his life. This movie was made to describe the basketball history of Pete Maravich, and shows a special relationship between Pete and his father, which I thought was refreshing. It's a joy to see a parent who did his best to establish common ground with his child so that they could relate to each other. So if you're interested in basketball, go ahead and check this movie out. You may find yourself charmed by the innocence in the story of the young Pete Maravich.",
         "If you can find it, this movie is worth watching. It features superb acting and relatively good sports footage. But the most attractive thing about this movie is its family orientation. There is virtually nothing objectional in the movie, yet it doesn't suffer from a Disney-ish G-rated feeling. It seems like real life in a loving family environment. Of special note is the delicately handled relationship between Pete and his father. Overall, this is a magnificent sports movie and a great any-movie. Worth renting or buying if the opportunity presents itself.",
         "When I saw this for the first time on video, I fell in love with it. Sure the filming is not the best, and the acting could have been better, but it makes a very good point on sticking to your dreams. It also shows that in basketball, size doesn't matter, because you can be very good if you work hard at it, and that is the same with any thing else. It also shows how tight of a relationship Maravich had with his father. I feel that this is a great movie for anyone, especially basketball players. I can guarantee that you will love this film after you see it and even though it was a low budget film, it is still very good for people of all ages",
         "The movie, Pistol: The Birth of a Legend, is an excellent movie. It isn't the #1 hit at the box office type, nor does it have expensive great special effects, like many of the movies of today have. It is simply a story of Pete Maravich, a young boy who's whole life is about basketball. He is inspired by his father who seems to be the only one with faith in him. I am a basketball player and ever since I was a young child going to basketball camp our coach would play this movie every year. It motivates us. To this day we love it when Coach says we are going to watch it. We know every line and appreciate the movie. It is a great motivational movie, I definitely recommend it!",
         "The one-line summary above is not meant as a pun (he died of a heart condition), but is a true assessment of Pete's feeling for the game. This is a must-see movie for anyone who was a fan of basketball in the 70's. For anyone who wants to be inspired to use their god-given talents to the fullest - then, again, this is a must see movie.",
         "This film won't impress you with special effects or big-name stars, but it's the type of film that you enjoy so much that you're saddened when it's over. Any basketball fan must view this inspirational homage to Pete Maravich, although non-fans will still appreciate the heart of this little film.",
         "Pete Maravich was an amazing player--a guy whose college basketball average was a shade over 44 points per game! In the pros, he was also an amazing player and I was fortunate enough to be able to see him play when I was a kid. Unfortunately, Maravich died during a pick-up game when he was only 40--dead due to an undiagnosed heart ailment. This movie about his experience playing first year varsity basketball is a homage to his talents, though I think the man probably deserved a bit better than this. The boy playing Maravich, Adam Guier, was terrific. His ability to handle the ball made him a joy to watch. So why am I a bit cold about this movie? Well, the script and especially the style of the film are a bit wanting. The film too often relies on hip music, montages and clichés. Additionally, while I am sure Maravich was incredible at this age, the film never shows him once missing a shot...not even once out of several dozen shots!! This all work together to create a film that might entertain kids but which also just cannot be taken very seriously. Not a bad film...just not a very impressive one either. By the way, the choice of the narrator was interesting. Tom Lester (Eb Dawson from \"Green Acres\") was chosen and it did make me laugh to hear him speaking as the grown up Maravich.",
         "The Birth of a Legend isn't going to push the boundaries of Hollywood biopics. No, in fact it's going to strip the genre down to the most pedestrian indie roots. But, in those roots there is some honesty, goodness, and a damn fine story.. Pistol Pete Maravich was a true outsider who became much more than just a play maker\u0085 Maravich became iconic. When I was young there was John Havlichech (sp?) in the pros and Pistol Pete playing for LSU. Other than these two guys, and maybe Lew Alcindor,, I was oblivious to basketball superstars. What made Maravich more prescient was that he was a kid who another kid could relate to. Let me preface my review. I was a kid in junior high school when Pete was making his name at LSU. I wasn't particularly good, but I could relate to Pete because he was everything a kid wanted to be.. He gave me hope and I was an instant fan. Birth of a Legend is, often, noticeably, a shoe-string budget film. More often than not, however, it rises above it's humbleness and delivers. Not unlike the subject it weaves the story of. This movie has it's heart in exactly th right place, and the special period in which it all transpires somehow is lovingly brought to life. This was a transitional period in basketball. The old guard ruled, but the brashness, later exemplified by those born out of urban playgrounds, was just peaking it's head. And in all places this was happening with a very structured, and coached, player with uncanny natural instincts. Pete Maravich had something otherworldly. He had amazing ball handling talent to be sure, but he had a knack for amazing assists brought about by making amazing passes to open players never seen before. Maravich could literally score using another player to actually make the basket simply by making an impossible, and totally unexpected, pass only he could see as possible. Maravich invented a new style of basketball which was, at the time, almost impossible to defend. e of what this magic was all about. For all others I'd simply say see this humble film. It gets the \"high points\" right and has it's heart in exactly the right place. Pete Maravich was simply a other wordily player whose flame cast a long shadow. It bears mention that even in much smaller physical stature the young man playing Pistol Pete was amazing in this movie. That an the portrayal of his father deserve special mention. \"The Birth of a Legend\" transcends it's money-strapped simple roots and delivers a bigger message. A recommended watch. As a high school basketball player I must say I saw a bit of the magic that was Pistol Pete when a player named David Hall transferred from Indiana to our north Alabama rural team school when I was in the ninth grade. A player who could pass like no other and make those impossible hip shots. I caught a glimpse of this ethereal talent. For all others I simply say see this film.",
         "I mention the Omega Code because it is my personal benchmark of bad movies promoted by Christian ministries (i.e. Paul & Jan Crouch of TBN). I had never heard of this movie until recently receiving a promotional e-mail from the American Family Association (Don Wildmon), which by the way, had bad (404) links anyway. With the NBA finals going on, I decided to rent it from NetFlix. I have to agree with most of the comments from the last two posters and disagree with most of the comments from other admirers who must be suffering from 1 Corinthians 13:12 ('seeing dimly'). The film was a big disappointment. The acting, writing, and more importantly -- the directing, was some of the worst I have seen. I had hoped to see a true biography of Maravich's life and accomplishments -- not a snapshot of one year (8th grade) in his life. Certainly none of the content is offensive in the movie (unless you consider 'butthead' vulgar), and if your child is involved in PIP and/or Upward Basketball, you'll recognize many of the drills.",
         "I'm beginning to think that every other person (save one) who posted on this movie's board has sustained some sort of serious head trauma. I looked this film up with hopes that I could enter into some fantastic and deeply ironic conversation on this film's utter lack of merits. Imagine my surprise when I found that some people seem to enjoy this terrifyingly bad piece of rubbish. The acting is atrocious, particularly from the slow child in the title role. He seems ruefully aware of the fact that there is a camera in his face. The script seems less to have been \"written\" then compiled from a book of clichés by an illiterate night manager at Wal-Greens. The screenwriters hope to trick the audience to accepting comments like \"you don't want people to think you're light in your loafers, do you?\" as homespun wisdom or, at the very least, something that normal loving families say. Maybe I'm just a purist, you know, with wanting healthy relationships to be sustained by something more than a game. But apparently, according to a few posters, a shared love for basketball is a healthy and loving way for a father to relate to his son. One wonders what sort of relationship Press would have had with his boy had he been, say, a dancer. I'll leave that to your imagination. In any case, this movie blows. Hard. Don't ever ever ever ever ever watch it.",
         "I'm in a weird position with this movie. I watched it when it first came out, when my boys were still quite young, and remember liking it immensely. Now, all these years later, I saw it on Neflix Instant and thought it would be fun to watch with my eleven year old stepson. Wow, what a difference 20 years makes! I could hardly stand to watch this show through (Actually, I didn't. I got a call part way through and used it as an excuse to miss a large part of it!). I have to second what others have said about the god-awful acting by everyone in this film. It just all grated on me...the moralizing speeches by the father, the rants of the coach, and, to the greatest extent, the horrible performance by the lead. Another reviewer mentioned the whispering narrator. Listening to him made the hair on my neck bristle! In this era of Hollywood \"rebooting\" movies (i.e. The Hulk, Spiderman, etc.), this is a story worthy of a new -- and much more refined -- look. Pistol Pete's story is inspirational and I'd love for someone to put it in a movie that doesn't make me want to run an ice pick through my right temple. Side Note: My stepson actually seemed to like the movie. Perhaps one of the reasons I appreciated it all those years ago was because it was so squeaky clean and, as a parent, I didn't have to cringe my way through any of the subject matter."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["L.A. Film Partners"],
      "summaries": [
         "A story about the great basketball player \"Pistol\" Pete Maravich when he was in the eighth grade. He plays on the varsity basketball team at Daniel High School but has some very difficult obstacles standing in his way of playing. The only support he has is from his father, retired basketball pro Press Maravich.",
         "Biography of pro basketball player \"Pistol\" Pete Maravich, who died suddenly in 1988 at age 40 from a heart attack."
      ],
      "budget": 0
   },
   "movielensId": 140391,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-09-29",
      "dvdReleaseDate": null,
      "directors": ["Frank C. Schröder"],
      "runtime": 90,
      "movieId": 140391,
      "title": "Pistol: The Birth of a Legend",
      "mpaa": "G",
      "actors": [
         "Millie Perkins",
         "Nick Benedict",
         "Adam Guier",
         "Murrell Garland",
         "Tom Lester",
         "Buddy Petrie",
         "Darrel Campbell",
         "Wendy Leblanc",
         "John Richardson",
         "Melinda Walsh"
      ],
      "imdbMovieId": "0102674",
      "originalTitle": "Pistol: The Birth of a Legend",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story about the great basketball player \"Pistol\" Pete Maravich when he was in the eighth grade. He plays on the varsity basketball team at Daniel High School but has some very difficult obstacles standing in his way of playing. The only support he has is from his father, retired basketball pro Press Maravich.",
      "tmdbMovieId": 50503,
      "avgRating": 4.33333,
      "releaseYear": "1991",
      "numRatings": 6,
      "posterPath": "/aG7U4YRc79GQb2CsyIl7ZRyPTMo.jpg"
   }
}