{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "opera",
            "id": 2199
         }
      ],
      "imdb_id": "tt0275170",
      "video": false,
      "title": "The 4th Tenor",
      "recommendations": [],
      "backdrop_path": "/rGEEE8Wex3cskIhymOjJdiwQjPi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lupo",
               "gender": 2,
               "credit_id": "52fe4646c3a368484e087bcd",
               "name": "Rodney Dangerfield",
               "profile_path": "/bbuVnFU4j19wN5gtUwHU3xzODGH.jpg",
               "id": 3198,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Rosa",
               "gender": 0,
               "credit_id": "546f6ad1c3a3682fa40022f8",
               "name": "Anita De Simone",
               "profile_path": null,
               "id": 1387597,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Gina",
               "gender": 1,
               "credit_id": "546f6adb9251417066000251",
               "name": "Annabelle Gurwitch",
               "profile_path": "/fNubMSpdGfRT94qDsOKJs7BcdZd.jpg",
               "id": 42324,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Alphonse",
               "gender": 2,
               "credit_id": "546f6ae9c3a3682fad0020fb",
               "name": "Charles Fleischer",
               "profile_path": "/vlF5j4y3lEKO6wXJ1R98ixUmebx.jpg",
               "id": 12826,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Ierra",
               "gender": 2,
               "credit_id": "546f6af8c3a3682f9e0024ef",
               "name": "Robert Davi",
               "profile_path": "/eJoUfpgI5TDUqc4vgq3dPaqlMku.jpg",
               "id": 2055,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Papa",
               "gender": 2,
               "credit_id": "546f6b059251417066000255",
               "name": "Hamilton Camp",
               "profile_path": "/tB43NEMeqmQM4zQQc5zk0IIcqg3.jpg",
               "id": 101606,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4646c3a368484e087bc9",
               "name": "Harry Basil",
               "profile_path": "/cOzlHNvyyLq5DeZH7MXjpwvvfJU.jpg",
               "id": 60616,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546f6ab492514112ee002022",
               "name": "Harry Basil",
               "profile_path": "/cOzlHNvyyLq5DeZH7MXjpwvvfJU.jpg",
               "id": 60616,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "546f6ac2925141706600024e",
               "name": "Rodney Dangerfield",
               "profile_path": "/bbuVnFU4j19wN5gtUwHU3xzODGH.jpg",
               "id": 3198,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.425167,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61113,
      "vote_count": 2,
      "budget": 0,
      "overview": "A restaurant owner falls in love with an opera singer and, desperate to impress her, travels to Italy to learn how to sing.",
      "similar": [
         279,
         35056,
         639,
         928,
         9502,
         788,
         342473,
         376867,
         295964,
         9462,
         72207,
         7549,
         58224,
         25468,
         41210,
         8346,
         3638,
         4593,
         68812,
         123109
      ],
      "original_title": "The 4th Tenor",
      "runtime": 97,
      "poster_path": "/5wbBAFiwrB6pFTQ1IROU5Zd04wV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "WW & S Productions Inc.",
         "id": 39050,
         "origin_country": ""
      }],
      "release_date": "2002-12-03",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Rodney gets no respect - until he changes his tune!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harry Basil"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Rodney Dangerfield",
         "Harry Basil"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0275170/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTI0MzY4NTIzM15BMl5BanBnXkFtZTcwODEyMjAwMQ@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Rodney Dangerfield",
         "Anita De Simone",
         "Annabelle Gurwitch"
      ],
      "reviews": [
         "Being a huge Rodney Dangerfield fan, it was more of a sad than funny experience watching this film. It's not for the simple reason that I know that Rodney is no longer with us, but the fact that he looks extremely sick throughout this movie. His face is pale, his eyes are really puffy. There are quite a few scenes in the film where it's evident that Rodney would've rather been lying in bed than performing. So right off the bat, don't expect that same relentless energy you saw in \"Back to School\" or \"Easy Money.\" There are even scenes where he screws up the timing of his one-liners. It had nothing to do with incompetence (Hell, Rodney's the GREATEST comedian of all time, in my opinion), but because sickness and old age had gotten to him. Now let's go on to what I did like about \"The 4th Tenor.\" It may not work perfectly as a comedy, but it makes a touching and light-hearted romance. I really did feel for Rodney's character, as the woman who captured his heart would continually blow him off. And I also felt his new-found love for the Italian woman, who would treat him with nothing but love and respect, but is forced to marry the man her father wants her to marry. The movie even has a climax, involving Rodney rushing to the wedding. Normally, I hate when I see that cliché in romantic comedies, but since I was taken by the story, I was able to forgive the cliché. This is in no way a memorable film, and the gags come in an intermittent fashion. I don't think director/comedian Harry Basil was talented enough to find the right balance to make this film work as a comedy. The comedy arrives in a too-little-too-late fashion, amidst handfuls of sentimental moments. If you're in the mood to laugh, I'd better suggest any of Rodney's other films. Or you can simply pop in his great \"No Respect\" CD. But I enjoyed this film for what it was. It went straight-to-video, and has straight-to-video written all over it. The filmmakers didn't even put in a half-assed effort to make the sets appear like Italy. And the New York scenes were obviously filmed on backlots. Harry Basil's a comedian and not a director, and it shows in his amateurish style.",
         "If it is true that Rodney Dangerfield \"don't get no respect,\" then it is not for the want of trying. This latest outing into features by the 80-year-old comedian, who had a star unveiled recently on the Hollywood Walk of Fame, keeps the sight gags coming fast although a little restrained. Rodney is Lupo, the owner of an Italian restaurant who employs singing waiters and waitresses. He is in love with one waitress whose operatic areas pack them in every night but she doesn't return the favor, understandable as Lupo's singing voice could stop a clock. In a move to impress her, he flies to Italy for the best singing coaches.He has an open checkbook so he is quickly aided and abetted by a couple of con artists who see a crock of gold at the end of this particular rainbow. If anything, this movie is lighter on extraneous humor and heavier on plot which, in my opinion, is an improvement over his earlier excursions. Dangerfield has good rapport with the assembled cast headed by Robert Davi as the chief antagonist. Once Lupo is in Italy, \"The 4th Tenor\" takes on a sort of fairy tale quality which increases the entertainment quotient and is sure to please more than the usual Rodney Dangerfield fans.",
         "A comedy like this won't hold up to today's standards. It doesn't have the acidic bite, the sarcasm or the snappy gags that make modern comedies so successful, despite the fact that it was written by & stars Rodney Dangerfield who basically invented acidic bite, sarcasm & snappy gags. Instead, in this story--the last one Rodney would write for the big screen--he takes us on a trip back to the smooth, human vibe we used to get from the classic comedies with Jimmy Stewart, Tony Curtis, etc. He doesn't play the part of the wisecracking, quick-witted hero you might expect from \"Back to School\" but instead he plays sort of a schlep, an emotionally downtrodden loser (despite his material success) who evokes our sympathies like a lost puppy dog. Having read some of the other reviews, I think this takes people by surprise, particularly his fans, who deem his performance sluggish & lackluster. However, if you drop all preconceived notions of what a Rodney film 'should be' and instead approach this as a human story where the wisecracks are merely incidental, you'll really enjoy it. This is Rodney, the real man, not the performer. And I consider it a real treat to catch a glimpse of his human side. Some of the gags are predictable or outright silly, but then again, can't we say the same thing about a classic Jimmy Stewart comedy? I can't stress enough how much this film reminds me of those bygone movies, right down to the dreamy cinematography (lots of crane shots) and manufactured studio sets (like in the opening scene of a city block on a rainy night: pure nostalgia). I think a lot of care went into establishing this old-timey vibe. It's quite the opposite of the slick & hip \"Back to School\" (which I loved, by the way). \"The 4th Tenor\" is more like an 80s Hugh Grant romantic comedy but instead of the face of prettyboy Hugh & his classic British accent, we get the mug of Rodney Dangerfield & his Brooklyn twang. If that image doesn't scare you off, then I think you'll really enjoy the flick.",
         "This is a very predictable romantic comedy. Although he is the main character, we see very little of the Rodney we have come to know and love. We see so little of Vincent Schiavelli, its hard to tell its him. The operatic ingenue-diva, early on, is certainly fetchingly sensual, but her portrayal of a devious wench is unconvincing by any measure. Generally, the acting by all parties is tepid. There are a few beautiful landscapes of Italy in the movie; watch for them. Sadly, most of the action is shot on a soundstage. The operatic elements are wonderful, but all too short. The fans of opera will play this soundtrack over and over, and use the DVD as a coaster for their iced latte. Lose the DVD, save the Soundtrack.",
         "Do you find Rodney Dangerfield amusing? Would you like to see an entertaining Dangerfield film? Then avoid THE 4TH TENOR. It is a pitiful vanity project where Rodney generally neglects his strengths and wallows in sickening bathos. As a prosperous Italian restaurant owner named Lupo, Dangerfield falls in love with a young luscious singer Gina (Annabelle Gurwitch). She doesn't return his affections, especially since Lupo can't sing opera. So he goes to Italy to take opera lessons. There, he meets a sweet local girl named Rosa (Anita De Simone) and learns the secret of great singing. Will Lupo find true love? Who really cares? Part of the problem with THE 4TH TENOR is that Dangerfield is far less interested in generating laughs than in endearing himself to his audience. Rarely does he spew his customary one-liners. Instead he spends an awful lot of time acting lovelorn and wistful. But his strivings for sentimentality are so humorless and effortful, he becomes embarrassingly cloying. Even more disturbing is the concept of the geriatric, physically homely Dangerfield romancing women young enough to be his granddaughters. Part of the appeal in Dangerfield's stand-up act was that he acknowledged he was ugly and therefore unsuccessful with women. If he wanted to be a romantic lead in his dotage, why couldn't Rodney pursue women his own age? The pedestrian supporting cast cannot enliven the dreary material. They are the type of bland performers you'd expect in a film deemed too poor for theatrical release. THE 4TH TENOR is truly a morbid experience. One watches an embalmed looking man who, in attempting to touch our hearts, dies in the course of his performance, a once bright star whose career has been dying. If this is the best Rodney can offer, it's time for him to retire.",
         "I gave this movie a 2 out of ten because I gotta give Respect to Rodney Dangerfiled, I love that guy. This movie was a let down, if it had came out in the 80's I think someway somehow it wouldve been better, perhaps gotten a bigger budget and just been better. It is about a guy who falls for a girl and she will not love him until he can learn to sing and he goes to Italy to learn. OK so there's way more to it than that but thats the gist. It has a cute little romantic comedy feel to it, but its a comedy after all and its short on laughter. Watching Dangerfield be himself is worth watching it for, but no other reason... If you like him give it a try, if you want to find out about him then watch older movies like Caddyshack or Back To School...if you want a funny comedy...avoid this movie, and although i said it had a romantic comedy appeal keep in mind the sexy male here is a very ugly Italian with bug eyes and 80 years under his hat.",
         "totally predictable and really cheap movie in every way but one and that's opera. lovely opera, lovely arias and everything else becomes lovely that would otherwise stink. some genuinely good jokes, however, which merits another 2 stars. lovely scenery, lovely italy, lovely....further enforces the extra 2 stars. And then we have Rodney Dangerfield, who seems to be unable to do anything wrong. That man has funny-bones for sure. The story here is ridiculous but who cares? For anyone who hates opera this film is a disaster but for us opera-lovers or, should I say \"aria-lovers\" (because a long opera with no good arias is some serious pain in the ... whatever). The only bad film I've seen with Rodney Dangerfield so far is \"The Godson\" and that was with Dom DeLuise as well! Strange movie that one - everybody looked as if they would rather be sleeping. Here everybody looks as if they would rather be in Italy and I do not blame them.",
         "Rodney did spectacular in this movie, especially for pushing 80. It had a great charm, and made me laugh. I did not really enjoy some of the mysterious magical effects, but it was still great, if a bit cheesy. I thought all in all, it was great. If I had to watch it again, I would not mind. It was, definitely, a straight to video type film. It had cheesy qualities, and did not have too great effects. Rodney is pushing 80 and just plain couldn't deliver like he used to. But I still liked it. Time one a look at me i know what I'm doing, Bwahahahahahahaah. Midnight, foresight, the clock has run out, we're going past midnight. Daft Punk - Around the World around the world, around the world (x 54) One two three. You cannot escape the cube.",
         "I saw this movie on TV tonight and I really enjoyed it, even though I'm not a big fan of opera. Rodney Dangerfield was brilliant as Lupo, with his sharp wit and decent nature. It's quite a shame that he's not here anymore. What I also liked, is that everything worked out just great in the end. There were also some attractive women in T4thT, namely Gina (Annabelle Gurwitch) and Rosa (Anita De Simone). The whole wine thing was pretty interesting as well. If there's some soft drink of some sort (as I'm not too keen on anything alcohol-ish) to make a guy more attractive to women or a good sportsman, someone should let me know (ha-ha-ha)(big laugh). I would recommend this movie to most people, and I would certainly like to watch it again.",
         "Unfortunatly I won this movie from a radio station that was promoting it a few months ago. If not, I would return it. Bad acting, bad story, bad music, bad everything. Save your money, your time, and most of all your mind. Skip this Dangerfield flop.",
         "Even though I'm a huge Rodney Dangerfield fan, I never had the chance to see this film until today since it was in limited release theatrically and the DVD is surprisingly hard to find. Now I know why: the flick just isn't any good. Dangerfield tries his best, but he can't save the uninspired directing (this was director Harry Basil's feature debut and it shows), poor production values, and sluggish pacing. The supporting cast of the usually reliable Annabelle Gurwitch, Robert Davi, and Charles Fleischer is disappointing with each given little to do. However, the first twenty minutes or so are quite funny with Dangerfield's signature quips popping up almost non-stop. Once Dangerfield starts singing, the viewing experience becomes a drag. The 4th Tenor is easily Dangerfield's worst. Basil also directed Dangerfield in Back by Midnight,a much better collaboration between the two. 3/10",
         "Towards the end of his life, Rodney Dangerfield starred in (and sometimes also wrote) several low budget movies that either went straight to video or had a limited release beforehand, this movie being one of them. It was quietly released and hasn't been rediscovered, and I think I know why. While the production values are okay for a made-for-video cheapie (though there are obvious cost-cutting actions like filming on studio backlots and trying to pass the California countryside as Italy), and Dangerfield in his 80s still has energy (though it's obvious when a stunt double is used), there is a problem with the screenplay he co-wrote - it's not very funny. It lacks the zing and outrageousness associated with Dangerfield in the past. In fact, it seems to have been aimed at a family audience. That wouldn't be bad if the movie was funny, but it isn't. It's pretty predictable, both with its story and humor. One surprise about the movie is that it was produced by Joseph Merhi, who earlier had made a name for himself with exciting made-for-video action flicks. Watch one of those instead."
      ],
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["WW & S Productions Inc."],
      "summaries": [
         "Eternal bachelor Lupo plays the comical presenter to the musical acts in his own Italian restaurant 'Serenade Café' in New York, but operatic singer Gina is not amused, she throws him out of her dressing room- the more she insults him, the crazier the old fool gets about her. To keep him off she insists her husband must be an opera singer, so he is easily duped by Ierra, who hits on with Gina himself and ships Lupo off to his Italian cahoot, musical teacher Marcello, for lessons- actually he is so bad that even the dog runs off, and after they bribe the local opera to give him a tiny part, the sound-tortured audience chases him for his life. He passes out but is found and taken in by a winegrowers family, which gives him confidence and a killer voice...",
         "A restaurant owner falls in love with an opera singer and, desperate to impress her, travels to Italy to learn how to sing."
      ],
      "budget": 0
   },
   "movielensId": 140425,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-12-03",
      "dvdReleaseDate": null,
      "directors": ["Harry Basil"],
      "runtime": 97,
      "movieId": 140425,
      "title": "The 4th Tenor",
      "mpaa": "PG-13",
      "actors": [
         "Rodney Dangerfield",
         "Anita De Simone",
         "Annabelle Gurwitch",
         "Charles Fleischer",
         "Robert Davi",
         "Hamilton Camp"
      ],
      "imdbMovieId": "0275170",
      "originalTitle": "The 4th Tenor",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["GV_YhD-O6go"],
      "plotSummary": "A restaurant owner falls in love with an opera singer and, desperate to impress her, travels to Italy to learn how to sing.",
      "tmdbMovieId": 61113,
      "avgRating": 2.75,
      "releaseYear": "2002",
      "numRatings": 2,
      "posterPath": "/5wbBAFiwrB6pFTQ1IROU5Zd04wV.jpg"
   }
}