{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "chips",
         "id": 157174
      }],
      "imdb_id": "tt0162898",
      "video": false,
      "title": "CHiPs '99",
      "recommendations": [
         150329,
         50299,
         77625,
         48290,
         14439,
         23691,
         18230,
         7837,
         10941,
         50296
      ],
      "backdrop_path": "/A8rThZynsqksgzKZuQCfYZQi6lM.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "OzDrDj",
         "id": "50111551760ee32884000c78",
         "content": "I think CHiPS '99 was a lot of fun! No profanity, no sex, and Judge Judy of all people making a guest appearance! The action scenes are of course, very exciting to watch. It was also fun to see what happened in Jon and Ponch's lives since 1983. It was incredible that Larry Wilcox did all of his own stunts on top of a moving tour bus! Way to go!",
         "url": "https://www.themoviedb.org/review/50111551760ee32884000c78"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Captain Jon Baker",
               "gender": 2,
               "credit_id": "52fe4a71c3a368484e1539e5",
               "name": "Larry Wilcox",
               "profile_path": "/fQPBoSdNRIv1Liw5OGguaX5wjn7.jpg",
               "id": 158972,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Officer Frank 'Ponch' Poncherello",
               "gender": 2,
               "credit_id": "52fe4a71c3a368484e1539e9",
               "name": "Erik Estrada",
               "profile_path": "/fYQn64bMuP5kYoQvmPDCShzF1WZ.jpg",
               "id": 102209,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "CHP Commissioner Joseph Getraer",
               "gender": 2,
               "credit_id": "52fe4a71c3a368484e1539ed",
               "name": "Robert Pine",
               "profile_path": "/dZTRdcp57vdnCtxIp8vNYR6pOtp.jpg",
               "id": 74573,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Judge Judy Sheindlin",
               "gender": 1,
               "credit_id": "5a9178010e0a2616c300b6db",
               "name": "Judith Sheindlin",
               "profile_path": "/lcMdH9P8Tpg2qH4tZJvJhUATQta.jpg",
               "id": 1223687,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5a917765925141418600a987",
               "name": "Jon Cassar",
               "profile_path": "/jDiVSUWBoKsslp1y0tnQJ50fws2.jpg",
               "id": 25873,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a917774c3a36824f900b36b",
               "name": "David Geddes",
               "profile_path": null,
               "id": 31906,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a91778d0e0a2616c000b93c",
               "name": "Morgan Gendel",
               "profile_path": null,
               "id": 157839,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "5a9177950e0a2616c900bf11",
               "name": "Morgan Gendel",
               "profile_path": null,
               "id": 157839,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5a9177a40e0a2616c900bf22",
               "name": "Rick Rosner",
               "profile_path": null,
               "id": 1217540,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 1.225807,
      "production_countries": [],
      "id": 121945,
      "vote_count": 7,
      "budget": 0,
      "overview": "Ponch (Erik Estrada) has returned to the police force, and is determined to help his friend Jon (Larry Wilcox) in investigating various car thefts.",
      "similar": [
         202147,
         472447,
         377982
      ],
      "original_title": "CHiPs '99",
      "runtime": 120,
      "poster_path": "/kbmtZc2kOTBPxLrPimjIYuBHwUU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Turner Pictures",
            "id": 1765,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Turner films inc",
            "id": 18693,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-01",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Ponch and Jon are Back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jon Cassar"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Morgan Gendel",
         "Rick Rosner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162898/",
      "coverLink": null,
      "actors": [
         "Larry Wilcox",
         "Erik Estrada",
         "Robert Pine"
      ],
      "reviews": [
         "CHIPs hasn't been aired here for nearly 15 years and I never realised that I missed it until I saw this film. If I'm entirely honest I didn't think much of CHIPs 99, the charm of the film only really comes from the memories which it conjures up. I do however wish they'd repeat the series, they've done every other 70's and 80's series several times, many of them much less deserving than CHIPs.",
         "Finally, the long-awaited CHiPs '99 movie!! Special thanks to TNT for making all CHiPs fans' dreams come true. We get to see all of our favorites (except Harlan and Bonnie) return to the screen and update us on what has been happening in their lives over the past 15 years! The movie is fabulous--the cool 70's style that first caught my attention, somewhat somewhat to the 90's. It is interesting to see both how the CHP has changed and how the characters (most especially Ponch and Jon) have changed. Yes, there are parts that were very unbelievable, but then again, this is CHiPs, and it only adds to the fun. It's also great to see that it's still possible to produce quality TV today that isn't too profanity-filled/etc. for family viewing. My favorite scene was a much-publicized one in which Jon (Larry Wilcox) really really does his own stuntwork on top of a moving bus--quite impressive! My only regret is that while we see a lot of Getraer, we don't see much use made of Baricza, Grossman, and Bruce Nelson...their appearances seem almost like cameos. The two new officers (Roulette & McFall) never quite catch my interest, either...they seem like exaggerations of the most distinctive characteristics of Ponch & Jon (really brash & really nice). A must-see if you watched CHiPs between 1977-83...pay special attention to the explanation (or lack thereof) of Jon's return to the force (since he wasn't around during the 1982-83 season) and how the writers handle the fact that 2 of Ponch's former partners are hanging around in the movie. Definitely worth the wait!",
         "I think CHiPS '99 was a lot of fun! No profanity, no sex, and Judge Judy of all people making a guest appearance! The action scenes are of course, very exciting to watch. It was also fun to see what happened in Jon and Ponch's lives since 1983. It was incredible that Larry Wilcox did all of his own stunts on top of a moving tour bus! Way to go!",
         "CHiPs is back in a TV reunion movie entitled \"CHiPs '99\". It stars Larry Wilcox and Erik Estrada who reprises their role as the well-known California Highway Patrolmen Jon Baker and Erik Estrada respectively.In it,we get updated with the development of what has happened to Jon and Erik with the former getting promoted as a Captain of the CHP and the latter getting back after a 15-year absence from the CHP to help solve a carjacking syndicate that has been happening in the Southern California freeways.Aside from Ponch and Jon,we also get to witness updates on the other characters such as Getraer,Bruce Nelson, Grossman and Baricza and meet new characters such as Sandy,Roulette and Sergeant. What is good about it is that we are presented to an updated episode of CHiPs had been it shown during the 90's of that being a fun and non-violent cop show wherein the most violent it could actually get it pointing a gun to a criminal.If that was its objective,then I say that this TV movie did succeed. But if it tried to get back on air through this TV movie,then there are a lot of reasons why it wasn't successful. First,it was the '90s.The actors have aged especially Estrada who has gained a lot of weight and has shown a lot of white hair.Estrada's sex appeal was badly needed in the show.Added to that,a mature Ponch would definitely not appeal to the TV viewers considering that his ego is what was needed and made the show successful back in the day when the show was on air.While the wacky ideas that Ponch would suggest remains relevant,this was not what people remember him most for it was only the first season of CHiPs when he was presented as a weak CHP officer and that is why he is needed to be a Jon as a partner.Most CHiPs fans remember him for that macho gigolo that most of the female Californians would want to sleep with. Another reason is that reformation of the show was somewhat \"half- cooked\".The new characters such as Jon's wife Sandy was underwritten and so was the new CHP officers Roulette and Sergeant.The rivalry between Roulette and Ponch provided a good start but the former's character is just underwritten as well which makes it half as interesting. Finally,Jon takes a lot of the screen time in the story.Admittedly,Wilcox is a big part of the show.When he was replaced by Tom Reilly,the show fell apart and it got cancelled.Wilcox and Estrada have great chemistry with the former being stoic and the latter being charismatic.Saying this,it would have been better if Ponch was captured and was the cop who got entangled with Monica on top of the bus being the charismatic character.It would have had a funnier and more interesting conclusion. But nevertheless,it was nice to see CHiPs in this TV movie for one last time for I know that the reruns of its episode at MeTV remain popular at present after being out of the air for three decades and after this TV movie was last shown almost two decades ago.No question that CHiPs remain popular after all these years.",
         "Larry Wilcox and Erik Estrada reprise their roles a CHP Officer Patrolmen Jon Baker and Frank \"Ponch\" Poncherello return in this CHiPs TV movie reunion 15 years after in CHiPs '99.They re-unite once more and try to solve a carjacking crime that has been on-going in the streets of California. No question that a lot of CHiPs fans are excited to see them once again in this 90's update of the 1977-83 cops TV series.We see them riding on up-to-date BMW motorcycle and use modern communication that gets them in touch with the CHP headquarters instantly as compared to the 70' Kawasaki motorcycle and walkie-talkies.In addition to that,we get to see personal updates as well on the main characters like Jon Baker now get promoted as a Captain, Sergeant Joseph Getraer now become CHP Commissioner and the others members of the crew from the TV series like Bruce Nelson become a sergeant,Grossman become a Detective and Baricza now become an officer patrolman.And most of all,w get to see Ponch return to the CHP after 15 years of absence and self-imposed retirement to become a \"painter\". It was also nice to see new and interesting characters like Jon's wife, Officer Sandy Baker and Frank Jr,Ponch's young son as well as new patrolmen like Officers Peter Roulette and Sergeant McFall. No question that this reunion TV movie would somehow not be up- to-date when it was first shown back in 1998 in terms of storyline and action scenes and sequences.But nevertheless,Wilcox and Estrada still would be interesting and charismatic in re-living their roles as Jon and Ponch respectively.Their presence enough is good enough to make it interesting and entertaining light action cop movie.Overall,CHiPs would still generate a lot of fun and entertainment as long as Larry and Erik are in it.",
         "After a 15-year self-imposed retirement from the CHP, Ponch reunites with his partner Jon to break up a car-theft ring in this reunion TV movie entitled,CHiPs '99. This lighthearted action-adventure is set from where the old show left off. Jon and Ponch have not been partners for years.But when a car theft ring starts to do a puzzling series of car thefts,they get reunited to solve this mystery. Part of the fun of the show is watching the two leads as they try to adjust to the innovations of modern police work, including new bikes and wireless radios that keep them in constant contact with their senior officer. While there was a lot to be desired from this TV movie considering that it feels so out-of-date when it was shown as compared to when the TV series was still on the air,it felt somewhat fun to see both Larry Wilcox and Erik Estrada reprise their roles as Jon and Ponch respectively for loyal fans of the said TV cop series.",
         "During the show's final season, the character of Jon Baker left the CHP and was in Wyoming with his father. And Ponch was there with a new partner, Bobby Nelson. Eventually, his brother, Bruce would become Ponch's new partner. First off, it was strange that Bruce was there and Bobby wasn't, and he wasn't even mentioned. And as I said Jon was the one who left and Ponch stayed, so why was it that Jon was the one who was now the Captain and Ponch was the one who came back. It doesn't make much sense to me. Unless you are not that devout a follower of the show. Like on EIGHT IS ENOUGH, one the characters was an actress for most the series' run but during the final season tried out broadcast journalism. But when the reunion movie came out, she was an actress again.",
         "Only 2 things didn't make since....Jon as Captain on morning roll call, isn't this a sgt. job? Grossman as detective he should be a square badge at KMart.",
         "This was an awful and I mean awful \"reunion\" special. The original TV series of the Late 1970s and early 1980s wasn't bad. And I on occasion watch the reruns on late night TV on cable's/satellite's TNT(Turner Network Television). The original show had charm to it but this reunion lacked that charm and a decent story line. \"CHiPs\" 99 seemed more like a two hour version of a 60 minute episode that would not end. The made for TV movie was inconsistent with the original TV series. Larry Wilcox, who portrayed Officer John Baker left the show the year before it was canceled. So the following season the show wrote him off by having him go to work on the family farm/ranch. So, for the reunion, Officer Baker somehow becomes a captain, mean while Officer Francis \"Ponch\" Poncherello, Erik Estrada had disappeared because his wife was \"sick.\" Its funny that in the made for TV flick there is one scene in which Baker tells Ponch that he was not invited to his wedding because he did not know where he was. In real life during the shows peak I read that Erik Estrada had not invited Wilcox to his wedding and when Wilcox was married he did the same. I just think its funny that the producers decided to actually put that into the storyline. Seems like it would have brought up some bad blood or the producers had some twisted sense of humor. I wish that the producers for this special would have elected to use at least a cliché cop reunion special storyline. Something like all the old cops get back together to help find the murderer of one of their own, Harlan gets killed during a carjacking. Or Ponch gets framed for a string of carjacking murders and Baker comes out of retirement to help his buddy out. Even those story lines would have been far more enjoyable. Its like the producers rehashed an old episode and went on autopilot. Oh and Baker and Ponch appear on Judge Judy within the show because a neighbor's dog is damaging Baker's lawn. And Johnny Cochran makes a guest appearance for the neighbor that Baker is suing. Can we say lame, really lame. The special also had several of the original cast but the only ones that were really utilized were Estrada, Wilcox, and Robert Pine (Sgt. Joseph Getraer) I would NOT recommend this special to anyone and would urge any fans of the original series or some younger fans to stick with the reruns.",
         "In my opinion, it was poorly executed. Like the other people have posted there was continuity errors putting it in conflict with the original series. The story really left a lot to be desired. The easy part was getting the cast back to reprising their roles. The hard part was getting a really good story to attract both old and new fans of the original series. I remember buying the videotape when it came out. To date I have only watched it once. I won't be watching it again soon, nor will I buy the DVD release. Again, good initiative on reuniting the CHiPs cast, but bad execution. Reunion shows are great ideas, but in order for them to succeed, the writers have to do an upstanding job, otherwise it will be a wasted effort. A wasted effort means no further reunions and any plans or hopes of a revival series just goes down the drain.",
         "I really loved watching it. I loved the characters of Ponch. Jon, and Bruce. The show was really fantastic. The movie is also. I hope that they make more of them. I have the People magazine with Erik Estrada in it. I'm going to look for more magazines with him in them.",
         "This movie wasn't any better than the TV show. The whole movie seemed fake. They couldn't even come up with a fresh idea for the movie. If they had, maybe it would have been better. But I really doubt it. It would take a lot to improve this movie.",
         "I never thought I'd ever see it happen. The cast of CHiPs reuniting and doing a new reunion movie, and even more than that, it reunited Larry Wilcox and Erik Estrada, who finally decided to bury the hatchet and forget about their personal issues with each other. Oddly enough, they both were co producers as well. I was surprised this didn't air on NBC, but then again, about a decade ago, this was a hot show that aired on TNT, like the same way the Dukes of Hazzard received new popularity on TNN during that time. It's hard to believe it's now been 10 years since CHiPs 99 aired on TNT. And hopefully, maybe it will get released on DVD someday along with the series. The movie is interesting in that we see how the CHP has changed in the last 15 years, especially in terms of the new motorcycles they used. For the most part, this movie, I feel was written with the memory of season one more than any other season and it almost completely ignored the characterization and story lines of the final season, as bad as that season was. In season six, Officer Jon Baker left the force and was replaced by Officer Bobby \"Hot Dog\" Nelson and later his brother Bruce, who went through Cadet training before becoming a CHP officer before series end. Ponch by that time, had matured into the more responsible training officer. Ponch, while still a character had become what Jon was. Most of that was tossed out the window in this movie. Ponch once again was the \"Hot Dog\" and Jon was a little more strict this time. One can only guess that when Ponch left the force, he did before Jon came back, explaining why they hadn't seen each other in so long. The only element of season 6 was the inclusion of Bruce Penhall as Bruce Nelson, who gets promoted to Sergeant in this movie, but gets injured and out of the story not long afterwards. Artie Grossman is back as a plain clothes Detective and surprisingly, Brodie Greer is back as Barry Barikza, who also mysteriously vanished in season 6. Joe Getraer is now Police Commissioner and Jon Baker is now Captain of the CHP and is married. His beautiful blonde wife, Sandy is also a CHP officer. Ponch retired from the force some years ago, married the crash victim from the series pilot episode, and had a son. Ponch's wife got sick and died, and now he is raising his son, Frank Jr. What I didn't care for in this movie, were the two new young guys. Sergeant McFalls was not bad. A nice cop like Jon, but Roulette, is not only an exaggeration of Ponch, but also a resident a---hole!! You just love to hate this guy and his rivalry relationship with Ponch occurs when he cites Ponch for speeding. Ponch returns to the force, but unlike his buddies, he never rose in the ranks and is therefore, still a motor officer. All in all though, it was great to see Ponch and Jon go riding together again after 15 to 16 years. Flashback scenes from the pilot episode, plus the scene where they pull over a bicyclist, whom they pulled over when he was a kid in the pilot was priceless. While not as great as the original series, CHiPs 99 has its charm and I recommend it as much as the series. I give it 2 thumbs up!!",
         "I just kind of ran into this movie one morning -- I'm a big cynic, and was never a big CHiPs fan, either -- but I found this movie quite engaging. It doesn't take itself too seriously and it's just plain fun.",
         "Chips '99 is good plain fun. It doesn't take it itself too seriously and it's G rated."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Turner Films Inc."],
      "summaries": ["Ponch has returned to the police force, and is determined to help his friend Jon in investigating various car thefts."],
      "budget": 0
   },
   "movielensId": 140445,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 120,
      "movieId": 140445,
      "title": "CHiPs '99",
      "mpaa": "PG",
      "actors": [
         "Larry Wilcox",
         "Erik Estrada",
         "Robert Pine"
      ],
      "imdbMovieId": "0162898",
      "originalTitle": "CHiPs '99",
      "genres": [
         "Action",
         "Crime",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["Vpzn4aeRs3o"],
      "plotSummary": "Ponch (Erik Estrada) has returned to the police force, and is determined to help his friend Jon (Larry Wilcox) in investigating various car thefts.",
      "tmdbMovieId": 121945,
      "avgRating": 2.75,
      "releaseYear": "1998",
      "numRatings": 4,
      "posterPath": "/kbmtZc2kOTBPxLrPimjIYuBHwUU.jpg"
   }
}