{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "masked vigilante",
            "id": 158456
         },
         {
            "name": "movie serial",
            "id": 179991
         }
      ],
      "imdb_id": "tt0036697",
      "video": false,
      "title": "Captain America",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Captain America / Grant Gardner",
               "gender": 2,
               "credit_id": "52fe4a67c3a36847f81cbd6d",
               "name": "Dick Purcell",
               "profile_path": "/cG9D9FRldekquATNnsJ19Yho3xf.jpg",
               "id": 13970,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Gail Richards",
               "gender": 1,
               "credit_id": "52fe4a67c3a36847f81cbd71",
               "name": "Lorna Gray",
               "profile_path": "/uObpZZI8RHpUCTyVxzhfDFAiMZ6.jpg",
               "id": 96719,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a67c3a36847f81cbd57",
               "name": "Elmer Clifton",
               "profile_path": "/wLBAwJ2rATxQHckJs6fqagrxDv0.jpg",
               "id": 8838,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a67c3a36847f81cbd5d",
               "name": "John English",
               "profile_path": null,
               "id": 32174,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a67c3a36847f81cbd63",
               "name": "Royal K. Cole",
               "profile_path": null,
               "id": 33956,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a67c3a36847f81cbd69",
               "name": "Harry L. Fraser",
               "profile_path": null,
               "id": 34799,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.716036,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 106355,
      "vote_count": 5,
      "budget": 0,
      "overview": "Serial - First screen adaptation of Timely Comics' Captain America.",
      "similar": [
         13183,
         255603,
         257057,
         215576,
         252411,
         228298,
         29410,
         215697,
         22639,
         255724,
         252516,
         208156,
         256751,
         148341,
         20526,
         2501,
         155,
         608,
         630,
         1930
      ],
      "original_title": "Captain America",
      "runtime": 244,
      "poster_path": "/6QB0RDBmQ4cyEraT7jUy692VQnd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Republic Pictures",
         "id": 1432,
         "origin_country": ""
      }],
      "release_date": "1944-02-05",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Elmer Clifton",
         "John English"
      ],
      "runtime": 244,
      "synopsis": null,
      "writers": [
         "Royal K. Cole",
         "Ronald Davidson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036697/",
      "coverLink": null,
      "actors": [
         "Dick Purcell",
         "Lorna Gray",
         "Lionel Atwill"
      ],
      "reviews": [
         "This serial isn't exactly what fans of the Captain America comic book character might expect. Here's the \"bad\" news: The hero in this serial isn't the same Captain America as in the comic books. This hero is called Captain America and wears a costume close to the one in the comics, but that's where the similarities end. This guy isn't Steve Rogers. He doesn't have a special shield and instead he just uses a gun! Now here's the good news: This isn't bad! There's plenty of fun stuff in this one for serial fans. Some have commented on Dick Purcell's \"pudgy\" physique, but he still makes a fine 1940's serial hero whose quick on the trigger. I wouldn't mess with the guy. Purcell's Captain America is far more lethal than his comic book counterpart and he has no problem pulling a gun and sending his enemies to their graves. Purcell's Captain is one deadly superhero. His Captain America kills four different guys in just the first 15 minutes of the serial! The Captain's gal pal Gail Richards (who is very cute) also packs a pistol and knows how to use it! The silly: There are always silly elements of comic book movies and my favorite bit of silliness in this serial is \"the vibrator\". The bad guys really want to get their hands on a brilliant scientist's \"vibrator\". At one point the scientists actually asks the chief villain \"What do you know about my vibrator?\"!LOL! The verdict: Captain America is an extremely entertaining serial with plenty of enjoyable moments. This Captain America is a different guy from the comic version, but he's more of a straight shooting vigilante and I liked Purcell's Captain's style. This is fun stuff! It's a blast of entertaining escapism and I enjoyed every second of it. Captain America isn't the best serial you'll ever see, but that's part of it's charm. I give Captain America an A+ for being topnotch fun.",
         "In the 1940s, every studio had at least one genre they excelled at. Universal had horror films, Warner Brothers had crime dramas and social commentaries, MGM had lavish musicals and costume dramas. Republic Studios was near the bottom of the barrel, but they had something they did better than anyone else: serials, weekly chapterplays where the heroes faced a deadly peril at the end of each episode. No one did them better than Republic. They had the best writing, music, special effects, stuntmen, and these factors added up to the best serials of all time: `Zorro's Fighting Legion,' `The Lone Ranger,' `The Adventures of Captain Marvel,' `Spy Smasher,' and others. But by 1944, the Republic formula had become just that, formula. `Captain America' is a product of a studio and a genre in decline. While the movie is technically proficient and slickly produced, the thrill and excitement is gone. Any Captain America fan seeing this movie without prior warning is in for a shock: Republic was notorious for making arbitrary changes to characters, and Captain America had it worse than anyone. Instead of being Private Steve Rogers of the United States Army, now he was Grant Gardner, District Attorney of an unnamed American city. His trademark shield was gone, replaced by a mundane .38-caliber revolver. His sidekick, Bucky, was also missing, so Cap was assisted by an efficient secretary, Gail Richards (Lorna Grey). Most bizarre was ignoring the whole World War II angle \u0096 instead of having Captain America battle spies and saboteurs like he did in the comics, they had him battling a run-of-the-mill criminal mastermind, Cyrus Maldor (Lionel Atwill), alias the Scarab. It strikes me as an odd choice for an overtly patriotic hero in the middle of a world war, but\u0085 Dick Purcell does a good job as Grant Gardner / Captain America, although he wasn't the best physical match for the part. Most of the young, trim guys were off fighting the war, so instead you have the nicely-rounded Purcell in the tights. Sometimes he looks more like Captain Dad than Captain America, but Purcell still does a decent job. Lorna Grey makes a surprisingly sexy sidekick (I can imagine younger moviegoers in 1944 lamenting Cap hanging out with a girl instead of his pal Bucky, while the slightly older audience would see the improvement). Lionel Atwill is appropriately scheming and menacing, but his climactic fistfight with Captain America stretches credibility a little too much. The two words that best describe `Captain America' are `competent' and `tired.' The serial goes through all the paces and delivers some excitement, but the classic Republic crispness, the snap, is gone. The serials would die slowly over the next twelve years, doomed to exhaustion and competition from television, but the glories of those years live on in memory.",
         "While this serial is about as unfaithful an adaptation of a comic book character as there has ever been, it's still an entertaining piece that almost (not quite) holds up today. Captain America in this serial is not a private named Steve Rogers, but a District Attorney named Grant Gardner. Instead of Bucky (and, in later years, Falcon, Battlestar, Diamondback, and various Avengers) he has an assistant named Gail. The bad guy is not one that's found in the typical Captain America rogues gallery, but a mind controlling fiend called the Scarab. And instead of a \"mighty shield,\" he carries a pistol and that's about it. Given that, the serial is a fast paced adventure that is big on action. The various fight scenes in the movie are far beyond those in many serials of the day (and even later day action films, such as a certain 1989 excursion featuring another costumed crimefighter) and the stuntwork in the many cliffhangers is excellent. The story is fairly standard: a scientist creates a device. The bad guy steals it. The heroes try to find out who he is. Interestingly, the film gives the audience his secret identity in the first chapter. While mysteries are better in theory, this works because it allows the Scarab to have more of a personality. Dick Purcell is likable as Captain America, although it takes time before you get used to seeing him in his costume. He almost looks more \"Captain America-ish\" as Grant Gardner. Lorna Gray is superb as Gail rivaling most serial-era heroines. The serial isn't perfect, of course, including sometimes lackadaisical cliffhangers. There is no origin provided for Captain America. That he has any abilities similar to those he had/has in the comics (given to him by the so-called Super Soldier serum, which is also mentioned not once) is never even implied. In fact, his reason for donning the costume in the first place is unknown. The scenes wherein Grant Gardner takes matters into his own hands underscore the notion that Captain America never seems to do anything that a really tough DA couldn't do. The relationship between he and Gail is also hard to understand. They never seem to be romantically involved, no matter how intense the situation. They could be related, but there's no allusion to that. The mundane truth seems to be that she simply works for a DA who decided to become Captain America. Interestingly (and, for some, disappointingly, no doubt) there is no mention of wartime concerns such as, well, the war. Despite this, the serial is engaging, charming and often suspenseful. The action sequences are miles ahead of many of the era's best stunts and the sheer charm of the movie makes it an entertaining watch.",
         "Captain America--the Star Spangled Avenger--minus the shield, his youthful sidekick, Bucky Barnes, and the Red Skull. The late Dick Purcell plays the crusading district attorney Grant Gardner in one of Republic's finest cliffhangers; who, attempts to uncover and stop the evil/cunning Scarab's \"Purple Death\" plot. Sadly, Purcell passed away before this serial's release. Lionel Atwill is great as the sinister Museum Curator, Dr. Cyrus Maldor. Maldor has been killing off members of his South American expedition to gain control of their wealth and stewardship of the museum. Lorna Gray is superb as Gardner's faithful assistant and the damsel in constant distress. The omnipresent George J. Lewis carries out the Scarab's evil plans as badguy, Bart Matson. Cap must even combat Professor Dodge's (Hugh Southern) \"Dynamic Vibrator\"--ouch! Can Cap thwart the evil doctor's plans? Will Maldor manage to gain complete control of the scientific museum for his evil plans? Cap fights for truth, justice",
         "No, it's just a cheap 1940s serial using the Cap's good name. If you are a fan of the comic book, you will be greatly disappointed. They have radically changed the character. No shield, no Bucky, no fighting the Nazis, no wings on the side of his mask and most importantly: Captain America is now a District Attorney and no longer a GI. Dick Purcell as Captain America? Don't look too closely when he changes into his costume. It is pretty obvious that he was not in the best physical shape when he made this serial(can you say flabby?). It is also VERY obvious that a stunt man is performing most of the action here. Almost every chapter has an obligatory fist fight that is shot and performed in exactly the same way. The villain is rather bland and although he uses an alias (The Scarab), he doesn't wear a disguise of any kind. The story is repetitive and very simple. The effects are laughable and the action is average. On the plus side we have sexy Lorna Gray as the D.A.'s assistant and the good Captain gets to ride on a cool looking motorcycle in one early chapter. Overall OK but nothing special.",
         "In the words of the Oldsmobile commercials, \"This is not your father's Captain America!\" (well, at least my father). Shield-slinging, two-fisted Super Soldier battling Nazis? Nope, this is a pudgy DA battling ordinary criminals, with a revolver! First off, let me preface this by saying there is a big difference between watching a serial in weekly installments and watching the whole thing on video. The repetition was necessary to recap the previous week's chapter. On video, it gets tiresome by the third chapter. Still, that's what the fast-forward button is for. Poor Cap! He never got a break in 50 years. He's an orphan, 4F, Bucky is killed by Baron Zemo, the Red Skull just wont die, Nixon, Rob Liefeld, and September 11! On top of it all, he has never been done justice on the silver screen or the tv screen. Captain America should have been great; you have two-fisted action, that cool shield, Nazis, the Red Skull, and a great costume. So where is all of that in the film? The fights are there, but the rest of the package is missing. And these fights don't measure up to those in Spy Smasher, Masked Marvel, or the Adventures of Captain Marvel. Republic's adaptation of comic book heroes were vastly superior to Columbia's, but this one just doesn't quite work. There's no hook to pull you into it. Still, it's better than \"theatrical\" effort, nearly 50 years later.",
         "There have been countless film adaptations of comic strip, comic book and pulp magazine adventures. This has been true for the last 60 years or so. Hence, we have seen FLASH GORDON,BUCK ROGERS,TIM TYLER'S LUCK, JUNGLE JIM,THE SHADOW,THE SPIDER,SUPERMAN,CAPTAIN MARVEL,BATMAN and even such minor leaguers as CONGO BILL,TEX GRANGER and THE VIGILANTE (among many others)were seen on the silver screen matinée bill. In the 30's,40's and 50's most of these were not produced as feature films, but rather in the form of the serial, AKA the chapter-play or cliffhanger. This was before the arrival of Television as the dominant media. All of the studios involved in sound serials at the time (Republic, Universal and Columbia)acquired rights to do some of these features as part of their serial output. In 1944 Republic brought us the adventures of CAPTAIN America. One can only imagine that the juvenile audience of that time were highly excited in the expectation of CAPTAIN America being on the screen, as well in comic books published by Timley Publications (later known as Atlas and still later Marvel Comics). Indeed, CAPTAIN America was the first Timley/Atlas/Marvel feature to be so adapted, but what happened? We all knew that C.A. was in reality Army Private Steve Rogers, a former 4F recruit who was transformed into a man of great physical power and physique (tho not super powered).Steve Rogers was to be the proto type, the first of an army of former 4F's. He had been a sort of human guinea pig for a kind of super vitamin injected into him (later accounts said a pill was used), in order to make him into the type of red-blooded fighting man we needed for World War II. (Did this foreshadow the emergence of anabolic steroids two decades later?) He wore a colorful costume, based on the American Flag. He had a juvenile assistant,\"Bucky\" (Bucky Barnes),who was much like Batman's Robin. He sported a shield, which functioned as a sort of giant boomerang-like weapon, as well as affording protection against enemy fire power. He fought the Axis agents, 5th Column Sabateurs and soldiers from Nazi Germany,Fascist Italy and Imperial Japan. He actually existed because of WWII, and other than the familiar figure of Uncle Sam on the recruiting posters or maybe Lady Columbia, no symbol was more representative of the USA than Captain America. So, what of the serial from Republic? Other than the title, there is very little in common with the comic page version. His identity in the film is District Attorney Grant Gardner. He has no connection to the military.He had no Bucky, no wings on cowl and a plain .38 caliber pistol instead of the multi-purpose shield. For that matter, you'd think that there was no war going on in this story line. This might have been okay as a serial if it was made in the pre-war years. It really should have been given a different title.",
         "With the release of a Captain America feature this summer, I thought I'd look at the first time this costumed hero from the comic books was depicted on the big screen nearly 70 years ago. Among several big differences between that character created by Joe Simon & Jack Kirby and the one shown here: He's Grant Gardner, district attorney, not Steve Rogers, Army soldier. He uses a gun, not a shield. And the villains are not Nazis. In fact, the actual bad guy is one Dr. Cyrus Maldor (Lionel Atwill) a.k.a The Scarab. Oh, and instead of a teen boy named Bucky for a sidekick, Gardner has his secretary Gail Richards (Lorna Gray) helping him in his investigations. Now while I was initially along for the ride in following the story, it got a little repetitious when each chapterplay ended with a big fight that results with an explosion that always has the hero escaping just before it happens being revealed in the start of the next entry. So this would have probably been a little better at 12-instead of 15-chapters. Still, it was worth it to see how it all ends. Oh, and those fights were just as exciting to see in a Republic serial as it was on their earlier Adventures of Captain Marvel. I just wish the print I saw didn't have so many scenes playing off-sync on the soundtrack. But, all that said, I thought the three leads I mentioned did well together and Ms. Gray was certainly easy on the eyes whenever she appeared. So on that note, this version of Captain America is worth seeing.",
         "This serial has nothing to do with the original comic book Captain America but is still entertaining. Some people considered the star, Dick Purcell, to be pudgy but this is simply not so. He just had a more realistic body type than a male growth hormone guzzling freak like Sylvester Stallone. The men of Dick Purcell's era had survived the Great Depression and when they were hungry they ate meat and potatoes. Go take a look at your own gut sometime! Overall, Purcell made a pretty good serial hero, tough enough to do the job convincingly, a reasonably good actor, not wearing his angst and self doubt on his shirt sleeve like some modern sissy boy hero. While not as great as Buster Crabbe or Tom Tyler, he was better than Kirk Alyn (sorry, Kirk). This serial has lots of excellent fight scenes and great cliff hangers. Also, there is a sequence where Captain America rides the Republic motorcycle, which was also seen in 'Spy Smasher.' The villain, Lionel Atwill, is probably one of the best serial villains, perhaps even better than Charles Middleton as Emperor Ming. Perhaps it would have been wiser to do this in the usual 12 chapters, as opposed to 15, but then again, if I minded wasting my time, why would I watch these old serials? Overall, this is a pretty good serial, and as such it has a higher value for escapist fun than most modern super-heroic cinema. One significant criticism I will make, however, is the inexplicable exclusion of all references to WWII. When it's WWII out there, and you have Captain America, a character created to fight WWII, yet the story has nothing to do with WWII, well, that is an awfully big elephant in the room. It would be akin, say, to a nation that spends $200 million a day for 10 years on a war, with the public having no reliable knowledge of the causes, progress, or effects of the war.",
         "Yes it's the Captain America of the comics, but only in regard to the suit. Instead of a super soldier fighting Nazi's here we have a district attorney fighting the scarab who is killing off the members of an archaeological expedition using a gas that leave purple blotches. Starring Dick Purcell as the Captain and Lionel Atwill as the Scarab this is neat little serial. Neat as in fun, not in regard to story. Well acted and well filmed, the story is a complete nonsensical mess. Nothing makes any real sense, trust me your brain will go into knots if you take it seriously, even on its own terms. Mostly you watch it because of the cast having such a great time and because the action is some of the best in any serial. The action scenes are huge explosions of chaos that seem bigger and more dangerous then almost any other chapter play. Usually they end in wild cliffhangers that are so daunting that the only way for the hero to escape is for the filmmakers to cheat. And cheat they do. There is a reason that the documentaries I've seen on serials use footage from this film to illustrate how the serials cheated, namely almost every cliffhanger involves a cheat. Even though it makes no sense and the cliffhangers cheat this is still a blast to watch. There is something to put on when you want some mindless (wholesome) action. Recommended.",
         "According to marvel comics, a man was given extraordinary powers to fight Nazis during WWII. His arch-enemy, the Red Skull, was caught in an accident and perserved, while the hero himself was frozen in an ice cube. Both the heroes were revived, and Cap joined the avengers, who thawed him out (Austin Powers, anyone?. The Red Skull began a new criminal organisation. This is one of his adventures before being perserved. Like the 60s \"Batman\", some of his escapes from death are a bit cheezy, but they later got a bit less corny. It tells how he battles the Scarab, a villian who first murders with \"The Purple Death\", later steals a machine to revive corpses, and tries to rob a bank with a remote controlled armour car. At least better than the 70s movies of Cap!",
         "This is a brief review as the difference in the comic books and the serial have been covered very well by other writers. But I wanted to correct some incorrect information in some other reviews. In some of those reviews it mentioned that Dick Purcell was on the pudgy side and it showed when he pulled on the Capt. American suit. Purcell never wore the suit except in a few closeups. The suit was worn by well-known stunt man, Dale Van Sickel. To find a lot of information on Van Sickel go o Google and put in his name. He was a stand out in three sports at the University of Florida. In Hollywood he formed the stunt man association and become its first president. On the IMDb site you will find that he did stunts in 200 movies. In Chapter one of \"Captain America\" he has a fight with another well known stunt man Tom Steel (we wore the mask in \"The Masked Marvel\") He had a couple of appearance without the mask, a call box policeman in Chater three and a fake humane society man in Chapter 10. I find this serial to be very entertaining with a variety of cliffhangers, good production values and 16 stunt men providing the action. Purcell was in a few fight scenes as the district attorney and handled himself pretty well as you can see he is doing his own stunts there.",
         "Captain America was far and away my favourite hero when I was growing up in the 1960s. A lot of this was do do with artist Jack Kirby's dynamic drawings of Cap in the Marvel Comic Tales of Suspense. I especially enjoyed the war-time setting of the comics and the hero's battles with his arch-nemesis The Red Skull. When CA joined the Avengers, I bought every one of those comics, too. All this is by way of saying I was (and am) a major fan of the character. It wasn't until years later, as I was getting more into movies and hunting down classic Hollywood serials, that I got to see CAPTAIN America. Now, this serial has taken a lot of stick on this site for not following the comics ... but I have less of a problem with this than some people here. Yes, the plot is a bit repetitive - but folks, it's a serial. You're supposed to watch it one episode a week. It's going to look a bit cheap, because the budget was tiny. It's going to have second-grade actors, because A-listers would never agree to appear in serials. This was where the studio tested out new talent and put old actors (and stunt men) out to pasture. As serials go, it's one of the better ones. I was astonished at just how much the stunt men in this throw themselves into the fight scenes. How these guys weren't hurt, I'll never know. The direction from John English (who, incidentally WAS English and was responsible for all the best serials of the period) it very slick and Lionel Atwill (one of the great b-movie actors) is excellent as the villain - though he does seem to forget his lines from time to time. All in all, one of the better serials of the 1940s - great fun if you fast-forward past the lengthy episode recaps. And I don't mind a bit if it doesn't follow the comics exactly. What comic book adaptation does? This serial is quite enjoyable enough to stand on its own terms.",
         "While this serial is action packed and entertaining, it doesn't offer anything new or original.They basically just put the generic hero in a Captain America costume with no explanation why.This version of Captain America is a district attorney who carries a gun,because that makes sense.He uses the gun as Cap too and I really like that.He shoots and kills people, that's what America is all about.The story is about The Scarab, a secretly evil scientist who is killing other scientists.He keeps stealing weapons that can destroy buildings and Cap has to save the day.The first episode is 25 minutes but the rest are 12-15 minutes with 3 minutes from the previous episode.I'm sure a 3 minute recap is nice if you saw the last episode 7 days ago but when you watch them all at once, it's quite annoying.This is only for fans of the old serials.Captain America fans will be extremely disappointed.",
         "*Spoiler/plot- Captain America, 1944. A major American city is plagued by a crime wave. And it's up to the city attorney to become a crime fighter. *Special Stars- Dick Purcell, Lorna Gray, John Hamilton, Lionel Atwill. *Theme- When the city has a crime wave hit, unknown crime fighters rise to combat it. *Trivia/location/goofs- B & W, 12 part theatrical weekly serials. You will notice that the lead role is not a super hero, just a city attorney civil servant that rides a Harley Davison motorbike. *Emotion- Full of action and enjoyable in it's many part theatrical serial of the era. *Based On- VERY loosely based on the Marvel comic character.",
         "It's like I was watching Batman from 1943. all over again, only with lame version of Captain America instead of Batman in leading role. Literally nothing new in it. Exactly the same pattern with minor details changed. Captain America is normally less fun than Batman, and here they destroyed him to such extension that it's beyond any comparison. Very disappointing."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Republic Pictures (I)"],
      "summaries": ["Superhero Captain America battles the evil forces of the archvillain called The Scarab, who poisons his enemies and steals a secret device capable of destroying buildings by sound vibrations."],
      "budget": 222906
   },
   "movielensId": 140435,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-02-05",
      "dvdReleaseDate": null,
      "directors": [
         "Elmer Clifton",
         "John English"
      ],
      "runtime": 244,
      "movieId": 140435,
      "title": "Captain America",
      "mpaa": "",
      "actors": [
         "Dick Purcell",
         "Lorna Gray"
      ],
      "imdbMovieId": "0036697",
      "originalTitle": "Captain America",
      "genres": [
         "Action",
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Q7GtCsXn1yE"],
      "plotSummary": "Serial - First screen adaptation of Timely Comics' Captain America.",
      "tmdbMovieId": 106355,
      "avgRating": 1.375,
      "releaseYear": "1944",
      "numRatings": 8,
      "posterPath": "/6QB0RDBmQ4cyEraT7jUy692VQnd.jpg"
   }
}