{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt2911342",
      "video": false,
      "title": "Dragon Nest: Warriors' Dawn",
      "recommendations": [
         212481,
         260535,
         224087
      ],
      "backdrop_path": "/smXFW9d9lcm8V1P5NcxrquCWWIo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Elena (voice)",
               "gender": 1,
               "credit_id": "55cc5479925141763c00236b",
               "name": "Carrie-Anne Moss",
               "profile_path": "/6gk8GmlfjW8ONS19KMeISp8Cqxf.jpg",
               "id": 530,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gerrant (voice)",
               "gender": 2,
               "credit_id": "55cc5501925141763e0023b9",
               "name": "Lucas Grabeel",
               "profile_path": "/heSgRPG1Mlyta4FzuPXqXxKhysq.jpg",
               "id": 67601,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Liya and Kasarana (voice)",
               "gender": 1,
               "credit_id": "55cc5536c3a36856f9002597",
               "name": "Blythe Auffarth",
               "profile_path": "/hZCqIH1rQoCmIdKfBCh90w0JurO.jpg",
               "id": 78139,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lambert (voice)",
               "gender": 2,
               "credit_id": "55cc556e925141764500233c",
               "name": "Charlie Schlatter",
               "profile_path": "/nNS9U9Yp4im9i0pb0NbDomkDwH7.jpg",
               "id": 77293,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Terram (voice)",
               "gender": 0,
               "credit_id": "55cc55b1c3a3685a88001ec8",
               "name": "Simon Jaglom",
               "profile_path": null,
               "id": 1496415,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Bat (voice)",
               "gender": 2,
               "credit_id": "55cc55f19251417642002420",
               "name": "Matthew Temple",
               "profile_path": "/5HKsCrua3YH8URySPiUrgKrVdny.jpg",
               "id": 1192144,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Elena (voice) CN",
               "gender": 0,
               "credit_id": "55cc567e9251417645002364",
               "name": "Ying Huang",
               "profile_path": null,
               "id": 1496419,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Gerrant (voice) CN",
               "gender": 0,
               "credit_id": "55cc56e2c3a36856f90025e1",
               "name": "Ye Sun",
               "profile_path": null,
               "id": 1496423,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Argenta (voice)",
               "gender": 0,
               "credit_id": "55cc59f8c3a368570100259a",
               "name": "Bianca Collins",
               "profile_path": null,
               "id": 144973,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55cc5405c3a3685a88001e76",
               "name": "Yuefeng Song",
               "profile_path": null,
               "id": 1496406,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55cc5439c3a36855640007b4",
               "name": "Bill Borden",
               "profile_path": null,
               "id": 57614,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 5.042807,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 257932,
      "vote_count": 24,
      "budget": 40000000,
      "overview": "The land of Altera has observed an uneasy peace for years among Humans, Elves and Evil beasts who are loyal to the legendary Black Dragon. But the Black Dragon begins to stir from its hibernation, sending the Beasts marching across Altera. With a beast conquest perilously close, a small group of Humans and Elves unite to try to find a secret hidden road to the Black Dragon's cave and destroy it. But the fate of all of them may be in the hands of the young warrior Lambert, who must summon the confidence and skill to face the Black Dragon himself just when all may be lost.",
      "similar": [],
      "original_title": "Dragon Nest: Warriors' Dawn",
      "runtime": 88,
      "poster_path": "/4gtrcEfXkMuVmQTUbELnfrA4Jqk.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Mili Pictures",
         "id": 60714,
         "origin_country": ""
      }],
      "release_date": "2014-05-20",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/5LX5LigezI0Ja13hExz12YByrJU.jpg",
         "name": "Dragon Nest Collection",
         "id": 464125,
         "poster_path": "/eId1fZi1Wp1PoWck3guHm4kTQnC.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yuefeng Song"],
      "runtime": 88,
      "synopsis": "50 years ago, Black Dragon appeared in the once peaceful land of Lagendia. Under the order of the King, the young Geraint, Argenta, Velskud and other legendary heroes assembled various forces to form the Dragon Slaying Alliance. This incident was widely referred as the First Dragon Invasion by the generations to come. However, what exactly happened during this incident? Where are these heroes after the dragon invasion? The movie will reveal the story and mysteries behind this epic historical event.",
      "writers": [
         "Bill Borden",
         "Terry Izumi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2911342/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTU5NTEwNTg5OF5BMl5BanBnXkFtZTgwMTA4NTc5MTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jiao Xu",
         "Guanlin Ji",
         "Ying Huang"
      ],
      "reviews": [
         "(no specific spoilers mentioned but if you want to go in completely without any comments about the storytelling then don't read, though you should definitely watch the movie if you are unsure, you wont regret it unless you have no interest at all in magic and fantasy world sword fights, at the very least it is a decent story) apparently inspired by a game called dragons nest that I know nothing about. for someone that doesn't know the lore this movie was a great watch, though the ensemble of 'heroes' was a little off 'strictly story wise, though that is understandable by it being based on the lore of a game, essentially character classes that are different from one another having prejudices about each other yet work together to achieve a common goal for the greater good. while the story might not be the most original, if you have any interest in sword fights and combat magic, great animation and a movie with possibly perfect pacing/highs and lows this is certainly worth a watch. compelling story telling for someone that is unfamiliar with the lore, only thing it suffers from is the introduction of too many (main?) characters right away, that might be because there is already an established lore for them I don't know but thankfully the narrative doesn't focus to much on previous events just that \"they know of each other\". as mentioned a lot of talent went into the animation, they really deserve praise for it.",
         "Practical first For Parents: I watched it with my kid, and I enjoyed it as much as him. Might be a bit dark for young impressionable kids, but there isn't much gore per se, no blood, but lots of battle violence. Dragon Nest: Warriors Dawn, was overall, a wonderful production. I am your average person who really enjoys movies, animation, gaming, and mythology. I am a fan of D&D type games and story and this movie feels exactly like this! I had to write this because so many reviews were very unfair. There is no way in the world this movie deserves anything under 6, if you are being overly critical. The Movie \"The Apocalypse 2007\" deserves a 1/10 or 2/10 if you're being generous... just saying. Please be fair in your ratings. This title has good sound effect, Great animation, Good voice acting, very cool, familiar Character types: ( light and dark elves, sorcerers, barbarians, rogues, etc), humour, drama, everything that makes a story interesting and engaging. GREAT MUSIC, by that I mean: subtle, timeless, classical instrument based that sets the tone for every scene and emotion, it's always there but it never interferes with the story, very little pop, in other words... well done! Also, Can I just say that if you are a fan of any fantasy lore, D&D base games, anime or video games, you will LOVE this. Yes this is inspired from various fantasy lore, games and/or actual folklore, but people should realize that Tolkien did not invent fairy/ Elven/ Fantasy lore... Come on. Neither does Final Fantasy games own all rights to fantasy/ Magic animations. It's not a rip off of Wow (if anything, WOW is a ripoff of so many things of pop culture) Too many over critical people not appreciating it for what it is. Honestly, there are not enough animations like this! So much fun to watch. It is not completely original in it's genre but this does not make the beautiful animation, fun action combat scenes, silliness, drama, adorable characters any less good. Looking forward to the sequel in the summer of 2016!",
         "Great movie real great direction. Its really difficult to make a movie out of an anime and even more difficult to make a movie out of an anime game why the lore of-course. We all know movies like dragon ball evolution and Last Airbender. But this movie is superb its trimed neither to fast nor to slow. neither mushy or hard on eyes. It has emotion a bit of laughter and definitely no fan service unlike game.Every character is unique and you can watch it with your kid. You will love liya and lambart and their love story better than twilight. its not very famous because its an Asian movie not backed by any big media houses like pixar or Disney. but its on par even better than some . MUST WATCH!",
         "This is the best Chinese animation movie I've seen. I watch what is coming out of the mainland and in animation it has been bad. Same with live action, but sometimes we get movies like Kung Fu Hustle which was amazing. Where are all the great HK movies? Why don't the mainland movie makers watch more international films and understand that good plot is essential to a good movie. But Dragon Nest might be the movie that proves the mainland can make movies now. This movie feels like it came from a game, but Song Yuefeng, the director, took his skills to add feelings and fun to the action. This is a director to watch out of China. I now want to see the sequel.",
         "I loved this movie from start to finish, the ending I won't reveal but I will say it reminded me of those tingly World of Warcraft trailers I would love so much as a young adult. This movie is like a mixture of all the stuff I loved growing up with as a kid, a teenager & young adult into one immensely epic film. It has an amazing story line, fantastic characters especially Liya and actually had me sitting there saying out loud during the film, \"I love this movie\" Thank you to anyone involved in making this movie. I thank you from the bottom of my heart. Final Fantasy styled animation with Lord of the Rings size battles. In my opinion it's like epic Gaming, Animation and a movie all got rolled into one epic ride !! I love this movie so much, thank you again.",
         "Building a movie from online multiplayer games is not easy. These games are known for social interaction or accessible gameplay, not strong narrative. Dragon Nest animation resorts to utilizing mediocre antics from many other games or movies, then put it in one predictable story and weak animation. It's a dull journey and what few sparks it has, mainly from vista or music, can't save it from mediocrity. Story is very basic, cue in your typical hero-in-training, alliance with other race, some comedy reliefs and potential romantic angle, then you'll have the 101 good versus evil plot. It's a dreary development with just about everything one would expect not to see again in fantasy genre. Granted, this sort of plot has been used many times and it can be to great effect, but Dragon Nest merely stacks them without novelty and hope for the best. Animation isn't its strong suit, the visual looks pedestrian as though it's from last gen video games. Sometimes the audio sounds out of place as the mixing stutters on some parts, dubbing is the usual sloppy mess, especially for supporting chars. There's a bit inconsistency with details as well, shadows or texture don't sync well into the scenes. Frankly, these kinds of problems shouldn't happen on feature length animation of today's technology. If there are some redeeming parts, they are the decent soundtracks and design for the world. They manages to draw that fresh fantasy vibe, although much too briefly before the average animation kicks in again. Watching Dragon Nest offers the same level of excitement as grinding in online game, low at best.",
         "I've played the mmorpg a few times, but I hardly remember anything about it, except that I loved the visual atmosphere in it and that was what peaked my curiosity about this movie. Now, In a day and age where most fantasy animations all have the same standart storyline seen dozens of times before , frankly I wasn't expecting much from Dragon Nest the movie, but then it started and I knew immediately this one had something special in it. What caught my eye was that this was a non stop action movie from start to finish but somehow managed to create and develop great characters among all the chaos and most impressively used the action to tell the story and not just to look cool and impress the teen audiences. The plot may be not that original, the characters are all mmorpgs clichés of course, but they are amazing in this story. Simply because they are so well defined and have great charisma , which is something that I wasn't expecting at all. Also their different personalities are very well woven into the story structure and each character development marks a plot point, a twist or a revelation. If this would be a failed and boring movie, Dragon Nest would have just presented the mission plot, presented the characters and then it would have spent the entire movie flashing empty action scenes. Not in this movie folks ! In Dragon Nest the action scenes are the glue that binds everything together. It works and they are amazing. Not just because they look great but above all because they really are inventive and fun to watch. Particularly, because as I said, the action scenes are not empty and are all used to a purpose within the story structure. This is a very, very well planned movie people. It may look like just another kids movie, but this one is really, really well directed !! I was not expecting this at all. It's one of the best action movies I've seen recently and a good example of how an incredible action movie does not have to be a visual editing mess; so this is one flick that director Michael Bay needs to watch to learn how to create meaningful action scenes where the viewer can actually see what happens on the screen and care for the fate of the characters. All characters felt important and we cared for every little bit of action where each of one was involved, which was something that I loved, because it's been years since I had seen animated characters that made such an impression on me. I'm still trying to understand how the makers of this movie achieved this with a plot that is nothing more than 80 minutes of action sequences. Any other movie would be extremely boring to watch, with a structure like this. Not this one. The guys who made this, know how to tell a story !! Dragon Nest is another good example of how oriental cinema is much more charismatic than most of what comes out of Hollywood this days. Oriental cinema knows how to create human characters that we care for, even if they are dragons or have just a few lines to say. Overall I think this is a great fantasy action movie. Not that original in plot, but extremely well done in action and character development. A real case study. The only thing I didn't liked was the abrupt ending...I was having fun waiting for a final epilogue segment and then GONE. Is this the first episode of a television series or what ?!... Also visually Dragon Nest feels a bit limited when it comes to fantasy environments. The fantasy world looks beautiful, but I felt we've just seen small glimpses of it instead of getting that open world feel. It was probably a budget thing. And although the English dubbing is very good, I need to see this in Mandarin now, as I'm not a supporter of dubbing movies as I prefer subtitles. Nevertheless this Dragon Nest movie is a surprise. Also it's definitely the best Chinese animation movie I've seen so far as most of the animation films that come out of China usually fail real bad and so I was also very surprised that this was not a Japanese project as I thought it could be. So overall, if you love fantasy movies, imaginary worlds Dragon Nest is a real hidden gem awaiting to be discovered and I hope there will be a sequel because I do want to see more of these characters please !! And I will be buying this in blu-ray if it ever comes out. Great charming movie and this 45 year old illustrator here loved it ! Ps: there's stuff after the credits, so watch it to the very end. ;)",
         "Fairly enjoyable. The look of the movie was pretty good. Agree with other reviews here, the protagonist's face while alright, had some very ugly animation moments, but nothing too bad. As someone who's played the online game, I thought the adaptation was alright. Although naturally, taking the story that spans an MMO where story quests drag on at length with gameplay, and condensing it into a movie, definitely makes for a very summarized Narrative, with little of the flavor items other characters bring, such as detailed description of Gerrant and such. I know the character well, because I've played the game. Others might find his big climax moment entirely out of left field. It was fun seeing certain ques from the game, such as character abilities and moves utilized, as well as the standard makeup of the basic classes, (although the game itself doesn't exactly stray from traditional RPG classes such as elven archer, sorceress and cleric) so all in all, for a game based off an MMO, not bad, it was pretty enjoyable, and it handles it's story well. I'm curious to see what the sequel can bring and how it can build upon characters like Lambert, who, assuming it takes place some time after this one, would be a more experienced swordsman.",
         "As a 23 year old, watching this movie was much more enjoyable than I thought it would be. What interested me about this movie was that I've played Dragon Nest in the past and I was interested to see what the movie would be like. Don't worry if you've never played Dragon Nest before, you do not need to know the story of the game in order to follow along in this movie. Everything was explained well enough throughout the movie that you will follow along just fine. To start off, I should warn you that there are deaths in this movie, but the fighting and deaths scenes are very contained. What I mean by that is when a character is cut, they do not show any blood or the wound and they do not die in any gruesome type of way. The atmosphere, character, and the cartoon style sort of resembles How To Train Your Dragon in many ways. If I had to choose something memorable, I would have to say the music really stood out the most. They did a great job of creating the atmosphere and setting the mood for most scenes. There are a couple of things that I didn't like. It might be nitpicking since it's just a children's movie, but I feel like they could've done much better on some things. First of all, the whole story developed at a very fast pace, so fast that there was no room left for character development at all. Whatever character development did happen was only focused entirely around the main character. However, because of the fast pace, they were able to squeeze in a lot of enjoyable action scenes. Secondly, it was painfully obvious who the bad guys were. The stereotype of bad guys wear black clothing were very prominent in this movie. In conclusion, this movie has pretty much everything you want in a children's action movie. Swords, magic, princesses, warriors, fighting, and DRAGONS!!!!",
         "I got to admit, except for the protagonist's face (which is ugly even by animation standards), everything blends in nicely. But that's only for the animation part. I'll start with the protagonist introduction: it shows him sleeping when he should be guarding, probably, or he was just having some time off in the woods. From here we see that he's not quite the smart or fighter type. Next we see his agility and parkour skills, that seem to be similar to an elf's, which seems to be his strong point (until the final fight where he miraculously achieves great fighting skills to match the human king's second favorite, but let's leave that for later). We even see him almost catch an elf, and then a fight scene with some monsters, where he seems to have mediocre fighting skills (he only get's to resist because of his agility). Some time later, after the ship and the cemetery thing, we get to see the so called 'chemistry' between the protagonist and the cute elf girl. How we reached this point within a week or so, when they barely seemed to talk on-screen and neither of them managed to catch the other's attention, I really don't know. After the girl's death during the last fight, the protagonist seems to have acquired amazing fighting skills and the ability to control his mystic sword (which we only get to see a glimpse of while it's made in the forge). The cliché of 'I must protect my loved ones' is very strong. I almost laughed when he disarmed the second antagonist and the antagonist admitted that 'he had good fighting skills'. Until 10 minutes ago he was barely surviving! Also, no character development, except maybe for the antagonist at the end. Other clichés: 1. Highborn smaller brother is envious of bigger brother and falls into darkness. Checked. 2. Two opposite gender characters who have stupid fights(the protagonist and the elf) will be the movie couple(s). Checked. 3. \"Evil will continue\" ending. Checked. 4. Protagonist gets saved at the last moment just before he could die by mysterious force, character, or an appearance that nobody expected. Checked. 5. \"Evil is too strong, we must make an alliance\" intro. Checked. 6. Stupid protagonist with very high amount of power. Checked. 7. Safe way to go back home after the main fight ended. Checked. 8. Antagonist turning to the good side at the end. Checked. And waaay too many more. I forgot to mention, how did the dark elf girl get the crystal so fast? even if she was waiting at the bottom of the cliff, it would take a couple hours to come back from that, yet she managed to go, get it, come back and stand on a mountain for dramatic ending in about 30 minutes in-movie time. The only reason I gave it 3 stars was because of the animation, the dragon-human duo had an interesting personality, and the last line of the dark elf.",
         "Like other reviewers have noted, the criticisms of this movie seem unjust. Disclaimer: I am a fan of the game, but have been a fan of many games, novels, etc. that do not turn out this well when made into movies. Warrior's Dawn has high production value in every aspect (great voice acting even though I prefer original voice acting, touchingly beautiful music and characters brought to life through superb character design and animation). But it also has a deftly-woven action-based plot that evokes emotions of hope and reconciliation. This was not too surprising since the game itself is like a visual novel with its engaging, well-written and often humorous dialogue. Yes, the world of the movie has similarities to others, but its unique as well. It would take a lot more clichés and borrowing of elements from various mythologies to be disappointing to fans of the fantasy genre. But this movie goes beyond most movies in its positive and comedy-enriched message.",
         "Drawing heavily from World of Warcraft cinematics and music sequences, along with the standard premise of Lord of Rings, this movie falls flat on it's face as a cheesy knockoff. The voice acting was horrible, as if the actors couldn't read the script, pausing at weird times and emphasizing parts of sentences a native speaker wouldn't. Of course the script it self was so unoriginal I was tempted to turn it off the moment I heard the intro. The characters movements are so comical you'd laugh when they are trotting about with this ominous music in the background. Without spoiling, the most absurd part of the movie comes at the end when seasoned and powerful warriors just lay down panting for hours on end just to give the spotlight to the child hero. The movie makers don't understand subtlety at all. Speaking of which, the entire movie sounds like an 80s comic where the narrator or someone explains everything in every moment. Overall This is a horrible waste of time. Try harder China.",
         "Soundtrack is great but it is quite awkward seeing as the story has deviated from the Dragon Nest's storyline. There are many points in the story where you notice that is very different from the actual in-game lore. The build-up of the story is quite rushed. The 6 heroes were introduced in a way that it assumed the audience would already know who they exactly are. Those who have never played the game or followed the main quest,would not know who these people are apart from the main protagonist fawning over them. The animation is great but there are points that are quite a bit out of place. Argenta's face in the movie is completely different from the tsundere we all know. Barnac for one is a blond swordsman but for this they decided to make him into a old geezer with money issues. This is an okay movie given that it's target market is initially gamers.",
         "What I love about this movie is that it is not the story about a chosen one. Now a days, all movies, books and so on are about this one person who has the special power within him to change everything. However, this is not the kid. The main protagonist, Lambert, is just a simple teenager who happen to get into a quest. He does not hold special powers, he is not necessarily strong, he is just a normal kid with attitude. As the movie goes on he becomes stronger, but yet there is no mentioning of him being special, just a kid with a big heart. The animation in this movie was amazing. I was impressed from start to finish and the detailing of even the smallest aspect of the scene was well thought out. Also, so was the story line. The story line kept me guessing. It was not like most movies where you already know everything that is going to happen, it kept me guessing. When I started watching this movie my first thought were \"Oh, he's the chosen one\" or \"Oh, this will totally happen next\" But it didn't for most of the time. Which is pretty rare now a days if you ask me. All the characters are well thought out and original and have a personality which I would love to get to know a backstory to. The characters had however the natural traits of for example a mage, a warrior and so forth, however as I mentioned the personalities were really interesting. Furthermore, the fight scenes were amazing. The precision of every blow and every strike was fantastic and I am so glad that I chose to watch this movie tonight. I definitely will recommend all my friends who love this type of genre to see this movie. Why I gave it 10/10? Because it kept me guessing, it kept me wanting more, I was sitting on the end of my seat and when I saw it was only 10 minutes left I got so frustrated because I wanted to see more. Which I hopefully if they do a second one. Once again, a great movie.",
         "The character animation in this movie is seriously unnatural. Sometimes you just cannot understand what the characters want to express with their clumsy gestures. But maybe the dubbing is no good either. They will have to do better than that to even come close to Pixar or Dreamworks. Also the rendering of shadows (parts where the light should not get to, like nostrils) is flawed. The picture feels flat. Technically this movie looks like something from around 2000. There are some nice backdrops and detail renderings but the characters seriously ruin it for me. The story line is somewhat too simple for my tastes. No big surprises in a simple plot. The good old battle between good and evil.",
         "Such a mind-blowing movie... actually originated from the game I am addicted to and believe me, I've just seen the movie (tomorrow is my semester exam) and I am seeing it again!!! Direction and technical aspects are simply amazing. The director has skyjacked the anxiety and excitement of the plot to the skies... A MUST WATCH MOVIE for all animation movie lovers out there.. I bet you can't rupture its warmth feel after a single watch. Love this movie sooo much... not just bragging about it but there are few aspects that emotionally hunts you deep down your heart.... mainly the...*spoiler alert* Will be waiting for its sequel... if at all it comes (I soooo want one).",
         "OK, it wasn't the same thing, but the feel of it was the same. Young kid becomes great while tagging along a party of epic fighters sent to kill a dragon. I haven't played Dragon Nest - which BTW is a MMORPG - but I liked the characters and the lighthearted mood of the film. In fact, the only thing that I think could bother people is that it is basically aimed at children and (very) young adults. The animation was nice, the main character a bit annoying, but fun, the young romance thing interesting. There were some points that I didn't like, the reveal of the nature of the two brothers and the scheming dark elf that everybody seems to know who she is, but was never explained in the film. Also the unfathomable 'level up' at the end, so Asian in nature, that made the entire story feel kind of stupid. I mean, if a little kid can do all that, what the hell was everybody else doing? Bottom line: I rate it as 'unexpectedly good'. In truth, I had no idea what the movie was, I just liked the title, so not much in the way of expecting, but considering it is a Chinese animation film, it was actually quite good and I enjoyed it. Also, it should be a good film to watch with young kids, just cover their eyes at the sex scenes - nah, just kidding.",
         "The story is not very original. The whole movie looks like a short version of LOTR and the Hobbits. A group of people has to travel around the world defeat the biggest evil the world has ever known. Just like the LOTR, there is a dead army after a big war between elfs and humans. There are orks in the form of beast even something that looks like a Cave troll. Again, there is a wizards with staffs, magic maps and an arrogant king. Hawks are replaced with flying shops Another dragon with a small weak spot who is kllled by a special arrow A massive army that attacks the great gates of the orks, even uses the same tactic as the Rohirim at the Battle of the Pelennor Fields. The dragons gem corrupts the mind and spirit, just like the ring and offcourse a pure soul is not affected. The only thing I missed were dwarfs. The only reason i gave this movie 3 stars, was because the drawings are very nice. The actors talk with a total of 0% compassion or believe. They just read the lines.",
         "This movie was best of the best, a masterpiece i love it very much. I don't believe in other's negative comments. I love everything about this film the animation, the effects, the music, the characters, and the dub version of it. Everything was perfect and i really hope we can get a sequel of this.",
         "One of the biggest piles of garbage I have ever seen! I'm a fan of both fantasy and animated movies but this.... I don't even know where to begin! The voice acting is horrible, sounds like it's taken straight from an \"adult movie\". It seems like the plot is ripped from *insert generic heroic video game theme here*. Im usually pretty forgiving since I am fan of the genre but this was almost painful to watch! Such a weak story and even more predictable then any Disney movie. What was surprising was how good the animation was. Guess they needed a fancy package to deliver this polished.... well you know... So in the end, if it is needed to be spelled out, horrible movie and actually one of the few movies I would say is a waste of time watching!",
         "Awfully disgusting Chinese quality. Movie lacks much truthful and severe fake originality, graphics were sub-par yet the movie tries so hard to impress yet being a Chinese, knows very little about traditional nor modern creativity. The director be better off making shoes and gadget's component in an abandoned factory in 3rd world china than wasting other people's precious time. Have not been impressed throughout the movie as the actress looks pretty much a like a back alley 5$ woman in the outskirts of Chinatown. The only compliment I can give for this movie is the poster where we could not even predict what is the message about to be delivered by this untimely rude movie. The Chinese are preferred to invest in more plastic surgeries if they plan to waste the world's time and healthy eye vision. Not recommended for quality goers."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Mili Pictures"],
      "summaries": [
         "The land of Altera has observed an uneasy peace for years among Humans, Elves and Evil beasts who are loyal to the legendary Black Dragon. But the Black Dragon begins to stir from its hibernation, sending the Beasts marching across Altera. With a beast conquest perilously close, a small group of Humans and Elves unite to try to find a secret hidden road to the Black Dragon's cave and destroy it. But the fate of all of them may be in the hands of the young warrior Lambert, who must summon the confidence and skill to face the Black Dragon himself just when all may be lost.",
         "Lambert joins the Dragon Slayers' League to save Altera from the Black Dragon."
      ],
      "budget": 40000000
   },
   "movielensId": 140699,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "普通话",
         "Pусский"
      ],
      "releaseDate": "2014-05-20",
      "dvdReleaseDate": null,
      "directors": ["Yuefeng Song"],
      "runtime": 88,
      "movieId": 140699,
      "title": "Dragon Nest: Warriors' Dawn",
      "mpaa": null,
      "actors": [
         "Carrie-Anne Moss",
         "Lucas Grabeel",
         "Blythe Auffarth",
         "Charlie Schlatter",
         "Simon Jaglom",
         "Matthew Temple",
         "Ying Huang",
         "Ye Sun",
         "Bianca Collins"
      ],
      "imdbMovieId": "2911342",
      "originalTitle": "Dragon Nest: Warriors' Dawn",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Animation"
      ],
      "youtubeTrailerIds": ["vbkA4a5N-Hc"],
      "plotSummary": "The land of Altera has observed an uneasy peace for years among Humans, Elves and Evil beasts who are loyal to the legendary Black Dragon. But the Black Dragon begins to stir from its hibernation, sending the Beasts marching across Altera. With a beast conquest perilously close, a small group of Humans and Elves unite to try to find a secret hidden road to the Black Dragon's cave and destroy it. But the fate of all of them may be in the hands of the young warrior Lambert, who must summon the confidence and skill to face the Black Dragon himself just when all may be lost.",
      "tmdbMovieId": 257932,
      "avgRating": 3.9375,
      "releaseYear": "2014",
      "numRatings": 8,
      "posterPath": "/4gtrcEfXkMuVmQTUbELnfrA4Jqk.jpg"
   }
}