{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "whodunit",
            "id": 12570
         }
      ],
      "imdb_id": "tt0068272",
      "video": false,
      "title": "A White Dress for Marialé",
      "recommendations": [
         74087,
         28402
      ],
      "backdrop_path": "/xZvc5Zl3M15E3clKg9rVVVy2T8j.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mariale (as Evelyn Stewart)",
               "gender": 1,
               "credit_id": "52fe4a33c3a36847f81c067f",
               "name": "Ida Galli",
               "profile_path": "/tJoAf0TJgQhXXfDkJaHcWlSj7uX.jpg",
               "id": 5969,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Massimo",
               "gender": 0,
               "credit_id": "52fe4a33c3a36847f81c0683",
               "name": "Ivan Rassimov",
               "profile_path": "/xUTxtLxkbNrv7bBTq4BEoEGEvqf.jpg",
               "id": 44961,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paolo",
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c0687",
               "name": "Luigi Pistilli",
               "profile_path": "/85bLFJaFDEF2Ae1KhXWycwCRogG.jpg",
               "id": 5814,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mercedes",
               "gender": 1,
               "credit_id": "572bfcab9251413896000b86",
               "name": "Pilar Velázquez",
               "profile_path": "/v1dEGpvsJODpQ0lMGKjzKm6ZJlt.jpg",
               "id": 538166,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sebastiano",
               "gender": 2,
               "credit_id": "572bfcbcc3a368013d000c01",
               "name": "Ezio Marano",
               "profile_path": "/7eXyPWyc0Y4ulDHP4jF51UW1nxI.jpg",
               "id": 1076431,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jo",
               "gender": 0,
               "credit_id": "572bfcc7c3a368013d000c06",
               "name": "Giancarlo Bonuglia",
               "profile_path": null,
               "id": 1615823,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lover of Mariale's mother",
               "gender": 0,
               "credit_id": "572bfcd6c3a3680133000e5a",
               "name": "Gianni Dei",
               "profile_path": null,
               "id": 41067,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mariale's father",
               "gender": 0,
               "credit_id": "572bfce4c3a3687ffd000bcd",
               "name": "Franco Calogero",
               "profile_path": null,
               "id": 1615824,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Osvaldo, the butcher",
               "gender": 0,
               "credit_id": "572bfcf1c3a3687ffd000bd1",
               "name": "Gengher Gatti",
               "profile_path": null,
               "id": 556939,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Gustavo",
               "gender": 0,
               "credit_id": "572bfcfd9251416d2d000499",
               "name": "Edilio Kim",
               "profile_path": null,
               "id": 235950,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Woman reading a book",
               "gender": 1,
               "credit_id": "572bfd0e9251416ee1000442",
               "name": "Carla Mancini",
               "profile_path": "/ovUX2Ke2z45i5L3d4ja5n8TEqgV.jpg",
               "id": 27390,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Semy",
               "gender": 0,
               "credit_id": "572bfd249251416ee1000447",
               "name": "Shawn Robinson",
               "profile_path": null,
               "id": 1615825,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "572bfd2ec3a368012c000bf0",
               "name": "Bruno Boschetti",
               "profile_path": null,
               "id": 1016083,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a33c3a36847f81c067b",
               "name": "Romano Scavolini",
               "profile_path": null,
               "id": 140848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56af945b92514101f900032e",
               "name": "Bruno Nicolai",
               "profile_path": "/5zEMxQT35IDrOVZZEbgqlVsckAB.jpg",
               "id": 45670,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 0,
               "credit_id": "56af944f92514101f60002ea",
               "name": "Fiorenzo Carpi",
               "profile_path": null,
               "id": 23729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "572bfd41c3a3687ff9000bbd",
               "name": "Remigio Del Grosso",
               "profile_path": null,
               "id": 31981,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "572bfd4d9251413890000bd5",
               "name": "Giuseppe Mangione",
               "profile_path": null,
               "id": 138765,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "572bfd5b9251416ee1000455",
               "name": "Romano Scavolini",
               "profile_path": null,
               "id": 140848,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "572bfd6b9251413888000bd5",
               "name": "Francesco Bertuccioli",
               "profile_path": null,
               "id": 32665,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.1939,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 104360,
      "vote_count": 4,
      "budget": 0,
      "overview": "When Marile is a little girl, she sees her father murder the two lovers and then shoot himself in the head. About 30 years later, she lives in a mansion and has mental problems. She invites a number of friends and one by one they become murdered.",
      "similar": [
         357096,
         15069,
         984,
         8090,
         75780,
         281,
         948,
         807,
         445954,
         21484,
         10651,
         11423,
         10781,
         2749,
         123109,
         18587,
         7007,
         285840,
         26390,
         15762
      ],
      "original_title": "Un bianco vestito per Marialé",
      "runtime": 92,
      "poster_path": "/qs5iY0MoX3UF89nYXtPHqG6y0Xr.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "KMG Cinema",
         "id": 76431,
         "origin_country": ""
      }],
      "release_date": "1972-11-30",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Romano Scavolini"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Remigio Del Grosso",
         "Giuseppe Mangione"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0068272/",
      "coverLink": null,
      "actors": [
         "Ida Galli",
         "Ivan Rassimov",
         "Luigi Pistilli"
      ],
      "reviews": [
         "The enigmatic wife of a moody Marquis invites a motley group of people to their sinister stronghold where a long ago crime is re-lived... Here's a strange and unsettling giallo that borrows much from the maestro of the macabre, Mario Bava. The film is set entirely on an eerie, isolated estate and, like 5 DOLLS FOR AN AUGUST MOON and BAY OF BLOOD, has an ambiguous plot centering around murder and mayhem which provides director/cinematographer Romano Scavolini with ample opportunity for a number of unusual set-pieces. A pre-credit sequence has a young girl watch as her father finds her mother with a lover (a nude Gianni Dei) and shoots them both before turning the gun on himself. The story shifts to the present with Mariele (the beautiful Evelyn Stewart) inviting a hedonistic, unpleasant assortment of friends (which include Ivan Rassimov and Pilar Velazquez) to her husband's (Luigi Pistilli) crumbling castle for some fun and games ...but she seems to have an ulterior motive. Is she being held prisoner by her husband and his manservant or is she locked up for her own good? For the festivities, Mariele dons the white dress her mother was murdered in and there's some brief nudity, lesbianism, whipping, and bitch-slapping at a Felliniesque feast before the party guests get dispatched in rapid succession. These seemingly senseless killings are brief but brutal and the identity of the killer ultimately depends on which version of events the viewer chooses to believe. It's an unusual and disturbing twist but only part of a \"take no prisoners\" nihilistic ending which has fate coming full circle. The striking use of color, a somber score by Fiorenzo Carpi & Bruno Nicolai, and a capable genre cast all help to create a decadent atmosphere that gives the movie a near-surreal aura. For example, at one point the cast grabs candelabra and goes down to explore the castle's catacombs (just because they're there) when a veritable windstorm kicks up out of nowhere and goes on for quite a while. This does absolutely nothing to advance the plot but it does make for an eerie tableau. In many ways, the whole film is like that. This classic \"style over substance\" thriller from the Golden Age Of The Giallo comes letter-boxed, in Italian with English subtitles, and highly recommended for aficionados of the genre.",
         "In the '40 Mariale is an eight year old girl.Powerless,she witnesses the death of her mother and of her young lover,both killed in cold blood by her father.Years have passed and Mariale has married a young nobleman who keeps her almost captive in an old estate forbidding her to take part in society's life.A sort of love-and-hate relationship has developed between the two characters.One day Mariale decides to put an end to her seclusion;she eludes her husband's and the butler watchful vigilance,breaks the phone's padlock and sends several telegrams inviting friends for a evening at her home.As absurd as it may seems,Mariale intends to reconstruct,thanks to her guests,the tragedy she lived several years before.She wants to prove that in everyone of us exist two distinct entities.When Paolo,Mariale's husband fully understands the situation is too late.The evening turns into bloody nightmare,when unknown killer starts murdering people.Romano Scavolini's \"Spirits of Death\" is a stylish giallo with some gory murders.The photography is beautiful and the atmosphere is creepy and nightmarish.The identity of the killer is never explained and that makes the film quite disturbing.The cast is splendid with Ivan Rassimov and Luigi Pistilli to boost.Check it out.7 out of 10.",
         "Another unheralded horror gem from Italy! I'm actually surprised it's directed by Romano Scavolini, since he's the one responsible for \"Nightmare in a Damaged Brain\", and this one seems like the total opposite of that one. \"Mariale\" is one hell of an elegant, sexy and disturbing chiller, that really stands out from most gialli that were being made at around the same time. The story centers around Mariale, a young woman who is kept locked up in her family castle by her own husband and his servant. As a child, she witnessed the brutal murder of her mother, by the hands of her own father who then proceed to commit suicide. She secretly invites a group of old friends to gather at the castle for a costume party, and when Mariale decides to wear the same dress her mother wore on the day of her death, all Hell breaks loose. What follows is a grotesque, nightmarish orgy right out of a Fellini film, with a little extra gore and sleaze, that in many ways predates Ken Russell's \"Gothic\". Scavolini firmly directs this one with style and flair, as well as providing the gorgeous cinematography, that takes full advantage of it's amazing setting, and is beautifully accompanied by the Fiorenzo Carpi's haunting score. The film also benefits from strong performances from a great cast of giallo stars, which includes Evelyn Stewart in the title role, Luigi Pistilli, Gianni Dei and Ivan Rassimov (playing against the type in the 'good guy' role). In spite of these great elements, the film does have flaws, mostly regarding the pace. The opening scene is a bang, literally, as young Mariale witnesses the brutal demise of her mother and her lover. From then on, it works quite well until the bodies start piling up. The film suddenly takes a more routine and rather dull Agatha Christie-style murder mystery, specially when compared to it's unique first 40 minutes or so. Thankfully, the great ending puts the film back on it's tracks, and will certainly stay your mind for a while once you finished watching it. Overall, an excellent and sadly obscure giallo, with a very distinctive style. 8/10. If only the middle part was slightly more gripping, it would certainly get a 10/10 for me.",
         "Romano Scavolini - best known for the infamous film Nightmare in a Damaged Brain (aka Blood Splash, USA 1981) - delivers a truly strange giallo here, which somehow looks like a Federico-Fellini-movie on drugs (if I might say so). Beautifully shot with lots of nightmarish sequences, it delivers enough to keep every fan of suspenseful thrillers right on the edge. It is also quite disturbing, because it never clearly unmasks the killer, not even in the end (but see for yourself and decide for yourself). It's a pity that this unique giallo has been unavailable for some years now (I luckily got an copy of the Italian print which was released in the early 1980's). it will hopefully be picked up sometime by a DVD distributor. If you've got the chance to get this gem, don't hesitate to take it!",
         "This is one of those gialli I probably wouldn't recommend to those unfamiliar with the Italian genre, but committed giallo fans will certainly enjoy it. A young girl witnesses her father shotgun her mother ( Evelyn Stewart) and male lover to death before turning the gun on himself. The little girl naturally grows into a pretty maladjusted adult (also played by Stewart) who is kept drugged and isolated in a remote castle by her over-protective husband (Luigi Pistilli) and his brutish butler. Still she manages to invite a group of her decadent bourgeois \"friends\" to the castle for a kind of weird masked orgy. It's a bad sign though when the hostess herself comes dressed in the white gown in which her mother was killed (which you would would think would be covered in blood and riddled with buckshot, but oh well). Naturally, it isn't long before the guests are dropping off like flies. It takes a little time for the murders to get going, but they come fast and thick when they do. And the early going is spent with lots of surreal Gothic touches. A great eerie setting and superb visual style and music make this film similar to other heavy-duty bizarro gialli like \"Sex of the Witch\" and \"Crazy Desires of a Murderer\", even if--like with those--the plot rarely makes a lick of sense. There are only really two possible perpetrators of the killings, but even by the end of the movie I wasn't sure which of them was responsible. The victims are certainly worthy though. There is a bickering young, interracial couple--the guy derides the girl as a \"slave\" while she belittles him by calling him \"white master\" (yet another sensitive, politically correct portrayal of black people in Italian genre films). Spanish actress Pilar Velasquez plays a character after my own heart--a raving nympho who responds to nearly getting raped by a male guest by going to the black woman's room and (for no apparent reason beyond the obvious) stripping off for some hot, interracial lesbian action! I was quite impressed with Velasquez--not just her body (which can also be seen in \"Naked Girl killed in Park\"), but also her acting--it can't be easy to play such a preposterously motivated character. The real acting honors, however, go to the two great character actors, Luigi Pistilli and Ivan Rassimov. It's a sublime joy to watch these two devour scenery together. Director Roman Scavoli was later responsible for the film \"Nightmare in a Damaged Brain\", one of those films that was banned in Britain, but completely ignored in America. I haven't seen that one yet, but it's probably safe to say this is better. Newcomers to the giallo genre will probably be left scratching their heads, but long-time fans will definitely enjoy this.",
         "Filmed at the Palazzo Borghese in Villa Borghese, Rome, which also contains the Largo Borghese, where we had a picnic with a Turkish family. Borghese! They say that the first thing you taste food with is with your eyes, so it's good that this film has a lot of food in it. Wait, that's not right. In a question of form over function, if I see another slow motion lesbian sex scene in another giallo my arm will cease to function wait that's not what I'm getting at. Let's try again. A White Dress for Mariale begins with Mariale as a child watching her cuckolded father gun down his cheating wife and her nude lover in a park before turning the gun on himself. Years later, Mariale has turned into Ida Galli, who lives in a big mansion (of course) with angry husband Luigi Pistilli, who constantly feeds her tranquilisers. Ida, it turns out, has sent out invitations to a bunch of freaks and intends to hold a party. These freaks include Ivan Rassimov, an old flame of Mariale. I can't remember the names of any other guy. There's an impotent guy and his frisky wife Mercedes, or was his wife the black girl Semy (who tries it on with a suit of armour – that's a new one). Who knows. I don't even know why they were there in the first place. Mariale takes them all down to the basement which is full of very strange mannequins wearing dresses. She then invites everyone to dress up (one guy picks a ballerina outfit, Ivan dresses up like a pageboy etc. Mariale herself dresses up in the white dress her mother wore when she was killed – complete with the bullet holes. I think at this point Luigi gave up and wandered upstairs to watch football while everyone else got completely wasted. This whole sequence is all rather trippy and reminded me of some of Peter Greenaway's work – what with all the food and colour schemes. I was rather taken aback at Semy's choice of dress being an orange robe and a double strap-on dildo, but then she hits it off with Mercedes later so maybe she needed it. I did begin to wonder, around the fifty minute mark, whether anything was actually going to happen in this film. Luckily, someone starts knocking off the gets in a bloody fashion. Semy in particular meets a nasty end by being smashed to a pulp in a swimming pool. I suppose no one signs up for a giallo and expects anything profound, so the barrage of crazy visuals and silky camera work make up for the endless soap opera bickering and the fact that there's virtually no story to speak of. It does have a few stand out moments (like one guy being killed by a pack of dogs) but I was scratching my head at the end. Who was the killer? If food was your eyes, then your stomach would feed on oh bugger off.",
         "Romano Scavolini would go on to make the disappointing Video Nasty 'Nightmares in a Damaged Brain', but before that he made this film. Spirits of the Dead is a psychological drama come Giallo and focuses in the bizarre happenings inside a large mansion during a party. The film has shades of Mario Bava, though despite the grandeur of the setting and the strange costumes worn during the partygoers in the main part of the movie; Romano Scavolini is no Mario Bava and the film remains only an imitation of the Italian master. The plot has two sides to it and we begin at a setting in the past as a young girl named Mariale witnesses her father murder two lovers before shooting himself in the head. We then fast forward some years and a grown up Mariale is living in a mansion with her husband Paolo. She has mental problems and is often given drugs to quell the problem. She invites a group of friends to stay at the house with her and her husband, but the party soon degenerates into an orgy and it's not long before the guests are being picked off one by one. The first ten minutes made me believe that this one was going to be an interesting little Giallo. The characters are all introduced rather quickly and we are soon made to believe that not everything is as it should be. However, the film then builds into the orgy; which makes up the bulk of it, and it's not long before intrigue turns to tedium. The film tries to put the focus on the characters and this is a problem because, as is the case with many Giallo's, the characters aren't interesting enough in their own right to build a film around. The cast is not bad, however; Giallo regular Evelyn Stewart takes up the lead role well, and gets good back up from the likes of Luigi Pistilli and Ivan Rassimov. The film doesn't really get going until the final twenty minutes; and by then it is unfortunately a case of too little too late. This type of film is famous for over the top and stylish death scenes; but Spirits of Death doesn't really deliver in that respect, with only a single death scene in a swimming pool of any real note. Overall, this is not one of the better known Giallo's and I'm not really surprised. I wouldn't call it one of the worst of the genre; but it's not one of the best either and I'd only recommend this to hardcore Giallo fans.",
         "When this film started up I figured I was in for something special. It opens with an Argento-esquire scene of childhood trauma, featuring none other than the legendary Gianni Dei as the lover of Mariale's mother! Having seen this guy in two other movies (Giallo a Venezia and Patrick Still Lives), I can't help but assume there's a clause in every one of his contracts stating he must spend at least one scene naked. After all, how else can you explain why he's lying around naked while his lover is fully clothed in the white dress of the title? You've also got to love the hilariously flamboyant way in which Dei reacts to getting shot. The rest of the film proves to be less interesting. We're basically subjected to 50 minutes of some costumed morons gallivanting about a castle while Luigi Pistilli stands in the corner and frowns. I think these scenes were supposed to be intense, and certainly the mounting hysteria of the participants suggests this, but I found them to be pretty mundane. Things start to pick up a bit when the first murder occurs late in the film, and it's executed in an interesting manner comparable to the opening attack of Luigi Bazzoni's The Fifth Cord (only not quite as good). Unfortunately all the subsequent set-pieces are about as ho-hum as they come. The ending proves to be pretty great though, probably because the forgettable cast has been narrowed down to genre greats Luigi Pistilli and Ivan Rassimov. Here the drama reaches its natural, inevitable conclusion, but it's still highly effective if predictable. This might appeal to fans of The Night Evelyn Came Out of the Grave (except me, apparently) as it too is a Gothic giallo set on an isolated estate, with a protagonist's troubled past coming back to haunt them. I personally found The Night Evelyn Came Out of the Grave to be far superior (the insane ending excepted), due to a better script and far more appealing cast. Both films feature stunning soundtracks, Evelyn's by the great Bruno Nicolai and this film's by Fiorenzo Carpi (orchestrated by Bruno Nicolai). All in all I was pretty disappointed, but I'd suggest that fans of the giallo and Italian horror films check it out. Though it lacks a good structure, it still boasts some very good direction by Romano Scavolini (and the aforementioned soundtrack). And Luigi Pistilli is always awesome."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "KMG Cinema",
         "Rewind Film"
      ],
      "summaries": ["As a Child Mariale witnesses her father kill her mother. Years later, she spends her life with little contact from the outside world living in a gloomy castle. One day, however Mariale decides to invite some friends over the weekend, but as the decadent party turns into an unbridled orgy the first gruesome murder occurs."],
      "budget": 0
   },
   "movielensId": 140693,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1972-11-30",
      "dvdReleaseDate": null,
      "directors": ["Romano Scavolini"],
      "runtime": 92,
      "movieId": 140693,
      "title": "A White Dress for Marialé",
      "mpaa": "PG-13",
      "actors": [
         "Ida Galli",
         "Ivan Rassimov",
         "Luigi Pistilli",
         "Pilar Velázquez",
         "Ezio Marano",
         "Giancarlo Bonuglia",
         "Gianni Dei",
         "Franco Calogero",
         "Gengher Gatti",
         "Edilio Kim",
         "Carla Mancini",
         "Shawn Robinson",
         "Bruno Boschetti"
      ],
      "imdbMovieId": "0068272",
      "originalTitle": "Un bianco vestito per Marialé",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Marile is a little girl, she sees her father murder the two lovers and then shoot himself in the head. About 30 years later, she lives in a mansion and has mental problems. She invites a number of friends and one by one they become murdered.",
      "tmdbMovieId": 104360,
      "avgRating": 2.5,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/qs5iY0MoX3UF89nYXtPHqG6y0Xr.jpg"
   }
}