{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wisconsin",
            "id": 2024
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "veteran",
            "id": 159909
         }
      ],
      "imdb_id": "tt0038826",
      "video": false,
      "title": "Pardon My Past",
      "recommendations": [],
      "backdrop_path": "/civcNokjlfxs6FLx3BNxdbtctvy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eddie York / Francis Pemberton",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f98d9",
               "name": "Fred MacMurray",
               "profile_path": "/eARBON6ZDOo6aGKDkqLbbkHWHa3.jpg",
               "id": 4091,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Joan",
               "gender": 0,
               "credit_id": "52fe4db9c3a368484e1f98dd",
               "name": "Marguerite Chapman",
               "profile_path": "/nNo8HRmPreClbWsmZvB3AFzGgso.jpg",
               "id": 108232,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jim Arnold",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f98e1",
               "name": "Akim Tamiroff",
               "profile_path": "/24khOVoHMGhYwSHnd3QpPcv6HSP.jpg",
               "id": 30719,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Chuck Gibson",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f98e5",
               "name": "William Demarest",
               "profile_path": "/bQcQWPfKr7RLeDifSBdx4zlZGdV.jpg",
               "id": 21510,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mary Pemberton",
               "gender": 1,
               "credit_id": "52fe4db9c3a368484e1f98e9",
               "name": "Rita Johnson",
               "profile_path": "/qX0NNuYsF4eogra8VULOuPfKG9L.jpg",
               "id": 85358,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Grandpa Pemberton",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f98ed",
               "name": "Harry Davenport",
               "profile_path": "/r28I9wuqqhuMtZ0iBzoi1A74ljp.jpg",
               "id": 11502,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Uncle Wills",
               "gender": 0,
               "credit_id": "52fe4db9c3a368484e1f98f1",
               "name": "Douglass Dumbrille",
               "profile_path": "/ggD9NRWlRDofqVhVR6XaTHvLhp4.jpg",
               "id": 34748,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Stephanie Pemberton",
               "gender": 1,
               "credit_id": "52fe4db9c3a368484e1f98f5",
               "name": "Karolyn Grimes",
               "profile_path": "/oIMqgx5fUw4CSAEeRsbAMDPGqV5.jpg",
               "id": 1033293,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Plainclothesman",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f98f9",
               "name": "Dewey Robinson",
               "profile_path": "/7jbd6WBzj7mgNqTVqSraifT09UE.jpg",
               "id": 120046,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mr. Long",
               "gender": 0,
               "credit_id": "52fe4db9c3a368484e1f98fd",
               "name": "Hugh Prosser",
               "profile_path": "/lgAMk0LQBNhVvt6KlzhzD5c9oWq.jpg",
               "id": 1002057,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Plainclothesman",
               "gender": 0,
               "credit_id": "52fe4db9c3a368484e1f9901",
               "name": "Tom Moffatt",
               "profile_path": null,
               "id": 1197326,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Burch, the Butler",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f9905",
               "name": "Herbert Evans",
               "profile_path": null,
               "id": 121095,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Timothy - Chauffeur / Henchman",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f9909",
               "name": "Frank Moran",
               "profile_path": "/tDLLkATxJO8PNnGoxc0rHzrLzXZ.jpg",
               "id": 103932,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Clothes Salesman",
               "gender": 2,
               "credit_id": "52fe4db9c3a368484e1f990d",
               "name": "Charles Arnt",
               "profile_path": "/tOvsmMKqnkKHk5El289Pm1bhW27.jpg",
               "id": 34416,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4db9c3a368484e1f98d5",
               "name": "Leslie Fenton",
               "profile_path": "/4clFyyXcpcroHAGDVIFrNdGZXoM.jpg",
               "id": 95771,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "569508f29251414b78002000",
               "name": "Patterson McNutt",
               "profile_path": null,
               "id": 993086,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "569508fdc3a3680e9f002067",
               "name": "Harlan Ware",
               "profile_path": null,
               "id": 1280411,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "5695090bc3a3680ea300240b",
               "name": "Earl Felton",
               "profile_path": null,
               "id": 2089,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56950915c3a3680e9f00206a",
               "name": "Karl Kamb",
               "profile_path": null,
               "id": 109842,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a3d1ae9c3a3680b8d23ae64",
               "name": "Leslie Fenton",
               "profile_path": "/4clFyyXcpcroHAGDVIFrNdGZXoM.jpg",
               "id": 95771,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b04925141032423c6ef",
               "name": "Fred MacMurray",
               "profile_path": "/eARBON6ZDOo6aGKDkqLbbkHWHa3.jpg",
               "id": 4091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b0b0e0a264cbc246c9b",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b12925141032c241db3",
               "name": "Russell Metty",
               "profile_path": null,
               "id": 13809,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b190e0a264cbc246cac",
               "name": "Richard V. Heermance",
               "profile_path": null,
               "id": 88647,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a3d1b20c3a3680b8823c972",
               "name": "Bernard Herzbrun",
               "profile_path": null,
               "id": 29637,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b250e0a264cbe236cfd",
               "name": "Edward G. Boyle",
               "profile_path": null,
               "id": 4104,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a3d1b3192514103362420ef",
               "name": "Robert Aldrich",
               "profile_path": "/gtXt9T1l4OSQdJvX5tLgmvUTSKE.jpg",
               "id": 18392,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.283061,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 212926,
      "vote_count": 2,
      "budget": 0,
      "overview": "Eddie York (MacMurray) is mistaken for playboy Francis Pemberton and gets into trouble.",
      "similar": [
         112160,
         13,
         11007,
         333348,
         1547,
         11631,
         10830,
         40807,
         49519,
         82702,
         41630,
         1832,
         858,
         35,
         425,
         93456,
         55721,
         137106,
         212778,
         634
      ],
      "original_title": "Pardon My Past",
      "runtime": 88,
      "poster_path": "/7TPMXwjdl8NEEmzS2tqZfFLgMcB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mutual Productions",
            "id": 72024,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1945-12-24",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "It's the promise of a rare good time!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Leslie Fenton"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Patterson McNutt",
         "Harlan Ware"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038826/",
      "coverLink": null,
      "actors": [
         "Fred MacMurray",
         "Marguerite Chapman",
         "Akim Tamiroff"
      ],
      "reviews": [
         "While Fred MacMurray had always held warm feelings for the hometown where he had always been a star, regardless of his Hollywood career, he used Pardon My Past to deliver his most direct tribute to the small Wisconsin community of Beaver Dam. During MacMurray's childhood, Beaver Dam was relatively isolated at the center point between Milwaukee, Madison, and Green Bay. Before the advent of the freeway, none of these cities were any less than a day's travel one-way. So, the budding star had to make due with his limited audience, and never disappointed his hometown. Pardon My Past was the only movie MacMurray ever produced himself. It is the story of two GIs coming back to America after World War II, heading to Beaver Dam to start a mink farm. The city is made reference to no fewer than eight times, or once every eleven minutes, in the movie. Fred never forgot his roots, he never grew too far away from his home. He adored the friends he made and he loved the city of Beaver Dam up until the day of his death in 1991. He was truly a rarity from any era of Hollywood, and, speaking as a fellow graduate of Beaver Dam High School, we are proud to have called him our own.",
         "This is a movie that is incredibly enjoyable but if you think too much, then your head might explode--the plot is THAT crazy! However, if you can turn off your brain and just enjoy, then you'll have a great time. Fred MacMurray stars in dual roles--Eddie York AND Francis Pemberton. It seems that neither man knows the other exists and they are exact duplicates. The problem is that Eddie and his buddy, Chuck (William Demarest), don't realize that Pemberton's life is a mess and Pemberton had left the country owing a large gambling debt. The gambler thinks that Eddie is Francis and threatens to kill him unless he is paid $12,000 immediately! So in desperation, York locates Pemberton's mansion to try to get the money. However, as he's an exact duplicate, everyone there thinks he's Pemberton as well! The plot, though very contrived and practically impossible, the way they explain everything is actually pretty clever. Plus the film abounds with great writing and dialog--giving the actors plenty with which to work. Particular standouts in the film were Akim Tamiroff and especially sweet old Henry Davinport--who gives one of his funniest and best supporting performances. A really cute and enjoyable film--and one that should be better known, as it's exceptionally well executed.",
         "Eddie York (Fred MacMurray) and his buddy Chuck (William Demarest) fresh from the service want nothing else from life but to open a mink ranch with the dough they've saved up while doing their service. Problems pop up almost instantly when they get out, Eddie is strong armed out of his dough by a tough who says he welshed on a gambling debt that he knows nothing about. Turns out Eddie is a dead ringer for another guy who it turns out has a lot of money, a bad reputation, a complicated home life and has apparently skipped town. So starts a merry chase for both an explanation and their money. Charming little comedy with Fred most appealing in a dual role backed up by a dream cast of some of the best character actors working at the time. Catch this under-known gem when you get the chance, you won't be sorry.",
         "Fred MacMurray and William Demarest, just out of the army, are on their way to Wisconsin to start up a mink farm. Their plans change when Fred is waylaid on the sidewalk by some tough guys who insist he is somebody named Pemberton who owes them lots of money. The plot starts from there and develops into a wild tale that includes an honest bookie, a crooked uncle, an estranged wife and child, and a long lost twin. MacMurray and Demarest are both excellent. No one ever expressed sputtering bewilderment or mild-mannered outrage better than Fred MacMurray; and no one but Bill Demarest could be quite so great delivering a line like, \"Oh, get back under the house, you termite!\" (Barked at Douglass Dumbrille, the wicked uncle.) The picture also includes fine performance from Harry Davenport as the patriarch (\"I'm just the grandpa—the only Pemberton that ever did an honest day's work in three generations!\"); Marguerite Chapman as a family secretary who tries to figure MacMurray out; and especially Akim Tamaroff as a bookie with an appreciation for old books and a keen sense of fair play. Just delightful, especially for those who love great character actors.",
         "A few movies have been made over the years with double characters. They can be exact look-alikes, identical twins, or long lost, separated or unknown siblings. In a couple, the stars have amnesia and play two different lives. Of course, one actor or actress plays both roles. Most have been comedies and all of them that I've seen have been very good. I think that's probably because the various plots have been different and somewhat original. Danny Kaye played two characters in three films – \"Wonder Man\" in 1945, \"On the Riviera\" in 1951, and \"On the Double,\" in 1961. William Powell played two separate lives as an amnesiac in \"I Love You Again\" (1940). \"Pardon My Past\" is such a film. Fred MacMurray has the double role of Francis Pemberton and Eddie York. They are identical twins who were separated in adoption. Only Grandpa Pemberton knows about it, but he doesn't figure it out for quite a while. It isn't a laugh-a- minute movie, because there is a serious side to the mistaken identity here. But the several characters and roles in the plot make this a very entertaining movie. William Demarest plays Eddie's sidekick, Chuck Gibson. Marguerite Chapman is Eddie's object of romance, as Aunt Joan. Pemberton's estranged wife, Mary, is played by Rita Johnson. The several minor roles all are very good. But three more characters, played by accomplished supporting actors, add much flavor to the story. Akim Tamiroff plays the bookie, Mr. Arnold. Harry Davenport plays Grandpa Pemberton, and Douglas Dumbrille plays the villainous Uncle Wills. The plot is far-fetched as one would expect for such a film. And, it's a hoot throughout. The scenes with Mr. Arnold are hilarious. He's a tough bookie who feigns class and collects first edition books. One just can't imagine a mean guy behind the mask of his character and with his face. The scenes with Grandpa Pemberton also are very funny. There is one thing about the opening of the film that some may find puzzling. This is a 1945 movie, and Eddie and Chuck have just been discharged from the Army. Yet, the clerk in the clothing store says something about \"when the war is over.\" The war in Europe ended on May 8, 1945, but WW II didn't end until the defeat of Japan in the Pacific and Japan's surrender on September 2, 1945. So, Eddie and Chuck would have been among the European WW II vets just discharged in early summer of 1945. I was curious about their ranks and service, from their discussion in the opening scenes. Chuck commented that he was middle aged, and older than Eddie. The film isn't real clear, but there is very little insignia on Chuck's uniform. In one short flash there appear to be lieutenant's bars. He has no service ribbons. Eddie's uniform has what appear to be captain's bars, and a lapel insignia of crossed rifles, an infantry symbol. His uniform jacket's left breast has a single row of ribbons on it. If they had been pals the past two years during the war, they would have served together. So, the most likely scenario for these two would be that Eddie ended as a company commander (captain), and Chuck had been an NCO who got a battlefield commission. He likely was a platoon leader at the end. Although he talked as though he was glad to have the Army behind him, Chuck saluted an officer on the street when they left the store. That's something a career or long-time NCO might do out of habit rather than an enlisted man or officer who just served a wartime hitch. Anyway, this is a funny and entertaining film from start to finish. It makes a fine addition to a collection of actors who play double characters in the movies. Here are some of my favorite humorous lines from the film. Chuck, \"What does a mink do? Does it baaa, growl, mew or coo?\" Eddie, \"It makes more minks.\" Eddie, \"Go on, get him a hat? Why don't you try to be nice to the customers?\" Store clerk, \"I've been nice to customers for 22 years. Now I don't have to 'til the wars over.\" Chuck, \"Say, what does the Army want to give you pockets for, if you can't put anything in 'em?\" Grandpa, \"Yeah, it's you all right. The same worthless, scalawag \u0085 wine, women and song. What'd they do, run you out down there?\" Mr. Arnold, \"The man who doesn't read good books has no advantage over the man who can't read them.\" (The saying is from Mark Twain, but Arnold isn't sure who said it and mentions another source.) Mark Twain said, \"The man who doesn't read good books has no advantage over the man who can't read them.\" Grandpa, \"Oh, the doctor. That hypocritical old pill peddler. I'll out last him 10 years.\" Chuck, \"We'll call the cops.\" Mr. Long, \"Don't use that word. Mr. Arnold doesn't like it.\" Grandpa, \"Well, cut my ears off and roast 'em over a slow fire.\" Mr. Arnold, \"I simply cannot bear the idea of live people owing me money.\" Grandpa, \"Are you sure you're the same poisonous, hock-sniffing scud we had around here 'til he lit out for Mexico?\" Mr. Arnold, \"Mr. Long, this is one experience I will not forget. All this money and not one sane person in the house.\" Eddie, \"Mr. Arnold, this is robbery.\" Chuck, \"I'll say it is. You pay 5,000 for Shakespeare and only 900 for Dickens. It's ridiculous.\" Mr. Arnold, \"Is this his signature?\" Grandpa, \"Yes, that's his. When you going to beat him up?\"",
         "Despite the best intentions of all concerned, \"Pardon My Past\" emerges as a tired and tiresome comedy of errors with every player trying to make up for the lack of wit in the dialogue and absence of comic inventiveness in the plot by overplaying his or her part to the hilt. True, Dewey Robinson's bungling detective does manage to bring a touch of genuine humor to the proceedings; and even overly repetitious dialogue cannot completely take the edge off Tamiroff's smooth portrayal. There's also no doubt that Miss Chapman makes an attractive heroine. But gross overacting by most of the other players overwhelms the viewer. Unimaginative direction doesn't help. Although MacMurray has a dual role, there are no special effects, except in the one mildly effervescent shot in the entire film: The camera, tracking with MacMurray and Demarest as they flee across the lawn, picks up a cab which it follows back to the house where it closes in on MacMurray emerging. A rather neat trick certainly, and it's all delivered in the one shot without a cut. Metty's photography is consistently glossy, but other credits are undistinguished. Production values are no more than fair. Most of the action takes place in the one set. Dimitri Tiomkin composed and conducted the music score. Make-up was supervised by Otis Malcolm. The production manager was Scotty Rankin. Otho Lovering is credited as supervising film editor. (This means that he was present on the set and advised the director on camera set-ups)."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Mutual Productions",
         "Columbia Pictures Corporation"
      ],
      "summaries": [
         "Recently discharged GI's Eddie York and Chuck Gibson are en route to Beaver Dam, Wisconsin to start their own mink farm. While in New York, Eddie is mistaken for wealthy playboy Francis Pemberton and taken to see bookie Jim Arnold, whom Pemberton owes $12,000 in gambling debts. Arnold confiscates Eddie and Chuck's $3,000 savings, and demands the balance by tomorrow. Eddie and Chuck go in search of Francis to get their money back, but with Francis away in Mexico, everyone in the Pemberton household believes Eddie is Francis...",
         "An ex-GI wants to open a mink farm in Wisconsin; but is mistaken for a look-alike, a gambler who owes a lot of money."
      ],
      "budget": 0
   },
   "movielensId": 140771,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-12-24",
      "dvdReleaseDate": null,
      "directors": ["Leslie Fenton"],
      "runtime": 88,
      "movieId": 140771,
      "title": "Pardon My Past",
      "mpaa": "",
      "actors": [
         "Fred MacMurray",
         "Marguerite Chapman",
         "Akim Tamiroff",
         "William Demarest",
         "Rita Johnson",
         "Harry Davenport",
         "Douglass Dumbrille",
         "Karolyn Grimes",
         "Dewey Robinson",
         "Hugh Prosser",
         "Tom Moffatt",
         "Herbert Evans",
         "Frank Moran",
         "Charles Arnt"
      ],
      "imdbMovieId": "0038826",
      "originalTitle": "Pardon My Past",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Eddie York (MacMurray) is mistaken for playboy Francis Pemberton and gets into trouble.",
      "tmdbMovieId": 212926,
      "avgRating": 3.5,
      "releaseYear": "1945",
      "numRatings": 1,
      "posterPath": "/7TPMXwjdl8NEEmzS2tqZfFLgMcB.jpg"
   }
}