{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0348884",
      "video": false,
      "title": "Viva Algeria",
      "recommendations": [],
      "backdrop_path": "/xRMiXCraIJ88E3cJAdCC0QTP4d6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fifi",
               "gender": 0,
               "credit_id": "52fe4cadc3a36847f8239f7b",
               "name": "Nadia Kaci",
               "profile_path": "/vG3mwaoEIQ7STVmQaEUGKfKozmf.jpg",
               "id": 267918,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Goucem",
               "gender": 1,
               "credit_id": "52fe4cadc3a36847f8239f7f",
               "name": "Lubna Azabal",
               "profile_path": "/lGvB2xP7sotwSslSTovL5nxnzBC.jpg",
               "id": 77498,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Papicha",
               "gender": 0,
               "credit_id": "52fe4cadc3a36847f8239f83",
               "name": "Biyouna",
               "profile_path": "/qrWf0lGbQWATrpi18ch0NWT5aU5.jpg",
               "id": 583230,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4cadc3a36847f8239f89",
            "name": "Nadir Moknèche",
            "profile_path": null,
            "id": 1149008,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.152876,
      "production_countries": [],
      "id": 167284,
      "vote_count": 3,
      "budget": 0,
      "overview": "This movie portrays three women living in today's Algeria between modern society and Islamic fundamentalism, self-determination and dependence. Goucem, a young woman who works for a photographer and mistress of a rich doctor, her mother Papicha, a former cabaret star, and her best friend Fifi, a prostitute, all live in a hotel in the city center of Algiers. Their difficult personal situation and the growing influence of Islam lead to dramatic consequences...",
      "similar": [],
      "original_title": "Viva Laldjerie",
      "runtime": 113,
      "poster_path": "/i6EMvEx0MM14tJ7LXbnqcO2cJ7P.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nadir Moknèche"],
      "runtime": 113,
      "synopsis": null,
      "writers": ["Nadir Moknèche"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0348884/",
      "coverLink": null,
      "actors": [
         "Lubna Azabal",
         "Biyouna",
         "Nadia Kaci"
      ],
      "reviews": [
         "The story of Goucem, a 27-year old Algerian woman, who works days at a photo shop and is involved in a long-term, dead-end affair with a doctor and her mother, played by Biyouna, who is an ex-cabaret dancer/singer and fears the Islamists after years of bloodshed and turmoil in Algeria during the 90s. Having been displaced from their home (perhaps after Goucem's father's death? or maybe as a result of the Islamists/government corruption?), she and her mother are living in a residential hotel with a mixture of people including a family with young kids and a prostitute. There are a variety of scenes of Algiers and peeks into different types of life. Goucem's life seems routine, working, dating the doctor, going to clubs meeting men and flirting with a recurring neighbor. Through sad events in the film, she discovers many things about what she really wants from life. This film contains quite a bit of nudity and swearing, my Algerian companion at the screening said because of that type of content it will PROBABLY NEVER be screened in Algeria. (HOWEVER... I HAVE SINCE LEARNED THAT IT HAS BEEN SHOWN IN ALGERIA... TIMES ARE CHANGING, my companion at the US screening has been here since 1989 and has only returned to Algiers once in 2002) The comparison to Almodovar (of Spain) that I read somewhere is warranted, I see the similarities. Understanding the historical underpinnings of the 90s and current day Algeria would aid in understanding, and more importantly not MIS-understanding the movie. The movie, although dark in general ends with a glimmer of hope for better times for the some of the characters, but just a glimmer.",
         "I just watched \"Viva Laldjerie\" at the Cine-Club in Algiers. The crisis of the 1990s took a heavy toll on Algerian cinema. Happily, the past couple of years have witnessed a re-emergence, of which Viva Laldjerie is an auspicious example. Set in the Algiers of today, the film tells the story of three women: Papicha, a former cabaret star who dreams of getting back into the business; her daughter, Goucem, an independent spirit working for a photographer and carrying on an affair with a married man she's beginning to suspect wants to leave her; and Fifi, a prostitute who thinks she's got it all under control now that she's found a powerful \"protector.\" Director Moknèche's great achievement is to show how beyond the bright lights, bustling city streets and modern urban architecture there's the sense of a country, of a people, that feels spent and exhausted from the constant threat that the violence that crippled Algeria for almost a decade might once again return. Yet, as the stories of these three women show, resistance can take many forms. In response to previous comments, I am surprise of the level of ignorance of the Arab World. you can watch many different movies in Algeria. I have watched \"Emmanual\" in Oran The RAI music contains swearing and even blasphemous and you can hear it in chafes, bars etc..Just for your information Algeria is the first wine producer in the world after the Romans, it will help if you know a bit about the Arab culture, for example read about Abu Nawas and Al-Rubaiyat",
         "This is the type of film that I would love to love. The cast are remarkable - Lubna Azabal and the actress that plays her mother in particular. The subject is a complete reversal of what one would expect of Algeria. It's also a film with very strong female roles. So in theory, everything is in place to make an explosive combination. So why does it drag so much? \"Viva\" is curiously dispassionate, despite the best efforts of the cast. Longish midrange shots film the actor's movements, without letting us get into their heads. We understand what they are doing and why, without really becoming involved. With a firmer hand, this could have been an explosive story, à la Almodovar. As it is, I get the feeling it's a great script and cast being put through the motions. I also have to add a word about the highly distracting plinkety-plonk piano music that adds to the lethargic direction. I presume the director wanted to avoid Arabic music to avoid clichés. But puh-lease! This sounds like a low-budget auteur chamber soundtrack when what was needed was something to drive us towards the next scene.",
         "The shifting of political power affects our lives more than anything else in the world. And being trapped between two ruthless forces and the shifting political powers makes it almost unbearable for characters of this touching movie. Being a women in Islamic world was always, to put it mildly, hard, but these days of increasing Islamic fundamentalism bring even more hardship. Algerian women must have it particularly hard after a long period of secularism and opportunities for carrier and fulfillment. \" Viva Laldjerie\" is a brave and concise movie that poses many questions. It doesn't give many answers, mostly because in the shaky times we live in, the outcome is unknown.",
         "What a moving portrayal of the human struggle, and the very real costs of that struggle, that occurs for so many today as the result of the cultural schizophrenia in places like Algiers and throughout the Muslim world. Just as so many of the economic and technological benefits of Western culture have begun to penetrate these countries enough to affect the daily lives of most people, radical Islamists enter the scene en force as a reaction against the political ideas and social freedoms that so many also wish to participate in. And much of the ordinary population is caught up in the confusing and dangerous middle ground. Each of the four primary female characters in this film embody the split personality that *is* the Muslim world today. Each one navigating between desires and ambitions born from her sense that it is permissible to dream of freedom and happiness--however that is symbolically represented for her in her visions of a self-defined destiny...............yet each also struggles against the curbs placed on that freedom and self-determination by the culturally-shrinking society that surrounds her. In the film this is wonderfully portrayed in the stark difference between the public and the private spaces in which the characters function. This is most obvious in the costuming, as the women cover themselves completely whenever they go \"out\" (ironically, making them anything but \"out\") and uncover when they are inside. But this difference is also portrayed in the interaction between the main characters themselves, as though the traditional clothing in which they are hidden also creates a wall between them--and it is only inside, when they have taken off those coverings, that they can relate on an intimate level. There are crucial - and painful - moments of crisis in the film when these separations break down: bringing the psychic walls of coveredness into the private realm, or being exposed and uncovered in the public realm. And in these moments, we see that things start to break down in the lives of the characters. This also is a continuation of the metaphor: for those living in the schizophrenia of the Muslim world today, who attempt individually and societally to simply put the modern Western world in one compartment and the tug of Islamist fundamentalism in another, who attempt to simply switch costumes while going from one to the other -- such a way of living, such a way of being eventually has to break down. The film does not attempt to resolve this problem, but merely to set it before us. On the way to its conclusion there is great tragedy, minor redemption, and a possibility of some vague hope. Let us also, as the audience, dare to posses some hope for a future resolution in the Muslim world.....one that does not take such a toll on the women who live their lives within it.",
         "A sad story about contemporary Algiers. Goucem (Lubna Azabal) works in a camera shop, sleeps with a married doctor who won't leave his wife to marry her, lives with her mother Papicha (Biyouna), a former dancer now widowed and safe after being harassed by fundamentalists, and in her spare time goes clubbing. The story turns when she pilfers a gun from the coat pocket of a detective visiting her friend Fifi (Nadia Kaci), an upbeat, merry prostitute, and his anger ends in her death. Meanwhile, Papicha discovers a club for people who used to love the old Algerian nightlife, and returns to sing. Goucem's lover marries another woman, and she is heartbroken\u0097but Fifi's death is worse. But she does manage to treat the gay son of the inconstant doctor humanely, and at last she returns the interest of a young man who's been following her. In a way it's upbeat after great sadness, and it deals with the life of women at the edges of absolute power. This is secular Algiers, but Goucem and her mother were driven from their original home by fundamentalists, and the police can kill a whore with impunity. This compounds the sadness.",
         "What was Goucem(Lubna Azabal) thinking? Goucem and Fifi(Nadia Kaci) probably have an open door policy, being close gal pals and all, but when Goucem steals a gun from one of Fifi's johns, her presence in Fifi's apartment becomes a matter of breaking and entering. When Fifi turns up missing, Goucem goes dancing. And when she turns up dead, \"Viva Laldjerie\" never makes clear if Goucem feels directly responsible for her friend's death. She's a smart girl. On some level, she must've understood that there'd be ramifications when you lift a man's gun. Goucem killed Fifi. The question remains: Was it intentional? The tears that Goucem sheds at the ID'ing of Fifi's body must be remorse, but the film is missing that moment of explicit recognition that her actions had a direct correlation with Fifi's disappearance. Does Goucem share her mother's abhorrence for hookers? That would be hypocritical on Goucem's part since she's an adulterer, and mom, an exotic dancer. In \"Viva Laldjerie\", Islamic fundamentalism is coming to Algeria. In the upcoming years, it's going to be harder and harder to be a woman; harder still, if you have a friend like Goucem, whose hijab(Muslim head dress) must be so tight, all the blood was drained out of her head. That hijab doesn't flatter any woman, especially Papicha(Biyouna), Goucem's mother, who transforms herself back into a sensuous woman, an incarnation of yesteryear, when she was a dancer at a night club and her hair flowed unencumbered by ideology. The tragedy of Fifi's death is the obviousness of the situation that these, and all women, face in a country whose rules were composed by men. The ladies should stick together, one for all, and all for one. But Goucem is a slave to love. Maybe she stole the gun in order to shoot her lover. Whatever the reason, Fifi is in a box.",
         "I found this movie pretentious and lacking believability. For one thing, I was turned off by the fact that the language of choice was French although the story is in Algeria and the characters are Algerians. I would understand this if the story was about Algerian immigrants or second generation Algerians in Europe, but that is not the case. I do not understand French or Arabic either way, but I found it bizarre, as if the director/producers shied away from Arabic to appeal to French speaking crowd for commercial reasons. The character development is also quite weak here, even for a slice-of-life movie. The director seems to be under the impression that leaving many bits and pieces unconnected would intrigue the audience, but I found it simply annoying. There is a back story for the Goucem's (main character) mother (Bouyane) to be seriously afraid from fundamentalists and you know it has something to do with her past as a singer and dancer, yet you do not have hint of what really happened. They talk about terrorism of the Islamists, but that also does not develop into anything, even as a few scenes in the backdrop. What about the character of Samir? He seems to be infatuated with Goucem, yet we never know why and how it started. Let's get to the guys who went after Goucem's neighbor Fifi, what is their real motivation? There is a difference between intrigue and leaving a lot of stuff up in the air, and I think the director ended up doing the latter. Finally, let's look at the acting. I do not think they were believable as Algerians living in Algeria. Other than the way the characters dressed, I really could not see the 'Algerian' touch here! I like watching international movies, always hoping to see something that is new, or seeing something through a different point of view, but I simply felt cheated watching this movie.",
         "I was curious about this film, as it's about several women in modern day Algeria. Unfortunately, the story itself never caught my interest--mostly because the film felt more like a dispassionate film made by a documentarian instead of a full-length story about people. The bottom line is that I didn't care about these people nor their seedy lives. The film is about three women: Goucem, a very screwed up young lady who's been having an affair with a married man for three years, Papicha (Goucem's mother) who is an ex-prostitute and Fif who is currently a prostitute. Their problems and concerns never really registered with me. What I found interesting about the film was actually not the story (I didn't like it at all) but the views into modern Algeria. Though a Muslim nation, I was surprised at the nudity (it was graphic) and the very secular nature of the characters and situations. It flies in the face of stereotypes of Muslim nations--giving us a fuller view of the various facets of life and attitudes. But this, unfortunately, was not enough. The story left me amazingly cold and bored.",
         "First I lived in Algeria as a child from 63-66. I was very curious about this movie and how things had changed. I am also a pretty good judge of how authentic it is. The story revolves around Goucem a 27 year old single woman and her mother. Key to the plot is a prostitute Fifi, they all live in Pension Debussy a hotel in downtown Algiers. (We lived in a hotel not a block away in 1963.) Goucem is involved in a no win relationship with an older married man--her mother lives in her past when she was a dancer and the prostitute--well--turns tricks. The point of the movie is to show what contemporary life is like on the ground in Algiers with emphasis on women. Islamic fundamentalism is background thunder. First, I was surprised that French would still be so widely used--one would have thought Arabic after 50 years of independence would have largely displaced it. Algiers looks weatherbeaten and somewhat run down---everything from the phones to the buildings look like they have not been modernized much if at all since 1962. They show the wear and their age. Still I much prefer the old buildings to modern stuff. There appears to be population pressure--lots of traffic and people everywhere. Algeria's economy despite its oil money it has not prospered as it could have--also the schism between the Islamists and the secular populations was devastating amounting to a civil war. There is reference in the movie of things like the water being on only every 3 days--life is poor and rather difficult for most. And with religious orthodoxy flexing its muscles things are getting more restrictive. I think the movie probably exaggerates the current Frenchness of the population.--playing boules? wearing mink coats? Of course the native Algerians have assumed the middle class roles formerly held by Europeans and along with that the mink coats still.... The movie was very nostalgic for me and I gave it an 8. However it drags the last hour...especially the endless scenes with the mother. It is worth a watch for anyone although probably a 6 is about the right rating. RECOMMEND"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BL Prod.",
         "Gimages",
         "Sogécinéma"
      ],
      "summaries": ["This movie portrays three women living in today's Algeria between modern society and Islamic fundamentalism, self-determination and dependence. Goucem, a young woman who works for a photographer and mistress of a rich doctor, her mother Papicha, a former cabaret star, and her best friend Fifi, a prostitute, all live in a hotel in the city center of Algiers. Their difficult personal situation and the growing influence of Islam lead to dramatic consequences..."],
      "budget": 0
   },
   "movielensId": 140717,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-01-01",
      "dvdReleaseDate": null,
      "directors": ["Nadir Moknèche"],
      "runtime": 113,
      "movieId": 140717,
      "title": "Viva Algeria",
      "mpaa": null,
      "actors": [
         "Nadia Kaci",
         "Lubna Azabal",
         "Biyouna"
      ],
      "imdbMovieId": "0348884",
      "originalTitle": "Viva Laldjerie",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "This movie portrays three women living in today's Algeria between modern society and Islamic fundamentalism, self-determination and dependence. Goucem, a young woman who works for a photographer and mistress of a rich doctor, her mother Papicha, a former cabaret star, and her best friend Fifi, a prostitute, all live in a hotel in the city center of Algiers. Their difficult personal situation and the growing influence of Islam lead to dramatic consequences...",
      "tmdbMovieId": 167284,
      "avgRating": 3.25,
      "releaseYear": "2004",
      "numRatings": 2,
      "posterPath": "/i6EMvEx0MM14tJ7LXbnqcO2cJ7P.jpg"
   }
}