{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "fairy",
            "id": 2710
         },
         {
            "name": "birthday party",
            "id": 5732
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "growing up",
            "id": 9825
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "wasp",
            "id": 14793
         },
         {
            "name": "candle",
            "id": 15224
         },
         {
            "name": "former best friend",
            "id": 41368
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "sweet sixteen",
            "id": 177804
         },
         {
            "name": "best friends in love",
            "id": 178329
         },
         {
            "name": "wishes come true",
            "id": 187084
         },
         {
            "name": "high school rivalry",
            "id": 189964
         }
      ],
      "imdb_id": "tt1646876",
      "video": false,
      "title": "16 Wishes",
      "recommendations": [
         89185,
         44244,
         19458,
         26736,
         35558,
         65218,
         81440,
         13655,
         81250,
         74018,
         50479,
         18126,
         60803,
         60405,
         59860,
         61717,
         84105,
         15157,
         49350,
         27621
      ],
      "backdrop_path": "/wsHpvHi9pWhMX6azueyqnGHltEH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Abby Louise Jensen",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc265",
               "name": "Debby Ryan",
               "profile_path": "/bGLpPeIyYd4HN3QLusrK8l0ZVnZ.jpg",
               "id": 123846,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc283",
               "name": "Jean-Luc Bilodeau",
               "profile_path": "/6bRMvFaB8Dk62X6Hl1gj0sB3WGX.jpg",
               "id": 205204,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Logan Buchanan",
               "gender": 2,
               "credit_id": "53c3f7b9c3a3684ce900a098",
               "name": "Keenan Tracey",
               "profile_path": "/tQyMehFUHOnUC8cfJD75UxOHVku.jpg",
               "id": 219998,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Celeste",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc27b",
               "name": "Anna Mae Routledge",
               "profile_path": "/6VuUB4yfIPHMkpxIs94jCJgUj6H.jpg",
               "id": 143329,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sue Jensen",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc27f",
               "name": "Kendall Cross",
               "profile_path": "/js2mIcx5lZu6P4D3z6hYZqNFPCx.jpg",
               "id": 59185,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bob Jensen",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc28b",
               "name": "Patrick Gilmore",
               "profile_path": "/eFF14MQnjRxkxXEOENrQ50xO5up.jpg",
               "id": 76828,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Krista",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc287",
               "name": "Karissa Tynes",
               "profile_path": "/oIZnMZ8xCXdzLHVTAzfTbLMVGXV.jpg",
               "id": 144853,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Fashionista 1",
               "gender": 0,
               "credit_id": "52fe4586c3a36847f80cc28f",
               "name": "Jenna Romanin",
               "profile_path": "/AuPDjIor5jN2fQedcNislXptr4q.jpg",
               "id": 233264,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc26b",
               "name": "Peter DeLuise",
               "profile_path": "/78lmcrrIPEJ4WrlGBRzVpqXq7J2.jpg",
               "id": 118463,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc271",
               "name": "Annie DeYoung",
               "profile_path": null,
               "id": 108784,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc277",
               "name": "Ron French",
               "profile_path": null,
               "id": 77208,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.396849,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40205,
      "vote_count": 375,
      "budget": 0,
      "overview": "The story about Abby Jensen, a girl who's been eager to reach her 16th birthday and has kept a secret wish list since she was a little girl. When the Big Day actually arrives, utter disaster strikes, leaving Abby to think her birthday is ruined. But when a mysterious box of magical birthday candles arrives to turn things around, Abby's 16 Wishes start to come true. Her day gets better and better...until she makes one wish that threatens to change everything.",
      "similar": [
         85350,
         449176,
         44683,
         133805,
         4951,
         2108,
         674,
         277217,
         10882,
         10895,
         10229,
         10693,
         9880,
         201676,
         86130,
         11355,
         43923,
         325189,
         308369,
         286565
      ],
      "original_title": "16 Wishes",
      "runtime": 90,
      "poster_path": "/7EmxxTry7JAqFogSl0TNWLyMrx2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Marvista Entertainment",
            "id": 6679,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Disney Channel",
            "id": 3213,
            "origin_country": ""
         }
      ],
      "release_date": "2010-06-25",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Everyone's sweet 16 is special, Abby's is magical.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter DeLuise"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Annie DeYoung"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1646876/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMDVlMTc2YzctN2YwNC00NDk0LTljOWMtOGU0ZDg1N2UxNzVhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTEwMTkwOTI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Debby Ryan",
         "Jean-Luc Bilodeau",
         "Anna Mae Wills"
      ],
      "reviews": [
         "Another Disney made for TV movie...trying to promote its' young stars. The actress this time is Debbie Ryan..who is apple fresh and glowing..and fairly talented too. She has been on another of Disneys' TV shows..\"The Suite Life On Deck\"..and now she gets a shot at becoming a major Disney star. The movie is typical Disney fare..the main character is faced with a major problem..seeks to find a way to fix it..and somehow manages to mess things up...because she was too greedy and wanted to be someone other than who she was. She then gets a second chance to fix things back to normal..and finally, she does...learning a lesson in the process. All is saved and everyone goes home happy. It is predictable as all things Disney are when it comes to movies..but kids should enjoy it..especially pre teen and teen girls. Fairy tales do come true...and while real life is not quite like this...it is fine family fare. The only thing I had a problem with is that I wish they would stop stereo-typing the characters so much. :)",
         "With an all north of the border cast, The Suite Life On Deck's Debby Ryan gets to star in a Disney Studio production of 16 Wishes. The number of course is to correspond with the sweet 16 she has become. Though the sweet sixteen experience is a female one, I think even the male of the species could come up with sixteen things that could be considered pretty frivolous that one might have wished for at sixteen. Somethings you wouldn't wish for at even 26, let alone 66. Which is the lesson Ryan learns. She's planned out her sixteenth birthday party and even though the day starts out horribly when wasps are discovered to be making a nest in the unused attic of her home, she gets those 16 candles from a 'magical person' played by Anna Mae Routledge. Sure enough as is the usual way of things in film and life, granting those wishes that she's laid out for herself doesn't make her a happier camper. 16 Wishes is a charming fantasy from that fantasy factory the Magic Kingdom. Debby Ryan is a sweet and talented young lady and she really does hold the film together. Nothing spectacular, but a nice family comedy and it does once again reinforce the old adage about being careful what you wish for.",
         "Disney Channel goes back to it's simple roots!!! well kinda. Girl has 16 wishes on birthday, wishes for stuff, wishes go wrong,she realizes she was selfish blah blah blah, you know the rest. Not the most original, but still. This movie reminds me of all those 90s and early 2000 movies I loved as a kid. No singing or dancing or Hollywood or kid wanting to be famous or anything. Not a musical, not a movie with pointless jokes, just a really nice family movie, the kind we all miss. Well, Debby Ryan sings a song at the end, but that's it. And it was actually pretty good. By far one of the better Disney channel movies to come out in a while. If they continue with this stuff, good things will happen. Maybe the age of Hollywood crazed kids is finished. Maybe there's still hope. Maybe.",
         "Funnily enough i enjoyed this movie quite a lot. a lot of people say its a typical Disney film. heres a fun fact. Disney didn't make it. Marvista Entertainment did, Disney just paid for them to run it on Disney (Most likely cause of there main actress) Now when you step into a movie like this, you can be all i will see if this movie is good for ME and MY AGE! Because its not aimed at your age sometimes. This is a tween/teen/kids film. If your a adult, you probs wont like it much, if your a teen whos into grown up movies. You wont. You have to think of this as what it is to enjoy it before you begin to judge it. I went into it fully prepared. aware it was a children's film intended for kids. and i loved it! The main actress Debby Ryan showed much potential. She had some fun scenes. and some sad scenes, which showed she could vary her person. Always a good thing to have. The moral of the story and the overall story is one we may have heard before. \"Be grateful what you got,\" \" a girl wants to be older then regreats it\" Sure we can say we've seen it all before. But you haven't. There was some supprising twists of originality in this film i just loved! Overall itsa really good film for the family, and for sleepovers for girlies. :)",
         "As an older brother to a younger sibling who frequents Disney Channel fare, I often sit down with her to watch certain Disney movies/shows. Some I enjoy, while others (like this one) are just a bit too contrived/silly to draw in anyone but the youngest of viewers. For a basic plot summary, \"16 Wishes\" tells the 16th birthday story of Abby Jenson (Debby Ryan). When her big day gets off on the wrong foot, Abby is granted 16 b-day wishes by a magical being. As the wishes mount, Abby begins to realize what a 16th birthday really SHOULD be all about. In pretty much all cases, current Disney fare walks the fine line between charming and cheesy. The good stuff (e.g. High School Musical, Wizards of Waverly Place) stay charming, while the others descent into contrived silliness. In this case, the storyline is just too predictable to ever really suck you in. On a more positive note, the acting in this film is very watchable. Ryan may just be the next big Disney star (for better or worse), while Jean-Luc Bilodeau (of Kyle XY fame) nearly steals the show as Abby's best friend. The \"villain\" of the story is way too over-the-top, but other than that the characters are quite well done. Basically, this is a flick for younger children (no questionable material) and the earliest of pre- teens. Viewers of any older age will realize the silliness and tune out before reaching the finale.",
         "Where should I start with this one well I can tell you what its about. The movie tells the story of a young girl named Abby(SUITE LIFE ON DECKS DEBBIE RYAN)who is celebrating her 16th birthday. One day a strange woman comes into her life and some strange stuff start happening. She gives her magic candles that will make all her dreams come true from her wish list that Abby made. Every wish works for an hour but when its midnight all her wishes are permanent. So when she wishes to be treated like a grownup she ends up as a 22 year old and of course she tries to change her wishes but is it too late. The whole film is like 13 going on 30 as the lead actress is kinda like Christa B Allen. Its so pointless and rather weird from time to time. If you like movies that makes all your wishes come true but you sometimes have to be careful with what you wish for then be my guest.",
         "I recently watched 16 wishes for the like 8,000,000th time. I wanted to notify you about this. I know the directors and actors worked very hard on this movie and (Even though it may be overplayed) i admire it. Debby Ryan nailed it. YES! This movie may have its problems.. but it definitely deserves a better rating. I especially love the ending. Debby( Abby) learns that she should not take life for granted. She was very greedy and took advantage of everyone. This movie is fairly simple although sort of predictable. It is still a nice family movie with no stupid jokes and a lesson that some people can relate to. I still do not understand why ALL Disney movies are based on teens and not kids, but who cares! Its fun!",
         "It's difficult to like a movie when you barely care about the characters. The plot of this movie isn't original, but I did enjoy it the first time I watched it (10 years old). Personally, I find Abby's character to be a bit pretentious. She has an \"I'm so special\" attitude about her that makes me bored. When she has the candles she seems to only think about herself and lets the power get the best of her. It's not just Abby though. Most of the girls in this movie annoy me with their \"Teen girl\" screams over clothing and boys. This movie contains many other cheesy predictable moments. I will say that I was a bit surprised in the way she gets her life back and I like the \"villains\" origin. The reason Jay is my favorite character is because he sticks by Abby even when she's acting this way. He is the voice of reason that Abby refuses to listen to. The message is good though; Don't grow up too fast.",
         "16 Wishes was a good family movie. Predictable plot, but nice twists. I like how we got to understand a few layers beneath the surface with the antagonist and protagonist. Once their differences and true root issues beneath the obvious feud were revealed, we along with the characters could go down a bold path. Empathy, diversity, seeking forgiveness, releasing hatred, and freeing both people in the process. An above average lesson in movies typical of this genre. Kudos to the author, Annie. If you watched the behind the scenes Blogs and video footage at the end of the movie, you could tell that the cast and crew had fun on set. That energy translated on camera as well. Kudos to Peter DeLouise as director for creating and protecting the atmosphere that translated into the movie. An outstanding performance by an underrated rising Disney Star in Debby Ryan. Although it was not a high school musical or camp rock type movie, music and artistic expression were plentiful. The majority of the cast and crew were not from Hollywood, but from Canada. A lot of budding talent there. While we are on the topic, the sad montage turning point scene was delivered heartfelt genuine emotion reflecting a true range of acting contrary to Ryan's role as Bailey Pickett on the light hearted over the top Disney comedy Suite Life on Deck. Also the reconciliation scene between Abby and Krista was honest and believable. Music was subtle but on target. The sixteen year old Ryan wrote the sad montage song \"open eyes\" and sang it with her brother spoken from the advice she would give Abby if they were friends. The lyrics and hook are apropos, as well as insightful and wise for a 16 year old Disney comedic actor. The fun upbeat \"A wish comes true everyday\", which was performed in the music video by Debby Ryan kept to the innocent family friendly theme while launching Youtube videos galore of young girls wanting to recreate the fun. Jean-Luc was talented and understated enough for the chosen medium. Not only was he cute, but the chemistry between him and Debby translated as authentic true friendship that many a teen hopes to grow into something more. Anna May was the best modern version of the magic creature. The promotion was very limited and only 6 weeks or so out. I did not see any posters in malls, radio adds, etc. Contrast that with the Camp Rock II consisting of multiple top Disney stars and big names, it had a year long marketing on-slot in magazines, radio spots, interviews, merchandise, posters, billboards, malls, multiple Web Presents, Disney Channel commercials network and Nick channel commercials, etc. That's show business. But from a business point of view, 16 Wishes drew 5.6 million viewers with only one rising Disney star (Debby Ryan) and a 6 week minimal marketing campaign still returned multiple times more on the movie's investment than did Camp Rock II drawing 8 million viewers in exchange for its much higher budget, star power of 10 or so big names, and year long marketing campaign. All in all, a great family friendly movie with much opportunity to spend time with the family, laugh, cry, and sign together, and did I mention discuss life lessons in the movie and generate dialog with your teen about relevant things in their lives.",
         "I saw 16 wishes without any expectations. It was just a typical day for me to watch random movies that were on. I started watching and on the beginning, it was kinda cheesy. The main girl basically wants what all the average teenage girls do - Privacy,popularity,being independent. etc. This movie was not very creative. The story line is just too familiar. I can't even mention how many more movies have the similar plot- almost exact actually. The scenarios always goes like this- The character wants something more and or something to change in their life. They get a chance to make a wish whether from a fairy or genie etc. It goes all perfect then something goes terribly wrong.. Then they realize they want their old life back. In the end, they basically appreciate everything they originally had. This movie was funny and enjoyable though. The acting was good except for the main girl's parents. I give this movie 6 stars for some really good acting and a funny plot.This is a pretty good film, but not if you're in a mood for something unpredictable and realistic.",
         "Such a spoiled brat. I was wishing her parents had spanked her. The cast was okay, but the acting was pretty bad. I wanted to see this because of Jean-Luc Bilodeau because he was so great in Kyle XY, but this certainly couldn't have helped his career much. I wasn't expecting a masterpiece, but I generally really like high school movies and TV shows. But this is a stinker. Wow, 10 lines is a lot for bad movies like this. Without giving away any plot points, all I can really say is that it's a ridiculous movie with a great cast but a terrible script and bad acting. I won't waste my time watching this one again. I wouldn't recommend this to anyone, and I only hope Mr. Bilodeau will be more discerning in the future about the roles he chooses. Wait a minute. Someone compared this to 13 going on 30? That's a pure insult to Christa B Allen and Jennifer Garner!",
         "It got off what (to me) seemed like an awkward start. Maybe \"Sweet 16\", where you're given a car, get your driver's license, and a big party is just a girl thing. I remember seeing my 16th birthday as the end of childhood. Time to get ready for adulthood now. And at first this movie was exactly like a fairy tale; where the poor, neglected, downtrodden girl finally blossoms into a beautiful princess who gets everything she's ever wanted through no effort of her own and is adored by everyone. I had to pause the movie several times because I kept thinking \"This girl has her own room, a loving family with a nice house, friends. So why does she keep feeling sorry for herself and keep wishing her life would just be magically perfect? Then they turn the tables and grant her wishes. She gets the life she's always wanted, but it doesn't turn out the way she thought. By the end she realizes she has a lot of growing up to do, and a lot to be thankful for."
      ],
      "genres": [
         "Drama",
         "Family",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Unity Pictures Group",
         "MarVista Entertainment"
      ],
      "summaries": [
         "A 16-year-old girl prepares a list of 16 wishes for eight years, hoping they will come true on her 16th birthday. A fairy comes to give her 16 candles that make the 16 wishes come true. Her wishes go the wrong way and are permanent when midnight comes. She has one final wish to reverse her previous wishes.",
         "Shy Jay Kepler (16) always helps his classmate and neighbor Abby Jensen, whom he has a serious crush on, even in her bitter rivalry with rich neighbor and classmate Krista Cook. Against jay's warnings, Abby greedily accepts from fairy Celeste and uses hourly 16 wish candles to make come true her sweet sixteen wish list on the big day, which started miserably with a wasp plague rendering the Jensen house inhabitable. Although each comes true, the crucial ones backfire big time, robbing her of all that really matters. However in the process she comes to appreciate and reevaluate, just in time for a last chance twist."
      ],
      "budget": 0
   },
   "movielensId": 140747,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-06-25",
      "dvdReleaseDate": null,
      "directors": ["Peter DeLuise"],
      "runtime": 90,
      "movieId": 140747,
      "title": "16 Wishes",
      "mpaa": "G",
      "actors": [
         "Debby Ryan",
         "Jean-Luc Bilodeau",
         "Keenan Tracey",
         "Anna Mae Routledge",
         "Kendall Cross",
         "Patrick Gilmore",
         "Karissa Tynes",
         "Jenna Romanin"
      ],
      "imdbMovieId": "1646876",
      "originalTitle": "16 Wishes",
      "genres": [
         "Fantasy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["sYB7zfkOd7c"],
      "plotSummary": "The story about Abby Jensen, a girl who's been eager to reach her 16th birthday and has kept a secret wish list since she was a little girl. When the Big Day actually arrives, utter disaster strikes, leaving Abby to think her birthday is ruined. But when a mysterious box of magical birthday candles arrives to turn things around, Abby's 16 Wishes start to come true. Her day gets better and better...until she makes one wish that threatens to change everything.",
      "tmdbMovieId": 40205,
      "avgRating": 3.18333,
      "releaseYear": "2010",
      "numRatings": 30,
      "posterPath": "/7EmxxTry7JAqFogSl0TNWLyMrx2.jpg"
   }
}