{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 270,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0830361/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BOTIzODYzNzMtZTE1ZS00MWRkLThhMTUtYzU4N2M0MDExZTI0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "Peter Krause",
         "Julianna Margulies",
         "Peter Jacobson"
      ],
      "reviews": [
         "This mini-series is quite original and I found it very entertaining. The idea is pretty wild and far fetched but they make a lot out of it. As with so many mini series the first two episodes are better than the 'conclusion' which really only sets possible future episodes up. That being said, this is the best thing I saw on TV this year. The lost room reminds me of 'Dark City' with the surreal reality that it creates. I also liked the fact that ordinary items, or 'objects' are used as props to advance the story in a very cheap yet efficient way. The production value is good and the atmosphere created is very convincing. The acting is great for a TV production and I wouldn't mind if 'The Lost Room' would be picked up for a full season.",
         "I am, I repeat, UTTERLY fascinated with the puzzle which is the premise with this new SCI-FI series. It appears that SCI-FI Channel is finally listening to us and providing real Science Fiction instead of just empty space adventures and endless streams of mindless exercises in bad horror. The central protagonist, Joe Miller, who is excellently played by Peter Krause, introduces a deftly played brave-smart-everyman quality to this thriller which brings us quickly into the story. Kevin Pollak shows his true colors early as a fine actor playing the cool-mob-type bad guy. Dennis Christopher brings a brilliant, oddball weirdness to his role as the volatile, confused dreamer, Dr. Ruber. But everyone and everything is not what they/it seem(s). And I won't spoil any of the plot line for readers. Suffice it to say, this is a gem in the making. If all possibilities are to be developed as I think they should be, this is going to be one to remember. Facts are not revealed all at once as in the end of an Agatha Christie mystery. You are not given great big chunks of them but: piecemeal and as far as I can tell this early - not without their own internal mysteries. You have to only guess what is coming next, and when it comes, something else is brought into the fold which skews or distorts what you first believed. So far the sophisticated viewer's collective intelligence has not been insulted or compromised. This is very good writing. It does not rely on special effects for the mystery. The mystery is in the story, the way it should be. Let's keep it this way! I am hooked. I hope it lasts....as a series! Bravo SCI-FI!",
         "I am thoroughly enthralled by what this show has to offer. I had the benefit of catching a repeat of the first few episodes back to back, and I am hooked beyond belief. What stuns me is that everything seems to have a purpose behind it. At first, it appears to be an adventure that is random for the sake of being random. However, as the show unravels, there is a strange sense of mystery that would make Sir Arthur Conan Doyle proud. Shows like Lost have failed to grab my attention simply because I felt as if the writers were trying to make a 5-show plot thread last for fifty. To be honest, I don't believe I've been this hooked on a show since Firefly. The main character could have easily been played by Nathan Fillion to the same effect of character. I hesitate to make any more comparisons; I'd hate for people to think this show is a hybrid of this or that. Something about it makes it completely unique. I'm looking forward to where this show goes. I actually believe that history will remember this show as a benchmark for things to come.",
         "Though I like fantasy and SF, I have to admit to being fondest of rule-based fantasy, like that of Tim Powers -- as a reader or viewer, you have an idea of what's possible and impossible, despite the supernatural elements of the story. Fantasy without rules is far less satisfactory, since characters in those stories can do whatever the writer arbitrarily decides they can do (or can't), and as a result, the writing is lazier. \"The Lost Room\" is all about rules and the characters who find creative ways to abuse them. (Tim Powers fans would like it, I'm sure.) The writers have come up with cool supernatural powers for a host of innocuous looking objects (combs, pens, cards, bus tickets, watches, a key, etc.) Each object has a power and rules to govern them. Many of the powers don't seem that nifty, until you see how creatively they are used. And, along those lines, virtually every scene contains a fun, \"Hey, that's a good idea!\" move, and they tend to come at you faster than you can anticipate them if you aren't taping the show and hitting pause. What's best about this is that the writers stick with it all the way. Many of these shows go David Lynch/Twin Peaks on us, setting us up with the promise of great stuff to come, and then disappointing us in a big way later. (Dean Koontz novels always seem to fall apart in this way, at least for me.) \"The Lost Room\" keeps up its promises all the way to the very end, which, like the rest of the miniseries, is clever and interesting and makes perfect sense in hindsight, given the rules. I honestly can't think of the last time I saw a miniseries or movie of this ilk that pulled off its ending this well. It's a darned good miniseries, and I sincerely hope it becomes a full-blown series, as apparently is being considered.",
         "What a mini-series!!! I absolutely loved this show!!! It left me wanting more ie, a series. I love the series Lost and watched Taken three times. So, I'm a fan of Sci-Fi. This captured my attention from the minute they showed the teaser. The story line was absolutely fascinating. And I thought the acting was excellent. I too enjoyed Peter Kraus in Six Feet Under; he's a very talented actor and I feel he will go very far. If the writers and producers are reading these postings, Please, please bring this back as a series!!!! I loved it and would watch it faithfully! Thank you for bringing such an interesting show to us.",
         "I decided to watch this since the premise seemed fairly original. I was totally blown away! This show should be made into a series. Luckily they left the end open enough that we might actually see that in the future. With shows about superheroes becoming more and more common it is nice to see a storyline that allows those powers (useful and not so useful) able to transfer from one person to another. Excellent casting and set design. Kevin Pollak shines as an object collector obsessed to the point that he will sacrifice the world to get what he wants. Julianna Margulies is also excellent. It is nice to see her on something since ER. I was never quite sure if I should trust her completely or not since the objects seem to prove that power corrupts even when you have what you think are the best interests at heart. A must own on DVD when it finally comes out.",
         "I don't want to spoil the plot, but we find out very early that the plot involves \"objects\" and the objects are very much non-breakable. There are other aspects of the objects, including vaults, being sought, and consequences for using them. As I viewed the series, what kept coming to mind was the \"cursed objects\" of the TV series \"Friday the 13th\". That being said, NBC & Sci Fi may have another winner on their hands. Just like Battlestar Galactica. Most of the shows, which indicate Sci Fi original are really terminated series being re-run. It is nice to see real Sci Fi shows being written from scratch and moving Sci Fi channel to a real channel and not a re-run channel. I am eagerly waiting to see how the series will spin off considering the events of the last 5 minutes of the show.",
         "I was surprised when I checked the credits of this miniseries to see that it had not been based on a book. It feels like something based on a book, because it has such a complete and detailed mythology and a feeling of back story that is rare in the work of screenwriters. The Lost Room has created a very complete world for its characters and for its central premise. It also, like a movie based on a book, feels like you can only get the full story by reading the book. One is left with a lot unknown. For the most part this is fine, but I don't care for the fact that at the end you really don't understand .... well .... anything. Although I'll admit that even though I was worried that this would be the case, it didn't bother me all that much, because the story had good forward propulsion and a resolution that was emotionally satisfying although not intellectually so. Since this isn't from a book, my guess would be they're considering this for a TV series, both because some threads seem to have been left loose on purpose and because it does feel like there's more you could mine out of the material. I hope I'm right about that, I would like to see more. But if it is a series, they'd better come up with some answers.",
         "Woof...just saw The Lost Room on Sci Fi. I wasn't expected much but boy was I surprised! Great miniseries and I'm hoping its one of those stealth pilots that might lead to a miniseries. If you've read the 2 sentence blurb about the show (everyday objects, fantastics powers!) don't think you've got it. There are complexities underneath the surface of this show and it was very well done. The lead, Peter Krauss, used to be the lead on Six Feet Under. I expected higher profile roles for him after SFU died, and when I saw he signed on for Lost Room, I was disappointed. It sounded boring. It isn't. Its a wild ride and I promise three things. You'll believe that Kevin Pollack can play menacing exceedingly well and Dennis Christopher isn't as cool as you remember him being back in Breaking Away about 100 years ago. The last thing I can promise is that you will dig the show. Its supposedly coming on again in Jan 2007. If you haven't seen it, see it and tell your friends. This is one we want to get behind. Scifi is starting to show up more and more often on my ReplayTV list. Being a huge science fiction fanboy geek, that's probably the way it always ought to have been but for years the channel was showing reruns of The Hulk and and old bad scifi TV. Lately, with BSG, Stargates (all flavors), hopefully soon for Painkiller Jane and Dresden Files, its finally coming into its own. I expect that in 2007, I may be watching it as much as I do HBO and Showtime and I pay for those! Now, if I could just get Scifi to stop showing stuff like Mansquito and the like, I'll be one happy damned camper.",
         "Big Spoiler Alert. So read this only if you've already seen it... or don't care. But you should see it. First, I give this a 7. It's got some great actors, music, and directing. The creepy mood that the miniseries created was perfect. I sat and watched this straight through and wasn't bored once, despite it's being 5 hours long. UNFORTUNATELY, I couldn't escape two things. First, the massive plot holes, especially towards the ending, and second, the fact that they gave up on the mystery of the room by the final third of the film. One example of a huge hole: The Order. Why even create that subplot if you're going to leave it hanging the way they did? The only answer is that this was supposed to be a pilot. But it didn't feel that way. And there are dozens more that make equally little sense. Second, the mystery was just dropped. The whole question about how and why the room came to be and who the Occupant was before whatever happened happened was just left to float away as though no one would really care anyway. Sure, Joe wanted his daughter back and one could argue that he was thinking about her and nothing else. But to use that explanation is just giving the film an excuse to be sloppy. For a detective, he barely asked any questions and I feel as though it was intentional so we would forget that there was a mystery to begin with. People, especially detectives, are curious and I'm sure that if confronted with something this bizarre, they'd be asking questions for hours (and not get up and leave before the omelets even arrive). Sadly, these two problems seriously deflated my impression of the series. In large part because they were so annoying. It started out so fun with the competing groups vying for control of the objects and the characters involved behind the secrecy. But once the last hour came, it was as though the studio sent down a memo telling the director to wrap it up so they could start filming a reality TV show on the sets. This is another example of why you give people enough time to complete the story rather than force it into an allotted time slot. My only hope is that these problems I had were the result of an over-zealous editing team, and that if a DVD of the miniseries comes out, the scenes from the cutting-room floor can be picked up and re-attached so that some sense can be made out of the thing. In conclusion, it's good. Very good. But it could have been great.",
         "I have seen two of the three episodes and I have to tell you that this miniseries has me watching every second in awe and wonder. Two hours speed by and I'm watching the encore to make sure I didn't miss anything. I thought Miss Fannings performance was a little weak; but that may only be because her sister is just so talented. The other characters rock however; well written and acted. You care about what happens to them; one way or the other... It is rare for a movie to be written that I can't guess what the writers are thinking, but this one keeps the mystery surrounding it. The last movie to do this for me was \"Identity\" with John Cusack. In fact, there are a few similarities, but they are not intentional. If you enjoyed one, however, you will thoroughly enjoy the other. Great stuff so far. If you missed it the first time; don't pass it by a second. It is worth the watch!",
         "We all loved the first night of the 3-day Mini series the lost room. It was an excellent clue like game and it was fun for our whole family to watch together and play together and try to find and write down the many clues through out the show. We can't wait for the next two shows. The show has suspense, comedy, Drama, and lots of thrills. It is a must see. If you like Stephen King movies then this is the show for you. It has allot of twists and turns that you are going to love. I hope you will enjoy it as much as out family has. When you think you have caught all the clues watch it again because you will see many more that you didn't see before.",
         "I saw the trailer for this TV-mini on some obscure satellite channel and thought, hey that's a cool looking movie. I'm a huge sci-fi fan so naturally I had to see this. To my surprise it wasn't a feature film but a TV-mini series. That sort of put my high hopes into lower gear since quite a few sci-fi mini's has been either low budget looking or plain simply bad. Well, I started to watch and I was slowly but surely sucked in and saw the entire set from start to finish. Yep 4½ hours non-stop watching. I just couldn't stop. The story is so cleverly written that I was (and am) simply amazed. I have seen it four times now and every time I see something new or find new answers that I didn't see before. To come up with this kind of story and use it so well must come from some tremendously inventive minds. Everyday items with some special power that came to be because....well you just have to see for yourself. The cast performance is top notch. I especially like the performance of Kevin Pollack as Karl Kreuzfeld, Dennis Christopher as Ruber and the absolutely superb, paranoid but believable performance of Ewen Bremmer as Harold Stritzke. Character development is good and even the shorter guest episode appearances like Ewen Bremmers are handled very well. The effects and production design fits the story very well and are nicely executed. Add to this a well written score and you have a winner. I'm really, really glad they made this into a mini series and not a feature film because the running time is needed. It doesn't feel like it's dragging or boring anywhere but rather every minute is used wisely. It starts slowly and builds and adds to itself in an even pace. Had they made this into a feature film I'm afraid it would probably have been destroyed by too much effects or too much action. Or even worse, the story been dumbed down to please audiences. If you like clever sci-fi drama with nice twists and turns and a creative original story you absolutely have to see this. It beats soo many big budget movies at so many levels. Really great stuff!",
         "The idea is old, some mystical event has happened in the past and some one (Hulk,Spidy,Deardevil) or a group (Fantstic 4) gets superpowers. But this series is a little different. Not people get powerd up, ordinary things do like a comb, a key, or a glas eye. Some with greate power, like stopping time some with less like only cooking raw eggs. I think this is a great series which you wouldn't regret to watch, if you like that kind of series. i give it a 10 because it never bored me and was always thrilling. Some of you may think you cant give a 10 but you some people also gave a Oscar to Cher because for a short moment she was a good actress. and for this today i give this series a ten because in this moment i cant think of a better series in this genre.",
         "TV doesn't get just a whole lot better than this. Some may object to a show built on \"contrivances\"--in this case seeming everyday objects that do magical (or superhero-like) things--but the strong writing and acting (especially by the lead, Peter Krause) made me buy every minute of it. It broadcast for six hours, with commercials, but it seemed much too short. I wanted much more. I'm not sure how a series would work, if anyone is talking about or actually creating that, but I would sure give it a look. While watching this great mini-series, a number of other shows came to mind, mostly X-FILES and THE TWILIGHT ZONE, but THE LOST ROOM is by no means a rip-off/retread. Like those two shows, this one covers a lot of territory. It is funny in parts, but it's also a crime drama and, of course, a sci-fi story. And the plot is, as my \"summary\" states, original and compelling. The conspiratorial part of the show is, to me, much less interesting than what the everyday objects do, and how the various characters make use of them and respond to one another. Let's hope that, if there is a series (forgive my ignorance!), the producers can keep Peter Krause and the other fine writers (and director, who does a solid job as well) responsible for making this such a great viewing experience.",
         "The subculture of the objects created in The Lost Room was an interesting side effect of having so many people know about such an incredible secret. There are many unanswered questions, which I hope will be addressed in series. What was the \"event\" in May 1961 that set things in motion. No real hint is given what this may have been, either terrestrial or not. The most fascinating thing I've found is how it is still bouncing around in my mind. You just find yourself thinking about all the what ifs and loose ends. Anyway, it was a wonderful show with a lot of twists and unexpected events.",
         "This review has heavy spoilers for the whole story. Do not read if you haven't seen the whole show. I really liked the original concept behind this show. A room where \"something happened\" that created objects with different supernatural uses was great and for the most part I liked how the story was told, with the main character wanting to get his daughter back and the whole factions and groups that formed around the objects. But sadly it ended up being yet another example of writers that came up with a great idea but had no idea how to end it and how to give a logical answer to all the interesting mysteries they came up with. By the end most of it doesn't make sense anymore and the answer to most of the big mysteries ends up being \"because the writers say so\". One of the biggest mysteries of the whole show is what happened in the room, and I'm sure I'm not the only one who was intrigued with this and was expecting an answer. And when the times came for the big reveal the dialog went something like: \"Did you create the objects? What happened in this room?\" \"No I didn't create them. It just happened\". Turns out the writers had no idea how to finish their own story so they just went with \"it just happened\". And that's far from being the only question left unanswered, by the final chapter there are a ton of events that are never really explained. - Why would recreating the experiments of the collectors revive people? - What was the logic behind the daughter of the main character being trapped in \"one of many rooms? - How did the main character recover his daughter by becoming an object? - ETC A part of me feels this show was left unfinished. A lot of the events from the final episode pointed towards a second seasons that never got released",
         "I love what i have watched so far. The first hour of it was kinda not interesting for me. But as soon as it started to pick up and i saw Julianna i loved it. The acting is great from Julianna and Peter. The others are good. This mini series is very different from what i have watched. It keeps you hooked especially if you have never heard of these things. SciFi has finally showed something that doesn't suck. It would be great if this turned in to an actual show. It doesn't just throw a bunch of information your way. All three parts are worth watching. This was a great mini series compared to the other crap thats on TV these days. It would be great if they release this on DVD or in some other way. This is definitely worth watching.",
         "Finally!! SciFi has actually produced something that is worthy of its name. The Lost World is a gorgeously produced, beautifully directed and wonderfully acted production. It even is adorned with a rare great music score by Robert Kral. The mini was spellbinding, the plot kept you wanting to see more, and on top of it all, it was intelligent. I'd be giving unsparing kudos to SciFi if not for one thing: why did they not promote it? I remember when the soporific Taken was put on how it was all but impossible to know when the show was on, or even the boring Triangle. Boy did I know about that show. And of course, let's not forget the extra-super-hyped but mind-numbingly bad Battlestar Galactica. Millions seemingly spent to promote it. Yet, nary an ad for The Lost Room. Why? Is SciFi afraid of shedding its image as a low-quality channel? In any case, it's great that they finally put money towards something worthwhile. let's hope they do it again.",
         "I have to give this movie very high marks because it maintained an incredibly high level of suspense, surprise and novelty through most of its 4.4 hour (without commercials) run-time. This is very unusual for the sci-fi genre - most ideas and plots are very well-known. I won't give anything away about the story because the unusual plot is is part of the wonderful experience you'll get from watching this movie. Suffice it to say that the story follows a detective who comes across a very unusual key to a very unusual hotel room. Admittedly, it sounds like the movie is going to be a bomb (what I thought), but it is anything but that. Once you start watching - you'll be hard pressed to stop. The pace is excellent: something interesting is always going on - hardly a moment is wasted during the multi-hour runtime. This movie could not have been as good without a good strong lead character. Peter Krause does a great job - he presents a well-balanced, intelligent and easy to like character. The supporting characters are pretty well done - even though some of them are a bit wacky. Everything seems to work. One thing I really appreciated in the movie was the intelligence of its characters. There aren't any ridiculous decisions that are made to advance the plot (or remove characters). In fact, they are mostly very smart ones - so you don't feel shortchanged by the story or the filmmakers. Applaud them in this case. It really makes a story go from interesting to fascinating. Is it perfect? I can squabble about a few things towards the end - but it doesn't matter. What matters is that I was strongly entertained for 4.4 hours and am going to watch it again. I could go on, but you'd be better served by watching the movie. This level of film-making will appeal to all moviegoers. Strongly recommended for all.",
         "This is a creative and imaginative story line. So far, there is also the absence of the droll, overused idea that aliens planted things and are now watching us like some sort of big lab experiment. As the story unfolds, lets hope that nothing pops out of anyones stomach. Its actually interesting that the writers are giving the credit for these items to God. While the story line is an attention grabber, the acting is just so-so. The lead character does a good job, but most others seem stiff and over-rehearsed. And, some scenes are just a little too hard to digest, pulling the viewer back into reality -- like how many times can one fall out of the sky onto hard pavement and survive? There is also an element of familiarity between the little girl and Dakota Fanning, who has been very successful in pulling off the big-eyed, innocent parts. All in all, this show is worth watching.",
         "OK, first of all let me just start by saying that I watch a lot of movies and read a lot of books, but I hardly ever write any sort of comments or critiques on what I've watched or read. I am a big fan of anything supernatural, unexplainable, mysterious, or horrifying and this mini-series absolutely hooked me from the beginning and I wish that it would have been much longer than 6 hours. I was a huge fan of the series Six Feet Under when it was on the air, and Peter Krause is in my opinion one of the best actors on television. If it were not for him, I probably wouldn't have even watched the first part of the series...I am so glad that I did. I don't think anyone could watch the first two hours of this mini-series and not be completely engrossed and fascinated by the storyline. I think that the writers of this series did an excellent job and were brilliant in setting the stage for what I hope will either spin off into a series, or at least another mini-series. I really do not see how this will not have a sequel in some form, it was really that brilliant and imaginative. I recommend watching this to anyone that loves science fiction or supernatural-type phenomenons. The makers of this show really exceeded my expectations on this one, which were initially not that high. Please let the Sci-Fi channel have the foresight and intelligence to green light this for a followup, I'm sure I won't be alone in eagerly awaiting for this to happen.",
         "the lost room kept me at the edge of my seat. i arranged my schedule around it. this is something i don,t normally do. is that all there is? are you making a movie or a series? i wanted more i was left with many unanswered questions. How did the human object come into existence? was he a physicist who specialized in time and space? Is he from an alternate universe? did he really die or did he return to his place of origin when he died? at his death did he go into another dimension? will the human objects replacement collect all the objects? will the replacement be hounded down? etc.... thank you for those entertaining hours give me more.",
         "This truly memorable miniseries is far different from the usual Sci-Fi Channel TV movie. Rather than being cheesy and badly overacted, it is intriguing and truly well-acted. The plot is very complex, as many mysteries are introduced and solved throughout the six-hour show, but it all boils down to this: there are objects that were created by some event that caused them to have strange and interesting powers. One of the most powerful of these objects is the Key, which opens any door to a motel room out of time and space where it all started- and it has just fallen into Detective Joe Miller's hands. When his daughter becomes trapped in the room (the room automatically resets if the current occupant doesn't have the key), he goes on a quest to find her, and learns that there are over a hundred of the Objects, and that there are some who would do anything to get their hands on them. And so begins a fantastic series of mystery, intrigue, and murder. As Joe Miller gets deeper and deeper into the mystery of the Objects, he realizes that his life, should he manage to keep it, will never be the same again. The whole story is wonderfully acted, with performances that will blow your mind from almost all of them. And don't forget Elle Fanning, Dakota's little sister, who exudes the same kind of childlike wonder and charm that her sister has perfected to practically an art. The special effects are also very good, especially for a TV series. If I had one complaint, it would be that not every mystery is solved. However, there are theories that this will be the basis for a new ongoing television series by Sci-Fi, or at least another miniseries, and if so, I can hardly wait.",
         "I watch a lot of the SciFi \"Original\" movies. They are often really, really awful, and good for nothing but a laugh. This miniseries, however, was excellent. The characters are well-written, well-cast and well-performed; there aren't gaping plot holes or any cheap, tacky special effects. The main character, Joe, vaguely reminded me of Jack Carter, the main character from Eureka, another SciFi show. The two show aren't really anything alike; Eureka is more comedic. Both characters were separated from their wives and raising their own children. And, the plot. It has this quality, where it reminds of of all kinds of different things that I can't quite place, yet is completely fresh and original. The characters aren't stereotypical, but there are a couple that fall comfortably into nice little categories. The whole thing has just a tiny hint of open-endedness to it, which is good, but still offers good explanations for the important things, which is great. I highly recommend watching this if it comes on again, though make sure you start with Part One! A side note: Another reviewer mentioned disliking Elle Fanning in comparison with her sister (Dakota,) but I think I much prefer the younger incarnation presented here. She isn't as dramatic as her ubiquitous sister, but acts how I would expect an eight- or nine-year-old girl to act. It's a fresh change."
      ],
      "genres": [
         "Action",
         "Fantasy",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Lions Gate Films",
         "Lionsgate Productions",
         "Motel Man Productions"
      ],
      "summaries": [
         "Detective Joe Miller comes into possession of a seemingly innocuous motel room key while working on a murder case. The key can open every door and take him into a motel room that seems to exist outside of normal time and space. However, if he leaves something in the motel room that did not originally come from there, it will be gone as soon as the room \"resets\"... He discovers that there are special objects hidden in different places. They don't look special, but they have special powers. When his daughter disappears and he is framed for killing his partner, he must find a way to bring her back from the room, while working with different groups and people searching for the objects. But who can he really trust when everyone goes crazy after touching the objects...",
         "A detective investigates a mysterious motel room, which acts as a portal to an alternate universe."
      ],
      "budget": 0
   },
   "movielensId": 140737,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-12-09",
      "dvdReleaseDate": null,
      "directors": [
         "Craig R. Baxley",
         "Michael W. Watkins"
      ],
      "runtime": 270,
      "movieId": 140737,
      "title": "The Lost Room",
      "mpaa": "",
      "actors": [
         "Peter Krause",
         "Julianna Margulies",
         "Peter Jacobson",
         "Dennis Christopher",
         "Elle Fanning",
         "April Grace",
         "Kevin Pollak",
         "Benjamin Petry",
         "Jason Douglas",
         "Roger Bart",
         "Chris Bauer",
         "Harriet Sansom Harris",
         "Margaret Cho",
         "Ann Cusack",
         "Nicholas Guilak",
         "Tim Guinee",
         "Chris Monberg",
         "Ewen Bremner"
      ],
      "imdbMovieId": "0830361",
      "originalTitle": "The Lost Room",
      "genres": [
         "Action",
         "Fantasy",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "aweBDN7l4eU",
         "oTisZFgeNE8"
      ],
      "plotSummary": "A detective investigates a mysterious motel room, which acts as a portal to an alternate universe.",
      "tmdbMovieId": 134777,
      "avgRating": 4.07983,
      "releaseYear": "2006",
      "numRatings": 238,
      "posterPath": "/t6O4ygtxzay6Esjmzq1zSvGcN0n.jpg"
   }
}