{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "role reversal",
            "id": 5629
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "lgbt",
            "id": 158718
         }
      ],
      "imdb_id": "tt0466669",
      "video": false,
      "title": "Almost Normal",
      "recommendations": [
         113460,
         146778,
         92326,
         172854,
         79908,
         17651,
         27152,
         26731,
         5591,
         243670,
         81350,
         43547,
         34427,
         242648,
         309019,
         41644,
         19844,
         16240,
         158848,
         55177
      ],
      "backdrop_path": "/mjfXwxPQatahtWJMuK97hanMUm8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Brad Jenkins",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc79",
               "name": "J. Andrew Keitch",
               "profile_path": null,
               "id": 109459,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julie Erwin",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc7d",
               "name": "Joan Lauckner",
               "profile_path": null,
               "id": 109460,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roland Davis",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc81",
               "name": "Tim Hammer",
               "profile_path": "/6sZlJEoiCL58q5EQfQnyxWQV0tf.jpg",
               "id": 109461,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Terry",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc85",
               "name": "Nils Haaland",
               "profile_path": null,
               "id": 109462,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bill Dempson",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc89",
               "name": "Kehry Anson Lane",
               "profile_path": null,
               "id": 109463,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "High School Student",
               "gender": 1,
               "credit_id": "56dad6d8c3a3684ca3001ea0",
               "name": "Lindsay Schoneweis",
               "profile_path": "/vLOYa91IDT5Qd51fkSeJN2cnpfl.jpg",
               "id": 1223684,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc8f",
               "name": "Marc Moody",
               "profile_path": null,
               "id": 109465,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc95",
               "name": "Marc Moody",
               "profile_path": null,
               "id": 109465,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.463998,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32633,
      "vote_count": 9,
      "budget": 0,
      "overview": "A gay man approaching a mid-life crisis is tired of being different because he is gay. He wants to be normal. Suddenly he is yanked back in time to when he was in high school. But this time, the world is gay and to be straight is considered deviant behavior. Then something else happens. He meets a girl. And suddenly normal becomes ...well almost normal.",
      "similar": [
         449176,
         184352,
         26280,
         383526,
         338189,
         413666,
         382475,
         380874,
         376867,
         47643,
         10938,
         160165,
         26933,
         11000,
         258034,
         26371,
         17483,
         10806,
         258480,
         4369
      ],
      "original_title": "Almost Normal",
      "runtime": 90,
      "poster_path": "/u917XLsbvAZJRxZ8bZ4PIVgfWZo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2005-05-26",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "What if everyone in the world was gay? Except for you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marc Moody"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Marc Moody"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0466669/",
      "coverLink": null,
      "actors": [
         "J. Andrew Keitch",
         "Joan Lauckner",
         "Tim Hammer"
      ],
      "reviews": [
         "I did like this movie. It had the benefit of never having been done before or since for that matter. In the primary story, a college professor, reaches his 40th birthday and is an unhappy single gay man. He goes home to help his family celebrate his parent's 45th wedding anniversary. During his visit he runs into old friends and old \"not so\" friends. Further reminded of his lonely life during this family gathering he gets into an accident and is somehow catapulted back into his teenage years. However all is not as it was. Now he is a world where men like men and girls like girls. His father is married to his otherworld neighbor husband and his mother is married to the otherworld wife. The star of the basketball team a guy he has always had a crush on meets and falls for him while his best friend, a girl shows up. For a brief shining moment he is \"normal.\" However all things are not equal. In this world he discovers that he is not gay. He falls for his friend and they enter a tentative relationship that jeopardizes the love he had developed with his teen heartthrob. The movie was good but not as good as it could have been. From the technical side the movie's editing was not as good as it could have been and some of the actors had a habit of overplaying their roles. Still for what it was and is this movie is a ground breaker. It was a major shocker for me a gay man to see a high-school full of boys kissing each other and girls doing the same with their girl friends. For a moment I saw a world where I would have been \"Almost Normal.\"",
         "This review contains extreme \"spoilers\". Some reviewers of this film have misinterpreted the writer's vision. Ostensibly a standard gay comedy, Almost Normal would be rather forgettable, if it wasn't also a social satire, designed to illustrate what it's like to be gay in a straight world. As satire, it succeeds very well, and in some ways as brilliantly as one could hope to expect. In spots, the plot is too confusing to produce the intended impact, but I give it an A for effort. Brad is nice-looking, single, gay, on the cusp of his 40th birthday, and somewhat discontent. He ogles sports jocks when they're not looking, goes on dates with guys who are miles below his desirability level, and frequently argues with his best friend Julie, who is also his sister-in-law. At a party for his parents' 45th wedding anniversary, things have just about hit the boiling point. A reunion with his best high school buddy reminds him that his friend stopped talking to him when he came out. His mother still dreams that he'll find some nice girl, and as he remarks to Julie, sometimes he just wishes that he was \"normal\". Not that he dislikes being gay, but he is weary of being different from the heterosexuals that surrounded him. As a gay man, I found it easy to identify with this sentiment. Events at the party annoy him so much that he gets drunk, even though he recently gave up alcohol. Seeking some fun, he slips out of the party and drives to a local gay cruising area, where he crashes his car into a tree. As we suspect (and our suspicions are confirmed much later in the film) much of the remainder of the film is a dream sequence that plays in his mind while he lies unconscious in a hospital. And what a dream! Brad dreams that when he wakes the next morning, something unexplainable has happened. He has traveled back in time to the 1970's, and is now an 18 year old high school student. But that's not all. He has gotten his wish to be \"normal\" because everyone in the world is gay! Except, of course, those outcasts who are emotionally and physically attracted to members of the opposite sex. Known pejoratively as \"breeders\" and \"hole-punchers\", heterosexuals in Brad's dream world are routinely ostracized, scorned and even \"straight bashed\". They are preached against, misunderstood, and subjected to extreme ignorance and isolation. Pardon my gloating, but as a gay man, I found this a most delicious and righteous turn-about on reality. It was also highly satisfying to see a world where gay people are totally free, and stand proudly with their chosen partners before the entire world. In Brad's dream, there is no such thing as homophobia, and for a wonderful moment I allowed myself to be caught up in this glorious if absurd fantasy. Conversely, I can only imagine what it must be like for a straight person to absorb the basic premise of Brad's dream world \u0096 heterosexuals may find it strange, disjointing and probably fear-inducing. Homosexual propaganda? Yes! And highly effective. A myriad of plot problems are resolved with witty or sometimes silly explanations. In his dream, Brad's parents have same-sex partners, but his father and mother begat him through a custom known as \"birth partners\" where best friends of opposite sexes have children solely to reproduce, although romance and sexual desire between the sexes is taboo and \"disgusting\". Here's where Brad's dream gets dicey and somewhat confusing. Enter his sister-in-law, Julie. Although Brad has found his soul-mate, a basketball jock he had a crush on in High School in his \"real\" life, Brad slowly begins to realize that he is sexually attracted to Julie, and she to him. For a while, I was a bit uncomfortable with this plot twist, until I realized that the writer was cleverly engineering a take on the real-life terror, isolation, rejection and ultimate acceptance that virtually all gay people experience when they discover the truth of their own sexuality. Brad and Julie go to an underground \"straight\" bar, witness a violent \"straight bashing\" and ultimately attend their high school dance, where they demand acceptance. Many reviewers were confused by the dance scene. When Brad and Julie are denied permission to dance together (\"We have to tolerate your kind, but we don't have to put up with your disgusting behavior\") many of the on-looking gay couples (including some of the faculty) begin to dance with opposite sex partners, in a show of solidarity and tolerance. Some reviewers of this film thought that this signaled a reversal of Brad's fantasy dream, and that \"everybody starts turning straight\". Some even saw it as an argument that sexual orientation is a choice, but that's not what I got out of it \u0096 I saw it as a simple show of support for a persecuted minority. The \"gay reversal argument\" has been used before, but not quite so effectively. In \"Torch Song Trilogy\", Harvey Fierstein begins an impassioned speech to his mother by saying, \"Ma, imagine what it would be like if everyone around you was gay; every book, every magazine\u0085\" and Anne Bancroft, replies, \"You're talking crazy!\" Almost Normal expands this argument to its conclusion. Of course, no heterosexual can ever truly understand what it's like to be gay in a straight world. But in the end, I found much of this movie powerfully persuasive, and I wanted to round up all my straight friends and family and make them watch it. The final scenes reverted to standard gay comedy, but there was a nice romantic twist at the end I didn't see coming. That part I'll leave for you to discover, for I do recommend that you see it and decide for yourself. I left with a smile on my face and my head full of thought, and that's never a bad thing.",
         "40-year-old gay teacher has a car accident and dreams he's back in high school again--only this time, gay is 'normal' and he's attracted to a comely female student. Silly, low-budget, under-populated comedy-drama is more ambitious than its thin production or straight-seeming cast can handle. The script is stuck in a revolving closet--the teacher has to come out all over again--and it's never clear to whom the picture is meant to appeal, straight or gay audiences. The filmmakers' idea of a novel twist is to have the homosexuals be the unyielding bashers, but is the movie preaching tolerance and acceptance or is it a treatise for heterosexuals in need of reassurance? (after all, their side wins). A less 'colorful' take on this material might have made for a funnier and perhaps thought-provoking comedy, but \"Almost Normal\" doesn't even scratch the surface of those possibilities. * from ****",
         "As an avid viewer to any and all gay themed movies...this one made me think the most. don't get me wrong it was entertaining, however, I almost wonder if this is some how trying to make society think that being gay IS a choice. On that I don't agree. On the other hand, when you take the dominant sexual preference of society and turn the tables on them and let them see what the outcome is, I wonder if the message will get across. You will have to form your own opinion. I truly enjoyed the casting, and the lead actor is quite versatile in his ability to portray then and now. 8 out of 10 in my book. Definitely worth seeing.",
         "I liked this film because it brought a unique view to prejudice and misunderstanding. Here being gay is normal and straight (breeders) is not. The length and breadth of this perspective makes it quite persuasive. You get a chance to see life from the other side. Brad is 40, gay and not partnered. On his way home to attend his dysfunctional parents' 45th Anniversary an accident lets him go back in time to high school where he sees himself as straight and \"alone\" in a school where all the \"normal\" boys like boys and the girls like girls. The first time in school he fancied the star of the basketball team and knew he couldn't get him. Now he's there and the star is hoping to make it with him. Brad couldn't fix a car or do lots of other \"straight\" appearing things. Now he can and it makes him different. He doesn't like it. He comes out as straight in high school during the second visit and is attacked for it. The boy he wanted as a boyfriend turns out to be his friend and the girl he wanted as a friend turns out to be his girlfriend. Handled with humor and sincerity by a cast that handled the job well.",
         "Premise? Brad, a 40 year old college professor, gets propelled back in time to his high school years (paging Peggy Sue). The time machine of choice is an automobile (paging Doc Brown). The twist here is that his past is now a world where same sex relations are the norm and being a 'breeder' is considered 'queer'. Unfortunately, ALMOST NORMAL suffers a bit from adhering to it's 'concept' - showing us a world every gay person has dreamt of, where being gay is the acceptable norm. Some of the character and plot energy is diverted to this noble experiment and thankfully, it eventually pays off. Although an indy in spirit, ALMOST NORMAL looks and sounds pretty slick and manages to be quite winning, despite some apparent flaws. The scenes where Brad and his boyfriend go on an 'ice cream' date and where the hunky boyf eventually proposes marriage are genuinely moving and refreshingly real. The convention of having Brad remain 'different' even in his new world is the film's toughest trick and I'm glad to say it works. The performances are capable and except for a few of the smaller roles, the acting is uniformly pretty good. The score and photography are above the norm for this type of endeavor, generally on a par with a Hollywood effort. The direction is a bit uneven, with a few scenes a bit too farcical and others veering toward the too sentimental. But for the most part ALMOST NORMAL is almost as clever and unique a film as Doc Brown could possibly confabulate.",
         "Unhappy middle-aged gay man gets transported back to his high school days, and everyone's gay! Including the boy of his dreams. A nifty concept, but it gets derailed halfway through when our hero suddenly falls for a girl, which in itself isn't a problem--but he's been gay the whole time, and suddenly has feelings for a girl, and doesn't even pause to question this sudden 180- degree turn in his sexuality, he just pursues her. The film then wanders off into 80s teen-film land, with moral lessons for all about acceptance. If the film had remained an exploration of this one fellow's problems with his own life, the premise would have worked really well. Too bad it didn't do that. Other strangeness: the auto repair guy with the uncanny ability to find our hero at crucial moments in unlikely places, the two brothers mentioned at the start who never appear except for one at the very end, as he's about to return to his real life, the del sol that is miraculously repaired twice using 1970s junkyard parts. Amazing!",
         "Marc Moody has written and directed a film that is so earnest and reaches so high for making a significant statement that it is difficult not to admire the result. ALMOST NORMAL is so obviously a gay version of 'Back to the Future' by its own admission that it becomes a bit tedious and silly, and when accompanied by low budget and tenuous production values it is a little squeaky in achieving its self-imposed high standards, it comes very close to being a forgettable effort. So why is it so popular? It has spirit! Brad (J. Andrew Keitch in a fine film debut) is a 40-year-old closeted gay college professor in Nebraska who lives in fear of derision and is frustrated he is unable to live his life in a happy relationship. His good friend Julie (Joan Lauckner) is supportive and encourages Brad to return home for his parent's wedding anniversary. Brad does so reluctantly, finds the usual homophobic atmosphere and in a moment of weakness, drinks too much and has an auto accident. Miraculously, when he awakens, he has the appearance of a handsome high school kid and when he wanders into the world he discovers that there has been a major reversal: now it is normal to be gay and grossly distasteful to be a straight breeder. Even his parents are gay with breeder hosts for procreation purposes. Brad sees reverse discrimination now, is sought after by the high school jock Roland (Tim Hammer), enjoys the freedom of being openly gay, but meets the now new Julie and is strangely attracted to her, having to hide his new 'straight alliance' in a new closet. And the resolution of this new dilemma is the message of the film. Everything about the idea of the film makes the viewer want to love it, and it is a sweet little diversion of a film with some thinking material about prejudices. It is rough and hampered by many technical and casting and scripted errors, but it does give newcomer Marc Moody a strong grounding for making further films about gay life that seem to appear like seeds of ideas throughout this film. It needs polish but it is a good time and offers a wide audience a better perspective on what it feels like to live a life as an outsider. Grady Harp",
         "This is, far and above, the most jaw-droppingly inane film I've seen in ages. 40-year-old, gay college professor with antiquated and immature issues with his own sexuality is \"magically transported\" (via collision with elk sculpture) back into his high school years. But, wait a second... everybody's gay! Oh, good lord, hold on! Now--in this alternate reality--he's straight, and facing the same trials and tribulations he did as a gay man in the real world. I'm sure the filmmakers were trying for irony, and undoubtedly for wit, but I found neither. What's the message here, exactly? Maybe it was lost in the midst of poor writing and plot holes the size of my fist. Or maybe it never existed in the first place.",
         "This movie can't decide if its goal is to preach, amuse, sadden, or just plain annoy the viewer. Is this the gay \"Peggy Sue Got Married\", \"Back to the Future\", \"The Wizard of Oz\", or a confused amalgam of all 3, with some PG-13 \"Queer as Folk\" thrown in?? Particularly annoying was the unused opportunity to have the role-reversed world be even an iota better than the current state of right wing homophobia extant in America today. Mediocre acting, poor editing, and an uneven script result in a sub-standard movie watching experience. Thank goodness for Fast Forward.",
         "The indie film, written, directed and produced by a couple of college film professors, is kind of a cross between \"Back To The Future\" and \"It's A Wonderful Life\" with a queer twist that can be appreciated by gay as well as non-gay audiences. The cast includes mostly first-time actors and lots of extras from the film school and a local high school, but the film comes off surprisingly polished despite the low budget. A 40 year old college professor laments entering middle age as a single gay man, and is further depressed by a blind-date-from-hell and an incident where he thinks one of his young students is coming on to him, only to find out he wants to fix him up with his gay father. Unloading his misery on his \"fag hag\" best friend, he wishes he could start over and just be \"normal\", and seems to get his wish when a car crash transports him back to his high school days, but into a parallel universe where being gay is the norm, and straights are considered perverts who must seek out each other in incognito \"straight bars\" downtown. He starts dating the high school jock of his dreams, but a complication develops when he finds he is also attracted sexually to his former fag hag, now a feisty transfer student, making him again not as \"normal\" as he thought he'd be in that world. The film has the expected role-reversal puns, including quasi-religious justifications for considering heterosexuals sinners (\"If God had intended for men and women to be together, He would have made women to like football!\"), but isn't really a comedy or a drama, but an intellectual satire on just how \"normal\" anyone's sexual orientation is to someone else. In a sense, it becomes a moral lesson about acceptance of anyone who is different than the seeming \"norm\", whether that be based on sexual orientation, race, religion, attitudes or physical limitations. Despite the gay theme, it would likely earn a PG-13 rating, and is appropriate for mature viewers of that age or higher, and would be a perfect segue for a classroom discussion of diversity. The one drawback of the film is the complexity which somewhat enables it to chart new grounds for gay cinema, and it must be judged in its entirety rather than take any scene out of context, as less patient viewers would be inclined to do. There seem to be a lot of extraneous details at times, and these are eventually resolved by the film's end, though an average viewer may not catch it all. Personally, I thought it was an ambitious, unique gem of a film, and recommend it highly.",
         "Right! I felt a bit angry half way through the movie. I admitted I forwarded and rewind a few scenes I thought there were funny. But the idea of a gay person going to a future where you can be gay and it is acceptable as \"normal\" and the same character decided that he is \"straight\" did not make any sense to me. However I think this movie is about being an \"Outsider\" rather than an \"Insider\" (as the main character says at the end \"sometimes what I want it is not what I need\"). I agreed with previous comments, you don't really know what audience this movie target, but I have to say it is an interesting concept the director brings to the screen, isn't perfect but a good effort.",
         "Writer/Director Moody had the germ of an idea which might have worked if not done so earnestly; therefore making this muddled and filled with holes script barely reasonable.Most of the high raters here, I suspect might be gay because the film impersonates cross sexuality being so black and white.Moody also refers to characters we never see except for a brother at the end.Things like a father wearing dark glasses after having eye dilation has no usefulness and takes up badly needed script time to help explain the missing plot.The mother and family are almost grotesque in their stupidity without any kind of humor and all of the work successful shows like \"Queer As Folk\" or \"Will and Grace\" did on TV to humanize gays, is lost in the meandering points which really do not show any ingenuity or even one memorable line or quote. Frankly,scenes like the professor's seduction of his sister-in-law is incestuous and weird and her curiosity about how good the sex was after he comes back to reality is obscene.The budget constraints probably had a lot to do with all the questions the viewers ask themselves while trying to figure out what the hell is happening on the screen.",
         "A gay, frustrated with being gay, travels to the past after a car accident. He is magically transported back to his high school days, where everyone is gay, and being straight is not accepted. So far, so good. Interesting idea. I thought it could prove to be interesting. But then the gay guy turns straight. He then makes a stand and fights for straight rights. It lost me there. Everyone then starts admitting they have straight feelings, a begin becoming straight. I suppose somewhere in there is a moral. I was too appalled to bother searching for it. Another promising idea wasted. I suppose the chances of a well acted gay movie, that is professionally done is about as likely as the Cubs winning the pennant.",
         "The plot summary of Almost Normal sounds like another campy throw away attempt at a comedy full of inside jokes for the queer crowd. But for it's genre (queer comedy) it's a really well constructed film that explores an amusing story idea and rarely tries for the broad and obvious laughs. Nor does it throw in gratuitous nudity and sex as a cheap audience appeal.* Almost Normal is a well shot, good looking film. The acting is unusually good for a queer comedy. The sets, costumes, and hair are convincingly late 70s without screaming it (the way That 70s Show did), and the hair/makeup person/s did a great job at making younger actors look convincingly 20 years older. The music has a Movie of the Week sound to it which I like to think was intentional. In general Almost Normal is a great choice if you're looking for a pleasant, amusing queer comedy that doesn't insult your intelligence. *I actually love gratuitous nudity and sex as much as the next guy but in queer films it often seems tacked on merely for the audience or because the director wanted a legit reason to see the actors naked.",
         "The concept is potentially interesting. It is openly attempting to use the Back to the Future idea to take a gay college professor back to his high school days in a world where what's considered \"normal\" and \"abnormal\" is reversed. Unfortunately the potential is never realized. The actor playing the central character, Brad, is likable enough. He and the actors who play students do turn in reasonably good performances given the rather lame situations and dialogue they are forced to cope with. Conversely most of the actors playing adult characters seem to suffer from major aren't-we-being-too-silly over-acting syndrome and often sound like they're reading their lines from a teleprompter that isn't keeping up. The story blurb states that Brad \"is tired of being different because he is gay\" and that when he is transported back in time he becomes \"almost normal.\" Obviously that's not what happens at all. Taking that view would seem to imply that being straight will forever be the preferred norm in any context. In the present day he, and many others, consider him to be different because he is gay. When he goes back to his high school days he becomes straight in a fantasy world where gay is normal. Once again he's different and regarded as \"disgusting\" & perverted and is the object of the same sort of bullying from his peers and negative reactions from adults that he experienced in the real world. It might have been a more interesting premise if he had retained his sexual orientation and found himself in a world where he was a normal gay kid and the victimized minority in his school were the heterosexuals. Finding himself in the majority and not having to deal with all the guilt and grief dumped on him could have been a genuine role-reversal with real implications as he decided whether the fantasy experience or his real life was preferable. In the end it's still mainly a mediocre high school coming-of-age drama. It's still the same normal kids and the same prejudiced community standards making life miserable for the minority, even if what defines normal and abnormal has changed.",
         "This is obviously a film that comes from the heart. If only it had embraced its sincere dramatic elements more fully, it might have been a worthwhile outing. It does indeed suffer from many of the usual ailments associated with ultra-low-budget films (e.g. inexperienced actors, flimsy production design, gaping plot-holes, etc.) but the biggest problem by far is its insistence on assaulting the audience with copious amounts of tone deaf \"wacky comedy\". Just about every time the plot builds to a moment of poignancy, the script turns around and kicks itself in the balls with an ill-timed, unfunny joke. This, combined with the bargain basement production values, makes for a grating, nearly unbearable experience.",
         "A gay man, suffering a mid-life crises, feels sorry for himself, living an \"almost normal\" life. In an accidental event, he finds himself back in time, at his high school, where being gay is the norm, and being straight is an abomination. I loved the plot and the way it plays out. The acting was marginal. The most believable was Brad, except when he was \"supposed\" to be older. The other characters fell pretty flat. The \"jock\" love interest was the perfect vehicle to show that Brad was so smitten with his high school crush and his now accepted love life, that he fails to realize that even in this world, he is not normal, and again he searches to find self acceptance.",
         "This is such an annoying movie! Maybe there is an audience for it somewhere, but I'm glad I don't know anybody in it. It pretends to invert the gay/straight imbalance, but it does it so unevenly that it ends up alienating gays even more than we are already. The most annoying inequity: the ONLY sex scene, and the ONLY serious kissing (with tongues, open mouths and credible passion), are between straight couples, although in the world being shown gay is the norm and straight is taboo. The kissing between same-sex couples looks like me kissing my grandmother, every time it happens, and it happens a lot because that's how the movie drives home its insufferably heavy-handed message. If in a world dominated by people like me (i. e., gay people), the only ones who have good sex and the only ones who are passionately attracted to each other are the straight minority, no wonder the star switches teams so easily and eagerly. The preposterous, predictable ending, which I suppose was meant to surprise and delight us, to force a smile onto our faces and a tear into our eyes as we left the theatre, just made me angrier. I don't care what point this obnoxious movie was trying to make; I HATED it.",
         "I myself love the Idea. I think anyone GLBT person who went through the public school system could appreciate the idea of waking up back in High School in a world were we were considered normal. However this very basic Idea is where my love for this movie ends. The first problem the acting was horrible! You could tell from the first few minutes where every character either overacts or underacts his part. The second problem with the movie was the script and the speed of which events took place. The movie was very short and it really showed. You barley see his supposedly horrible lonely life at 40 before the audience is whisked away back to the main characters teen years. Once their things move at super speed. Within 10 minutes of waking up 22 years younger not only does he completely believe that he traveled back in time to a reality where gay is normal( I could see at least a few minutes being spent on thinking this is a trick or a drunken dream)but he runs into his dream guy who is obviously in love with him. Give him at least a few minutes to explore his new environment. Of course within the next few minutes they become boyfriends. Now the next part of the plot wouldn't have been my favorite even in a good movie but I could have accepted it if it had been done well. Again within a few minutes of declaring himself in love with his hunk boyfriend he meets this new girl and immediately falls for her. First have the character spend more than 10 minutes with the guy he has been lusting after for 22 years.I would have liked to see at least half an hour spent on Brad and the main character as a couple. Lastly have a real sexual Identity struggle. In the movie shortly after declaring his love for Brad the main character meets the girl and falls immediately in love. Not even questioning the homosexual feelings he has always had. I'm not saying its impossible for a gay guy to fall in love with a girl, but their is usually a struggle period where the guy questions it. In this movie he falls immediately in love and never even considers Brad his crush for 22 years. Over all I wish they would remake this movie with Hollywood actors, a top notch script writer and a run time of two and a half hours. Overall the general idea is very good and with the right actors, script and time frame in which to display all the segments of the movie realistically and in depth it could be a great film portraying gay rights, gender neutral love and sexual identity struggle. If Hollywood remade it I might consider going to see it again.",
         "Picture this: Unhappily single gay professor Brad Jenkins (J. Andrew Keitsch) is approaching the big 4-0 and is going through some serious inner self-evaluation. He is not only single, but also lonely. His best friend Julie (Joan Lauckner), who married his brother, convinces him to attend his parents' wedding anniversary. After a bad night, Brad gets drunk and wounds up in a car accident. When he wakes up, he finds himself back in high school as a young man. However, the big shocker is this: homosexuality is the 'normal' way of living. To solve reproduction, parental partners are set up, otherwise it's all guy with guy, gal with gal. At first Brad finds himself in heaven, and makes his ultimate teen dream come true by dating Roland (Tim Hammer). However, after meeting the unsuspecting young Julie, Brad finds himself more attracted to her. The two soon start to have an affair and thus become \"breeders\", that is a heterosexual couple, subject to discrimination. This latter part is what I personally found a tad problematic. The movie implies that homosexual chose their sexual orientation rather than being born that way. Up until Brad and Julie's affair, I thought this was an excellent movie that showed what it is like to be the minority all of a sudden; it had great potential to grasp the audience, regardless of their sexuality. The sudden heterosexual twist came as an unpleasant surprise for me, as I found the storyline could have been much more interesting if it would have focused on Brad's homosexuality and how his experiences from the 'past' could change him when he went 'back to the future'. It was also startling to watch the Blue Jean Ball scene when all of a sudden heterosexual couples formed even though moments earlier most of them were convinced that being gay was the only way. It just didn't make sense and from then on it was hard to take the movie seriously. Then of course, in the end Brad does meet his love, Roland, when they go hiking as 40-year-olds. I was unsure about this movie's message. Did it mean to say that gender is insignificant when it comes to finding true love? Or that who we are attracted to solely depends on our environment? Perhaps that we are mere products of our environment? It is unclear. Overall this was definitely an interesting movie to watch, as it showed a new take on homosexuality, and (at least for the first half) provided a unique way of portraying an if-you-were-in-my-shoes situation. The fact that it was a low budget production cannot be overlooked, nonetheless it is worth a watch. Maybe someone can decipher the message."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Tenure Track Productions"],
      "summaries": ["A gay man approaching a mid-life crisis is tired of being different because he is gay. He wants to be normal. Suddenly he is yanked back in time to when he was in high school. But this time, the world is gay and to be straight is considered deviant behavior. Then something else happens. He meets a girl. And suddenly normal becomes ...well almost normal."],
      "budget": 0
   },
   "movielensId": 140751,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-05-26",
      "dvdReleaseDate": null,
      "directors": ["Marc Moody"],
      "runtime": 90,
      "movieId": 140751,
      "title": "Almost Normal",
      "mpaa": "",
      "actors": [
         "J. Andrew Keitch",
         "Joan Lauckner",
         "Tim Hammer",
         "Nils Haaland",
         "Kehry Anson Lane",
         "Lindsay Schoneweis"
      ],
      "imdbMovieId": "0466669",
      "originalTitle": "Almost Normal",
      "genres": [
         "Science Fiction",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A gay man approaching a mid-life crisis is tired of being different because he is gay. He wants to be normal. Suddenly he is yanked back in time to when he was in high school. But this time, the world is gay and to be straight is considered deviant behavior. Then something else happens. He meets a girl. And suddenly normal becomes ...well almost normal.",
      "tmdbMovieId": 32633,
      "avgRating": 3.08333,
      "releaseYear": "2005",
      "numRatings": 6,
      "posterPath": "/u917XLsbvAZJRxZ8bZ4PIVgfWZo.jpg"
   }
}