{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gay interest",
         "id": 10199
      }],
      "imdb_id": "tt1137994",
      "video": false,
      "title": "3-Day Weekend",
      "recommendations": [
         31978,
         20116,
         47554,
         69746,
         47488,
         79919,
         27440
      ],
      "backdrop_path": "/eBCXh7kTCCIvBy7e3LXOBwYb8Lt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mac",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6b99",
               "name": "Chris Carlisle",
               "profile_path": null,
               "id": 84560,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cameron",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6b9d",
               "name": "Joel Harrison",
               "profile_path": null,
               "id": 84561,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kevin",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6ba1",
               "name": "Gaetano Jones",
               "profile_path": null,
               "id": 84562,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cooper",
               "gender": 1,
               "credit_id": "52fe47d39251416c750a6ba5",
               "name": "Derek Long",
               "profile_path": null,
               "id": 84563,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Simon",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6ba9",
               "name": "Derek Meeker",
               "profile_path": null,
               "id": 84564,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jason",
               "gender": 2,
               "credit_id": "52fe47d39251416c750a6bad",
               "name": "Douglas Myers",
               "profile_path": null,
               "id": 84565,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Andre",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6bb1",
               "name": "Daniel Rhyder",
               "profile_path": null,
               "id": 84566,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ace",
               "gender": 0,
               "credit_id": "52fe47d39251416c750a6bb5",
               "name": "Stephen Twardokus",
               "profile_path": null,
               "id": 84567,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bbb",
               "name": "Rob Williams",
               "profile_path": null,
               "id": 84568,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6bc1",
               "name": "Rob Williams",
               "profile_path": null,
               "id": 84569,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.874628,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19369,
      "vote_count": 5,
      "budget": 0,
      "overview": "Long-term couple Simon and Jason, along with daddy-ish Cooper and his boy du jour, escape to a mountain cabin for a three-day weekend away from their hectic city lives. Looking to spice up this long-standing tradition, they add a special twist to this years retreat - each of them must invite one attractive single friend to their mountain getaway.",
      "similar": [
         380874,
         47643,
         413666,
         160165,
         184352,
         383526,
         425193,
         26933,
         258034,
         52799,
         322127,
         26280,
         167571,
         340684,
         449176,
         338189,
         382475,
         261776,
         376867,
         428493
      ],
      "original_title": "3-Day Weekend",
      "runtime": 84,
      "poster_path": "/m5G7BPEFZrmQbeD0Ash48I2LA2I.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TLA Releasing",
            "id": 328,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Guest House Films",
            "id": 3598,
            "origin_country": ""
         }
      ],
      "release_date": "2008-06-03",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "Start Packing",
      "adult": false,
      "homepage": "http://tlareleasing.com/films/3-day-weekend/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rob Williams"],
      "runtime": 84,
      "synopsis": "Long-term couple Simon and Jason, along with daddy-ish Cooper and his boy du jour, escape to a mountain cabin for a three-day weekend away from their hectic city lives. Looking to spice up this long-standing tradition, they add a special twist to this years retreat - each of them must invite one attractive single friend to their mountain getaway. Arriving are a frisky former college roommate, a constantly naked yoga instructor, Jason's uptight co-worker and a high-priced rent boy who do indeed stir up the weekend. But this combination of new and old friends creates more tension than anyone ever anticipated. After 72 hours and multiple sexual couplings, new relationships form while others are cast onto shaky ground.",
      "writers": ["Rob Williams"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1137994/",
      "coverLink": null,
      "actors": [
         "Chris Carlisle",
         "Joel Harrison",
         "Gaetano Jones"
      ],
      "reviews": [
         "I generally liked this movie. A friend I was watching it with said that he did not, and that it was just full of cliché's. Well - he was right; but sometimes, cliché's are comfortable. With low budget indipendant gay films, I don't go in expecting much other than some nudity and cute guys. This movie delivered that, but also a nice story without the usual happy ending. Sure - there were some scenes where the dialog was a bit stilted; but I kind of found that charming as well. I found this a nice way to spend an hour and a half during the evening, curled up on the couch in my pajamas.",
         "The wino who wrote the one other review of this movie is right; this movie is no 'Citizen Kane.' The association of rosebud with this cast would turn even a vegetarian off tossed salad. And, the other reviewer is also right in stating that the acting is not good. It's like watching the understudies in community theater perform; it's a fair job, but not good. The production is competent; yet, with a tighter story and better acting this movie could have been better. But, even so, the movie would only achieve mediocrity because it's not a very interesting story: a bunch of gay white guys lounge around a comfortable country retreat and intermittently bemoan their relationships and nail one another. The theme of getting older and ending-up alone recurs but it doesn't receive much depth of exploration and consequently doesn't have much of an impact. Some of the characters mention AIDS a couple of times in a passing way but never really explore it as an issue either. Moreover, the issue of prostitution is treated as lite-fare, which might work for a comedy but not a drama. These themes are presented so much better in other low-budget movies with little known, but quite competent actors. Mitchell's \"Shortbus\" has a decent scene that shows the aging and isolation theme in a brief but immensely better manner. It's the sequence where the twinkie is talking to the old mayor in the salon. Araki's 'The Living End' provides a trenchant perspective of the AIDS issue in a compelling and reactionary story of lost youth. Morrissey's trilogy of 'Flesh', 'Trash' and 'Heat' are shoddy productions but fascinating to watch because the characters are captivating. Those actors, like Dallesandro, were unknown and untrained but imbued a sense of realism that the actors in this flick can't seem to achieve. Also, Morrissey presents male prostitution in a matter-of-fact manner; it isn't glamorized, vilified or trivialized. So, there are interesting gay-themed movies, but 3-day weekend isn't one of them.",
         "I was surprised by film. Generally, I only see gay low-budget indie film as show of solidarity for the rest of the community. Often, I'll have to turn it off after ten or fifteen minutes. This was clearly not \"Citizen Kane,\" but it wasn't half-bad either. The performances were kind of a mixed bag. There were a few that I felt were pretty strong, and a few that were weak. At least two of the actors started in one category and ended in the other. Some of the scenes with the actors paired off worked really well, and were probably the main reason the film works. The technical detail of the film are generally great. Even though clearly shot on DV, it avoids looking washed-out at all times. The camera is fairly locked down, but that's appropriate, given the material. The biggest flaw, as has been mentioned, is the script. There are far too many instances where a line or exchange just lands with a THUD, and the scenes that work are despite the material, not because of it. Still, it's better than a lot of low-budget gay cinema.",
         "Finally, a gay-themed film that just works. Sure the acting isn't perfect, but this micro-budget rises above the surface in queer film-making. The film doesn't do a Hollywood-ized ending of boy and boy reunite; rather, the film uses the three act narrative to lend its protagonist to leave learning something throughout. The use of \"threes\" is deftly threaded throughout the film...watch for it--three ways, three perspectives on sex with three boys sunbathing, three day weekend, three men who have slept with the same person, etc. It's smart, really smart, and there's something that the filmmaker wants to say within. It's not Citizen Kane, but doesn't try to be. It's just a nice 84 minutes with a big pink bow tied in the end. It's just as pleasant as a springtime glass of Chablis or summertime ale.",
         "Come at this movie with the right mindset and you'll enjoy it. 3-day Weekend, for me, was a study in how relationships change and grow with us, and how we need to grow and change with our relationships. It's pretty apparent from the start of the movie that sparks are going to fly during the course of this movie, of both the sexual and angry nature. Actually, from the premise alone it's clear there's going to be some major sparks. Thankfully, the drama doesn't ever go over-the-top and instead let's the impact of events play more naturally for the viewer. For example, Simon's confession. In the middle of a heated, shouted argument, Jason quietly asks, \"Aren't you tired of pretending you love me as much as I love you?\" When he's faced with the confession anyone in a long-term relationship fears, he walks out of the room and Simon makes a quiet exit. The impact of his absence felt in the awkwardness the actors did a wonderful job playing to. For some, this felt too open-ended, without a sense of resolution. So let me ask anyone who has had a long-term relationship end: would one three-day weekend be long enough to resolve everything? Another lovely aspect of this film was the mixture of ages we saw. It's not often that I'm treated to seeing older gay men giving advice to their younger counterparts (at least, without being played for camp value). The actors gave each of their characters a certain genuine feeling that I greatly appreciated. The movie does have a few flaws. Occasionally scenes were drawn out too long, certain conversations were left too implicit (what did Cameron and Andre talk about that last night?), and some characters and relationships were underdeveloped. In particular, it wasn't always easy to see the deep (platonic) affection holding Cooper and Jason's friendship together. And Cameron felt like he was just there to be there, though he would have made an interesting foil of sorts for Andre. Overall, though, this was a charming movie, with some wonderful perspectives, from gay men past their partying age (or for those of us who just aren't into that scene), people trapped in a relationship, and those of us starting a new one. It's worth watching, especially if you enjoy studies in characters and their relationships. In closing, a description of our players: Jason (Douglas Myers): The host for the weekend, a man in his late forties who loves to escape to his gorgeous cabin with his best friend, Cooper, and his beloved partner for many years, Simon. Simon (Derek Meeker): Our second host for the weekend and Jason's long-time partner who feels more and more trapped in his relationship. In his words, he's ready for something different. Cooper (Derek Long): A man in his mid-forties, his friends lovingly tease him about always having a boy-of-the-month (and yet, Ace and he have been together for over a year now...) Ace (Stephen Twardokus): Cooper's 'boy-of-the-month', Ace is a sweet and relatively innocent (though not exactly naive) aspiring actor in his mid-twenties. He has faith in his relationship with Cooper and believe he's found 'the one.' Andre (Daniel Rhyder): Simon's guest for the weekend, Andre is a male escort that loves his job and has had Simon as a client for sometime now. Mac (Chris Carlisle): Jason's guest for the weekend, a painfully shy, partly closeted, and warmhearted young man from his work. Kevin (Gaetano Jones): Cooper's guest and his yoga instructor, possessing an uncommon serenity and deep appreciation for the life he has. Cameron (Joel Harrison): Ace's invitee, a party boy who's more interested in getting high than being in touch with nature.",
         "'3-Day Weekend' seemed like it was dreamt up in a dark gay bar one night by best buds who had a bit too much and Donna Summer's 'Last Dance' was playing signifying it was closing time. The nicest thing I could say about this movie was that, though they attempted to pick some good looking guys and only three actually were (Carlisle, Jones and Harrison,) they did actually pick all-around guys: bears, queens, someone for everyone. That is, if you only like Caucasians. Unfortunately, everything else either tried too hard, such as the clichéd and predictable dialogue, mostly amateur acting or the tired old drama, almost making this a gay-themed Tyler Perry film. Two couples bring four strangers to a beautiful cabin in the desert. Well, they called it the desert – I live in the desert – Phoenix, AZ, and this is not a desert. Prescott or Flagstaff, AZ, perhaps, but not the real desert. Anyways, they invited these four gay guys with four unique personalities \"just for fun.\" Again, drama ensues and couples fight to end or start to build their relationships while having sex or orgies. Yeah, there's a lot of nudity, mostly butts, to look at. But for the most part, it's just blah, blah, blah. I will say this, the best scene of the movie, didn't even make it in the film – and I'm almost 100% sure it wasn't meant to be. Watch the alternative ending. It had me rolling. Typically, I won't judge a film on DVD extras, or things it is not, but this made up for a lot of the bad in the film. (Ironically, if it had made it in the film, it would certainly be a WTF ending and wouldn't have been as funny.)",
         "Was there ever even a screenplay? Much less a credible screenwriter? What a waste of some reasonably decent acting talent to put them in front of a camera and give them absolutely nothing to do. Irrespective of how many \"meaningful\" and heart-warming tunes you embed beneath your \"dialogue,\" you need a foundation of a story that at least has a modicum of substance . Or at the least, hints at it. Other than male nudity that is as \"coy\" as is the presumed \"plot.\" A shame, indeed. This director (/screenwriter) actually produced a far better product with his \"Long Term Relationship.\" It's hard to believe that this vacuum of a film came from the same man. Possible spoiler: The only reason I gave it a two is because of the somewhat cute turn when the hustler arrives and was recognized by many others. That was the only element that caught my attention and gave me a moment (albeit fleeting) of hope that this flick might develop into something worth the time. Not."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Guest House Films"],
      "summaries": ["Director Rob Williams (Long-Term Relationship, Back Soon) serves up a shaken and stirred cocktail of sexual intrigue, humor and drama in his latest about an unlikely group of friends and lovers. Long-term couple Simon and Jason, along with Cooper and his boytoy du jour, meet annually for a three-day getaway. Looking to spice up the tradition, they add a twist - each invites one attractive, single friend to their mountain retreat. Soon a frisky former college roommate, an often naked yoga instructor, Jason's bashful co-worker and a high-priced rent boy arrive to stir things up. From bedhopping to breakups this is 72 hours they'll never forget."],
      "budget": 0
   },
   "movielensId": 140757,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-06-03",
      "dvdReleaseDate": null,
      "directors": ["Rob Williams"],
      "runtime": 84,
      "movieId": 140757,
      "title": "3-Day Weekend",
      "mpaa": "",
      "actors": [
         "Chris Carlisle",
         "Joel Harrison",
         "Gaetano Jones",
         "Derek Long",
         "Derek Meeker",
         "Douglas Myers",
         "Daniel Rhyder",
         "Stephen Twardokus"
      ],
      "imdbMovieId": "1137994",
      "originalTitle": "3-Day Weekend",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["8BG8wEwvZgM"],
      "plotSummary": "Long-term couple Simon and Jason, along with daddy-ish Cooper and his boy du jour, escape to a mountain cabin for a three-day weekend away from their hectic city lives. Looking to spice up this long-standing tradition, they add a special twist to this years retreat - each of them must invite one attractive single friend to their mountain getaway.",
      "tmdbMovieId": 19369,
      "avgRating": 2.08333,
      "releaseYear": "2008",
      "numRatings": 6,
      "posterPath": "/m5G7BPEFZrmQbeD0Ash48I2LA2I.jpg"
   }
}