{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0838192",
      "video": false,
      "title": "Fashion Victims",
      "recommendations": [
         19654,
         46755,
         87107,
         26423,
         19965,
         47358,
         54325,
         140208,
         44352,
         15706,
         64802,
         43547,
         32671,
         96551,
         75910,
         99043,
         159015,
         16240,
         1740,
         26823
      ],
      "backdrop_path": "/ccltKWYl2OzmNlhZsnejnmEvN21.jpg",
      "revenue": 1101480,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wolfgang Zenker",
               "gender": 2,
               "credit_id": "52fe4639c3a368484e085189",
               "name": "Edgar Selge",
               "profile_path": "/wGpd1SrAZ8i9pATAv3xBnr2LWS2.jpg",
               "id": 7822,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Karsten Zenker",
               "gender": 2,
               "credit_id": "52fe4639c3a368484e08518d",
               "name": "Florian Bartholomäi",
               "profile_path": "/qoxJO79wY8HDMozA5RjPcRnotLy.jpg",
               "id": 231835,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Steven Brookmüller",
               "gender": 2,
               "credit_id": "52fe4639c3a368484e085191",
               "name": "Roman Knizka",
               "profile_path": "/lduO7SttesGp6K4SGmaIbJNTz3M.jpg",
               "id": 36437,
               "order": 2
            },
            {
               "cast_id": 22,
               "character": "Erika Zenker",
               "gender": 1,
               "credit_id": "53536d7dc3a3681d98003976",
               "name": "Franziska Walser",
               "profile_path": "/r9e3HPZ0J4c0O4UUXxkkGZFgu06.jpg",
               "id": 48702,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Brigitta",
               "gender": 1,
               "credit_id": "52fe4639c3a368484e085199",
               "name": "Traute Hoess",
               "profile_path": null,
               "id": 5522,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Horst",
               "gender": 2,
               "credit_id": "52fe4639c3a368484e08519d",
               "name": "Horst Krause",
               "profile_path": "/9vaDekkQcPZubFhbmG1znr4cISK.jpg",
               "id": 36928,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Polizist Gerhardt",
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851a1",
               "name": "Gottfried Breitfuss",
               "profile_path": null,
               "id": 231837,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lucie",
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851a5",
               "name": "Lara Beckmann",
               "profile_path": null,
               "id": 231838,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Nicola",
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851a9",
               "name": "Janna Wangenbach",
               "profile_path": null,
               "id": 231839,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Frau Pfeiffer",
               "gender": 1,
               "credit_id": "52fe4639c3a368484e0851ad",
               "name": "Jessica Schwarz",
               "profile_path": "/l4zJpkc9LMJGXPpcDEAcA1QWRq9.jpg",
               "id": 17068,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Frau Retzlaff",
               "gender": 1,
               "credit_id": "52fe4639c3a368484e0851b1",
               "name": "Irm Hermann",
               "profile_path": "/uptdP1km7K5J27MQCQXEVmsTuMJ.jpg",
               "id": 2729,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Frau Rinne",
               "gender": 1,
               "credit_id": "52fe4639c3a368484e0851b5",
               "name": "Eva Löbau",
               "profile_path": "/70CVxS68wiN0U4e2Vm0iadxAJlT.jpg",
               "id": 7161,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Herr Schiller",
               "gender": 2,
               "credit_id": "52fe4639c3a368484e0851b9",
               "name": "Elert Bode",
               "profile_path": null,
               "id": 33116,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Frau Hellberg",
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851bd",
               "name": "Susanna Fernandes-Genebra",
               "profile_path": null,
               "id": 231840,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Endverbraucherin",
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851c1",
               "name": "Sabine Hollweck",
               "profile_path": null,
               "id": 231841,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851c7",
               "name": "Ingo Rasper",
               "profile_path": null,
               "id": 937777,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851cd",
               "name": "Tim Streuber",
               "profile_path": null,
               "id": 937778,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851d3",
               "name": "Kristine Knudsen",
               "profile_path": null,
               "id": 937779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851d9",
               "name": "Boris Michalski",
               "profile_path": null,
               "id": 4648,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4639c3a368484e0851df",
               "name": "Ingo Rasper",
               "profile_path": null,
               "id": 937777,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.57381,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 60850,
      "vote_count": 11,
      "budget": 0,
      "overview": "At 52, traveling salesman Wolfgang Zenker (Edgar Selge) is in old school territory: he peddles the company's classic clothing line to boutiques that cater to women over 35. When Wolfi loses his drivers license in his brand-new Mercedes but can't afford to lose the season's sales because his frustrated wife (Franziska Walser) desperately wants a new bathroom, their son's vacation plans take a back seat as Karsten (Florian Bartholomäi) is forced to making sales rounds with his father instead of celebrating his high school graduation in Spain. Also making the rounds in small town southern Germany is successful and attractive sales rival Steven Brookmüller (Roman Knizka), 33. As the men's paths cross, long-hidden secrets are revealed and things come to a hilarious head.",
      "similar": [],
      "original_title": "Reine Geschmacksache",
      "runtime": 105,
      "poster_path": "/goMyQXtDIBbPPv0MFCNFRqwH3yZ.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [],
      "release_date": "2007-08-08",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Ingo Rasper"],
      "runtime": 105,
      "synopsis": "At 52, traveling salesman Wolfgang Zenker (Edgar Selge) is in old school territory: he peddles the company's classic clothing line to boutiques that cater to women over 35. When Wolfi loses his drivers license in his brand-new Mercedes but can't afford to lose the season's sales because his frustrated wife (Franziska Walser) desperately wants a new bathroom, their son's vacation plans take a back seat as Karsten (Florian Bartholomäi) is forced to making sales rounds with his father instead of celebrating his high school graduation in Spain. Also making the rounds in small town southern Germany is successful and attractive sales rival Steven Brookmüller (Roman Knizka), 33. As the men's paths cross, long-hidden secrets are revealed and things come to a hilarious head.",
      "writers": [
         "Ingo Rasper",
         "Tom Streuber"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0838192/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTU2NTc3MjU5N15BMl5BanBnXkFtZTcwODY2MjgyMg@@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Edgar Selge",
         "Florian Bartholomäi",
         "Roman Knizka"
      ],
      "reviews": [
         "In the U.S., it's called Fashion Victims, but in it's native German, its \"Reine Geschmacksache\". Co-Written and directed by Ingo Rasper, it's the story of a week in the life of the Zenker family. Dad (Edgar Selge) is a salesman in the clothing industry, and needs the help of his gay son Karsten (Florian Bartholomai). Except that Karsten had other plans, which causes even MORE friction between father and son, which was already pretty bad . Mom (Franziska Walser) and Dad are always bickering, which doesn't help the mood. The first 40 minutes are very dark and depressing, as things just get worse and worse. Then Karsten meets up with one of Dad's co-workers, and things start to happen..... This was the fourth project written and directed by Rasper, and it won several awards at European film festivals. I wish they had used a different font for the subtitles, as they are very well done, but a little hard to read. Good story -- an hour and a half long. Too bad none of the other Rasper are available on amazon.",
         "(( Alternate Title for this review: \"Thank god for espresso machines that make you take your clothes off.\" )). (( Alternate Theme for this film: A Plaid Print becomes the saving grace: It saves a job....it saves a marriage....and it saves a guy/guy romance. What more could any of us ask from such a small thing? )). Not to be outdone in the year 2007, of some quite good gay films (the Yank's \"Shelter\" and the Brit's \"Oh Happy Day\"), now comes along Germany's funnily enjoyable \"Fashion Victims.\" Film features the Germanic version of Trevor Wright (a wonderfully ingratiating Florian Bartholomai as the near 20 year old, virginal Karsten) and a Teutonic Brad Rowe (fun loving, but caring, Roman Knizka as gay-experienced, 30-something Steven). Here's a marvelous little movie I truly believe you're gonna love. Why? Because you will so like this guy, Steven, with his light-hearted and devilish approach to life...and to getting our oh-so-innocent Karsten into bed for his very first time. And you'll absolutely fall in love with relative newcomer Bartholomai as the does'nt-know-what-to-do young innocent in need of a \"guiding hand\" (no, no....not a hand for \"that\" purpose; well, maybe there WILL come a time for that). Karsten is played as just about the most lovable gay youth you're going to come across---he's so sweetly shy it almost pours off the screen. (I'll bet you thought \"Shelter's\" Zach was that person; I do admit: it's a hard call). And as for the fun to be with Steven, let's just say that he's more than eager to give our Karsten the guidance he's in need of. And if you closely watch, you will see that \"K's\" presence always seems to put a grin on the devilish Steven's face. Gotta say that \"S\" does have great eyes---just watch them closely anytime he's with Karsten...they practically devour the kid throughout this film. If there's any bad news for those of you looking ONLY for gay romance, it's that you'll have to wade through a lot of \"family stuff\". In this regard, Karsten's parents can't be left out of consideration; actually much of this movie involves them. It might not really be called a \"gay film,\" per se; it's more a \"family affair kind of thing\"...with Dad being front and center for most of it, and Mom having her little bits from time to time. Dad, Wolfgang, pretty much comes across as a know-it-all S.O.B., which throughout the film poses a big question for us: Is he going to wind up being redeemable in our eyes (and Karsten's...and Mom's)? As for Mom, Erika (who knows more than our sweet young guy thinks she does), she is his most loving and supportive fall-back person. And, most wonderfully, she takes no crap from anyone. So,what we really have with these two older characters, are parents playing out their own little war...a \"War of the Roses\" if you will (most of you likely way too young to remember this 1989 Michael Douglas romp). Speaking of \"war,\" perhaps this is the best point to mention that \"Fashion Wars\" might have been a far better film title, inasmuch as it certainly does have its share of skirmishes (well, admittedly, its share of \"victims,\" too). Of course, who knows how \"twisted\" words become when subtitling German to English for (in that regard, I can say there were other noticeable \"rough spots\" in this film). Just a few wrap-up thoughts for you here: Not to be forgotten, there's that brilliantly done home bedroom segment in which Karsten receives both an unexpected visitor and his first kiss. It's one of \"those\" scenes viewers find themselves almost physically holding their breath in anticipation (and Steven really, really does outdo himself here). Maybe it's just me and my not getting the whole \"lesbian scene\" thing, but more and more, as the film progressed, I was getting the impression that Mom's \"helpful\" friend, Brigitta (a brashly funny Traute Hoess), wants to be a lot more than \"just a friend\"---if you get my drift. When the film's long-a-coming \"showdown\" finally does arrive, it's a doozie. Yes, indeed, you are going to love this film's final \"action\" scene (NO, not \"that\" kind of action---keep a clean mind why don't'cha). All I'll say is that it involves a vehicle...and a shotgun...and some sidesplitting moments. The film-end denouement between father and son is near pitch perfect. It is a memorably happy moment, even topping Mom's wonderful final scene with her son (\"I know---I understand---I accept\"). What more could any gay boy ask for? Other than the preceding, I'll only add: I am so mad at you, Mr. Director! Why? It seems to me that a little see-you-later kiss through a vehicle window, at film's end, would have been a great way to wind things up (must I do all the thinking for you guys?). Anyway, thanks for an otherwise wonderful little ending scene; your gay audiences will ever appreciate being left with a feeling of hope. PS--Oh yes, oh yes........you're gonna have fun with this one. ****",
         "FASHION VICTIMS (Reine Geschmacksache) is an entertaining little film that seems to have its roots in the French farce genre: characters running topsy turvy into situations that include hidden identities, well paced plans that go awry for odd reasons, and in general a healthy look at human foibles. Writers Tom Streuber and Ingo Rasper (who also directs) have dished up this confection with just the right amount of social comment, interpersonal relationship challenges, business antics, and family disasters to keep the comedy moving. And fortunately they have a fine cast of excellent actors to assure its success. Grumpy egocentric Wolfgang Zenker (Edgar Selge) is first a clothing line salesman in the fashion industry and second an abusive husband to Erika (Franziska Walser) and his closeted son Karsten (Florian Bartholomäi), a young lad who yearns to go off to university to study Spanish but is shamed into being a driver for his father when the police reveal that Wolfgang has a suspended license. One of Wolfgang's business competitors Steven Brookmüller (Roman Knizka), a handsome young man with an eye for Karsten, parts company with Wolfgang - a fact that begins a chase of boutique visits and competition that alienates Wolfgang even further from his son and wife. When Wolfgang's true financial picture is as bleak as possible, both Erika (encouraged by her single girlfriend Brigitta (Traute Höss) and Karsten elect to indulge in their own futures, and in a series of hilarious accidents the lives of all the characters collide and change. Fast paced, well photographed, and warmly acted, FASHION VICTIMS is a fun film that though it is listed as a gay movie, there is little in the story other than some momentary suggestions to deserve that label. This is a fun farce that should find a wide audience seeking a little escape from reality! Grady Harp",
         "I was really looking forward to seeing this movie, and I tried to like it, but it's just awful. Maybe I just don't get German humor, but to me this was a frenetic 96-minute barrage of (almost) universally unbelievable, completely obnoxious, cartoonish characters, stupider \"comic\" situations than you'd ever see on even the very worst TV sit-com, and ridiculous, extremely heavy-handed slapstick. The only even slightly redeeming feature is Florian Bartholomäi in the lead role as Karsten. He's cute, sweet and charming, and he comes light years closer than anybody else to acting something like a real human being. I can't believe he'd ever have looked twice at a shallow jerk like Steven if he hadn't been the first man who ever paid attention to him. I'd like very much to see Bartholomäi in a good movie, but unfortunately this is not it. This is a real lemon.",
         "\"Reine Geschmacksache\" or \"Fashion Victims\" is a German 95-minute movie from 2007, so it has its 10th anniversary this year. The writer and director is Ingo Rasper and it his certainly his most known work. The cast does not really feature any of Germany's most known actors, but the likes of Slge, Bartholomäi, Krause, Schwarz, Walser and Kobus may at least be known to some. Also Fassbinder regular Irm Hermann plays a very small part. This one we have here is a comedy for the most part. There are several areas elaborated on in here. We have a dad who struggles with a new rising entrepreneur in his company and also with his son, who does not want to follow in his father's footsteps in terms of his career. The mother of the family is not really happy with the relationship and has her own problems. The son struggles with his sexuality and also with his new potential partner, who is actually the father's colleague that I mentioned earlier. So yeah, this is really a huge coincidence and honestly it takes away a lot of the realism here. There are more serious moments in here too, but they are all depicted from a comedy perspective, even when one character has a huge gun and seems to fire at other or when one almost drowns another character. It is pretty odd and these moments towards the end really did not help the film at all because it turns it into something that we call \"Klamauk\" here in Germany, which basically means spectacular showy stuff that is never authentic but just feels included for the sake of it. This film is (if you look at the lists on the right here on IMDb) sometimes also called a gay(-themed) movie and I really hate that description, not just for this film, but also in general. Yes the homosexual relationship is one essential component, but you can also call this film a father-son movie, a job-related movie or a hetero-themed movie. But nobody does that. So why focus on sexual preference here (especially when the main argument for gays is always equality and they just want to be themselves instead of being seen as different) when there are so many more layers to this film here. Of course, I am not saying that these layers are elaborated on convincingly (many certainly aren't), but they are there and that is enough. The acting in this film is overall not too bad, but the story just lacks real authenticity and depth. Like I already said, \"for the sake of it\" or \"style over substance\" is a fitting description here. And the worst thing about it all was maybe Franziska Walser's character and performance. Looks like she got her own (gay-themed?) story in here as well and honestly, I could have done not only without this, but even without her character as a whole and with Selge's simply being a single dad. So yeah, overall, the bad outweighs the good for sure and I don't recommend checking it out. Thumbs down and this film is not half as funny as it tries to be."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Knudsen & Streuber Filmproduktion",
         "Südwestrundfunk (SWR)",
         "noir film GmbH & Co. KG"
      ],
      "summaries": ["Wolfgang Zenker, a middle-aged traveling ladies' fashion salesman is in dire straits: his deadly rival is threatening to steal his best customers and he's lost his driver's license. Desperate to stay one step ahead of his young enemy salesman, he cancels his son's holiday and employs him as an unwilling chauffeur. Things go from bad to worse - the bank is after him, the taxman catches up with him, his wife leaves him, his son announces he's gay and falls in love with his father's rival! Family and foe meet in an uproarious showdown where the bullets and misunderstandings fly."],
      "budget": 800000
   },
   "movielensId": 140880,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2007-08-08",
      "dvdReleaseDate": null,
      "directors": ["Ingo Rasper"],
      "runtime": 105,
      "movieId": 140880,
      "title": "Fashion Victims",
      "mpaa": "",
      "actors": [
         "Edgar Selge",
         "Florian Bartholomäi",
         "Roman Knizka",
         "Franziska Walser",
         "Traute Hoess",
         "Horst Krause",
         "Gottfried Breitfuss",
         "Lara Beckmann",
         "Janna Wangenbach",
         "Jessica Schwarz",
         "Irm Hermann",
         "Eva Löbau",
         "Elert Bode",
         "Susanna Fernandes-Genebra",
         "Sabine Hollweck"
      ],
      "imdbMovieId": "0838192",
      "originalTitle": "Reine Geschmacksache",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "At 52, traveling salesman Wolfgang Zenker (Edgar Selge) is in old school territory: he peddles the company's classic clothing line to boutiques that cater to women over 35. When Wolfi loses his drivers license in his brand-new Mercedes but can't afford to lose the season's sales because his frustrated wife (Franziska Walser) desperately wants a new bathroom, their son's vacation plans take a back seat as Karsten (Florian Bartholomäi) is forced to making sales rounds with his father instead of celebrating his high school graduation in Spain. Also making the rounds in small town southern Germany is successful and attractive sales rival Steven Brookmüller (Roman Knizka), 33. As the men's paths cross, long-hidden secrets are revealed and things come to a hilarious head.",
      "tmdbMovieId": 60850,
      "avgRating": 3,
      "releaseYear": "2007",
      "numRatings": 8,
      "posterPath": "/goMyQXtDIBbPPv0MFCNFRqwH3yZ.jpg"
   }
}