{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "based on manga",
            "id": 13141
         },
         {
            "name": "extinction",
            "id": 156803
         }
      ],
      "imdb_id": "tt2072230",
      "video": false,
      "title": "Attack on Titan",
      "recommendations": [
         340382,
         330081,
         282069,
         199771,
         72013,
         379088,
         220447,
         282070,
         259129,
         300168,
         187801,
         67314,
         144696,
         134768,
         84372,
         78250,
         27612,
         251768,
         338676,
         272691
      ],
      "backdrop_path": "/dmL16DKHIh8bLle3XAiRSErQNxM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Eren Yeager",
               "gender": 0,
               "credit_id": "542d220cc3a36845cf00177a",
               "name": "Haruma Miura",
               "profile_path": "/zEEtjHUVI8xmEsKIbewjtNRS7M6.jpg",
               "id": 133168,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Mikasa Ackerman",
               "gender": 1,
               "credit_id": "54928d46c3a3683cf8000fcd",
               "name": "Kiko Mizuhara",
               "profile_path": "/qjXWSf7R3rRDBjc3mcu4P3248ug.jpg",
               "id": 226711,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Armin Arlert",
               "gender": 2,
               "credit_id": "54928d8cc3a3683d07000ff9",
               "name": "Kanata Hongo",
               "profile_path": "/mMz3Brw5dDxnCIr6SXOQl7BJAzm.jpg",
               "id": 114725,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Sasha Blouse",
               "gender": 1,
               "credit_id": "54928e02925141091e000fee",
               "name": "Nanami Sakuraba",
               "profile_path": "/5fZw5LSnLiWN6sR3VeEbW1LyE0q.jpg",
               "id": 118579,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Jean Kirstein",
               "gender": 0,
               "credit_id": "54928e8ec3a3683cfe001196",
               "name": "Takahiro Miura",
               "profile_path": "/6oga1G8Z1nwPDsrRunjPkP6DUQG.jpg",
               "id": 1096815,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Hanji Zoe",
               "gender": 1,
               "credit_id": "5531049ac3a368411200211e",
               "name": "Satomi Ishihara",
               "profile_path": "/i5OqxV0894xkpJt1IJCfNsOMHCA.jpg",
               "id": 224664,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Shikishima",
               "gender": 2,
               "credit_id": "55ec69a59251413e4100fd12",
               "name": "Hiroki Hasegawa",
               "profile_path": "/vSpSbNnODC99LvHsCHwpAQOsQBT.jpg",
               "id": 1098600,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Hiana",
               "gender": 1,
               "credit_id": "5531053ec3a368411e001ffa",
               "name": "Ayame Misaki",
               "profile_path": "/mPlWI6hPCbyreeUIBitS9UMmsoI.jpg",
               "id": 1015824,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Souda",
               "gender": 0,
               "credit_id": "5531055bc3a368411200215f",
               "name": "Pierre Taki",
               "profile_path": "/n6LKguACBEWMM2FNCqTQVEM7Lpx.jpg",
               "id": 120434,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Kubal",
               "gender": 2,
               "credit_id": "55310568c3a368412100204f",
               "name": "Jun Kunimura",
               "profile_path": "/zMf3lIodQvte4VDnCBnuG9ZEx72.jpg",
               "id": 2541,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Fukushi",
               "gender": 0,
               "credit_id": "553105a3c3a3684117001f61",
               "name": "Shu Watanabe",
               "profile_path": "/qqNqFRTKemEJIkPW1ekN7I3oiVZ.jpg",
               "id": 936281,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Lil",
               "gender": 1,
               "credit_id": "553105c1c3a3684117001f6e",
               "name": "Rina Takeda",
               "profile_path": "/u3DssIqFJP12xAAu4Heu5KpJHQ1.jpg",
               "id": 120913,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "55c790b892514105d20026fb",
               "name": "Nana Seino",
               "profile_path": "/7gljgnlgRKp9Q2FOm4dAYYSrY2A.jpg",
               "id": 1393772,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Sannagi",
               "gender": 0,
               "credit_id": "55e40b2b92514137d7003315",
               "name": "Matsuo Satoru",
               "profile_path": "/tgGVTt9Uned44dsCEXNZB37NGTw.jpg",
               "id": 1502395,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "558f39f192514123eb001354",
               "name": "Shinji Higuchi",
               "profile_path": "/9FNkAnJyZibz2E1I6Jn6rgQVqkb.jpg",
               "id": 80752,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "558f39fe92514165120005df",
               "name": "Hajime Isayama",
               "profile_path": null,
               "id": 1363967,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 0,
               "credit_id": "558f3a0f92514165120005e4",
               "name": "Yusuke Watanabe",
               "profile_path": null,
               "id": 115937,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "558f3a1a92514178e3001a2f",
               "name": "Tomohiro Machiyama",
               "profile_path": null,
               "id": 1482217,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "558f3a899251416512000630",
               "name": "Yuji Ishida",
               "profile_path": null,
               "id": 132156,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "558f3a93c3a36843490016a2",
               "name": "Genki Kawamura",
               "profile_path": "/kutSH7CtpWcgBGc5Imr4A6gk1x.jpg",
               "id": 237364,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "558f3a9f9251410ca7000d93",
               "name": "Shôji Ehara",
               "profile_path": null,
               "id": 1401919,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "558f3ab1c3a36843490016b3",
               "name": "Takeshi Shimizu",
               "profile_path": null,
               "id": 1307317,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "558f3ac592514178e3001a9c",
               "name": "Shin'ichi Mita",
               "profile_path": null,
               "id": 1482218,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57e5fe6cc3a3682269002f08",
               "name": "Akihiro Yamauchi",
               "profile_path": null,
               "id": 1684157,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.832209,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 295830,
      "vote_count": 212,
      "budget": 0,
      "overview": "100 years ago, titans suddenly appeared on Earth. Soon, human civilization veered on collapse due to the titans. Humans then built a giant wall to defend themselves. Within the giant walls, humans lived in peace, but, 100 years later, the giant wall is broken.",
      "similar": [
         7191,
         124905,
         5876,
         339967,
         293167,
         351460,
         39256,
         339530,
         46261,
         588,
         408220,
         40761,
         16859,
         841,
         49017,
         1927,
         58,
         135397,
         68726,
         18823
      ],
      "original_title": "進撃の巨人 ATTACK ON TITAN",
      "runtime": 98,
      "poster_path": "/dimmAl5fs7qMbAzEMLPAmS5XIgz.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
            "name": "Nikkatsu",
            "id": 955,
            "origin_country": "JP"
         },
         {
            "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
            "name": "Toho Company",
            "id": 882,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Kôdansha",
            "id": 59118,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Licri",
            "id": 59119,
            "origin_country": ""
         }
      ],
      "release_date": "2015-08-12",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/qSRo2K0dZCwZkokUYknNy8lkKcF.jpg",
         "name": "Attack on Titan Collection",
         "id": 370411,
         "poster_path": "/shyiGCzDQv3RH7GFXvsXB8BeNHa.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.shingeki-seyo.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shinji Higuchi"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Hajime Isayama",
         "Tomohiro Machiyama"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt2072230/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZDk5MTcxZmItYWM2Ny00NjIwLWE2YWQtYjczMWFiZThjN2JkXkEyXkFqcGdeQXVyNDQyNzIwNDQ@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Haruma Miura",
         "Kiko Mizuhara",
         "Kanata Hongô"
      ],
      "reviews": [
         "A few minutes into the movie I was taken by surprise that the director chose to wildly mash up the characters and their relationships. Even though I really like the anime I was open to a new envisionment of the source material, since prejudice is something I try not to practice. Maybe the director wanted a new interpretation, while maintaining the essence of the series. But then it dawned on me that this new interpretation was leaky at best and the capturing of the essence was a parody. It was a 90 minute crap-fest of half-assed dialog, disinterested story telling and slasher-like violence. The movie also had a particular inability of finding a tone. Any tone. All the scenes feel staged, unreal and almost completely unrelated. Most disturbingly however was the implausibility. Nothing seems connected and nobody related. This is a waste of brilliant source material!",
         "First of all I have seen the anime and it's definitely one of my favorites. This movie is a complete and utter disgrace to the franchise and does not have any positive quality that gave the franchise the popularity it earned nor does it have any qualities that make up for how bad it is. The story in this version is for some reason changed severely from the original, which I would not even mind if it were just as good or even remotely decent, but no, it is very, very far from that. The story has A LOT of holes in its plot and logic. They removed the things that made the story beautiful, dramatic, and powerful and replaced them with their own amateurish, illogical, juvenile, excuse for writing. I cannot even fathom why or how the creator allowed this to happen. Like the story, the characters are so heavily altered, they don't even have the same personalities as the original. Eren is now some kind of personification of \"cool\" from some nine year old's mind and Mikasa is now your average dumb, doting, beta girl. The dialogue is so completely stupid that I could not stop cringing the entire time. Despite the fact that they only needed 90 minutes for this movie, there are still a lot of awkward, unnecessary scenes and pauses that make the cringing feeling really set in. The acting is also terrible, it's more of something you would expect from kids in a school play rather than from professionals in a big screen movie for a huge franchise. The CGI would have been impressive twenty years ago, like everything else they seemed to have settled on something mediocre at best yet they still add a lot of unnecessary CGI scenes that just help pronounce how bad it is. I have no idea how much their budget was but they can't expect to release this movie without expecting massive negative criticisms not just from fans but even from your average consumers of today's media. Yes if you showed this movie to a caveman who's never seen any recent entertainment media, he might be impressed but the standards have been set and this garbage cannot even pass as \"decent\" for today's standards. Even more so because this movie belongs to a huge, successful, popular franchise and this movie has had so much hype leading up to its release.",
         "Attack on Titan is recently one of the most popular manga/anime in a while, it wasn't nearly as rich as some of the greatest ones out there, however the material tackles a rather mature subtext, otherwise a really fascinating showcase of macabre in a larger scale. It's clearly destined to be a movie, it might as well fit in today's blockbuster trend of post-apocalyptic settings and revolution ordeals. But the movie's approach is rather standard in comparison. While it still wonderfully realizes the most grotesque moments of its source material, the characters are watered down with less interesting plights. Newcomers might find its premise intriguing, but what makes Attack on Titan interesting is hardly existent in this adaptation. How the main characters are introduced is painfully contrived. Like every piece of exposition is immediately crammed into that one long scene that is supposed to establish who they are and what their world is. The difference is it's not quite compelling. I personally don't mind changes from its source material; the protagonist, Eren, is basically now a slacker who is tired of living behind the colossal walls from the titans, instead of an aggressive kid with some sociopathic tendencies who vows for revenge. It's not necessarily horrible since they're still represented as unlikely heroes, but Eren's arc is basically just trying to win back his girl and living up to that image, it makes him look lousier. What makes this character originally interesting is the fact that he is a traumatized kid who is too full of himself, which eventually crosses the line of his humanity and morality. It may not be the friendliest role model you'll see from a hero, but it rather makes him more relatable. And that sounds more reasonable since this circumstance would really affect one's senses into insanity or paranoia. But in this movie, they're just verbally expressing their fears, sentiments and humor. The plot is ought to be followed through these characters, but most of them are single noted. They might as well exist in some YA where they're designed to be hormonally appealing. In the end, they're clearly just uninteresting. To its credit, the visuals are pretty cool. It may not be perfect or spectacular, but it's impressive enough to take these exciting moments into live action. There are some scenes that can be count as genuinely awesome, specifically the climax, even though it now seems to be quite senseless since they're taking this story to a different direction. Nevertheless, as long as these Titans and gore are on screen, there is some real pleasure to be taken. Attack on Titan, in spite of its scale and production, is surprisingly underwhelming. The filmmakers are clearly just following the conventional direction of adapting a popular material, more or less. Visually, it's appropriate to call it a fan service; because it indeed puts these big action where it belongs. But thematically, it is a letdown. Attack on Titan isn't only great for its creepy titans and cool gadgetry, in fact, these things are basically small compared to its surprising complexity within its characters. That is what I personally believe that makes this material great, and yet that's what the movie ended up altering. Therefore it's just a standard B-Movie. It can be mindless fun, but you won't find anything else to like in the end.",
         "This movie was so incredibly disappointing. Madman completely wasted their time on this rubbish. I can not believe how they have run Hajime Isayama's manga through the mud, destroying it. Not one aspect, beside the names and existence of Titans, of this movie adaptation was similar the manga or anime. They completely cut out integral characters, plot lines and places. Instead adding useless romance arcs or making up interactions between characters who never even existed. To put this simply, this movie fails in the same way as M. Night Shyamalan's adaptation of Avatar The Last Air Bender, to capture the essence of the original text. I suggest they take every copy of this crap and bury it in a pile like the Atari's E.T. the Extra-Terrestrial and NEVER speak of it again! Madman I suggest you spend you time and money on better projects in future.",
         "For fans of the anime don't bother watching this film. I was excited to watch this live action movie but, within the first 45 minutes of the film I was let down so much. There's just too much wrong with the film to even begin with. From Mikasa disappearing in the beginning of the movie to the names of the walls and even the different regiments. There are only two good things I liked about the movie. The first being the titans in general. They are big and menacing just like in the anime. The second is Erens transformation into a titan. Other than those two things nothing else makes this film worth watching. I recommend anyone that wants to see Attack on Titan to please go read the manga or watch the anime. You wont be let down.....this movie should not have been released in my opinion.",
         "*** This review may contain spoilers *** I am not even kidding I watched the anime which is one of my favorites watched it almost weekly then decided hey you know what I will go see it. I took my son, who is a big fan as well we were shocked as the others there watching it how HORRIBLE it was and the changes to the main story and the changes to the relationships that were the WHOLE foundation of the original concept was sickening and such an awful insult. The relationships were what pulled you in to watching the team work and feeling remorse and fear for anyone in danger there was so much hate and coldness between characters that shouldn't have been that I couldn't even feel sorry for the deaths because I was still really upset over the changes which continued to just upset me over and over again About 20 mins into it my son wanted to walk out I told him for the sake and come on I am an adult and love the manga and anime would would think someone younger would enjoy at least the attempt (hes 12) but him like other youths kept screaming out \"come on really\" that's so horrible why would they change that or that doesn't make sense this is so horrible etc... the titan scenes in the beginning where decent I will give it that but after that the titans their actions and the new types of titans made no sense or REALLY UPSET ME like seriously why did they have to go there with the new \"LITTLE ONE\" anyone that has seen it or plans to will know what I am talking about and I'm not talking sick like turn your stomach titans eating human I mean like sick like WHO THE hell thought adding that would be a good thing for the movie...the last titans fight scene I do not even have words to describe how horrible it was thank you for messing up the character relationships thank you for making horrible choices in music, dialogue, and really cheese fight scenes seriously I thought at times I was watching people play with dolls attached to invisible strings. I sat through it because first I spent money on it and second I was really hoping something would dramatically happen that would make it at least somewhat enjoyable but as a true attack on titan fan I am just upset they took something good and butchered it but in all hindsight it only makes me respect the manga and anime even more so there's that any true fan will be upset anyone that has not read or seen the original MIGHT with low expectations find it at least entertaining my son rates it a negative 20 out of a positive 10 (a joke between us if something is so bad its beyond a positive) more than getting my money back I wish I could have the time back I wasted watching it that is my biggest regret in seeing it",
         "If you thought Avatar: The Last Airbender live action adaption was bad, wait until you see Attack on Titan live action adaption. It is so bad that I have no words to even describe it. Don't even bother wasting your time watching it. You can't even call this an adaptation because it isn't anything close to an adaption. The acting is bad, the CGI is bad, the audio is bad, the story is bad and the visuals are bad. The movie should be renamed to Attack on Franchise; How to Destroy a Franchise. I just can't believe how bad it is!",
         "This movie was terrible. If you read or watch the anime then you'll quickly get extremely annoyed in the first 30 minutes of the movie and I promise you that you will end up very disappointed by the end of the movie. The story is terrible and many characters are portrayed incorrectly. If you truly need to watch it then do not waste your money on it and instead watch it for free online or in a later date of release. The movie isn't even worth a dollar. It looks like they rushed this movie and only made it for the purpose of grabbing quick cash because of how big Attack on Titan series are at this moment in the manga world. I'm also sure that the movie budget were very low because the CGI were horrendous! Especially when the characters were using their gears. The only good part about the movie are the titans and their brutality. SKIP SKIP SKIPPPPPPPPPPPP",
         "Why the hell would they change an epic backstory and replace it with a really cringe worthy one?! They even changed the characters! Mikasa has Eren's hatred towards the Titans, Eren is all about Mikasa and omg Levi, what was that scene with Mikasa?! In my opinion, Sasha looked more like Mikasa. Armin and Hanji were spot on but to be honest, most of the acting scenes reminded me of school plays. This could have been a great movie to recommend to non-anime lovers but now I don't want to even mention it to people I know because this movie is exactly why people think Anime lovers are weirdos. The only awesome parts in the movie are the ones from the Manga. What a huge disappointment! However, they did a great job with the action scenes and the titans really looked terrifying! What a shame!",
         "Film studio usually takes liberty on interpreting a live action, but Shingeki no Kyojin strays so much it doesn't even resembles the original story. This would be acceptable if the new plot follows the same core, far from that the characters and world here feel inferior, they are almost unrecognizable if not for the cosmetic. Its biggest strength is the gore, it's a viable action with a lick of horror when it gets momentum. Humanity has a grim reminder that they live in fear of Titans, or so the opening says. The film focuses on a group of youngster trying to fend off Titans with Spider-Man cosplay tool. Right from the opening act, it doesn't follow the plot of manga. To be fair, it would have been okay if it worked. I'm not a fan and changes are expected, but in this case, it ruins both the new rendition and might even offend the fans. Setting takes a drastic turns, both the time and place are entirely different. Character development feels watered down. Stripped from their traits, these guys and girls look like generic anime protagonist, while in manga they at least have distinct features. This rings especially true with the lead Eren and Mikasa who only bear the same name yet without any real charm. The new additional characters as well as the portrayal of existing ones are choppy at best. Probably only a few of the scenes with humans actually have the same level of humor or tone. Effects don't really capture the agile motion, although the Titans do appear menacing. They look creepy enough with all the smirk and blood, which the show used in abundance. These Titans are bleeders. It's uncertain what this live action tries to accomplish, its major demographic is definitely the fans, yet the significant change will turn them off. It may appeal to general audience as an action flick, although with lesser plot it's merely passable as monster movie with slightly nifty gimmick.",
         "As a non-fan I was mildly entertained. Didn't think it was terrible, didn't think it was the best film ever. I felt it faithfully translated a very convoluted TV series the best way it could within 90 mins while not sacrificing action and Titan screen time. I don't consider myself a fan of the TV series, but being someone in their late 30's who grew up on they heyday of Japanese animation back in the 80's and 90's--Attack on Titan was the first time in a long while that an animation from there felt fresh, poignant and emotionally compromising for the viewer. The young kid in me would have loved this TV series, but the late 30's me who has been through a lot in life and chooses to seek out more positive and cheerful entertainment felt it got a bit too overly depressing and macabre. That's not saying I felt it was bad, just no longer my taste in entertainment anymore. Fanboys/fan-girls on here rating this film 1's have noticeably a lot of impractical whines concerning the film. They simply are expecting a 600 hour TV animation series to be summed up in 90mins. It doesn't take someone who has worked on a film to realize that is setting up an impractical expectation. Characters and situations ARE to be expectedly retooled in order to give the film proper pacing. Sure, some characters in the film that fans had invested a lot of hours into via the TV series are sometimes sidelined, rewritten or killed off. I expected and knew this would happen and it didn't change my perspective on the overall film because I didn't go in with impractical fan expectations of this \"film adaptation\". Of course a 600 hour TV series has plenty of time for you to become emotionally invested with meat shield fighters that the overall story had every intention of killing off down the line for more emotional impact. But trying to delve into all those characters in a 90 minute film isn't going to happen. Have to be more objective than that within the context of this adaptation. That being said the film does suffer from being disjointed and rushing through major plot points towards the final cliffhanger. It's really a film that just gets to the point and does not bores you with exposition that you can pretty much obviously figure out on your own. The Titans are absolutely as terrifying as I remembered from the TV series and faithfully depicted. I found myself covering my face in some parts like I did with the TV series, so I think they did their job well in translating the horror and macabre of what the humans went through. The action was obviously CGI heavy, but not done in a way that felt tawdry. They perfectly captured the aerial flight and feel of the fights from the TV series well. Attack on Titan was by no means a 1 rated film. It's no Ed Wood film. It's no Manos the Hands of Fate. It's not Glitter levels of bad. It's not a film that is really that terrible. It's a film that on a baseline captures the terrifying essence of the TV series main concepts, but does suffers a little bit on core characters development.",
         "Well, I have no clue WHAT was going on in the director's and writer's heads when they decided to MASSIVELY mess with the characters and story line. I know the comic to movie medium needs some alterations/compromise, but in this representation, the entire first 3/4 of the movie is pretty much butchered from the original manga AND anime... dropping the entire reasoning behind the characters motivations, leaving out key characters and replacing it with some truly pedantic filler that views much more like a plodding mess rather than developing intriguing characters who get into the action viscerally. I can understand skipping the 'training' arc for expediency and the swap of horses for vehicles as horses would be an unnecessary nightmare to control in a movie like this but after the first Titan attack (15 mins in) to the next Titan confrontation (55 mins in), we are faced with some of the most drudging, shoehorned garbage I've seen in a loooong time. What the heck was the purpose of the two 'lovebirds' and their interaction?? pointless filler, and they're not the only ones. It really feels like the director spent too much energy trying to get the 'feel' of the manoeuvre gear and Titans rather than putting more effort into the actual characters and with the film clocking in at just 90 minutes, they really could have extended it another half hour and put some real development into the actual 'world building' and characters so people could feel invested in the story. The effects were surprisingly good... it's just a shame the story fails on so many levels and I'm saying that as a movie fan, not as a fan of the series itself. I really liked the recent 'Parasite' live adaptation because there was enough in there to build a good story even though a LOT was sacrificed from the original material. Ah well, maybe the second part will redeem the production... I certainly hope so!",
         "I'm Japanese,My English not good but I'm tying. I'm a big fan of AOT and I like it.Movie not bad at all,In fact it's very very good movie. Best things is music that tell a story within a song and it's very good(I recommended music name's Temper the wind). Many people said acting is not good but honestly it's normal for Japanese because Japanese act like that as normal. I hate the scenes that Mikasa knew that Titan is Eren it's doesn't make any senses. About CG nana... without Kiseijuu this movie probably have best CG in Japan but I know how you feel if you compare it to Hollywood.For story not really interesting for part 1 but I trust Isayama sensei so part 2 gonna be fun. 9/10",
         "After much chatter on Asian social media about this movie, as well as reading the reviews on here I was quite looking forward to watching it. It's hard to put into words exactly how terrible this donkey of a movie really is. It's that bad. It's that bad I actually created an account to write this review. It certainly stirred emotion but in all the wrong ways, I had hatred and contempt for the main characters, androgynous unbelievable characters that spend more time trying to find the wind direction to best make their hair flow while staring into middle distance than \"attack\" anything. I spent more time trying to figure out their genders than worrying about the non existent character development. This would be OK if there was just enough action to carry me through, but, this brings me to my next emotion.. Laughter, non intentional I am sure, but the \"titans\" seemed to be a bunch of chubby men and women, taken off the street, stripped naked and asked to walk slowly around the directors apartment, in which he had filled with cardboard models of buildings. The budget seems to go on a bit of CGI at the beginning and then old boxes seemed to be the staple. I even started to feel uncomfortable toward the end as the chubby naked people had to grapple a bit. One reviewer seemed to compare this pile of rubbish to Godzilla, no way. Godzilla was never this bad and never took itself this seriously. You may now be intrigued as to just how bad this movie really can be and feel you have to watch it; please don't, it's almost 100 minutes of your life you can never get back!",
         "I do not think this movie is as bad as the intense reaction from fans has made it out to be. For that reason I will try to highlight the positives of this movie while conceding that as a fan I do not agree with some of the changes made to the overall plot and narrative. Costumes, character traits, and overall visual direction are spot on in my opinion. It looks like an Attack on Titan movie. However, the writing and acting are not on par and fail to deliver the impact that manga/anime has. That it is a Japanese movie with Japanese actors is a huge weakness of the movie in my opinion, characters depicted in manga/anime often fail to appear or act Japanese at all and this is especially true with this particular series. Source material has the setting in Germany, and having European actors for this would have served the movie much better. Although the movie half works as a monster/horror flick, the actors delivery is slow, flat, and very often unbelievable. Story wise, I have no real objective issues with the changes made to plot and narrative. Even with 2 movies to deliver the story, you simply have much less space to deliver exposition in this format compared to a long running series of chapters or episodes. It's not the changes they made, rather, it's the overall construction of the entire movie that bothers me. In fact, as I write this review, I dislike the movie more and more as I consider what was done with the anime in terms of delivery. The movie only takes us as far along the plot as the first couple of episodes in the anime. Exposition is clunky, and scenes seem to drag on longer than is necessary. The actor playing Hange is never believable, it's unclear if we should take her seriously or if she is meant to be comedic. It is more than halfway through the movie before the ODMG is explained, and longer still before you see it really used. It almost feels like they were embarrassed by the way the ODMG looks when it is being used, due to the fact that such a device would never work or be practical no matter how bad-ass you are, and they only put it in when it was absolutely necessary. The manga/anime is a fantasy/horror story, it is not meant to be believable or realistic. For that reason, this movie fails not so much in trying to make it feel real but rather fails to embrace the unreality of the source material. As a fan, my biggest gripe is the changes made to Eren and Mikasa, both in terms of characters and their relationship. Eren goes from a crazed traumatized boy to being a \"don't you ever wonder what's out there?\" type loafer. Gone is the iconic moment when Eren see's his mother eaten, gone is the iconic moment when Mikasa becomes a machine-like killer dedicated to Eren. Mikasa is instead made into a sweet innocent girl who gets a chunk taken out of her, and somewhere along the way (not shown or explained) some guy who didn't exist in the source material trains her to be a titan killer. I personally just can't see the justification for this. This more than anything was the biggest black mark upon the movie. Mikasa in the manga/anime often lacked expression, she did not speak and preferred action over words. It seems like they tried to adapt that into the movie, but by making her the girlfriend of some douchebag that lacks any depth or character at all, and making her hold this stupid grudge against her childhood friend Eren, she just feels heartless. In the manga/anime, she wasn't heartless, she simply hid her emotions away. And this made sense, this fit the character and her dedication to Eren as they were childhood friends who went through an intense kidnapping experience. In this it feels as though there's no reason to care about Eren or Mikasa at all. Overall, I have to praise the movie for not being absolute garbage. I appreciate seeing the titans in their CG glory, they nailed the creepy and grotesque factor perfectly. The massive titan looked great, but the crazed titan that appears towards the end looked plastic and rather cheap. The characters look the part, and the scenes where titans appear are well done. This is a movie best seen if your looking for something where many many people are eaten alive. This movie does not contain thought provoking writing nor compelling characters. But even having the visuals down is better than something like Dragonball Evolution. Good effort, I will see the sequel, and I will look to the series for proper writing.",
         "Firstly i think this movie should only be based loosely on the actual manga. They have changed the nature of the main characters to be almost entirely different ones. Eren is not supposed to be a tough guy and Mikasa is not supposed to be the lovey-dovey one. In the manga Eren was constantly being bullied and needed to be rescued by Mikasa. She is more a cold aloft character in the manga and not supposed to be so expressive. With that out of the way, even on it's own this movie is hardly watchable. There is 0 character development. We don't know the motivations of Eren, Mikasa or Armin and why they all hated the titans so much to want to risk their lives joining the military to kill them. Save your money and watch another film. I know i won't be watching part 2 of this movie.",
         "I'm a fan of the anime and manga series of Shingeki no Kyojin, they're amazing.However, this Live-Action isn't. Don't waste your time by watching this movie. I knew this movie was going to suck. I didn't have any high expectations. But I didn't expect this movie to be this bad. My opinions about some points: This movie is just about a bunch of girls who go after babies. At the beginning of the movie titans come and people scream. Then, Mikasa sees a baby, she tries to save it but she can't and she blames Eren for leaving her behind. Mikasa was supposed to be STRONG AND INDEPENDENT, not someone who always depends on the closest dominant male. Come on. I hated this Mikasa. Our second point is about Shikishima. Oh God. So he's supposed to be Levi from the anime and manga series. He eats apples a lot like a Shinigami (Death Note anyone?) and he is just about being cocky. And He has this weird relationship with Mikasa that I couldn't understand. So Mikasa is his student but are they friends with benefits too?! Just wow. Speaking of sex, a girl offers sex to Eren and then she gets eaten by a titan. Very sad story. Eren was just going to get laid... To Conclude: They tried to try. Maybe they never tried. It's not a good movie. They had these awesome characters and awesome setting and awesome story from the actual anime and manga. With their insufficient effects and storyline, they just threw rotten eggs and tomatoes to anime, manga and of course the creator, Isayama. I don't know what else to say. Don't watch it guys. Don't waste your time.",
         "AoT is probably one of the most popular series out there at the moment and I will admit that die-hard fans would find this disappointing. However, I am a die-hard fan myself and when I heard the news that a live-action was being made, I delved straight into research. I continued this research all the way from the beginning to even up to the point where I watched it myself. First, I've always thought that live-action movies have never really been Japan's forte, plus considering the technical aspects of AoT I had a feeling CG and effects would be dodgy at some points. And honestly, I was IMPRESSED with the effects; yeah, some points I thought it could've been better and occasionally I rolled my eyes and thought, \"Totally NOT a green screen.\" But equal many times I literally squealed in delight at the CG and effects, because it looked absolutely terrific during those times. Secondly, for those of you who complain that it doesn't follow the original storyline at all. Isayama Hajime himself ASKED for the story to be different and it was up to the writers, yet to still keep the key elements. I found this out so long ago that I was prepared for something different the whole time, and I like the result. Except the ending, the last twenty or so minutes I feel as though the writers sort of lost their creative spark and tried to put in as many scenes from the manga as they could, which was disappointing. Third, the acting and the characters. I liked the acting a lot in this movie, except for a few characters in some scenes. I thought Kiko Mizuhara played Mikasa beautifully and think no else could play the role better than her, honestly. I also liked how the writers gave Mikasa more of a \"not taking any bullshit\" attitude, but that's more of a personal preference, I suppose. Honestly, I just liked the general acting of characters. Last thing, the scenery. Oh my lord how I loved the settings.The more crowded towns, the fields, the walls... AND THE GORE, wow. If there's anything I've learnt about Japan, is that they're not light on the gore for things like this. And I was absolutely LOVING IT. Overall, I really liked this movie except for the ending, but hopefully the next movie will make up for it. I would watch this again at some point, no doubt. Just watch it with an open mind and don't criticize every point, then trust me, it's an enjoyable movie.",
         "Let me start this by saying: This is NOT like the anime or the manga. This movie has it's own twist and turns, at first you would notice that it doesn't follow the anime storyline and many fans would be extremely mad and angry about this, it's understandable. However, what's the point of watching it if it's exactly like the anime? Might as well just watch the anime and not this. Personally, I think it was smart idea to take some (NOT ALL) different turn in producing this movie rather than be exactly like the anime. Is it the best live action? No. Is it the worst? No. However, this movie could've been a lot better with better titan's graphics and more character development. There was lack of characteristic to the main characters and the role switches was a bad idea in my opinion. Instead of being Eren being the main character who carries hatred towards the titans and wants revenged because of his mothers death, it turns out to be Mikasa carrying the hatred through the story because of her experience. Also, in the live Action, Eren turns out to be more of a kind who's willing to do anything to win back Mikasa. It has many pointless fillers and this movie was rather leaning into trying to incorporate more romance between Eren and Mikasa which was a big mistake of them. Like no, just no. Also, they could have saved seconds of the lovey dovey couple into better scenes than waste it on them two which has nothing to do that benefit the movie. On the other hand, I understand that it was a whole series of 28 episodes into a 90 min movie, but it feels messy and extremely rushed. Especially with unnecessary fillers and making characters into couples. Also, I was sad that they incorporated trucks rather than horses and rely a lot in explosives, but hey, I take what I can get. Also, some scenes from the live action are just plainly dumb. For example, that guy that threw over a titan over his shoulder. Yes, you read right, he threw a titan over his shoulder. . . What I am impress about this movie is the usage of the Three-dimensional maneuver device, it was really well-done and it has great fighting scenes too both in person and titan scenes. Also, I love the settings of the this movie. I watched this with no expectation at all, and I think that's probably why I am not as disappoint as many of those who will watch it. I knew that movies are not always going to be like an anime. Would I recommend this? Preferably, no. I am sure 95% of those who watched the anime will hate this movie.",
         "My daughter steadfastly refuses to watch this live-action version of one of her favourite animes on account of all the unnecessary alterations that have apparently been made to the characters; having neither watched the series, nor read the manga, I cannot comment on the overall impact these changes have had on matters, but I can say that, if you're a fellow newcomer to Attack On Titan, this movie is passable entertainment, largely thanks to the titular Titans, who are freaky sumbitches to be sure! Massive, monstrous bipeds, Titans love nothing more than to stomp and chomp on humans, which is why, for the past 100 years, mankind has lived behind the safety of a huge protective wall. But now the Titans have found a way inside and are back to filling their bellies with screaming peeps, causing the survivors to retreat behind yet another wall, where they slowly formulate a plan to defeat their enemy. After two years, a special regiment heads into Titan territory, armed with gas-powered jet backpacks and blades with which to sever the napes of the greedy giants. The CGI used to bring the Titans to life isn't the greatest, but with such a ghoulish concept, and lots of splattery munching of unfortunate victims, I thoroughly enjoyed any scene featuring the ugly, over-sized ogres. What let the film down for me was all the dreary talking that went on in between the action, and the overall gloomy look—far too much grey and blue for my liking. I was also a little confused by the whole 'Eren turning into a Titan' thing at the end, but he sure was a bad-ass, smushing all the other Titans' heads with his bare hands; hopefully all will become clear in Part 2\u0085 5.5/10, rounded up to 6 for all the feasting on humans, the gory Titan slaying, and Eren's gloopy descent into a Titan's stomach.",
         "Before this movie came out, I was expecting it was going to be as good as Rurouni Kenshin. Now that I've seen it, it's not great. The story was obviously modified which is not a bad thing as long as it follows the source material. But in this movie, a lot of things had changed. Like in the anime, Eren's mom was eaten by a titan but in the movie, Eren's mom isn't even on it. This Hiana character is not in the manga or anime but they still put her in the movie. The other characters had different names like Shikishima who is supposed to be named Levi. The acting wasn't great either. This has got to be one of the most nitpicking movie I've seen. But there are some good parts in this movie. Like the opening sequence where it tells us about the titans in animation form, the part where Eren transformed into a titan and killed the crap out of the other titans, the actresses who played Hanji Zoe and Sasha delivered their characters correctly, and I guess that's about it. In conclusion, Attack On Titan is not great. So much flaws in this movie, a bit of good parts in it but still, not great.",
         "Loved the show, hate this piece of crap. The whole experience was awful and I'm very glad I got the torrent instead of paying. The acting was terrible, the cgi or whatever the hell that was was terrible. It really pisses me of that not only did they announce a sequel but they had scenes from it, which means it's already filmed. This leads me to question who the hell is funding this garbage. I really think this movie would have been better if it was made in America because our actors are way better actors and I feel like they could portray the characters more accurately. I don't want this to happen because this movie already ruined a show that I dearly loved, so please movie people stop making live action adaptions of anime. I DO NOT RECOMMEND THIS MOVIE.",
         "this is worse than Dragonball,SF live action movies combined. could be even worse than that. I thought about turning it off after 15mins into the movie, but decided to just fast forward it 2x. This is not based on the anime whatsoever. I don't understand it. Anime was a success. But they decide to make a whole new story which is just so corny. This movie just made Dragonball, SF, Death Note look really really real! i am even wasting time writing reviews about this movie. but i am making a sacrifice so y'all don't waste yours This movie is not even worth 10 lines of text to review so I am just writing BS and its pissing me off",
         "I am a die hard AoT fan, but when it comes to Live Action version, I still leave enough room for accepting new implementation to fit with the real actors and budget. However, this movie is really horrendous. Budget isn't high, I got that part, so I think the CGI is pretty solid (definitely way better than Sharknado), and is enjoyable. However, the story is not compelling at all. In the manga, or anime, the character developments were pretty solid. They have good reasons to fight the Titans. However, in this movie, those reasons are too off. No loved one actually died, it's all about the sorrow of a stolen love. Come on, is that really an understandable reason to put your life on the line? And is that a good reason to rage and become a titan? I am not going to spoil more, but the story is really bad. They replaced Levi with a douche- bag captain. At one point, I thought this is going to be a JAV with Titans and gore, because of the *Japanese* traditional camera angles for porn, and some explicit and bad (not saying explicit is bad) actions of the female characters. Recommend you don't waste your money on this movie.",
         "I was blown away by the Attack on Titan anime series. It was original and almost overwhelmingly thrilling, and it offered an intriguing mystery (as with Lost, the series keeps adding to the mystery without doing much answering, and I've about given up that there's every going to be a satisfactory answer to anything). I also thought the movie was absolutely terrific, with the same level of wild excitement and horrific cruelty. And I was honestly surprised by how hostile other reviewers here are. A couple of the big criticisms of this movie are that the story has been changed and that there is a lack of character development. Honestly, I don't even remember the anime's story, for the most part. All I remember is endless, incredibly exciting battles. I had to do a search on differences to even find out what has changed, and I'm still vague on it. The locale has changed, and the names (everything is Japanese now, which seems fine to me). A character has been excised and apparently the main character's personality is different. And I don't care, because I loved the show for its thrills, not it's people. Was the character development better in the anime? Of course. They had a lot of time for character development. There wasn't a lot of that in the first few episodes, but over time they did create a few interesting characters to a greater extent than the movie. But people, the anime isn't Shakespeare, and these aren't characters for the ages. And in both the anime and the movie, all you really need is a basic sketch of the character since they'll probably be dead soon anyway. The deaths are more upsetting in the anime, but I'm okay with being a little less upset, honestly. People also complain about the special effects. I saw the movie on TV, and on TV, the special effects look decent. The incredibly overrated Hollywood action epic The Avengers certainly had better special effects, but I was still far more entertained by Titan. The movie's certainly not perfect. It lags in the middle. Characters do unrealistically stupid things (at one point two characters do something really dumb when in a real army someone would have stopped them). There is one ridiculous blood-on-the-camera-lens shot. But overall it is tremendously exciting, and for me almost as satisfying as the anime. I'm looking forward to seeing part 2."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Kôdansha",
         "Licri",
         "Nikkatsu"
      ],
      "summaries": [
         "A teenage boy named Eren Jaeger must use his special gift to fight alongside with the military to defeat the titan race. Mankind is on the brink of extinction when these man-eating monsters terrorize everybody and set to destroy the last of human civilization left in the world.",
         "In 100 years, humanity lives in fear of the Titans. A race of beasts who take the appearance of humans but are much larger and lack sexual organs. Their only purpose is to feast upon humans. However, humanity barricaded themselves in three 50-meter walls to protect themselves from the terror of the Titans.",
         "For the past 100 years, mankind has been living peacefully behind giant walls that protect them from the Titans. One day, a super huge Titan breaches the wall, lets inside a horde of Titans who killed everyone including Eren's girlfriend, and forces Eren to retreat to the inner walls. Feeling vengeful, Eren joins the scouting legion in order to wipe all Titans from the world.",
         "After years living in fear, humanity protect themselves with huge walls to protect themselves from the Titans, giant humanoids that feeds on humans. When suddenly a huge Titan breaches the wall allowing a horde of Titans enters the city and attack them. A boy named Eren decided to save his city and wipe out the Titan race",
         "In a world where giant humanoid Titans prey on humans, Eren joins the scouting legion to get revenge on the monsters who killed everyone in his town."
      ],
      "budget": 0
   },
   "movielensId": 140805,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2015-08-12",
      "dvdReleaseDate": null,
      "directors": ["Shinji Higuchi"],
      "runtime": 98,
      "movieId": 140805,
      "title": "Attack on Titan",
      "mpaa": "NR",
      "actors": [
         "Haruma Miura",
         "Kiko Mizuhara",
         "Kanata Hongo",
         "Nanami Sakuraba",
         "Takahiro Miura",
         "Satomi Ishihara",
         "Hiroki Hasegawa",
         "Ayame Misaki",
         "Pierre Taki",
         "Jun Kunimura",
         "Shu Watanabe",
         "Rina Takeda",
         "Nana Seino",
         "Matsuo Satoru"
      ],
      "imdbMovieId": "2072230",
      "originalTitle": "進撃の巨人 ATTACK ON TITAN",
      "genres": [
         "Horror",
         "Fantasy",
         "Drama",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["InF16sp7J0M"],
      "plotSummary": "100 years ago, titans suddenly appeared on Earth. Soon, human civilization veered on collapse due to the titans. Humans then built a giant wall to defend themselves. Within the giant walls, humans lived in peace, but, 100 years later, the giant wall is broken.",
      "tmdbMovieId": 295830,
      "avgRating": 2.90909,
      "releaseYear": "2015",
      "numRatings": 77,
      "posterPath": "/dimmAl5fs7qMbAzEMLPAmS5XIgz.jpg"
   }
}