{
   "tmdb": {
      "original_language": "uk",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "ukraine",
            "id": 1738
         },
         {
            "name": "cossack",
            "id": 3560
         },
         {
            "name": "ukrainian",
            "id": 9007
         },
         {
            "name": "sword fight",
            "id": 9725
         }
      ],
      "imdb_id": "tt1242457",
      "video": false,
      "title": "Iron & Blood: The Legend of Taras Bulba",
      "recommendations": [
         330839,
         173962,
         159254,
         284682,
         62374,
         330841,
         260189,
         290969,
         92771,
         77983,
         72202,
         115871,
         20449,
         45817,
         169856,
         47227,
         113736,
         20975,
         46278,
         39253
      ],
      "backdrop_path": "/23F60HL5MuA7Wq0gdQInYoNvUiM.jpg",
      "revenue": 16815892,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Panna Elzhbeta",
               "gender": 1,
               "credit_id": "52fe47549251416c750957f3",
               "name": "Magdalena Mielcarz",
               "profile_path": "/xMZJxqKa0CPyHDbtwJCT0Kzhhxj.jpg",
               "id": 82514,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Taras Bulba",
               "gender": 2,
               "credit_id": "52fe47549251416c750957fd",
               "name": "Bogdan Stupka",
               "profile_path": "/bKzf1afD1KsXMVCw3dP9YcDY1ud.jpg",
               "id": 82513,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Ostap Bulba",
               "gender": 0,
               "credit_id": "52fe47549251416c75095813",
               "name": "Vladimir Vdovichenkov",
               "profile_path": "/8NLju8HaiVItSvmaCOhXCtQiXIi.jpg",
               "id": 236369,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Andriy Bulba",
               "gender": 2,
               "credit_id": "52fe47549251416c75095817",
               "name": "Igor Petrenko",
               "profile_path": "/lZbHUUspP0zI7K2ulInRWthRHE5.jpg",
               "id": 93536,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "5373ef40c3a3681520001aa0",
               "name": "Mikhail Boyarskiy",
               "profile_path": "/ugvQMzcM050k6dpKTKZfSvULwD.jpg",
               "id": 238487,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5373ef49c3a3681539001aa3",
               "name": "Vladimir Ilin",
               "profile_path": "/qB5NBAphVVikS68TYoAJUI2Bd1Z.jpg",
               "id": 240563,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "5373ef59c3a3681509001b57",
               "name": "Yuri Belyayev",
               "profile_path": "/e5Hkd6tjawma4o6e5AqaLlHT2un.jpg",
               "id": 47423,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "5373ef8cc3a3681520001aa3",
               "name": "Ada Rogovtseva",
               "profile_path": "/wGVSTIlnfA0qFYqbaMezJ85Wa2E.jpg",
               "id": 549586,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "5373ef96c3a3681539001aa6",
               "name": "Boris Khmelnitsky",
               "profile_path": "/o3suni2AArYfvD4foUA8E4u5tIR.jpg",
               "id": 128677,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Krasnevsky",
               "gender": 2,
               "credit_id": "5373efa3c3a3681502001b5b",
               "name": "Daniel Olbrychski",
               "profile_path": "/nfqJ8xiVNyBQQhnYRkwJzl3iS7s.jpg",
               "id": 7107,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Narrator (voice)",
               "gender": 0,
               "credit_id": "5373efb2c3a3681520001aa8",
               "name": "Sergei Bezrukov",
               "profile_path": "/ebZTl8LxfC0BXubaCsAtiVs6xnT.jpg",
               "id": 87409,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "5373efbec3a3681530001b1c",
               "name": "Aleksandr Dedyushko",
               "profile_path": "/cZW59oTbq42etilaNTA4wtppzAa.jpg",
               "id": 238527,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "5373efcfc3a368150f001a8a",
               "name": "Liubomiras Laucevicius",
               "profile_path": "/4hScr15h0Rp18r6ly3OFc1HPzD1.jpg",
               "id": 93409,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "5373efc5c3a368150f001a86",
               "name": "Sergei Dreiden",
               "profile_path": "/seghK4M9wfL0FqoelKddi6Og9dM.jpg",
               "id": 107761,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5373ed3dc3a3681520001a7d",
               "name": "Vladimir Bortko",
               "profile_path": "/8mJiuGZEd1NAhlYOO7W09VvrOBy.jpg",
               "id": 82516,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47549251416c750957f9",
               "name": "Igor Kornelyuk",
               "profile_path": "/xpnfjzgllvdG0BEW2k1JlMFbQDI.jpg",
               "id": 82515,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 2,
               "credit_id": "52fe47549251416c75095803",
               "name": "Nik Powell",
               "profile_path": null,
               "id": 34007,
               "department": "Production",
               "job": "Executive Consultant"
            },
            {
               "gender": 0,
               "credit_id": "52fe47549251416c75095809",
               "name": "Vladimir Bortko",
               "profile_path": "/8mJiuGZEd1NAhlYOO7W09VvrOBy.jpg",
               "id": 82516,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5373ed4cc3a3681530001abe",
               "name": "Nikolai Gogol",
               "profile_path": "/mPCb6xYWu9okwdzPOiy22Pz6VVd.jpg",
               "id": 1097807,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 2.191856,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 17935,
      "vote_count": 17,
      "budget": 25000000,
      "overview": "Set in the 16th century, this is a story about Ukraine's Cossack warriors and their campaign to defend their lands from the advancing Polish armies.",
      "similar": [
         13,
         4347,
         452507,
         281957,
         8422,
         17663,
         2275,
         319,
         11224,
         182560,
         4476,
         8967,
         2288,
         4771,
         769,
         322,
         773,
         858,
         101,
         111
      ],
      "original_title": "Taras Bulba",
      "runtime": 130,
      "poster_path": "/zdwZUBFcVpg4ficCyZ2u6UIYruB.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": "/qTJaoQCNNUSiLYhjqvC4vtlTZBu.png",
         "name": "Central Partnership",
         "id": 9342,
         "origin_country": ""
      }],
      "release_date": "2009-04-02",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.tarasbulbafilm.ru/",
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Vladimir Bortko"],
      "runtime": 129,
      "synopsis": null,
      "writers": [
         "Vladimir Bortko",
         "Nikolay Gogol"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt1242457/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODI1NDI4NDA3NV5BMl5BanBnXkFtZTgwMzY5NTAzMTE@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Bogdan Stupka",
         "Igor Petrenko",
         "Vladimir Vdovichenkov"
      ],
      "reviews": [
         "I'd like to start off with what is good in this movie, for the list will be infinitely shorter than what is bad. Good points: 1. Bogdan Stupka ('Taras Bulba') performance. His presence in the movie is the only excuse to see the movie in the first place. 2. Attention to detail in costumes and observing cossack traditions. The movie can be a good reference for re-enactors of Zaporizka Sich and Rzech Pospolita of XVI century. Bad points: 1. Patriotic speeches comprise over 50% of the total movie time. Every single cossack having at least one line in the movie, had to proclaim a speech about the never-ending glory of orthodox faith and Russian land before dying. I mean, it is OK once. It can be touching. However, in Taras Bulba there are 5 or 6 nearly identical speeches within 5 minutes span. Around the third speech/death sequence it gets really boring and you think 'will you please just shut up and die?' The word 'Russian' appears in every other sentence of the movie. I mean, I know those are Russians who make the movie with the aid from the government. I bet, anyone from outside USSR will return from the theater with the firm belief those were Russians fighting Poles. But hey, the entire thing actually happens in Ukraine! Yet, reference to Ukraine is carefully avoided and quickly mentioned only twice in the entire movie. 2. Battle scenes. The movie attempts at Braveheart realism with close-ups of wounds. Which would have been OK, if they haven't shown close-ups for nearly EACH SINGLE CUT AND PIERCE in the movie. Coupled with unimpressive execution of one-on-one duels and poorly organized mass scenes (you get the full screen of cossacks and Poles walking (not running!) chaotically without any apparent purpose or sense of direction, it creates seriously sad impression. 3. Performance of the younger cast. Vdovichenkov is no longer a criminal from 'the Bumer' (the BMW) but his line 'Ty chto skazal?!' (What have you just said?) was performed in the XVI century church in the same manner as previously at the criminals' meeting in 1990s. Younger son, Andriy (Petrenko) is not nearly as passionate as his father, Taras, (Bogdan Stupka). Yeah, I betray my motherland and my father, because I love you. No big deal. 4. Soundtrack is as awful as in Bortko's Master and Margarita.",
         "Absolute crap! A mock on a great drama, as if it was in directors intentions to spit in Gogol's and viewers' faces. When the third dying person begins another tirade on how much he loves his country (which has no relation to what Gogol wrote and even never was true since cossacks have always been the free people) you start to expect American flag to wave on the background. I can't believe that this piece of dogsh.. is made by director of the classic \"Sobachye Serdtse\". I don't want to believe!",
         "Saw this movie just yesterday and I remembered the book I read in high school. Book I remember vaguely, read it a long time ago, but I did like this movie, especially because of the excellent play by the main actor and the story about the Cossack lifestyle. Novel is written in the high romantic era during the boom of nationalist feelings and its well represented on the screen (although I am not so sure was there so much Tsarists love with the Cossack when many of them were escaped surfs). Cossack lifestyle is hard, based on war, plunder and raiding like Mongols or Vikings of ages past and this movie shows that life and consequences of living it - hatred by more \"civilized\" Poles and Turks or struggle with other nomadic raiders like Tatars. Cossacks because of that fight against everyone, are suspicious to everyone (like Jews) and are only shown to trust those of their own Orthodox faith. Actors that portrayed Cossacks are mostly good, especially Taras Bulba. By the end of the movie you really become one with him and start to understand him and his struggle against the world while he is losing more and more. Poles are well done, they have every right to hate the Cossacks with them constantly raiding their towns. Final scene when Polish colonel when he spares his daughters son is also strong, you then see the glimpse of Taras Bulba if he was on the other side. Greatest flaw in this movie are special effects, rain that falls from clear sky, \"wounds\" in some cases along with soundtrack that could have been done a lot better when I see how much was invested in this movie. They are so weak that look like they were done for some small budget student movie, not a blockbuster financed by the Russian government. It is clearly seen that this is a Russian propaganda movie, but a very weak one, the only time I was really moved was with the ominous Taras Bulba's last words when they were burning him alive, the rest of the Cossacks haven't managed to give that same feel. Overall, good movie, but the ridiculous failure of the special effects reduces rating greatly.",
         "Bortko set out to make an apparent epic here, but sadly, missed an opportunity to tell a great story. I researched Gogol before watching this film; the essence of the story is covered in the film's plot. What Gogol did NOT include was the Russian polemic which slaps you in the face at every turn in this film. I agree with some of the other reviewers that casting and costuming were great! Fabulous actors, wonderful faces, but a sodden, leaden, boring script deprived them of a chance to display their true talent. Bogdan Stupka is always a pleasure to watch, and for a better version of these times, watch Hoffman's 1999 Polish epic \"Ogniem i mieczem\", in which Stupka plays Bogdan Khmelnitski. The patriotic speeches, both in the sich and during the battle death scenes, slowed the movie to a dead crawl (no pun intended!) and greatly detracted from the film's impact. As others have noted, this is truly a Ukrainian story, not a Russian one. Ukraine was mentioned only twice in the movie (I counted). Endless speeches (particularly with a slit stomach) about the sacred Russian soil really have no place in a story about Polish/Ukrainian struggles, and only serve to underscore that the film's budget was heavily subsidized by the Russian government. At a time when the East and West need to work together to solve this world's problems, western xenophobia seems highly counterproductive. Such films only widen the divide and hurt us all as creatures of this planet. One note about the score: nice idea again, but endlessly repetitious. I recognized in the main theme a variation of a famous Ukrainian carol \"Novo radist stala\", which I have sung many times, but it was extremely overdone. A little variation would have been nice. The repetitive score reminded me of another score for Bortko's \"The Idiot\", a wonderful Russian serial based on the Dostoevsky novel (2003). More endless repetition of the musical theme was the one negative in an otherwise flawless ensemble of actors and a compelling story. In summary, this film was watchable but mostly boring. Some of the horrendously violent scenes made me cross myself. Not a total waste of two hours; however, it left me feeling that it could have been so much better with a little more effort and less propaganda.",
         "\"Do we have powder still in our flasks?\" asks Taras his comrades during a violent battle. It is quite often that this very question is attributed to contemporary Russian movie makers meaning whether they are still able to create genuine works of art. And for me this movie gives an affirmative answer, at least in relation of Vladimir Bortko. I watched this film yesterday and I am still impressed with it. I enjoyed how actors played though sure Bogdan Stupka makes an absolutely outstanding performance, but the whole actors' ensemble is very well doing. Also I found cinematography very interesting. And sure Bortko deserves praise for his solid work which reminded me about those soviet times when such masters as Gerasimov or Romm created their epics. This movie is about tremendously difficult choice between different values, between devotion to motherland (fatherland) and love for a woman, between traditional values of Russian people and values of west though in this movie we see how allegedly enlightened polish gentry (regarding itself as beings of higher order than cossacks ) executes cossacks in the most cruel way. Though I have to honestly admit that I don't know how fully this movie renders Nicolai Gogol' story. Anyway I found the movie very interesting by itself not even in relation to the original source.",
         "This \"film\" is the essence and the face of today's cinematograph in Russia. It has all of symptoms of it's serious illness. Let me enumerate some of it. First - film is made by government order. In this specific case it has to show Russian crowd that Poland is Enemy and that Ukraine belongs to Russia. But it's made so rudely and primitive that polish characters even win our sympathy against \"kassaks\". Second - budget of this film is enormous while independent cinema doesn't have ANY state support and has no small chance to develop. Third - Vladimir Bortko, director of \"Taras Bulba\" is one of that previously talented soviet artists who mutated under the new power and lost everything what they had for what we loved them (Bortko made \"Heart of a Dog\" in 1988 by Bulgakov's story). Another brightest example of such a mutant - Nikita Mikhalkov, the main monster of \"new Russian cinema\". Fourth and last - work of every member of film crew is absolutely weak. Awful editing, feeble script, fast-food directing, horrific two-melodies soundtrack made by extinct pop-star Igor Kornelyuk, hysterical special effects with blood made by Photoshop or Paint redactor, endless and cheerless battle scenes (under the rain with clear sky) and so on... This is not just a disappointment, this is a real condition of Russian cinematograph. And it will not change until the same people from ruling party leave their chairs.",
         ".... And I guess that's the problem. Unabashed patriotism is OK for some, not for others. The Zaporozhians' battles in defence of Orthodoxy, when it was being attacked on two fronts, is a story that must not be forgotten. The film is impressive in its historical detail, costumes, etc.... the music (and some of the acting) is a little melodramatic, but I think it's a fitting thing for a rousing film. The scene of cossacks writing a letter to the Ottoman Sultan (an actual event from 1675) is reminiscent of the famous Repin painting depicting it. A grittier, less glam/swashbuckling version than the Yul Brynner classic, but that's what this story needs. It will never get wide theatrical release in North America because it is too honest, and not politically correct enough. Who cares. It's in my video collection, and it is becoming a favourite quickly.",
         "I can't really remember when was the last time I've actually watched something so poor. I'm not even gonna start on the plot and the Cossac mentality as it is a separate matter (like blaming the enemy army for defeating the regiment that was entirely drunk {sic!}) So let's concentrate on the actual movie features... Picture: Narrow shots only, Special effects like in Braindead, Polish troops in Spanish conquistadors' helmets, The castle... they didn't even try to make it look properly... Sound: The whole thing sounds like from an old cassette. Sounds are so bad it actually makes you laugh, Silenced pistol sounds from James Bond imitating musket shots, Poles cursing in a very modern language, The whole thing is just... poor. miserable. There is no tension, no nothing. It's just watching some guys run throughout the set repeating stuff about Matushka Russia and Orthodox church. Actually every character repeats the bloody sentence just before dying \"So good to be dying for Russia and orthodox church\"... It actually reminds me soviet cinema where deadly wounded characters were giving speeches about the advantages of living in Soviet Union or something close to it in abstractness... Forgive me please being as chaotic and poor as \"Taras Bulba\" - it's my first time...",
         "The 2009 Russian-made adaptation of \"Taras Bulba\" yet again highlights the directing genius of Vladimir Bortko. The film is beautifully crafted with spectacular costumes, truly epic battle scenes and a melodic score. The cast is hand-picked to suit the roles perfectly, with Vladimir Vdovichenkov (Brigada, Bumer) playing the patriotic Ostap. Igor Petrenko (Geroy Nashego Vremeni, Volkodav iz roda Serykh Psov) is seen in yet another negative role that the audience can sympathise with - the traitorous Andrey. The stunning Magdalena Mielcarz (Quo Vadis?, Limousine) plays Elzhbeta, Andrey's love interest, and his sole reason for betraying his father and country. However, the real show-stealer is Bogdan Stupka (Est - Ouest, Ogniem i Mieczem), who portrays the brave Cossack Colonel Taras Bulba. The fearsome leader's role is played superbly, with his character catching on the exact same vibe that came off him in the original novel. A noteworthy mention also goes to the Russian cinema veteran Mikhail Boyarsky (D'Artanyan i tri Mushketyora, Gardemariny, Vperyod!), seen as Moisei Shilo, a well-respected Cossack and a seasoned warrior. The film remains true to Gogol's 1842 edition of the novel and to history. The Cossack's repeated words of praise for the Russian Land and Orthodox Christianity can be found in the manuscript. The political situation at the end of the XVI century in Ukraine was that it's cultural and religious life was being tarnished and oppressed by the Polish-Lithuanian Commonwealth, the Rzeczpospolita. The Zaporizhian Cossacks were frequently involved in violent clashes with the Poles, which lasted well into the XVII century, until Ukraine requested Russian military assistance to finally defeat Poland and force it towards diplomacy. Interestingly, the Cossacks considered themselves independent from any nation, be it Russia or Ukraine, and they did not recognise the sovereignty of either ruler. Instead, they elected their own leaders and fought for their lands - the lands of the old Kievan Rus' that were united by Orthodoxy, and called Rus' for short. With the budget of 516 million Russian rubles, Bortko is able to re- create the feeling of the time, aided with mass numbers of actors to ensure the realism of battle. Zaporizhian Sich was built as an accurate depiction of a Cossack settlement and the costumes used are reflective of the dress sense of the various factions. Surely the picture could be improved on a number of fronts. Andrey's character development suffered, largely due to the time constraints of a single part film feature, however, that did not detract from the empathy one could experience with him. Another element that suffered from time constrains is the number of self-reflective narratives, that provide an insight on the various characters, present in the original novel. This is a common problem to all film adaptations of previously written materials. Overall, Vladimir Bortko's \"Taras Bulba\" is a solid historical feature and a worthy adaptation of Nikolai Gogol's masterpiece. While it is somewhat inappropriate to compare it to a mini-series, the film reaches the same high standard set by Bortko in \"Master i Margarita\". 8/10",
         "It is a unsuccessful screen version. Fights and if film consists half of war it is shown as old shootings 50 years ago are very badly made. Actors are good, but that pathos of patriots is far-fetched. It is not present at Gogol. The director did not know my opinion that on a genre will be better and has drowned all in blood. The big minus that if a trick master has been expelled from movie by director. It is a minus to the director who cannot work on modern movie. And the result of visually beautiful duels is a parody of the battle. It is attempt to make rigid cinema ridiculous when you see as fight on a background cossacks. For the main heroine have forgotten to write the text - it only laughs. Each cossack considers as the duty (before death) to tell pathos words. But they are unnatural in such situation. I am assured, that it is cinema 25000000 dollars are not necessary",
         "Taras Bulba the movie had very great deep meaning to it, very good actors, one of my favorite movies now. But the fighting scenes were bad, guess they ran out money when they bought too many expensive actors and actually filmed the movie in Zaporozhia, Ukraine, unlike many Hollywood movies where they are filmed in a studio the whole time. My father called this movie Bumer 3, if you haven't watch those movies watch them, he called them this because they have very great meanings but are ruined because not enough money or modern use of directing is used in these movies. Overall this movie is great and I hope you see it.",
         "In same time, an error and a masterpiece. A film in which history is only an political instrument. Strong, hilarious and aggressive. And a movie in which every detail is explore in fantastic way. So, the result is a schizoid work. Shadows of Jirinovsky and medieval air. A fake Ukraine and romantic sticks. A huge picture and a boring manifesto. But the delicate fact is the absence of Gogol. The director, in past maker of spectacular pages of lost history, is in this sad case only organiser of a Russian propaganda show. Enthusiastic and full of good intentions, he crushes the original story. The Christmas tree is impressive; but only ornaments. The wood is far of the public. It is difficult to say if \"Taras Bulba\" is a disaster. The crumbs are good taste. The cake is old and strange. But the memory is more tempt by the beautiful coins and Kosacs costumes.",
         "I was really looking forward to watch this movie but when I actually got to see it, I couldn't stand more than 15 min of this amateur level time waster- silly and unbelievable speeches, video, sound effects... it was just horrible. I fast forwarded to the battle scenes and it was just as bad- a bunch of people in pretty dresses running around, gunshot sounds taken straight out of old western movies, Polish hussars charges looked like a slow walk in a park.. the whole thing looked like a parody. If this movie was a college cinematography project, I would give it 7/10, but it wasn't, so I give 2/10 for nice dresses.",
         "I mostly agree with comments posted previously by other viewers, about the permanent propaganda-style used in longish and unrealistic patriotic speeches. I translated the movie into French and English subtitles to add on divx (they will be available soon on OS) and I got quickly bored by the seeming repetitiveness of several speeches. Beingmarried to a Ukrainian lady, I'm also very much aware that Bortko had to kinda \"steal\" the true story and replace it by Russian propaganda. Just have a look at who's at the steering wheel in Russia, now ! My feeling is that this movie was sponsored by Russian public funds for the \"nashy\" and their followers.",
         "Unfortunately, this version of the great classic does not do it great justice. Bohdan Stupka's great performance does not elicit much response in either Vladimir Vdovichenkov as the brave Ostap or Igor Petrenko as the tragically star-struck Andrii. Partly, this looks like a poor script as the lines follow just too closely the original text of Gogol. Partly, this goes to the director's focus which was far more on the settings than dialogues, except when delivering propaganda one-liners a la Eisenstein or Dovzhenko. Overall, this version of Taras Bulba seems just too much of an agitprop forthe new Cossack village creed of militant Russian patriotism and pride in martial traditions of the legendary steppe marauders which finds its natural outlet in heavy drinking and voting loyalty to Yedinaya Rossija.",
         "this is a good and hard movie for humans who know Russian history.5.5 is the IQ of the stupid who don't know noting.you must read to know something .if this movie is made by Americans his note will be 10,but is not,is made by Russian.i read the novel and all Russian history and this movie is an great example for the MAN who don't know nothing.the main character is the example of old school hero and patriot not some pussy whit a gun,a father and men .the Russian history is made whit blood and steal not oil wars.my apologize if i was to rude but not all the great movies are made by Americans.i am from Romania and we to make great movie like:MICHAEL THE BRAVE,VLAD THE IMPAILER,MIRCEA,OSANDA",
         "This propaganda movie is a weapon in Russia's informational war against Ukraine and﻿ Ukraine's﻿ history... Peter the First had stolen Kievan Rus' name (by renaming Moscovia to Russia in 1721) and now Putin is trying to steal Ukraine's history... 1) Cossacks where UKRAINIANS. 2) They spoke UKRAINIAN language. 3) They did NOT fight for \"Russia\". 4) They fought against occupants (including Moscow's occupants). In first edition of Mykola Gogol's \"Taras Bulba\" (1835) there where NO \"Russia\"-words, but everywhere﻿ where \"Ukraine\" instead. \"Russia\"-words appeared later (in 1842' edition) through PRESSURE of Moscow's censorship. But Bortko intentionally makes this movie based on that (1842's) edition. THIS MOVIE IS A FAKE !!! PS. Sorry for my English :)",
         "This laughably propagandistic movie from Russia is based upon one of the wars between the Poles and the Cossacks. Along with the incredibly irritating Russian tendency to vocally translate other languages instead of using subtitles, this movie features bad melodramatic music and excessive dialogue, not to mention stock sound effects. They didn't even wait for an overcast day to play scenes set during rainy days; nope, they went ahead and did the scenes with a rain bar on a sunny day. About the only redeeming factors of this movie are the costumes and the weaponry (multiple shot pieces and an arquebus both make an appearance). Otherwise, you can watch this if you wish to have a good laugh.",
         "I was excited to see this movie and it was entertaining. Fans of the show Vikings will appreciate the gritty, authentic characterizations of the Cossacks with their fierce personas, bushy mustaches and shaved forelocks. The Cossacks were a collection of hard-living freebooters, many criminal refugees, who fled to the wilds of the Ukraine from all parts of Russia to live independently. Riding in packs with disregard for life and limb, they were the Christian counterpart to the mounted Tartar hordes they often sparred with, like two Medieval motorcycle gangs. Unfortunately the film ultimately degenerates into an appalling propaganda piece with a slew of nobly dying Cossacks declaring their love for Mother Russia and angry heartfelt wishes that Russia and its brand of Orthodox Christianity will someday conquer the world. If this was a Muslim film expressing the same type of sentiments people would be screaming for drones to take action on the filmmakers. Even creepier, several of the dying declarations and other venomous speeches target Poland - and although the Poles are the enemies of the Cossack horde in the film, the message is clearly intended to transcend the time period, with expressed wishes that \"the Polacks\" will be sorry someday. In today's political climate, the film is undoubtedly a cry to arms for Putin's burgeoning reactionary groupies, who publicly dream of restoring Russia's Soviet era empire. The film spends way too much time on these propaganda points and far too little on story development. The love story so critical to the storyline is choppy and unconvincing, with the Cossack traitor allowed to enter the Polish princess's boudoir and have his way with her while her family and retainers blithely ignore his entrance. While the Medieval Poles were reputedly more sexually liberated than their European neighbors, it is unthinkable that a traitorous knight- in-training would be allowed such liberties with a noble. On top of that, the young Cossack was enthusiastically assailing the castle walls just a day before. (The relationship in the Tony Curtis version of this story was much more ably developed.) If the movie ended about three-quarters of the way in, the bits of propaganda scattered throughout might pass for authentic dialog - as would the \"hero\" Taras' scorn for the Jewish merchant, portrayed as a groveling money grubber. But just when you're sure the movie is over, the battle is extended and the litany of cornball dying words is unleashed... to go on and on and on... With the recent events in the Ukraine over disputed territory, one can only wonder whose side the old independent Cossacks would take today. \"Mother Russia\" or a free Ukraine?",
         "Bogdan Stupka. in fight to create a credible Taras. a literary gem. who becomes a political tool. that is all. the film has a lot of sins but the basic problem is the ambition to create a Hollywood blockbuster as support for the Kremlin 's interest. the fragile beauty of the book is lost. the Kozaks becomes Russian puppets. the Pole society is victim of a Manicheism who not convince and not impress. the entire story becomes an aggressive political speech. sure, many historical films from the East Europe are illustrations of the same recipes. but under the Communism regime. and the delicate problem is to transform Ukraine in a part of Russia, to use special effects for ignore the senses of book, to destroy a noble idea for a not real decent result. short, a Russian story. full of nationalism. and not convincing . useful for a kind of public . and not more that.",
         "\"May they all know what brotherhood means on Russian soil.\" The true account of Taras Bulba (Stupka), a Ukraine Cossack who helped to defend his homeland from the Poles in the 16th century. This is one of the best foreign movies that I have seen. The movie opens with a \"Braveheart\" like speech, then we flash back to what got him in that position. The movie then begins to take shape and tries to cover every conceivable aspect it can. Love story, fighting, father/son tension, and the quest for freedom. Much like as in \"Saving Private Ryan\" the movie is bookended by very intense fighting scenes. This is another movie that is not meant for queasy viewers. The torture scene toward the end makes the \"Braveheart\" one seem tame. There is so much in this movie and I could go on and on about the aspects of why I liked it, but it's best to just watch it and see for yourself. Very, very well done. Overall, a fantastic foreign movie that has some of the most intense battle scenes I have seen in a long time. I give it an A-. Would I watch again? - I might, but not for awhile. *Also try - Agora & Braveheart",
         "I've seen three other films by Vladimir Bortko -- adaptations on \"Heart of a Dog\" and \"The Master and Margarita\" by Bulgakov and \"The Idiot\" by Dostoevsky. These were works that were close to my heart, and I thought Borko did a fantastic and mindful job of recreating them for the screen. Here he seems to have been given a much bigger budget, possibly a set of orders from the Russian government, and the short novel \"Taras Bulba\" by Gogol -- a piece of literature that didn't resonate with me nearly as much as the three aforementioned ones. While I loved some of Gogol's other stories, \"Taras Bulba\" struck me as mostly overblown, thoughtless nationalism, which didn't sit well with me. I didn't much care for this film either, so to be perfectly fair that could be because Bortko faithfully reproduced a book that I didn't love in the first place. Everything revolves around the inclusion of battle scenes and dead-serious scenes about going to battle, and it is assumed without saying that of course we will be rooting for the Cossack's over the Poles. Maybe we will be and maybe we won't, but using that as an assumption to make the film work means it's rooted in pure nationalism and nothing more. If that's alright with you, then fine, but it's not a substantive ideology. Even if we take it as given, there are few too many scenes of dying people who use their last breath to give a heartfelt speech about how the Cossack soul will never be vanquished. There are plenty of enormous pitched battle scenes with many very bloody wounds shown. The visual work on this is impressive, but it seems empty without a fuller context. The events of the plot seem entirely constructed to allow for more speeches about Cossack national spirit to be worked in, and as such are spread pretty thin. The result is that odd duck -- an action packed movie that is actually rather slow-moving. The up side is that there are some very good performances, especially from Bogdan Stupka and Igor Petrenko. They understand the material give performances that are as warlike and humorless as possible. I'm not an expert in the era of history on which Gogol based the source novel for this film, so I can't really address what has been brought up many times here -- the potential incongruity of the Cossacks mentioning Russia in their speeches and speaking Russian (as opposed to other characters, who speak Ukrainian with voice overs). But I think there is more nationalism than just Gogol's at work here, on the whole. A lot of technical skill and passionate acting went into this. Unfortunately, it's a lot of sound and fury signifying nothing but blind patriotism. That might make it a good watch for if you're about to go and kill some Polish people with your trusty sword today and need inspiration, but it doesn't make it a good film."
      ],
      "genres": [
         "Action",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Central Partnership",
         "Telekanal Rossiya"
      ],
      "summaries": ["Set in the 16th century, this is a story about Ukraine's Cossack warriors and their campaign to defend their lands from the advancing Polish armies."],
      "budget": 25000000
   },
   "movielensId": 140944,
   "movielens": {
      "languages": [
         "Français",
         "Pусский"
      ],
      "releaseDate": "2009-04-02",
      "dvdReleaseDate": null,
      "directors": ["Vladimir Bortko"],
      "runtime": 130,
      "movieId": 140944,
      "title": "Iron & Blood: The Legend of Taras Bulba",
      "mpaa": "",
      "actors": [
         "Magdalena Mielcarz",
         "Bogdan Stupka",
         "Vladimir Vdovichenkov",
         "Igor Petrenko",
         "Mikhail Boyarskiy",
         "Vladimir Ilin",
         "Yuri Belyayev",
         "Ada Rogovtseva",
         "Boris Khmelnitsky",
         "Daniel Olbrychski",
         "Sergei Bezrukov",
         "Aleksandr Dedyushko",
         "Liubomiras Laucevicius",
         "Sergei Dreiden"
      ],
      "imdbMovieId": "1242457",
      "originalTitle": "Taras Bulba",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["fkOHSmDFDFQ"],
      "plotSummary": "Set in the 16th century, this is a story about Ukraine's Cossack warriors and their campaign to defend their lands from the advancing Polish armies.",
      "tmdbMovieId": 17935,
      "avgRating": 3,
      "releaseYear": "2009",
      "numRatings": 8,
      "posterPath": "/zdwZUBFcVpg4ficCyZ2u6UIYruB.jpg"
   }
}