{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0310243",
      "video": false,
      "title": "Tracks",
      "recommendations": [],
      "backdrop_path": "/sFB4RxwJnvqVHe6vzTu7PVXBeLz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Peter Madagin",
               "gender": 2,
               "credit_id": "52fe48ebc3a368484e111c83",
               "name": "Chris Gunn",
               "profile_path": null,
               "id": 444684,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Officier Brian Clark",
               "gender": 2,
               "credit_id": "52fe48ebc3a368484e111c87",
               "name": "Ice-T",
               "profile_path": "/2XsNifyKI37XBbBbZEH8P21god1.jpg",
               "id": 21411,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Leanne Madagin",
               "gender": 1,
               "credit_id": "52fe48ebc3a368484e111c8b",
               "name": "Barbara Christie",
               "profile_path": "/vz1wl7REjuA6AlNTKBcH7CoHvDC.jpg",
               "id": 276890,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe48ebc3a368484e111c7f",
            "name": "Peter Wade",
            "profile_path": null,
            "id": 444687,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.016346,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 75025,
      "vote_count": 0,
      "budget": 0,
      "overview": "'Tracks' is based on the true-story of a middle class white suburban teenagers who unknowingly committed a senseless act of violence in July of 1982. Peter Madigan and his friends spent countless summer nights on the train tracks in Fairlawn, New Jersey when one evening, they mindlessly threw a switch and derailed an oncoming train resulting in the death of its conductor. This case made history in the New Jersey judicial system and these teenagers (who, at the time, were between the ages of 14 and 16) were the first in the state to be tried and convicted as adults. 'Tracks' chronicles their descent with a portrayal of a boy who made a mistake, paid the consequences and got back on 'track.'",
      "similar": [],
      "original_title": "Tracks",
      "runtime": 92,
      "poster_path": "/aOZHw3sva5lTwjCbhgazIu033a9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Two Dog Productions Inc.",
         "id": 7826,
         "origin_country": ""
      }],
      "release_date": "2005-09-09",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "His life began a dead end.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Wade"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Peter Wade"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0310243/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNjQxMTUzOTQ0N15BMl5BanBnXkFtZTcwMDc2NzYzMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Chris Gunn",
         "Ice-T",
         "John Heard"
      ],
      "reviews": [
         "Browsing online it seems Tracks is not a very popular movie or at least I struggled finding reviews on it!One might be led to believe that the opening rap track is the start of another typical good v bad prison movie like the million other prison movies!But this film retains some originality.The storyline itself will pull on the odd heart string, but I feel its another troubled teen movie that has a slightly predictable outcome. The way the young man adapts to prison life seems a bit surprising as the change from vulnerable young teen in a big scary adult prison to hard 'I can handle all the crap they give me' teen is not a smooth changeover!Its like he had a one day course training of how to deal will Adult Prison Afflictions'and it wasn't screened. Overall I did like the storyline and each scene does get you thinking 'whats next?',but as to the quality of the movie itself, the acting and the way certain scenes were edited just seem a little unlikely at times. Yes, watch it,but rent it before you buy it...if you do that is.",
         "\"Tracks\" is supposed to be about young teenagers 14 to 16 years of age being tried as adults and placed in an adult jail. Chris Gunn just doesn't look the part. He is too old, and this deprives the film of any impact. America has a reputation of being cruel towards juveniles. There is the possibility of a story along these lines, but the film doesn't manage to come across. There is a sexual harassment scene, and a couple of fights - almost compulsory stereotypes in this sort of story. But it is boring, boring, boring. The 'David and Goliath' factor, where a young and fragile hero goes up against a powerful brute villain is missing completely. There must be many young teenage actors who could do the part successfully. \"Salems Lot\" and \"Dune\" had the same problem. When will producers learn?",
         "This is a movie that could have been, and should have been good but it wasn't. Bad script. Unrealistic prison and visitation scenes, and just boring. I am not familiar with the NJ corrections systems but if in fact this young man was in a maximum security prison (which the movie said it was when he was admitted) nothing really made any sense. It is almost like the film makers really did not research corrections at all. Even the child abuse flashback scenes were just corny. More like a really bad made for TV but it was worse than most of the stuff even on Lifetime. Too bad a half hearted effort was put in from the makers of this film. 4/10.",
         "A low-budget movie, and it shows... some pretty bad acting; though Ice T was very good. The movie was slow-moving for the most part, had poor audio and equally poor visuals: dark and grainy; the casting was pretty bad, and thus, the story -which is purported to be 'true'- seems unbelievable. As stated before, the casting of the particular actors and actresses in TRACKS to play 14-16 year olds makes no sense, and even worse, detracts from the film; they're just way too old to play the parts called for. But even if that's a forgivable faux pas, the truth is, at times, this film was just so plain boring that I considered not bothering to see it through to the finish... There's really not much good to say about TRACKS-- But I only paid $1.07 with NJ sales tax to rent it at Red Box, so for a buck/seven, I give it a 4.",
         "The movie does start slow, but I enjoyed seeing Ice T play a very different role. He was convincing. What I did see was a movie that can be used to show at risk teens how some out of control fun can lead to more trouble than they are prepared to accept. I loved the prison scenes. They really had some of the best action in the movie and I found it funny. One unknown actor in the prison scene, whom I know as Sean Moore play an excellent thug in the prison scenes gave the prison scenes some reality where there was not a lot of good acting aside from Ice T. Not a movie I would pay to see on the big screen. With some help from some better production, rewriting and improvement on the casting, this could be a better movie. I purchased a copy for my collection.",
         "This movie was just lame on every level.The lead actor was as weak as water.The story was suppose to be disturbing, with urban \"street smarts\", and it reminded me more of a cross between an \"after school special\" and a Lifetime movie, but with some horribly delivered and unconvincing mature language.The plot was suppose to be a loosely based \"true to life\" story about a juvenile sent to an adult facility, and the hardships he endured, with rape scenes that I guess were meant to be disturbing. But as I said before, the acting and delivery of dialog,were so weak in this film,( I am ashamed to use the word 'film' to describe this crap ), that it turned it into a comedy for me.I have seen \"movies of the week\" that were more convincing.It didn't, at any point, bring any emotion, except extreme disappointment.Please don't waste your time. I gave it a 1 out of 10, only because 1 is the lowest # I could rate it.",
         "This is the worse film I've looked at in a long time. The acting rises from awful to alright. But the dialog is the worse thing its go going for it. Half the time it doesn't make any sense. The main character makes a youthful bad-ass mistake and gets punished for it. But Jersey sent the 15 year old up the river with the big boys. Insane. So, I think it good in that it got this kids story told and thats why I'm giving it ANY points. The script, the plot arrangement, non-scenceitcal errors in individual scenes and in producing, the cardboard cutout actors (check the gay dude - you canc't miss him - did I say the dialog? I''ll say it again, the dialog! This was all bad. I'm surprised Ice-T got near it, but he imight have had hopes for it. This kids got that is worth the world knowing about, so its a shame they've made such a bomb of it."
      ],
      "genres": [
         "Drama",
         "Crime"
      ],
      "productionCompanies": ["Two Dog Productions Inc."],
      "summaries": ["'Tracks' is based on the true-story of a middle class white suburban teenagers who unknowingly committed a senseless act of violence in July of 1982. Peter Madigan and his friends spent countless summer nights on the train tracks in Fairlawn, New Jersey when one evening, they mindlessly threw a switch and derailed an oncoming train resulting in the death of its conductor. This case made history in the New Jersey judicial system and these teenagers (who, at the time, were between the ages of 14 and 16) were the first in the state to be tried and convicted as adults. 'Tracks' chronicles their descent with a portrayal of a boy who made a mistake, paid the consequences and got back on 'track.'"],
      "budget": 0
   },
   "movielensId": 140934,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-09-09",
      "dvdReleaseDate": null,
      "directors": ["Peter Wade"],
      "runtime": 92,
      "movieId": 140934,
      "title": "Tracks",
      "mpaa": "R",
      "actors": [
         "Chris Gunn",
         "Ice-T",
         "Barbara Christie"
      ],
      "imdbMovieId": "0310243",
      "originalTitle": "Tracks",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["YtFzH7MwPIk"],
      "plotSummary": "'Tracks' is based on the true-story of a middle class white suburban teenagers who unknowingly committed a senseless act of violence in July of 1982. Peter Madigan and his friends spent countless summer nights on the train tracks in Fairlawn, New Jersey when one evening, they mindlessly threw a switch and derailed an oncoming train resulting in the death of its conductor. This case made history in the New Jersey judicial system and these teenagers (who, at the time, were between the ages of 14 and 16) were the first in the state to be tried and convicted as adults. 'Tracks' chronicles their descent with a portrayal of a boy who made a mistake, paid the consequences and got back on 'track.'",
      "tmdbMovieId": 75025,
      "avgRating": 3.5,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/aOZHw3sva5lTwjCbhgazIu033a9.jpg"
   }
}