{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0069377",
      "video": false,
      "title": "Thumb Tripping",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Shay",
               "gender": 1,
               "credit_id": "52fe48cac3a368484e10b2ed",
               "name": "Meg Foster",
               "profile_path": "/ntrx4PCnsvWIEaVbYZTzTxXC5no.jpg",
               "id": 41229,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b2f1",
               "name": "Michael Burns",
               "profile_path": "/izmZUJlI79oZSofb8SDFXATmRkh.jpg",
               "id": 160905,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Smitty",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b2fb",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lynn",
               "gender": 1,
               "credit_id": "52fe48cac3a368484e10b2ff",
               "name": "Marianna Hill",
               "profile_path": "/h3X58tFp2a7Tgt7gNW2sbM6N2EH.jpg",
               "id": 15659,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b303",
               "name": "Burke Byrnes",
               "profile_path": "/3AmO5oHFApvCtrjMVvHCBtPnDM2.jpg",
               "id": 109761,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Diesel",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b307",
               "name": "Michael Conrad",
               "profile_path": "/kleHZkUDjC1mVLJFSEajRRQoGO6.jpg",
               "id": 40390,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Simp",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b30b",
               "name": "Larry Hankin",
               "profile_path": "/biJbpyFcZXShqCNe41Z1kc82Gkb.jpg",
               "id": 11519,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe48cac3a368484e10b30f",
               "name": "Joyce Van Patten",
               "profile_path": "/wEUXn5Zgz88SZlTLZPrecfxGFOO.jpg",
               "id": 14108,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Gas Station Attendant",
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b313",
               "name": "Donald Elson",
               "profile_path": "/ns6i6s1IqswrSMOk5QGcJJ90rKt.jpg",
               "id": 16172,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48cac3a368484e10b317",
               "name": "William Murphy",
               "profile_path": "/u4vxkM39O3qh6d0bY5Bf6z4pSUq.jpg",
               "id": 104628,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Sandra (uncredited)",
               "gender": 1,
               "credit_id": "52fe48cac3a368484e10b31b",
               "name": "Anna Aries",
               "profile_path": null,
               "id": 96914,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Eric",
               "gender": 0,
               "credit_id": "5922f1c3c3a3687a4b067f50",
               "name": "Eric Butler",
               "profile_path": null,
               "id": 1821541,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Ed",
               "gender": 0,
               "credit_id": "5922f1cdc3a368791206487e",
               "name": "Ed Greenburg",
               "profile_path": null,
               "id": 1821542,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Danny",
               "gender": 0,
               "credit_id": "5922f240c3a3687a8e069415",
               "name": "Jason Goodrow",
               "profile_path": null,
               "id": 1821543,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Judy",
               "gender": 1,
               "credit_id": "5922f257925141485e0713d6",
               "name": "Nevada Spencer",
               "profile_path": null,
               "id": 1821544,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Donald",
               "gender": 0,
               "credit_id": "5922f2a99251414ab1069b91",
               "name": "Sundown Spencer",
               "profile_path": null,
               "id": 1821545,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48cac3a368484e10b2f7",
               "name": "Quentin Masters",
               "profile_path": null,
               "id": 254081,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b321",
               "name": "Don Mitchell",
               "profile_path": null,
               "id": 161573,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48cac3a368484e10b327",
               "name": "Joseph E. Levine",
               "profile_path": null,
               "id": 3777,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "560eb7de925141478d003adc",
               "name": "Harry Stradling Jr.",
               "profile_path": null,
               "id": 14094,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5922f2c9925141482f06c1bc",
               "name": "Robert Chartoff",
               "profile_path": null,
               "id": 16514,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5922f2d5925141485e07142b",
               "name": "Irwin Winkler",
               "profile_path": "/chJjLXD7PlFhuyeverNCgemIAAC.jpg",
               "id": 11472,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5922f30b925141499006c88d",
               "name": "Bob Thompson",
               "profile_path": null,
               "id": 1821547,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5922f330c3a3687912064964",
               "name": "Gerald Shepard",
               "profile_path": null,
               "id": 168223,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5922f3529251414ab1069c01",
               "name": "Marsha Kleinman",
               "profile_path": null,
               "id": 1267321,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5922f3b8c3a36878fe0657d9",
               "name": "Jennifer Shull",
               "profile_path": null,
               "id": 8426,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5922f44ac3a3687a8e06956f",
               "name": "Lambert Marks",
               "profile_path": null,
               "id": 1821561,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5922f45bc3a36878fe06584d",
               "name": "John W. Rogers",
               "profile_path": null,
               "id": 231258,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 1,
               "credit_id": "5922f4749251414add06a38c",
               "name": "Bonnie Prendergast",
               "profile_path": null,
               "id": 1204798,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.03703,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 74430,
      "vote_count": 0,
      "budget": 0,
      "overview": "Gary and Shay are two happy-go-lucky flower children who hitchhike in the beautiful Big Sur-Monterey area of California.",
      "similar": [],
      "original_title": "Thumb Tripping",
      "runtime": 94,
      "poster_path": "/dnp9xfS2PgM6L011jGxtaO4CDck.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "AVCO Embassy Pictures",
         "id": 494,
         "origin_country": ""
      }],
      "release_date": "1972-10-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "The freeway isn't just a road... it's their way of life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Quentin Masters"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Don Mitchell",
         "Don Mitchell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069377/",
      "coverLink": null,
      "actors": [
         "Michael Burns",
         "Meg Foster",
         "Bruce Dern"
      ],
      "reviews": [
         "Bruce Dern glares from the box art of this late period counterculture drama, but he's not the star of the film--merely one of the many quirky characters met by hitchhikers Michael Burns and Meg Foster as they work their way up the coast of Central California, destination: north! Thumb Tripping is a low octane, episodic drama which, like its characters, never really goes anywhere, but is a watchable diversion nonetheless. The film benefits from some nice location work--the brief look at San Francisco's North Beach is particularly good--and there's some pretty decent country and folk-rock songs to enliven the soundtrack. There are no standout performances, but Michael Burns is quite good as the naive lad whose illusions about life on the road slowly crumble away, and Marianna Hill scores points as a bosomy woman in a garish flowery hat.",
         "I initially took this movie for one of the \"sexy hitchhiker\" movies that were big in the 1970's (i.e. \"The Hitchhikers\", \"Pets\", \"Girls on the Road\"). But although Meg Foster is definitely sexy (and she's obviously a hitchhiker), this is less an exploitation flick than it is a more serious road movie/\"counterculture\" movie along the lines of \"Easy Rider\", \"Cisco Pike\" or \"Two-Lane Blacktop\". Foster and Michael Burns play a male-female pair (although not necessarily a couple)who decide to hitchhike together, both agreeing to \"take every ride offered\" (which wasn't a much better idea then than it is now). Among the people who pick them up are a selfish, abusive mother looking for her runaway daughter, a horny middle-aged trucker who locks Burns in the back so he can have sex with a not-entirely-unwilling Foster, and a knife-wielding Bruce Dern in full-blown psycho mode (The fact that they would even CONSIDER accepting a ride from Bruce Dern shows how impossibly naive this pair is). This movie ends up kind of being like \"Candide\" in its picaresque criticism of its contemporary society with the Burns character being the hopelessly naive Candide and the Foster character being Cunegonde, his oft-abused but very resilient girlfriend. The tone though is much more bittersweet and romantic than satirical. Movies about the so-called \"counterculture\"of that era tend to carry a lot of baggage today--misty-eyed Baby Boomer nostalgia on one hand, and finger-wagging, right-wing moral condemnation on the other. In my mind though, the young people of the Baby Boom generation were neither rebellious heroes nor selfish hedonists--they were just scared, confused kids reacting naturally to the very turbulent times they lived in. This particular movie has the advantage of being obscure and not as hopelessly iconic as something like \"Easy Rider\". It's also an early 1970's movie rather a 60's movie. This a subtle distinction I know, but these 70's movies seem a little more real somehow, having been made after the Manson Family and Altamont had punctured the more hippy-dippy dreams of the 60's, and after all the poseurs and phonies of the era had returned to conventional lives (once they realized they weren't get drafted and sent to Vietnam) and were already well on their way to becoming the \"yuppies\" of the Reagan Era. The \"counterculture\" of this time really was a true counterculture again, not just the hip thing to do. This movie launches some criticisms of this counterculture naturally enough (like the Foster characters hurtful \"free love\" ethos), but most of the real criticism isn't aimed at the foolish naivete of the young protagonists, but at the \"establishment\" people they meet. The movie never gets too polemical though. It reminded me more than anything of \"Jesus Son\", a movie made in 2000, but based on a Denis Johnson novel written in this era. Like that movie, this honestly portrays human foibles (both comic and tragic), but it is ultimately pretty non-judgmental. Interesting movie. See it if you get the chance.",
         "Essentially a simple story of a young man and a young woman who make a chance meeting on the beach and are heading in the same direction, so they decide to thumb it together. While their mutual attraction grows by hormones and without the unnecessary element of romance so foreign to most young lovers, they are exposed to a series of characters who give them rides and who indoctrinate them to the dangers and wonders of life on the road. Bruce Dern and Michael Conrad are standouts as two of the drivers who move them along the highway. There is some coming of age for both youngsters, mixed with heartbreak born from confusion and jealousy, but ultimately harmless. Again, it's really a simple, enjoyable story about a couple of hitchers. The film treats with some of the hippie concepts from the early 70's of free love and free rides and tends to show that, as the Steely Dan song goes, \"Only a fool would say that.\"",
         "The strikingly lovely Meg Foster and baby-faced, shaggy-haired Michael Burns are a flighty, wide-eyed, free'n'easy hippie couple who encounter a stunningly twisted array of distinctly all-American grotesque characters during their aimless trek across the United States in this compellingly groovy \"Easy Rider\"-inspired early 70's road movie curio. Foster and Burns make for likable leads, with the underrated and always captivating Foster particularly fine in a rare starring role (Foster basically reprised the character in the oddball cannibal horror outing \"Welcome to Arrow Beach\"). Bruce Dern contributes a stand-out scary cameo as a jittery, switchblade-wielding psycho motorist in a yellow hot rod; Joyce Van Patten likewise turns in a marvelously hideous portrayal of a bitter, smugly square and shockingly venomous suburbanite harridan mother from hell; Mariana Hill and Burke Burns are alarmingly gross and vulgar as a loud, trampy white trash wife and her boozy, insecure macho jerk husband, and \"Hill Street Blues\" TV series regular Michael Conrad is solid as a burly, scruffy, friendly, but horny truck driver who gives our wandering twosome a ride into San Francisco. Quentin Masters' spare, sharply observant direction wisely avoids the usual stylistic overkill excesses which mar many counterculture films made at the time, opting instead for a more timeless, largely unadorned and plainly naturalistic style which has dated pretty well. Don Mitchell's episodic, yet coherent script conveys a series of vividly realized, colorful and engrossing vignettes with topmost clarity and acuity, perceptively nailing the rampant hedonism, moral permissiveness, Nixon-era unease and paranoia, corrupting and erosion of flower child ideals, mass disillusionment, and intense spiritual malaise which defined the early 70's. Harry Stradling, Jr.'s dewy, golden-hued cinematography gives the picture a sunny, beautifully lyrical look while the soundtrack boasts plenty of nicely harmonic and flavorsome folk ballads. The carefree tone darkens as the film leisurely progresses towards its hauntingly downbeat conclusion, thus ending things on a startling note of grim self-discovery. An admittedly passé, but still intriguing period piece.",
         "Thumb Tripping is a little-known hippie road movie made in 1972. It's little-known for a reason. The reason is that it is somewhat poor.... and those who saw it (of which there were few) did not build for it a word-of-mouth reputation of any note. There are a few cast members in it who went on to bigger and better things, notably Meg Foster and Bruce Dern; also the director Quentin Masters would later score a sexploitation hit with the Joan Collins movie The Stud. However, in this film there is very little of interest other than a freewheeling narrative that offers occasional insights into the permissive and casual attitudes of the youth of the late '60s/early '70s. In most departments, Thumb Tripping is a tedious, dated, muddled and totally forgettable misfire. Young hitch-hikers Gary (Michael Burns) and Chay (Meg Foster) make their way around California together, hitching rides when they can and spending evenings under the stars. Gary is a kid from a decent background and a home in Connecticut who has chosen to postpone going to college in order to \"discover himself\"; Chay is a more freewheeling type who just wants to experience the here-and-now while she is still young. During their wanderings, Gary and Chay come across various weird types and sometimes find themselves caught up in bizarre adventures. They're picked up by road-racers Smitty (Bruce Dern) and Simp (Larry Hankin) who threatens them with a switchblade; later they hitch a lift from an embittered woman (Joyce Van Patten) who has hated hippies since her daughter ran away to become one; another time Chay finds herself being ogled by a middle-aged trucker (Mike Conrad); and in their final \"thumb trip\", they find themselves travelling with dysfunctional husband-and-wife alcoholics (Mariana Hill and Burke Burns). The episodes come and go without leaving much of an impression, partly due to the fuzzy soundtrack (which renders much of the dialogue inaudible) and partly because of the thoroughly uninteresting main characters. Michael Burns gives a non-performance that may one day be recommended by doctors as a cure for insomnia, while Foster fares little better as a dislikable female lead whose character seems to think she's free and happy but in reality is just a self-centred slut. The gallery of background characters are far more fascinating than these two, but they come and go too quickly to make much of an impact. The script (by Don Mitchell, from his own novel) has no idea where it's going and merely ambles along from one pointless situation to another. Where Easy Rider was similarly plot less and freewheeling, at least it had interesting characters and situations, and charismatic performers. Thumb Tripping has none of that and is a very tough film to endure from low-key beginning to unsatisfying end.",
         "Like a bad haircut, this 1971 film belongs to a different time...what once might have been anti-establishment is, in hindsight, a badly dated, not particularly entertaining piece of work. Michael Burns, who played \"the boy\" in Altman's THAT COLD DAY IN THE PARK, is thrown together with sexual free spirit Meg Foster as they hitchhike through northern California. The movie is fairly episodic, with the duo running into wacky Bruce Dern, wacky Joyce Van Patten and wacky Michael Conrad. They also get involved with wacky Burke Byrnes and his giddy wife Marianna Hill. The director, Quentin Masters, makes some really odd decisions (close ups of mouths, oddly timed fades, etc) that distract from rather than enhance any of the action. The acting is fine, though Burns really can't carry a film and there is little chemistry between him & Foster. There is plenty of nice scenery captured by veteran cinematographer Harry Stradling Jr."
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["An adventurous couple of hitchhikers decides to accept every ride that is offered to them. no matter how odd the driver might be. They'll get more than they bargained for."],
      "budget": 0
   },
   "movielensId": 141193,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-10-01",
      "dvdReleaseDate": null,
      "directors": ["Quentin Masters"],
      "runtime": 94,
      "movieId": 141193,
      "title": "Thumb Tripping",
      "mpaa": "R",
      "actors": [
         "Meg Foster",
         "Michael Burns",
         "Bruce Dern",
         "Marianna Hill",
         "Burke Byrnes",
         "Michael Conrad",
         "Larry Hankin",
         "Joyce Van Patten",
         "Donald Elson",
         "William Murphy",
         "Anna Aries",
         "Eric Butler",
         "Ed Greenburg",
         "Jason Goodrow",
         "Nevada Spencer",
         "Sundown Spencer"
      ],
      "imdbMovieId": "0069377",
      "originalTitle": "Thumb Tripping",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["6Y3WgzYjczU"],
      "plotSummary": "Gary and Shay are two happy-go-lucky flower children who hitchhike in the beautiful Big Sur-Monterey area of California.",
      "tmdbMovieId": 74430,
      "avgRating": 2,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/dnp9xfS2PgM6L011jGxtaO4CDck.jpg"
   }
}