{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097423",
      "video": false,
      "title": "Get Smart, Again!",
      "recommendations": [],
      "backdrop_path": "/y1M1AepAZ9VuoCc3WEWlTBLF80F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Maxwell Smart",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b409",
               "name": "Don Adams",
               "profile_path": "/aay1m7742dMKWR8vDL0hfTHODIo.jpg",
               "id": 94845,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Agent 99",
               "gender": 1,
               "credit_id": "52fe45379251416c9102b40d",
               "name": "Barbara Feldon",
               "profile_path": "/3eb2mCs6U8qSd2lTxd3PFCPVPyH.jpg",
               "id": 87156,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Conrad Siegfried / Prof. Helmut Schmelding",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b411",
               "name": "Bernie Kopell",
               "profile_path": "/zm3BHtRchrlA41j1WaTqvb3K8rW.jpg",
               "id": 80257,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Hymie",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b415",
               "name": "Richard Gautier",
               "profile_path": "/9q4PrJwH2erhRLjVqJ6qe8NHevm.jpg",
               "id": 81846,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Larrabee",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b419",
               "name": "Robert Karvelas",
               "profile_path": null,
               "id": 94849,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Shtarker",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b41d",
               "name": "King Moody",
               "profile_path": null,
               "id": 111382,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Nicholas Dimente",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b421",
               "name": "Harold Gould",
               "profile_path": "/ntLYtxvSrsuWu2pZHGuSUA4gXLy.jpg",
               "id": 14833,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Maj. Waterhouse",
               "gender": 0,
               "credit_id": "52fe45379251416c9102b425",
               "name": "John de Lancie",
               "profile_path": "/bb3j02gYvgs5ApK2l2qKCweYW5z.jpg",
               "id": 11077,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Cmdr. Drury",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b429",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Beamish",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b42d",
               "name": "Steve Levitt",
               "profile_path": null,
               "id": 78384,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Agent 13",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b431",
               "name": "David Ketchum",
               "profile_path": "/mjZiUukfDLaVnCJHRgSuuOpSVbP.jpg",
               "id": 55458,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Dr. Denton",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b435",
               "name": "Danny Goldman",
               "profile_path": "/lmWTlSAxjFxEnsDOU2sQ5IjgqDS.jpg",
               "id": 111383,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Hottentot",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b439",
               "name": "Roger Price",
               "profile_path": null,
               "id": 111384,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe45379251416c9102b43d",
               "name": "Rachelle Carson",
               "profile_path": "/jJxsQQdiheweonEK3TPrEcX8Dqh.jpg",
               "id": 111385,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "President",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b441",
               "name": "Lou Felder",
               "profile_path": null,
               "id": 106849,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Dr. Godivar",
               "gender": 0,
               "credit_id": "52fe45379251416c9102b445",
               "name": "Kate Stern",
               "profile_path": null,
               "id": 111386,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Merriweather",
               "gender": 2,
               "credit_id": "52fe45379251416c9102b449",
               "name": "Jim Antonio",
               "profile_path": null,
               "id": 111387,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45379251416c9102b3f3",
               "name": "Gary Nelson",
               "profile_path": null,
               "id": 47893,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45379251416c9102b3f9",
               "name": "Leonard Stern",
               "profile_path": null,
               "id": 95128,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45379251416c9102b3ff",
               "name": "Mark Curtiss",
               "profile_path": null,
               "id": 111380,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45379251416c9102b405",
               "name": "Rod Ash",
               "profile_path": null,
               "id": 111381,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598dd759c3a36875a2014086",
               "name": "Peter Rodgers Melnick",
               "profile_path": null,
               "id": 21611,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598dd75f92514178ec014704",
               "name": "Gayne Rescher",
               "profile_path": null,
               "id": 1798,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "598dd765c3a36875a2014099",
               "name": "Donald R. Rode",
               "profile_path": null,
               "id": 15926,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "598dd76b92514178a4015bd6",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "598dd778c3a3687559015e7c",
               "name": "K.C. Fox",
               "profile_path": null,
               "id": 1517518,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "598dd77ec3a368758e015323",
               "name": "Greg J. Grande",
               "profile_path": null,
               "id": 1332209,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "598dd78592514178b10147c6",
               "name": "Violette Jones-Faison",
               "profile_path": null,
               "id": 1417489,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "598dd794c3a36875a20140eb",
               "name": "Burt Nodella",
               "profile_path": null,
               "id": 1236797,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.710829,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33787,
      "vote_count": 6,
      "budget": 0,
      "overview": "KAOS has invented a weather machine so Maxwell Smart and Agent 99 are called back into action to foil this evil plan.",
      "similar": [],
      "original_title": "Get Smart, Again!",
      "runtime": 96,
      "poster_path": "/3zvfwT26TqOsy6dAjxKVTpXYErr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "IndieProd Company Productions",
            "id": 959,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Phoenix Entertainment Group (PEG)",
            "id": 36881,
            "origin_country": ""
         }
      ],
      "release_date": "1989-02-26",
      "vote_average": 4.1,
      "belongs_to_collection": {
         "backdrop_path": "/5zdRyHdvPvEDhnFumbO5RXxDxt.jpg",
         "name": "Get Smart Collection",
         "id": 108669,
         "poster_path": "/dH7S9Scrqki6rWyiuvx7xnO4S3n.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Nelson"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Leonard Stern",
         "Leonard Stern"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097423/",
      "coverLink": null,
      "actors": [
         "Don Adams",
         "Barbara Feldon",
         "Bernie Kopell"
      ],
      "reviews": [
         "Goes a long way in making up for the abysmal THE NUDE BOMB nine years earlier. Dedicated to the memory of Ed Platt who died in 1974, Max is reunited with \"99\" and all the old favorites, Siegfried and Agent 13 as he takes on the awesome task of putting the Chaos \"weather machine\" out of action. With wife \"99\" gone domestic and the twins in college, Max tries to handle his assignment without 99's knowledge as \"working mothers\" are not allowed to spy. Predictably, the wheels fall off for Max, and it is left to \"99\" to save the day, after which she joins him in his assignment. The old magic is still there and both Adams and Feldon reprise their roles effortlessly. Ed Platt as chief is sorely missed, but wherever he is now, watching this would have brought a smile to his face.",
         "It's 1989. Kaos is back in business. Who better to stop them, than Maxwell Smart, Agent 86. It's been 20 Years since Control was in business fighting Kaos. Max has been called back to active duty in this hilarious reunion movie of the hit TV show Get Smart. Max (Don Adams) has reactivated his team from Control, which includes his still beautiful wife Agent 99 (Barbara Feldon). Also returning is Robert Karvalas as Larrabee, Dick Gautier as Hymie, and Dave Ketchum as Agent 13. Kaos plans to take over the world with a weather machine. Bernie Kopell returns as Siegfried with his companion Shtarker (King Moody) as they lead Kaos in their plan. Though a lot of the old jokes are re-used, you will still find this movie funny. It's the series all over again and it shows that Get Smart has not lost its touch after 20 years. It is still as popular as ever. Do not skip this movie. A+++++",
         "Everyone is back! Except for the Chief(Edward Platt, died in 1974) in this reunion of the fabulous 60's spy spoof \"Get Smart\". Agent 86, aka Maxwell Smart(Don Adams) is called up to fight KAOS, along with Agent 99(Barbara Feldon) they will be kicking butt again. Lots of new gadgets are here, like the magnet shoes that both Smart and KAOS leader Siegfried(Bernie Kopel, who later became the Doctor on \"The Love Boat\") wore. Then there's that Maj. Waterhouse(John deLancie, The Notorious \"Q\" on the latter \"Star Trek\" series: TNG, DS9, and Voyager) who would end up a double-agent. 99 used that gun that really packed a punch. The coolest gadget that topped it all was the laser credit card, only if Smart would learn to deactivate it first after use. The reunion movie was great, and all the characters were regular as usual. It was nice the movie mentioned Platt after 15 years of his death, he would be smiling down on everyone in the set. The reunion and the originals are a gem, the last attempt of revival should have been lidded. CASE CLOSED! Rating 2.5 out of 5 stars.",
         "How come that a extremely good series would not have its twenty years later revival. A must for the real fan. I enjoyed it, but somehow it was like seeing a bunch of old clowns, repeating old jokes (well, I guess it was exactly that), but the jokes were not funny anymore. If you didn't like the series, this is not the movie for you. If you liked the series, as much as I did, this is a must, but don't set too high your expectations, it's a thing for remembering and enjoying.",
         "\"Get Smart, Again\" rights the ship that had listed badly with \"The Nude Bomb\" nine years earlier. For whatever reasons, the late great Don Adams and Robert Karvelas as Larribee were the only series regulars to star in the earlier film (Bill Dana and Joey Forman had small roles). This time around, the gang's all here, except Ed Platt who died in 1974, and they haven't lost a step. All those dumb, idiotic, wonderful jokes are there; the timing is there; the characters are there. It's all there and it's all wonderful. For fans, this is a joyful trip back down memory lane. Viewers new to the insanity will be curious to check out the classic series. \"Would you believe....\" Yes, we would.",
         "This is by far the better of the two movies inspired by the TV series \"Get Smart.\" Max and 99 are together again, fighting Kaos. Although this time without the help of their faithful boss and friend, the Chief (Ed Platt died in 1974 and the movie is dedicated to him). The Smarts have moved from their apartment to a home in the D.C. suburbs and the twins are in college. When Max is recalled to spy duty to stop Kaos's \"weather machine\", he is allowed to get his old team back together, but is not allowed to tell 99 (because married spies with dependant children cannot go on missions together). Because of his love and respect for her, Max refuses to lie to 99 and covers up. Of course, this causes him his usual problems, topped by an attempt on his life at home. He is saved, of course, by his loving and faithful 99. He then tells her everything and they are off to save the world again. Don Adams and Barbara Feldon fall back into their roles as if twenty years had never passed. Bernie Kopell and King Moody are also great as Seigfried and Starker. If you are a \"Get Smart\" fan, this movie is a must see.",
         "Although, this movie wasn't written by the original comic genius Mel Brookes (sic), it still has the sartirical humour that has made \"Get Smart\" a very well remembered and popular name in TV history. It has all the no-brainers that the original series had, eg: \"Would you believe...\", etc and I think Don Adams is a great actor that can pull off any comic routine to a tea. Although, with the missing Edward Platt (the Chief 1916 - 1975), the movie is dedicated to his memory which I think is a nice gesture, but it does however make the movie seem like \"it's missing something\". Ed Platt, in the original series, was like Max's \"scape-goat\", almost like Laurel and Hardey (the Chief being the serious one and Max being the bumbling idiot). It's also great to see Barbera Feldon as agent 99 along side Max again, even though she's older, ha ha! All in all, a great little TV movie and a must see if you're a fan of the old \"Get Smart\" series.",
         "For those who saw the original series, this one's pretty good. The menace in the film, KAOS getting their hands on a weather control machine, is typical of the television show. Even to how they demonstrate that they have it. The film has Maxwell a bit more smart than he was in the show, but just marginally. Some of the old gags have new twists, like the phone booth for access to Control Headquarters. Some of the newer gags are similar to the worst of the gags on the TV series. There was an in-joke or two, including the bad guys treating their agents like baseball players, but the writing was, IMHO, a little strained. Nevertheless, for the most part, the film captures a lot of the spirit of the old show. It's primarily for those who enjoyed the old series, but compared to some of the current television comedies, it still stands out.",
         "Given that the premise of the film is that Smart, Agent 99 and the rest of the (still alive) rag-tag Control agents are reactivated to fight Kaos, one really has to be a fan of the original series to enjoy the movie. I can't remember how old Don Adams was when he started the series, but, make-up aside, in this production, he looks 70s-ish. Barbara Feldon still looks amazing, and Bernie Kopell as \"Siegfreid\" doesn't seem to have aged a bit. HOWEVER, if you're not a fan of the original series, this is not for you. There are constant references back to the series but, there are many one-liners referring to the current (at the time of release) US government. They only work as comedy/irony if applied to the Govt of the time. Nothing ages as fast as political satire - unless that satire is timeless. And this ain't. Still... Poke fun at the intelligence gathering community, because if we don't, who will?",
         "A hilarious recycling of their best jokes, gags, situations. All the actors (except for the late Ed \"the Chief\" Platt) are back and consistently maintain their original characters from the TV series. This is also far superior to other TV special \"reunion\" shows where nothing really happens except maybe flashbacks. Don't miss it!(\"by this much\").",
         "I saw The Nude Bomb in 1980, and was highly disappointed. This made-for-TV movie is better. It doesn't totally recapture the goofiness of the original series, but it makes a good effort. All of the crazy characters are back with the exception of The Chief (the actor who played this character passed away in the mid-1970's). There are some scenes in this movie where the characters look as if they haven't missed a step from who they were in the original series. I would suggest skipping The Nude Bomb entirely, and watching this one instead.",
         "The '80's saw a number of U.S. made-for-television movies reuniting the casts of old shows, including 'The Man From U.N.C.L.E.', 'The Munsters', 'The Six Million Dollar Man' and 'The Wild Wild West'. Amongst these was 'Get Smart Again!' which brought back Don Adams as incompetent CONTROL secret agent 'Maxwell Smart' and Barbara Feldon as fellow agent and wife '99'. Created by Mel Brooks and Buck Henry, the original was a huge hit which ran for five years. Directed by Gary Nelson ( who made the 1979 Disney sci-fi adventure 'The Black Hole' ), 'Get Smart Again!' opens in Washington where Commander Drury ( Kenneth Mars ) is wondering what to do about the revived threat of KAOS, who have built a weather machine with which to blackmail the world. Major Waterhouse ( John De Lancie ) suggests reactivating Max Smart. The man in question is at a funeral, as one of the pallbearers, when his old shoe/phone rings for the first time in years. While he goes off to answer it, the other pallbearers drop the coffin and it slides down a grassy knoll, eliciting a chase. Max is given the assignment of defeating the KAOS plan and sets about reuniting his crack team of agents, amongst them Hymie the robot ( Dick Gautier ), currently working as a test dummy in a driving school, and Larrabee ( Robert Karvelas ), who has a habit of popping up where you least expect him, such as in a filing cabinet and a fire hydrant. The previous attempt at reviving the Smart character was the 1980 movie 'The Nude Bomb', which strangely failed to include '99' and was not generally liked by fans. 'Again' works better because it feels like an extended episode, with the famous title sequence and theme tune back in place, and Bernie Kopell reprising his role as Nazi-like KAOS villain 'Siegfried'. Though Mel Brooks did not have a hand in the script, his zany sense of humour is very much in evidence. For instance, when Smart, Drury and Waterhouse wish to exchange secrets, they go up onto the roof of their headquarters and attempt to speak while helicopters hover overhead. Unfortunately, most of what they say is rendered inaudible by the choppers' engines and they are nearly blown off the roof by the draught caused by the blades. Later, a KAOS killer breaks into Max's house at night. Not wishing to disturb 99, Max tries to fight as quietly as possible, a process that involves him tossing cushions and shoving chairs around so that the killer will not make a sound when he falls on the floor. All of Max's catchphrases ( 'Missed it by that much!', 'Would you believe...' and 'And loving it!' ) are present and correct, as is the famous 'Cone Of Silence'. There are new gadgets too; Max wears magnetic boots which pull the villain's gun out of his hand. Then there's 'Dr.Denton's Hall Of Hush', a room in which speech is converted into words which then magically appear in mid-air. Soon there are so many floating about it becomes impossible for either Drury or Max to read them. Adams is as wonderfully deadpan as ever, spitting the absurd dialogue through clenched teeth as though he actually believed it. The chemistry between him and Feldon is nicely preserved. Max continues to call his partner '99' even though they have been married for twenty years! In a nice touch, the film is dedicated to the late Edward Platt, who played 'The Chief' in the original series. In the mid-90's, a new series was made, once again starring Adams and Feldon, but focusing on the exploits of their equally incompetent son, played by the unfortunately-named Andy Dick. It lasted only seven episodes. In 2008, the inevitable 'Get Smart' movie was released, starring Steve Carell as 'Max'. I have not seen it, so won't comment. Though made on a typical television budget, 'Again!' manages to be a lot more amusing and inventive than Mike Myers' overrated 'Austin Powers' movies.",
         "'The Nude Bomb' might be the worst TV reunion movie ever, and 'Get Smart, Again!' might be the best. 'Get Smart, Again!' is genuinely funny, and has a storyline that actually works on its own. The writers, director, and producer of 'Get Smart, Again!' realized they had to create a funny, well-written script before filming ever started -- and they did. Too many reunion movies assume that nostalgia for the old show will be enough to satisfy fans. But it isn't enough. 'Get Smart, Again!' is as well-written as many episodes of the old show. And it was great to see virtually the entire surviving cast -- Adams, Feldon, Bernie Kopell, and the actors who played Larrabee and Agent 13. Plus, the choice of Harold Gould to play the villain was inspired, since he'd played a villain in an episode of the original show. Excellent made-for-TV movie -- as I say, maybe the best TV reunion ever.",
         "This is way a reunion movie should be done! Quick explanation of where everyone has been in the past 20 years and on with a new adventure. The plot is familiar, KAOS has a weather machine to alter the climate with a ransom demand of $250 Billion not to unleash its fury. It falls to Maxwell Smart to be reactivated stop KAOS. All of the gang is back except for Ed Platt as Chief. The gags and jokes that were gems include Smart answering his shoe phone as a pallbearer,the Hall of Hush to thwarting a hit-man with remote controlled file cabinets to Hymie taking every order literally. Few of the gags and jokes fall flat, unlike nearly all comedies now as they reach . Don Adams was still spot on with the catch phrases, one liners and quite amazing with the physical comedy at age 66. Harold Gould does the villain role in his unique style and John de Lancie as Maj. Waterhouse was great. Hymie and Larrabbee were fabulous as if nothing had changed after 20 years. Agent 99 Barbara Feldon didn't miss a beat as the comic foil and looked as lovely as ever, who I had a crush on when the show was first on the air. If you're reading this Barbara, don't have anything to do for a Saturday night and like dating guys 50 years younger, (or would you believe 24 years younger?), go and contact me. The movie has a few minor issues, Kenneth Mars as Commander Drury doesn't pull off the exasperated Chief role as Ed Platt would had done, Bernie Koppell Siegfried's comic timing wasn't as sharp as it could had been and Don Adams looked rather ill in a few scenes. The movie should have had a laugh track and Get Smart music in keeping with the TV series. It's a real shame that this movie isn't remastered to restore the fading of VHS transfer, (Digitally touching up Don Adams, adding the laugh track & music would be a bonus.) This is an underrated gem (far better than the Steve Carrell remake) that stacks up with the best comedy movies.",
         "As most comments here mention, this is a film for the fans of the original series, and if that's not you, you're unlikely to enjoy this film too much. It's not bad, as a film, but as a one-off it's a bit poor. That being said, this movie was a really nice re-visit to the old gang of Control. Ed Platt's sad passing leaves him sorely missed as the Chief, in this film and the travesty of the Nude Bomb of 1980 (though it's unlikely that even he would have been able to save that one). The story picks up the lives of Maxwell Smart and Mrs Maxwell Smart, and shows that Kaos reigns still, with Siegfried and Shtarker continuing to fill the world with evilness and badness. Control has been disbanded, but the old members are needed to take on their mantle of anti-espionage agents once again! Kitted out with new gadgets and old jokes, the fun gets rolling! The jokes are often direct repeats from the series, but for the most part that just doesn't matter. This was a really sweet return to the Get Smart franchise, with the 20 missing years showing on everyone's faces but not hindering anything at all; Don Adams still taking the knocks as well as he always did, with his ever-visible stunt-double taking the longs-shots like usual ;) Fans, don't miss this movie! :D",
         "I really wanted to love this movie as much as I love the series. Unfortunately this movie did not do the series justice. Don Adams looks ill in this movie, like he's sick and just holding it all together. Barbara Feldon is still the sexy agent 99, even though she's showing her age. Ed Platt (The Chief from the series) is sorely missed. Although it's nice to see most of the gang, the jokes are a little old as is the cast. I suppose it's a nice \"goodbye\" to a series that was in top form at it's peak but was never followed up until it was too late.",
         "Get Smart was never a \"great\" show. I mean the whole idea was the campy, tongue in cheek humor, the delicious wit of Don Adams, spoofing the entire spy action James Bond Genre. I remember the original series in reruns as a kid and it was one of the TV greats!! You would never think that they could bring a cast together nearly thirty years later and still pull it off and yet that is precisely what they do!! The movie isn't good...I mean it's B Movie elongated TV Episode quality with the same quirks and tongue in cheek humor with some digs at politics and other things in a light and cheery way. The villains are really bumbling nice guys and Don Adams slips right back into the Maxwell Smart character and looks great!! True fans of the original series will find Edward Platt's Chief sadly lacking as a big part of the series was the incredible comedic timing and relationship between Max and the Chief. Still Max and 99 are in full force with some new characters and some old ones as well. It was a great film to watch before seeing the new Get Smart movie to refresh my memory to the old series. The best part about it hands down is what an amazing job the cast and film makers did bringing the series to life again. Don Adams truly is Maxwell Smart. I think he is more of his character so it is effortless for him. He's strong on screen, funny in a very campy way and pulls it off every time. He made the series, and the film and everything else he did worthwhile just by being himself. Barbara Feldon also returns to her role as Agent 99. I must say that I thought her role was toned down a lot in this film. Her and Max still have their chemistry and she's still soft and sweet and smart but tough on the inside. I thought her and Max would spend more time teamed up in a reunion but she doesn't have that big of a role. Her and Adams have terrific chemistry even after all these years. Bernie Kopell also returns as #1 Kaos agent Conrad Siegfried and a rather silly second role as Siegfriend's twin brother. Kopell is still terrific and campy with his crazy accent (ironically he is very well known as an actor for being able to do accents.) Kopell and Adams share a distinctive talent for physical comedy and quick wit and they work great together. Richard Gautier returns in one of my favorite Get Smart roles as robot Hymie. His dry humor and the entire gag of taking things literally never gets old as bad as it is and him and Adams are also terrific together. Robert Karvelas also returns although in a small role as Larrabee. And finally David Ketchum appears as Agent 13 in his usual crazy hiding spots. If you have never seen Get Smart the series or weren't a fan I promise that you will quite likely hate this TV rendition because it truly is for the fans. I mean it covers literally everything from the series including the many running gags as well \"Missed it by that much\" \"Would you believe...\" and so on. The special effects are mostly non existent using a floor level budget which the original series probably ran off about the same twenty years before this. Director Gary Nelson worked on the original series and I really do think that made all the difference because I just can't express how impressed I was with how much this brought me back to watching those original episodes. I score it as low as I am simply because it's very low budget, campy and not exactly top notch viewing but fans will love it and if you need a little trip down memory lane you'll want to see this one for sure as it is a great honor to the ground breaking memorable series. 6/10",
         "Unlike the 1980 movie, they brought back much of the old cast, and revived the old atmosphere. The jokes, the look, the characters, the interaction, and updated it without overdoing it. There were some funny twists; Siegfriend having a twin brother on the side of good, Hymie having hurt feelings about Smart not contacting him for a long time, Larrabee having received a letter from then-President Nixon to stay at the old CONTROL headquarters building, even to the time where it is being demolished and Smart has to pull him out. Also the new jokes were in line with the ones from the old TV show, and they didn't try to make a substitute for Edward Platt. An enjoyable bit of nostalgia.",
         "With most TV series, it is just better never to look back. Again and again and again, TV movie reunion shows based on beloved TV series are in the end moribund messes that rarely reunite the cast, since so many of them are dead!! The worst of these awful TV movies that I have seen would have The Beverly Hillbillies (where almost all the cast was dead), Leave It To Beaver (where Ward was dead so June just talked to his tombstone) and Andy Griffith (where Otis was no longer a drunk and Barney was too pathetic to talk about further). While not AS bad as these movies, this GET SMART reunion movie isn't a whole lot better. At least it does have most of the original cast, though Ed Platt (the Chief) was too dead to appear--even with the assistance of Disney Animatronics or by way of a pact with Satan. Dick Gautier (Hymie), Barbara Feldon (99), Bernie Koppel (Ziegfried) and several other familiar faces from the original program do make appearances. The only problem is that although they did an impressive job as far as the cast goes, they gave them a terribly unfunny and uninvolving script. In the end, it's a time passer at best, and an insult to fans at worst."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "IndieProd Company Productions",
         "Phoenix Entertainment Group (PEG)"
      ],
      "summaries": [
         "Maxwell Smart is called back to duty as KAOS is back causing trouble again, this time with a 'weather machine'. Although instructed to keep his mission secret from his wife, 99, Max can't keep hiding from her forever, and soon the two are working together again in this second Maxwell Smart movie.",
         "Smart is called back to duty as KAOS is back causing trouble again with a 'weather machine'."
      ],
      "budget": 0
   },
   "movielensId": 141189,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-02-26",
      "dvdReleaseDate": null,
      "directors": ["Gary Nelson"],
      "runtime": 96,
      "movieId": 141189,
      "title": "Get Smart, Again!",
      "mpaa": "",
      "actors": [
         "Don Adams",
         "Barbara Feldon",
         "Bernie Kopell",
         "Richard Gautier",
         "Robert Karvelas",
         "King Moody",
         "Harold Gould",
         "John de Lancie",
         "Kenneth Mars",
         "Steve Levitt",
         "David Ketchum",
         "Danny Goldman",
         "Roger Price",
         "Rachelle Carson",
         "Lou Felder",
         "Kate Stern",
         "Jim Antonio"
      ],
      "imdbMovieId": "0097423",
      "originalTitle": "Get Smart, Again!",
      "genres": [
         "Action",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["sbxht5LPVMA"],
      "plotSummary": "KAOS has invented a weather machine so Maxwell Smart and Agent 99 are called back into action to foil this evil plan.",
      "tmdbMovieId": 33787,
      "avgRating": 2.75,
      "releaseYear": "1989",
      "numRatings": 2,
      "posterPath": "/3zvfwT26TqOsy6dAjxKVTpXYErr.jpg"
   }
}