{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stand-up comedy",
         "id": 9716
      }],
      "imdb_id": "tt4512714",
      "video": false,
      "title": "Demetri Martin: Live (At The Time)",
      "recommendations": [
         348857,
         347264,
         216652,
         86705,
         364089,
         230158,
         295368,
         425003,
         298522,
         400608,
         367735,
         435351,
         391899,
         426488,
         396109,
         425498,
         341176,
         408546,
         449359,
         259395
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Self",
            "gender": 2,
            "credit_id": "55cdefaa9251412e51000d78",
            "name": "Demetri Martin",
            "profile_path": "/fldjScjsz4SwxwEzSKGqjJuwgvo.jpg",
            "id": 84075,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "55cdef92c3a3681bf9001ef3",
            "name": "Jay Karas",
            "profile_path": "/e0wTSZp4gsJB7NABVwbC3wr1jz2.jpg",
            "id": 84074,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 1.524655,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 354544,
      "vote_count": 19,
      "budget": 0,
      "overview": "Demetri Martin brings his off-kilter take on acoustic guitar, hairless cats, color schemes, and the word \"nope\" to Washington in his original special.",
      "similar": [
         416477,
         16290,
         23483,
         51828,
         62206,
         49013,
         67308,
         703,
         812,
         270946,
         86130,
         4543,
         435126,
         228165,
         449674,
         302688,
         174188,
         11072,
         9824,
         12614
      ],
      "original_title": "Demetri Martin: Live (At The Time)",
      "runtime": 61,
      "poster_path": "/zDIQD5gAgCTOWkhGZevn9S6Sk7h.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "New Wave Entertainment Television",
         "id": 21206,
         "origin_country": ""
      }],
      "release_date": "2015-08-14",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jay Karas"],
      "runtime": 61,
      "synopsis": null,
      "writers": ["Demetri Martin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4512714/",
      "coverLink": null,
      "actors": ["Demetri Martin"],
      "reviews": [
         "Demetri shares his latest set of low-key yet surreal observations on life and language, including: signs, pets, the origin of cheese, hot dogs, footballs, tandem skydiving, hamster-chucking, fitted sheets, elevator faux pas, prune juice, the aerodynamics of crackers, the quantification of educated guesswork, the tribulations of salads, the unique rejective qualities of volleyball, the sneakiness of color schemes, the general uncoolness of indoor sports, the management of fart jokes, the happiness of folks and nope, abracadabra versus please, business versus beeswax, parent/child resemblances in the alphabet, shoe store mirrors, expiration dates, and the proper temperature of regards. Saw the show in Madison, Wisconsin a couple weeks before the special was taped. It is very interesting to see a tour before the special, to see what jokes get thrown out, which get improved, and what else may happen. Practically nothing in this special was new from what we saw, but the best part is that some of the weakest bits were cut out. This makes the final product a couple minutes shorter, but just as funny (or funnier) the second time hearing it. My only complaint (and I may be in the minority here) is I wish the few \"adult\" jokes were removed. Not that they are not good jokes, but it seems out of sync with the brand of humor Demetri has made himself known for. He excels at quirky observations and grammar / language jabs. Venturing into sex-themed territory is risky. He also seems to have begun wading in racial humor, but for some reason I find that okay...",
         "I follow him since I first listened one of the his stand up, I think he has a very different kind of humor which is refreshing inside all of this new comedians just using same kind of humor, hard to find unique people now. the only think I am not sure about If I liked it or not is the dry humor thins, because I feel like some jokes would be better with some like kind of role playing but I guess not showing too much reaction also one of the his trademarks and it actually makes the joke better at some situations, but it also felt like he wasn't feeling comfortable on stage so much but I hope he would get more comfortable on stage. I don't say he should act different but I felt he was feeling too much under pressure which some jokes made to look weird rather than funny, but getting more comfortable is something comes with time I guess. I also liked his jokes a lot it is kinda reminds me Dylan Moran in the way he also uses different perepectives and creative materials to make jokes, so overall his jokes are creative and very interesting loved it.",
         "I have been a Demetri Martin fan since long before he got famous..and I have always loved his unique perspective and humorous takes on life..but in my opinion he phoned this one in. I was incredibly disappointed..he seemed bored and also acted like he wasn't even interested in the jokes he was telling. It was almost as if seemed mad at the crowd, in effect saying \"I'm demetri martin, you should laugh no matter what I say up here\"..it was almost an alter ego type of character similar to what andy Kaufman used to do only this act by Martin wasn't even funny. It was a real bummer as I had been looking forward to this show. Even the crowd reacted as if they weren't sure why he was there or what was doing. His attempt at being a little more edgy failed simply because he is just not good at it and it's not his style so those jokes all failed.. there was a portion where he played the guitar and rifled off some rapid fire one liners that were pretty good but that was it..again a let down compared to his other specials...of course I'll watch the next one as he is funny and my guess is this is a one time fail.."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["New Wave Entertainment Television"],
      "summaries": [
         "Demetri shares his latest set of low-key yet surreal observations on life and language, including: signs, pets, the origin of cheese, hot dogs, footballs, tandem skydiving, hamster-chucking, fitted sheets, elevator faux pas, prune juice, the aerodynamics of crackers, the quantification of educated guesswork, the tribulations of salads, the unique rejective qualities of volleyball, the sneakiness of color schemes, the general uncoolness of indoor sports, the management of fart jokes, the happiness of folks and nope, abracadabra versus please, business versus beeswax, parent/child resemblances in the alphabet, shoe store mirrors, expiration dates, and the proper temperature of regards.",
         "Demetri Martin performs his newest stand-up routine at The Lincoln Theater in Washington D.C."
      ],
      "budget": 0
   },
   "movielensId": 141251,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-08-14",
      "dvdReleaseDate": null,
      "directors": ["Jay Karas"],
      "runtime": 61,
      "movieId": 141251,
      "title": "Demetri Martin: Live (At The Time)",
      "mpaa": "NR",
      "actors": ["Demetri Martin"],
      "imdbMovieId": "4512714",
      "originalTitle": "Demetri Martin: Live (At The Time)",
      "genres": [""],
      "youtubeTrailerIds": ["d_TsBCCz1CY"],
      "plotSummary": "Demetri Martin brings his off-kilter take on acoustic guitar, hairless cats, color schemes, and the word \"nope\" to Washington in his original special.",
      "tmdbMovieId": 354544,
      "avgRating": 3.77381,
      "releaseYear": "2015",
      "numRatings": 42,
      "posterPath": "/zDIQD5gAgCTOWkhGZevn9S6Sk7h.jpg"
   }
}