{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0104495",
      "video": false,
      "title": "In the Arms of a Killer",
      "recommendations": [],
      "backdrop_path": "/dXpoOhiUoUkpkd3xGZOVeUUZAha.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Maria Quinn",
               "gender": 1,
               "credit_id": "52fe49c29251416c910b7e23",
               "name": "Jaclyn Smith",
               "profile_path": "/nuFRCPCaw9DYeMuEI9r96OkLm4y.jpg",
               "id": 55635,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Brian Venible",
               "gender": 2,
               "credit_id": "52fe49c29251416c910b7e27",
               "name": "Michael Nouri",
               "profile_path": "/lAPEwuE9Cg6xSgcgO2M2pFJ3ul5.jpg",
               "id": 8699,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Venible",
               "gender": 1,
               "credit_id": "52fe49c29251416c910b7e2b",
               "name": "Nina Foch",
               "profile_path": "/jd5qWtnZdEvfwuo57CpJVzazYc0.jpg",
               "id": 13026,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Det. Vincent Cusack",
               "gender": 2,
               "credit_id": "52fe49c29251416c910b7e2f",
               "name": "John Spencer",
               "profile_path": "/9sU5FEzlf921n6NxHmXgJB3994T.jpg",
               "id": 34691,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5371d797c3a3684358000ba1",
               "name": "Robert L. Collins",
               "profile_path": null,
               "id": 937879,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5371dc8fc3a3684349000be6",
               "name": "Robert L. Collins",
               "profile_path": null,
               "id": 937879,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.105227,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87388,
      "vote_count": 2,
      "budget": 0,
      "overview": "A young detective falls in love with a witness in a murder case and suddenly becomes a suspect herself.",
      "similar": [],
      "original_title": "In the Arms of a Killer",
      "runtime": 93,
      "poster_path": "/xhrFJS7WXHcHjIU1bkwF6ILyJTM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1992-01-05",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert L. Collins"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Robert L. Collins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104495/",
      "coverLink": null,
      "actors": [
         "Jaclyn Smith",
         "John Spencer",
         "Nina Foch"
      ],
      "reviews": [
         "In the spirit of fairness, I never saw this movie until 2006, so I am not sure that I saw an uncut version. I would like to believe that late night TV edited the movie beyond recognition. That would give us an excuse for how bad it was. I was a fan of the late John Spencer. I was a nut for the West Wing and thought that his work in that program and LA Law was outstanding. I was a regular viewer of Charlie's Angels. Jaclyn Smith's contribution to that program was steady and respectable. I was looking for better work from both of these actors than this movie offered. Admittedly, the dialogue and plot line were never going to produce Emmy nominations but this was slow and disappointing. Both actors' performances were halting and flat. This let me know that Ms. Smith is not multi-dimensional as an actor. But I have seen much better from Mr. Spencer. In my opinion, Michael Nouri gave the best performance as the doctor. Too bad.",
         "**SPOILERS** Overly complicated Mahattan murder mystery that has you wondering by the time it's over if you yourself need to see a shrink to help you get back to live a normal and peaceful life. After losing your sense of reality by trying to not only watch but also understand it. The movie \"In the Arms of a Killer\" starts with a shooting at the Queens Liberty Hotel and suddenly it's a year later and we have Det. Vinny Cusack, John Spencer, the self-proclaimed New York's \"Top Cop\" with his new partner Det. Maria Quinn, Jaclyn Smith, at this murder site, a high class party, with a number of very prominent New Yorkers as potential witnesses. You try to figure out what's happening as both Det.'s Cusack & Quinn go upstairs and find this body of a local drug dealer, Carlos Gallanter, laid out on the bed stiff as a board from an 100% heroin overdose. Asking questions from the people at the party downstairs the two cops later find out that two of the party goers Chrissie O'Hara & Dr. Brain Venible, Linda Dona & Mchael Nouri, may have had something to do with Gallanter's murder. Chrissie a long time drug user with Gallanter being her main supplier. With Dr. Venible who was treating Chrissie for drug dependence and possibly having an affair with her as well. It later turns out that Chrissie is also murdered with her estranged husband Lysander O'Hara, Harry Kingi, being the prime suspect. Tracked down at this mid-town hotel O'Hara cornered with no place to go is gunned down by Det. Cusack who now feels that the murders of both Gallanter and Chrissie O'Hara is solved. Gallanter being murdered by O'Hara for getting his old lady, Chrissie, hooked back onto drugs as well as having testified against him. Then killing her when she was about to be arrested to prevent Chrissie from going to the police to implicate him for the Gallanter killing. This together with the earlier murder in the film at the Liberty Hotel, so she can get a lighter sentence. Maria doesn't at all believe that the case is closed and that her partner Det. Cusack is a bit too sure of himself in solving it. Maria goes on her own by investigating the handsome and highly cultured Dr. Venible whom she's also at the same time having an affair with. Finding that Chrissie was a patient of Dr. Venible has Maria go through his files and even his hairbrush to get evidence that he was at Chrissie's apartment the evening that she was murdered. Not really knowing what kind of mental condition Dr. Venible was in Maria's unauthorized investigation of him leads Dr. Venible to have a violent schizophrenic seizure leaving the, what at first looked like, normal acting Dr. Venible in a grotesque fetal position moping and sobbing uncontrollably. Later the poor and helpless individual is railroaded by the cops and district attorney into implicating himself in both Chrissie and Gallanter's murders. This leads him to attempt to kill himself, by jumping down a stairway, right in the courthouse!The film get's more confusing with every rock that Maria overturns in this very baffling murder case until she finds the real reason to why both Gallanter & Chrissie O'Hara where murdered. Which leads straight back to the police who were investigating the case! \"In the Arms of a Killer\" is one of those movies that's so confusing and complicated that you have to watch it again just to figure out whats happening on the screen. The movie makes little or no sense at all and you can see it in the action's of both it's major stars Jaclyn Smith & John Spencer who look about as confused in what their doing as the those of us in the audience are in both watching and at the same time trying to understand them.",
         "Campy, enjoyably bad made-for-TV thriller about Jaclyn Smith of \"Charlie's Angels\" fame as a rookie detective investigating the murder of a drug lord who'd been given an overdose of heroine. John Spencer of \"West Wing\" plays the veteran lead detective on the case and Michael Nouri plays a cocky surgeon who's Smith's new boyfriend and also the primary suspect. The plot has plenty of incredulous twists and turns, and in the most ironically hilarious scene (SPOILER ALERT) Smith finds Nouri in his apartment after getting a bad dose and acting like a non-verbal child in the fetal position under a desk. But on a positive note for this film, Lee Holdridge provided the film a very respectable score which I'd actually like to own. Only watch this one for ironic so-bad-it's-good camp nostalgia.",
         "Sometimes you waste an hour and a half of your life watching the wrong movie. This movie was so bad I cannot tell you how achingly boring it was to watch. In fact I switched channel before the end. The plot was confusing and the characters were all so bland you didn't care if they lived or died. In fact I would say the most interesting thing was Jaclyn Smith's hair which had more life than any of the actors. I didn't really want to waste any more of my time telling you how bad this movie is but I have to write a minimum of ten lines. Under no circumstances should you waste your life or electricity watching this. Period."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "MGM Television",
         "Monarch Pictures Corporation",
         "RLC Productions"
      ],
      "summaries": ["A rookie detective's investigation of a particularly brutal murder takes a personal turn for her when her lover turns out to be their main suspect. In HD."],
      "budget": 0
   },
   "movielensId": 141288,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-01-05",
      "dvdReleaseDate": null,
      "directors": ["Robert L. Collins"],
      "runtime": 93,
      "movieId": 141288,
      "title": "In the Arms of a Killer",
      "mpaa": "",
      "actors": [
         "Jaclyn Smith",
         "Michael Nouri",
         "Nina Foch",
         "John Spencer"
      ],
      "imdbMovieId": "0104495",
      "originalTitle": "In the Arms of a Killer",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young detective falls in love with a witness in a murder case and suddenly becomes a suspect herself.",
      "tmdbMovieId": 87388,
      "avgRating": 0.5,
      "releaseYear": "1992",
      "numRatings": 1,
      "posterPath": "/xhrFJS7WXHcHjIU1bkwF6ILyJTM.jpg"
   }
}