{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "anti hero",
            "id": 2095
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "tokusatsu",
            "id": 12667
         },
         {
            "name": "pervert",
            "id": 33656
         }
      ],
      "imdb_id": "tt2708764",
      "video": false,
      "title": "HK: Forbidden Super Hero",
      "recommendations": [
         403310,
         88642,
         83227,
         359720,
         254538,
         301633,
         85780,
         41401,
         81792,
         26886,
         44850,
         140554
      ],
      "backdrop_path": "/p6l3LczH2R95Y1OjdPhWYZmW58w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Kyosuke Shikijo / Hentai Kamen",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce46d",
               "name": "Ryohei Suzuki",
               "profile_path": "/7VNCDtAC8dtcuzORlIxwSMq60KF.jpg",
               "id": 1693,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Aiko Himeno",
               "gender": 1,
               "credit_id": "52fe4cf1c3a368484e1ce469",
               "name": "Fumika Shimizu",
               "profile_path": "/lbgmAGkdH3EAefSDcbBBmpFD1J4.jpg",
               "id": 1149337,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Tamao Oogane",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce459",
               "name": "Tsuyoshi Muro",
               "profile_path": "/p1Tr6ShS22JECFJAcCmMZuDxnf8.jpg",
               "id": 124963,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Teacher Towatari",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce475",
               "name": "Ken Yasuda",
               "profile_path": "/yu4smoWqTnw6n37eaqzBAZWxSII.jpg",
               "id": 1039220,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Maki Shikijo",
               "gender": 1,
               "credit_id": "52fe4cf1c3a368484e1ce455",
               "name": "Nana Katase",
               "profile_path": "/1QtpvcxyEH5VXaqhfWj3B6FaY3a.jpg",
               "id": 1044524,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4cf1c3a368484e1ce44d",
               "name": "Shunsuke Daitô",
               "profile_path": "/om7jo8aX2QIBVcOSe9SnEWU3lSD.jpg",
               "id": 224411,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce451",
               "name": "Narushi Ikeda",
               "profile_path": "/rMjLVCZPyyNUSvL0RmkFJUvgBds.jpg",
               "id": 1204781,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce45d",
               "name": "Shun Oguri",
               "profile_path": "/nQC5diyl25qS8qLsdMxTzafjnHn.jpg",
               "id": 46364,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4cf1c3a368484e1ce461",
               "name": "Yoshinori Okada",
               "profile_path": "/5E5iIeDF8kqcfK2TMYA5649sL64.jpg",
               "id": 96563,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce465",
               "name": "Jiro Sato",
               "profile_path": "/jxr4ecDUsaxJrlMdHWbVQX0ioX1.jpg",
               "id": 133699,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4cf1c3a368484e1ce471",
               "name": "Takashi Tsukamoto",
               "profile_path": "/h8AL47RXoqrjwGn8u1mUW7w010R.jpg",
               "id": 121796,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "female student",
               "gender": 0,
               "credit_id": "58319eb1c3a3685bb00231af",
               "name": "Momona",
               "profile_path": "/sDIYmxmT9pzQIZitKKkdQDZ2mw2.jpg",
               "id": 1711442,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce437",
               "name": "Yuichi Fukuda",
               "profile_path": "/761lzOtQCZWE5e0x9iAgwYFVWyP.jpg",
               "id": 133704,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cf1c3a368484e1ce43d",
               "name": "Keishû Andô",
               "profile_path": null,
               "id": 1186702,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce443",
               "name": "Yuichi Fukuda",
               "profile_path": "/761lzOtQCZWE5e0x9iAgwYFVWyP.jpg",
               "id": 133704,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cf1c3a368484e1ce449",
               "name": "Shun Oguri",
               "profile_path": "/nQC5diyl25qS8qLsdMxTzafjnHn.jpg",
               "id": 46364,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.987833,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 204342,
      "vote_count": 41,
      "budget": 0,
      "overview": "High school student Kyosuke Shikijo is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Hentai Kamen,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno. With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher.",
      "similar": [
         272,
         297762,
         1924,
         1452,
         49521,
         155,
         141052,
         209112,
         8536,
         30061,
         382322,
         251519,
         14011,
         65291,
         9531,
         40662,
         299537,
         379291,
         13640,
         10138
      ],
      "original_title": "HK/変態仮面",
      "runtime": 105,
      "poster_path": "/d7OC5tXffxMFvaXbWUs3zqgLCPU.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "L'espace Vision",
            "id": 17227,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "T-Joy",
            "id": 17228,
            "origin_country": ""
         }
      ],
      "release_date": "2013-04-13",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Hentai Kamen Collection",
         "id": 426761,
         "poster_path": "/rbc0HDOrbuTy8EVbKe6TVVucsYd.jpg"
      },
      "tagline": "Panty Bless You.",
      "adult": false,
      "homepage": "http://hk-movie.jp/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yûichi Fukuda"],
      "runtime": 90,
      "synopsis": "The son of a dominatrix and a detective, Kyosuke Shikijo (Ryohei Suzuki) is a wimp with a soft spot for justice. He joins the martial arts club to become tougher. The new girl in his class, Aiko Himeno (Fumika Shimizu), is also the new manager of the club. Kyosuke falls for Aiko instantly. When Aiko is stuck in a hostage situation, Kyosuke sneaks into the bank and tries to stop the robbers by wearing a mask and pretending to be one of them. But instead of a mask, he accidentally puts a pair of women's panties on his face with turns him into the superhero Hentai Kamen (translated several ways, but I prefer Masked Pervert). He thwarts criminals and wins the admiration of the city and Aiko. It is then that a group of thugs from a nearby school try to take over. Their leader, Ogane Tamao (Tsuyoshi Muro), believes that there is treasure under the campus and has bought the school grounds. But after a mortifying defeat at the hands of Hentai Kamen, the thugs send in several assassins to take care of Hentai Kamen, including a school code of conduct enforcing robot (Jiro Sato). Their last assassin is Bizarro Hentai Kamen (Ken Yasuda) who poses as the new school teacher. He wreaks havoc on the city and ruins Hentai Kamen's reputation. After Kyosuke discovers Bizarro HK's perversity surpasses his own, he begins to doubt his powers. Tamao is able to take over the martial arts club where he captures Kyosuke and tries to shoot him. Kyosuke gains a second wind thinking about his late father and transforms once again. He defeats Tamao and the final battle between Hentai Kamen and Bizarro HK ensues. Hentai Kamen defeats his Bizarro self but his mask is too damaged to hide his face, so Aiko finds out that he is Hentai Kamen. Kyosuke and Aiko are about to have a romantic moment when Tamao bursts out of the school in a giant robot. Kyosuke does not have his panties with him and asks to borrow Aiko's who reluctantly lets him. Hentai Kamen kicks the robot in the crotch and makes it explode.",
      "writers": [
         "Keishû Andô",
         "Yûichi Fukuda"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt2708764/",
      "coverLink": null,
      "actors": [
         "Kentez Asaka",
         "Shôta Chiyo",
         "Shunsuke Daitô"
      ],
      "reviews": [
         "Chances are if you are a fan of the manga that you would already be waiting in line to watch this live-action adaptation, which also of course means that you know what you are in for. But for the uninitiated, consider this fair warning that 'HK Forbidden Super Hero' isn't your typical superhero movie; rather, the 'HK' in the title stands for 'Hentai Kamen', literally translated as 'masked pervert', which is an apt description for our titular superhero, whose powers are derived from the smell of a pair of used panties pulled over his face. That's not all - no thanks to the source of his superpowers, most of his killer moves revolve around stuffing his crotch into the face of his enemies, them \"golden balls\" shielded from view only by skimpy white Speedos. Besides the pair of panties, some facial makeup and the Speedos, our hero wears nothing else while in the line of duty - but really, we're quite sure when the ladies in the audience get sight of his ripped body that they will wholeheartedly agree that he is better off with as little cloth as possible. You should know better than to take such a superhero seriously, so there's hardly any point criticising how shallow the premise is; rather, if you're going to watch a movie about a ordinary person who transforms himself into a superhero by his perversion, then you should jolly well know what you are in for. Indeed, the only way you are going to enjoy this parody if you like is if you are prepared in the first instance to accept it on its own terms - and for a start, that means being prepared for countless in-your-face crotch shots that are designed precisely to elicit a reaction out of you, no matter delight or disgust. To match his signature over-the-top move, there are also a bunch of equally caricatured baddies - including one that calls himself Very Serious Mask, another that goes by the nickname Cool Guy, another with the moniker Gay Mask and yet another with an equally baffling name of Skinny Macho Mask. Still, all serve little purpose than throwaway comic relief before Hentai Kamen meets his match in an impersonator, who proves to be an even bigger pervert than he is and is most importantly not ashamed about it. Yes, despite his abilities, our hero is really a sweet-natured and kind- hearted high-school student called Kyosuke Shikijo; in fact, he discovers his powers inadvertently while rescuing the object of his affection, Aiko Himeno (Fumika Shimizu). Afraid of what Aiko would think of him if he discovers his perversion, Kyosuke keeps his identity a secret from her, despite turning up time and time again to rescue her from the brink of danger. It is in his ultimate battle with his evil twin that Kyosuke will overcome his own insecurities and be enlightened about the true nature of his superpowers. That's some self-realisation for you, no matter how unlikely such a theme might seem in a movie like this. Nonetheless, besides giving manga fans some twisted fun, director Yuichi Fukuda wants to tell both an unusual high-school love story as well as an even more bizarre coming- of-age tale - and for what it is worth, we can say that it is fortunate that his movie is much more than just about face-fulls of crotches, sexual poses and BDSM techniques. Fukuda also has his cast to thank for gamely stepping up to the challenge of such an outlandish movie. Shimizu is suitably sweet and demure, while Ken Yamada is befittingly off-putting as Hentai Kamen's antagonist. But truly amazing here is Suzuki Ryohei, who plays our titular superhero; more than just his physique, what impresses is how he manages to switch between his shy awkward persona and that of his decidedly showy superhero alter-ego - panties, crotch-thrusting and all. Still, despite Ryohei's best efforts, we're sure this will be a movie you either love or hate. It's weird to say the least, the humour mostly in-your-face (pardon the pun) and largely vulgar. Yet there is something undeniably engrossing about it, its mixture of teenage romance and disturbing perversion within the superhero genre making it a captivating watch. Don't say we didn't warn you about what you should be prepared for, so don't get your panties in a wad when you find them pulled over the face of our superhero.",
         "Actually, this entire movie can be summarized by three words: only in Japan! With a mother who is a bondage mistress and a father who was a cop, the future holds something very Unique for Young Kyosuke Shikijo. And this plays out well in a truly unique and bizarre storyline. By putting women's panties over his head, Kyosuke can become The Perverted Mask - the one and only superhero to reach such levels of weirdness ever. Based on a Manga, \"HK: Forbidden Supherhero\" (aka. \"HK: Hentai Kamen\") is somewhat of an acquired taste. And if you enjoy this kind of oddity, then the movie is definitely well-worth watching and you will more than often be laughing hard or blown away by the sheer weirdness and absurdity of it all. The movie works well on many levels and in many aspects. And the people who star in this bizarre movie were all doing fantastic jobs and seemed to be having heaps of fun making the movie. Wacky costumes, over-the-top sexy poses, odd humor, and lots of entertainment, \"HK: Forbidden Superhero\" is a live action Manga not to be missed. It is great fun from start to end.",
         "It's not unheard of for American superheroes to wear their underwear on the outside, but Japanese superhero The Masked Pervert goes several steps further by wearing young womens' silky scanties—over his face!!! Whenever schoolboy Kyosuke Shikijo (Ryôhei Suzuki) pulls a pair of used knickers onto his head, crotch positioned over the nose, the sense of perversion he experiences transforms him into his powerful alter ego, a buff crime-fighting hero whose revealing costume (womens' panties aside) consists of a pair of white briefs (pulled up over his shoulders to apply pressure to his crotch!), fishnet stockings, and sneakers. As with any self-respecting superhero, Kyosuke suffers from internal conflict, struggling with the perverted nature of his alter ego while wishing that it was he, not The Masked Pervert, that his pretty new classmate Aiko Himeno (Fumika Shimizu) had the hots for. His life becomes even more complicated when tough new student Ogane Tamao and his gang attempt to take over the school, hiring a series of assassins to deal with The Masked Pervert after he gets in their way. These include such crazy characters as Goody Two Shoes Man (a stickler for the rules), Manly Man (who is anything but), Slender But Fit Man (not much of a threat), Pleasant Man (genial but deadly) and Teacher Towatari (Ken Yasuda), who proves to be a far bigger pervert than The Masked Pervert. Based on the manga Kyūkyoku!! Hentai Kamen, HK: Forbidden Super Hero is a hilarious exercise in outrageousness that, despite its vulgar nature, is simply too silly to take offence at. The story explores standard superhero themes such as self doubt and being true to oneself, but in the end, it's all about the over-the-top action, our hero striking a variety of hilarious poses before using unforgettable special moves such as Golden Power Bomb, Flying Kick Bondage (which involves the Japanese art of shibari), the Spinning Fire of Death, and my favourite, the Pervert Dance (a sure-fire hit on the dance floor), most of which involve The Masked Pervert pushing his package into the face of his enemy.",
         "I marked the \"spoiler-allert\" button as I give some general information about the character (not much more than the storyline) but I will not tell the story. This an extremely bizarre parody of superhero movies (even the opening credits follow a similar style of the one used in DC and Marvel films). While grotesque and a bit silly, with some exaggerated overacting throughout the film (specially when the hero's mother and the villains appear) that annoys a bit, it works and is quite enjoyable and funny. Hentai Kamen, or the Masked Pervert, is probably the weirdest superhero that has ever existed (and possibly could not have been created by a non Japanese). A son of a sadist prostitute and a masochist policeman, he gets his superpowers from his perversion, activated by a combination of his genetics (his parent's pervert genes, particularly his mother's; his father's genes also gave him his duty to fight crime and injustice) and the smell of used panties on his face. His costume is the oddest possible: almost naked, with a panty as a mask over a Spiderman-like mask on his face, a pantyhose dressing his legs and a stretched panty hanged crossed on his shoulders putting him a G-string thong on (yes, expect many close-ups on his butt... and if you have watched \"Borat\" you may understand my explanation). He has many superpowers, like superspeed movements (much faster than bullets), super ability with a lasso, supernatural martial arts technique, and incredible quasi-flight jumps (somewhat similar to Spiderman). Though, what calls attention the most are his (as funny as repulsive) special attacks: variations of his crotch (\"golden balls\") \"in yo face\" blows. He loses powers if dressed, but he also gets stronger if spanked (remember his sadomasochist genes!). Kyosuke Shikijoh, the superhero's alter ego, is the extreme opposite: extremely shy, sexually repressed, conservative, always feeling guilty about everything. Supervillains are extremely campy and the main character's love story is completely cheesy. Though, this is the kind of film that convinces you about getting into its own terms; therefore, some traits that could be seen as problems are tolerated and sometimes (not always, though) even enjoyed. The last, but nor least, to resume: the final battle is veeeery Japanese! The end is not so original, but nice.",
         "Just watched the movie for the first time~!! I have to say -even after reading the entire manga series- that HK continues to be both a surprise and delight~!! XD ♥♥♥ Overall, it was a great movie, really 'laugh out loud' and just epic-ally done, even the actors seemed to enjoy it~!! I caught quite a few slipped smiles~!! :D The movie could have been done a little better, and the story-line could have been a little more thought out, but I thought it was a good movie~!! My only problem was the fact that a few key characters were missing, and that it never showed his mom's ass~ That was one of my favorite parts of the Manga~!! :P ♥♥♥ If I can stand to look at a man's bare ass throughout an entire movie, why couldn't they add in that one heart-shaped touch?!! Completely recommended, You~ HAVE to watch this movie~!! XD ♥♥♥",
         "I like Japanese movies. They tend to give everyone what he wants, be it movies for girls, for boys, for gays, for SM-addicts, no matter what your preferences or personal perversions are, the are able to make a movie about it, without forcing you see something in all of them (current gay/lesbian trend) or the opposite (ergo trying to blacklist some of them). They simply create something for target audience and don't try to change the viewer. This movie was not for me, despite all of my hopes. The main character has problem accepting what he is, even though he calls himself that way... I found him annoying (but I really did like his alter ego:)). The acting was stiff, there were some logical gaps... I will try the manga, or something like Golden boy to get rid of the aftertaste of this movie. But I admit, maybe my perversions are just not the right ones:)."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Toei Video Company",
         "Showgate",
         "Nippon Shuppan Hanbai (Nippan) K.K."
      ],
      "summaries": [
         "High school student Kyosuke Shikijo (Ryohei Suzuki) is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Pervert Mask,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno's (Fumika Shimizu). With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher (Ken Yasuda).",
         "Kyosuke is a high school student who becomes a super hero when he wears women's panties on his face. When a group of thugs threaten to take over the school, Kyosuke must don the panties to fight the thugs and their assassins and win the heart of the new girl, Aiko. He must also learn about being a true pervert from his Bizarro self.",
         "A high school boy receives mysterious superpowers from aliens."
      ],
      "budget": 0
   },
   "movielensId": 141495,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2013-04-13",
      "dvdReleaseDate": null,
      "directors": ["Yuichi Fukuda"],
      "runtime": 105,
      "movieId": 141495,
      "title": "HK: Forbidden Super Hero",
      "mpaa": null,
      "actors": [
         "Ryohei Suzuki",
         "Fumika Shimizu",
         "Tsuyoshi Muro",
         "Ken Yasuda",
         "Nana Katase",
         "Shunsuke Daitô",
         "Narushi Ikeda",
         "Shun Oguri",
         "Yoshinori Okada",
         "Jiro Sato",
         "Takashi Tsukamoto",
         "Momona"
      ],
      "imdbMovieId": "2708764",
      "originalTitle": "HK/変態仮面",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["c0vF0CBKKEc"],
      "plotSummary": "High school student Kyosuke Shikijo is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Hentai Kamen,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno. With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher.",
      "tmdbMovieId": 204342,
      "avgRating": 3.09091,
      "releaseYear": "2013",
      "numRatings": 11,
      "posterPath": "/d7OC5tXffxMFvaXbWUs3zqgLCPU.jpg"
   }
}