{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "inuit",
         "id": 3355
      }],
      "imdb_id": "tt0023990",
      "video": false,
      "title": "Eskimo",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Constable Balk",
               "gender": 0,
               "credit_id": "52fe4b3ac3a36847f81f9041",
               "name": "Edgar Dearing",
               "profile_path": "/aHjtlKqJc3aa555TBO2Ksj1F11w.jpg",
               "id": 1240252,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Captain",
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f9029",
               "name": "Peter Freuchen",
               "profile_path": null,
               "id": 1057614,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Captain's Mate",
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f902d",
               "name": "Edward Hearn",
               "profile_path": "/bI6SabwolYEYxSaprgjfRdSF2iJ.jpg",
               "id": 975306,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Iva",
               "gender": 1,
               "credit_id": "52fe4b3ac3a36847f81f9031",
               "name": "Lotus Long",
               "profile_path": "/xh3vjsO71YMNQ4aHU9Xdlz2lHxQ.jpg",
               "id": 89949,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mala, aka Kripik",
               "gender": 0,
               "credit_id": "52fe4b3ac3a36847f81f9035",
               "name": "Mala",
               "profile_path": "/a8PdAoBeBCPVcvcWj4LuvCtASZk.jpg",
               "id": 117033,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sergeant Hunt",
               "gender": 0,
               "credit_id": "52fe4b3ac3a36847f81f9039",
               "name": "Joe Sawyer",
               "profile_path": "/7waP4U3fOYpqUr8jJd4qAvgWWqK.jpg",
               "id": 3341,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Inspector White",
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f903d",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f9019",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f901f",
               "name": "John Lee Mahin",
               "profile_path": null,
               "id": 29618,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b3ac3a36847f81f9025",
               "name": "Peter Freuchen",
               "profile_path": null,
               "id": 1057614,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5693d257c3a3687b740000f1",
               "name": "Hunt Stromberg",
               "profile_path": null,
               "id": 109853,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5693d2699251415c23000158",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5693d2cec3a3687b5e00010a",
               "name": "Conrad A. Nervig",
               "profile_path": null,
               "id": 42065,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "575b6a66925141215f0009c1",
               "name": "Leonard Smith",
               "profile_path": null,
               "id": 14864,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575b6a6dc3a3684a82000c9e",
               "name": "Josiah Roberts",
               "profile_path": null,
               "id": 1562094,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575b6a75c3a3684a70000d37",
               "name": "George Gordon Nogle",
               "profile_path": null,
               "id": 1559944,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575b6a7c9251414a7c000097",
               "name": "Clyde De Vinna",
               "profile_path": "/xt18HYJSZ07joPYIcD9eVzs4zR3.jpg",
               "id": 418836,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a486233c3a368193800a4b2",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.02403,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 113638,
      "vote_count": 0,
      "budget": 0,
      "overview": "The happy life of an Eskimo is disastrously changed when he mingles with an unscrupulous white trader.",
      "similar": [
         94393,
         2268,
         116745,
         10009,
         173,
         9624,
         276905,
         669,
         9311,
         36344,
         396920,
         10785,
         24749,
         11940,
         59883,
         17657,
         84185,
         4832,
         14280,
         11516
      ],
      "original_title": "Eskimo",
      "runtime": 117,
      "poster_path": "/nUZe68Jt2LrniXd0NHIlrZdYjSq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1933-11-14",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["W.S. Van Dyke"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "John Lee Mahin",
         "Peter Freuchen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023990/",
      "coverLink": null,
      "actors": [
         "Edgar Dearing",
         "Peter Freuchen",
         "Edward Hearn"
      ],
      "reviews": [
         "The arrival of White Men in Arctic Canada challenges the freedom of a fearless ESKIMO hunter. W. S. Van Dyke, MGM's peripatetic director, was responsible for this fascinating look at life in the Arctic among the Inuit. His production was on location filming from April 1932 until November 1933 (although some annoying rear projection effects show that some of the shooting took place back at the Studio). While considered a documentary at the time, we would likely term it a 'docudrama' as it is scripted with an intriguing plot & storyline. The film shows the daily life of the Eskimo, both Winter & Summer, and in fact starts in the warmer time of the year without any snow or ice in sight. The constant striving for food is depicted, and the viewer gets to watch the exciting hunts for walrus, polar bear, whale & caribou. The native language is used throughout, with the use of title cards; the only English is spoken by the fishermen & Mounties encountered by the Eskimo. In fact, it is the arrival of White Men, both good & bad, and the change they make on Eskimo society, which is a major element in the narrative. This Pre-Code film deals in a refreshingly frank manner with the Eskimo moral code, particularly with their practice of wife-sharing, which was an important and completely innocent part of their culture. In fact, the entire film can be appreciated as a valuable look at a way of life which was rapidly disappearing even in the early 1930's. None of the cast receives screen credit, which is a shame as there are some notable performances. Foremost among them is that of Ray Wise, playing the leading role of Mala the Eskimo. Wise (1906-1952) was an Alaskan Native of Inuit ancestry and is absolutely splendid and perfectly believable in what was a very demanding part. As handsome as any Hollywood star, he would continue acting, using the name of Ray Mala, in a sporadic film career, often in tiny unbilled roles. Lovely Japanese-Hawaiian actress Lotus Long plays Mala's loyal second wife; the names of the fine actresses playing his other two wives are now obscure. Director Woody Van Dyke steps in front of the cameras as a strict North West Mounted Police inspector. The two decent-hearted Mounties who must deliver Mala to Canadian justice are played by Joe Sawyer & Edgar Dearing, both longtime movie character actors. Danish author Peter Freuchen, upon whose books the film was based, has a short vivid role of an evil wooden-legged sea captain who unwisely rouses Mala's icy wrath.",
         "I was impressed by the beautiful photography in this film, which was shot on location in Alaska. Although technically a melodrama, we see lots of activities Eskimos are involved in, such as hunting, dancing, building igloos, etc. And their customs, such as offering their wives to visitors, are routinely in the story. The hunting sequences were sometimes from stock footage, as it was easy to recognize some rear projection scenes of animals, but even these were fascinating. Spear fishing for salmon, hunting for walrus, caribou and even a polar bear and a whale made it seem like a documentary at times. There was no cast listing, which reinforced the documentary flavor. The film-makers tried to make it seem very authentic, with the natives speaking only in an Eskimo language that was either translated by someone on screen or by intertitles. The introduction stated that except for the white traders and the Royal Mounted Canadian Police, there were no actors in the film, but this was not strictly true. The two leading characters, played by Mala and Lotus Long, were Eskimos by birth, but were professional actors with credits for earlier films and you could see sometimes they had makeup on. But they were excellent in their roles and they went on to have Hollywood careers. All in all, the film is definitely worth a look.",
         "Eskimo is a serious movie about the cultural chasm between an indigenous population and the encroaching white man. Although filmed in a documentary style seemingly with non-professionals, Eskimo is a skilled production that contains a believable story the audience will want to see through to the final shot. The native Eskimo simply has different beliefs and behaviors about women and life than do the whalers that darken his landscape. When an Eskimo man loses his mate, it is natural that other men share their women with their friend. It is also usual for their women to want to take the place of the missing spouse. All of this seems natural in the context of the desolate foreboding Arctic setting. The trusting Eskimo falls prey to unscrupulous white whalers (with heavy European accents) that do not view these natives as their equals. Deceit, drunken orgies, rape, and death occur after the Eskimo men depart for work on the icy cold seas. Eventually the lead Eskimo (Mala) realizes that he has been duped and he takes his revenge. The audience would have cheered in the 1930's theaters. Enter the Royal Canadian Mounted Police and the moral dilemma of whether to bring back Mala for trial. The Mounties are played as feeling policemen that know this is not a cut and dry case. Will the Mounties get their man? Is it fair to hold Mala to a code of behavior outside of his traditional society? Is there a way out that does not punish Mala? Is it inevitable that the white man's law must prevail? Is there no hope for innocence? This is not a great movie, but one that you will enjoy for the depth of the issue addressed in a very different setting. I suspect that the filming of the sequences with animals was done before today's disclaimer that none were injured in the making of the film -- so beware of the raw nature sequences. Highly recommended.",
         "Here I thought \"Nanook of the north\" was the last word in archaic semi-doc 'eskimo' movies. How wrong! As an avid sea-kayaker I stayed up till 330am to watch this hoping to get a glimpse of some hand-made 'skin-boats'. The movie did not let me down. Any student of kayak/umiak construction should have a look-see here. (Note to fellow SKers: they appear to be using Norton Sound kayaks with single blade paddles). But the film went way beyond this admittedly narrow interest. Even though there were as others have noted some little back-shot-fakey-bits the movie has so much heart they are just a minor annoyance. It was (from this very amateur anthropologist's viewpoint) probably the perfect time to make this movie. Early thirties: the 'talkies' are so new that they (including Louie B. Mayer!) actually let the Inuit speak in their own tongue. And there is so much that was still, despite the infused melodrama, authentic. They are really whacking that polar bear, that whale and those caribou. A fifties version of this film would have been so cheesy with 'stars', Technicolor, etc. to gum it up. The seventies version? Don't even. A very good companion piece to this excellent movie is \"White shadows in the south seas\" (1928) Geograpically the mirror image to \"Eskimo\" it also deals with the relentless and profound disruption of Western culture/technology on an unsuspecting people.",
         "There are two kinds of white in this unusual film -- snow (lots of it) and men (not many but packing a punch). The frigid landscape -- I'll assume this early talkie was filmed on location -- provides a stunning backdrop to a stark tale about the corruption of humanity. On the one hand we have a community of extremely hardy Inuits in Arctic Canada, people who hunt or forge by hand everything they require, wasting nothing. On the other we have the technologically advanced white man who lacks the savvy of the native but makes up for it through force and stealth. Starring is Ray Mala, and he has created an unforgettable persona. Mala is a master hunter of anything that moves on land or sea -- be it whale, walrus, or caribou. He steadfastly lives by a moral code in which courtesy, integrity, and gratitude are revered. Lies and deceit aren't practiced among the igloo dwellers because the consequences are sure and swift. \"One's word is false,\" he tells a Mountie who handcuffs him after promising not to. \"A weak man's word makes a weak man.\" (Truer words were never spoken, and I wish we heard them more these days...) At two hours, \"Eskimo\" seems long, due in part to its heavily anthropological approach. Based on a book by Danish writer Peter Freuchen, who also plays the role of a predatory white sea captain, the story's intensity picks up considerably once Mala meets his second wife, Iva (Lotus Long), and is arrested for a crime he never denies. It's always interesting to research some of the back story of a film like this. Though the movie was touted as having employed real native people, Wikipedia relates that the handsome Mala went on to appear in some 25 films and died in Hollywood! Ms. Long was born in Atlantic City -- who'd'a thunk it? -- and, thanks to her own exotic good looks, also enjoyed a successful show-business career. No gruesome \"Nanook of the North\" epilogues here, thankfully!",
         "Last night I screened a movie ESKIMO (1933 MGM) starring Ray Mala and Lotus Long, directed by W. S. Van Dyke, a remarkable classic movie often rightly compared with the famous NANOOK OF THE NORTH (1923) documentary by Robert Flaherty. ESKIMO (1933 MGM) was actually shot in Alaska, and is a fiction story set in the frozen waste areas of the Canadian Arctic area (though the movie was actually shot in Alaska, it is reported). ESKIMO (1933 MGM) is one of the most remarkable and interesting, compelling movies I have ever seen, and movie history is one of my major avocations....I have seen many classic movies over the decades and have an enormous personal collection of movies on video. Even so, ESKIMO (1933) ranks for me among the best of the best, an important (Academy Award Winning...Best Edited Movie...first to get that award ever) movie by any measure. I'm a movie actor, currently, (SAG-AFTRA member) and recently acted in the GAME CHANGE (2012 HBO) movie in scenes which depicted Alaska's current political celebrity of fame, Sarah Palin (I was in scenes where movie star actress Julianne Moore portrayed Mrs. Palin). ESKIMO (1933 MGM) is one of Hollywood's great lost movies, and a tribute to the incredible movie director work of W. S. Van Dyke. -------------- Written by Tex (David) Allen, Email DavidAllenUSA@Yahoo.Com, May 2012 ....Tex Allen's email address is TexAllen@Rocketmail.Com. See Tes Allen Movie Credits, Biography, and 2012 photos at WWW.IMDb.Me/TexAllen. See other Tex Allen written movie reviews....almost 100 titles.... at: \"http://imdb.com/user/ur15279309/comments\"",
         "Peter Freuchen (captain of a trading ship), Mala (native youth), W. S. Van Dyke (\"mountie\" — inspector), Joe Sawyer (Sergeant Hunt), Edgar Dearing (Constable Balk), Lotus Long (Iva), and a native cast of Eskimos. Director: W. S. VAN DYKE. Screenplay: John Lee Mahin. Based on the books, \"Der Eskimo\" and \"Die Flucht ins Weisse Land\", by Peter Freuchen. Photography: Clyde DeVinna. Additional photography: George Nogle, Josiah Roberts, Leonard Smith. Music: William Axt. Orchestrations: Paul Marquardt. Assistant directors: Edward Hearn, Frank Messenger. Sound recording: C.S. Pratt, H.D. Watson. Film editor: Conrad A. Nervig. Technical adviser and guide: Peter Freuchen. Photographed entirely on location in Northern Alaska. Producer: Hunt Stromberg. U.K. and Australian release title: MALA THE MAGNIFICENT. Copyright 9 January 1934 by Metro-Goldwyn-Mayer Corp. New York opening at the Astor, 14 November 1933. U.K. release: 20 October 1934. Australian release: 31 October 1934. 12 reels. 116 minutes. SYNOPSIS: Native youth kills lecherous trader, but is hunted by a Royal Canadian Mountie. NOTES: Academy Award, Conrad Nervig, Film Editing (defeating \"Cleopatra\" and \"One Night of Love\"). Negative cost: A whopping $935,000. COMMENT: One of the rare MGM films on which Douglas Shearer does NOT receive a sound credit. The reason for this omission, of course, is that the film was wholly photographed and recorded in the Frozen North. Like Van Dyke's earlier \"White Shadows in the South Seas\" (1928), it is a semi-documentary (or \"staged\" documentary) using a mixture of native and professional actors, loosely structured around a simple plot designed to exploit as much of the local customs, fauna and scenery as possible. This story's hero-on-the-run is forced to survive in one of the most hostile environments on earth. As he relentlessly battles hunger, snowstorm and blizzard, the reality is so overwhelming, you actually feel the intense cold. This is not, of course, the sort of shivery \"escape\" that audiences seek. In order to recoup a small proportion of its huge negative cost, MGM kept the film in circulation for years. I remember seeing it at a Saturday matinée in 1949. Though expertly photographed and smoothly edited, the film was somewhat let down by its amateurish professional players. The actual amateur actors, on the other hand, that is the Eskimos themselves, led by a naturally talented Mala, seemed much more convincing!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Mala leads a contented life as the best hunter in his Canadian Arctic tribe, providing meat, fish and birds with his great skill. When another tribe member returns from trading furs with the white men for items such as a gun and an iron needle, Mala's wife, Aba, urges him to make the 500-mile trek across the frozen tundra to do the same. After the long night of winter, Mala does go with his family to the white man's \"floating house\" in Tjarnak. The friendly captain makes trade for Mala's excellent furs, but upsets Mala when he insists that Aba sleep with him that night. \"He didn't even ask me!\" Mala complains. Afterwards, the captain suggests that Mala go whale hunting and promises not to touch his wife, so Mala agrees. But news of a successful catch spurs a celebration on board ship, and the captain has Aba forcibly removed from her tent, plied with liquor, and then he rapes her. In the morning, the still-drunk Aba staggers from the ship, but collapses in the snow, where she is mistaken for an animal by a hunter and shot and killed. When Mala returns from the whaling expedition, he learns that Aba \"has swallowed sleep.\" He is so enraged he harpoons the captain, packs up his dog sled team and leaves with the rest of his family. It takes some time to recover from his grief and take on two new wives including Iva, who has loved him all along. The newly formed Royal Canadian Mounted Police learns of the murder and dispatches two mounties to arrest Mala. Ironically, Mala finds them frozen in the snow, near death, and saves their lives reluctantly, since he now trusts no white man. But they convince him they are his friends and must go back with them or else they may starve. So he goes, leaving his family behind. At the RCMP base, Mala learns from a translator he may hang. With great effort, he slips out of his shackled wrist, injuring his hand, steals food and a dog sled team and heads back to his land. In the morning, the two mounties go after him.",
         "The happy life of an Eskimo is disastrously changed when he mingles with an unscrupulous white trader."
      ],
      "budget": 950000
   },
   "movielensId": 141424,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-11-14",
      "dvdReleaseDate": null,
      "directors": ["W.S. Van Dyke"],
      "runtime": 117,
      "movieId": 141424,
      "title": "Eskimo",
      "mpaa": "",
      "actors": [
         "Edgar Dearing",
         "Peter Freuchen",
         "Edward Hearn",
         "Lotus Long",
         "Mala",
         "Joe Sawyer",
         "W.S. Van Dyke"
      ],
      "imdbMovieId": "0023990",
      "originalTitle": "Eskimo",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The happy life of an Eskimo is disastrously changed when he mingles with an unscrupulous white trader.",
      "tmdbMovieId": 113638,
      "avgRating": 4.16667,
      "releaseYear": "1933",
      "numRatings": 3,
      "posterPath": "/nUZe68Jt2LrniXd0NHIlrZdYjSq.jpg"
   }
}