{
   "tmdb": {
      "original_language": "hr",
      "keywords": [],
      "imdb_id": "tt4593108",
      "video": false,
      "title": "The High Sun",
      "recommendations": [
         214138,
         265193,
         352197,
         333846
      ],
      "backdrop_path": "/bJgUJ8Xu8QbSggUIEuBFBJSdyps.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jelena / Nataša / Marija",
               "gender": 0,
               "credit_id": "5530f27fc3a3680f42001296",
               "name": "Tihana Lazović",
               "profile_path": null,
               "id": 1455347,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ivan / Ante / Luka",
               "gender": 0,
               "credit_id": "5562d3afc3a3685448001409",
               "name": "Goran Marković",
               "profile_path": null,
               "id": 1470509,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jelenina / Natašina majka",
               "gender": 0,
               "credit_id": "5530f291c3a3684117001b9f",
               "name": "Nives Ivanković",
               "profile_path": null,
               "id": 1157343,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Saša",
               "gender": 0,
               "credit_id": "5562d443c3a368542c00130c",
               "name": "Dado Ćosić",
               "profile_path": null,
               "id": 1364310,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Božo / Ivno",
               "gender": 0,
               "credit_id": "5562d47892514151c3000d81",
               "name": "Stipe Radoja",
               "profile_path": null,
               "id": 1470510,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ivanov / Lukin otac",
               "gender": 0,
               "credit_id": "5562d48dc3a368542c001315",
               "name": "Trpimir Jurkić",
               "profile_path": null,
               "id": 1156171,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ivanova baba",
               "gender": 0,
               "credit_id": "5562d4b6c3a368542c00131c",
               "name": "Mira Banjac",
               "profile_path": "/c3FRLLrPOKMpJ8NPGho6XT9tYSs.jpg",
               "id": 38004,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mane / Dino",
               "gender": 0,
               "credit_id": "5562d4c3c3a3685448001435",
               "name": "Slavko Sobin",
               "profile_path": "/aKbWIoKdH6mB8Lrf2rgE5jSeSQO.jpg",
               "id": 1470511,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dinka",
               "gender": 0,
               "credit_id": "5562d4d3925141199400126d",
               "name": "Lukrecija Tudor",
               "profile_path": null,
               "id": 1470512,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Petra",
               "gender": 0,
               "credit_id": "5562d4e3c3a3685448001446",
               "name": "Tara Rosandić",
               "profile_path": null,
               "id": 1470513,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Lukina majka",
               "gender": 0,
               "credit_id": "5562d4f19251411994001276",
               "name": "Ksenija Marinković",
               "profile_path": "/yiDexg3nuxduaXhnWQd5Zuyp2uS.jpg",
               "id": 512966,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5530f26a92514150a9001c6f",
               "name": "Dalibor Matanić",
               "profile_path": null,
               "id": 63868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5562d50792514151c3000d95",
               "name": "Dalibor Matanić",
               "profile_path": null,
               "id": 63868,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "58664985c3a36852c902b91e",
               "name": "Čejen Černić",
               "profile_path": null,
               "id": 1729937,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "586649bf9251412b9002d21e",
               "name": "Marko Brdar",
               "profile_path": null,
               "id": 1162254,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "586649d7c3a36852c902b94b",
               "name": "Mladen Ožbolt",
               "profile_path": null,
               "id": 573610,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.393102,
      "production_countries": [
         {
            "iso_3166_1": "HR",
            "name": "Croatia"
         },
         {
            "iso_3166_1": "RS",
            "name": "Serbia"
         },
         {
            "iso_3166_1": "SI",
            "name": "Slovenia"
         }
      ],
      "id": 336206,
      "vote_count": 14,
      "budget": 0,
      "overview": "Three different love stories, set in three consecutive decades, in two neighbouring Balkan villages burdened with a long history of inter-ethnic hatred: this is a film about the dangers – and the enduring strength – of forbidden love.",
      "similar": [],
      "original_title": "Zvizdan",
      "runtime": 123,
      "poster_path": "/3TjKrCmeROEDUcoDzLZekOdOFUt.jpg",
      "spoken_languages": [{
         "name": "Hrvatski",
         "iso_639_1": "hr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kinorama",
            "id": 20916,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "SEE Film",
            "id": 49180,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gustav Film",
            "id": 54089,
            "origin_country": ""
         }
      ],
      "release_date": "2015-05-12",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Three decades. Two nations. One love.",
      "adult": false,
      "homepage": "http://zvizdan.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Croatia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dalibor Matanic"],
      "runtime": 123,
      "synopsis": null,
      "writers": ["Dalibor Matanic"],
      "originalLanguage": "Croatian",
      "imdbLink": "http://www.imdb.com/title/tt4593108/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ4NDg0MTU4MV5BMl5BanBnXkFtZTgwODY0ODk1NTE@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Tihana Lazovic",
         "Goran Markovic",
         "Nives Ivankovic"
      ],
      "reviews": [
         "It's been 20 years since the war in Yugoslavia, and the hate between the two nations has been growing like a balloon. The people who used to live in harmony and love for almost 40 years, are now living in animosity, that being their everyday life. Thus, whoever dared to speak about this subject or even try to forget or forgive, has been criticized from the both sides and named as traitor. Living in that kind of environment for that long must have been frustrating and agonizing and leave no space to make progress. This film is dealing with all the frustrations and emotions of the people affected by the war. It shows that a war can last longer in our heads after it is finished. Everyone can relate to this story. Everyone who is \"on the other side\". It is about love and hate, and how love can easily be replaced by hate and grow even bigger. Through two very complex and vulnerable characters, placed in three decades, Matanic shows us the layers and consequences of the war. The first story is about love, the second about hate and the third about forgiving and loving again. Being in the same age in all three stories, the characters represent the subconscious that war evoked in the people's minds. So, we either end up loving again or dying slowly with hatred in our hearts. It's beautifully shot film, with long and captivating shots portraying the reality of every character and holding to their emotions. The actors are the highlight of the film, taking every scene and making us bear with them all the time. It is a very brave film that want us to close the doors to nationalism and make a step forward to humanism. A lot of films tried to portray the war in Yugoslavia, but i guess none of them could speak from the heart. \"The High Sun\" finally does exactly that. Dalibor Matanic finally breaks the silence and shows us the only way there is and ever been. Love. 9/10",
         "There was once a big country named Yugoslavia, and then it broke up into smaller countries and the people fought each other. Twenty years later, in director Matanic' own words, the Balkans still bear the burden of nationality, history and war. Hate is carried on from one generation to the next. The High Sun starts with two lovers on the onset of war in 1991, to people returning to their old homes after the war in the early 2000s, to our present day, with a youth living modern lives for whom the war is a distant memory but who still carry with them the burden of their parents. The film is carried by the same two actors in the three different stories, playing different characters in a different time. Although they don't talk much, their expressions and movement It's the camera work that brings us inside their world. Above all, this is a very visual film that draws its strength from how it combines the beautiful countryside of Croatia with the memory of suffering. Animals look on at humanity's foolishness as soldiers through the countryside, the bullet holes are still visible in the walls, whether the houses are abandoned or inhabited and the protagonists' pain is visible on their faces. While the war itself is not shown, the cultural issues of the Balkans are tangible throughout the entire film. Traditional gender norms are brought up in arguments between mother, daughter and brother, nationality is a key issue. The characters don't talk much, don't express themselves much until they hit their own breaking point. Which, of course they do, because everyone in one way or another is affected by the war. The director said in a press conference following the film that he wants each generation to surpass their parents, but that instead he witnesses a regress, compared to the generation that lived in the old Yugoslavia. In order to stop the vicious cycle of violence that has plagued this region for hundreds of years. As the film moves on, we see a little shift at the conclusion of every story. The ending of the first is just tragic. The second results in an ambiguous ending after a passionate affair. The third leaves an open door for the protagonist, a chance to start over, to surpass the hatred his parents passed on. Director Matanic has also said that 'some people just like to hate'. In contemporary Europe, this is still very much true. That kind of hatred is not easy to understand for everyone, including the people in the affected societies, such as the director's Croatia. This film can give us a better understanding of how war and nationalism can affect people on a personal level. More importantly, the message we take home at the end is that with time, there is more hope. All of that might have been a bit too preachy or serious if it weren't for the beautiful visuals of rural Croatia and the beautiful broken heroes of each story.",
         "The High Sun is a trilogy in which the same two actors play romantic leads in separate stories a decade apart, their lives paralyzed by the Serbian-Croatian war. The structure hearkens back to the magazine anthology film in early Italian neorealism. In 1991 the girl's brother refuses to let her marry her lover from the other side. He forcibly returns her from their planned escape to the city. When the lover gives chase he's held at the border. In the ensuing scuffle the lover is shot dead. The girl is unconsolable, her brother shocked at the death he did not even in his rage intend. In 2001 the buildings are ruined from the bombings. A mother and daughter return from the city to their battered house and hire a young man to rebuild it. Again the tensions between the enemy sides persist. The social ruin outlives the physical. The mother and boy deliberately set that gap aside to get on with their lives. But the girl freezes him out, because his side killed her brother. She attacks her mother for accepting him. Sensing her prejudice the boy turns on the girl: \"Am I to blame for his death?\" Besides: her side killed his father. Typical of the film's attention to telling detail, a pearl of sweat runs down the girl's nape as she watches the boy work and is attracted. Chastened by his scolding, on his last day of the job she initiates a passionate round of sex. This commits him to her but she shuts him out: \"That's it then.\" He's off to a big job in the city, but in parting he causes her second thoughts when he generously gives her mother back his salary. \"You're moving here. You'll need this.\" Re-won by this generosity, the girl wistfully watches him disappear from her life. This love was a casualty of the war hatreds that live on among the ruined buildings and lives. Long after the war, in 2001 a young man returns from university in the city for a big summer party. As we learn, at his mother's insistence he abandoned his pregnant Serbian girlfriend to go to school. He still resents his parents for encouraging that stance. When he visits the girl and sees her little son he regrets it even more. His former lover freezes him out altogether — an extension of the post-coital freeze in the second episode. The boy tries to lose himself in the booze, drug and sex orgy on the beach. A swim seems to bring him back to his senses. He leaves the girl and goes back to his former lover's house. When she doesn't answer his knocks he sits on the stoop and waits. She comes out, sits beside him, both mute, then arises and goes back into her house. She leaves the door open. We don't know if he'll go in, but whatever happens their love is gone. The silent open door expresses resignation not their old passion, which was a fatal casualty of the prejudice and cowardice of the war. In all three stories the city is a distant escape, as if the war and its effects could be escaped anywhere geographic. The landscape is studded with the wounds and destruction of war. But as man and his constructions pass, the larger rhythms of life persist, especially the cycle of love and loss and the rhythms of nature. Hence the river figures in each episode, the fields, and a silent dog that is witness to all three tragedies.",
         "Before you go . . . Get familiar with the conflicts along the Balkans, and particularly a historic rivalry (not always friendly) between Serbians and Croats. You need to be fully aware when one story ends and the other begins because there is no link between them but the main actors are always the same. Because there is one scene with quite explicit sex, you may feel uncomfortable unless you and your company are in enough confidence. With that said, Fabulous film",
         "The criticism in the detailed Turkish language about the film is linked below. The film is a movie that is filmed with the conflicts over male and female couples after the war that caused the division and the division that caused the former yugoslav peoples to experience imperial dreams with factors such as nationalism and chauvenism (extreme nationalism). The main theme is racism, the second story, \"Nobody asks me what I think\", the loss of human values; Who has lost empathy and has become selfish over time, who does not think of other people's troubles apart from his own cause and does not endeavor to identify with the people around him. The uniformist is presented to the eyes of the spectator as the embodied state of the shallow viewpoint on the individual. The second detail that we should pay attention to in the film is the discovery of 10 years' worth of time between 3 different stories. But also reflects the fact that they brought a transition from a communist regime to a capitalist regime. (Hedonism), luminizing, which he tried to show through young people in the third story, The director who works with the spoils and disgusts of his attitude which superficializes, disappears in searches, lives on the spot, is aimless and has responsibility against age, and is responsible for the aging, is using the young people who organize night parties while showing this fact. Although it is read like a kind of purification ceremony to enter the sea, the film tells that the unbreakable wounds brought back from the sea in the film will be played by the young brains one after another, and this film contains the theme of insolubility by specifying with this metaphor. I can say that the theme of alienation in the second story can be read as the difference between the generations, especially the mother and the girl, and indirectly the relationship between man and woman. While racism is rising, the hope sun is slowly rising in the film.",
         "It is a special movie. It is a difficult movie. It is not a movie for everyone. But it's not just that. It's a movie that has too many minutes in which nothing happens. It is not that a look between two actors lasts longer than it should because the tempo of the film requires it, it is not that, it is that between each story, the lost footage is so long, that it helps you to disconnect from the film. I have always said that a few more frames in each plane make a film heavy, this is the clear example. Not only there are many moments between each story, throughout the stories there are also moments and little by little it destroys the great work of the actors. The actors are very good. Although I think that it is not a success that they are the same in the three stories, because if you do not know anything about the film before you start, it helps you to get lost. They do a great job. They are very content and with a gesture they do everything. The problem is that between the time lost and the planes so ugly that the director does, his work is not used. Photography does not help anything. It is not a beautiful or useful photograph. It does not get you into the story or tell you anything. It is as if there were no photography. The director seems bad to me. The first does not know that you have footage left over and that makes you bored. He does not know how to take advantage of the actors' work. Many times he takes them with the camera so badly that he does not take advantage of his work. The plans are ugly and badly composed. It's as if he did not know how to take the movie. The end of the first film is especially badly shot. The actress leaves her skin and you can not see her face. You do not even know what happened until it happens. I imagine it will be for lack of budget. But then to spend on water chambers that are useless, there's plenty to spare. I would not spend my time watching this movie."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Kinorama",
         "Gustav Film",
         "See Film Pro"
      ],
      "summaries": ["Three different love stories, set in three consecutive decades, in two neighbouring Balkan villages burdened with a long history of inter-ethnic hatred: this is a film about the dangers - and the enduring strength - of forbidden love."],
      "budget": 0
   },
   "movielensId": 141485,
   "movielens": {
      "languages": ["Hrvatski"],
      "releaseDate": "2015-05-12",
      "dvdReleaseDate": null,
      "directors": ["Dalibor Matanić"],
      "runtime": 123,
      "movieId": 141485,
      "title": "The High Sun",
      "mpaa": null,
      "actors": [
         "Tihana Lazović",
         "Goran Marković",
         "Nives Ivanković",
         "Dado Ćosić",
         "Stipe Radoja",
         "Trpimir Jurkić",
         "Mira Banjac",
         "Slavko Šobin",
         "Lukrecija Tudor",
         "Tara Rosandić",
         "Ksenija Marinković"
      ],
      "imdbMovieId": "4593108",
      "originalTitle": "Zvizdan",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Three different love stories, set in three consecutive decades, in two neighbouring Balkan villages burdened with a long history of inter-ethnic hatred: this is a film about the dangers – and the enduring strength – of forbidden love.",
      "tmdbMovieId": 336206,
      "avgRating": 3.72222,
      "releaseYear": "2015",
      "numRatings": 9,
      "posterPath": "/3TjKrCmeROEDUcoDzLZekOdOFUt.jpg"
   }
}