{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3420848",
      "video": false,
      "title": "Stand",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "54c24dc29251412489003921",
            "name": "Jonathan Taïeb",
            "profile_path": null,
            "id": 1187198,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.060183,
      "production_countries": [],
      "id": 320643,
      "vote_count": 0,
      "budget": 0,
      "overview": "After taking a wrong turn in their car, a young gay Russian couple witnesses what they believe is a vicious gay bashing; their quandary over what to do about it propels them into ever more dangerous territory. For Anton, the burden of what they may have witnessed outweighs Vlad's fear of probing too deeply into the incident. When the police prove indifferent, Anton talks his skeptical lover into launching their own amateur investigation into the incident. Their risky search for the truth has unexpected - and grim - consequences in this suspenseful drama that comments on the ongoing mistreatment of LGBT people in Russia.",
      "similar": [],
      "original_title": "Stand",
      "runtime": 87,
      "poster_path": "/bJemqsD8QagHQcuKGtK2Tl7uQq6.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [],
      "release_date": "2014-06-20",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Taieb"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Andrey Kurganov",
         "Jonathan Taieb"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt3420848/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM3MTI4NTY4NV5BMl5BanBnXkFtZTgwMzkyODExMTE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Renat Shuteev",
         "Andrey Kurganov",
         "Andrey Koshman"
      ],
      "reviews": [
         "I was fortunate to be at the premier of the movie at the Castro theater in San Francisco, CA. The film impressed me by how it captured not just the situation regarding LGBTQ issues in Russia but also the Russian mentality. Being from Russia, I felt like it was easier for me to understand some of the details and realities presented in the film. I found myself explaining some things to Americans around me. Although hard to watch, it is well worth it. The story is well written with some important details that explain some of the cultural specifics. It does require careful watching and paying attention. This is not a light movie. The main characters of Anton and Vlad are well acted. Although they represent two different positions, different ways of living and dealing with issues, I could relate to and empathize with both. The movie is complex, heart-breaking, and thought-provoking. I hope this movie can reach a wide audience.",
         "STAND is the kind of film that pulls you in, holds on and hits you hard. It asks a classic, eternal question: when is doing the right thing worth risking everything else? Many in the US know that life for gay people in Russia leaves a lot to be desired. This film goes a long way to make us see the oppressed existence of those who do not conform to the \"norms\" of society. The only way they get along is by maintaining a low profile and not making waves. Anton and Vlad are a happy male couple. Both attractive and intelligent, they have a seemingly ideal relationship, as lovers and best friends. But a rift starts between them one night, when they witness the beating of a another gay man. Anton wanted to stop the car and help, but Vlad kept going. Later it is learned that the victim has died. Anton devotes himself to uncovering the killer and Vlad somewhat reluctantly, out of love, agrees to help him. But Anton takes one chance too many in his search and Vlad reacts with anger out of fear for his partner's safety. After a painful confrontation, they go their separate ways ,with Anton pursuing his mission at first alone, then with the help of a handsome friend, Andrey. No real spoiler here; the rest of the story is strong stuff and not easy to forget. The actors are uniformly excellent, with Renat Shuteev, as Anton, deserving top honors for a very convincing characterization. Director Jonathan Taieb does a fine job of setting the scene and evoking excellent performances. A few scenes seem slightly overlong, even superfluous, but they don't detract from the overall quality of this film. An LGBT film with a strong message and artistic value.",
         "Anton and Vlad are a gay couple in modern Russia – a place where extreme views on same sex relationships are still publicly rampant. The authorities too seem complicit in the way homophobic attacks are ignored. Then Anton and Vlad see a man being beaten on the streets, and Anton wants to stop and help – Vlad has a different view. They later find out that this was a homophobic attack and Anton wants to do the work the police won't do and track the attackers down. This is the story of that search. Now there are some that moan when we have yet more depictions of homophobia in film because it has all been done before; but for a great many men and women this is a reality of life and by highlight ting this gross breach of human rights and even decency we may be able to bring around change. So for that I applaud the film makers. It is also well acted and has some excellent direction and use of cameras and angles. Some scenes could have been shorter I felt, but that is a minor issue in what many will rightly see as an important film. It is a difficult watch in places too, but that is of necessity deliberate – recommended to those who appreciate the gay film genre in all its many colours."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Grizouille Production"],
      "summaries": ["A couple's search for the truth about a homophobic crime in Russia."],
      "budget": 0
   },
   "movielensId": 141444,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2014-06-20",
      "dvdReleaseDate": null,
      "directors": ["Jonathan Taïeb"],
      "runtime": 87,
      "movieId": 141444,
      "title": "Stand",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "3420848",
      "originalTitle": "Stand",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "After taking a wrong turn in their car, a young gay Russian couple witnesses what they believe is a vicious gay bashing; their quandary over what to do about it propels them into ever more dangerous territory. For Anton, the burden of what they may have witnessed outweighs Vlad's fear of probing too deeply into the incident. When the police prove indifferent, Anton talks his skeptical lover into launching their own amateur investigation into the incident. Their risky search for the truth has unexpected - and grim - consequences in this suspenseful drama that comments on the ongoing mistreatment of LGBT people in Russia.",
      "tmdbMovieId": 320643,
      "avgRating": 3,
      "releaseYear": "2014",
      "numRatings": 2,
      "posterPath": "/bJemqsD8QagHQcuKGtK2Tl7uQq6.jpg"
   }
}