{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "christian",
         "id": 5950
      }],
      "imdb_id": "tt3832914",
      "video": false,
      "title": "War Room",
      "recommendations": [
         14438,
         347126,
         72213,
         309425,
         29697,
         249660,
         18925,
         60778,
         410259,
         198318,
         253255,
         362583,
         43334,
         42950,
         365452,
         211085,
         243794,
         347627,
         258548,
         17345
      ],
      "backdrop_path": "/9alUDrE2irI617fkbD84rlov5i4.jpg",
      "revenue": 67790117,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Elizabeth Jordan",
               "gender": 0,
               "credit_id": "55d373b1c3a3683b7b0002ff",
               "name": "Priscilla C. Shirer",
               "profile_path": "/A5aazwsHAxw7CKVOOEXhuiZrBUi.jpg",
               "id": 1498038,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tony Jordan",
               "gender": 2,
               "credit_id": "55d373c0c3a3683b830002f7",
               "name": "T.C. Stallings",
               "profile_path": "/q3G5e8HXHl9VuWb3iNuvFPiV0vw.jpg",
               "id": 525138,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Miss Clara",
               "gender": 1,
               "credit_id": "55d373d1c3a3683b7b000306",
               "name": "Karen Abercrombie",
               "profile_path": "/yBY4kOgmqJJyNT5sUJP3CP1hol4.jpg",
               "id": 167132,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mandy",
               "gender": 0,
               "credit_id": "55d373e5c3a3683b830002fe",
               "name": "Beth Moore",
               "profile_path": "/ajvpkAIfnF1xhdHSpyqH5eVXcJ4.jpg",
               "id": 1498039,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Michael",
               "gender": 0,
               "credit_id": "55d373f3925141201a00032c",
               "name": "Michael Jr.",
               "profile_path": "/hDOfzwkCvLOaMpY4RPtp27nYozu.jpg",
               "id": 215301,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jennifer Stephens",
               "gender": 0,
               "credit_id": "55d37408c3a3683b7b000310",
               "name": "Jadin Harris",
               "profile_path": "/6QgzM0TC5MWLX2epWX9dSuYm4Qo.jpg",
               "id": 1498040,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Veronica Drake",
               "gender": 0,
               "credit_id": "55d3741b925141200500031b",
               "name": "Tenae Downing",
               "profile_path": "/omVwZHpbFP7D3kaokhC9ZuKRGpW.jpg",
               "id": 1498041,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Danielle Jordan",
               "gender": 0,
               "credit_id": "55d3742b9251412005000321",
               "name": "Alena Pitts",
               "profile_path": "/wSZiFIJwfKVnwZLM39WI9cSCcB7.jpg",
               "id": 1498042,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Coleman Young",
               "gender": 2,
               "credit_id": "5776820592514103880009b1",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Tom Stafford",
               "gender": 2,
               "credit_id": "57768271c3a3687cc9000994",
               "name": "Dave Blamy",
               "profile_path": "/s9pfRs1jmHJJIjM9UpASEth1Za9.jpg",
               "id": 1009804,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Leo Williams",
               "gender": 0,
               "credit_id": "577682d2c3a3686afa000f0d",
               "name": "Thomas Ford",
               "profile_path": null,
               "id": 1643869,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "War Room Soldier",
               "gender": 2,
               "credit_id": "57768418925141030c000b8b",
               "name": "Terrence Evans",
               "profile_path": "/jhEu0HyHPbFh3cbIoWGW95ubEK1.jpg",
               "id": 132054,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55d3735a925141200a00031f",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55d373689251412010000331",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55d37372c3a3683b830002ee",
               "name": "Stephen Kendrick",
               "profile_path": null,
               "id": 430997,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56640e4cc3a3682be900811c",
               "name": "Bob M. Scott",
               "profile_path": null,
               "id": 1545372,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "56640e5bc3a3682bd80083d9",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b61992c3a36806f8008ad7",
               "name": "Paul Mills",
               "profile_path": null,
               "id": 1573466,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.167264,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 323272,
      "vote_count": 117,
      "budget": 3000000,
      "overview": "The family-friendly movie explores the transformational role prayer plays in the lives of the Jordan family. Tony and Elizabeth Jordan, a middle-class couple who seemingly have it all – great jobs, a beautiful daughter, their dream home. But appearances can be deceiving. In reality, the Jordan’s marriage has become a war zone and their daughter is collateral damage. With the help of Miss Clara, an older, wiser woman, Elizabeth discovers she can start fighting for her family instead of against them. Through a newly energized faith, Elizabeth and Tony’s real enemy doesn’t have a prayer.",
      "similar": [
         615,
         9946,
         5876,
         310,
         866,
         192,
         9509,
         9552,
         871,
         9693,
         28,
         242,
         1813,
         2675,
         72190,
         68730,
         401898,
         333371,
         324786,
         147441
      ],
      "original_title": "War Room",
      "runtime": 120,
      "poster_path": "/ufyybGW3q0wbATNg03geeSEdsDo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kendrick Brothers Productions",
            "id": 69411,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Affirm Films",
            "id": 10156,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Provident Films",
            "id": 3291,
            "origin_country": ""
         }
      ],
      "release_date": "2015-08-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Prayer is a Powerful Weapon",
      "adult": false,
      "homepage": "http://warroomthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Kendrick"],
      "runtime": 120,
      "synopsis": "Ms. Clara (Karen Abercrombie) is standing by a grave. The scene cuts to army soldiers standing in a war room. Clara explains a war room is where an army gathers before a war to plan their strategy. This is what her husband did for a living until a heart attack took his life too soon. We meet the Jordan family. Tony (T.C. Stallings), the father, is very emotionally cold. He comes home and yells at his wife, Elizabeth (Priscilla C. Shirer). Tony is angry because he just found out that she transferred $5,000 from their savings account and knew it is for her poverty-stricken sister. He tells her to put it back, and its his decision to handle their money and she wont be giving her sister any money. Tony tells their young daughter, Danielle (Alenna Pitts), that she is too old for a double dutch team. Liz nods disapprovingly. She tells Danielle she has to drop her off at the community center early the next day to meet with a client and Tony is leaving for a business trip. We see that Tony is the top salesman at a pharmaceutical company. He makes a lot of money and is well respected. On his way out of a meeting, he meets an attractive lady who hands him her phone number. He takes it and smiles. Liz works as a real estate agent. We see her in a meeting room with her co-workers, and they tell her not to back down to Tony and to give her sister the money anyway. Then one lady makes a joke and says \"My grandmother used to say, submitting to your husband is just ducking so God can hit your husband.\" Liz goes to meet Ms. Clara. She gets the details of her beautiful home. She sees a picture on the wall of Clara and her husband. She says they only had one son and were married for only 14 years before he died. Then Clara asks to meet Liz the next day for coffee. Liz agrees. The next morning Clara asks Liz about her church and her prayer life. Liz says she goes to church sometimes and that shed consider her prayer life lukewarm. Clara brings Liz room temperature coffee, and when she expresses her disgust, Clara tells her thats how God feels about His people being lukewarm. \"He wants us either hot or cold\" says Ms. Clara. Meanwhile, Tony calls the woman from earlier and say hell be in town and asks her out to dinner. Clara asks Liz if shell meet with her one hour a week, and shell train her about how to pray for her husband so Liz wont step on the same land mines that Clara did. Liz agrees. Clara tells her that God calls us to pray, not to change people and that her battle isnt with Tony, but its with the devil who has taken control of her house and her marriage. She shows her a closet, which Clara calls her \"war room\", where she goes to pray. She has scriptures and notes posted on the walls of the room about what to pray for what situation and what she needs to pray for. Outside of the closet, she has a wall of remembrance, where she posts answered prayers. At home, Liz overhears her daughter Danielle tell her friend that she wishes she could live at her house because anytime her parents are together, all they do is fight. Liz goes to her closet and cleans it out and makes her war room. She isnt sure what to do at first. (In a hilarious scene, Liz is shown taking chairs and bean bags in and out deciding what to do.) Then she decides just to sit and eat chips until Danielle finds her. Danielle makes a joke about how stinky the closet is because of her mother's feet. Liz gets a text from a friend that Tony is at dinner with another woman, and it doesnt look like business. Liz begins to cry. Then she sits down in her war room and genuinely prays. She finds scriptures to help her trust God and resist the devil. She prays to God to take her hurt and intervene in the situation with Tony, to please help him and stop whatever is happening and save her marriage. Meanwhile, Tony is at dinner with the woman. She doesnt care that hes married and invites him back to her apartment to spend the night. Tony agrees and asks for the check. Meanwhile, Liz is still praying that God stops the situation. At the same time, Tony suddenly gets very sick and runs to the bathroom. Tony comes home early and finds Liz making dinner. She says Danielle is going to a friends house. He asks if she can eat with her. She smiles and agrees, never mentioning the affair. He sees her cell phone and the messages from the friend telling her about him with the other woman, so he knows that she knows where he was. Liz treats him with dignity and respect, never questioning him because shes trusting it to God. She says God is his judge, not her. In another funny scene, he switches their plates of food because of how nice and calm she is. He asks her what she wants. She says \"Right now? Right now... Id like a big ice cream sundae. Hot fudge just everywhere and lots of whipped cream. One cherry right on top. OH and a foot rub\". Tony says \"Liz, I am NOT touching your feet.\" Liz continues to meet with Clara. They go for ice cream and are robbed at knife point. Clara stands up to the man and tells him to drop the knife in the name of Jesus. For some odd reason, the would-be-mugger gets freaked out and runs. The police are shocked at how calm Clara is but she says she trusts God to protect her. Tony is discovered to be padding his numbers at work to earn more bonuses and loses his job. When he tells Liz that he was just fired, hes already very defensive. Shes very calm and says that its okay, and theyll make it through this. He gets even more upset at her, and she says she trusts Jesus and that she loves him but first and foremost, she belongs to the Lord, and no matter what Tony does, he wont steal her joy because that comes from God. Tony wants to go to the gym to work out this stress he's feeling and while hes looking for his gym bag, discovers his wifes war room. He reads the prayers and the letters she has. He takes Danielle to her double dutch practice and gets involved. He jumps with her and teaches her new tricks. Her and her friends love him. Tony goes home and falls on his face and begs God to forgive him. Then he goes to Liz and begs her forgiveness and says he will be better. He says he didnt cheat on her, but he almost did; he came so close, and hes so sorry for all hes done and how he has treated her. She forgives him. Then he asks the same from his daughter. Tony tells Liz hes struggling with one more thing. He opens a box full of pills he stole from the pharmaceutical company. He says he knows he has to return them but if he does, he may spend time in jail. She tells him to trust God. Tony takes the pills back to the company. One boss, Tom, is ready to call the cops immediately, but another boss (played by writer and director Alex Kendrick), tells him to give him two days to think about what he wants to do. Liz tells Tony to spend the next two days involved with the jump rope team and to let God have his worries. He does. The day before he finds out his fate, his boss comes to his house. He tells him that he cant give him his job back but that he believes he is sincere because not many men would risk returning the pills. He also tells him he needs to pay back the company $19,000 in bonuses because of his lies. He says they already agreed to do so. Liz and Tony break down saying this is grace and mercy from God on them. The next day the family goes to the Double Dutch competition. On the way, they see Tom, the boss who wanted him in prison, with a flat tire. He cant change it, and Tony stops. He gets out of the car and approaches Tom with a tire iron. Tom is visibly scared until Tony goes to the ground to change the tire. He stands up with dirty hands to shake Toms hand, and Tom relaxes and gives him a firm, respectful hand shake. Tom sees that Tony was sincere in his reasoning to get right with God, his family, and his former company. He gets back in the car, and his daughter asks why he did that for such a mean man, and he says \"Its mercy, Danielle. I treated him the way I want to be treated.\" At the double dutch competition, Tony competes with his daughters team. They are amazing. Danielle's team wins second place. However, Tony tells Danielle that it wasnt about winning, it was about him being involved and being there for his daughter. They go home as a family. Liz shows Claras house to a retired preacher who says he can tell someone has been praying in that closet; thats how strong she prayed. They buy the house. Liz still meets with Clara and thanks her. She says that Clara was her answered prayer and helped save her family. Clara says that Liz is her answered prayer, too. She tells her that she never got to reconcile with her husband. That she never prayed for him because she was so stubborn, bitter and prideful. She didnt learn her lesson until after he died from a sudden heart attack. She asked God to send her a woman to pass the knowledge on to before it was too late and that God sent her Liz. She asks Liz to please find a woman to do the same for. Liz and Tony are at home, and he asks her how it went with her sister. She said it went fine, and she appreciated the $500 and knows they cant do more right now. He tells her he got a job as head of the community center, its half the pay, but theyll make it if theyre wise. She says shes so wise the ladies skipped dessert. He says good, he has something for her. She sits on the couch, and he brings a bucket of water to her. He tells her to put her feet in and relax then brings her her ice cream sundae just the way she described earlier. Liz tells him please, dont touch her stinky feet. He says shes his wife, and he has this covered. Then he pulls out a surgical mask, and they laugh. She starts to cry and says her husband brought her her favorite dessert and is rubbing her feet, there MUST be a God in heaven.",
      "writers": [
         "Alex Kendrick",
         "Stephen Kendrick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3832914/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYyNTUxMjQwNF5BMl5BanBnXkFtZTgwNDY5MDIwNTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Priscilla C. Shirer",
         "T.C. Stallings",
         "Karen Abercrombie"
      ],
      "reviews": [
         "It seems odd to me that this movie would have received such a low rating so far. Unlike many Christian themed movies on television, which are lacking in many ways, this movie is well worth watching. The production, story and acting are all as good, if not better than, any other movie you'd expect to see in the theaters. Without giving away any real details, the movie follows a family that seems to be falling apart and realizes they need a higher power than they can find in themselves to stay together. I don't know if I could say that there are any real mind shattering revelations in this movie, but it is truly thought provoking none the less. Obviously, people who refuse to believe in God and feel no need for faith aren't going to like this move, they don't want to be preached to. But I would highly recommend this movie to any one who does believe in God, and even to those who are open to believing.",
         "War Room is a movie about prayer in people's lives. The Trailers don't really do this movie justice, I didn't feel excited by them. The movie is well produced and the cinematography is well done. Christian and/or faith based films have had the stigma of being poorly made (TV drama story, unfocused camera, bad acting, pushy message, etc) but War Room actually does all these things right. The brothers who directed this movie and others have vastly improved over the previous films. The actors portray people that the audience can relate with and situations that people face in everyday life. The sharp cinematography was more akin to Downton Abbey than some Hallmark Channel or Lifetime Movie. This film was only slightly cheesy a times, but given it's PG rating this may have been to add humor or some element the whole family could react to in some sections. War Room is definitely worth the price of admission and entertaining throughout.",
         "Me and my two kids love all the Kendrick brother films, we own most of them all, so we knew this one wouldn't disappoint. God really has his hands on their company... Anyway on to my review.. I enjoyed every part of this film, mainly because it was mature enough, and spiritual enough for adults, as well as humorous and appropriate enough for children. Plus the kids in this movie had a large part to play in the film. Without giving away any spoilers I will say that whether you are a Christian or not, if you love prayer, or just want to know/learn more about it please give this movie a chance and go check it out. I'm definitely spreading the Word. Thanks Kandis",
         "What is this movie's message? Pray for what you want, and you'll get it? That sounds more like The Secret than The Bible. A comfortable middle-class black family have some first world problems, and turn to the Bible-belt version of Christianity to solve them. If they spent less time saying \"Hallelujah\" and more time reading the actual Bible, they would see Jesus saying \"sell what you have and give to the poor\". I'm not a Christian, but if you're going to call yourself a Christian, then be one. There is something very suspicious about the reviews so far (up to September 2015). Forty-three reviews, three of them negative and 40 overwhelmingly positive, but a score of 5.5. If you pardon the pun, there's something fishy going on.",
         "\"War Room\" is yet another film made to cash in on the recent Christian movie boom and like its contemporaries, it puts the message first and trivial matters such as acting, directing, writing, editing, and production a distant second. What makes \"War Room\" perhaps even worse than its proselytizing brethren is while they tend to share the same overall message (Christians RIGHT, everyone else WRONG), the underlying message in \"War Room\" is far more disturbing. \"War Room\" is the story of Tony (T.C. Stallings, who with his razor sharp features and V-shaped brow is a bit too scary to pass as an everyman), his wife Elizabeth (Priscilla Shirer), and their daughter, Danielle. Elizabeth and her husband argue constantly and he even ponders cheating on her. Things change for Elizabeth when she agrees to sell the house of Miss Clara (Karen Abercrombie). Miss Clara soon senses the turmoil in Elizabeth's home life and tells her that her marital problems will be magically fixed if she hides in a closet and simply prays for them to get better. Yes, really. The acting is terrible but considering that the leads are motivational speakers and the director gives himself a prominent role it's no surprise. The only person who even tries is Karen Abercrombie but she plays the sassy black grandma shtick to such extremes that even Tyler Perry would tell her to tone it down. She's bossy, pushy, and shouts \"Praise Jesus\" constantly when she's not speaking in overwrought war analogies. That being said, at least the scenes with her had some life to them. The writing is just awful. It's full of clunky exposition and treats its female lead with contempt at times, making constant jokes about her bad breath and smelly feet. You can tell men wrote this as the one scene featuring all women has them prattle on about being subservient to their husbands and how it's so \"hard\" to be a woman. After the first hour, Jesus is mentioned so much that you could turn it into a drinking game. Another way the writing fails is that Tony is so mean to Elizabeth that their marriage really seems beyond saving. He's verbally abusive, ignores their daughter, lords his superiority over his wife and ogles other women. If that weren't bad enough, he turns out to be a thief and a drug dealer and says in one scene that he wouldn't give his wife CPR if her life were in danger! I'm supposed to want these people together? And even if divorce is unthinkable (which in this universe, it seems to be) why is marriage counseling never mentioned? Do they not know that some churches actually offer that? They could go to a counselor in their church, save their marriage (Tony's beyond saving but just go with it) AND find Jesus along the way! They can even keep the prayer closet. It's pretty bad when I can think of a way to solve the central conflict of the movie and keep the religious themes intact better than these jokers did. This movie, like others of the genre, operates in an alternate reality where people convert instantly. Miss Clara preaches to a mugger and instead of getting gutted like a fish like she would be in real life, the mugger slinks away. Elizabeth decides to fight for her marriage by running around the house like a crazy person and shouting at Satan in the movie's most unintentionally funny scene. Elizabeth's incessant praying somehow gives her husband food poisoning while on a date with another woman and he just gives up and leaves. The movie never considers the fact that he could still go have sex with the woman and Tony is so nasty by this point it's very plausible he would. After Tony and Elizabeth magically reconcile, the movie decides to introduce the drug dealing subplot which is laughably and clumsily handled. Tony's boss sees that his sales numbers don't add up which would be enough for a police investigation but they only fire him and send him on his way. Then he admits to selling drugs on the side but his boss doesn't arrest him because he was really, really sorry. That must be a tremendous comfort to all the people who overdosed on the drugs he sold. The movie ends with a jump-rope competition that is just unnecessary padding (keep an eye out for the little girl in the audience who CONSTANTLY stares at the camera) before launching into full-on propaganda mode in the last fifteen minutes. It starts with Miss Clara telling Elizabeth to tell other troubled wives to go hide in their closets, segues to her house being sold to a minister who can somehow divine that the closet was used for praying, and finally resorts to outright filibustering. This is conveyed through a prayer montage that works its way up through the nation's schools (separation of church and state is merely a suggestion in this world) to those Godless heathens in Washington. This coda pretty much wrecks what little verisimilitude the movie has (which isn't much). \"War Room\" is a vile, preachy, and pretentious film with twisted morals masquerading as wholesome, Christian entertainment. While I can sympathize with not wanting to divorce, there must be some middle ground between divorcing after six months and staying with an abusive and cruel spouse until one of you dies. I can also recognize that there are marriages where sometimes, divorce is sadly the answer. It's a pity that this movie doesn't seem to think so. Following this movie's advice for marital troubles is not just patronizing and irresponsible, but potentially dangerous. Avoid at all costs.",
         "The War Room Is The Best Christian Family Movie Ever. It will enchant you with its magical theme of an integrated family . Every member cares for the other. In this film you will clearly witness how the strong faith in God and Jesus will bring you all the unprecedented joy and peace of mind. You can see in this movie the sense of humor between family members and how they all respect each other (something is so rare to see nowadays with the presence of a corrupt society). God may inflict pain on pious people in order to test their faith and even if they suffered in this life, heaven awaits them when they die. The main characters of this movie had faced difficulties and sorrow in their life and fortunately their true faith in God and Jesus had made their life so significant. This is a must see PG Family movie for every sad individual in the world whose life has been miserable.",
         "CAVEAT: My wife rented this through Netflix thinking it was about something completely different, namely, a military codebreaking movie. I am not a religious person anyway, so I would never have willingly chosen to watch this movie, but I agreed to watch it after she encouraged me to \"keep an open mind.\" I take no issue with religious people or people who believe in prayer, but I think this movie taught the wrong message to anyone, religious or not. That said, I am now helping her choose the movies in our Netflix queue :) First, the old woman should not have pushed her religious views on the realtor so hard. No religious person should be trying to force religion on others (Jehovah's Witnesses come to mind). The husband's abusive behavior and cheating toward the wife and daughter needed to be dealt with not through crying and prayer, but through counseling and/or divorce. The fact that the husband committed larceny, embezzlement, and fraud through his company, lost his job, lied about it, and somehow his wife not only didn't get angry, but instantly forgave him, made me puke a little in my mouth. And the movie taught that prayer solves all one's problems in exactly the way one wants, which isn't what is taught in the Christian religion. A person has no responsibility toward solving his/her own issues in life; God will fix everything. That, plus the ridiculously over-the-top melodrama, makes this a must miss, even among the most evangelical sort.",
         "This movie is POWERFUL and life changing. Why is that? Because it does not compromise the Word of God and it is so real. The bible tells us the word of God is alive and active. Sharper than any double-edged sword, it penetrates even to dividing soul and spirit, joints and marrow; it judges the thoughts and attitudes of the heart. And again, this movie gives you the Word of God straight up which for true Christians who love the Word of God is PERFECT. I highly recommend this movie for everyone but especially those who are looking to grow up in Christ and are ready to receive the full benefits that come from a powerful prayer life. Husbands and wives, mothers and daughters, fathers and sons, families, church groups, get out together to see this movie then go home to make your own War Rooms. More prayer, more power!",
         "Excellent outlook on how we aught to think and live by faith and through prayer! Well done. We tend to not focus on the positive elements of life and who God is but turn inward on our situations and create a negative mind set. That makes us look at things from an improper stand point. Prayer is the way to a positive outlook and relationship with God. It allows us to see things through Gods eyes. Prayer is what makes things happen. Thanks for a great movie that i can sit with the family and enjoy. Would love to see more movies like this that make people think about life and eternity.",
         "The only redeeming quality of this film is the fact that I never have to watch it again. First off, the actors are terrible. There is no emotion to their dialogue, the directing is even worse, and the plot line is slow and over-done. If I had a choice between watching this film and taking the electric chair, or eating dog poop, or shaving my eyebrows off, I would offer to do all of those things. I had to sit through 3 hours of what could have been productive life but instead I was influenced to never get married or have kids and to perform seppuku. By watching this movie I dishonored my family. My mother left to work on a farm and my dog's leg just up n' fell off. When I took to the streets to find any kind of joy, I fell into a trash shoot and lived there for three weeks. I tried to crawl my way out but I had already chewed off my fingernails while watching this horrendous movie. Absolute feces.",
         "My children in their twenties and I went to see this movie, last Saturday (9:30 am showing) at the Penn Square Mall, in Oklahoma City. An older and wise woman, named Miss Clara who really made this movie work. A typical wife (like most of us) who works and takes care of the household. Through her job she meets Miss Clara. They immediately become friends. I laughed multiple times at some comedy lines. I cheered on wife, as I went through the same thing as her. Miss Clara starts to teach the wife how to fight for her marriage. My marriage has lasted 34 years with the main idea of this movie, it does WORK. A guy called into Klove Radio Station and said he saw this movie 4 times!\" Good for him! War Room came in #2 - as the Most Popular Movie - 8/28/2015 to 8/30/2015 opening weekend. War Room was estimated to make $10 Million opening weekend; it made $11 Million, probably more after Sunday.",
         "This movie came out at the right moment. When the trailer first came out you could see and feel the presence of the Lord on it. This movie has been a blessing. I was so happy to see this the #1 movie out after it opened. And at the time I'm writing this movie theaters are being added! This movie is about prayer as it says in the trailer and it makes sure you know it is. There are many precious moments. Some will make you cry, laugh, and then think. It will make you re-evaluate your life. Every couple, dating or married; child and friend, Black, White, Asian, Hispanic and any other race should see this movie. It is helpful on so many levels. Those who are not Christian might not like this, but some might. So check it out while you can. There truly is power in prayer.",
         "This is a rare movie that focuses strongly on belief in God and miracles. As such, it is typical that anyone that doesn't believe will give it a low rating. But if you can open your mind to possibilities that there is something more out there than what the modern world is telling us, please watch this, and allow yourself to be open to the idea. Science cannot explain everything, and is often wrong. After all, the world was absolutely flat at one time. I can say that I spent most of my life as an Agnostic, but events in my life unfolded in a way that I could no longer ignore what was in front of my face, and when I opened my mind to the possibility, amazing things happened. This movie tells a story that is VERY close to my own path, and I found myself jaw-dropped moment after moment as I saw parallels to my own life. In my case, it was even worse than what the family in the movie went through, but after letting go fully, our family reached the same ending as this movie. That said, there is more out there, and this movie is absolutely amazing if you can open your mind to the possibility that there is more out there. Still speaking to these with closed minds, consider how difficult it is to have faith, but how easy it is to have fear. But if you really think about it, both faith and fear feed off the same energy of something that us unknown and cannot be seen. Only fear is a negative and faith is a positive.",
         "I have nothing against Christians or faith based movies. Some of my favorite films are the biblical epics from the 50s and 60s. other movies like It's a Wonderful Life has God in it, but doesn't cram the bible down the viewers throats. And then you have this kind of movie, that are just propaganda pieces for the kind of Christianity that I hate: The kind that lives in the past, the kind that take the bible way to seriously, the kind that refuse to acknowledge equal rights to homosexuals and woman, the kind that does not vaccinate their children against diseases. The kind who would beat you if you say something that is against their religion. This kind of people made this film and it is made especially for them. It is not that I am against religion or that this review is anti-religion. It is because that War Room has one of the worst morals that I have ever seen in any movie. The plot of the movie is about a family with marriage problems. Not the normal kind of problems, but the extreme kind. The husband Tony is verbally abusive against his wife Lis, ignores his daughter, doesn't communicate with his family and is about to cheat on another woman. Lis is an real-estate agent, and Tony is an salesman for an medicine company (we know this because every time someone introduces himself, thy say the full name and the kind of job the person has). Lis is about to sell the house of an elderly woman named Miss Clara. She tells her of her praying technique called the War Room, in which she hangs her prayers on a wall in an empty closet, and asks God and Jesus to solve her problems. Lis learns from miss Clara that it is not Tony's fault that he is an cheating bastard, it is Satan's fault, so she has to pray for Tony. While this is happening, Tony has an date with another woman. Clara heard from it and prays to God to intervene. God gave Tony food poisoning, which stops Tony of cheating on his wife. Tony gets fired of his job, because he sold drugs of market without the company knowing it. He returns home, sees the war room, and begs for forgiveness to his wife, who tells that God is the most important person in her life, but it is because of God that she has her marriage. Tony spent some time with his daughter, and brings back the stolen drugs to his boss, who decided not to press charges on Tony for steeling. The marriage is saved, and miss Clara is happy to see it, and the film ends with her in her new war room, where she prays to God to rise up an army of believers to fight up against the forces of evil. This film is awful. The acting is bad. Most of the people in this movie are not even actors, but public speakers for the church. There is no connection between the people in this film. I never believed for one second that Tony, Lis and their daughter are related, because they act like thy have seen each other on just one day. I want that this ends in divorce, but this film make it clear that divorce is not an option here. The dialog is and feels unnatural. Miss Clara always uses war analogies (like prayer is a powerful weapon), the kind that makes you scared. Nobody takes any responsibility, everything is grace. This movie has a TV quality to it, it has no reason to be not direct to DVD. The prayer technique is offensive and dumb. The marriage problems are solved in the first 60 minutes, and the rest of the hour is nothing but padding. And the has about 3 points where you think the movie would end, but then you see that it is still going. The moral is insulting. The moral is as followed: If your husband is verbally abusive, and is distrustful to you, don't call for therapy, don't talk it out. Just empty out your closet, act like a floor mat and pray to God to solve your problems, not for yourself, but for your cheating husband. And the fact that this movie is an box office hit and that some people really like this movie baffles me. Skip this film at all costs. It is propaganda.",
         "Not one of those \"feel good\" movies just because it's faith based, but one that inspires and encourages the viewer to step out in faith and actually live in the world according to God and not man. Some may think the plot is too good to be true, but it isn't. I've been in both of the leading women characters' shoes, and it is real. It is true. The Kendrick Brothers are getting better and better with each movie they make at bringing real life to the screen and keeping it real once it gets there. If you are a believer in Jesus Christ, you'll love it. If you are not, then you'll probably fight against it. But one thing you cannot do is deny the power of prayer after you've seen it.",
         "I must admit I don't pray very often. In fact as an intelligent adult I put more faith in hope, chance and coincidence than in prayer. This film needs a spoiler alert. It didn't alert me and my evening's viewing was spoilt - which is surely the raison-d'etre of spoiler alerts. So I do pray ... that IMDb will add the category Religious Drama, rather than simply Drama for this type of movie. After all we already have a Fantasy section, and this needs a genre all of its own. It doesn't proselytise - meaning try to convert someone. It simply offers the premise that for all your household needs... whites whiter and coloureds brighter ... prayer is the one and only answer. So, in the end, it's not for anyone at all who doesn't already believe a whole, and I mean really whole, lot. An enormously whole lot. A lot.",
         "I just finished watching this movie with my wife. If you have seen and liked \"Fireproof\" or \"Facing the Giants\" from the Kendrick brothers, then you're going to love, love, love this movie. While a movie about prayer may seem like a boring concept (I almost didn't see it because of its theme), trust me, believers everywhere are going to be so blessed, touched, and inspired by this movie. I kid you not, but people were literally shouting \"Amen!\", \"Hallelujah!\", and \"Glory!\" in the movie theater (in Amarillo, TX). My wife and I laughed, cried, and rejoiced throughout the movie. When it was over, I believe that everyone clapped for a good 30+ seconds. That's how good it was. Even when the credits were rolling, no one moved for about a minute or so since we were trying to absorb and process the impact of this movie. I won't reveal any spoilers, but suffice to say that this is a movie about a lukewarm Christian family dealing with a crisis. An old Christian lady intervenes and offers some advice to the young Christian mother. That advice ends up transforming so many lives. If you or your family are struggling with anything right now, then do yourself a favor and go see this film. You won't regret it. I honestly believe that this might be the Kendrick brothers best movie yet -- and that says a lot since their previous films have been simply terrific and inspiring. Thank you Kendrick brothers for making this beautiful and powerful film! 9.5 out of 10 (my wife rates it a 10 out of 10)!",
         "Well, if I have ever left a movie inspired to make a change in my life, this is definitely the movie. We all need a \"war room\" in our homes. My dad and I said tonight after the movie that it would be cool if Christian families designed house plans that included a \"war room\" in the center of the home. I have the perfect room in my house. So many things in this movie are true to life...real situations for real people. It calls Christians to action in a powerful way. My dad, who is not a \"cry-er\" actually teared up a couple of times. He said he almost lost it and let the tears flow. Being the manly man he is, he restrained himself. I told him to let it flow! If you will, Please go see this movie and do not listen to the reviews of the \"critics\" because that is evidently what they are....critical....critical of anything that would glorify my God.",
         "For being a movie on such a low budget the acting was very convincing, the technical resources are good too, even though they're not the main focus on this movie but the plot and the story line are. It's an easy to understand and to relate story, a common problem: a family that is going through some struggles and problems. I have seen quite a few Christian movies and independently of their quality they all have been blessings in my life but I was particularly moved by this one since it does not have an all to subtle message which I love and whole hardheartedly believe we need more forward messages like that.. I feel so encouraged because it may be a fictional story but the facts are real and whoever knows the Lord knows the power of prayer and knows that our fight is in prayer... This is a powerful movie that should be shared with anyone and anywhere..",
         "KUDOS to the Kendrick brothers! While we have promoted and seen all of their movies, War Room is one of the most profound, heart wrenching, impactive depiction of the dire need for prayer. An individual has to be spiritually blind and unregenerate not to discern the message in this movie. This movie has the potential to galvanize and bring about a proliferation of desire exemplified in a strategic and tenacious prayer life. Movies such as War Room will penetrate the very portals of Hollywood as well as the world. Because, the Word of God shall not return void through this medium of evangelistic outreach. We are prayerful that the message these movies portray will incarcerate the spirits of the hearers. Since the world's status is one of moral degradation and every man does what is right in his own eyes, it is of uttermost importance that the Kendrick brothers continue to produce movies of this caliber.",
         "'WAR ROOM': Two and a Half Stars (Out of Five) Another Christian drama flick, from the 'Kendrick Brothers'; the team that's also responsible for such previous 'worship-themed' films as 'FIREPROOF' and 'COURAGEOUS'. Alex Kendrick directed and co-wrote the movie, and Stephen Kendrick co-wrote and co-produced it. The story revolves around a couple, that turns to God; to fix their struggling marriage, with the help of an older, wiser, woman (named Miss Clara). The film was made on a budget of just $3 million, and it stars a cast of mostly unknown actors. I think it's a fairly decent Christian movie; compared to other, much worse, ones (I've seen recently). Tony (T.C. Starling) and Elizabeth Jordan (Priscilla Shirer) seem to have it all; a nice house, two great jobs, and a polite young daughter (Alena Pitts). The couple are not happily married though, and their daughter feels resented. When Elizabeth, a realtor, attempts to sell a house, for a nice (older) lady, named Miss Clara (Karen Ambercrombie), she's inspired to renew her faith again. By doing so, Elizabeth also finds the courage to fix her troubled marriage; and save her struggling family. The movie is filled with some cheesy dialogue, and bad acting (at times); but it also has a few good performances, and some inspiring moments (especially for those of faith). The low-budget shows, and it does feel (a lot) like a TV movie; but the film is still better than other Christian-themed flicks (that I've seen, in the past few years). It has a good message, and it's at least somewhat inspiring. Probably not something that will interest non-believers (at all); but it's target audience, should be more than pleased. Watch our movie review show 'MOVIE TALK' at: https://youtu.be/3D-Xa6uhK5U",
         "Despite the negative reviews I had read, I went anyway. I loved it, War Room was powerful, outspoken and the Holy Spirit was all over it! I recommend it to anyone who loves the Lord or at least has an open heart for Jesus. The cast does a great job conveying the message, you will have goosebumps the whole time and may even shout \"Hallelujah\"! Or, you may cry through the entire movie. I love Ms.Clara, she is an amazing prayer warrior. The Kendrick Brothers did not hold back, the movie is has the right amount of drama, humor and love. The depiction of the true power of God is evident. If you do not love Jesus, or have any problem with God, may find issues, just saying.",
         "The Kendrick brothers are improving with each movie they do. This one is the best I've seen of theirs. The story is well written with a great message. There is some fantastic humor in it as well. Priscilla Shirer is not only an excellent teacher but this movie shows she is also a great actress. This movie is a great movie for anyone struggling in marriage. I'm sure that the professional reviewers won't have much good to say since they have traditionally shown their distaste for anything Christian but for those of us looking for a good movie with a good message, this movie delivers. Alena Pitts is the cutest little darling and knows how to melt your heart with her eyes. The Jordan family is a typical family in many ways including marital struggles. Miss Clara is an caring and powerful older woman who shares her wisdom in wonderful ways. She's a brave Christian who isn't afraid to share her faith and what's she's learned about fighting for a marriage. GREAT movie!",
         "If you're going thru a struggle or struggles in your life and you feel you've exhausted all options, and yourself, you're most likely missing this one. This movie shines a light on how to fight! How to let God fight for you. How when you're in the struggle you start ignoring how your actions are affecting others in you life. It had just enough humor to allow people to laugh at themselves. Reminded me of what my prayer life use to be and how I need to get alone, get quiet and meet with Jesus. I recommend this movie to believers and non-believers. You might learn something.",
         "At 57 years of age, I have seen quite a few movies, some good, some bad, but none quite like War Room. This has to be one of the best, if not THE best move I have ever seen. The plot is fantastic and the message is one of great importance, especially today. It is a movie you will want to see with your whole family. With a family that is broken in many ways, from the parents to the child, it would appear they are heading for a rough road ahead, one that will hurt all involved. You see this all to often all around you. However, with the help of a wise older women, one who had her share of troubles, many self inflicted, and a hard past... she has learned how to overcome and now is wanting to find others, just like herself, to teach the lessons she has learned so well over the years. I know that I learned from her as well just watching this movie. If people actually took this movie to heart, it could change their lives, the lives of their families, and even extend to their community. I highly recommend War Room, it is an amazing movie."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "FaithStep Films",
         "Affirm Films",
         "Red Sky Studios"
      ],
      "summaries": [
         "Filled with heart, humor, and wit, WAR ROOM follows Tony and Elizabeth Jordan, a couple who seemingly have it all-great jobs, a beautiful daughter, their dream home. But appearances can be deceiving. In reality, their marriage has become a war zone and their daughter is collateral damage. With guidance from Miss Clara, an older, wiser woman, Elizabeth discovers she can start fighting for her family instead of against them. As the power of prayer and Elizabeth's newly energized faith transform her life, will Tony join the fight and become the man he knows he needs to be? Together, their real enemy doesn't have a prayer.",
         "With great jobs, a beautiful daughter (Alena Pitts) and a dream house, the Jordans seem to have it all. Appearances can be deceiving, however, as husband Tony (T.C. Stallings) flirts with temptation and wife Elizabeth (Priscilla Shirer) becomes increasingly bitter, crumbling under the strain of a failing marriage. Their lives take an unexpected turn for the better when Elizabeth meets her newest client, Miss Clara (Karen Abercrombie), who encourages the couple to find happiness through prayer.",
         "A seemingly perfect family looks to fix their problems with the help of Miss Clara, an older, wiser woman."
      ],
      "budget": 3000000
   },
   "movielensId": 141668,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-08-28",
      "dvdReleaseDate": null,
      "directors": ["Alex Kendrick"],
      "runtime": 120,
      "movieId": 141668,
      "title": "War Room",
      "mpaa": "PG",
      "actors": [
         "Priscilla C. Shirer",
         "T.C. Stallings",
         "Karen Abercrombie",
         "Beth Moore",
         "Michael Jr.",
         "Jadin Harris",
         "Tenae Downing",
         "Alena Pitts",
         "Alex Kendrick",
         "Dave Blamy",
         "Thomas Ford",
         "Terrence Evans"
      ],
      "imdbMovieId": "3832914",
      "originalTitle": "War Room",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["mIl-XY9t_Lw"],
      "plotSummary": "The family-friendly movie explores the transformational role prayer plays in the lives of the Jordan family. Tony and Elizabeth Jordan, a middle-class couple who seemingly have it all – great jobs, a beautiful daughter, their dream home. But appearances can be deceiving. In reality, the Jordan’s marriage has become a war zone and their daughter is collateral damage. With the help of Miss Clara, an older, wiser woman, Elizabeth discovers she can start fighting for her family instead of against them. Through a newly energized faith, Elizabeth and Tony’s real enemy doesn’t have a prayer.",
      "tmdbMovieId": 323272,
      "avgRating": 3.53846,
      "releaseYear": "2015",
      "numRatings": 65,
      "posterPath": "/ufyybGW3q0wbATNg03geeSEdsDo.jpg"
   }
}