{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt3480158",
      "video": false,
      "title": "Return to Ithaca",
      "recommendations": [],
      "backdrop_path": "/3ppD9glO5QTT8w2stgnHjndVcHv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "5434ea750e0a26587200a7ee",
               "name": "Isabel Cristina Santos Téllez",
               "profile_path": "/eso7r38OawlMouXLgAZhhurruSs.jpg",
               "id": 1108277,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "5434ea90c3a36831a600bbfc",
               "name": "Jorge Perugorría",
               "profile_path": "/k12HtTuSZO5bxN48GDy9l9dTucS.jpg",
               "id": 64846,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "5434ea99c3a36831a900b7ba",
               "name": "Fernando Hechavarría",
               "profile_path": "/4ukuvYMSkuNjkOktTyRC8ugDQFp.jpg",
               "id": 1372193,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "5434eaae0e0a2658b200a7de",
               "name": "Néstor Jiménez Rodríguez",
               "profile_path": "/bWzaVAAISHzE8r6MczWGbypRB8x.jpg",
               "id": 1372194,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "5434eab70e0a2656e200a990",
               "name": "Pedro Julio Díaz Ferrán",
               "profile_path": null,
               "id": 1372195,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53d7f8530e0a26033a002487",
               "name": "Laurent Cantet",
               "profile_path": "/onJlJsEQHDK7j8F59eoUtEy3njL.jpg",
               "id": 17386,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "553915009251412d91005c3b",
               "name": "Laurent Cantet",
               "profile_path": "/onJlJsEQHDK7j8F59eoUtEy3njL.jpg",
               "id": 17386,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5539150b92514138a9002ac8",
               "name": "Leonardo Padura",
               "profile_path": null,
               "id": 1003937,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5539151a925141275e0017ba",
               "name": "Diego Dussuel",
               "profile_path": null,
               "id": 1151389,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.701798,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 284290,
      "vote_count": 7,
      "budget": 0,
      "overview": "Sun is setting on Havana. Five friends are gathered to celebrate the return of Amadeo after 16 years of exile in Madrid.",
      "similar": [],
      "original_title": "Retour à Ithaque",
      "runtime": 95,
      "poster_path": "/phbqjgKDrj0iTU449CVEcTWpDjD.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Orange Studios",
            "id": 15433,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Full House",
            "id": 17041,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Haut et Court",
            "id": 726,
            "origin_country": ""
         }
      ],
      "release_date": "2014-10-30",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Laurent Cantet"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Laurent Cantet",
         "François Crozade"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt3480158/",
      "coverLink": null,
      "actors": [
         "Jorge Perugorría",
         "Isabel Santos",
         "Néstor Jiménez"
      ],
      "reviews": [
         "As a starting point, let us say that \"Return to Ithaca\" is not a movie that will please all audiences. This new film by Laurent Cantet (\"Human Resources\", \"The Class\") certainly does not offer a spate of spectacular, violent or erotic scenes. Moreover, it is spoken in Spanish and does not exist in dubbed version. Its target is obviously not the general public, consequently total fans of blockbusters or any other type of light entertainment fare should avoid this one. For if you do not get into the film, you are bound to get awfully bored. But if you know a minimum about Cuba's recent history and - mainly - about human relationships, \"Return to Ithaca\" will not only satisfy you but will end up enthusing you as it is true that in the two fields mentioned it is a masterful achievement. More generally speaking, you will remember \"Ithaca\" as a particularly rewarding experience given its amazing capacity to work on different levels (narrative, technical, psychological, historical, sociological) at any second of its running time, leaving you in the end with a single wish, to see it again. One of the few criticisms made to the film is its theatrical form, giving rise to the usual (or should I say inescapable) derogatory term of \"filmed play\". One can wonder why the locution appears under the critic's pen as soon as there is unity of time, place and action or when the director has dared adapt a stage play ? As if cinema and theater were mutually exclusive! Don't some filmed plays contain more \"cinema\" than certain movies in wide screen changing settings - natural or artificial - every five minutes ? and the reverse. I personally experienced more thrills watching \"chamber movies\" like \"Twelve Angry Men\" or \"Death and the Maiden\" than \"The Ten Commandments\" and the like. So let's brush aside this phony argument and let's try and analyze \"Return to Ithaca\" for what it is, a powerful exciting thought-provoking apologue. To begin with, what is the situation and who are the characters ? The time is one warm evening these days, the place a terrace overlooking Malecon Boulevard in Havana. Three friends are gathered there waiting for Amadeo, a novelist suffering from writer's block, back in Havana after sixteen years of exile. Before his coming, Tania, Rafa and Aldo drink, laugh, dance, exchange happy memories. After Amadeo finally drops in, Eddy, another seemingly jolly good fellow, joins the party, which soon... turns sour. Little by little, the five revelers' social conditions and inner feelings are revealed: Tania is an embittered eye doctor who only ekes out a living; Rafa, a once major artist, has become an alcoholic and is now reduced to painting daubs; Aldo, an honest man , does nothing better than mount batteries in a factory despite his engineer's training. As for Eddy, a genuine literature lover, he has been a self-satisfied parvenu for years... From dusk to dawn, the complicit old friends will turn accusers; of the failed Revolution, of themselves and their past naiveté, and above all of... the four others. With a few exceptions (the dinner taken in Aldo's apartment), tensions prevail; rage breaks out : the five of them tear each other apart in a cruel game of truth. As the day breaks, they are still together, exhausted, wondering if their friendship will survive the psychodrama they have just gone through. And as the end credit rolls, the viewers, shaken as they are, realize how irrelevant it is to reason in terms of \"filmed play\". Watching people talking for the whole duration of a film is not necessarily boring. A movie will never be dull if - as is the case here - the topics broached are intelligent, if they are source of conflict, if there are hidden truths that are doled out shrewdly, if the tone varies constantly from exhilaration to depression, if there is singing and dancing and anger and wit and spite, if the camera moves are slick, if the editing is dynamic. Last but not the least when like here - the lines of dialogue signed by a great Cuban novelist (Leonardo Padura) are told so brilliantly by a pocketful of the best Cuban actors of the time (of Isabel Santos, Jorge Perugorría, Fernando Hechevarria, Nestor Jiménez and Pedro Julio Diaz Ferran I really cannot say which one is my favorite). A real masterpiece, reminiscent of Tchekhov's dramas or classics of the Italian cinema such as Ettore Scola's \"We All Loved Each Other\". An all the more impressive feat as \"Return to Ihaca\" is directed by a French filmmaker, who seems as comfortable in the circumstances as if he were Cuban-born. Highly recommended except, as I wrote before, if you are a confirmed popcorn movie lover.",
         "Cuba is a country that has always aroused much curiosity and interest of the people, either for its spectacular beaches or its culture and very peculiar history. Located in the Caribbean Sea, in the half of the twentieth century, the island undergone a revolution that would change the direction of Latin America, establishing and living the socialist regime since then. Thus, nothing more natural than the desire to know a little of the reality of the cubans. And this is exactly what the film Retour à Ithaque (in the original) or Return to Ithaca (in English) does: provides us with an understanding of the state of mind of the local population. The director is the french Laurent Cantet, known by its renowned Entre les Murs (The Class - 2008). The story is set on the terrace of a building on the seafront in Havana, where five friends from youth, Rafa (Fernando Hechevarria), Tania (Isabel Santos), Aldo (Pedro Julio Diaz Ferran) and Eddy (Jorge Perugorría), now in their middle-age, come together to celebrate the return of Amadeo (Néstor Jiménez), who has lived in Spain for 16 years. His return awakens many dormant feelings in the group: lost loves, longings, frustrations, guilt and confrontations. In this period of less than 24 hours between the early afternoon and dawn of the next day, their destinations, the challenges of the past and present come to light. The economic embargo imposed by the US government against Cuba brought grave consequences to the Caribbean country. The hardest period that the island known was the post-fall of the Berlin Wall, in the 1990s, with the end of the Soviet Union. The dissolution of Cuba's main trading partner caused a serious crisis in the cuban model, greatly impacting the lives of its inhabitants. During that time the protagonist of the story, Amadeo, left the country to live in Spain. The duality between stay on the island or get out of it is explicit in the attitude of each of the characters in the story. And here we are introduced to the sixth member of the plot: the city of Havana. The panorama from a terrace of a building in the old center of the cuban capital covers the film's photograph with each one of its most important attributes: people living their little lives; crumbling buildings that resist time, carrying the weight of remote and recent history; the Malecón, a concrete boardwalk that runs along the edge of town, establishing the physical and psychological barrier which begin and end dreams and possibilities of many cubans; and the sea, as a promise and challenge, the boundary that divides the island from the rest of the world. Cantet's direction produces an extremely vivid cinematographic array of rare authenticity and reality of scenes. Discussions are frighteningly credible, full of documentary features, with the camera circling the intimacy of the characters. The script, written with four hands by Laurent Cantet himself and also by Leonardo Padura (cuban author who gained notoriety with the book The Man Who Loved Dogs), contributes so that the dramatic narrative, filmed in one set, works. The story is engaging, cohesive and well written. In an interview to El País Padura told that the inspiration to compose the story came from one of his novels, La Novela de mi Vida. The actors, all cubans, gave convincing performances to their roles. With open scars and melancholy characters, they feel at the same time attraction and repulsion to the island, dream and disbelief. Return to Ithaca is a movie that may well portray the current Brazil, which flirted dangerously with fascism/socialism/populism in recent decades and now finds itself plagued by the social/economic/political chaos. The Brazilian population, as well as cuban, after having lived a moment of boom where everything seemed to work and that the nation finally seemed headed to be the \"country of the future\", see themselves deceived by false promises and realize that everything was no more than an utopia. The country (model) to be copied, the unwavering faith of the people in the \"savior\" of the fatherland and the joy of the people are some of the analogies that can be drawn between the two countries. In the midst of all this, both in Brazil and in Cuba, it is disillusionment, abandoned dreams and bitter life in which millions of people were sentenced. Return to Ithaca tells the story of five cuban friends who have lived, or rather survived, in Havana during the worst crisis in Cuba, which could well be the report of five Brazilians in the worst crisis in the history of Brazil. Originally posted in: https://vikingbyheart.blogspot.com.br"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Full House",
         "Orange Studio",
         "Haut et Court"
      ],
      "summaries": [
         "Amadeo, a novelist suffering from writer's block, is back in Havana after sixteen years of exile. This evening his friends are waiting for him on a terrace overlooking the Malecon Boulevard. There are Tania, who despite being an eye doctor only ekes out a living; Rafa, a once major artist who has become an alcoholic and only paints daubs now ; Aldo, an honest man who, although trained as an engineer is reduced to mounting batteries in a factory. They are joined after a time by Eddy, a literature lover turned parvenu... From dusk to dawn, they will laugh, sing, dance together, reminisce about their youth, the group they used to form, the faith they had in the future and exchange about their present disillusionment. At times they will even tear each other apart...",
         "Sun is setting on Havana. Five friends are gathered to celebrate the return of Amadeo after 16 years of exile in Madrid."
      ],
      "budget": 0
   },
   "movielensId": 141672,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2014-10-30",
      "dvdReleaseDate": null,
      "directors": ["Laurent Cantet"],
      "runtime": 95,
      "movieId": 141672,
      "title": "Return to Ithaca",
      "mpaa": null,
      "actors": [
         "Isabel Cristina Santos Téllez",
         "Jorge Perugorría",
         "Fernando Hechavarría",
         "Néstor Jiménez Rodríguez",
         "Pedro Julio Díaz Ferrán"
      ],
      "imdbMovieId": "3480158",
      "originalTitle": "Retour à Ithaque",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sun is setting on Havana. Five friends are gathered to celebrate the return of Amadeo after 16 years of exile in Madrid.",
      "tmdbMovieId": 284290,
      "avgRating": 3.375,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/phbqjgKDrj0iTU449CVEcTWpDjD.jpg"
   }
}