{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1730294",
      "video": false,
      "title": "For the Love of Money",
      "recommendations": [
         79255,
         44250,
         45602,
         181175,
         64832
      ],
      "backdrop_path": "/xM6o4bw9Bnmu8uAUdaC9Xp0PYtK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe4b0fc3a36847f81f020d",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Talia",
               "gender": 1,
               "credit_id": "59a2ec9d925141774b045b02",
               "name": "Inbar Lavi",
               "profile_path": "/mymW9BD3nTj2sHQkK9IBo3nLHmo.jpg",
               "id": 211596,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Hector",
               "gender": 2,
               "credit_id": "582f811a9251416380005142",
               "name": "Steven Bauer",
               "profile_path": "/2wbrq8xIKbIAQAgtxsftJT5XgVs.jpg",
               "id": 1159,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Micky",
               "gender": 2,
               "credit_id": "52fe4b0fc3a36847f81f0211",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Young Yoni",
               "gender": 2,
               "credit_id": "52fe4b0fc3a36847f81f0215",
               "name": "Jonathan Lipnicki",
               "profile_path": "/VIMgU625rNz8ApghgCBw6ELjOz.jpg",
               "id": 67778,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Mr. Solomon",
               "gender": 2,
               "credit_id": "59a2ecc8c3a368478f041687",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Red Parker",
               "gender": 2,
               "credit_id": "582f8142c3a3683b0500501b",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Levi",
               "gender": 2,
               "credit_id": "52fe4b0fc3a36847f81f0219",
               "name": "Oded Fehr",
               "profile_path": "/kiNGbfGzjbCKIAsdy0UcuzgGHRc.jpg",
               "id": 18041,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe4b0fc3a36847f81f0229",
               "name": "Leilani Sarelle",
               "profile_path": "/l3TFOLMHeONi5hTw2khu4BUnyxa.jpg",
               "id": 10485,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Aline",
               "gender": 1,
               "credit_id": "52fe4b0fc3a36847f81f022d",
               "name": "Delphine Chanéac",
               "profile_path": "/en21TtTTtWfTZ5yqCGW0FQ2acxn.jpg",
               "id": 118357,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b0fc3a36847f81f0209",
               "name": "Ellie Kanner",
               "profile_path": null,
               "id": 198612,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4b0fc3a36847f81f021f",
               "name": "Jenna Mattison",
               "profile_path": null,
               "id": 134134,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0fc3a36847f81f0225",
               "name": "Michael Micco",
               "profile_path": null,
               "id": 1059461,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.157944,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 112130,
      "vote_count": 10,
      "budget": 0,
      "overview": "Spanning over two decades, \"For the Love of Money\" follows the true account of an Israeli immigrant who searches for his piece of the American dream.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         242224,
         17130,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         297762,
         370663,
         1359,
         2252,
         1991,
         9654
      ],
      "original_title": "For the Love of Money",
      "runtime": 93,
      "poster_path": "/21UtuVwYMJbR59uxjlT6M1o5PAt.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2012-06-08",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "For the love of money is the root of all evil.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ellie Kanner"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Jenna Mattison",
         "Michael Micco"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1730294/",
      "coverLink": null,
      "actors": [
         "Hal Ozsan",
         "Inbar Lavi",
         "Edward Furlong"
      ],
      "reviews": [
         "\"A wise man once said the love of money is the root of all evil.\" Izek (Longo) is a young boy growing up in Tel Aviv. He is introduced to a life of organized crime at a very young age and has grown accustomed to it. After a member of his family becomes to involved in the world the family decides to movie to Los Angeles. Izek, looking to leave the world behind begins his new life and a quest to live American dream. I have to admit that if a movie is about organized crime in anyway I will watch it. When they are done right they are great, but the problem is that too many try to be \"Goodfellas\" and end up falling flat. While this movie isn't terrible it is also nothing amazing either. I think the biggest problem I had with this is that it didn't know what it wanted to be. Even though it is a true story it seemed like it was trying to hard to have the organized crime aspect (even having James Caan in it) but it didn't really fit in with the rest of the movie. I don't know how to explain what I mean but watch it and you will see. This is not a bad movie but it tended to drag a little and I was starting to lose interest in some parts. Overall, not bad but also a pretty flat movie that had more potential. I give it a B-.",
         "The production design was good. Excessive use of old songs though. Old music is welcomed even in a dentist's chair but they should feel natural. The actual people who's story this film tells may have struggled but it doesn't come out here. A few brothers and cousins go to another country, and a few good and a few bad things happen...Could be anybody's story. James Caan saved it. However, it tried to be The Godfather and that is something no film should attempt to do. Some parts cater to the nostalgia very well but for some reason the film feels like Styrofoam, you watch it and you don't know what to take home from it. Or may be it's just me. This is my first review I hope I haven't written anything that qualifies as spoiling.",
         "Those words that can put you off a movie entirely. Or if you didn't know at least realize during the movie, that they keep this from going places. While the fall of Edward Furlong is something happened a long time ago (climbing up, won't be easy and not achieved by movies like this) there are other great character actors in this, which make you wonder if the script or the overall idea sounded a lot better? Or maybe it was just the money/job opportunity they got from this. So James Caan and the others try to make this as respectable as possible, but the way things resolve is very anti-climactic. Maybe there are people out there that will like the approach and maybe this is as close to the true events as possible. It doesn't make for an enticing view though",
         "Being caught up in the Tel Aviv underworld of 1973 teenager Izek decides to emigrate to Los Angeles . Howeer he soon finds that crime is a universal aspect of the human condition and that in the United States the stakes are much higher Reportedly based on a true story FOR THE LOVE OF MONEY is a film where you're constantly reminded of the style of Martin Scorsese . Take for example the early scenes featuring Ed Furlong playing violent foul mouthed psychotic Tommy . Was there anyone not reminded of Joe Pesci ? Likewise the constant use of a musical soundtrack and narration gives the impression director Ellie Kanner is trying to emulate Scorsese down to a tee but at the same time you're constantly reminded that you're most certainly not watching Scorsese I also had a slight problem with Izek who is maybe a little bit too stand up and self righteous to be taken seriously especially since he's supposed to be based on a real life character . Take for example the scene where he agrees to be a get away driver for two characters he knows are gangsters . They go round to someone's business to extort money , beat the victim to a pulp and when they go back to the car Izek remonstrates and leaves them . Let me get this straight , he knows they're violent criminals and he's upset they batter people half to death . It's not like the job description advertised \" Driver for Mr Whippy's ice cream van required \" . I think Izek is spinning himself as being a bit too innocent . That said it was the same in GOODFELLAS FOR THE LOVE OF MONEY isn't a a bad film just an over familiar one with a slightly cynical air where the big names such as James Caan and Paul Sorvino seem to be included for a marketing excises and Sorvino especially is confined to a blink and you'll miss it cameo . That said despite the flaws Ellie Kanner does bring a sense of time and place to the proceedings and it does genuinely look like a 1980s movie . Just a pity there isn't a more idiosyncratic flourish to the movie that feels to need to ape Scorsese in everything",
         "The description of this movie makes it sound lively and action-filled. In fact, it is slow, uneven, and devoid of character development. I kept wondering if the people in the film were actors. James Caan does a good job, but it isn't enough to save this. The ending is sappy. If you want entertainment, go someplace else. Don't even bother popping popcorn.",
         "For the love of god, this film was not good. This film sucked. I know it was based on a true story and all, but the entire thing felt so melodramatic and fake. The acting was decent across the board and I wasn't pleasantly surprised at anything in the entire film. I guess it's about a man and his family coming to America in search of the American dream, which it doesn't feel like. The movie doesn't flow, it doesn't move forward, it feels like it's stuck in park. There is no logical progression of events, everything is disjointed and hard to follow. Like, really hard. It is a shameful dollar store knockoff of Goodfellas, which is amazing. This? No. Poor direction, poor writing, way melodramatic, not enough depth in characters, the lead has no personality, the ending is cliché and not concluded well, there are so many issues. I only watched it because of Edward Furlong, and he's only in the movie for like 5 minutes. Overall, bad movie. Why watch this when you can watch Goodfellas?",
         "This film seems to have everything going for it. Good production value, nice nostalgia, great and accurate time warping, good play by good actors, lovely cars and great music memories. So obviously what's not working here is the drive of the story. A pity because this could have been really good. However, it you looking for a drama more than a action movie, there's a good chance you'll be quite satisfied. A story based on real life events. We meet a couple of Israeli boys growing up in Tel Aviv, later on moving to L.A. To experience the American dream. Being successful with starting burger bars, going further on to dealing with cars, we follow the rise of gangsters. Being stupid enough to not showing the right amount of respect for Levine, they get into deep trouble. The story is told like many well known gangster movies. I love James Caan's role as the mob boss Mickey Levine here. He is excellent! The main film makers behind this female, and you might feel that. If you see this as a drama, and don't compare it to the gangster movies it pretends to follow I the line of, this is quite good film making."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "All Cash Productions",
         "Cheshire Smile Productions"
      ],
      "summaries": [
         "Spanning over two decades, \"For the Love of Money\" follows the true account of an Israeli immigrant who searches for his piece of the American dream. The story begins in Tel Aviv in 1973, where a young Izek is raised in a seedy, gangster filled illegal casino that operates behind his family's bar. The casino is a haven for unsavory characters who seek to corrupt him to their way of life. When the violence and crime finds its way to him and his family, Izek (Yuda Levi) and his family relocate to Los Angeles. Hoping to start anew, he pursues his ambitions to become a young entrepreneur by developing small businesses, purchasing real estate, and running an auto repair shop. Success seems to find him at every turn and after falling in love with the beautiful Aline (Delphine Chaneac), luck seems to be on his side. However, it isn't long before the world of crime that Izek tried to escape so long ago continues to doggedly follow him every step of the way. Threatened by a dangerously temperamental gangster (James Caan), his criminal cousin (Oded Fehr), and even a Colombian drug lord (Steven Bauer), Izek finds that starting fresh with a clean slate is all but impossible. As those close to him fall victim to the promises of quick money by the way of the gun, violence surrounds Izek until he has no choice but to confront it. \"For the Love of Money,\" is a true story of crime, family, love, loss, and the temptations of easy money, based upon the life of executive producer Izek Shomof.",
         "Based on a true story. One man, Izek, leaves his old, seedy, gangster filled lifestyle to start over with his family. After relocating to Los Angeles it isn't long before the world of crime that he tried to escape finds him. Threatened by a dangerously temperamental gangster, his criminal cousin and a drug lord, Issac finds starting a fresh start almost impossible. As those close to him fall victim to the promises of quick money by the way of the gun, violence surrounds him until he has no choice but to confront it. He'll do whatever it takes to keep those close to him safe even if it means going back to his old ways.",
         "One man leaves his old gangster lifestyle for a fresh start. As his past creeps up, he'll have to protect his family, even if it means going back to his old ways. Based on a true story."
      ],
      "budget": 0
   },
   "movielensId": 141658,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2012-06-08",
      "dvdReleaseDate": null,
      "directors": ["Ellie Kanner"],
      "runtime": 93,
      "movieId": 141658,
      "title": "For the Love of Money",
      "mpaa": "R",
      "actors": [
         "Edward Furlong",
         "Inbar Lavi",
         "Steven Bauer",
         "James Caan",
         "Jonathan Lipnicki",
         "Jeffrey Tambor",
         "Paul Sorvino",
         "Oded Fehr",
         "Leilani Sarelle",
         "Delphine Chanéac"
      ],
      "imdbMovieId": "1730294",
      "originalTitle": "For the Love of Money",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["0J7tI4WCVNU"],
      "plotSummary": "Spanning over two decades, \"For the Love of Money\" follows the true account of an Israeli immigrant who searches for his piece of the American dream.",
      "tmdbMovieId": 112130,
      "avgRating": 2.66667,
      "releaseYear": "2012",
      "numRatings": 3,
      "posterPath": "/21UtuVwYMJbR59uxjlT6M1o5PAt.jpg"
   }
}