{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "video game",
            "id": 282
         },
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "street fighter",
            "id": 10076
         },
         {
            "name": "based on video game",
            "id": 41645
         }
      ],
      "imdb_id": "tt0185708",
      "video": false,
      "title": "Street Fighter Alpha - The Movie",
      "recommendations": [
         16228,
         12613,
         36247,
         60965,
         229979,
         76340,
         68919,
         92117,
         16767,
         36212,
         26626
      ],
      "backdrop_path": "/2WckFehKvLPClGuQEpzRFJYrPX6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ryû (voice)",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f363",
               "name": "Kane Kosugi",
               "profile_path": "/5px5s4CQI5RdO8sX0wbGJEBx6EW.jpg",
               "id": 65198,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ken Masters (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f367",
               "name": "Kazuya Ichijō",
               "profile_path": "/yeQdcpjAVdWCOapqmgpdBALcWWD.jpg",
               "id": 81857,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chun-Li (voice)",
               "gender": 1,
               "credit_id": "52fe47259251416c7508f36b",
               "name": "Yumi Touma",
               "profile_path": "/4R0uvJ5d4deDQEEzRGgLzXlMuKm.jpg",
               "id": 81858,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gouki (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f36f",
               "name": "Tomomichi Nishimura",
               "profile_path": "/kZXRpvXwI0F1qbKNff3dOG2BodA.jpg",
               "id": 81859,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rose (voice)",
               "gender": 1,
               "credit_id": "52fe47259251416c7508f373",
               "name": "Ai Orikasa",
               "profile_path": "/snZfaBRhSHr54pTAi05KSDWxYxG.jpg",
               "id": 81860,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sakura Kasugano (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f377",
               "name": "Chiaki Ōsawa",
               "profile_path": "/lQwd3esGm4E4CJakzfXW2pTQiwh.jpg",
               "id": 81861,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Shun (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f37b",
               "name": "Reiko Kiuchi",
               "profile_path": "/ajBEM87moHinOke3t18fk5lP83K.jpg",
               "id": 81862,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Gôken (voice)",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f37f",
               "name": "Ken Yamaguchi",
               "profile_path": "/tyXxsSqW20442XIhmqW4Ihrfjck.jpg",
               "id": 81863,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Balrog Fabio La Cerda / Dan Hibiki (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f383",
               "name": "Kazuyuki Ishikawa",
               "profile_path": "/xrnDQn8efeJCZ2YUCbTZ4HEBD8Q.jpg",
               "id": 81864,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Zangief (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f387",
               "name": "Hidenari Ugaki",
               "profile_path": "/1UHwhnw0EXfXJQ6bps5d8P7jxUf.jpg",
               "id": 81865,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Professor Sadler (voice)",
               "gender": 0,
               "credit_id": "52fe47259251416c7508f38b",
               "name": "Daiki Nakamura",
               "profile_path": "/z6EgWIVXYFs1VztcOxwBUU2d0C7.jpg",
               "id": 81866,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Kei Chitose (English Version, voice)",
               "gender": 1,
               "credit_id": "5aaf582392514116ba03182b",
               "name": "Sherry Lynn",
               "profile_path": "/kQDSC2z7sb6S5HcpOH6cmeJokKE.jpg",
               "id": 214701,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f35f",
               "name": "Shigeyasu Yamauchi",
               "profile_path": null,
               "id": 81853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f391",
               "name": "Haruyo Kanesaku",
               "profile_path": null,
               "id": 1690,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f397",
               "name": "Yutaka Maseba",
               "profile_path": null,
               "id": 1692,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f39d",
               "name": "Kaoru Mfaume",
               "profile_path": null,
               "id": 1127657,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f3a3",
               "name": "Marvin Gleicher",
               "profile_path": null,
               "id": 1127658,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f3a9",
               "name": "Yoshiki Okamoto",
               "profile_path": null,
               "id": 958507,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f3af",
               "name": "Kazushi Torigoe",
               "profile_path": null,
               "id": 1127660,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f3b5",
               "name": "Hayato Matsuo",
               "profile_path": null,
               "id": 1149582,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe47259251416c7508f3bb",
               "name": "Reiko Yoshida",
               "profile_path": null,
               "id": 78373,
               "department": "Crew",
               "job": "Script"
            },
            {
               "gender": 0,
               "credit_id": "530d1d00c3a3685c20001745",
               "name": "Joe Romersa",
               "profile_path": "/4hgdyGgqWcOSiRHVbCfaj46HggI.jpg",
               "id": 16147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "530d1d24c3a3685bfb001777",
               "name": "Kirk Thornton",
               "profile_path": "/xr9rvRWhj8BiLUxiONexlMi8HKi.jpg",
               "id": 81382,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "530d1d4dc3a3685bf40017ee",
               "name": "Reiko Yoshida",
               "profile_path": null,
               "id": 78373,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 1.799924,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 17433,
      "vote_count": 20,
      "budget": 0,
      "overview": "Increasingly disturbed by the dark energies building within him, Ryu is confronted by Shun, a boy claiming to be the brother he never knew. But before Ryu can consider whether Shun's timely appearance might be more than coincidental, Shun is kidnapped by Shadowlaw. To recover Shun, Ryu must undertake the ultimate journey of self-discovery and learn to control the power threatening to consume him.",
      "similar": [
         9053,
         11841,
         55292,
         9461,
         251516,
         15268,
         146,
         68735,
         11770,
         24,
         140300,
         9502,
         604,
         682,
         605,
         11667,
         7549,
         9312,
         42194,
         12279
      ],
      "original_title": "ストリートファイターZERO",
      "runtime": 100,
      "poster_path": "/e1LkneZ8fpbs9yTPeASdL7iXXXM.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Group TAC",
            "id": 5397,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Capcom",
            "id": 7220,
            "origin_country": ""
         }
      ],
      "release_date": "1999-12-22",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": "/kkUdnFLEwzHPU8medJE2Vn4pm1B.jpg",
         "name": "Street Fighter (Animated) Collection",
         "id": 190435,
         "poster_path": "/zrX0hsl3ny8WWCe5ww5PZlHgjjc.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Shigeyasu Yamauchi",
         "Masahiro Hosoda"
      ],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Takashi Nishiyama",
         "Hiroshi Matsumoto"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0185708/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg0MjIyODIxNF5BMl5BanBnXkFtZTcwMTQ1OTAzMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kane Kosugi",
         "Kazuya Ichijô",
         "Yumi Tôma"
      ],
      "reviews": [
         "Okay, granted, this animated film is based upon an arcade game. Not just an arcade game--an arcade *fighting* game. The requirements for a good arcade fighting game (especially back when Street Fighter set the standards) did not involve having a plot. If it played well and was fun, then you had a hit. It's a given that to make a film the creators are going to have to expand on the three sentences of backstory each character has, and the equally shallow endings they all have; sometimes even substancially change them . . . so why did they feel it necessary to invent a whole new villain with artificial fighters at his disposal? No. Granted, I haven't played the original SF Alpha in ages, but I recall Bison (generally speaking) still being the villain in the Alpha/Zero series (yes, I know, not everyone fought Bison in the first one). I can understand them not wanting to introduce Bison in this film to preserve the storyline of the existing SF Anime, but you still have Sagat from SF1. Heck, this film even brings up Akuma (who would have made an excellent lead villain if given the spotlight) but he's not pursued. Instead we're stuck with a throwaway guy no one cares about who has no connection to the Street Fighter game universe. The only thing worse is they don't make much attempt to make him or his underlings as interesting as the \"true\" SF characters. He's just a cliche mad scientist. That's all. Then the presence of annoying existing SF characters doesn't help either. I hated Sakura in the game; I hate her in the anime. Ryu's brother issue started out all right; however, it quickly dissolved into meaningless drivel as the \"plot\" involving the \"villain\" consumed him. Much of Street Fighter Alpha/Zero's vast cast of characters is not utilized (understandably so considering the volume of faces they've developed over the years), but even the ones who are really don't do much but get beat up until Ryu overcomes his inner demons, discovers the true warrior spirit, yadda, yadda, yadda, and ultimately saves the day. Every Street Fighter player knows that Ken is just as bad as Ryu, if not he's even badder; they even fight to a standstill in this, and yet Ken can't put a dent in the android/robot/artificial guy/whatever he was supposed to be? No. If nothing else, Ken would be able to severly hurt the thing. I liked the original anime and even the V series because in the end Ryu & Ken ultimately team up. One or the other (usually Ryu) has to get the final hit, but it takes both of them for a victory. Akuma would have given them both a run for their money with his raging demon; Street Fighter fans don't want the throw-away Sadler crap, we want the real deal--bring on Akuma.",
         "Spoilers ahead. You've been warned. I was quite disappointed by this film, after enjoying the original animated feature so much. There's so much in the film that's unexplored. Akuma is the focus of much of the promo material and the blurb on the back of the video/DVD packaging... and yet his appearance in the film it little more than a sixty-second cameo. IS Shun Ryu's brother or not? It's apparently implied that he isn't by his dying words, but if he's not - what IS he? Maybe the Japanese language version had it better, but it's very confusing and scrambled. The inclusion of the character of Sakura is utterly needless and adds nothing to the flim - perhaps if she had just been in a short cameo like some of the other game characters, and you could just point at the screen and go \"hey, there's Sakura,\" and that was all, it would work better, but as it stands, she serves no purpose being the film at all. My main problem with it is the general *pointlessness* of it all. By the end of the film, we're right back exactly where we started, and nothing's changed, except Ryu's a little better off. Deeply, DEEPLY annoying is the animation team's apparently fascination with Chun-Li's butt, crotch and chest. Almost every shot of her opens up on one of these body parts, and when the camera's on other characters, one of these three parts is always poking into the screen from the side. It's very irritating. I'm not even sure if this is supposed to be in the same continuity as the first SF movie, because there's a lot of things that don't match up, even if it's supposed to be acting as a prologue. Basically, this film is trying to be something it shouldn't. Street Fighter shouldn't be about a deep, meaningful storyline - it should be about people beating the snot out of each other, which is what the first film was, and it was all the better for it.",
         "Well like i said this is not the kind of movie i thought it would have been.I have been a big street fighter fan since the starting of the video game while it was still on arcade.But of course i just couldn't just stop at that.I was browsing through one of my friends collection of Videos and i saw that she had both the first movie that came out and most of the series.Well of course i went nuts about them and she allowed me to borrow the first movie.This movie i watched over and over again because of some of the best fight scenes i had ever seen at that time.I will admit that i now own both and i watch the first one that came out a lot more instead of Alpha.I found Alpha very slow and the story just didn't fit quite right (compared to the true story behind Street Fighter).If you are looking for a good movie with an all right story line but lots of fighting in an Anime,i suggest \"Street Fighter the Movie\".Alpha is ok in some sense but i suggest you stick to The movie i just listed and the series(which is quite funny and a good one).I have seen a lot of Anime movies and lots of normal movies.If you would like any info or advice on a movie feel free to email me.",
         "Being a huge street fighter fan and thoroughly enjoying the previous film, Street Fighter II: The Animated Movie, I was really looking forward to this one! However, it seemed that the film had no real sense of direction or purpose. Most of the characters I could not associate with and it just lacked the intense action that made the other mentioned street fighter film so superior. There are some good points however, the Animation is superb!!!",
         "Street Fighter is a video game series that's very near and dear to my heart. It is a series that's not exactly known for its deep and profound story, but the characters are iconic, from Ryu's dusty old white martial arts uniform and red headband, Ken's bushy eyebrows, to Chun Li's buns and thunder thighs. Where this movie went very wrong, I think, was that they chose to create new characters rather than try to incorporate the rest of the Street Fighter cast in any meaningful fashion. I feel that this is a great disservice to the fan base. Even putting aside the lack of characters from the game (but where was Cammy?!), it was very hard (for me at least) to care about any of the new characters or the overall plot. And it didn't have to be that way. I don't think we have ever seen in the Street Fighter games or movies any hint as to Ryu's past: we take him for what he is now, a stoic world warrior whose greatest struggle is within. This could have been an interesting fresh look at this character, but in its execution it just fell flat. If you haven't already, I would strongly recommend Street Fighter II: The Animated Movie (listed on IMDb as \"Sutorîto Faitâ II gekijô-ban\"), which does a much better job of putting together a coherent story and weaving in all of the characters.",
         "To celebrate the 10th anniversary of the Street Fighter game franchise, Group TAC released \"Street Fighter Alpha: The Animation\" five years after the highly fan acclaimed \"Street Fighter II: The Animated movie\". Many reviews have criticized this movie based on what the reviewer thought SHOULD be in the movie. Some wanted a direct adaptation of the Street fighter Alpha game storyline, other reviewers dissed the show just because some characters were not featured. This will be a true review of the movie itself, not of what i expected to be in the movie. True to its title, Street Fighter Alpha borrows the characters, setting and the \"look\" of the SF Alpha series while crafting a new story separate from the games.The focus is squarely on Ryu, a martial artists haunted by the death of his master and the presence of a dark power lurking within him. As the story begins, Ryu meets up with Ken to pay respects to their deceased master, but Ryu is having trouble controlling this dark power called the \"Dark Hadou\" and keeps having strange visions. They encounter a boy called Shun who claims to be Ryu's long lost brother. At first skeptical, Ryu soon embraces Shun as family and trains together with the boy, who also displays formidable fighting skills. Word of a new Street fighter Tournament reaches Ryu and Ken and they intend to sign up. But little do they know that the tournament is a front for an evil scheme concocted by Dr Sadler, a top scientist for the Shadowlaw organization. Kudos to Group TAC for trying to make a more coherent narrative with a proper emotional center. While the previous Street Fighter II The Animated movie was a stylish gritty martial arts movie, SF Alpha plays out more like a character Drama about Ryu. While we do get some insight into Ryu's inner emotional turmoil, it really is nothing original. Ryu struggling with control over the dark hadou seems ripped straight from Star Wars' Luke Skywalker and his struggle with the Dark side of the force. Also, thanks to the strict focus on Ryu, the other iconic characters are at best reduced to mere stock characters with little to no development, or just cameo appearances that add nothing to the plot. Little side stories about Sakura's obsessive tailing of Ryu and Chun Li's Shadowlaw investigation are more an easter egg treat for long time fans than newcomers. The biggest fault of Street fighter alpha: The Animation, is the animation itself which is merely on par with a typical anime TV series of that time. If one were to expect the gritty brutality and fluid choreography of Street fighter II: The Animated movie, one would be sorely disappointed. Street Fighter Alpha's fight scenes play out like something worse than Dragonball. Fighters flying and hovering through the air constantly was probably a way to cut costs by not animating the characters running, but for some reason all the fights seem to be done in slow motion. If it was intentional, it is a poor directing choice as it quite honestly makes every single bout a total bore. If not intentional, then it was a result of cutting corners again in the animation. Artwork is also a hit and miss. While the art does a great job of replicating the designs used in the game, the characters go off-model quite often. The best example is Chun Li's eyes which keeps changing size and even shape in different scenes. The art constantly shifts from a dark and highly detailed style to a bright flat cartoony look, sometimes in stark contrast to the scene being presented, giving the entire production a very inconsistent feel. It is a huge pity Street fighter Alpha: The Animation turned out the way it did. There were a couple of great ideas and a lot of room for a deeper story. Too bad all that potential got totally wasted on typical anime story clichés including an uber-powered robot and landscape-destroying fireballs. Like Akuma said, \"a true warrior enters the arena with ALL his powers at the ready\". Street Fighter Alpha: The Animation not only fails to bring all that its got to bear, but it figuratively pulls its punches and ends up with a mediocre final product. More effort seemed to be spent trying to cut corners in everything rather than going all out to deliver an experience as awesome as its predecessor or the games that inspired it.",
         "This movie is based on the series Street Fighter Alpha (or Zero)! It is placed in an other setting than Streetfighter the animated movie! This movie is all about Ryu who is accompanied by Ken and Chun Li. I recognized Rose,Zanghief and Birdie! There weren't any other characters used from the video game (that i could discover)! The fighting scenes were OK but nothing really spectacular! And there were not many of them! To me this is odd! Isn't Streetfighter about fighting! Streetfighter the animated movie (1994) is far superior to this movie. It tries to be more than it really is! The use of the \"Hada Power\" and other supernatural elemnents have nothing to do with skills the characters have in the video game! And in this case that is a bad thing! The story is so boring that you don't really care what is happening! The action is toned down considerably! Why? And what happened to the other characters from the video game! Surely they are more interesting than the villain in this story! The main attraction of the video game are the characters with their own special skills! In this movie it is all about Ryu! That is why this anime fails!",
         "by now, you've probably heard that Street Fighter Alpha movie is not as good as Street Fighter II: The Movie. However, Street Fighetr Alpha is still amazingly good. Take the example of Matrix Reloaded. On it's own, it would have been a major success and everyone would have loved it. However, before that came The Matrix. The Matrix was so unbelievably good, so perfect in every way that Reloaded didn't really stand a chance. And it is the same here. Street Fighter II movie was so good, exactly what fans of the game wanted to see that anything after that would pale into comparison, which is exactly what happened to Street Fighter Alpha. The truth of the matter is, Street Fighter Aplha is an amazingly good movie. Sure, it has it's faults, but so did Street Fighter II. Still, Street Fighter Alpha is very entertaining and sticks well with the whole street fighter universe, and it is perfect for those who have played the ASlpha games, introducing new characters in the movie. The whole movie is more dark and mysterious and incredibly fascinating. You will not be disappointed, although Akuma could have done so much more in the movie, it was a waste of a good character.",
         "When Manga Video first released this, I snapped it up right away. Looking back, I remember it being good, yet I only watched it a few times before it was left to gather dust on the shelf with the rest of my impulse anime buys (the kind they snag you into buying by packing the trailer with nearly all the fast moving eye-candy the feature has to offer.) I couldn't quite remember why, though... so I popped it in the ol' VCR again. The best thing about it (to me), and what I think is better than all of the Street Fighter branded animation before it, is the consistency and quality of the artwork - it thoroughly matches the games it is based on. All you have to do is to compare (nearly) any moment of the movie with a victory screen or portrait of the same character from Alpha 3 to see the care that was put into pulling this off. The animation is quite good too, although I think the style is adhered to the fault of creating some awkward positioning and there is definitely an excess of close-ups - to the point that you are more likely to see a zoomed-in image of someone's face (or crotch, in Chun-li's case) rather than anything else going on. You could talk about the problems with the story (not that many game-movie conversions ever do too well in that regard), many of the clichés are there and are pretty obvious, and much of it is far too over-dramatic for it's own good, but as it is with any good action flick, those aren't the main things I'm concerned about... My main problems are with the fights. Aside from a few quick, entertaining brawls that are merely teases (one of which plays while the credits are rolling, making you realize how good it all could've been ), they seem to take place one move at a time, and thus feel unusually slow, even by vintage SF2 standards. In nearly all of the 'important' fights, there is almost no continuous motion to the action. And to slow it down further, we also get some of the usual \"is that the best you can do?\" dialogue (the kind any DBZ viewer will be familiar with) between the short bursts of action. Ugh. It's kind of sad when a video game shows more fluidity than a movie does during a fight. :( Pros: Good animation. Nice consistency in artwork. Signature moves are well represented. Cons: (some spoilers) Fight scenes feel unnaturally slow. The majority of the game's fighters are limited to 'quickie' cameos (Birdie was done pretty well, though.) No climactic battle with Akuma. Missing characters: no Charlie, no Sagat, etc. A lame villain who has nothing to do with the game (I really hate that stupid grin he always has.) General stupidity: an annoying little brat holding his own against Zangief (PUH-LEASE!), Ryu dodging bullets, etc... Despite what flaws it has, it is still worth watching if you enjoy the unique look of the Alpha series, as it has been very carefully replicated here.",
         "This movie was not quite what I hope it to be. I mean, is good in terms of animation, script and voice acting, but lacks in story impact for the fans of the game (and we know that the real Street Fighter story would work better than this one, while this has at least some basis). In this movie, we know a young martial artist named Ryu. His sensei Gouken was killed some time ago by a man named Gouki (we, the game's fans, know that Gouki and Gouken were actually brothers, but this is not mentioned in the movie at all, maybe because is just not relevant). This Gouki uses the power of the Satsui no Hadou, wich is no other that the 'Evil Intent'. Ryu is feeling that power inside him, and try to find out how to defeat it. Just in this stage of his life, a kid shows up reclaiming being his young brother. This boy also has the power of Satsui no Hadou and manifests it. Things are not getting any good to Ryu. The script open many storyline gates, but the one that really matters is Ryu's internal fight, while not the character's life itself. So, when the movie ends, all other storylines remain opened, while only the important one closes. This is very risky for a script, but I think it works fine. I mean, in the real life at the end of one dilemma, other possible dilemmas might not get solved. This is what happens to Street Fighter Zero. However, some of this dilemmas actually needed to be solved, like Sakura's. For example, Chun Li has her own dilemmas, but she actually gets in Ryu's way, so to know some about her was obvious. But what impact had Sakura on Ryu's trial? None. It was, in fact, in the other way: Ryu has a strike on Sakura's trail. That would work for a Sakura movie, but not for a Ryu movie. I felt Sakura's incursion very rushed, like a fan service thing. However, in the whole, Street Fighter Zero is a good, but not excellent movie. It could be better, just that. And an advice: This movie is not for those who look for a lot of anime action. This is more like Ang Lee's Crouching Tigger, Hidden Dragon. It has some action, but the spirit lays in the inner fight.",
         "Ok. Being an semi-anime fan for a few years, I once fell upon street fighter 2, as an animated movie it was pretty good. The drawing was top notch, and the plot made sense. Not to mention most of the fights were pretty well done. In this, street fighter zero(alpha?) I found it sucked. The drawing was nowhere near as good as SF2. The plot was crap, I mean, the kid shows up and this amazing hardcore die hard fighter dude just believes he's his little brother? What's with that? The whole dark ha-do(sorry, don't know how to spell) thing is kinda cool, but if this had been pursued as more of a sequal to SF2 using some continuity between them, not to mention better drawing in general, I would be more pleased. I can't say the movie didn't entertain me at all, I still like whatching people get beat up, but I think it lacks some of the more apealing features of most plain old let's kick some tail movies.",
         "What sets this film apart from others in the fighting-game-turned-anime genre us that the plot and character setup are especially important to the actual portrayal of the character. Don't expect to be able to jump into this film and like it, because you won't. If, however, you choose to watch it from the beginning and actually empathize with the characters, you will most likely enjoy yourself. Street Fighter Alpha (the videogame) was the turning point of the street fighter universe because Ryu ceased to be the wandering, invincible (and emotionless) street fighter who is thrown into the plot by accident, and became the central character of the story, in a far more convincing fashion than Guile and Chun Li ever really managed in Street Fighter II. This movie is the expression of that story in film. The fighting scenes are spectacular and the story well-paced, but in the end, if you're looking for the kind of popcorn-action flick that guys watch during frat parties, the original Street Fighter Animated Movie is much more your cup of tea (or beer). If, however, you're looking for a sensitive film which deals with the personal side of each of the characters involved, Alpha is much better.",
         "This movie left me impressed & disappointed. It revealed something about Ryu, but the story itself was confusing. I've been a Street Fighter Fan since '88, and the problem is that \"they\" keep changing the story. It's like some one at Capcom can't stay the story line that was given previously. If you've played the game and watched the other animes, you will notice that they are almost completely different. Nothing is clear about the characters' background or their reason for fighting. There are similarities (like the characters' names), but there are way too many plot holes. If you like Street Fighter, this movie is for you, but if you're a hard core fan whole likes a story with some foundation, then watch this just to watch, because you'll be a tad disappointed.",
         "I was disappointed after watching this movie. As a Street Fighter fan I was expecting this to show us the mother of all battle, Akuma vs. Ryu&Ken. The script writer of this movie have obviously had not play the game before, much more read the story behind the game. Where the Alpha series were suppose to be after the famous Sagat vs. Ryu battle (in SF1) and before the Street Fighter 2 tourament. This is where all the magic take place. Here is a list of what should be in the movie: 1.Ken giving Ryu the famous red headband after a sparring battle 2.Death of Charlie during a mission with his buddy Guile 3.Unfolding the mystery between the Akuma and Ken&Ryu 4.Fighting more in the style of SF2: the animated movie rather then DBZ 5.Hyper moves we use in the games 6.One of the Shotos (thats Ken or Ryu) commenting on the similiarities of Dan's fighting style (same master) (or small stuff like this thats derived from the game) 7.Chun Li hunting down Bison 8.Bison having an interest in Ryu's dark ability 9.have fights with back drops that remind us of the game stages 10.Fill the rest up with game's minor character having fights with one another 11.Showdown between Akuma and the Shoto boys This movie is not bad, but its not a Street Fighter movie. Its like they pick up a random script and call it ST:A just to cash in from the fans.",
         "This was set before SF ll The anamie movie, and it does a really good job i mean a lot of people say there was not a lot of action, well that dont bother me one bit. I love this movie and its 2nd best, may be they are saving all the action for Street Fighter Alpha 2 due later this yeah?. Anyways i am a big SF Fan have been for the past 11 years now, and this is one of the best if not de best.",
         "Whenever I watch an anime film based on a fighting game, I expect FIGHTING. I don't want some ramshackle plot that detracts from the whole reason I enjoyed the game in the first place. Even the presence of a good plot can not justify in my mind any fighting game-based anime that contains little to no action. This brings me to my review of Street Fighter Alpha the movie. The plot, such as it is, concerns Ken and Ryu teaming up with Chun Li to battle some maniacal scientist who's trying to harness the \"Dark Hadou\" within Ryu. The \"Dark Hadou\" is sort of the Dark Side of Ryu's martial arts. Also thrown in the plot is Sakura as an admirer of Ryu and Rose as a being who tries to help Ryu understand his destiny. The animation is pretty good. The character design is quite different than Streetfighter 2: The Animated Movie. I liked the \"ultra-muscular\" design of its predecessor more than the \"huge hulking creature\" design of this film. The fighting is the films calling card. There's a lot of it, and it's well \"choreographed\" and animated. A lot of brutal, high impact martial arts with just the right amount of energy attacks thrown in. My only complaint is that Chun Li and Sakura don't get any memorable one on ones. I loved Chun Li's duel with Vega in this film's predecessor, but there aren't any moments for her in this (not that she doesn't fight). Overall, an entertaining animated movie.",
         "call yourself a fan of SF but u don't even know how to spell Dark Hadou.do you know what's art all about?SF alpha used different art direction comparing to SF2 and it used clean finishing on their characters.it was smoother not as rough as the previous drawings and they did a very good job on the face expressions which gave a good sense of humour especially Ken and Sakura.bear in mind that the animation was from a director who also masterminded the classic animation,Dragonball.the background art used in this movie went very well with the characters and i must say it is much better than SF2.to be honest,Ryu's look in SF alpha makes sense as he was a young martial art artist as told in the original story,not uncle ryu in his mid 30's that was how SF2 ryu portrayed.",
         "Street Fighter Alpha: The Movie was cool when I first watched it. I was all like FINALLY Akuma appears fully in a animated movie. You see him have cameos and all that. I was kinda disappointed that Bison was replaced by a guy named Dr. Sadler. I think it might be a prequel to the SFA series. You get to see Ryu in his Evil form. And he has a little brother? that's odd. Parts I liked: The most funniest fight scene was Dan vs. Birdie that ended real quick. A guard split Chun Li's legs that had to hurt as hell. I think that's the origin of how she does her spinning bird kick. I don't know Capcom knows the whole storyline. Liked the ending Akuma vs. Ryu a classic match reminds me of play SFA2. It was all cool but not the best as Street Fighter II: the animated movie was. Still rated: 7/10",
         "Even though I am a bigger fan of the FATAL FURY franchise than I am of Street Fighter I still recommend this to anime and video game fans. The quality of animation in this entry is quite stunning. A lot of time and care has been put into making this look like a work of art and some scenes and shots are definitely way past cool. The sound design is also more sophisticated than most other anime video releases. Stereo separation and ambiance comes through with clarity and more authority than you would imagine. The DVD sound great in 5.1. The story is stronger than I expected but still not up to the standards of SF2. The bad guy just isn't nasty enough or threatening. And the movie kind of suffers as a result. M Bison is barely glimpsed and he looks kind of different. Gile is completely absent. Vega is gone too. I wouldn't really say that this entry takes place in the same universe as SF2, which is a shame because it was so much better than the live action movie. Ken and Ryu's friendship is mostly the same, tho that is where any similarity ends. But there is a whole animated series to back SF Alpha up, so if you dig it...there's much more.",
         "Street Fighter Zero is certainly better than any other SF movie. The 1994 movie is a real joke; SF2 the animated movie is nice, indeed, but this movie is actually GOOD. First of all, unlike all others, it has a plot. A very nice one, too. There's a little mind game of \"who to trust\", and the end is really great. Second: The battles are somewhat more energetic, more dramatic - a little slower, and emphasized. Impressing. Well, anything else I'll tell you will just spoil the movie. Go see it! It is great, even for those who aren't Street Fighter fans. Overall - it isn't for nothing that around 19% of votes (and most) voted 10!!!",
         "I have this on video (the english version) the voice acting is sound and the characters look detailed. However sometimes it goes a little too far. For example Professor Sadler isnt in any Street Fighter title so you can't really take to him as a villain. this film does show many of the SFzero fighters but they dont play big roles. the only ones who do are Ryu,Ken,& Chun-Li. Akuma has a tiny role and as I have never found a sequel to this it leaves SFzero film very unfufilling. 7/10",
         "Ok, I bought this movie with the intention of sitting down and enjoying my $35++ worth DVD entertainment. I was not completely disappointed, but this story is missing huge parts and is at times very random. Like, the director had a selection of screen shots and gave a scene generator some LSD. I am going to list 5 great points and 5 awful points. GREAT 1) The animation was really cool. I haven't seen any of the other street fighter flicks, but I have seen much animation and this is better than acceptable. 2) I liked how they attempted to develop the characters somewhat. 3) Ryu and Ken were both likeable. 4) I liked the whole aura Ryu had about him. For example, when he was walking around the mountains or whatever in the beginning and the leaves by his feet seemed to move around him. 5) I liked the whole inner-battle aspect of what Ryu was going through. Although it was over-emotionalized. AWFUL 1) What's up with them dissing Ken like he couldn't fight? I was soooo disappointed when he fought and gave his all and didn't even dismantle that dude. That was really lame. 2) What's up with all the cameras focusing on chun li's breasts, butt, and pubic area? Like, she would be talking and the screen would be fixed on one of the above forementioned areas. Geez. I mean, if you're going to be sexual in anime don't be all subliminal and perverse about it. 3) What's up with the retarded laughing villian scientist? Dragonball Z's enemies are at least entertaining. This guy was just a laughing emotionless twit. I couldn't stand it. I had to fast forward through his laughing. 4) Where was half the characters?? 5) Why was there so much bad plot involvement and no fighting?? I wanted some cheering bone snapping action with wicked emotions and fists flying, not some lame wannabe philosophical karate saga.",
         "Street Fighter Alpha (Zero) was good but not what one would expect. I also was waiting patiently for this video because I thought that it would be the same, if not better, than Street Fighter 2: The Animated Movie. For starters, the animation is not quite the same. Zero seems to have a lighter atmosphere in color, whereas the others had darker and more detailed ones. Zero was more of an emotional series with that piano-based music like in the Tekkaman 2 series. The fighting scenes were no where near as entertaining as the others were. The fight scenes were slow, not very creative and, for the most part, the characters bodies were distorted and weird. Yes, this movie is decent if your a hardcore anime fan who likes emotional and unrealistic shows, but for us plain Street Fighter fans it's kind of a drag.",
         "Overall, I think that this film is much better than the previous Street Fighter anime. Despite the fact that the fight scenes are not as entertaining, I think this does a much better job in terms of character development, storyline and musical score. The story seems to have more in common with Street Fighter 1 than 2, even though it is set between the two games. It has characters from the original, like Birdie and Adon, as well as references to the Muay Thai Emperor, Sagat (who I think is the best villain in a fighting game ever). The relationship between Ryu and Ken seems a lot more convincing in this film as opposed to the Street Fighter 2 animation, where all the character seem a little stiff. Also, it was a much better idea to make Akuma the lead villain instead of Bison, who is annoying and not intimidating at all. Also, the dubbing in this film is extremely good. The only complaint I have about this film is that some of the dialogue involving Shun seems to be poorly written. Still, I give it a 10.",
         "It's true that movies adapted from arcade games have never had an original or involved storyline. All of them rely on action and special effects to carry them through . However, each movie has it's own style. Mortal Kombat followed a similar storyline to 'Enter The Dragon' where a group of warriors travelled to a deserted island and kicked the bad guy's butt. Street Fighter has stayed on the anime canvas all the way through this (apart from the s*** which featured Jean Claude Van Damme which I personally do not count as a movie) and the first feature made in Japan was a great success even though there wasn't a great storyline. The thing that did it for me was the character portrayal and the relationship between Ryu and Ken. I remember being so disappointed when they did not fight each other. In addition, the touching flashbacks to their past really added to the film's magnetism. As many a SF2 fan would know, the original Japanese script and soundtrack was taken by Manga and translated into English. The soundtrack was completely wiped and replaced with grunge metal. Imagine my disapointment when I found that SF Alpha contained the same sounding grunge. It became apparent to me that this was a Manga-produced project and it really shows in the difference in drawings. For instance, Ryu does not look Japanese at all. Whoever designed his facial profile should be lynched and whoever decided to give him blue eyes should be slashed to pieces as well. Ken, on the other hand, looks far better (though by no means an improvement on his original look in the first movie). Aside from all this, the film focuses far too much on Ryu's personal struggle with is powers. They really should've gone with sticking to a good guys vs bad guys storyline. A few characters from the Alpha game are featured but are cameo roles to make up the numbers. Chun Li is also present but the animators seem more interested in drawing her crotch than anything else. To summarise, disappointing storyline, disappointing animation and even worse soundtrack. Manga should've left this to the 'real' experts in anime."
      ],
      "genres": [
         "Animation",
         "Action",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [],
      "summaries": [
         "Shadoloo's leader, Vega (Bison in the English version), sponsors an unpublicized fighting tournament. Shotokan devotees Ryu and Ken revive their rivalry, while foolish former-Shotokan student Dan seeks revenge on Sagat, the man that killed his father. US Army Colonels Guile and Nash (AKA Charlie) attempt to stop Vega's ways, alongside countless other fighters fighting for their personal reasons. Did Ryu find the ultimate challenge? What happened to Nash? And what is the story behind the evil entity known as Gouki (Akuma in the English version)...?",
         "Gouken and Gouki both learned a very deadly form of karate from their master Goutetsu. This dangerous style can awaken the \"Satsui no Hadou\" in its practitioners. Gouken tried to remove these dangerous elements when he taught Ryu and Ken. But Gouki succumbed to the evil and killed Gouken. Years later, Ryu and Ken reunite at their master's grave. Ryu has secretly been showing signs of the Satsui no Hado. They are even more surprised when a boy named Shun shows up, claiming to be Ryu's long-lost brother! Then Shun also shows signs of the Satsui no Hadou. And Shun tells Ryu that their father also succumbed to the evil! A secret organization (Shadowlaw perhaps?) seeks to awaken this power in Ryu and harness it.",
         "A dark power threatens to consume famed fighter Ryu, who is visited by a long-lost little brother. Meanwhile, a mad scientist wishes to harness this power for himself."
      ],
      "budget": 0
   },
   "movielensId": 141797,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1999-12-22",
      "dvdReleaseDate": null,
      "directors": ["Shigeyasu Yamauchi"],
      "runtime": 100,
      "movieId": 141797,
      "title": "Street Fighter Alpha - The Movie",
      "mpaa": "NR",
      "actors": [
         "Kane Kosugi",
         "Kazuya Ichijō",
         "Yumi Touma",
         "Tomomichi Nishimura",
         "Ai Orikasa",
         "Chiaki Ōsawa",
         "Reiko Kiuchi",
         "Ken Yamaguchi",
         "Kazuyuki Ishikawa",
         "Hidenari Ugaki",
         "Daiki Nakamura"
      ],
      "imdbMovieId": "0185708",
      "originalTitle": "ストリートファイターZERO",
      "genres": [
         "Action",
         "Animation"
      ],
      "youtubeTrailerIds": ["t2jsM7YnYvM"],
      "plotSummary": "Increasingly disturbed by the dark energies building within him, Ryu is confronted by Shun, a boy claiming to be the brother he never knew. But before Ryu can consider whether Shun's timely appearance might be more than coincidental, Shun is kidnapped by Shadowlaw. To recover Shun, Ryu must undertake the ultimate journey of self-discovery and learn to control the power threatening to consume him.",
      "tmdbMovieId": 17433,
      "avgRating": 3.05556,
      "releaseYear": "1999",
      "numRatings": 9,
      "posterPath": "/e1LkneZ8fpbs9yTPeASdL7iXXXM.jpg"
   }
}