{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "zombie",
         "id": 12377
      }],
      "imdb_id": "tt1912982",
      "video": false,
      "title": "A Little Bit Zombie",
      "recommendations": [
         73290,
         191094,
         201619,
         71511,
         214464,
         32009,
         46467,
         79544,
         224950,
         39897,
         44548,
         149592,
         93030,
         358982,
         31286,
         124873,
         160352,
         139367,
         230779,
         254526
      ],
      "backdrop_path": "/bEE0fontyWccKKquVDY7lgti1ue.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe489e9251416c750adce3",
               "name": "Stephen McHattie",
               "profile_path": "/vSssg0R2VJLBUF0tb2rA4Vhsc4j.jpg",
               "id": 230,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Steve",
               "gender": 2,
               "credit_id": "52fe489e9251416c750adce7",
               "name": "Kristopher Turner",
               "profile_path": "/pWbG7NKvMkJFgVfBo6DUdXm5dhY.jpg",
               "id": 91356,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe489e9251416c750adceb",
               "name": "Crystal Lowe",
               "profile_path": "/Ceoa65Zc6QXvT1zFpPmQx5dY5M.jpg",
               "id": 58393,
               "order": 2
            },
            {
               "cast_id": 1014,
               "character": "Craig",
               "gender": 2,
               "credit_id": "52fe489e9251416c750add29",
               "name": "Shawn Roberts",
               "profile_path": "/2pzr8yoBCOnDnaS0iUxraBfZ7SR.jpg",
               "id": 81097,
               "order": 4
            },
            {
               "cast_id": 1015,
               "character": "Penelope Pendleton",
               "gender": 1,
               "credit_id": "52fe489e9251416c750add2d",
               "name": "Emilie Ullerup",
               "profile_path": "/nIELqej3BnFwWdKZ9T7XHDRODf5.jpg",
               "id": 211685,
               "order": 5
            },
            {
               "cast_id": 1016,
               "character": "Capt'n Cletus",
               "gender": 2,
               "credit_id": "52fe489e9251416c750add31",
               "name": "George Buza",
               "profile_path": "/evDLbiyIWot7rmphF0lywysIswR.jpg",
               "id": 128176,
               "order": 6
            },
            {
               "cast_id": 1017,
               "character": "Terry 'Terror' Thompkins",
               "gender": 2,
               "credit_id": "52fe489e9251416c750add35",
               "name": "Robert Maillet",
               "profile_path": "/cmP2CakmT1j0wXAjNEVQMGcR0cL.jpg",
               "id": 112692,
               "order": 7
            },
            {
               "cast_id": 1018,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "54ab18b19251415646002622",
               "name": "Kristen Hager",
               "profile_path": "/u0f2qDsQeW51hmX9T9hMrMhOSdR.jpg",
               "id": 73454,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750adcf5",
               "name": "Trevor Martin",
               "profile_path": "/zvz3ZEm0BNwPVQ1gMPh1bm00eQy.jpg",
               "id": 17478,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750adcfb",
               "name": "Christopher Bond",
               "profile_path": null,
               "id": 569511,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750add01",
               "name": "John Griffith",
               "profile_path": null,
               "id": 1116033,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489e9251416c750add07",
               "name": "Lise Lalonde",
               "profile_path": null,
               "id": 1116034,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750add0d",
               "name": "Tyman Stewart",
               "profile_path": null,
               "id": 1049730,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489e9251416c750add13",
               "name": "Casey Walker",
               "profile_path": null,
               "id": 1116035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489e9251416c750add19",
               "name": "David Watson",
               "profile_path": null,
               "id": 18644,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750add1f",
               "name": "Kevin C.W. Wong",
               "profile_path": null,
               "id": 1116036,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750add25",
               "name": "Michael P. Mason",
               "profile_path": null,
               "id": 109860,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58ab0aacc3a3686efe0047ea",
               "name": "Casey Walker",
               "profile_path": null,
               "id": 1116035,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.02028,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 90118,
      "vote_count": 30,
      "budget": 0,
      "overview": "Infected by a virus, a mild mannered HR manager attempts to fulfill his overwhelming desire for brains, all while trying to keep it together so as not to incur the wrath of his bridezilla-to-be.",
      "similar": [
         294254,
         10925,
         13648,
         485415,
         923,
         346651,
         400136,
         24920,
         19908,
         170,
         1562,
         72190,
         126889,
         336843,
         82654,
         766,
         16288,
         215830,
         8408,
         24935
      ],
      "original_title": "A Little Bit Zombie",
      "runtime": 87,
      "poster_path": "/yMLetKgZByWzWzGLyhMyUn6RHot.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2012-02-03",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Dead or Alive, They're coming for Steve",
      "adult": false,
      "homepage": "http://www.alittlebitzombie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Casey Walker"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Trevor Martin",
         "Christopher Bond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1912982/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODVhYTg4MzUtY2VkMy00NzhhLThiZjYtMjFhYmYwZTNkYzNlL2ltYWdlXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Kristopher Turner",
         "Crystal Lowe",
         "Shawn Roberts"
      ],
      "reviews": [
         "I had the chance to see this very funny, award-winning film at Worldfest-Houston in April, 2012. A Little Bit Zombie turns the zombie genre on its head, shakes the brains out, and devours them. I was laughing from the opening scene all the way to the end of the credits. While one or two of the jokes fell a bit flat for me, the vast majority of the comedy was brilliant, not to mention the premise of the film itself, which I won't spoil for you. I'll just say this is a zombie film that shows us what it's like from the perspective of the zombie. You'll sympathize! But it's also a very smart commentary on society, and has a lot to say about how our ethics are relativized by our private commitments. It further forces us to think about who the real monsters are in our day and age, flipping the script: the zombie is the complex protagonist, while the zombie hunter is the mindless, intolerant killing machine. But even the antagonist has a complex past, one which reflects a sharp commentary on society's expectations of \"real men.\" His intolerance isn't a choice; he, like the zombie, is a victim too. The cast was stellar. Everyone was hilarious. The performances weren't over the top. Their comedic timing was right on. There was not a poorly-delivered line in the entire film, as far as I noticed. The writer/director Casey Walker did a great job. There's a lot of dialogue in the film, but the shot pacing kept everything moving forward. Wasn't bored for a second. This film was obviously story- boarded. Every line, every shot seemed to be very precise. I highly recommend this film, not just to fans of the genre, but to anybody who likes a good comedy. You'll laugh till your brain hurts.",
         "I loved A Little Bit Zombie. It was refreshing. It was new and it was clever. Also all of the actors did a great job. This is a wonderful funny film. I am an Author and I wish I had written this. It is great. A little bit Zombie did something different. A little bit Zombie looked outside the box and made a great funny film. Yes,instead of following the usual formula, A Little Bit Zombie did the unexpected without failing. Even the jokes funny and relevant. Everything is just well done. I wish the critics would view this film and give it the justice it deserve. In this way more people would see this great film and leave the theater refreshed and happy. This film is good for young people too. It is not that violent.",
         "*Brace yourself, I don't usually write reviews! Just saw the 'world-premiere' here in Victoria BC. It was definitely a good twist on the \"zombie- film\"! Nice to see something fresh for a change -- The humour was well-timed, and the jokes were pretty witty. The plot and story seemed well thought out, and it kept you entertained and curious right until the end! The acting was a little over the top throughout the film, but it clearly was the tone they were looking for. I thought the music was a little over done too, though, and perhaps the overall cheesy tone could have been winded back a bit. But in all it was a very enjoyable film. There are some hilarious scenes that'll stay in my head forever!",
         "I watched \"A Little Bit Zombie\", like so many other people, at a genre-dedicated festival, and director Casey Walker was physically present to introduce his achievement and attend a Q&A after the screening. Although I fairly liked the movie for what it is already, it was Walker's playful attitude and OTT enthusiasm that made me appreciate it even more! He explained, in great detail, how he got the crowd funding off the ground and unsubtly elaborated on his aversion towards big budgeted studio productions. His film became a zombie-comedy, and that's a rather risky undertaking nowadays, since we have seen so dreadfully many of them and what innovating elements could possibly be brought anymore? Well, \"A Little Bit Zombie\" indeed brings nothing new to the horror table, but at least it's a 200% enthusiast, unpretentious and massively entertaining flick. Steve is a goody two-shoes desk clerk who's about to get married with his \"Bridezilla\" Tina. Together with his sister Sarah and his best pal Craig, who're both trying to convince Steve that Tina isn't his perfect match, they're heading out to the family cabin for the final marriage preparations. But poor Steve gets stung by a virus-infected mosquito on the first evening and literally starts to waste away as per the next morning. He's slowly turning into a zombie, developing an insatiable hunger for brains and gradually losing body parts. For Tina, the only thing that matters is assuring that her flawless wedding ceremony takes place, whether her husband is an undead rotting corpse or not. Meanwhile, Steve is also pursued by a psychotic zombie hunter and his geeky scientist sidekick. \"A Little Bit Zombie\" opens as a prototypic but nevertheless tasteful comedy, but quickly shifts towards a rather juvenile slapstick baloney. Steve's struggle to resist devouring a defenseless little bunny rabbit, the clique's visit to a downright disgusting butcher shop and the two girls – in sexily revealing outfits – scouting for potential brains for Steve to eat\u0085 They're all examples of highlight sequences, but it's definitely not solid horror. There are some excellent gross-out effects, but naturally the film is never atmospheric, morbid or even remotely unsettling. The acting performances are more than decent, with Crystal Lowe and Stephen McHattie as the most famous names in the cast. Interesting zombie comedy for the fans, but surely not on par with the real high-fliers of its kind (\"Shaun of the Dead\", \"Zombieland\", \"Braindead\", Return of the Living Dead\"\u0085)",
         "Goofy, Cheesy, Silly, Dumb, Funny, Annoying and Gross are all words I'd use to describe many of the scenes in A Little Bit Zombie. Regardless, I was shocked at how much this low budget, never heard of, little indie zomb-com made me laugh so freaking hard. There are a lot of parts that are annoying and some of the acting is bad, but then there are parts that are hilarious and the actor who plays the best friend Craig, is incredibly funny, although he looks like a muscle truck exploded, but still, he's super talented. The musical score can get really annoying at times, so I just tried to tune it out. I didn't care for the zombie catchers; their chemistry was very weird and unnatural. Getting through their scenes was sometimes difficult, but the rest of the movie is pretty awesome. This movie is really funny and shouldn't be missed by anyone who loves the zombie genre. Please like me on Facebook! We love getting suggestions and warnings on everything horror: http://www.facebook.com/pages/I-Heart-Horror/338327476286206",
         "\"A Little Bit Zombie\" is a very funny and entertaining zombie movie that is a flat out tribute to \"The Evil Dead\". And the movie actually does that in a very good way, and at the same time it manages to pull off its own storyline quite nicely. If you enjoyed \"The Evil Dead\" trilogy, then your money will be well spent on \"A Little Bit Zombie\" as well, because it is the same type of humor and jokes. However, \"A Little Bit Zombie\" isn't as extreme and hilarious as \"The Evil Dead\" movies, but it does alright for itself. I was thoroughly entertained all throughout this movie. The story is about four young people who go to a remote cabin in the woods, where Steve is bitten by a mosquito that is carrying blood tainted with the zombie infection. Slowly, but surely, Steve is turning more and more into a zombie with a craving for brains. \"A Little Bit Zombie\" has a good amount of comedy that works out quite nicely. Especially because the jokes are funny and crude, and also because there are so many openly blatantly tributes to \"The Evil Dead\" throughout the movie. And the effects in the movie were actually quite nicely carried out as well. As for the acting, well the people cast for the various roles were doing quite good jobs with their given characters and roles. If you enjoy zombie comedies, then you definitely have to check out \"A Little Bit Zombie\", because it is well worth a watch. It was quite a treat to see a movie like this and have it pay that much homage to \"The Evil Dead\".",
         "I do not want to summarize the story - other reviewers did that already. After the massive wave of zombie movies, especially during the last 9 years, it is hard to find one with an original idea. 'A Little Bit Zombie' comes up with a fresh idea, disguised as a wonderful campy 1980s horror comedy B movie. What we get here is some sort of 'National Lampoon's Zombie Vacation' - the same kind of humor, only much darker. Just compare the old National Lampoon's movie posters with this one. The characters are over the top and as much fun as hilarious cartoon characters, especially Stephen McHattie. Bottom line: If you like zombie movies and comedies from the 80s, you will love 'A Little Bit Zombie' for sure.",
         "As an absolute zombie fan I came into this move not knowing what to expect as to be fair the large majority of Z-flicks out there you watch once and the disc ends up collecting dust. (Or gets deleted from your HDD) IMHO Zombie land is the current king of the funny zombie genera, but this movie isn't far off. It has a strait forward and easy to follow plot line, good acting (though you can tell they made it intentionally cheesy), some real bust your guts laughs (watched it sober tonight, but its definitely going to be watched again medicated), and the quality of the film is absolutely amazing considering their budget which was about 1/3 of what Shawn of the dead had (or a measly 7.5% of what zombie land had). Don't let that fool you though as it does not seem low budget at all. The fx were perfectly done. (no exploding balloon heads or fake looking blood/brain matter here) plus the film has a well known cast who have been in a ton of movies/TV shows. (The gorgeous Kristen Hager from Being Human is what caught my attention as I was scrolling through the release site) The movie deserves an 8 - 8.5 judged by nothing but what was filmed, however from the opening and closing credits I noticed they made a big deal about mymilliondollarmovie.com and I decided to check out the website. The sheer fact of how the guy got the funding for this flick, and the time and effort put into making it cranked my personal rating to a 10 (though I will keep that rating to myself and not over vote here) I rarely write reviews for anything online, but after watching this I ended up on IMDb 5 minutes later and found the lack of reviews disappointing. If you like zombie movies don't miss this one. If you love zombie movies your a fool not to watch this.",
         "So many positive things are said about this zombie comedy that I was looking forward to it and seen the mosquito flying around as a zombie I thought I was in for a hell of a ride. It was a while since I had seen a good horror comedy. Last one was Tucker And Dale vs Evil (2010). After seeing it I just can say that I found it total crap. I didn't laugh, I even never had a smile on my face. Even as it started off rather well with Stephen McHattie (Max) doing his shootings toward the zombies. But after that part we only see the POV of the mosquito biting a human who will become a zombie. Downhill from there. No funny situations, no zombie to spot, sure, he's changing but not into a zombie, just in someone wanting brains to eat. The situations coming out of that are jokes that teenagers will love, the bunny for example. Some do refer to old eighties comedies like the national lampoon flicks and stuff like that but I guess it must be typical American humour because I didn't like it at all. I'm into British jokes and stuff and sometimes an American comedy do work but this here was a waist of time. Too much of talking and nothing really happening. Even when the girls are dressing up and looking sexy to catch a guy to capture for his brains didn't work and wasn't funny. Guess I had to read the title closer, it was stated a little bit zombie and that was true. Gore 0/5 Nudity 0/5 Effects 1/5 Story 2/5 Comedy 0/5",
         "Yes, it's another zombie movie. However, fair play to the film-makers for at least TRYING to do something a little different (assuming that you haven't seen 'Deadheads' which is a bit like 'A Little Bit Zombie'). I guess there are two types of zombie outbreak – the one that consumes the whole world at once and the other than only happens in a localised rural area. In this case we have the latter. While 99% of the world sleeps soundly in their beds, oblivious to the fact that hordes of flesh-eating ghouls are eating people alive in a small town, two couples go on a trip there to plan one of their weddings. And one of them gets infected with the 'zombie virus.' I won't go into how that happened, as, like I say, they do try to be a little different whenever they can. But, as we all know, when you exchange blood with the undead, you begin to turn. However, the man infected doesn't just start tearing apart his party. He's a little more in control than that. A little. So, witnessing his inner turmoil, his friends set out trying to preserve his humanity while doing their best to quench his thirst for human brains. Does it work? Sort of. A few of the acting performances leaves a little to be desired, but, on the whole, the cast are okay. The gore, for those who like seeing heads explode at every possible turn, isn't up to that much. You get the odd 'head shot,' but that's about it. What saves the film from being totally forgotten is the dialogue. The two couples don't really get on well to begin with, let alone when one of their number starts threatening to eat the others alive. Therefore there's quite a lot of nice banter between the four of them which makes it quite humorous to watch. It's a short film, running at less than the standard one and a half hours, but it doesn't really need to be much longer. It's no classic, but it's not that bad either. If you can really stand to sit through another zombie movie (or should I say another 'zom-com' movie?) then you might like it. I read someone else's review online which stated that 'A Little Bit Zombie' is like 'National Lampoon's Eighties Zombie Movie.' That's a pretty good appraisal of the film. http://thewrongtreemoviereviews.blogspot.co.uk/",
         "I was really pleasantly surprised by this film. I just blindly rented this without even looking who's in it, just to find out that Stephen McHattie has a role in it (and while his character might not be the most welcoming one, he's a great actor and it's always great to see him play anything). Apart from that, the rest of the cast was almost unknown to me, but that didn't matter. There have been quite a few good zombie comedies in the recent years, but there also have been quite a few bad ones. This fits into the category of the good ones. It's not top notch, but it does make a lot of fun watching it (even if/when it get completely ridiculous). Obviously they didn't have a lot of money to shoot this, but the end result, does warrant a look or two ... maybe even a bite! ;o)",
         "I am so disappointed. I was really looking forward to this having heard of the concept and read some reviews comparing this film to Shaun of the Dead. Let's be clear. This is nowhere near being on par with Shaun. The film starts relatively promisingly and gradually deteriorates into a mindless, over- acted, unintelligent farce. The blond girl with the glasses and crystal ball is by far the most irritating character I have ever seen on screen and is an awful \"actress\". Any funny scenes are ruined by poor timing and delivery. The dialogue at points makes no sense whatsoever and it seems the actors are reading from two different scripts. It appears a \"Space\" channel movie has slipped passed the net and made itself almost into the mainstream. I was massively disappointed as it was a missed chance to show Hollywood what Canadian cinema is capable. You'd be pretty much better off spending your time doing anything else rather than watching this film. On top of this, the music is also over-the-top and ends up being very distracting.",
         "Not Bad at all. I always felt that the Zombie movie genre always seem to bring out the cleverness in film makers, this movie can be added to that list. It's about a guy who gets infected on the wake of his wedding, but unlike most people he seems to be able to fight his infection. while two zombie hunters attempt to find him and kill him. this guys fiancé, who's desperate to get married embraces what he's becoming and attempts to help him by hunting down his food for him. Like most good zombie movies it's less about the Zombie and more about the social commentary. Everyone believes that Steve's \"infection\" is just cold feet over the idea of marriage to Tina, who can't wait for the big day. Adding more drama to the plot is Steve's sister Sarah whose not into Tina becoming her Sister-in-law Craig who just for laughs helps Steve confirm weather he's actually becoming a zombie or not. An interesting spin on the zombie movie, as it's treated as a Virus that can be fought off. worth seeing if your a fan of the genre.",
         "My expectations for this were less than zero. The truth is 99.9% of low budget horror and/or comedy films of the last 20 years have been utter crap that is a waste of time to watch. Still I try them out, hoping to find that occasional 0.1% that's worth it. A Little Bit Zombie is not a great film or even a particularly good one. The jokes are stale and the fx are mediocre. But it does have a good cast, some decent direction, and an enjoyably upbeat tone throughout. Kristopher Turner is the lead and he's probably the weakest actor in the cast. His mugging and rubberfacing shows his limitations as a comedian. However the rest of the cast picks up the slack and makes the most of weak material. Stephen McHattie and Emilie Ullerup are good fun as a pair of zombie hunters. McHattie seems like he's having a great time with the role. Kristen Hager and Captain Steroids...I mean Shawn Roberts...are good as the sister and best friend. Crystal Lowe is the bride-to-be and she was probably the most enjoyable part of the movie for me. I always try out any movie she's in, no matter the low budgetness, and am rarely disappointed in her performance. All in all, it's worth a gander but still a limited, though pleasant, film to watch.",
         "Meek young man Steve (a solid and amiable performance by Kristopher Turner) gets infected by a virus that causes him to slowly transform into a zombie. Steve not only has to contend with his domineering fiancé Tina (sharply played to bitchy perfection by Crystal Lowe), but also has to elude nutty and obsessive zombie hunter Max (a marvelously loopy turn by the always dependable Stephen McHattie). Director Casey Walker, working from a witty and kooky script by Christopher Bond and Trevor Martin, relates the enjoyably quirky story at a snappy pace, sustains a suitably off-the-wall tone throughout, ably milks the amusing sense of inspired offbeat humor for maximum belly laughs, delivers several hysterical gross-out gags (Steve eats a cute bunny rabbit at one point!), and presents a winning array of engagingly eccentric characters. Moreover, it's acted with tremendous zest by an enthusiastic cast: Shawn Roberts as Steve's easygoing buddy Craig, Kristen Hager as Steve's sassy'n'sarcastic sister Sarah, Emilie Ulerup as Max's perky partner Penelope, and George Buza as jolly butcher Captain Cletus. In addition, this film possesses a certain sweetly flaky charm that's impossible to either dislike or resist. Kevin C.W. Wong's glossy cinematography provides a pleasing polished look. A total riot.",
         "Why did the bunny have to die? This movie is what happens when American Pie and Evil Dead have a bastard child: and I mean this in the greatest way possible! There are a number of visual references to the Evil Dead franchise that will delight Dead fans. My favorite Dead gag is when the infamous \"possessed camera\" makes an appearance. The makers of this movie use plenty of old school practical effects, not shying away from goo for blood or using a puppet for a zombie mosquito. This movie is campy and cheesy and never takes itself too seriously... but in the best possible way. I would recommend this to fans of Ponty Pool, Ahhh Zombies, American Zombie, or bacon as a midnight snack. P.S. Watch through the credits.",
         "This movie ss mosquito flying around, , Mean while a guy, his best friend, his sister, and his bride-to-be (also a \"bridezilla\") come to the Cabin to have Stag night. Craig get bitten by that mosquito zombie, Some he slowly start act a bit different then normal. This movie had me laughing a few times , with some silly gags like Farts and Funny vomits scenes. This had the worst Chick fight ever but I don't think it was meant to be Thst bad, I did find it funny. There were some bloody moment in this, at start and in the last few scenes, The rest of the movie wasn't too bloody As Craig is only a bit of a Zombie,I think the acting was very campy and it fits in perfectly with the rest of the movie. During the credits, there some funny pictures and small scene at the very end, which I thought was nice funny touch to this campy fun movie. it not as good, as the big names, like Shaun of the Dead, Zombieland, Braindead, this movie is more on the level of Fido or Wasting away.",
         "Heading out into the woods to plan their wedding uninterrupted, a group of friends come to realize the strange behavior of the groom is due to a zombie infection and must try to help him cope with the oncoming changes while keeping the wedding intact and him safe from hunting scientists. This here turned out to be quite an entertaining and enjoyable zombie comedy with so many fun and funny moments. The fact that the infection is so early in the film makes the fact that he's resisting for so long the central point in generating the comedy as he can't act as a typical human due to the presence of the infection, yet that infection is causing him to produce more zombified activity that a normal human wouldn't consider, and thus generates some outstanding comedy. From the interaction with the rabbit, the group forced to buy animal brains to get him to eat at a meat-processing plant and the absolutely gut-busting antics of the group being okay with his zombified behavior as it allows them to basically treat him like a human crash test dummy for their own amusement, and it's just so hilarious that the premise is allowing this kind of activity to occur by itself is enough to make the movie worthwhile. While the early parts of him trying to hold it in for his wife's sake and the general disgust amongst the friends towards her for treating him like that are funny in their own right, it's really at the end where it gets really funny. The confrontation with the hunters packs the film's only real gory moments in some fantastic head-shots and blood-splatter, the fact that it's not in that mode at all might be quite a disappointment for some looking for a funny-yet-over-the-top zombie comedy, the fact that it's got the courage to only feature a few of them while concentrating only on the comedy of the premise rather than delve into the conventions of the genre makes for a good time all around. Rated R: Extreme Graphic Language, Violence, Brief comedic Nudity and drug use."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Hemdale Picture Corporation",
         "Cave Painting Pictures"
      ],
      "summaries": [
         "During a weekend at the family cottage in the woods, Steve, a soft-hearted corporate analyst, gets stung by a zombie killer mosquito right before his wedding with Tina, a bossy beautician. Together with them, is Steve's sister Sarah and her friend Greg, who really wish that Steve will soon come to his senses and realise that Tina is just not good for him. In the meantime, without knowing it, a team of zombie hunters, Max, a cold-blooded exterminator and Penny, a scientist with a blue zombie-tracking orb, are in the same woods looking for the undead. When Steve's pulse will begin to fade while at the same time his appetite for human brains will grow bigger, it will be obvious enough that the change has already begun, however, according to Tina, this will be only a minor setback before the big day. Eventually, Steve as a hybrid with his mutated DNA would help in the cure for the infection, but nevertheless, Max and Penny will still have to pass through Tina who really wants to get married.",
         "Infected by a virus, a mild mannered HR manager attempts to fulfill his overwhelming desire for brains, all while trying to keep it together so as not to incur the wrath of his bridezilla-to-be."
      ],
      "budget": 1900000
   },
   "movielensId": 141984,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2012-02-03",
      "dvdReleaseDate": null,
      "directors": ["Casey Walker"],
      "runtime": 87,
      "movieId": 141984,
      "title": "A Little Bit Zombie",
      "mpaa": null,
      "actors": [
         "Stephen McHattie",
         "Kristopher Turner",
         "Crystal Lowe",
         "Shawn Roberts",
         "Emilie Ullerup",
         "George Buza",
         "Robert Maillet",
         "Kristen Hager"
      ],
      "imdbMovieId": "1912982",
      "originalTitle": "A Little Bit Zombie",
      "genres": [
         "Science Fiction",
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["aE_Wmoh2-04"],
      "plotSummary": "Infected by a virus, a mild mannered HR manager attempts to fulfill his overwhelming desire for brains, all while trying to keep it together so as not to incur the wrath of his bridezilla-to-be.",
      "tmdbMovieId": 90118,
      "avgRating": 2.08333,
      "releaseYear": "2012",
      "numRatings": 6,
      "posterPath": "/yMLetKgZByWzWzGLyhMyUn6RHot.jpg"
   }
}