{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "christian film",
            "id": 10060
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt4009460",
      "video": false,
      "title": "Saving Christmas",
      "recommendations": [
         59195,
         31254,
         213803,
         38955,
         78411,
         84293,
         406582,
         33783,
         263416,
         166161,
         325186,
         143142,
         90164,
         155706,
         31991,
         147879,
         238622,
         187276,
         130165,
         308017
      ],
      "backdrop_path": "/d9Qf6mzq9DsS8JXcTdv2HZbKM4M.jpg",
      "revenue": 2800000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Kirk",
               "gender": 2,
               "credit_id": "543f1b60c3a3685e4800059a",
               "name": "Kirk Cameron",
               "profile_path": "/4UX50pc9I9jI4ZiZCnRFjfnHOpb.jpg",
               "id": 78041,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Christian",
               "gender": 2,
               "credit_id": "57f63e229251413610005cac",
               "name": "Darren Doane",
               "profile_path": "/xvzu3IPursRG6pWIgYFpWH5747v.jpg",
               "id": 99388,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kirk's Sister",
               "gender": 0,
               "credit_id": "54e00e5a925141194b004b84",
               "name": "Bridgette Cameron",
               "profile_path": null,
               "id": 1427312,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Conspiracy Theorist",
               "gender": 0,
               "credit_id": "54e00e65925141469f0027e0",
               "name": "Raphi Henly",
               "profile_path": null,
               "id": 1427313,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "St. Nick",
               "gender": 0,
               "credit_id": "54e00e6a9251411956004a82",
               "name": "Ben Kientz",
               "profile_path": null,
               "id": 1427314,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Diondre",
               "gender": 0,
               "credit_id": "5a94a72bc3a36811fb000357",
               "name": "David Shannon",
               "profile_path": null,
               "id": 1986275,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54678768eaeb8118b200037a",
               "name": "Darren Doane",
               "profile_path": "/xvzu3IPursRG6pWIgYFpWH5747v.jpg",
               "id": 99388,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54c415f2c3a36878d0006860",
               "name": "Cheston Hervey",
               "profile_path": null,
               "id": 1418130,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57f63e14c3a3681616005d56",
               "name": "Darren Doane",
               "profile_path": "/xvzu3IPursRG6pWIgYFpWH5747v.jpg",
               "id": 99388,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a94a7820e0a2608780003b9",
               "name": "Raphi Henly",
               "profile_path": null,
               "id": 1427313,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a94a790c3a36811fb00038f",
               "name": "Darren Doane",
               "profile_path": "/xvzu3IPursRG6pWIgYFpWH5747v.jpg",
               "id": 99388,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a94a79ec3a3681249000324",
               "name": "Ankara Rosser",
               "profile_path": null,
               "id": 1844902,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a94a7a992514132610003a0",
               "name": "David Shannon",
               "profile_path": null,
               "id": 1986275,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a94a7bcc3a3681208000385",
               "name": "Kirk Cameron",
               "profile_path": "/4UX50pc9I9jI4ZiZCnRFjfnHOpb.jpg",
               "id": 78041,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a94a7ca0e0a26086c000369",
               "name": "Brian Popkin",
               "profile_path": null,
               "id": 1371388,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a94a7d5c3a36812360003f0",
               "name": "Andy Patch",
               "profile_path": null,
               "id": 1986277,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a94a7e3c3a368124900034a",
               "name": "Tala Bakhtar",
               "profile_path": null,
               "id": 1986278,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.738908,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 295884,
      "vote_count": 33,
      "budget": 500000,
      "overview": "Kirk is enjoying the annual Christmas party extravaganza thrown by his sister until he realizes he needs to help out Christian, his brother-in-law who has a bad case of the bah-humbugs.",
      "similar": [
         9479,
         11395,
         13673,
         11881,
         1585,
         10147,
         13377,
         18147,
         17979,
         323262,
         287903,
         51052,
         5825,
         10872,
         5255,
         772,
         1581,
         8871,
         10719,
         634
      ],
      "original_title": "Saving Christmas",
      "runtime": 79,
      "poster_path": "/pJSrBgZEBiYSQ4MKwMZ8opZFSi1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Provident Films",
            "id": 3291,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Camfam Studios",
            "id": 27610,
            "origin_country": ""
         }
      ],
      "release_date": "2014-11-14",
      "vote_average": 1.6,
      "belongs_to_collection": null,
      "tagline": "Put Christ Back in Christmas",
      "adult": false,
      "homepage": "http://www.savingchristmas.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Darren Doane"],
      "runtime": 79,
      "synopsis": "The film starts with Kirk Cameron sitting on a chair by a fireplace and talking directly to the audience, telling them of his love of Christmas but saying the traditional Christmas imagery is \"all wrong\" and having \"nothing to do with Christmas\", and blaming atheists for trying to take the holiday away from Christians; he also suggests that Santa Claus is a Christian. Kirk goes to a Christmas party at the house of his sister (played by Cameron's real-life sister Bridgette Cameron Ridenour). While there he notices that his brother-in-law, Christian (Darren Doane), isn't celebrating like the others. When asked why he seems so sad, Christian says he feels the holiday became too commercialized and consumerist. Kirk tells Christian that he is wrong and starts reminding him of the stories of the Bible. Meanwhile, two guests at the party discuss conspiracy theories. As Christian complains that several elements of Christmas, most notably Christmas trees, are not biblical in origin. Kirk tells him that Christmas trees were God's idea, since he made the trees. He also says that each tree represents a Christian cross, and suggests the audience to see a cross each time they see a tree. Kirk's brother-in-law is convinced by his arguments, but then starts complaining about Santa Claus for he sees him as an obliteration of Jesus and noticed that \"Santa\" and \"Satan\" have the same letters, but Kirk tells him that the original Santa Claus (before being re-interpreted by western culture) was actually named Saint Nicholas beating up non-believers and people who did not believe enough, thus making Santa a good religious figure; his brother-in-law is now convinced that \"Santa is the man\". Christian is now convinced of Christmas' faithfulness to its religious roots, and the two return to the party. Kirk then explains that the presents at Christmas represent Jerusalem, and that Christmas is \"doing what God does\", as he always gave humanity many gifts. He then suggests once more to bring back Christianity in Christmas for our children. His brother-in-law, as a gift for his wife, organizes the same night a hip-hop dance representing his joy of celebrating Christmas, leading to everyone dancing and partying together. Kirk then tells everyone to feast, and suggests the audience organize the best dinner possible for Christmas, but not to forget this is a celebration of God.",
      "writers": [
         "Darren Doane",
         "Cheston Hervey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4009460/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTc3MTc3Njc5MV5BMl5BanBnXkFtZTgwNzU3NDE4MjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kirk Cameron",
         "Darren Doane",
         "Bridgette Cameron"
      ],
      "reviews": [
         "For those of us who have watched Kirk Cameron pontificate on the wonders of the banana, or read his musings on the legitimacy of the existence of fire-breathing dragons, we know that Kirk Cameron himself is comedy gold. One might expect more hilarity from Cameron in Saving Christmas, but Cameron actually intentionally tries to build a comedy here, and the result is an unfunny, unfocused, interminable mess. The film begins with an uncomfortable scene involving Kirk Cameron sitting in a chair, lecturing at the audience. \"They don't want us to love Christmas,\" Cameron declares authoritatively, never bothering to define exactly who \"they\" are. Cameron drones on for several more minutes, and at this point in the film, I heard a kid in the back of the theater yawn loudly—perhaps an audible protest that this film would not be the exciting romp promised on the poster. Finally, the film cuts away from Kirk Cameron, and we see several characters enjoying a Christmas party. But then we see Kirk Cameron again, the film freezes, and we hear Kirk Cameron narrating about himself: \"That's me—Kirk!\" More lecturing ensues. Eventually, a character by the name of Christian (almost as clever as \"Josh Wheaton\"), a Christian himself, despondently finds his way to a car, apparently disillusioned by the materialism of Christmas. Enter Kirk Cameron, who enters the vehicle and does what he does best—more lecturing. The majority of the film takes place in this car as Kirk lectures to Christian, with occasional cutaways to Biblical imagery. Cameron tries to make the case that Christmas traditions, such as celebratory trees and gifts, all somehow originated with Christianity, not paganism. (Never mind the fact that ancient paganism predates Christianity.) \"Last time I checked, God created the winter solstice!\" is the type of asinine reasoning you'll hear from Kirk Cameron throughout the film. Cameron's facts are both dubious and sparse, and his connections are spurious—but Christian is nevertheless invariably blown away by Kirk Cameron's apparently amazing insight. Perhaps aware that interminable lecturing on its own would be unbearable for an audience, the film provides characters with quirky personalities in an effort to break up the tedium. In particular, we are treated to a scene back in the house of two characters rambling schizophrenically as they drink hot chocolate. It has nothing to do with Christian's story, it makes the movie feel unfocused, it goes on for far too long, and if my theater is any indication, it is not funny at all. In fact, there was dead silence in my theater throughout the entire run of this \"comedy\" film. The film ends with a dance sequence that feels like it lasts ten minutes, as well as multiple, gratuitous blooper scenes—I suppose for no reason other than to pad the running time. Just when you think it's finally over, we see Kirk Cameron again, and he continues to lecture the audience—this time about how materialism is just fine, because Jesus came to us in a material body, after all. One gets the impression that Kirk Cameron actually started reading his own Bible, was disturbed by what he found (such as Jesus' instruction to \"go sell your possessions and give to the poor\"), and produced this film as a desperate justification for his own hypocrisy. At my theater, nobody laughed, and nobody stayed for the end credits. This purported comedy film fails at every level. If you're really looking for a laugh, go back and take a look at what Kirk Cameron and Ray Comfort have to say about the glorious design of the banana.",
         "It's no secret that, on both the mainstream and independent circuit of film, Christian cinema has been a big focus in 2014. Films like \"Heaven is for Real,\" \"Noah,\" \"Son of God,\" and next month's \"Exodus: Gods and Kings\" have all catered to the faithful in some way and have gone on to achieve uniformly strong financial numbers as well. The independent circuit has seen big hits like \"God's Not Dead\" and marginal successes like \"Left Behind,\" \"Mom's Night Out,\" \"Persecuted,\" and \"When the Game Stands Tall,\" all of which finding ways to connect with their target audience in at least recognizing their faith in the cinema, a place where it's fair to believe the religious demographic has felt ignored. Former Television star and devout, outspoken Christian Kirk Cameron has now thrown his hat in the ring, latching on to this newfound trend, and effectively making not only the worst film of its genre but the worst film of 2014. \"Kirk Cameron's Saving Christmas\" is a disjointed mess, structurally pathetic and morally bankrupt as we watch scenes interwoven with little coherency, dialog written and delivered in its most wooden form, and wonderful morals to teach our children, like \"materialism is good.\" The film begins with Cameron sitting in a blatantly artificial living room, decorated with more Christmas lights and flair than Macy's after Thanksgiving passes, giving us an introduction to the film at hand. He states the biggest problem with the Christmas season is the \"people\" who want to segregate the spread of faith and good cheer to the private homes of those who celebrate the holiday or simply want the holiday done away with all together. He rambles on for about three minutes as the introduction sets the perfect theme for this film; it's a circumventing project that never results in a specific or thoughtfully-articulated point. We cut to a Christmas party held by Cameron's sister, where a Santa has been hired, the tree has been erected, the house has been decorated, a feast has been prepared, and everyone is in an incorruptibly cheery mood; everyone except Cameron's brother-in-law Christian (director Darren Doane), who is seen moping around the house before quietly slipping away to his car. Kirk follows Christian and learns the materialism of Christmas bothers him immensely, as he watches kids beg for toys they won't play with in three weeks and parents max out their credit cards, giving way to the materials and the illuminating tree in the center of the room, and all while neglecting the baby Jesus in the manger, who is the ultimate \"reason for the season.\" Cameron begins to initiate flashbacks to biblical times to \"justify\" why we have the Christmas traditions that we do. However, it's not enough that we get a history lesson told from the enormously biased lens of Cameron, but in a dodgy and muddled manner. Cameron gets absorbed in the significance of baby Jesus's swaddling cloth and the original mean-spirited roots of Saint Nicholas (something that will undoubtedly scare and confuse children), never addressing Christian's true distaste for the holiday season. Kirk meanders for about forty minutes, talking himself in incoherent and redundant circles, never addressing Christian's questions in a way that we can extract counterpoints or citing Christmas's Pagan and cultist roots (if you're going to show Saint Nicholas as a brute, at least address the backstory). Interjected in these ridiculously dry biblical flashbacks and in-car dialogs are exaggerated characters masquerading as likable people with personalities drawn so wide they are desperately unfunny. We see two party guests discuss \"The War on Christmas,\" relating it to several other conspiracy theories that just feels like a soundoff of paranoia. We get a few minutes of dead-end, annoying conversation and some of the worst displays of acting this year before it's back to the car for a half-assed lecture. \"Saving Christmas\" ends with an abhorrent dance number to an incorrigible techno/rap hybrid, with members of the cast obnoxiously dancing and doing slow-motion choreography together. We end things with a perfunctory voice-over with Cameron before we're greeted by almost ten minutes of closing credits showing bloopers, outtakes, and a barrage of other things padding this project to just barely being feature- length (eighty minutes). If my plot synopsis sounds like it has not made any sense, then I have effectively lived up to the structure and the narrative pace of this particular film. Just by comparing the full-length film to its trailer, you can tell \"Saving Christmas\" was Cameron's last minute idea to cash in on the Christian cinema craze of the year. The trailer for the film talks about how Christmas has been corrupted by materialism and the political correctness of the holiday. However, Cameron blatantly contradicts his thesis when he states during the closing monologue that \"materialism is good\" because Christmas is about \"God taking possession of a material body.\" Aside from ushering in a pathetic excuse for a moral at the end of a film about Christmas, the cardinal sins committed here run amuck: a sloppy narrative hodgepodge of biblical flashbacks, inept lecturing, and pointless filler clearly padding a small runtime, atrocious acting on all fronts, a desperate attempt at \"staying hip\" and keeping the attention of the audience by throwing in a hip-hop dance number, contemptible morals, and failure to address or even stick to a cogent thesis. Kirk Cameron and company should be required to volunteer at local charities or help cater several breakfasts with Santa to make up for such a yuletide atrocity.",
         "I created this account just to give this 1 star. That's how bad it was. I went into this expecting a generic Christmas movie, and I didn't even get that. The \"plot\" is awful. I put plot in quotation marks because I'm not even sure if this movie has one. Two guys walk out to a car and talk for an hour. That's all that happens. It's basically a feature length sermon, and a crappy one at that. There are literally NO redeeming qualities in this film. The camera work is extremely amateurish, and the acting and direction were absolutely abysmal. I had extremely low expectations for this, and it still managed to be disappointing. This movie is a total waste of time and money, and I honestly believe it's the worst movie of 2014.",
         "The loser Kirk Cameron actually tried to falsify the rating for this movie here and on Rotten Tomatoes. Someone should tell him that lying and cheating are not acceptable Christian values. Someone should also tell him that he's celebrating a Pagan holiday. These things he decided are what makes Christmas what it is are the commercialized things that don't actually have anything to do with Christmas. It's like the guy owns stock in Christmas supplies. If you claim you like this movie, you are a liar. Since lying is a Christian no-no, you're going to Hell. Enjoy. Not everyone should be allowed to make movies, especially when they have a political or religious agenda. God likes an honest Atheist more than a lying Christian.",
         "Saving Christmas needed saving...and by that, I mean it should have been mercy killed. the acting is horrendous and it's story is only a reminder that anyone that paid to see it wasted their money. Even if you are a die-hard Christian, please do not see this movie, it's one of the worst movies you could ever watch ever, and considering stuff like The Room and Birdemic exists, That's saying A lot. oh, and that thing Kirk Cameron's doing to try to boost the rating on Rotten Tomatoes: Cameron, you should know the Bible verse \"Thou shalt not bear false witness\" it's one of the 10 commandments. That's all I have to say on this matter, Don't watch the film. I mean Seriously Cameron, you should know better.",
         "Every so often, a movie comes along that reminds us why drinking games were invented. This is that movie. Three margaritas seems to be the minimum for watching this one. With that much tequila in you, you will be able to appreciate the subtle humor and profound wisdom of Kirk Camer...hmph....hmph....hmph....BWA-HA-HA-HA-HA-HA-HA!!!!!!!!!! Sorry. I thought I could type that with a straight face. I couldn't. Must be the margaritas. At any rate, this is a laughably bad movie that should go a long way toward torpedoing Mr. Cameron's already sinking career. And I say, fire at will!",
         "This movie is horrendous on so many levels - patronising to Christians, incredibly bad plot and direction, the acting and dialogue is as comfortable as a dentist's visit. I suspect the whole thing is purely a desperate attempt by Cameron to pander to under-educated Christians in an effort to earn their hard earned dollars. Either that, or it is just a giant ego trip for him. I had no preconceptions before I went to watch this, and left confused as to the amount of utter garbage wedged into what seemed like an eternity of boredom. Even worse, he is asking his Christian supporters to bear false witness by skewing the votes here and on rotten tomatoes. Hypocritical? I'll let you decide.",
         "First, let me state that in spite of the claims of Cameron and those who support him (and who have attempted to artificially raise this movie's ratings with fake profiles and fake reviews), I, as someone who hated this movie, have nothing against Christians or Christianity. Not at all. Most everyone I know and love _are_ Christians. Die-hard, conservative, dyed-in-the-wool Fox-news-loving fundamentalist Christians. And even THEY thought this movie sucked. That Kirk tried to use religious guilt on people to have the ratings artificially inflated is just pathetic. Seriously, dude, you have a problem. You need help. Get some. :-/ My opinion of this movie is pretty much the same as the opinions of EVERYONE I know who's actually had the misfortune of deciding to give it a try. It would be pure camp if those who made it weren't being so stone-faced serious. It's patronizing, condescending, childish and just downright _bad_. And it's not the message, itself - even those I know who agree with the central point Kirk's trying to make see the movie as doing more harm than good. As for that illicit ratings-inflating campaign, it appears to be bearing fruit. When you have a movie with overwhelmingly bad ratings (and I man REALLY bad, where most are just 1-star with, shall we say, \"Nothing nice to say...\"), and just a couple of profiles with 10-star ratings and glowing things to say, and ALL of those 10-star profiles were clearly just set up just to make the glowing review about just that one movie... I'm not going to outright accuse anyone of anything, but, well, it doesn't inspire confidence in their legitimacy. I mean seriously, dude, stop it. You're not helping Christianity's image at all. In fact, you're making it worse. Even if you don't care about your own image, you should seriously give thought to how much more damage you want to do to the Christian image in the U.S. today. Or are you a closet atheist trying to destroy the \"enemy\" from within? Your actions are hurting far more than helping. And I have nothing against Christianity or religion in general. If people want to be proud of their religion and remind themselves of the spin Christianity has added to the meaning of all these previously-existing traditions and holidays, that's wonderful. But this? This isn't _that_. This is just pandering, patronizing, exploiting - pure and simple. Please, Kirk, get help.",
         "Every Christmas season one can count on the fact that we will be inundated with TV shows recycling the It's A Wonderful Life story, Hallmark Channel will overwhelm us with treacle, and a spate of Christmas-themed films will multiply at the cineplex to raise holiday spirits. I give extremist Christian Kirk Cameron dubious credit for crafting a Christmas-themed film that actually seems to be completely clueless about the meaning of Christmas. It goes without saying that the film resembles a glorified home movie, with horrible writing, worse acting and horrendous production values. Most of the film functions as little more than an unwieldy frame for Cameron to lecture at the audience using the most spurious of \"facts\" and a dubious re-writing of history. The basic \"story\" opens at a family Christmas party where Kirk's brother-in-law, Christian (oh the irony!) is all rather overwhelmed and depressed by the materialism of the holiday and feels that the true meaning of Christmas has been lost. This \"attitude\" apparently irritates everyone else, and so Kirk follows Christian to his car to harangue him on his misguided foolishness for the extraordinarily padded 80 minutes running time. Most of this has the camera focused on Cameron's perpetually smug smirk while he relentlessly lectures his hapless brother-in-law with outright lies, heavily abridged stories, and general all-around shaming. Interspersed to pad the running time, we take some brief breaks back into the house where completely ridiculous one-note flamboyant caricatures indulge in laughable conversations that no one you know not in a padded cell will ever have with you in your lifetime. The pathetic point though is that during Cameron's often incoherent and misleading ramblings, he never once truly addresses any of the issues that Christian had about the materialism of the modern celebrations. Nevertheless, Kirk's relentless verbal diarrhea utterly astounds Christian and makes him \"see the light\" and he returns to the party to beg the forgiveness of everyone there for negatively impacting their celebration. Then, Kirk launches into yet another lecture where he urges us to buy the biggest tree, get the richest butter, and max out the credit cards because this is all a part of Christmas and don't let anyone tell you otherwise. I myself was raised a Christian and I can assure you that if anyone were to parrot this thought back to any of my religion teachers, their mouth would be washed out with soap. It is a perfectly despicable moral and abysmal coda to an already dreadful \"holiday\" film, which does the unthinkable of surpassing Christmas with the Kranks and Jingle All the Way as the most morally jaded holiday film in history. The film also includes a relentless unfunny blooper reel AND a dance sequence that must be seen to be believed...or better yet don't see it at all.",
         "After seeing all the negative reviews of this film, I had to check it out. I heard about Kirk Cameron's up voting campaign on Rotten Tomatoes and the ensuing backlash from atheists and so on. But I wanted to see if the film was really that bad. It is. It's really awful, probably the most awkward, uncomfortable hour of my life. Troll 2 was funny on a So-bad-it's-good level, so was The Room. But this is just painfully bad. This film aggravates me on so many levels. But I want to leave out the B.S religious side of it, there's more than enough reviews, even from Christians, attacking this film for it's head scratching Evangelical nonsense. Instead, I'd like to focus on an aspect of the film that I feel has been overlooked, the historical \"facts\" that Cameron pulls out of his arse. I'm a history buff, and this film made me so angry. Cameron expects us to believe that St. Nicholas got so angry with Arius that he dragged him out into the snow and beat the crap out of him with a staff! He did no such thing. As one of the bishops who signed the Nicene Creed, St. Nicholas got into an argument concerning the divinity of Christ and punched the Christian presbyter in the face. Then there's the barking mad argument about the pagan roots of Christianity which Cameron dismisses, claiming that everything was created by God and therefore everything to do with Christmas can be traced back to God, even the Nutcracker! And on it goes... The arguments make no sense, the acting is horribly stilted and the 'comedy' is painfully bad. It's such an incoherent, rambling mess from \"Crocoduck\" Cameron that by the time he's dancing and doing the worm, you just have no idea what you're watching any more. Worst movie ever made in the history of motion pictures.",
         "I never thought a movie could be as bad as Battlefield Earth, until this was released.The movie starts of literally with no plot and from there it is just Kirk and his \"brother\" Christian talking in a car. Kirk, you have not saved Christmas, you have ruined it just like you did film. What you tried to do is make everyone follow what you think Christmas is all about. Literally, this man cherry picks the Bible and creates his own version of the story. You know it amazes me how Kirk finds a\"good way\" to say \"materialism is right\". How does he go from making such a great movie like \"Fireproof\" to this???? I am sorry as a Christian, but it was just so bad. Again, Please if you know what's good for you, don't watch this movie, it is that bad.",
         "Forget the laughably shoddy production value, the overt preaching, and Kirk Cameron's epic social media temper tantrum when the film was critically panned. All you need to know is that Cameron's message about Christmas is the opposite of what one would expect from a movie called \"Saving Christmas.\" See, that whole \"saving Christmas\" storyline has been played out in kids' movies and Hallmark specials over and over again, and it's always about stripping away the commercialism and materialism and getting back into friends and family. Kirk does the exact opposite in this film: He CELEBRATES and ENCOURAGES rabid commercialism. And worst of all, he even attempts to justify his materialism -- his greed and narcissism -- by claiming that's the good proper Christian thing to do. So if not from rabid consumerism, what is Kirk Cameron trying to save Christmas from? From people celebrating, or even acknowledging the existence of, other holidays besides Christmas, from non-Christians celebrating Christmas, and from Christians celebrating Christmas any other way than the way Kirk Cameron believes you should. In short, this is eighty minutes of Kirk Cameron trying to cram one hundred pounds of his self-absorbed discount-salvation bull**** into a one-pound bag, slap \"Christmas Spirit\" on it with a label maker, and hopelessly attempt to cram it down your throat. Unless you are a raving fascist fundamentalist who only hasn't watched this movie because you are afraid of what will happen if you turn your 24/7 Fox News feed off, this movie is guaranteed to make you very angry. It does to Christmas the exact opposite of what the title promises: It delivers unto Christ this biggest black eye in our lifetime.",
         "This movie was a joke. Don't waste your time or money. It's a typical pandering movie that will no doubt be forgotten. Cameron claims that Christmas has become too materialistic, yet in a recent article claimed he was a 'sucker' for all things Christmas. The decorations, the gifts, the trees (which are Pagan by the way), and the shopping. He stated in an article he was a sucker for these things. Pretty much in contrary to his movie. He even once claimed Halloween was stolen by the Pagans from Christians. Kirk Cameron is quite clueless. Even Christmas is Pagan. He's a joke and so are his movies. His movies are made just to line his pockets. He And he's a bigot to boot.",
         "I'm kinda in charge of my church's youth group. It's because I'm the only guy in their 20s that shows up for church. I don't know how we ended up seeing this movie because none of us wanted to see this. The teens didn't want to see some religious movie, my pastor didn't want to see this because she loathes Kirk Cameron, and I didn't want to see it because I wanted to see a good movie. Apparently one of the parents insisted we see a documentary about making Christmas more about Jesus and less about commercialism. Well the jokes on them because shockingly this movie is all about justifying the commercialism of Christmas. I was seriously not expecting that. THis movie throws so much BS at you that it's pretty worrying. It's also really funny. I think I was the only person who enjoyed this movie. I was hoping that Kirk would have a seeing where he's just says insane things like his infamous interview on evolution. This whole movie is insane. I don't think anyone was expecting it to be like this with the random dance scenes, the stereotyped black guy, the stereotypical atheist, and everything else. And now here is an example of Cameron's crazy points about Christmas: -The Christmas tree is not Pagen, it is because Adam and Eve stole from the tree of knowledge and to make up for the original sin, Jesus returned the fruit which was part of man by hanging himself on a cross, which is made of wood which naturally comes from a tree. So trees are really crosses and the Christmas tree is a cross. I did not make that up, that is seriously an argument he makes. And the whole movie is so insane that you have to see it to believe it. I don't think this movie will harm society because I think most Christians who make a big deal about the \"War on Christmas\" will be horrified by this and those who actually buy into it were probably lost causes. But if you want to see a man who clearly needs to be institutionalized just be gloriously and honestly insane, then watch this movie. I haven't seen anything this funny since Twilight Breaking Dawn Part II.",
         "When a movie makes the bottom of the IMDb worst movie list, I have to see it in the theater if at all possible. For weeks now, I read the bad reviews, read Cameron's plea for fans to up his ratings online, and anticipated this getting cam'd so I wouldn't have to pay good money to see it. Unfortunately, it's not even good enough for someone to cam and upload online. The problem is that this movie never should have been released in theaters; it should have been straight to video. More accurately, it never should have been released at all. All this film equates to is a big stroke of Cameron's ego. He is clearly in love with himself, and I'm sure every review, good or bad, makes him feel all the more confident. It's sad, but true. Or, maybe he was just trying to do something nice for his family. If you have the money, why not make a movie with your sister so she can feel like a star too. Unfortunately, she probably feels more shame than good. There is no doubt here. This is a bad movie. Yes, I might even say it's the worst movie ever. I've never walked out on a movie before, and that record still holds. However, the thought passed my mind several times while watching. I now feel ashamed of myself that I did not. The bastardization of Christianity that this movie inflicts upon the viewer is almost unbearable. I'm sad to know that I supported Mr. Cameron by paying to see this film. However, I am happy to see this filth voted into oblivion.",
         "This has to be one of the most insulting and wretched movies of all time. It doesn't even look like anyone bothered to edit it competently, much less write a decent script. Don't bother with this unless you need to educate yourself on the latest crap out of Kirk Cameron's pie hole. Just total garbage. I'd personally like to know what exactly happened to this kid back in the 90s to cause this mess. Please. If you see this film then give it a review here. People need to be warned fairly about the disgusting nature of it as well as the incompetent work done in it.",
         "I barely survived the trailer. I have no idea how people paid money to see this movie. As a Christian, I have to beg Christian filmmakers to stop preaching to the converted by writing atheists and agnostics as idiotic, hateful, anti-Christian monsters. Your persecution complex in a country comprised almost entirely of Christians is laughable and only further isolates you from those you hope to convert. Kirk Cameron could have made a movie that's actually about family and the true meaning of Christmas. Instead, he wanted to create a polemic against the people he's imagined that are trying to prevent him from calling it Christmas. It's just sad. Please stop making these terrible films. You're embarrassing all of us.",
         "Kirk, you set new standards for just how low the bar can be. I don't know what genre this movie would fit int but it somehow is humorous and terrifying at the same time. I'm not sure if it was satire or you really believe in your own bu11sh*t. The message of this movie was so forced and there were more logical fallacies than I could juggle with. I almost recommend others to watch it because the entirety of FAIL this film contains is too much to believe. The record score of 1.5 stars should tell you something, Mr. Cameron. All hope isn't lost though, you may make a 1 star film that would make this one look better. Having less arbitrary music, better acting, and improved cinematography over all might be a good start.",
         "Truly the worst serious release of 2014. It fails on so many levels. 1st there is acting, it was comparable to a late night infomercial where you have the straw man doubting things then Kirk explains and boom Kirk's explanations was so enlightening that he goes \"I never thought of it that way\" I'm surprised there wasn't a \"wait, we will double the order\" flashing on the screen. Now writing, this has to be a small Christmas miracle in itself, he managed to offend atheist and Christians at the same time. Embrace the commercialism and because Jesus was god made flesh would should indulge the flesh and buy, buy, buy. \"Picture the wrapped gifts as the New Jerusalem\" and point taken from some far fetched sermon about the most important part of Christmas is the swaddling cloth. I wish I was joking but you just can't make this stuff up. Last there is the directing choices, hey let's shoot the most of it with 2 guys sitting in a car. The movie was lacking material and really feels like it was dragged out. And the pièce de résistance is the musical Christmas wrap number.",
         "Kirk plays Kirk. Bridgette plays Bridgette. That is about how inventive this movie is. Darren plays Christian, because the audience isn't expected to understand that he is a typical Christian without this clue. Given that, Kirk should have been named CluelessLecturer. I didn't stay long enough to see if the Titanic sunk, or if there was a surprise ending. As I watched this movie I realized that I would likely never again have to modify my \"worst movie ever made\" and for that, I thank you Kirk. GOOD POINTS: 1) no other movie through 2020 will have to worry about being Worst Movie of the Decade 2) we don't make movies on \"film\" any more, so this is not a waste of film--- just a waste of digital 1s and 0s 3) i had more time to concentrate on my popcorn 4) i used my phone in the theater during the movie, and nobody seemed to think it was a bad thing Kirk, it rained in California this week---- I think God saw your movie and was crying.",
         "This movie is so, so utterly wretched, not only in its execution but also in its conception. Just from a filmmaking perspective, it's extremely shoddy. Many portions look like home movies. A large part of the film is Cameron sitting in a car talking to a friend, and that's not interesting to watch. \"Comedy\" scenes have nothing to do with the rest of the story, and are creepily unfunny. A bizarre dance scene at the end is out of place and seems inserted to extend the time. Cameron's presence here is smarmy and smug; he lays out his spiritual views and his friend just gushes about how right Cameron is and how he's helped him see the light and love Christmas and all that. A bigger problem is the misinformation that Cameron spews so authoritatively, some of which runs counter to the Bible and to known history. To give a partial list: Cameron claims that Joseph and Mary were hiding from soldiers sent by Herod to kill all babies being born. But the Gospel of Matthew says the soldiers were sent by Herod AFTER Jesus was born, when Herod was tipped off by the visiting Wise Men that a King of the Jews had been born. Joseph and Mary then took Jesus and did the Flight into Egypt to save the child's life. Cameron insists the Nativity took place in a cave because the manger was made of stone. No source claims the manger was stone, or that the Nativity took place in a cave. Matthew says it was in Joseph's house in Bethlehem, Luke says it was a stable. This seems like a post-hoc attempt to link the Nativity with the Resurrection. Cameron says frankincense and myrrh were \"funeral spices.\" Although myrrh had been used in Egyptian mummification, frankincense was not, and both were much more commonly used as a sacred incense in Hebrew temples. He goes into detail about Saint Nicholas' life, presenting it as fact, but in truth very little is known for sure about him, and some Christian leaders openly suggest that he may never have existed. All that is known for sure is that someone named Nicholas was at one point the Bishop of Myra; everything else is unsure and in the territory of legend and myth. Legend has it that during the Council of Nicaea, Nicholas angrily struck Arius in the face for saying that Jesus and God were separate. Cameron depicts Nicholas savagely and brutally attacking Arius and beating him with a shepherd's crook, a scene many Christians found objectionable. Cameron depicts the historical Saint Nicholas climbing on a sleigh to deliver presents to children, something he never did in any legend. He also claims that Saint Nicholas is the gift-giver everywhere, also not supported by history. Some areas give gifts on Christmas, others at Epiphany, others on St. Nicholas' day, and in some areas the gifts are delivered by someone else entirely, such as La Befana in Italy, St. Basil in Greece, the Yule Lads in Iceland, St. Lucy in Croatia, and multiple countries have the gifts delivered by the Magi, angels, or the Christ Child himself. Cameron says Nicholas was \"sainted,\" when in reality Nicholas was never canonized. His sainthood was more by word-of-mouth. Cameron makes an elaborate rationalization for Christmas trees relating to the crucifixion and to the Garden of Eden; this connection is very convoluted and labored, and doesn't hold water. And he doesn't address the parts of Jeremiah which some feel are a commandment against Christmas trees. He claims that gifts piled under the Christmas tree are perfectly acceptable as they are reminiscent of the skyline of Jerusalem. By that reasoning, they could also be the skyline of Babylon or Rome, and could represent oppression and slavery. It's a poorly considered analogy that should never have been included. I'm sure I'm missing other bits, but I'm not inclined to go back and watch it again. It's unsettling to see Cameron stand and claim that it's OK to be materialistic at Christmas, because that's when God came to the Earth in material form. (That's pretty much a direct quote.) Never mind the many passages where the Bible tells us to set aside worldly things and not be materialistic! He exhorts viewers to eat themselves to bursting and buy the biggest ham and the richest butter....but isn't gluttony considered a deadly sin? At no point does he address such issues as helping the poor, feeding the hungry, giving to charity, volunteering, or anything. One is left with the impression that one should only think of one's self and one's immediate family and friends. Does Cameron remember Jesus' command to his followers to give away all they had to the poor? Somehow, I don't think so. Cameron gives the impression of someone who read parts of the Bible long ago, but rather than fit his life to the Bible, he is fitting the Bible to the life he wants to lead, and making one justification after another without ever bothering to double-check if he's remembering it correctly, or if there's something in the Bible that disagrees with him. It's clear he considers himself a better Christian than you. Many of the faithful have been turned off by this movie, some even going so far as to declare it blasphemous and call Cameron a false prophet. I'm not so sure I would agree, but at the same time, this movie does have some value of showing how even a faithful Christian can fall victim to the sins of pride and arrogance. It's clear that Cameron's ego was in overdrive, and this movie is not as much a testament to God as it is an expression of Cameron's arrogance.",
         "Acting, cinematography, scripting, effects, direction, acting again; all of these components are done in the worst way possible. That said, you need to see this. It's not often that we come across a movie that's so abysmal that it requires study. Like The Room, Troll 2, After Earth, it's so bad that you can't help but enjoy yourself in watching it. The leaps of logic Kirk Cameron makes to justify his points, a pro-materialistic viewpoint while still claiming to be true to the teachings of Jesus, has to be witnessed to be believed. I bet you didn't know that every tree in the world is also a cross which is also the tree from the garden of Eden, and putting Jesus on the cross is also like putting ornaments on the tree, which is symbolic of putting the fruit back on the tree of knowledge. Or that Saint Nick was a real bad dude (and by bad, Kirk means good), who beat people brutally in the name of Christ. It's really a baffling exercise in doing everything wrong, and you have to see it.",
         "This movie was so horrible that the CIA could use it to torture terrorists. Being forced to watch just a few minutes of this would be enough to make any one give up all their secrets just so they don't force you to watch it again. Kirk Cameron has proved that he is a nut time and time again. This time he makes a cash grab for money with inconsistencies in history and then uses the same logic and lack of intelligence as he did in Way of the Master. I can find no redeeming qualities of this movie other than it finally ended. Worst movie ever? Eh, well maybe not, but it definitely deserves to be in the bottom ten for the historical and scientific inaccuracies.",
         "I have to admit, that I hadn't even planed to go to the movies on the day that I walked into \"Saving Christmas\". There was nothing on offer that interested me, so I turned to figure another way to squander my money. But then I saw the name \"Kirk Cameron\", saw that pasty face on the poster and two words came to my mind: \"Crockoduck\" and \"Banana\"! Yes, through the internet-memes and jokes I had been exposed to Cameron and his ilk. Upon realizing that those people were not comedians, I figured this was the most hilarious insane stuff I had heard in a long time and that Kirk Cameron may well be the missing brother of \"Dumb and Dumber\". So I flashed the buck, walked in and expected much unintentional hilarity and future memes in the making. There were about 10 to 15 people sitting in the cinema, most with kids (I presume they were expecting a Christmas comedy). For a good deal of the beginning we are exposed to Cameron brattling on about some things or other, but it was mainly boring, nonsensical stuff that contained no (unintentional) comedy gold. Only when Kirk spouts that \"god created winter solstice\", there was some chuckling to be heard. Not bad, but heard before (what hasn't god created allegedly? Cars, air, shoes, bacteria, the universe and everything else, etc – this answer will give you a guaranteed A+ in any bible- or koran-school). At this point Cameron is sitting in some car with another guy and, like a true believer he keeps rambling and rambling and rambling. Nodded off for awhile but since I have a light sleep and get easily awoken by noise, I can only deduct that there was no joke missed since nobody had been laughing so far. At what I presume must have been the end of the \"movie\" there was some ridiculous dance-sequence (you know the type that should signify to the audience that they're watching a 'hip' film) and I decided to call it a day. As I turned to leave, I noticed that the cinema was empty and that I was the last rat to leave the sinking ship. So I left Kirk and his friends to dance to an empty cinema – and for all I know, they still dance there as I write. Look, we are all aware that people will believe much if only it gives them a crutch for reality. Virgins giving birth, horses flying from Mekka to Jerusalem overnight, zombies rising from the grave in order to bring world-peace, etc. It would be pointless (and perhaps even unkind) to point out that virgins cannot give birth, horses don't fly and that the dead stay dead. But that's were magic and science clash, alchemy has to make way or chemistry and believe hollers at common-sense and knowledge. Nothing new there, it's been going on since the stone-age. But the stuff that Cameron and his ilk have formulated here (to put it kindly), that's a whole new dimension of crazy. It reeks not only of fanatics but of self-serving. And the worst sin: this movie is boring, tedious and free of laughs, no matter which way you slice it. The lesson learned: it can be mildly amusing to watch a five minute YouTube video about a deranged guy, but giving him 80 minutes of your live, that's simply not a good idea. It's like holding a 'deep' conversation with a bunch of jehova's witness or the guy on the corner with the \"the end is nigh\"-sign – what's the point if no real laughs are to be had? Just wait for the internet-meme; if there's something worth laughing about, the \"haters\" will find and post if for sure (and it's free!). \"Jesus Camp\" was funnier (and \"Jesus Camp\" was actually a very sad movie). This here is \"IMDB Bottom-100\"-material. Now, enough electronic ink wasted on this. Let's make space for those who found the movie \"exceptional\", \"inspirational\" and \"great education\" – you might be able to guess from which corner those come. What I give this tripe? Of course nothing. If you see a one point rating, it probably comes from god (pardon, meant to say IMDb)",
         "I never in my life thought a movie would be deserving of a rating a full point lower than \"Santa Claus Conquers the Martians.\" Call it a Christmas miracle. There are movies that are boring, there are movies that are factually incorrect, and there are movies that exist solely to pander to a specific audience. This movie is deserving of recognition for, incredibly, setting records in all of these categories. Only an amazingly uneducated person who has expended a large amount of effort sticking their head in the sand for a large portion of their existence could possibly rate this movie in the 2-4 range. Anyone above that is simply bearing false witness (against the Bible's commands, by the way) at the request of Cameron himself."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Camfam Studios",
         "Liberty University",
         "Provident Films"
      ],
      "summaries": ["Kirk is enjoying the annual Christmas party extravaganza thrown by his sister until he realizes he needs to help out Christian, his brother-in-law, who has a bad case of the bah-humbugs. Kirk's fresh look at Christmas provides Christian's the chance to see Christ is where He has always been: at the center of our Christmas celebrations and traditions. Can Kirk save his in-laws opinions on Christmas or will he have to celebrate a holiday like this without him?"],
      "budget": 500000
   },
   "movielensId": 141994,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-11-14",
      "dvdReleaseDate": null,
      "directors": ["Darren Doane"],
      "runtime": 80,
      "movieId": 141994,
      "title": "Saving Christmas",
      "mpaa": "PG",
      "actors": [
         "Kirk Cameron",
         "Darren Doane",
         "Bridgette Cameron",
         "Raphi Henly",
         "Ben Kientz",
         "Isabella Cameron"
      ],
      "imdbMovieId": "4009460",
      "originalTitle": "Saving Christmas",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Kirk is enjoying the annual Christmas party extravaganza thrown by his sister until he realizes he needs to help out Christian, his brother-in-law who has a bad case of the bah-humbugs.",
      "tmdbMovieId": 295884,
      "avgRating": 1.03333,
      "releaseYear": "2014",
      "numRatings": 15,
      "posterPath": "/pJSrBgZEBiYSQ4MKwMZ8opZFSi1.jpg"
   }
}