{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "alice in wonderland",
            "id": 12552
         },
         {
            "name": "rabbit",
            "id": 15199
         }
      ],
      "imdb_id": "tt0004873",
      "video": false,
      "title": "Alice in Wonderland",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe49bc9251416c910b72a9",
               "name": "Viola Savoy",
               "profile_path": null,
               "id": 1169949,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "White Rabbit",
               "gender": 2,
               "credit_id": "52fe49bc9251416c910b72ad",
               "name": "Herbert Rice",
               "profile_path": null,
               "id": 1169950,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "The Dodo Bird",
               "gender": 2,
               "credit_id": "58d7d3b4925141445f00d7dd",
               "name": "Harry Marks",
               "profile_path": null,
               "id": 1784053,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "The Dormouse",
               "gender": 2,
               "credit_id": "58d7d3bc925141448e00dec5",
               "name": "Louis Merkle",
               "profile_path": null,
               "id": 1784054,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "The Mad Hatter",
               "gender": 2,
               "credit_id": "58d7d3c3925141445f00d7ec",
               "name": "William Tilden",
               "profile_path": null,
               "id": 1784056,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49bc9251416c910b72a5",
               "name": "W.W. Young",
               "profile_path": null,
               "id": 1169948,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58d7d38ec3a368121b051b57",
               "name": "Lewis Carroll",
               "profile_path": "/9KAz7LDjIk4WAZO5lJAicRDxYiG.jpg",
               "id": 70647,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "58d7d39ec3a3681289058197",
               "name": "W.W. Young",
               "profile_path": null,
               "id": 1169948,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.073074,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87300,
      "vote_count": 2,
      "budget": 0,
      "overview": "A German adaptation of the classic Lewis Carroll story.",
      "similar": [
         1903,
         12092,
         81188,
         258230,
         11360,
         30923,
         300,
         638,
         10836,
         12155,
         492,
         14836,
         856,
         150540,
         241259,
         269149,
         630,
         4593,
         301804,
         1429
      ],
      "original_title": "Alice in Wonderland",
      "runtime": 52,
      "poster_path": "/9YJqY2MWOUzy60iMhniOF4NEZRs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Nonpareil Feature Film Corp.",
         "id": 88251,
         "origin_country": ""
      }],
      "release_date": "1915-01-15",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["W.W. Young"],
      "runtime": 52,
      "synopsis": null,
      "writers": [
         "Lewis Carroll",
         "W.W. Young"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0004873/",
      "coverLink": null,
      "actors": [
         "Viola Savoy",
         "Herbert Rice",
         "Harry Marks"
      ],
      "reviews": [
         "Finding a recorded copy may be hard to do, but not impossible. There are at least two versions that have survived from the original, both lasting approximately forty minutes. The original was a six-reeler, or about an hour long, which may also have included scenes from the \"Through the Looking Glass\" story. Minimally, what has survived is missing the defining scene early in the story where Alice grows very big and than small, then later the Mad Hatter scene. We know that these scenes were originally included because Grosset & Dunlap published a book version in 1916, illustrated with pictures from this film. This shows that in addition there was also an Oyster, Humpty Dumpty, Tweedledee and Tweedledum, chess room, and a Queen Alice Banquet scene, but whether as part of this film or another is not clear. Viola Savoy was fifteen years old at the time, and a well known child actress for having toured the nation for several years in the road-show version of \"The Littlest Rebel.\" Whether she was the first to perform the role of Virgie in that play, or not, clearly she was the most popular, which fact contributed to her being cast as Alice in this film. As interviewed in 1912 she had been acting since infancy in over one hundred and twenty different productions. After the \"Alice\" film, however, she appeared in no more than one or two more films before disappearing from the pages of history. Attempting to evaluate the quality of a circa 1915 \"photoplay\" rather assumes too much. The industry was yet very young. The notion of \"close-up\" photography was only beginning to be experimented with and hence, more often, the camera just cranked away from a fixed position, rather like someone sitting in the audience of a typical stage play. While plenty of creativity went into the costuming and set design for this film, the camera remains conspicuous for its lack of imagination. Everything is shot from a distance, and as a result, often there is too much going on to keep track of, and the more subtle features cannot be seen. The nuances of facial expression, therefore, have a forced and exaggerated quality which does nothing to flatter the actress. Additionally, the restricted camera position forces her to be upstaged in all too many scenes. Even so, it is a hauntingly captivating film, delightful to see.",
         "Before I jump into the review, I have a confession. Although I've seen several versions of \"Alice in Wonderland\", I really think it's a pretty stupid story and I've never particularly enjoyed it. However, I am a huge silent movie fan and this film is available to watch for free from the IMDb link, so I broke down and watched this film. At 42 minutes, it might seem awfully short, but for 1915 that actually is a full-length film. Unlike later versions, I will admit that this 1915 version is much more episodic--almost like vignettes strung together instead of a smooth story. However, I was VERY impressed by the film for several reasons. Using 1915 technology, it would have been hard to make a better film with better props and better costumes. I was blown away by how much the characters looked like those in the books. Because of this, it's obvious it was not just a cheap slapped-together film but one with a considerable budget for the time. While kids would probably be bored to tears by this film, old movie buffs won't and will probably appreciate this simple but enjoyable version. I still don't love the story, but this is awfully good for what it is.",
         "As the longhaired must know by now, this German Count has a likeness for the non-conventional (for example, my dearest German fat heiresses) and a particular and aristocratic taste for bizarre beauty. With this in mind, then you even can comprehend why this Teutonic aristocrat loves this film so much; it's one of the most remarkable silent discoveries from the last visit to the Schloss cinema. The film is \"Alice In Wonderland\", a beautiful (always at the top of this aristocrat's criteria\u0085) and astounding film adaptation of the well-know oeuvre by Herr Lewis Carroll. This film was the third film adaptation of that novel and was directed by W. W. Young. For this German count, it is among the best that he has watched with or without a monocle in his eyes. The film, starred by the youngster Viola Savoy, is a continuous show of incredible and amazing costumes (which would be perfect for an aristocratic fancy-dress ball\u0085). The pageantry enhances the fantastic spirit of the novel and displays a marvelous, bizarre and unique world full of fantasy and imagination that can be enjoyed by youngsters or even serious aristocrats. The film has not completely survived until modern days (and it's a shame, certainly). In spite of this, the audience will enjoy the animal characters depicted in the film, which include a bizarre Cheshire cat, an astounding caterpillar or a funny Queen Of Hearts. This last one, as it happens with many of the aristocracy, has a special hobby. Namely it's to cut off their subject's heads (this German Count doesn't understand why some of you are shocked when this aristocrat merely whips his servants\u0085). There's a special gallery of characters from dreamland. The film has few special or optical effects. But in this case they are not necessary. Thanks to the craftsmanship provided by the art designer that's shown in the film, we have proof that in those silent days that imagination and originality is the only thing that counts in order to achieve marvelous results. Thanks to its imagination, costume designer, boldness and skillfulness Herr W. W. Young film direction, \"Alice In Wonderland\" it is, for this German Count, the best film adaptation of the Herr Carroll's novel. It's a special delicacy: an early silent film masterpiece that every silent film fan shouldn't miss. And now, if you'll allow me, I must temporarily take my leave because this German Count has an appointment with that foolish heart Queen. Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
         "This very early cinematic version of the Alice in Wonderland story is well worth tracking down if you are a fan of the silent era. I don't really know the Lewis Carroll story very well so I don't know how faithful this adaption is but, like a lot of other very old movies, this one is seemingly not entirely intact and 20 minutes or so of footage has been lost. This sort of explains the fact that the story doesn't always seem to entirely make sense and it isn't always easy to follow. One of the most famous characters in the story, the Mad Hatter, only appears in the last five minutes for a very brief and seemingly irrelevant scene. He, like other characters, featured more in the original cut and his short cameo is all that's left. While it is a shame that the movie is missing a lot of material, it actually doesn't really matter that much in this case. The story is so dream-like and bizarre in the first place meaning that this truncated version just seems even weirder than it originally would. So it doesn't really harm the film too much. Probably the best thing about this one is the effort that has been put into the costuming and creature design. They are consistently very well done and it is this more than anything that gives the fantasy world its character. The direction otherwise is a bit static, although this was quite common in these very early years of cinema. However, when you consider the sheer invention of the films of the even earlier cinema pioneer Georges Méliès, you do have to think that a little more imagination could have been brought to bear in some of the scenes. But, really, it's a little churlish to criticise this one as these ancient films have a charm that will never die. Definitely worth catching.",
         "i enjoyed this. but i usually enjoy most approaches on this subject since i find Lewis Carroll irresistible and fascinating history. i also really find silent cinema a lot of fun history too. this was a really cute old silent. i don't think it was great cinema or D.W. Griffith or anything like that. it was actually pretty typical for the time period. aside from the goofy monsters and elaborate costumes. even the silent version of 'Peter Pan' was better cinema than this, and 'Pan' itself is a little pedestrian and unoriginal at times. but like the silent 'Pan' film, this is mostly for laughs and cuteness. this was also not half bad as a adaptation. pretty much all the 'Alice' films only briefly mention the 'Father William' poem, where this film silent presents it in entirety. somewhat ironic that a non talking silent would do that. it also presents a startling image of the Tenniel illustration of Father William doing his somersault. even some young children might find this amusing if they are familiar with the story. but most of today's high tekkie, younger generation, will probably find most of this to be a rickety old monster creep show. i thought it cute, but there were moments that repulsed me and gave me the creepy crawlies. a lot of silent movies can do that. at least it wasn't all dark and scary like the silent version of 'The Bluebird'. this film is a definite must see for 'Alice' fans and silent movie buffs.",
         "The film I just watched runs about 51 minutes. Apparently some of the film was lost from the original. It could be chemistry or carelessness. Who knows. So we've lost some scenes. It does make the film a bit disjointed, but if you know your AIW plot, you can still enjoy it. What works here is the costuming. The creation of costumes to match the book characters works very well. Alice is flippant enough to be a bit obnoxious, which is what we want. For what starts out as a gentle little girl, can be quite formidable. I really like the appearance of the mock turtle. The use of close-ups would have helped because we don't get a full appreciation of these characters. Still and all, it was a marvelous film for such an early venture and most of it survived.",
         "This early feature-length adaptation of the children's classic canters briskly through Lewis Carroll's book, progressing episode by episode from one well-remembered tableau to another and sticking satisfactorily faithfully to the events, imagery and strangeness of the original (the latter two elements through skillful costume design and by making liberal use of verbatim passages of Carroll's dialogue on the title cards). A.A.Young's direction occasionally threatens to be more visually inventive that it ever actually proves to be, and he rather loses control during the croquet game, when he plainly didn't know how to visually organise all those extras milling about the screen for its duration. Although there are a few special effects, the decision to film most of the action out of doors in attractive rural settings and on the coast greatly enhances the charm of the piece. The more fantastic elements of the original are conveyed with the help of imaginatively designed settings and props like the oversized signpost to Wonderland and the enormous mushrooms among which we find the caterpillar smoking his hookah. It's to whoever designed the costumes that the greatest kudos are undoubtedly due. The costumes for the actors portraying the Duchess and the Mock Turtle deserve particular mention; while the lobsters emerging from the ocean to dance the Lobster Quadrille resemble something from a sixties sci-fi movie. Rangy fifteen year-old Viola Savoy's Alice ambles through the far-fetched proceedings with appropriately nonchalant good humour.",
         "Well, this is the oldest movie I've ever reviewed and probably the oldest one I ever WILL review. As the first version of \"Alice In Wonderland\" (at least in terms of a feature length film, well by most standards) it's still nice to see where it all started out. I admit that the costumes in this are quite impressive. Even looking at movies made in the 1920's, you can tell that their special effects got better as it went on. We make a lot of progress quickly! Anyway, I feel bad for not being more familiar with the original book. I can't tell if this version is more faithful or not. The Mock Turtle looks probably the best. There were some really creepy masks the people wore, but luckily, they only appeared for a few scenes. I'm still confused as to why Alice said she never saw a grin without a cat. The Cheshire Cat still had his head in that shot! I'm not sure if it was all meant to be a dream. It's always nice to see a lot of classic elements show up. I wouldn't quite recommend this, because it doesn't really have anything that noteworthy. It's still pretty significant. It can certainly be hard to tell a lot of story in such a short running time. **1/2 out of ****.",
         "It takes some time getting used to silent movies. There's not a lot of text in this film, so the \"over acting\" according to today's standards, require some patience of the viewer. However, this is a well thought out version of the story, the scenes are played out with trick effects such as perspective, and remembering the year of production, it's very well made. The only thing that really bothered me was the treatment of animals, both real, such as the garden rabbit, and the (I assume) fake, such as the flamingo and hedgehog. Otherwise, a movie well worth watching, especially if you're a Lewis Carroll/Alice-fan. Time well spent."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Nonpareil Feature Film Corp."],
      "summaries": ["Alice goes with her sister to a picnic and then she falls asleep and starts dreaming about a wonder land full of talking animals and walking playing cards."],
      "budget": 0
   },
   "movielensId": 142094,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1915-01-15",
      "dvdReleaseDate": null,
      "directors": ["W.W. Young"],
      "runtime": 52,
      "movieId": 142094,
      "title": "Alice in Wonderland",
      "mpaa": "NR",
      "actors": [
         "Viola Savoy",
         "Herbert Rice",
         "Harry Marks",
         "Louis Merkle",
         "William Tilden"
      ],
      "imdbMovieId": "0004873",
      "originalTitle": "Alice in Wonderland",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A German adaptation of the classic Lewis Carroll story.",
      "tmdbMovieId": 87300,
      "avgRating": 2.75,
      "releaseYear": "1915",
      "numRatings": 4,
      "posterPath": "/9YJqY2MWOUzy60iMhniOF4NEZRs.jpg"
   }
}