{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "graffiti",
            "id": 2815
         },
         {
            "name": "chaos",
            "id": 4630
         },
         {
            "name": "art",
            "id": 14893
         }
      ],
      "imdb_id": "tt3995006",
      "video": false,
      "title": "Banksy Does New York",
      "recommendations": [
         49837,
         296136
      ],
      "backdrop_path": "/pYazwA3IhNT64rYJJ0jAsHYaJwa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "545637a6c3a3686075000180",
               "name": "Chris Moukarbel",
               "profile_path": null,
               "id": 930695,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "547b6ac9c3a3685b050005c0",
               "name": "Chris Moukarbel",
               "profile_path": null,
               "id": 930695,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "547b6ad8c3a3685af000058d",
               "name": "Jack Turner",
               "profile_path": null,
               "id": 1066809,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "547b6ae9c3a3685af60004bd",
               "name": "Mai Iskander",
               "profile_path": null,
               "id": 117154,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "547b6af59251412d78000586",
               "name": "Karim Raoul",
               "profile_path": null,
               "id": 1207755,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "547b6b059251412d70000588",
               "name": "Jennifer Harrington",
               "profile_path": null,
               "id": 1391838,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "548275ed9251416e7800737d",
               "name": "Collin Kim",
               "profile_path": null,
               "id": 1395173,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "548275fc9251416e740078af",
               "name": "Vincent Farrell",
               "profile_path": null,
               "id": 1059342,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5482760bc3a36829ae006d96",
               "name": "Todd Lubin",
               "profile_path": null,
               "id": 1395174,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5482761ac3a36829ab007899",
               "name": "Stephane Cantave",
               "profile_path": null,
               "id": 1395175,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 1,
               "credit_id": "548276299251416e8100744c",
               "name": "Sheila Nevins",
               "profile_path": "/sRjSyPc4gMFw8VzKjSmWGFM6HZx.jpg",
               "id": 1238136,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5482763dc3a36829a30074e9",
               "name": "Jay Peterson",
               "profile_path": null,
               "id": 969585,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.868494,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 299729,
      "vote_count": 36,
      "budget": 0,
      "overview": "On October 1, 2013, the elusive street artist Banksy launched a month-long residency in New York, an art show he called Better Out Than In. As one new work of art was presented each day in a secret location, a group of fans, called “Banksy Hunters,” took to the streets and blew up social media.",
      "similar": [
         39452,
         1281,
         306819,
         1562,
         1593,
         12159,
         10661,
         9693,
         253,
         284,
         583,
         594,
         1213,
         10204,
         51876,
         44943,
         9292,
         5876,
         7191,
         10096
      ],
      "original_title": "Banksy Does New York",
      "runtime": 79,
      "poster_path": "/zReTz6C2Bxa61H6KGBve1V18nZn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Matador Content",
            "id": 39917,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Permanent Wave",
            "id": 39918,
            "origin_country": ""
         }
      ],
      "release_date": "2014-11-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The street is at play.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Moukarbel"],
      "runtime": 79,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3995006/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ3ODgyNTU2OV5BMl5BanBnXkFtZTgwOTQ5NDgzMzE@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [],
      "reviews": [
         "A lot of Banksy Does New York, a new HBO documentary, wasn't filmed by its director Chris Moukarbel. Instead, the footage in this film about the mysterious and anonymous artist Banksy is crowd sourced from the Internet. This means the film we're watching is composed of mobile phone and hand-held camera footage, in between some animation, which was archived and then shared with the filmmaker, who edited the footage together. Whether intentionally by design or not, the form of the movie is complicit with some of the central questions about the ownership of art. Who owns a piece of art when the original author is no longer in possession of the piece and who has the rights to the work? The question of ownership and authorial imprint is also encompassed in the mysterious artist Banksy himself. Banksy is described by the film as having found a way to be anonymous in a time when it's impossible to be anonymous. In an interview with the director, it's noted no one even knows the gender of Banksy. It is commonly assumed Banky is a man, but he could be female or even an organisation of people. As an artist, Banksy's gimmick is leaving his artworks on the side of buildings for people to find. Some of these images are gag jokes or puns, like an image of a dog urinating on a fire hydrogen with the caption \"You complete me\". But other pieces are larger, more tangible pieces of art like a sphinx sculpture. Some of the pieces are hilarious and I laughed seeing a truck drive around the city with stuffed animal faces coming out of the sides to highlight animal cruelty, or a Grim Reaper riding around in a dodge 'em car and a live performance piece where a worker polishes the giant red boot of a Ronald McDonald statue. Banky's work is deliberately comic but also highly political too, particularly when he references broad social issues or specific conflicts like the War on Terror. His method for signposting the location of his work is also modern and unique. He uses social media outlets to leave clues for his fanbase, who then pursue them. The premise of the documentary stems from Banksy's use of social media. His fanbase view the clues he leaves online to trace the location of the works. Over one month, totally 31 days, Banksy released one artwork a day around New York for people to find. The artworks were pursued by people who were called Banksy Hunters, who dedicate their time to reading his clues and finding the works across the city. These people say they are motivated by participation because it becomes a part of the artwork and further highlights the question of ownership. Through its daily, episodic structure and by shifting between these Hunters and other collectors and fans of the artist, it feels like the reasons for their attachment are only skin deep about their attachment to the creator. They're fans and they feel a part of the art but is there a deeper reason at work? A significant part of people's attachment to Banksy is in their belief to defend his artwork. The film begins with some men trying to take down one of Banksy's pieces before being hassled by a group of fans and there are countless other examples of people being angered by the art being vandalised, such is the personal weight Banksy has in the city. There are also some funny episodes where Banksy's removal of himself from the artwork reiterates his importance and ownership over the pieces. In one episode an art stall is established to sell Banksy works without people realising it's by him. Few of them sell and then its announced that these are worth thousands of dollars each. There is also debate about the men who take the sphinx piece for themselves since its no longer owned by Banksy himself. Do they have the right to take this piece and sell it if no one is present to own it? Banky's absence alone provokes its own questions. On top of its ideas about ownership, the documentary also touches on ideas like the history of graffiti and how its now being removed and debate about whether Banksy is political, exploitative or even drawing attention to places people might never have visited before. It does have a sense it is bouncing from one idea to another to cover them all but at least its thought provoking. Similarly, it's not the most cinematic documentary in form or the most focused, but this cinema release will be useful for people who don't have cable and are interested in questions about the ownership of contemporary street art.",
         "Ten astronomical furnaces in the sky as a reward for Banksy's thoughts and how they are expressed, and also to the creators of the doc for tenaciously following the leads searching for each day's presentation (in NY traffic no less) and then adding a range of pov interviews. But, lowered a couple of stars to express disgust with the greed and narrow self-interests of those who took advantage of the attention to enhance themselves by damaging, stealing and selling. Further disgust to the politicians, developers and property/slum owners in deriding the street art as defacing when they are either distant from or profit from those already visually debasing structures. And, where renovations occur they often give most benefit to the distant wealthy and connected.",
         "If you've seen Banksy's terrific film \"Exit Through the Gift Shop\" or enjoy his art, then you owe it to yourself to see this wonderful documentary. While no one publicly acknowledges who Banksy is and we presume the film was not make with his assistance (who knows?!), it follows the hysteria that occurred back in 2013 when Banksy had a HUGE publicity coup. He announced via the internet that he would make a work of art every day in New York City....and a sort of scavenger hunt began of his fans trying to find this hidden art. In each case, Banksy was able to make the works of art without anyone seeing him doing this and maintained his aura of secrecy. The film follows folks from October 1st through the 31st and I particularly loved it because of Banksy's sense of humor and social commentary. Describing how he did all this could perhaps ruin the film. I suggest you give it a watch and enjoy the craziness and fun that occurred during this weird month!",
         "While it's not in the same graffiti clad ballpark of the fantastic Banksy starring and directed doco Exit Through the Gift Shop, the HBO produced Banksy Does New York is a fun, to the point and most importantly insightful look at the time the illusive artist took over New York for one whole month and for fans of the street artist, this will be a must own as the quintessential documentation of the artistic event. Banksy Does New York does a great job at showcasing just how big of a deal this event was in 2013 and it does this by utilising not only talking heads who were apart of the \"scavenger hunt\" at the time but also footage shot by those on the ground level, news broadcasts and of course great use of audio snippets taken directly from Banksy's official web presence's that allow slight insights into what the works he produced meant, from the menial through to the political and even for those that think Banksy is nothing more than a glorified street artist, there's little point denying that his work is constantly engaging and often bitingly satirical. While there was work done within the month of Banksy's New York residency that isn't overly memorable, there were certainly some stand out works that Banksy Does New York shows off and interestingly follows up in ways that shine a whole new light on the works of the mysterious figure. Fetching hundreds of thousands of dollars, if not millions at auctions around the world, the works of Banksy have become highly sought after pieces and it's hilarious and also shocking to watch as people either clamber to deface his street works or take them for their own gains. It's an eyebrow raising trend of modern day humans that will see them quickly turn feral for the thought of $$$ and it therefore makes Banksy's pieces more than meets the eye. Banksy Does New York never tries to preach or convert anyone to anything (a nice change from most modern day doco's) and merely exists to show an unbiased documentation of a time in New York City where the greatest ever art focused scavenger hunt took place, a ride we can feel a part of thanks to this film. 3 quick thinking mechanics out of 5",
         "Myself and my mum were watching this on the Sky arts channel recently and honestly I was shocked to hear that there is an English graffiti artist who produces such great art. I loved when he did a heart with a little girl on the walls of new York. The documentary was given such information that I never knew what work he had done so far in the states. He really has talent but I couldn't understand why after a while, he covers his work up? I found it rather odd but I suppose he probably doesn't want other graffiti artists destroying his work. The most disturbing scene was when, Disney's Dumbo was shot down by a missile and then was killed again by a gunman who was an Iranian solider. I mean they were saying the reason Banksy created that video was because, Dumbo was created during the time of World War II and Banksy just wanted to show it off. Why the hell did he use the Syrian war but not the World War itself? I mean that really didn't make sense to me even if it is meant to be different! That video was just wrong, especially that I grew up watching Dumbo. I would advise parents to turn the channel if that scene comes up or just turn it off. Besides that scene, this is a very good introduction of Banksy!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Matador Content",
         "Permanent Wave",
         "Home Box Office (HBO)"
      ],
      "summaries": ["Documentary chronicling the famed street artist's \"31 works of art in 31 days\" in New York city."],
      "budget": 0
   },
   "movielensId": 142117,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-11-17",
      "dvdReleaseDate": null,
      "directors": ["Chris Moukarbel"],
      "runtime": 79,
      "movieId": 142117,
      "title": "Banksy Does New York",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "3995006",
      "originalTitle": "Banksy Does New York",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["kzPGOCYET9Y"],
      "plotSummary": "On October 1, 2013, the elusive street artist Banksy launched a month-long residency in New York, an art show he called Better Out Than In. As one new work of art was presented each day in a secret location, a group of fans, called “Banksy Hunters,” took to the streets and blew up social media.",
      "tmdbMovieId": 299729,
      "avgRating": 3.20588,
      "releaseYear": "2014",
      "numRatings": 17,
      "posterPath": "/zReTz6C2Bxa61H6KGBve1V18nZn.jpg"
   }
}