{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "horse racing",
            "id": 155759
         }
      ],
      "imdb_id": "tt0136199",
      "video": false,
      "title": "Flash",
      "recommendations": [],
      "backdrop_path": "/pnY4gtcjQ9oSFcWM1N53JR3nM8N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Connor Strong",
               "gender": 2,
               "credit_id": "55b094a9c3a3682ffc00debe",
               "name": "Lucas Black",
               "profile_path": "/41qZZc6vRVm5ZOoXWfEf5NGoIZR.jpg",
               "id": 155,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "David Strong",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119ea7",
               "name": "Brian Kerwin",
               "profile_path": "/cC69Vc7F59RKBZUldffhWJWx57A.jpg",
               "id": 50464,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alfred Rutherford",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119eaf",
               "name": "Tom Nowicki",
               "profile_path": "/nm6XdgwH6IDE4nroYQwhNtlFtn9.jpg",
               "id": 94854,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tad Rutherford",
               "gender": 2,
               "credit_id": "5542ae86925141586d0004c5",
               "name": "Shawn Toovey",
               "profile_path": null,
               "id": 132860,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Floyd",
               "gender": 2,
               "credit_id": "55b094c4c3a3682ffc00dec1",
               "name": "Von Coulter",
               "profile_path": "/g5sfJZmq5blOttBpgh2hj1kt2qg.jpg",
               "id": 142605,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Laura Strong",
               "gender": 1,
               "credit_id": "55b094d5c3a3682ffc00dec4",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jeweler",
               "gender": 2,
               "credit_id": "55b094ed92514125da00dc81",
               "name": "Dan Biggers",
               "profile_path": "/eBN0JvJI3IRxL9SD2kaL2LegR6x.jpg",
               "id": 99043,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Eunice",
               "gender": 1,
               "credit_id": "55b094ff9251411e0600dd2a",
               "name": "Sharon Blackwood",
               "profile_path": "/f9bPYoW6MZeCEhzBuokhIsZmCQk.jpg",
               "id": 146025,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Georgia State Patrolman",
               "gender": 0,
               "credit_id": "55b0951292514172ef00bebf",
               "name": "Whitt Brantley",
               "profile_path": null,
               "id": 1489665,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Madison Shopkeeper",
               "gender": 1,
               "credit_id": "55b095269251411e0f00df69",
               "name": "Jill Jane Clements",
               "profile_path": "/9GQ30ddvRU6UVEUDBvwTzKHLQcb.jpg",
               "id": 196843,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Waitress",
               "gender": 0,
               "credit_id": "55b09538c3a368300200dbf7",
               "name": "Lala Cochran",
               "profile_path": null,
               "id": 1489666,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "N.J. Policeman",
               "gender": 0,
               "credit_id": "55b0954a9251411e1100e2b8",
               "name": "Randy Cohlmia",
               "profile_path": null,
               "id": 150078,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Marine",
               "gender": 2,
               "credit_id": "55b0955c9251411e0600dd3f",
               "name": "Ed Corbin",
               "profile_path": "/860D3vXssxveUgPCFyzk9HBHlxt.jpg",
               "id": 85481,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "55b095769251411e0f00df76",
               "name": "Tom Deardorf",
               "profile_path": null,
               "id": 1489667,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c6b9251416c75119ea3",
               "name": "Monte Merrick",
               "profile_path": null,
               "id": 15673,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55b095b79251411e0b00dcca",
               "name": "Simon Wincer",
               "profile_path": "/wikOUmNuvWJHcOU8EHjFHXUhafQ.jpg",
               "id": 18254,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.080426,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 181574,
      "vote_count": 6,
      "budget": 0,
      "overview": "A boy falls in love with a horse named Flash that's for sale. He gets a job to earn the money to buy the horse, but he's forced to sell when the family falls upon hard times.",
      "similar": [
         142,
         506,
         707,
         9277,
         186,
         34584,
         947,
         57212,
         452507,
         228205,
         196,
         38757,
         547,
         9342,
         115,
         15092,
         36955,
         2055,
         57201,
         565
      ],
      "original_title": "Flash",
      "runtime": 90,
      "poster_path": "/nv2c2mvu8T8Ss1Dxbze8BYPLmOR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "ABC Family",
         "id": 5948,
         "origin_country": ""
      }],
      "release_date": "1997-12-21",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "To reunite a father and son, it would take a miracle and one very special horse.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Simon Wincer"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Monte Merrick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0136199/",
      "coverLink": null,
      "actors": [
         "Lucas Black",
         "Brian Kerwin",
         "Shawn Toovey"
      ],
      "reviews": [
         "As a mature person of over 40, a horse-lover, owner, and rider, I highly recommend this movie not only to horse lovers but to anyone. The leading man, or boy, holds his own very well with both the acting and the riding. He is perfectly cast and his accent is excellent and very natural (I also live in the deep south). This story of a boy who becomes homeless and rides his horse through several states to be reunited with his father seems unbelievable, but the film was inspired by a true story. And if I wasn't personally familiar with all types of horse owners I would say that the \"evil\" character was a shallow stereotype, but sadly, people like him exist all over the country. The movie is well made, entertaining, very suspenseful, and quite heart-wrenching. I'm trying to find a copy to purchase because it's a movie I'd like to be able to watch over and over. It is suitable for all ages: a rare and precious gem, these days.",
         "This was a wonderful movie, and very well cast. The story had a very real sense to it, that is a relief in between all the tacky laughtrack re-run of sitcoms. I admit I did cry a little, but the film deserved each smile and tear. I think very highly of this movie and recommend for all ages.",
         "I wrote a comment about this movie before that was accepted and posted, but that was several months ago. I've been a horse lover my entire life of almost 50 years. This movie is so wonderful I've been trying to purchase a copy for myself since it was first broadcast on television,with no luck. Now that I run a small horse farm, teaching riding lessons and training English and Western pleasure horses, I appreciate the film even more. The story of Flash is sad and suspenseful but very inspirational. It is based on a true story. The horse information is genuine, believable, and ultimately positive. The acting is more than competent, and the content is appropriate for all ages. In addition, the events that unfold are not as far-fetched as some who have commented believe they are. In fact, the plot is very believable, especially in these times of high unemployment and inadequate health care services. More and more families are finding themselves in desperate situations. Even so, many of these families try hard to find ways for their children to fulfill their dreams (I was such a single parent for many years). Finally, it is possible to find unwanted horses that have valuable qualities,such as the horse in the film. Horse lovers like myself, who are not blessed to be wealthy, become experts at hunting out these bargain treasures and enjoy wonderful relationships with these amazing animals. I hope to generate more interest in this film so that it will become commercially available once more. I hope more people will request it through online movie sale websites.",
         "A boy,Conner Strong,stops by every day to see a horse hoping one day to buy the horse.Conner gets a job delivering groceries saving money for the horse. Conner lives with his father David and grandmother.When >bills pile up and a mortgage overdue,Conner's father rejoins the Merchant Marines to pay bills and the back mortgage and to buy Conner the horse,Flash but David must go to sea for 5 months leaving Conner and his grandmother to manage the house.Then when tragedy strikes followed by misfortune,Conner is left struggling to keep everything from falling apart.Lucas black as Conner was great.Look for Black in the movie,Crazy in Alabama starring Melanie Griffith",
         "This movie was great!!! I saw it a few years ago when it was on the Disney Channel, like, everyday. I cried every single time I watched it. Its such a good movie. If you like horses, its a good movie for you too. I liked it a lot!! Also,Lucas Black is a wonderful actor. If you liked him in this movie, you should also check out Friday NIGHT LIGHTS. It's another wonderful movie. Lucas Black again proves his talent as an actor. It also stars Billy Bob Thorton and Tim McGraw. Billy Bon plays a wonderful type of role that I've never seen before. BEWARE: Both of these movies, FLASH and Friday NIGHT LIGHTS, are tear jerkers. There is no doubt in my mind that you will love both of these movies!!!!!!!",
         "I remember seeing this way back in my past and it was an awesome movie. I love it and i want to purchase it, sadly it is almost impossible to find at a reasonable price. It is sad, touching, adventurous, i absolutely recommend this to anyone who wants a good family movie. :) Why on earth is it so darn hard to find though? I searched online and its for sale VHS, new, for like 50$? I was hoping more to get a DVD version, but thats closer to impossible to find compared to the other. This is also a good horse lovers film. The movie is about a horse and a boy and it comes with many good family elements as well. A beautifully created film that i hope to see released again in the future.",
         "Connor is a young boy who lives with his father and grandmother; one day he meets a horse and spends his summer making enough money to buy the horse; it is then revealed that Connor's dad is off to work on a ship...Connors world soon begins to fall apart as he and his grandmother deal with the absence of his father. This film is very emotional and exciting. It explores friendship between a boy and his horse and the impact losing a family member has on children. The end is perfect, Connor deciding to save his horse and runs away in order to find his father....Perfect. A nice family film..",
         "This is a perseverance story about a boy named Connor who risks everything to protect a horse named Flash, with whom he has developed an emotional relationship. Could a deeply disturbing bestiality tale underlie this family film? I do doubt whether director Simon Wincer had it in him to execute such a subtle self-parody, even if he did live up to his name when he read the script. But whether or not the overtones of this film are deliberate, they are thoroughly amusing. To see the dark side of this story, you need to take a step back and appreciate the asinine stupidity of relating emotionally to an animal. Unlike in Disney, animals don't possess the required anthropomorphic characteristics. Thus the very basis of the film - that the characters treat the titular horse as special, emotional and human - can only leave us guessing as to what mental instability or paraphilia the characters suffer from. The plot of the film is little more than a succession of sacrifices that the humans make for the horse. Whilst this is portrayed sentimentally, you can decide for yourself at which point it goes beyond the suspension of disbelief, passes the stop at sanity, and ends up simply humorous. To begin, Connor falls in love with Flash but needs $1000 to afford him. So Connor's father takes a perilous five-month job at sea to raise the cash, intentionally landing Connor in the solitary care of his weak grandmother. Without the father's income, the grandmother goes to work in a factory, and this leads to her death from fatigue and a heart attack. Living alone, Connor now decides that he must buy his grandmother a top-notch coffin, but lacks the $1000 to buy the nicest one - see where this is going? To raise this cash, he sells the majority of his worldly possessions to the sum of $500. And finally, he sells Flash. It's almost like the plot itself is poking fun at this idiocy. The truly interesting thing about this film is the depiction of Flash himself. In a mocking realisation of the characters' delusions, Flash is actually portrayed more humanly than the humans. Several close-up shots on the horse's eyes emphasise the horse's sentience, consciousness and intelligence. Unlike the humans, Flash is always elegant, upright and clean - and knows better than to attempt emotional connections with any of the other horses in the area. Furthermore, he stares with nothing but disdain when the humans attempt to saddle, ride, cage, buy, sell or communicate with him, as if he understands both the foolery and the injustice of such treatment. Consider the following scenes. When Connor begins to attempt riding Flash, Flash eludes him with a turn of the head that says \"Get the hell away from me.\" Connor laughs it off, as if the horse is being playful. Making a second approach, Flash kicks Connor into a pile of manure. When finally Connor makes it onto Flash's back, Flash escapes his pen, runs wildly towards a lake, halts suddenly, and throws Connor into the lake. Again, this is taken to be playful; but the close-ups on the horse's eyes tell rather of impish mischief, and a revelry in the fact that, whilst the humans take him to be so simple, he is actually the more intelligent of them. Indeed, Flash connects with the viewer more directly than the humans do. Not only does his eye stare straight at you through the fourth wall, he also shares our incredulity at the strangeness of the humans' equestrian obsession. Flash is not only mischievous but hateful too. When Connor and his father begin to build a fence to cage Flash in, the music is exaggeratedly glorious, bright and happy - so happy, in fact, that it makes us question the notion of caging the horse in; for his eyes tell of nothing but disdain. If Flash is anthropomorphic - and the humans clearly treat him as such - then why are they caging him up? Not only does this reveal the contradictions inherent in the humans' warped minds, it actually paints them as villains. As a sentient creature, Flash is entitled to be very annoyed about his captivity, and we can see not only mischief but vengeance when Flash kicks Connor away. All of this gives us a fresh perspective on the plot. Not only are the humans behaving with animal stupidity, sacrificing everything for a horse they've now sold; the horse is behaving with humane intelligence, desperate to be free of his captors' oppression. With this as the backdrop, the second half of the film continues with further foolishness: Connor leaves home to live with Flash's new owner, who ultimately wants to put Flash down. At this point, Flash finally starts acting friendly towards Connor, which is a frighteningly intelligent thing to do, and the two of them escape. But let's not forget that this is theft, which is the least of the crimes Connor begins to commit as he sets off on a \"rightful\" journey to New York - with police on his tail, a criminal record on his head, and Flash between his legs - where he hopes to meet his father on return from his five month seafaring job. It's a great distance and time is short: finally the story becomes just a little bit gripping and gritty, but no less contradictory. If Flash and Connor are friends, why does Connor always tether him - would Flash run away? Because our answer would have to be yes, this completely undermines the strife of the remainder of the film. The film ends weakly, with Connor reuniting with his father, becoming a national Hero, somehow not being prosecuted, and being given Flash back. But the icing on the cake is the climactic freeze-frame of Connor stroking Flash, which is perhaps the most disturbingly romantic image of the entire film.",
         "This movie is one of the best I have ever seen. Lucas Black has done a wonderful job. I never felt that he was acting because I felt it so real and the horse is very beautiful. I am a horse lover, so this movie is extremely touching for me but this movie can be enjoyed by anyone in this world . Horses are such wonderful beings and can connect with us emotionally very well. Very touching and highly inspiring. This movie will make a remarkable impact on our perception of life and how we must treat other beautiful creations of this earth . A MUST WATCH MOVIE IN EVERY WAY !!!!!!!",
         "Flash is a lightweight, but entertaining enough, little family film. Lucas Black is appealing enough as Conner, but his southern accent sounds phony. It's too much. For once, Shawn Toovey (annoying Brian from Dr. Quinn, Medicine Woman) manages not to drive me crazy, playing Conner's rich friend Tad. Brian Kerwin is always perfectly tolerable, although here he disappears after the first 30-40 minutes, not to resurface until the end. He is fine as Conner's dad. Ellen Burstyn is cute as Conner's grandma, Laura, although what an actress of her caliber is doing in a flick like this is beyond me. Of course, most of what transpires after the first part of Flash is highly improbable, but you do find yourself rooting for the determined Conner and his horse. This is a good, clean movie for kids, but as an adult, I doubt I'd sit through it again."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Roger Birnbaum Productions",
         "Walt Disney Television"
      ],
      "summaries": ["A boy falls in love with a horse named Flash that's for sale. He gets a job to earn the money to buy the horse, but he's forced to sell when the family falls upon hard times. This family-oriented drama proceeds from there."],
      "budget": 0
   },
   "movielensId": 142178,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-12-21",
      "dvdReleaseDate": null,
      "directors": ["Simon Wincer"],
      "runtime": 90,
      "movieId": 142178,
      "title": "Flash",
      "mpaa": "",
      "actors": [
         "Lucas Black",
         "Brian Kerwin",
         "Tom Nowicki",
         "Shawn Toovey",
         "Von Coulter",
         "Ellen Burstyn",
         "Dan Biggers",
         "Sharon Blackwood",
         "Whitt Brantley",
         "Jill Jane Clements",
         "Lala Cochran",
         "Randy Cohlmia",
         "Ed Corbin",
         "Tom Deardorf"
      ],
      "imdbMovieId": "0136199",
      "originalTitle": "Flash",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A boy falls in love with a horse named Flash that's for sale. He gets a job to earn the money to buy the horse, but he's forced to sell when the family falls upon hard times.",
      "tmdbMovieId": 181574,
      "avgRating": 1.33333,
      "releaseYear": "1997",
      "numRatings": 3,
      "posterPath": "/nv2c2mvu8T8Ss1Dxbze8BYPLmOR.jpg"
   }
}