{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "beach house",
            "id": 34145
         }
      ],
      "imdb_id": "tt0048064",
      "video": false,
      "title": "Female on the Beach",
      "recommendations": [
         51146,
         28296,
         151848,
         27628,
         78265,
         23122,
         87894,
         103710,
         43248,
         29416,
         38683,
         26323,
         50958,
         27506,
         19171
      ],
      "backdrop_path": "/4D4NeVcRMgGI6zxtgYoDf2Jv59W.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Lynn Markham",
               "gender": 1,
               "credit_id": "52fe46f8c3a368484e0ae013",
               "name": "Joan Crawford",
               "profile_path": "/18zM03CrzqmF3CuONgeIFkjL62K.jpg",
               "id": 31550,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Drummond Hall",
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae017",
               "name": "Jeff Chandler",
               "profile_path": "/hqexurJECYe071k77qO0FAQqDlC.jpg",
               "id": 50570,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Amy Rawlinson",
               "gender": 1,
               "credit_id": "52fe46f8c3a368484e0ae01b",
               "name": "Jan Sterling",
               "profile_path": "/eeWVkgt1f4xjzhrei6ctkkSGdb4.jpg",
               "id": 20418,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Osbert Sorenson",
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae01f",
               "name": "Cecil Kellaway",
               "profile_path": "/3qcMgq1JFZWXct7Y6CiXNi0jCZr.jpg",
               "id": 30228,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Eloise Crandall",
               "gender": 1,
               "credit_id": "52fe46f8c3a368484e0ae023",
               "name": "Judith Evelyn",
               "profile_path": "/fMTA0RXp12rRFFP0nz2cc9MNwOT.jpg",
               "id": 7686,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Police Lieutenant Galley",
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae027",
               "name": "Charles Drake",
               "profile_path": "/AiuCiwhqEyt5yGAu52tXuhK8uNL.jpg",
               "id": 15978,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Queenie Sorenson",
               "gender": 1,
               "credit_id": "52fe46f8c3a368484e0ae02b",
               "name": "Natalie Schafer",
               "profile_path": "/hOrXYR4RmpFFwRjv4h9ayeTSt9N.jpg",
               "id": 7643,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Frankovitch",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae02f",
               "name": "Stuart Randall",
               "profile_path": "/spq7zE4cNs3RvmbGMloVvMFaCfy.jpg",
               "id": 95010,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mrs. Murchison",
               "gender": 1,
               "credit_id": "52fe46f8c3a368484e0ae033",
               "name": "Marjorie Bennett",
               "profile_path": "/cyY0ltPueaqENXEBnd0KWE5VHRd.jpg",
               "id": 97257,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Pete Gomez",
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae037",
               "name": "Romo Vincent",
               "profile_path": "/9VgRtGWzJKtx5Bp3PFIBJs5SQOL.jpg",
               "id": 120307,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Mrs. Gomez (uncredited)",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae03b",
               "name": "Nan Boardman",
               "profile_path": "/ddXqE2VSqo4oMBJKflBSQf2esfE.jpg",
               "id": 1184839,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Roddy (uncredited)",
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae03f",
               "name": "Ed Fury",
               "profile_path": "/tuGC5tc9TDR2ESPvSQae6k2okXI.jpg",
               "id": 106448,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Cleaning Woman (uncredited)",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae043",
               "name": "Helene Heigh",
               "profile_path": null,
               "id": 106574,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Cop (uncredited)",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae047",
               "name": "James Hyland",
               "profile_path": null,
               "id": 215700,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Woman at Beach (uncredited)",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae04b",
               "name": "Judy Pine",
               "profile_path": null,
               "id": 1184840,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Boat Attendant (uncredited)",
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0ae04f",
               "name": "Jack Reitzen",
               "profile_path": null,
               "id": 139226,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0adfeb",
               "name": "Joseph Pevney",
               "profile_path": "/shNmqaOUHun2YYju9qyI010uFmB.jpg",
               "id": 15705,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0adff1",
               "name": "Robert Hill",
               "profile_path": null,
               "id": 137470,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f8c3a368484e0adff7",
               "name": "Robert Hill",
               "profile_path": null,
               "id": 137470,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0adffd",
               "name": "Richard Alan Simmons",
               "profile_path": null,
               "id": 86372,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae003",
               "name": "Albert Zugsmith",
               "profile_path": null,
               "id": 45279,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae009",
               "name": "Charles Lang",
               "profile_path": "/1k74XckQqxOwdPYvhvhEdZ9jl4l.jpg",
               "id": 3148,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f8c3a368484e0ae00f",
               "name": "Russell F. Schoengarth",
               "profile_path": null,
               "id": 29636,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.009317,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 65014,
      "vote_count": 8,
      "budget": 0,
      "overview": "Lynn Markham moves into her late husband's beach house...the morning after former tenant Eloise Crandall fell (or was pushed) from the cliff. To her annoyance, Lynn finds both her real estate agent and Drummond Hall, her muscular beachcomber neighbor, making themselves quite at home. Lynn soon has no doubts of what her scheming neighbors are up to, but she finds Drummond's physical charms hard to resist. And she still doesn't know what really happened to Eloise.",
      "similar": [
         421044,
         62206,
         4982,
         2118,
         289,
         13809,
         238,
         240,
         9798,
         1538,
         50620,
         75780,
         134374,
         272,
         37710,
         210577,
         346364,
         372058,
         329865,
         20943
      ],
      "original_title": "Female on the Beach",
      "runtime": 97,
      "poster_path": "/9T0C09f2xX4fKioZpvNKDpLHGSD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1955-08-19",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Never has a woman loved so deeply . . . Or so dangerously!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Joseph Pevney"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Robert Hill",
         "Robert Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048064/",
      "coverLink": null,
      "actors": [
         "Joan Crawford",
         "Jeff Chandler",
         "Jan Sterling"
      ],
      "reviews": [
         "I've seen this film exactly twice on TV late at night. If it isn't in print anywhere (it doesn't appear to be currently) it should be. Joan is at her campy, over-the-top best in this bizarre story of a woman, her love interest, and a couple truly strange neighbors (one of whom would later become \"Lovey\" on Gilligan's Island). The dialog alone is enough to make it worth seeing. Jeff Chandler is at his studly best too. So much of Joan's work is out on DVD and hopefully this film will be too some day. If you're a Crawford fan and you've never seen Female on the Beach (get a load of that title!) you'll be thrilled by this seemingly \"lost\" movie. You can't beat a film with a line like, \"I wouldn't have you if you were hung with diamonds upside down!\"",
         "Few case studies of Hollywood stardom rival Joan Crawford's in their curiosity. A certified star from the time of last silent movies and the first talkies, she fell from favor more than once only to be restored in ever newer incarnations, largely through the boundless reservoirs of her will. And if there is an era that defines the Crawford that we remember most vividly, it's the decade-plus, from her Oscar-winning turn as Mildred Pierce in 1945 through her last `really top' movie, The Story of Esther Costello in 1957. In her valiant assault, as she moved into middle age, against time's winged chariot, she had vehicles built around her that helped define the canons of camp but retain a fascination that transcends camp. This dozen or so includes: Humoresque, Flamingo Road, her second Possessed, The Damned Don't Cry, Harriet Craig, This Woman Is Dangerous, Sudden Fear, Torch Song, Queen Bee and Autumn Leaves. Though we may howl at some of them (or at parts of them, for they range from rather good to quite dreadful), we're always aware \u0096 at times discomfitingly so \u0096 of the human drama that underlies and links them all: the Joan Crawford story. In Female on the Beach, she plays a recent widow taking up residence in the coastal California home her wealthy husband owned. Her arrival proves ill-starred, for a broken railing on its deck marks the spot where its previous tenant \u0096 another woman battling age and isolation \u0096 plunged to her death. Did she jump or fall \u0096 or was she pushed? It unfolds that she had fallen prey to a youngish beach bum (Jeff Chandler) operated by a pair of older con-artists (Cecil Kellaway and Natalie Schafer); Crawford is targeted as their next mark. Obsessively guarding her privacy, however, she proves to be a tough nut to crack. Her too familiar realtor (Jan Sterling) is swiftly shown the door when she makes the mistake of taking Crawford for granted. And Chandler, turning up unbidden in Crawford's kitchen one morning, encounters that same rough hide; asked how she likes her coffee, she icily replies `Alone.' But tanned muscles and prematurely grey temples do not count for nothing in affluent oceanside communities, so Chandler slowly wins over the armored Crawford. But the course of true love never did run smooth, as the Bard of Avon warns us. Crawford just happens to find the dead woman's indiscreet diary (it's hidden away behind a loose brick in the fireplace!), a sad yarn of being cheated in card games and bilked for loans by the larcenous old couple while being strung along by Chandler. No fool she, Crawford hands the gigolo his walking papers. But then she sinks into a sump of liquor and self-loathing, staggering around waiting the phone to ring like a torch-carrier out of a Dorothy Parker story. Finally, of course, Chandler does call and, better yet, wants to marry her! But fate has a few final cards to deal, including an uninstalled fuel pump Crawford had bought for Chandler's boat.... That staple of genre cinema, the woman-in-jeopardy thriller, generally features dithery, hysterical young things as straw victims. Crawford in jeopardy, by contrast, turns all the conventions upside down. The coquettish bulldozer she has constructed of herself at this menopausal juncture in her life, with her face as fiercely painted as a Kabuki mask, seems designed to repel \u0096 to crush \u0096 any threats. (Of course, like most such postures of domination and intimidation, It's a construct of fear \u0096 her fears of falling short as a serious actress, as a mother, as a woman; fears of aging and no longer being able to lure her directors and costars between the sheets; fears of not mastering her own unachievable goals.) The facade of control and self-sufficiency proves all the more arresting when it comes under siege from the cumbersome twists and turns of these situations held over from nineteenth-century melodrama. Hence, Female on the Beach and its ilk. An indomitable woman of a certain age flies solo into the perils of mid-life, only to triumph against all odds. That was the life Crawford was living at mid-century, the life reflected in these films, by turns appalling and transfixing. Not since the Brothers Grimm has such a string of cautionary tales been issued.",
         "This is a terrific soaper in the grand style! Joan Crawford is SUPERB as Lynn Markham,arm-candy widow of a wealthy man,whose house has been the scene of another wealthy woman's death.She falls for the dead woman's gigolo/prime murder suspect and he for her....but is he a killer? This is a GREAT movie,featuring a stellar Crawford performance as well as a terrific turn by Jeff Chandler as the boy-toy who may be a dangerous game indeed!",
         "A stunningly gorgeous movie. I knew, that a movie with such a bold, unusual, campy title had to be gorgeous. I must say that Crawford is my favorite dramatic actress. I also respect Crawford for her choice of scripts. Apart from Crawford, the movie was quite good and unusual. It is the love affair between two middle-aged people who are less than admirable. She married money, and he would like to. They are both rotten, useless, and they deserve each other; and yet, they are human and touching and you want them to find happiness. Too many movie heroes are morally pristine. A wonderful movie. Is there such a thing as a bad Crawford movie? I can't think of one. Watching any Crawford movie is like entering a world of high intelligence, relevance and fine humor. I am more eager than ever to see every single Crawford movie. I always liked Crawford, but I am now beginning to suspect she was a genius. She is the only actress who has yet to disappoint me. I wish she had kept her real name Lucille Lasueur. It suits her French looks much better. Crawford never loses her dignity, not even in a sordid drama. She makes tawdriness classy. This is also one of Chandler's most memorable roles.",
         "This is a case where an aging Joan Crawford was just about done with good leading parts and the studios were only offering her \"B\" level scripts like this. Films were beginning to change and Crawford was not to far off from the last phase in her career. This story begins with an older drunken woman named Eloise Crandall (Judith Evelyn) chasing after her boytoy Drummond Hall (Jeff Chandler) but when she goes onto the balcony she falls over and dies. Was she pushed? Lynn Markham (Crawford) moves into the house and soon meets her neighbors like Drummond and the older couple that he lives with (Natalie Schafer and Cecil Kellaway). Their is also a nosy detective hanging around named Lieutenant Galley (Charles Drake) who thinks that Eloise may have been married. Drummond tries very hard to get Lynn to like him but she's very cold natured. One night she's lonely and horny and makes up with Drummond and they become close. Lynn finds the diary of Eloise and finds out that the neighbors are card sharks and that she was set up for her money. Also, the real estate agent Amy Rawlinson (Jan Sterling) is secretly in love with Drummond and Lieutenant Galley makes very obvious advances on Lynn! Lots of melodrama in this story and it runs like a soap opera. Chandlers character is such a pushy bum! Two seconds after meeting Crawford he is in her house making breakfast and putting his hands on her. He paws her like a Tijuana whore on a Friday night! And I thought it was funny that six foot four Chandler would come onto a woman that stands five foot in heels. Crawford is a tough woman in this film and really cracks Chandler a couple of hard ones. The dialogue is over written like when he asks her how she likes her coffee and she retorts with \"Alone\". Not a bad little subplot involving Sterling either. She's pretty hot looking and you have to wonder why Chandler was never attracted to her. The one scene that stands out for me is when Chandler is on Crawford like a grizzly bear and she cracks him and he responds by tearing her dress off! Rape, anyone? But of course this just turns her on. Overly melodramatic and it does have its share of laughs but at the same time you can't stop watching it. You can credit Crawfords screen appeal for that. Silly film is worth a peek at Crawford entering a part in her career that was winding down from serious roles.",
         "Glossy trash has wealthy, beach front-living Joan Crawford wooed by shady gigolo Jeff Chandler. Low-brow fun, an adaptation of Robert Hill's play \"The Besieged Heart\", with steamy clinches and page after page of florid dialogue. Director Joseph Pevney seems to be a perfect match for Crawford: he's obviously tough on the unyielding actress and doesn't let her get away with many \"Mildred Pierce\"-isms. Crawford also seems to have been personally swayed by hunky Chandler, who doesn't let her hog the spotlight. However, neither star is guided with a trace of self-effacing humor, which turns the proceedings into straight-faced camp. Some of the lines are howlers. **1/2 from ****",
         "Freudian references aside,this well-mounted melodrama about a rich widow mixed up with a shady beach bum is definitely Crawford at her best. No simpering weak-kneed sister,this film noir-type story is a direct slap in the face to the Hollywood in the 50's who insisted on casting aging leading men with absurdly young leading ladies.The notion that older women need love and affection was considered almost absurd. Tennessee Williams territory!This film brought it smack dab in the face.Natalie Schaefer and Cecil Kellaway are fun as card sharks after Crawford's money.Jeff chandler is stolid as the beach bum.Judith Evelyn is touching as Eloise Crandall in the flashbacks. Jan Sterling is good as somewhat snaky realtor.Charles Drake is good as beach cop,t",
         "FEMALE ON THE BEACH is camp classic trash at its very best in every way. The Richard Alan Simmons script is filled with great one-liners that Crawford fans and camp crazies will be repeating in bars for decades to come. Natalie Schafer and Cecil Kelloway are basically piss-elegant pimps who groom groovy muscle-studs (in this case Jeff Chandler and later we see Ed Fury) to roam the sands of Newport Beach looking for heavily-monied, lonely, alcoholic broads. They meet their match with Lynn Markham (Crawford) who knows a thing or two about high-class prostitution. She falls for Chandler, but Chandler falls for her and nearly loses her life to jilted, malicious beach bunny Jan Sterling. Just the sight of Crawford in stiletto heels drunkenly traversing the sands at night and delivering bitchy one-liners with great gusto will keep the viewer in stiches. A laugh riot and noir fun! Not bad soap opera either.",
         "Although this drama is a sleeper, you will find the clothing spectacular. I see the only reason to make this picture was to showcase those famous shoulders. Every evening dress is a masterpiece and the plot secondary only to anything Joan wears in this film. As you may expect, Ms. Crawford plays the \"rich bitch\" role to the hilt too. I had to love the role played by Natalie Schaefer, she's just too delicious in this role. No Joan Crawford drag party would be complete without this gem playing in the background. And if you can't arrive in a stunning frock similar to ones worn by her in this flick, you're not invited !!",
         "This film is a lot like an extended Perry Mason episode, which isn't surprising since it's from exactly the same era. I would add, also, that it's beautifully photographed in a noir style. I have a friend who pointed out that the first half of the movie consists of Joan Crawford repeatedly throwing people out of her house, which is kind of fun to note; perhaps it's an indication of a bit of clumsiness in the script. One could also perhaps say that Crawford leans a bit too much on toughness in her characterization and not enough on the bewilderment the character would have felt as she unwittingly walks into the situation she finds herself in. The film does keep the suspense going, though, in that it continues to fan the ambiguity of who the house's previous occupant (recently dead as the movie starts) really was and what her relationship was to the various supporting characters. The film is full of manipulative characters with mixed motives, so you find yourself drawing conclusions about the dead character, but then resisting those conclusions because it seems like you're being led to them by pretty slippery characters. Overall, the film is definitely worth a look; sums up the type of movie Joan Crawford was best known for. To get a look at her lighter side, try \"Love on the Run,\" one of a handful of comedies she did, in which she co-stars with Clark Gable.",
         "One of the indisputably campiest so-bad-it's-good films of all time. Outrageous dialogue, overacting galore, melodramatic subplots, and Joan Crawford! An absolutely fabulously bad film, the perfect movie for a boring, rainy day when you have nothing better to do.",
         "I have to say, Joan Crawford is THE queen of camp without a doubt. This trashy little gem showcases Joan at her campy best in this her midlife career. She plays Lynne Markham, a rich widow who moves to the beach house she has never seen that was owned by her late husband. She moves into a mess, the previous tenant, a lonely rich woman who couldn't handle her booze or the sleazy beach bum, Drummond played by iron jawed, steel haired Jeff Chandler, died under mysterious circumstances. Did she commit suicide or did she have a little help? Joan emotes shamelessly in this tawdry soap. She swoons, flares her nostrils, almost passes out as Drummond savagely paws her, this borders on rape and Joan's character absolutely LOVES IT!!!! She spits out such classic lines as \"You're about as friendly as a suction pump\" with a completely straight face. What a hoot!!!! The storyline is a camp classic, the rich, lonely widows who succumb to the wiles of Drummond and the con artist neighbors, played by Natalie Schaefer and Cecil Kellaway and the beautiful Realtor played by Jan Sterling all mix together for a movie to die for. It is a must see for all Crawford fans. At this stage of her career she had become a phenomenon, a steel rose, the makeup and hair becoming more surreal and harsh the older she got, amazing, transfixing. You have to see it to believe it.",
         "In this nasty, twisted tale, a rich adventure-seeking widow and a prowling beach bum-turned-gigolo bask on the sandy shores of lust and murder. Campy Crawford is at her sizzling best, dishing out and deflecting trouble a-plenty in a noir classic brim-full of catchy lines, tawdry innuendo, suspense, and intrigue. Sultry lighting and a steamy score add matchless ambiance to this clever, quirky, sexy drama.",
         "JOAN CRAWFORD was still playing babes who fall for much younger men when she did FEMALE ON THE BEACH, another one of her Miss Lonelyhearts roles where she, against her own better judgment, lets herself fall for a studly beach bum (JEFF CHANDLER, all brawn and gleaming smile) who invites himself into her kitchen with such familiarity that when he asks \"How do you like your coffee?\" she naturally snaps back, \"Alone!\" From then on, she's getting fast moves from him and a bunch of other predators who look at her as a Miss Moneybags whom they think would make a soft touch despite her tough shell. Well, she stays tough (who wouldn't, with these piranhas trying to fleece her out of everything?), and the movie goes on and on in typical Joan Crawford style, playing up the suspense as to how and when she will discover who murdered the previous occupant of her beach rental. Crawford looks swanky throughout and even dons a bathing suit to show off her still svelte figure--and, of course, JEFF CHANDLER gives the ladies a chance to ogle his own brand of masculinity, although he's a bit overage as a boy toy. It's a ton of fun for Crawford fans, but everyone else will have a hard time swallowing the story's resolution to the mystery of who the killer is. JAN STERLING, NATALIE SCHAEFER, CHARLES EVANS, JUDITH EVELYN and CECIL KELLAWAY do very nicely in assorted supporting roles.",
         "Early in the movie Joan says to Jeff: \"It's getting longer.\" But later in the movie she tells him: \"It's smaller than I thought.\" Okay, the first line refers to her list of dislikes and the second line to the interior of Jeff's boat, but you get the idea. This whole movie hinges on the sexual attraction supposedly felt by its two leading characters and everything is secondary to this relationship. There's no subtlety here. The first time Joan sees Jeff he's shirtless and you can tell from her expression that she's wondering what he'd look like if he lost his pants as well. And when Jeff looks at Joan, you can tell he's wondering if her dress would fit him. The second time Jeff is seen he's lying face down on the beach with his swim suit molding tightly to his buns. Yes, there's something for everyone here. Actually, Jeff seems a bit old for his part. Isn't \"37-year-old-beachboy\" sort of an oxymoron? But it's great to see Judith Evelyn during her \"Golden Age.\" Just the year before, she played \"Miss Lonelyhearts\" in \"Rear Window\" and the Queen Mother in \"The Egyptian.\" Ed Fury pops up briefly in one scene. Maybe he should have played Jeff Chandler's part!",
         "Just finished watching an average looking copy of this movie, as a good quality one is nearly impossible to find. The only real reason to watch this movie is Joan Crawford. She could put on a good act at a funeral! I thought she was great, especially considering what she had to work with. Jeff Chandler was never known as a good actor and this movie proves it. The old couple were probably the only real actors in the movie other than Joan. This movie is good to watch if you don't have anything much of importance to do or if you are a big Joan Crawford fan. I don't care how old she was when she made this movie...SHE WAS STILL HOT! I would have taken her on my boat anytime...",
         "I'm not really sure if the target audience for \"Female on the Beach\" was middle-aged women or gay men, since by the mid-50 Joan Crawford was one of the former and looked like one of the latter. Further elevating this goofy B-movie into the camp stratosphere is the presence of Natalie Schafer, the once and future Lovey Howell, as a villainous bridge hustler serving as pimp to aging pretty boy Jeff Chandler, a gigolo who seems allergic to wearing shirts. One regrets that the producers didn't wait a couple of decades and make \"Female on the Beach\" in the 1970s, when John Waters could have cast Divine in the Crawford role opposite Troy Donahue, kept Lovey, had Tennessee Williams doctor the script and made a fun trashterpiece. As is, you're stuck enjoying an unintentionally hysterical low-rent thriller starring a Hollywood legend who got stuck in films like this one because she kept plugging away decades after her star faded. (And why not? Was it her fault that Hollywood couldn't offer better roles to women her age?) The eponymous tootsie is not Crawford but Judith Evelyn, who gets drunk and falls to her death on the eponymous beach in the film's opening. Joan, as gambler's widow and world's oldest Vegas showgirl Lynn Markham, buys the late stiff's Newport Beach mansion so she can have some privacy. Invading her solitude is Chandler, the world's oldest \"charm boy,\" who at the behest of Schafer and co-conspirator Cecil Kellaway keeps dropping in on Crawford uninvited and trying to seduce her. She rebuffs him repeatedly, which is kind of understandable since he doesn't have much to offer aside from his manly physique and cheesy pick-up lines like \"you're cold -- let me warm you.\" But there wouldn't be much of a movie if Crawford continued to act sensibly so she decides she's attracted to the big lug, who has a sensitive, caring heart under all that chest hair and the two team up against Schafer and Kellaway. Prepare to marvel at the scene in which Joan disses the social-climbing parasites with the intended-to-be-deathless line \"I'd invite you to dinner, but I'm too afraid you'd accept.\" If that was all their was to the film, it might be a decent screwball comedy, but there's the little matter of the dead Miss Evelyn. Did she jump or was she . . . pushed? Who should Joan trust, the over-the-hill male model she's hooked up with or the nosy cop who keeps barging in? And why can't she get rid of that ditzy real estate agent, played by the forgettable Jan Sterling, after she's already paid for the damn house? These are not compelling dramatic questions, but they're mildly diverting and it's hard not to feel a little sympathy for Crawford as she plays out the string. Keep her some company, watch her in \"Female on the Beach.\"",
         "I thoroughly enjoyed this clunkily titled B-thriller and it was all because of Joan Crawford and Jeff Chandler. Crawford is sardonically mesmerizing as a hard-bitten tough gal, and I loved her repartee with the darkly handsome Chandler, whom I'd never seen in anything before. It was dazzling to see Crawford gradually melt under Chandler's charms, despite her suspicions. The only weakness in this film was its extremely unlikely plotting toward the end, when Jan Sterling's suicidal realtor turns out to be the puppet master and killer. Huh? However, the movie manages to recover and I thought it was extremely effective to have Drummy saving Lynn from a disastrous plummet from her porch. I'd never have anticipated this would have ended on such a satisfyingly romantic note. Yes, people can grow and change, even reprobate gigolos. Bravo, Joan. And so sorry Chandler had to die so young...Check out his interesting bio on Wikipedia.",
         "This is Crawford camp at its best. As her star waned, she began to appear in films that will forever be treasured by those who adore the trash and flash of 50's soapers with Joan in the spotlight. In this outing, she is a former \"specialty dancer\" (read what you will into that appellation)who moves into a beach house next to hunky gigolo Jeff Chandler. He takes one look at her and decides that she is a target for his con game of fleecing defenseless women although Crawford can hardly be categorized as defenseless. Joan reads the diary of the former (and mysteriously dead) beach house tenant, a slave to love of Chandler who was bleeding her dry and Joan still doesn't get it. Needless to say, Crawford marries Chandler anyway and we spend the rest of the film wondering if, how, or when he will murder her. Crawford was years too old for the part and she swans around like a twenty year old in the fashions of the time, including many shots in a dazzling variety of negligees. But remember, this is Joan Crawford and during this phase of her career it was exactly what we expected. Nobody did this better than she did. It epitomizes the term \"camp\" and you can't help but love it. Whew!!!!",
         "This is the type of film that used to be featured on American Movie Classics before they ruined the channel with commercials and more recent fare.Fortunately, I caught it on AMC and taped it years ago. I pull it out every now and then on a lazy rainy day for pure enjoyment. Just seeing Crawford with that Godawful makeup, heavy brows, and mannish bob is a riot. Her scenery chewing acting style is also a hoot. She plays it like she's trying to get an Oscar. She takes every opportunity to show off her figure also. There's even a scene where she's getting out of bed in baby doll pajamas no less! I wish they would release this on DVD!",
         "By the early to mid-1950s, Joan Crawford should have considered stopping playing the same roles she might have gotten away with earlier in her career. In other words, she was simply too old to be believable as the sexy leading lady she was portrayed as in several of these films. This soap opera-style movie was a prime example of this, as she was paired with a much younger-looking Jeff Chandler,...and when she appeared in gorgeous gowns and bathing suits, it just seemed very forced and unbelievable. She was 51 and Chandler was in his late 30s. This role should have been played by a woman at least 10 years younger. But, apart from that, the movie is a pretty pedestrian effort--nothing particularly outstanding one way or the other. Passable at best.",
         "In Female On The Beach widow Joan Crawford inherits a nice Pacific Coast beach house from her late husband. Recently Judith Evelyn was renting the place and she also got dead by falling off her terrace. Detective Charles Drake isn't sure it was an accident and his prime suspect is Jeff Chandler. I noted that Female On The Beach was based on a play that according to the Internet Broadway Database did not make it on Broadway. So author Robert Hill got it sold to Universal and he helped adapt it for the screen. For some of the themes this play was exploring Tennessee Williams would have been ideal. Chandler is a guy without visible means of support. Courtesy of the late tenant Judith Evelyn he ties his boat on her dock. Whatever he's got every female in heat wants, Crawford, Evelyn, real estate broker Jan Sterling even Natalie Schaefer who is married to neighbor Cecil Kellaway. The two are a pair con artists, but you can Schaefer checking Chandler out. Chandler is part of a come on to get lonely women to gamble their life savings with Kellaway and Schaefer which is what he did with Evelyn. But he's starting to get pangs of conscience with Joan. Female On The Beach is the kind of film that is perfect for Joan Crawford. But it needed two things, Tennessee Williams to write it and it also is flawed in its ending. It has the same problem as the Alfred Hitchcock classic Suspicion and the ending that Hitchcock was forced to make there.",
         "Joan was 49, Jeff was 36 but he fell for those big eyebrows and those crinoline skirts that almost knocked over furniture as she swiveled her abundant hips around the beach house. Sure he was a gigolo but she loved the hunk and he loved her but the fuel pump almost blew the whole thing. Oh, well....all's well that ends well and as he hugs her from behind while she's (ever) facing the camera with her hand contorted backwards on his face cheek, the screen goes black and the floozy music oozes to The End. I taped this pot-boiler over 20 years ago on VHS and it still amuses.",
         "Recently widowed Lynn Markham (Joan Crawford) returns to her late husband's beach house to take up residence until a buyer can be found. She returns to a house in which police are looking at something on the on the beach beneath her house, there's a broken railing on her balcony, and random items of mens clothing can be found strewn throughout the place. What's going on here? Lynn soon finds out that her last tenant, Eloise Crandall, fell off of her balcony to her death and the police are still trying to decide if it is an accident or homicide. A beach bum (Jeff Chandler as Drummy) has moored his boat to her pier, and apparently thinks he can pick up with Lynn where he left off with Eloise and doesn't seem to have the phrase \"personal space\" in his vocabulary. Lynn is not just another bored lonely near middle age socialite. She's an ex-specialty dancer from Vegas and she can see right through Drummy. However, time and the solitude she says she's always wanted begin to have a negative effect on her x-ray vision. Nobody dresses to the nines every night just to pace the floor of their dark empty beach house. Drummy's story - he's hired beefcake by a couple of refined card sharks, Osbert and Queenie Sorensen, who need a steady flow of cash through loans and ill-gotten gambling debts to keep them in the lifestyle to which they are accustomed. The source of that cash had been Eloise, but now the Sorensens are eying bigger fish - next door neighbor Lynn Markham. Throughout the film a cop investigating Eloise's death will pop up out of nowhere (Charles Drake as Lieutenant Galley) spouting come-ons mixed with veiled warnings while flashing bedroom eyes. Does he suspect murder or is he just trying to squash the competition by casting Drummy as a murder suspect? So who if anyone did kill Eloise Crandall? Drummy to get rid of her? The card sharks to make sure she didn't go to the police about the ruse? Someone else I'm not telling you about just to keep it interesting? Watch and find out. Watch and find out if Lynn thinks she's getting so close to the truth that she thinks she is in danger too. This is A1 late-career Joan Crawford material all the way.- great fashions, good speeches, Joan tough yet vulnerable, and angry confrontations mixed with pure lust. Plus great beefcake shots of Jeff Chandler and the fact that no female seems immune to this beach bum's charms even though he's not exactly your prototype ideal man of the 50's ... or maybe that's exactly WHY they pant after him! After all, Ward Cleaver clones might be dependable, but variety is the spice of life. I highly recommend it if you can find a copy.",
         "Joan was still going strong and giving her career her all in the 1950s, at a time when most of her contemporaries had faded from the scene. (You have to remember that she started out in silent pictures; very few other stars from that era were still working by 1955.) And she's so much fun to watch in this film! Very arch and sarcastic, she tosses off a number of cutting one liners to great effect. Ah yes, and of course she gets a couple of good slaps in too (as she said herself, \"I do that in all my pictures!\"). Man, I do enjoy this film; it's one of my favourites out of the thirteen theatrical features Crawford filmed during the fifties. Now, it's rather seedy and trashy to be sure. After all, just look at the set-up; you have a mature couple \"sponsoring\" a younger \"stud- muffin\" (for lack of a better term--ha!) whose sole purpose in life is to serve as an escort (in and out of the bedroom) for older rich women, in order to fleece them out of a bit of money. A slightly daring thing to put on film, but by the mid-fifties the screenwriters could get away with a lot more than they could even a few years earlier; even then the production code was starting to crumble. Beefy Jeff Chandler, as the gigolo in question, is ridiculously attractive and readily puts his assets on display throughout the film. I wonder---was it a bit unusual to so unabashedly and overtly portray a man as an obvious sex object at that time? Not that the audience is complaining! (Some would say it's a pity that he was forced to shave and wax for the role (which he complained about)--- heck, even back in the fifties fellows were manscaping and getting rid of the furry chests.) The plot and dialog have little to do with reality---one reviewer said \"Make no mistake: Female on the Beach is a strange movie about strange characters doing strange things on the beach.\" But as I noted above---it's so much fun. Campy to be sure, but it's also a decent domestic thriller and an enjoyable fifties soap; yep, it's full of soapy goodness. Technical note: oddly enough, my DVD is presented at the standard Academy aspect ratio of 1.37:1, even though it was intended to be projected at a ratio of 2:1. (2:1 is a widescreen ratio that was used for a few films in the mid-fifties, but which never caught on as one of the standards for widescreen pictures---1.85:1 and 2.39:1 became the norm instead.) So, what this means is that we see a lot of extra picture at the top and bottom of the frame on this DVD; there's a heck of a lot of extra headroom--- a larger portion of the great mid- century modern interiors are on display than was originally intended by the cinematographer. As a result, I found that using the zoom feature on your widescreen television to fill the frame (televisions have a aspect ration of 1.78:1) actually improves the look of the film; the compositions look very good when zoomed in."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "Lynn Markham moves into her late husband's beach house...the morning after former tenant Eloise Crandall fell (or was pushed) from the cliff. To her annoyance, Lynn finds both her real estate agent and Drummond Hall, her muscular beachcomber neighbor, making themselves quite at home. Lynn soon has no doubts of what her scheming neighbors are up to, but she finds Drummond's physical charms hard to resist. And she still doesn't know what really happened to Eloise.",
         "A quarrel is heard, in a beach-house, between Eloise Crandall and Drummond Hall and he walks out, and she drunkenly tries to follow and goes over a guard rail falling to her death on the beach below. The house-owner, widowed Lynn Markham, moves in and notices police Lieutenant Galley examining the scene of the accident while real-estate agent Amy Rawlinson is on hand to greet her. Lynn finds Drummond in her kitchen preparing breakfast and she resent his intrusion, although he charmingly implies he has always had the run of the house. She send him away and retrieves the key. Drummond has had an affair with Amy but breaks it off. Lynn finds a diary left by Eloise and learns that Drummond has been staying with the gambling next-door neighbors, Osbert and \"Queenie\" Sorenson, hoping to snare a rich widow so they would all profit. Lynn still falls in love with Drummond and presents him with a new fuel pump for his boat they plan to use on their honeymoon. Amy warns Lynn against the marriage but she refuses to listen. They marry and she brings items for the honeymoon aboard the boat and finds the new fuel pump hidden in a drawer and the faulty one still in place. She now begins to suspect Drummond has plans on killing her and tries to get away.",
         "Moving into a beach house involves Lynn Markham in mystery, danger, and romance with a beach boy of dubious motives."
      ],
      "budget": 0
   },
   "movielensId": 142192,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-08-19",
      "dvdReleaseDate": null,
      "directors": ["Joseph Pevney"],
      "runtime": 97,
      "movieId": 142192,
      "title": "Female on the Beach",
      "mpaa": "",
      "actors": [
         "Joan Crawford",
         "Jeff Chandler",
         "Jan Sterling",
         "Cecil Kellaway",
         "Judith Evelyn",
         "Charles Drake",
         "Natalie Schafer",
         "Stuart Randall",
         "Marjorie Bennett",
         "Romo Vincent",
         "Nan Boardman",
         "Ed Fury",
         "Helene Heigh",
         "James Hyland",
         "Judy Pine",
         "Jack Reitzen"
      ],
      "imdbMovieId": "0048064",
      "originalTitle": "Female on the Beach",
      "genres": [
         "Drama",
         "Crime",
         "Thriller",
         "Romance",
         "Mystery"
      ],
      "youtubeTrailerIds": ["-6ONsO0OdVQ"],
      "plotSummary": "Lynn Markham moves into her late husband's beach house...the morning after former tenant Eloise Crandall fell (or was pushed) from the cliff. To her annoyance, Lynn finds both her real estate agent and Drummond Hall, her muscular beachcomber neighbor, making themselves quite at home. Lynn soon has no doubts of what her scheming neighbors are up to, but she finds Drummond's physical charms hard to resist. And she still doesn't know what really happened to Eloise.",
      "tmdbMovieId": 65014,
      "avgRating": 2.9,
      "releaseYear": "1955",
      "numRatings": 5,
      "posterPath": "/9T0C09f2xX4fKioZpvNKDpLHGSD.jpg"
   }
}