{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "satanism",
            "id": 3099
         },
         {
            "name": "insane asylum",
            "id": 4924
         }
      ],
      "imdb_id": "tt0068231",
      "video": false,
      "title": "Asylum of Satan",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Jason Specter / Martine Williams",
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dc7b",
               "name": "Charles Kissinger",
               "profile_path": null,
               "id": 933079,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lucina Martin",
               "gender": 1,
               "credit_id": "52fe48f49251416c9109dc83",
               "name": "Carla Borelli",
               "profile_path": "/wPgBp4HrtgOdeudHxlrvJywmL9t.jpg",
               "id": 161696,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Chris Duncan",
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dc7f",
               "name": "Nick Jolley",
               "profile_path": null,
               "id": 1204486,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lt. Tom Walsh",
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dc87",
               "name": "Louis Bandy",
               "profile_path": null,
               "id": 1204487,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Chief Aide",
               "gender": 0,
               "credit_id": "59fcdbe6c3a3682e460014ca",
               "name": "Claude Fulkerson",
               "profile_path": null,
               "id": 1916923,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Blind Girl",
               "gender": 0,
               "credit_id": "59fcdbfb925141168f001749",
               "name": "Sherry Steiner",
               "profile_path": null,
               "id": 1169724,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "The Cripple",
               "gender": 0,
               "credit_id": "59fcdc13925141164c0017ec",
               "name": "Mimi Honce",
               "profile_path": null,
               "id": 1916926,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "(as Jim Pickett)",
               "gender": 0,
               "credit_id": "59fcdc29925141169500165c",
               "name": "James Carroll Pickett\t",
               "profile_path": null,
               "id": 933080,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48f49251416c9109dc8d",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f49251416c9109dc93",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f49251416c9109dc99",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dc9f",
               "name": "J. Patrick Kelly III",
               "profile_path": null,
               "id": 1204488,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dca5",
               "name": "Patrick J. Kelly",
               "profile_path": null,
               "id": 1204489,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dcab",
               "name": "William L. Asman",
               "profile_path": null,
               "id": 1204485,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f49251416c9109dcb1",
               "name": "Gene Ruggiero",
               "profile_path": null,
               "id": 19409,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f49251416c9109dcb7",
               "name": "James Carroll Pickett\t",
               "profile_path": null,
               "id": 933080,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.3025,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84418,
      "vote_count": 0,
      "budget": 0,
      "overview": "A young woman is brought to an asylum to receive special treatment from a mysterious doctor. Dr. Spector does more than just run the hospital -- he offers his patients as sacrifices to Satan.",
      "similar": [
         622,
         25983,
         752,
         561,
         805,
         764,
         675,
         1487,
         17609,
         184346,
         9824,
         10766,
         10664,
         409297,
         234,
         10391,
         182560,
         9913,
         2662,
         3560
      ],
      "original_title": "Asylum of Satan",
      "runtime": 80,
      "poster_path": "/b3gRg1JALPrvesuvJTuQafB05NY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Studio 1 Pictures",
         "id": 16708,
         "origin_country": ""
      }],
      "release_date": "1972-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Love Slaves Of Satan Tortured To Blood-Dripping Death",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Girdler"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "William Girdler",
         "Patrick J. Kelly"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068231/",
      "coverLink": null,
      "actors": [
         "Charles Kissinger",
         "Carla Borelli",
         "Nick Jolley"
      ],
      "reviews": [
         "In the 70's there were many films about Satan (\"The Exorcist, \"The Omen\") and many films about insane asylums (\"One Flew over the Cuckoo's Nest\", \"The Ninth Configuration\"). It's no surprise then that someone would combine them. But it's a testament to the prescient genius of William Girdler--the man, the myth, the legend--that he did so in 1971! Of course, this film is completely inane, but so were all Girdler films, even the ones with big budgets and big stars. A woman has a nervous breakdown and wakes up in an asylum. She finds it strange (although not nearly as much as she ought to) that all of her fellow patients are dressed in white-hooded robes. Meanwhile, her boyfriend, who looks like \"Meathead\" from all in the family and is garbed in some of the worst 70's fashions ever witnessed, is trying to rescue her. After being turned away the first time, he comes back with a police detective and discovers that the asylum is abandoned and the doctor he spoke to, Dr. Spector, has been dead 20 years. He's very alarmed, however, when he finds out that the supposedly dead Dr. Spector \"was picked up several times for worshiping Satan\" (what's the police code on that--a \"666\"?). Several minor characters are killed for no other reason than to show off some ridiculous-looking special effects (paper bugs, rubber snakes, etc.). As in \"Three on a Meathook\" there's also a long romantic flashback interlude set to music (because horror fans, of course, are suckers for romantic interludes). Finally though, a guy in a VERY unconvincing Satan mask shows up and we learn that it's not good to offer Satan a non-virgin in a virgin sacrifice (he apparently hates getting beaten to the punch by a guy who looks like \"Meathead\"). Obviously, this movie is pretty bad, but it almost sneaks into so-bad-it's-good territory. I'd definitely recommend it for fans of satanism, insane asylums, and William Girdler.",
         "A young woman finds herself held against her will in an eerie mental asylum by the sinister \"Dr. Specter\" and his masculine-looking assistant, Martine. She begins to suspect that the visions of horror she experiences are not nightmares and that she is due to be sacrificed to The Evil One. A laughably awful film if I've ever seen one, \"Asylum of Satan\" is highly enjoyable, cheesy trash. Bad acting from everyone, especially the lead actress, a terribly dated score, and the fakest-looking Satan you'll ever see make this steaming pile one worth checking out if you like bad movies. Oh, and the death scene are a stitch! (Apperantly people can die from cockroaches crawling all over them...) My rating for \"Asylum of satan\"--2/10.",
         "I don't know much about William Girdler (I've seen only one other film that he directed, \"Three on a Meathook\", which wasn't nearly as entertaining as this one), but it's obvious that he put a lot of heart into \"Asylum of Satan\". Remember the horror movie you wanted to make when you were a kid? Well, Girdler made it for you. The plot is thin: a beautiful concert pianist (Carla Borelli of \"Days of Our Lives\" and \"Another World\") suffers a minor breakdown and ends up at an old, scary-looking asylum in the country, where she hears sinister chanting and has a number of extremely vivid nightmares. What's going on at Dr. Jason Specter's Pleasant Hill Sanitarium? You'll have to find out for yourself! While most of the cast fails to impress, Charles Kissinger (as Dr. Specter) makes a good bargain-basement Vincent Price. Nick Jolley must have known even at the time that he was delivering a stupendously awful performance as the heroine's hot-tempered, houndstooth-clad boyfriend, and a couple of the bit players--Mimi Honce as another patient at the asylum and Jack Peterkin as the physician who reluctantly transfers Borelli to Kissinger's house of horrors for \"special treatment\"--recite their lines in the corny, mock-dignified cadences of daytime TV, suggesting that Girdler plucked them from the same talent pool as his female lead. (Honce sounds like she's doing a Correctol commercial, and Peterkin reveals, in unintentionally hilarious fashion, a gaping continuity error in the script: he says he warned Borelli a year earlier that she was overworked and, literally in the next breath, splutters that \"she's only been under my care a short while!\") To a great extent, \"Asylum of Satan\" works because of its imperfections, not in spite of them--and, believe it or not, is formidably eerie in spots. Watch this film a few times and you'll develop a soft spot in your heart (or your head) for it ;)",
         "So William Girdler's screen debut was running a little slow through 1972 but it's not all that bad! Charles Kissinger is a great actor in which he later appeared in almost of all of Girdler's other films. Nick Jolley superfly hero of the 70's appears also wondering why he was'nt in anything else. ASYLUM OF SATAN is a good film about a girl taken hostage to the Asylum were doctor's zombies and critters run wild! Kissinger plays Satan himself. Give ASYLUM OF SATAN a shot if you are a big fan of Girdler's films. Yes the film is very violent with way too much sex, but hey it's still worth watching.",
         "I have to start off by saying that I'm a little biased in favor of this movie, being that director William Girdler was a native of Louisville and that the film was shot here. The movie is fairly run-of-the mill 70's drive-in fare, with stretches of talky dialogue, leading actresses who can't act and a monster/creature that doesn't QUITE live up (or should that be \"down\"?) to it's billing. Strangely enough, the film's odd sense of pacing does lend itself to some semi-creepy scenes (like the \"flashback\" in the dining room) and in parts, is vaguely reminiscent of the original \"Carnival of Souls\". And I have to conclude by saying what a treat it was to see the late, great, local horror-film host Charlie Kissinger, playing Doctor Spectre AND his head nurse \"Martine\". (yes, you read it, right, he was in DRAG...) FilmWolf",
         "A scrubby but efficient dollop of occult nonsense, ASYLUM OF Satan finds an attractive young woman being subdued within a strange private hospital. Waking from sleep in fear and confusion, she is told by staff that she has been placed under special care of a certain doctor, along with a handful of other patients. It latterly becomes clear that these patients suffer from various personal afflictions which said doctor insists he can cure. As it turns out, his sure-fire cure is the same for ALL ailments...and the most common side effect is rigor-mortis. This mystifying conundrum advances as patients disappear one-by-one, leaving our young heroin to find a means of escape before it's too late. The bizarre finalization of this nightmare is a Black Magic ritual conjuring Satan himself...and he is one scrawny, bedraggled looking Lord of Darkness, I must say. While this is doubtlessly lower-berth material of questionable quality, a fairly nice job is done keeping things interesting and steeped in a creepy, otherworldly atmosphere. As 70s drive-in fodder goes, ASYLUM OF Satan might be a bug's nose above the median...I neither enshrine nor crucify this movie...it ably serves its primary function to entertain, even if it is on the verymost base level. 4.5/10",
         "If you enjoy the 70's, bell-bottoms, fake beards, Creepy Crawlers, or shoving a red hot needle in your eye then this is your movie! I, on the other hand, simply enjoy making fun of it. It is simply bad. If it's not women being attacked by Creepy Crawlers and rubber snakes, it's a zombie who can't keep his Halloween teeth in his mouth. The lighting, sound, and sets are horrible (you can clearly see that Lucina's doctor and Dr. Specter's offices are the same friggin' room!) And the acting... oh the acting! Of all the \"actors\" in Asylum, one stands out above the rest. One man whose blandness out-shines all the others. He likes his clothes groovy, his cars mustard yellow, and his hair, side-burns and mustache big... really really big. This man is Nick Jolley. He alone is worth seeing this movie for. I'm not saying he's talented. Far from it. He's just so bad, he's funny. I would truly recommend this movie to anyone who enjoys watching really bad films and cracking-wise a la MST3K. It hurts, but with a few well-placed jokes and a few good friends to share them with, it goes down much easier.",
         "Get this title into your mind right now: ASYLUM OF SATAN. Why? Because the 70s was known for tons of low budget movies about the worst of both worlds: crowded asylums and Satanic possession. Before watching the movie trailer, I saw the full-length feature. What you get is absolute nonsense. This, being made a couple of years before THE EXORCIST, helped bring in numerous offerings about the Devil. Here, it's same old, same old. Cheap special effects are the excuse for a rotten-apple horror chiller, with rubber snakes and toy bugs taking toll on two innocent lives. Now, I've just seen the trailer, and I would have been better off giving a donation of twenty dollars to film preservation. An interesting note: the warning label on United's copy of the film is mistakenly misleading. Movies such as ASYLUM OF SATAN are junk food for your head. Just add a television set.",
         "Asylum of Satan (1972) ** (out of 4) Lucina (Carla Borelli) wakes up one morning in a mysterious hospital that she doesn't recognize. She asks to see her doctor but she is informed that he's the one who sent her to this hospital for a special treatment. Dr. Spector (Charles Kissinger) promises that the treatment will be quick but what she doesn't realize is that he's actually in a pack with Satan himself and sending him new women. ASYLUM OF Satan comes from Louisville director William Girdler who of course would go onto make some pretty good movies including some blaxploitation titles as well as GRIZZLY before his tragic death in a helicopter crash at the age of thirty. This film here certainly isn't anything special or good but I think it contains proof that the director had a talent and you can watch it and see why he would go on to make better pictures. With that said, one has to wonder what the point was of making a PG- rated exploitation picture. Obviously Satanic themes were quite popular during the early 70s but there's really not too much done with it here. If you're looking for nudity, gore or violence then you're going to be disappointed because there isn't any. There's really nothing too shocking and for an exploitation film the shock value is at zero. The film does have some good stuff and that includes the atmosphere, which is actually quite thick. I thought Girdler perfectly captures the mood and setting of this isolated hospital and I'd argue that the look of the seance was quite good. The Satan costume itself looks pretty silly but it's a fun outfit. I also thought Borelli gave a pretty good performance and certainly a lot better than you typically see in these types of films. ASYLUM OF Satan has a good, catchy title and I'm sure the poster lured people into drive-ins back in the day. The film certainly needed a punch of something because even at just 77-minutes it drags in spots. Still, it's an interesting picture that fans of Girdler should enjoy.",
         "The sweet and fragile Lucina Martin (an appealing portrayal by gorgeous brunette Carla Borelli) gets sent to a psychiatric hospital after suffering from a nervous breakdown. Unbeknownst to Lucina, said hospital proves to be a front for a group of devil worshippers who plan on making her their next sacrifice. While Do-It-Your indie filmmaker William Girdler's debut feature isn't a classic by any stretch of the imagination, it nonetheless still doesn't count as a complete stinker either. Okay, this movie does suffer from plodding pacing, a meandering narrative, and one of the silliest Satans you'll ever see in a low-budget 70's fright flick, but director/co-writer Girdler nonetheless manages to craft a few decent moments of reasonably spooky atmosphere, stages the murder set pieces with a modicum of flair, and brings a certain endearingly clunky sincerity to the goofy proceedings that's impossible to dislike. The acting from the non-star cast is decidedly hit or miss: Nick Jolley makes for a singularly insipid and unprepossessing hero, Charles Kissinger handles his juicy dual role as both a sinister shrink and a mysterious nurse with tremendous theatrical aplomb, Louis Brandy injects plenty of fire-breathing brio to his supporting part as the huffy Lt. Tom Walsh, and Sherry Steiner fails to convince as an ostentatiously blind woman. Girdler's funky-throbbing score hits the right-on groovy spot. An okay time-waster.",
         "This movie...where to begin. A heavily mustached Nick Jolley runs around smoking Slim Jims,wearing plaid bell-bottoms, and telling cops how to do their job. Zombies lose their teeth, Dr. Spector has a glued on beard, the \"decapitated head\" blinks, there's some sort of wormhole at the end of the film taking you to the beginning for a brief moment...one could go on and on. Put bluntly, this movie is one of the most horrid pieces you could ever hope to avoid. But after a while, you kind of start liking it! One might wonder why Nick Jolley wasn't in anything else. This film puts all questions to rest",
         "Luciana (Carla Borelli) is sent to a mental institution so she can be treated by the mysterious Dr. Spector (Charles Kissinger.) Specter is doing more than just run the hospital though: He also likes to sacrifice his subjects to Satan. William (\"Grizzly\", \"The Manitou\", \"Three on a Meathook\") Girdler's debut is something of a chore to sit through. With poor lighting (this is a low budget affair), amazingly overwrought acting, amateurish production values, a plot that's not too original-and that is dated even by the standards of the time, and a hilarious looking Satan in the film's climax (it's actually the Devil Suit from \"Rosemary's Baby\", only with a tacky mask added to it), there seems to be plenty for fans of camp to enjoy, but in reality it's just a bore. What's really amusing is that this movie was made in 1975. I say this because at this point, movies like this were largely considered old fashioned. Sure, the fact that Satan is involved is obviously due to the influence of \"The Exorcist\", but the tacky Monster, below sub par production values, and PG rating were old news in the post \"Exorcist\" and \"Texas Chainsaw\" world. The whole thing ends up feeling like it belongs more in 1971 then 1975, and I don't mean that in a good way.",
         "It is amazing how much this film sucks... The special effects are ground-breaking and I must say, the acting is the best I've seen in 27 years! Nick Jolley stars as some lady's boyfriend and his acting is pure-genious... When you see this film, watch the big fight scene he's in, it is flabber-gasting. Dr. Spectre is by far one of the best villians I've seen since Kevin Spacey in se7en. Rent, Buy, Or Steal this movie right away before you die...",
         "Everything you'd expect from a film with this title...nothing. I THINK I remember a woman in a weird house with a cafeteria with guys in white hooded robes staring at soft-boiled eggs on the tables... I remember the mustachioed guy and some painful-to-watch love scenes with said Village Person... I rented this years ago at a Blockbuster. I actually thought I was in for something remarkable- yes, I was duped by the box at a tender young age. I don't remember any sex, violence or nudity in this. Are there (*shudders*) multiple versions out there?? The copy I rented wasn't prerecorded, so I tacked on a little bit of a Disney animal movie on to the end there as a protest. If you have that tape, e-mail me. Look for the credit acknowledging the Church of Satan.",
         "William Girdler made his directorial debut in 1972 with the surprisingly decent exploitation flick Three on a Meathook, and since then basically everything he's directed has gone on to become notorious - though mostly that's because his films are so low quality, not because of any content. That is certainly the case with Asylum of Satan; a mind numbingly bad horror film which features nothing that would shock an audience of young children. The film focuses on a woman who wakes up in asylum, despite her feeling that nothing is wrong with her. The doctor is adamant that she must stay...and it son transpires that there's more to this medical centre than meets the eye. The film is very short; running at under eighty minutes and I am really glad it wasn't longer as the majority of the duration is mind-numbingly boring. The plot basically just plods along for the entire film and the 'twists' to the story do nothing to make the film any more interesting and it gets tiresome quickly. The title does promise an appearance from the dark lord, and the film doesn't disappoint in that respect. It takes a long time to get there, but the ending is at least hilariously campy - the appearance of Satan is memorable for all the wrong reasons, however. Overall, this really is a horrible film and I would recommend it only to hardcore William Girdler fans...if there are any.",
         "Lucina Martin (Carla Borelli) finds herself in Pleasant Hill. It's a sanitarium she was put in after a breakdown she was told happened to her but she can't remember. She find she can't leave--she's locked in her room and the sinister Dr. Specter (Charles Kissinger) won't let her go. Her boyfriend Chris (Nick Jolley) comes to see her but isn't let in. It turns out she's to be sacrificed to Satan...or something. I fell asleep to be honest. Perfectly boring, stupid horror movie. It's badly acted (Jolley is the worst), directed and edited. Lousy lighting too--I couldn't make out what was going on a few times. The script is just silly too. The special effects are laughable--I got a BIG kick of the obvious fake rubber spiders used in one scene. It all ends up with some idiot in one of the most ridiculous costumes I've ever seen playing Satan! It's padded too, even at just 78 minutes, with a pointless and silly montage of Lucina and Chris to show their \"love\" for each other. And wait until you see actor Kissinger in drag (!!!) playing Martine! And Jolley wears some of the worst 1970s clothes I've ever seen. Maybe I'm being a little too hard on this. It was made on no budget and, by all accounts, everybody went out of their way to do as good a job as possible with no money. Still it sadly doesn't work. Director William Girdler did go on the bigger and better things--so to speak. He later did \"Grizzly\" and \"The Manitou\". These were hardly classics but much better than this. A 1 all the way.",
         "That's about all that can be said about this movie... easily one of the worst I've ever seen, and it was completely undeserving of the NC-17 rating it was given (at least the copy i rented)... I've (seriously) seen worse PG movies, with regards to both violence and sex/nudity. The soundtrack was atrocious, the wardrobe was even worse (yes, I know it was low-budget, but they could have done a LITTLE better...), it was just a really really bad movie. I wouldn't recommend spending the 80 minutes it takes to watch it, even if you are able to see it for free... PLEASE don't spend money to rent/buy, believe me, it's not worth it.",
         "..it would have won 10 oscars compared to this turkey! I have only one thing to say about this film. BAD!!!",
         "I am ashamed to say I have seen this movie. And more than once. Why? I guess I'm just a sucker for pain. But really, Nick Jolly? Where did they find this guy? For that matter, where did they find any of these people? I'd say \"Asylum of Satan\" should be burned, but it's just too much fun to make fun of a la MST3K (who, by the way, would have a field day with this stink-burger!)."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Studio 1 Productions"],
      "summaries": [
         "A young woman is brought to an asylum to receive special treatment from a mysterious doctor. Dr. Spector does more than just run the hospital -- he offers his patients as sacrifices to Satan.",
         "A young woman finds herself held against her will in an eerie mental asylum by the sinister \"Dr. Specter\" and his masculine-looking assistant, Martine. She begins to suspect that the visions of horror she experiences are not nightmares and that she is due to be sacrificed to The Evil One."
      ],
      "budget": 50000
   },
   "movielensId": 142250,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-01-01",
      "dvdReleaseDate": null,
      "directors": ["William Girdler"],
      "runtime": 80,
      "movieId": 142250,
      "title": "Asylum of Satan",
      "mpaa": "PG",
      "actors": [
         "Charles Kissinger",
         "Carla Borelli",
         "Nick Jolley",
         "Louis Bandy",
         "Claude Fulkerson",
         "Sherry Steiner",
         "Mimi Honce",
         "James Carroll Pickett\t"
      ],
      "imdbMovieId": "0068231",
      "originalTitle": "Asylum of Satan",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young woman is brought to an asylum to receive special treatment from a mysterious doctor. Dr. Spector does more than just run the hospital -- he offers his patients as sacrifices to Satan.",
      "tmdbMovieId": 84418,
      "avgRating": 2.5,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/b3gRg1JALPrvesuvJTuQafB05NY.jpg"
   }
}