{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "blaxploitation",
         "id": 10601
      }],
      "imdb_id": "tt0072440",
      "video": false,
      "title": "The Zebra Killer",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lt. Frank Savage",
               "gender": 2,
               "credit_id": "52fe49f19251416c910bdf1b",
               "name": "Austin Stoker",
               "profile_path": "/ukRtXDLGlmaSE4lAruhAqG7IsLJ.jpg",
               "id": 103707,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Det. Marty Williams",
               "gender": 0,
               "credit_id": "52fe49f19251416c910bdf1f",
               "name": "Hugh Smith",
               "profile_path": null,
               "id": 166190,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Killer (as James Pickett)",
               "gender": 0,
               "credit_id": "52fe49f19251416c910bdf23",
               "name": "James Carroll Pickett\t",
               "profile_path": null,
               "id": 933080,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lt. Robt. Creason",
               "gender": 0,
               "credit_id": "52fe49f19251416c910bdf27",
               "name": "Charles Kissinger",
               "profile_path": null,
               "id": 933079,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Frank's Lady",
               "gender": 0,
               "credit_id": "52fe49f19251416c910bdf2b",
               "name": "Valerie Rogers",
               "profile_path": null,
               "id": 1170134,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Whore #2",
               "gender": 0,
               "credit_id": "597962fa92514107e300904e",
               "name": "Mary Minor",
               "profile_path": null,
               "id": 1858716,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49f19251416c910bdf31",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe49f19251416c910bdf37",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe49f19251416c910bdf3d",
               "name": "William Girdler",
               "profile_path": "/8JCNwMdL9Fn9UYsatSPLTw1P2ME.jpg",
               "id": 112400,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56dc984bc3a368765100073c",
               "name": "Gordon Cornell Layne",
               "profile_path": null,
               "id": 1308320,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56dc986192514143750006bb",
               "name": "Gordon Cornell Layne",
               "profile_path": null,
               "id": 1308320,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56dc98d692514143730006a9",
               "name": "Jerry Styner",
               "profile_path": null,
               "id": 932950,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "56dc990c925141437b00069a",
               "name": "William L. Asman",
               "profile_path": null,
               "id": 1204485,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 8.0E-6,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 88348,
      "vote_count": 0,
      "budget": 0,
      "overview": "Based on the real events that shocked San Franisco in the early 70's. Mac portrays the role of The Zebra Killer, a white man who dresses in black makeup and strolls the city of San Francisco stalking, raping and killing young women. Lt. Savage hears that the Killer has killed his girlfriend. Lt. Savage goes everywhere to find and kill the maniac, along with the help of Williams and Robert.",
      "similar": [
         17006,
         26196,
         5822,
         56539,
         84062,
         46018,
         83222,
         26389,
         22311,
         1554,
         466,
         22021,
         11657,
         49010,
         24804,
         13855,
         482,
         29515,
         23847,
         50270
      ],
      "original_title": "The Zebra Killer",
      "runtime": 92,
      "poster_path": "/q0SKibNhAN5AHVkggKMosUcB3Xl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mid-America Pictures",
         "id": 17778,
         "origin_country": ""
      }],
      "release_date": "1974-07-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Savage and Wilson are Combat Cops! A Hard Way To Live... An Easy Way To Die",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Girdler"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "William Girdler",
         "William Girdler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072440/",
      "coverLink": null,
      "actors": [
         "Juanita Moore",
         "Austin Stoker",
         "Hugh Smith"
      ],
      "reviews": [
         "I was pleasantly surprised by the pacing and overall flow of this enjoyable blaxploitation flick by William Girdler. For the sake of argument, I would compare it to Marks' Detroit 9000 - though, lacking in budget (well...) and complexity, it is markedly (no pun intended) better. The highlight of the film is the maniacal baddie, again with the comparisons, who makes Dirty Harry's nemesis (name?) a gentleman in light of this deranged killer. The main character, Frank Savage, is also delightfully played with charisma and wit. Girdler's story is also interesting with generous amounts of dry humor. Contrary to what I had heard, there are no (hard) twists in the film, but there are some disturbing moments. While the murders are not particularly gruesome or graphic, the killer is just such a freak that it gives ya goosebumps - or maybe I am just a chicken. The supposed \"rape\" scene is somewhat implied, i.e. not-graphic, and lends itself to some interpretation on behalf of the killer's mental state (that is, did it actually happen?). There were some things that bothered me. As another reviewer here notes, Savage eats some fried chicken while investigating (the murderers and his girl's subsequent disappearance). I dont think the fried chicken was intended as a slur, BUT it becomes quite frustrating that Savage cant put together the clues (despite some given by mr.bad-guy himself) and furthermore, doesn't seem altogether too bothered by the situation at hand. Also, the brief appearance of D'urville Martin doesnt really fit into the story either. Perhaps it was meant to build the relationship between Savage and his partner, but I found it unecessary. The lack of any perceivable tension shown by the public (Kentucky seems pretty deserted, too!) doesnt really relay the (alternate) title \"Panic City\". AKA's aside, there's no real sense of urgency or panic demonstrated in anyone's (but the killer, really) actions. Perhaps a budget constraint??... Anyway, these are ONLY minor gripes. As a blax era film, I would go with a high score, an 8 or 9 (outta 10). As an ordinary film, perhaps a 7. Its only marginally what I would consider a blax flick - not just because it was good, which seems to not be a word in the blax reviewer's vocabulary - its more of \"race film\". The score, by Jerry Styner, is a hot blax score. There's also a balld sung by Richard Williams (of TV fame?) 'You My Lady'.",
         "Although this is classified as a \"blaxploitation\" film, it manages to be much more race-baiting than usual by having a white sniper (obviously modeled after Scorpio from \"Dirty Harry\" and thus indirectly modeled after the real-life Zodiac Killer)who disguises himself in black-face as he commits incendiary crimes against middle-class whites (which his why he is called \"the zebra killer\"--not because he kills any zebras). The good guy cop meanwhile is a black guy, thus giving the title its blaxploitation credentials. Still the plot was apparently pretty controversial which is no doubt why this film is pretty hard to find today even though it is probably cult director William \"Grizzly\" Girdler's best film. It is obviously the kind of film that couldn't be made today, and that alone in my book makes it worth a look. Unfortunately, the version I saw looked awful suffering from both bad original film elements and tracking problems from one of the few remaining videotapes that is still circulating around. I'd like to see this film resurrected on DVD. Fat chance though probably since many of Girdler's early films (like the vastly inferior, but much less controversial \"Three on a Meathook\")have yet to see the light of a DVD player. Still they released the even more racially-insensitive \"Fight for Your Live\" (although that film had the advantage of actually having been banned in Britain)so maybe there is hope.",
         "There's a lot of misinformation regarding this film floating around. Zebra Killer (aka Panic City, Combat Cops) stars Austin Stoker and Hugh Smith as police officers on the trail of a serial killer in Louisville, KY. The murderer goes on to kidnap and rape Stoker's lady, which drives Austin to heavy drinking and chicken eating. James Pickett offers a truly stellar performance, and D'Urville Martin makes a guest appearance in his trademark pimpsuit. Zebra Killer was originally rated PG but it received an R-rating upon release. SOURCE: williamgirdler.com",
         "A serial killer is loose in Louisville and even though he leaves notes behind each killing the police can't seem to make any sense of them as they are too brief and cryptic. Not only that, but each victim is killed by a different weapon and in a different manner so his motives are hard to figure out as well. Needless to say, the lead detective on the case \"Lieutenant Frank Savage\" (Austin Stoker) is under a great deal of pressure to find this maniac before he can kill again. And the pressure on him intensifies even more when the maniac kidnaps \"Frank's Lady\" (played by Valerie Rogers). To add even more fuel to the fire, all of this plays out in an area of the country where racial tensions run deep and the fact that Frank is black doesn't help matters in the least. Now rather than reveal any more I will just say that this was a fairly decent \"Blaxploitation film\" produced during a time when they were all the rage. Although times have changed and this movie is quite dated, it still manages to entertain to a certain degree and for that reason I have rated it accordingly. Average.",
         "The Zebra Killer is fast paced, violent (though without much on screen killing or gore), foul mouthed and overall a must-see cult flick. The provocative serial killer that taunts black detective Frank Savage is quite a looney tune, and he has an agenda that reminded me of a film like Seven, although that's about all there is to compare. The vibe is in my opinion quite different from other exploitation flicks; it's more directed at the hardship of a black cop in an overall white police force and in that sense has a strong feel of drama to it. Though the 'exploitation'-label is not at all unjust. Concerning the logics of the story: Savage does not come across as a clever cop that sticks to the case like cheese to macaroni, but it all just seems to unfold at its own pace. And when he finally does use his brain to make a connection, it's all done in a matter of seconds... And the identity of the killer not being black, is quite already obvious when he appears at the second hit (the bombing). These are minuses, but don't spoil the whole film though. Not at all. A great plus is the great music in it: a funky, strutting series of tracks, of which some are a little too uplifting for what is shown, to my taste (the fight between the killer and savage, and the opening scene), but one with the guitar noise at the end is just about perfect - some sort of funkrocknoise avant la lettre. I'd say a big seven, which is so big I'm making it an eight...",
         "Austin Stoker stars in this film from the early \"rip-off king\" writer/director William Girdler. The film has a cimax in which it is about a black man who kills people with a large knife. the film's rating- PG is strange because of it's violence THE ZEBRA KILLER (A.K.A- PANIC CITY) Is impossible to find and is completely unavailable. I have tried looking for it over the yrs and have had no luck on finding it or on the internet. >"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Mid-America Pictures"],
      "summaries": [
         "Based on the real events that shocked San Franisco in the early 70's. Mac portrays the role of The Zebra Killer, a white man who dresses in black makeup and strolls the city of San Francisco stalking, raping and killing young women. Lt. Savage hears that the Killer has killed his girlfriend. Lt. Savage goes everywhere to find and kill the maniac, along with the help of Williams and Robert.",
         "A police officer becomes obsessed with a satistic killer called \"The Zebra Killer\" who has kidnapped his girlfriend and discoveries many murders along the way while tracking him down."
      ],
      "budget": 0
   },
   "movielensId": 142256,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-07-01",
      "dvdReleaseDate": null,
      "directors": ["William Girdler"],
      "runtime": 92,
      "movieId": 142256,
      "title": "The Zebra Killer",
      "mpaa": "",
      "actors": [
         "Austin Stoker",
         "Hugh Smith",
         "James Carroll Pickett\t",
         "Charles Kissinger",
         "Valerie Rogers",
         "Mary Minor"
      ],
      "imdbMovieId": "0072440",
      "originalTitle": "The Zebra Killer",
      "genres": [
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": ["DaMnLlkyZWU"],
      "plotSummary": "Based on the real events that shocked San Franisco in the early 70's. Mac portrays the role of The Zebra Killer, a white man who dresses in black makeup and strolls the city of San Francisco stalking, raping and killing young women. Lt. Savage hears that the Killer has killed his girlfriend. Lt. Savage goes everywhere to find and kill the maniac, along with the help of Williams and Robert.",
      "tmdbMovieId": 88348,
      "avgRating": 3,
      "releaseYear": "1974",
      "numRatings": 1,
      "posterPath": "/q0SKibNhAN5AHVkggKMosUcB3Xl.jpg"
   }
}