{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "transgender",
            "id": 17975
         },
         {
            "name": "transsexual",
            "id": 34115
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt1830792",
      "video": false,
      "title": "Romeos",
      "recommendations": [
         15728,
         79919,
         94025,
         19369,
         26630,
         19235,
         71208,
         224404,
         20116,
         75353,
         31978,
         79908,
         342,
         86549,
         14681,
         26032,
         12839,
         17028,
         71744,
         15976
      ],
      "backdrop_path": "/sabnCvU9NuupK4xHW86x3EiESo7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Lukas",
               "gender": 2,
               "credit_id": "52fe48269251416c91081f47",
               "name": "Rick Okon",
               "profile_path": "/q3jR2D3ZHCLQpGYkLxGD5oXsRyz.jpg",
               "id": 592313,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Fabio",
               "gender": 2,
               "credit_id": "52fe48269251416c91081f4b",
               "name": "Maximilian Befort",
               "profile_path": "/hNxy2NanFkiwxx2g0dvRuJQgZ3P.jpg",
               "id": 299506,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Ine",
               "gender": 1,
               "credit_id": "52fe48269251416c91081f4f",
               "name": "Liv Lisa Fries",
               "profile_path": "/84JZDBz0sjegZ818v7p4o9yVTvP.jpg",
               "id": 583333,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Sven",
               "gender": 0,
               "credit_id": "52fe48269251416c91081f53",
               "name": "Felix Brocke",
               "profile_path": "/2WXlwRtZeheFbjaTmrUK3MuY8FZ.jpg",
               "id": 592314,
               "order": 3
            },
            {
               "cast_id": 1011,
               "character": "Annette",
               "gender": 0,
               "credit_id": "52fe48269251416c91081f81",
               "name": "Silke Geertz",
               "profile_path": null,
               "id": 1141835,
               "order": 4
            },
            {
               "cast_id": 1012,
               "character": "Herr Boeken",
               "gender": 2,
               "credit_id": "52fe48269251416c91081f85",
               "name": "Gilles Tschudi",
               "profile_path": "/xeFucil74AyWaIo6VqtnnsjoazM.jpg",
               "id": 41205,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f59",
               "name": "Sabine Bernardi",
               "profile_path": null,
               "id": 1141827,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f5f",
               "name": "Sabine Bernardi",
               "profile_path": null,
               "id": 1141827,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f65",
               "name": "Janna Velber",
               "profile_path": null,
               "id": 1141832,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f6b",
               "name": "Kristina Löbbert",
               "profile_path": null,
               "id": 73008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f71",
               "name": "Reanata Salazar Ivancan",
               "profile_path": null,
               "id": 1141833,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48269251416c91081f7d",
               "name": "Roland Appel",
               "profile_path": null,
               "id": 1141834,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57a8ec6fc3a368254e009dae",
               "name": "Moritz Schultheiß",
               "profile_path": null,
               "id": 144329,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.173905,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 81704,
      "vote_count": 28,
      "budget": 0,
      "overview": "Lukas, 20, is a prisoner in his own body. As a pre-op transgendered person, he is constantly finding himself trapped in uncomfortable, compromising positions. His best friend, Ine introduces him to the gay scene in Cologne where he meets the confident and gorgeous, Fabio. The two develop a romantic relationship that tests the boundaries of love. ROMEOS forgoes stereotypes and conventions to offer an honest and humorous examination of the most basic of human conditions: friendship, sex, and love.",
      "similar": [
         449176,
         184352,
         26280,
         10938,
         160165,
         513,
         383526,
         338189,
         370663,
         26371,
         376867,
         17483,
         258480,
         4369,
         18212,
         428493,
         12793,
         413666,
         152584,
         382475
      ],
      "original_title": "Romeos",
      "runtime": 94,
      "poster_path": "/k4pdtoC8vG8J2jnYpMUIRoRRnHW.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Enigma Film",
            "id": 22977,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Boogiefilm",
            "id": 12810,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Das Kleine Fernsehspiel (ZDF)",
            "id": 16053,
            "origin_country": ""
         }
      ],
      "release_date": "2011-12-08",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "How do you love someone, if you don't show who you are?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sabine Bernardi"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Sabine Bernardi"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt1830792/",
      "coverLink": null,
      "actors": [
         "Rick Okon",
         "Max Befort",
         "Liv Lisa Fries"
      ],
      "reviews": [
         "I've literally just returned from the screening of this movie and it's in my opinion one of the best titles out there dealing with the topic of transsexuality and even homosexuality. What is important and what this movie does so well, is dealing with the topic so problematic for any transgendered person that was ever attracted to someone of the same gender; which is, how to explain to others that being attracted to a woman doesn't make you a man - but feeling like a man does. Rick Okon does an amazing job - up to googling him I couldn't find out whether he is male or female in real life (the perfectly done breasts confused me) and I'm ashamed that I was focusing on this so much because it just shows once more how binary-minded we are about sex and gender, even though this topic is personal to me. However - for not being transgendered himself, the actor really gets the pain, the frustration, everything that is behind the feeling of not fitting in such a basic category system. I was also pleased with the development of other characters. In a love story, a view-point (and actually the whole life) of someone's best friend can get easily overlooked and I like how they dealt with it. The role of Fabio was also great and the scene with the trans-girl singing was just beautiful. Basically, if this movie would go on for another two hours, I would keep staring.",
         "Wow. Romeos moved me in so many ways that I feel...speechless. It's been a long time since I watched something that made the tiny hairs on my arms stand on edge. Moved to tears not only because of the performances (although they were extremely good) but because...finally someone has come along and made a movie so brutally honest, without apologies, on a topic that so many people are ignorant about. And we all know what happens when people are ignorant. Ignorance leads to fear and fear leads to blind hatred. That ignorance, fear, and hatred is what kills our youth, whether its from suicide or bashing. First part of the film reveals his daily routine as a trans gendered person: hormone injections, lifting weights, measuring different areas of his body, etc. He also keeps a live journal online where he connects with other trans gendered people in all stages of their transition. When Ine invites him out with her to a party, you really get to see how awkward it is for Lukas. Even though the hormone treatments have done wonders with his outward appearance-- facial hair, muscles, deep voice etc., the one thing they haven't helped him get rid of are his breasts. Lukas wears some sort of chest binding vest, but it still does not keep his bosom completely flat. This is why he layers his clothes, crosses his arms over his chest, never getting too close to anyone--another words, Lukas is always in a state of anxiety or paranoia, afraid that someone will notice. The hunky, charismatic Fabio is the one person Lukas wants to notice him, but not for his upper appendages. Fabio is the epitome of a gay alpha male, appearing to be confident in mind and body. He attracts the attention of both males and females and in some scenes in the movie, you wonder if he is bi or if he dates women to make Lukas jealous (you will see what I mean if you watch the film). Lukas is fascinated by Fabio; a part of it could be first love, a crush, but I got the sense that Lukas views Fabio as the perfect male specimen. He is everything that Lukas wants to be-- perfect body and the confidence to go with it. But all is not as it seems.But one of the hardest lessons Lukas must learn is how can he expect someone to love and see the real him if he can't even tolerate his own self? There are so many interesting topics that are addressed in this movie, but there were 2 that really fascinated me. One is during a scene where Lukas reluctantly goes with Ine to the beach because he finds out that Fabio is going. While everyone is stripped down to their swimming shorts or bikinis, you feel Lukas's awkwardness as he sits fully clothed with his layered shirts. As he watches Fabio and some of the guys swimming, Ine, his best friend, takes her bikini top off (remember, nude beaches are common in some other countries). Lukas points to Ine's breasts and starts explaining the breast removal process that he will eventually go through and Ine pushes his hand away and tells him to stop. She asks, \"If you like boys, why don't you just stay a woman?\" Lukas responds, \"One has nothing to do with the other.\" Lukas is completely right. But Ine's question is one that confuses so many people in the world. There is a BIG difference between someone's gender and someone's sexuality but oftentimes they are thought to be one and the same. Gender is whether you are a male, female, or trans gender (born with parts you don't identify with and wish to change such as in Lukas's case). Sexuality is your sexual preference, what you are attracted to, such as being straight, gay, bi-sexual, etc. So even though Lukas was born female, he identifies himself as male. He is in the process of physically becoming a male. Since he is attracted to men, that would make him gay. His best friend is being hypocritical. Ine openly admits she is a lesbian. So for her to tell Lukas that he might as well stay female if he likes guys sort of makes no sense. I could see that being more of a comment that someone homophobic would say. Lukas could have turned her words back on her and say, \"since you like women, why don't you grow a penis?\" This leads me to the last point I want to make that the movie addresses. Once Lukas's secret is revealed (I won't say how and why), prejudice starts to rear its ugly head. Fabio turns into one of his greatest tormentors, calling him a \"tranny\", flaunting other men and women around him as if to say he would date anyone other then him. Straight people are not the only ones that can be ignorant and prejudice towards trans gendered people. The homosexual community can be a trans gendered person's greatest nightmare. Why? Because ignorance breeds fear, and fear breeds hate. Fabio really does care for Lukas. What holds him back is his lack of knowledge about trans gendered issues and the pressure of what others would think of him liking someone like Lukas. There is no denying Fabio's curiosity and once he lets go of worrying about what others may or may not think about him and Lukas, he is then more willing to let go of his prejudices and learn more. And let me be clear, Fabio is not as confident as Lukas thought he was. There are many reasons why, but that is for you to find out!",
         "\"Romeos\"....is a Carefree title....a Fun title. BUT, buckle up your seatbelts and hold on tight....for the ride you're about to be taken on is, often, neither carefree nor fun. And why is that? Because, over and over, you'll be asking yourself: HOW is this young guy...this Rick Okon, from a little town in the Northeast fringes of Germany, able to drag us inch by inch by inch into all his emotional turmoil: Into his shyness...his physical discomfort...his fear of discovery...his beginnings of love? ....And while doing so with little more than his frequent arms-hugging-himself poses...his facial expressions...and those dark EYES. Well, the answer is just something you'll have to figure out after the trip. For each of us, it will have been different. But...forget the \"HOW\" we've just discussed. More important is the \"WHAT\"....for what we are being given here is a Near-Equal to the Oscar winning Best Actor performance in 1999's \"Boys Don't Cry\". That time, Hilary Swank......this time, a rising young German star. As the transgendering Lukas, Okon takes us along on an important part of his journey through the swirling emotions of Hormone Replacement Therapy. And on to complete physical transformation from female-to-male. BUT....in this film, unlike in others, the end goal is to find a same-sex (Male / Male) relationship. About which, please note the following: (( I can talk about this movie's particular sex-change circumstances in no better way than to paraphrase a quote by Reviewer, \"nnenok from Slovenia\" (here at IMDb.com): The MOST IMPORTANT lesson this film gives to us and to any already Transgendered-to-Male person (who is attracted to another Male) IS: ...Being attracted to a woman doesn't make you a man---but FEELING like a man does. )) So...maybe \"Boys Don't Cry\". Yet, perhaps at times, this film will bring you to the verge of doing so. For what we are seeing is a near breath-taking and heart wrenching performance (I often recall James Dean), about a young, transgendering German who has fallen for a macho Lover-Boy type. Yes, yes, Maximilian Befort, as Fabio, has a face and body which will keep your dreams HOT for days. A Lover-Boy?...sure. A Sex Bomb?...you bet. In fact, he's Sex on a Stick! YET, despite acting self-centered and forever off to the next conquest, his scenes with Lukas are always exciting ones...giving us a gut feel for the Fever which is building up between these 2, a Fever always tempered by fear of Fabio discovering the hidden transgendered condition. As to Fabio's side of this relationship, he is kept almost always off-balance, and in a perplexed state: Lukas being turned-on by Fabio...quickly followed by instances of Lukas shutting Fabio down. But, still, hard as it is to live with the emotional changes being thrown at him...Fabio does keep trying; he keeps coming back for more. (Leading to this Reviewer's opinion that Lukas has him hooked....letting the line out, then pulling it back--even if not always aware he's doing so). And so, I TRULY BELIEVE the ending lovemaking scene is giving us The Key to this relationship; oh, yes indeed, it is. BUT, that is not half as much as we are being told by the last few seconds shot, wherein we are watching through the lens of a digital camera...and seeing: A deliriously happy, and completely transgendered Lukas, taking off running into seaside sand dunes toward water's edge. Come on, now....STOP AND THINK about it! That CAN'T be all we're seeing. Because you know what? SOMEONE is holding that camera....You wanna take any bets as to WHO? Enjoy this Special Movie....And, thank you, Sabine. PS--And amidst all the turmoil...Thank Heavens for the occasional fun, lightness, and warm support given by terrific young actress, Liv Lisa Fries, as \"Ine\"...the B(Girl)FF of our Lukas during their growing-up years. ****",
         "It is becoming really scarce that an indie film has this kind of execution. Good actors, good dialogue, a plot that is like nothing else you've seen. The movie focuses on the identity crisis of a trans person, but then it shows you that the identity crisis, often isn't coming from the person themselves (they're actually pretty sure of what gender they belong to) but its the world who has the real crisis, the people around you, friends, family who are supposed to support you. The way the main character keeps fighting to find his place, it was heartbreaking and just really touching. We see the transformation too, and its just brilliant. I was completely amazed.",
         "Sabine Bernardi has nailed a fierce, tight, dramatic and moving story with this outstanding and challenging film. Can't say enough about the acting, directing and filming of this movie. I'm always wowed when the lead character is a whole human being - i.e., not perfect, but flawed and challenged - and you are still compelled to fall in love with that character. Mix that with a topic as difficult for some people (including myself for a large part of my life) as the subject of transgender (and do it well) and it results in a first-class story. Both leads are very good in this story, but Fabio, our lead's romantic interest, is really a backdrop and context for the voyage of self-discovery for the lead, Lukas. The mingling of the process of making the transition from female to male and the growing romance between the two leads is amazing, supple and moving. This is one of the most unique and get-under-your-skin films I've ever seen.",
         "Honestly I thought the character Lukas was treated really unfair to anyone who was so close to him. I thought that Ine one was such an unsupportive person like why was he still friends with her? The storyline was always so upsetting and very depressing really, I nearly had tears. I wouldn't call this a best LGBT movie because the actors didn't show much emotion doing their roles especially Rick Okon who played the lead character. Himself and the cast probably didn't like being involved with this film. Lemme tell ya, it's not the best to look at even on a Saturday night!",
         "I'm going to be honest, I put of watching this movie for several months for multiple reasons, the most important one being the fact that I was unsure if I would even enjoy \"Romeos\". I'm a gay transman myself and let's be honest, there aren't a lot of movies who even deal with transgender issues, yet alone the issues gay transmen face. (At this point I'd like to point out that the right word to use in this context is either \"trans\" or \"transgender\", most of the reviews on here use the word \"trangendered\", which is incorrect, in the same way a blind person is not \"blinded\". Anyway, moving on...) I won't summarize the plot, considering it is probably the weakest aspect of the movie. To put it simple: It's a love story with lots of teenage drama. Instead I would like to emphasize that I was honestly impressed by Rick Okon's work as an actor. Sure, I would have preferred an actor who's actually trans, but I still thought Okon's performance was great. It was obvious that this was a role he really prepared for, the awkward posture is something I always catch myself doing, it was almost a perfect reenactment. Most other issues for transmen were also portrayed accurately, constant fear of being found out, people accusing you of being egoistic, stupid questions, having to fight for your rights etc. Yes, some of it was different from my own experience, but that's the thing, there is not one universal experience. (However, two things were simply wrong/outdated. First, transmen usually don't do their own shots in Germany but have it mostly done by a nurse, but I suppose doing your own shots seems \"cooler\". Second, you can now change your gender marker without any surgeries, but this might have not been the case when the movie was released.) The only thing I truly disliked was the constant focus on sex. Yes, the gay scene can be quite sexual, but there are obviously lots of gay men who think differently. Oh, and another things: There are definitely better ways to flatten your chest. I was constantly frustrated because the binder Lukas used was just horrible. I suppose it would have erased some of the plot points but it was just frustrating to watch, knowing that there are way better and more functioning alternatives. Overall, I would definitely recommend this movie, especially to someone who has little knowledge of transgender issues.",
         "I have seen quite a few movies dealing with MTF trans, but rarely one dealing with FTM. So needless to say, I was very excited to see this. And sadly, I couldn't be anymore disappointed. This film feels like a straight up gay male film, thanks to a miscasting of epic proportions. While I'm sure Rick Okon is a fine actor, he has no business playing the role he was cast in. There are so many real transgendered actors and actresses out there, struggling to get work like the rest. And yet, they are denied roles that were basically made for them! It seems very hypocritical for a film that wants to express the struggle of being transgendered. They literally slapped prosthetic breasts on a biological male and called it a day. There are no nuances in Rick Okon's performance to give us any clue that we are watching a pre-op transgendered male struggling with his identity. Not even seeing his breasts can fool me into thinking for the briefest second that he is trans. On top of that, the story was sub par and resembles that of a cheap cliché gay romance flick more than anything. And even that's a stretch, as the romance here is so illogical and poorly done that I was actually irritated when they ended up together. His supposed love interest spends half the film taunting and teasing him, and otherwise humiliating him in public. And then suddenly a light bulb goes off in his head, and we're suddenly supposed to believe that he is instantly redeemed for his transgressions? I don't think so. It is incredibly fake, lacking any semblance of heart. I also have many objections to the portrayal of trans life and emotions. As a trans person myself, it saddened me to see how pertinent questions and issues were just glossed over to make the film a bit more easily digestible to hetero cis gendered viewers. In a perfect world, this film would clue in cis gendered people as to what many trans people experience and struggle with and feel, while making any fellow trans viewers feel a sense of solace and understanding. I don't expect every LGBT movie to be a \"Boy's Don't Cry\" style tragedy, but I do expect portrayals of LGBT issues to be respected. This film has no respect and no interest in portraying any issues or struggles a real transman faces in the world. Lukas is clearly struggling with his transition, and struggling to find his place in the world as a man who still has his female parts. Yet none of the film's events explore that. In fact, the film contradicts itself by not exploring those feelings, trading it in for cheap pseudo-conflict in the form of the mild teasing and taunting he faces. He is striving to be as masculine as possible, and yet the possible conflict he faces while being attracted to a man, which is by the general consensus of society considered \"unmasculine\", is never really even brought up. It is a simple, watered down portrayal of trans life that I would only recommend to cis heterosexuals that want to watch a film about a minority, without having to ponder their own beliefs and the harsh realities many trans people face everyday. It's more or less a gay film, with a lead who happens to be trans. It'd be a tad more excusable if there was at least some good drama or romance to be found. And there is not. This could have been an amazing film, and instead it is cheap and even mildly offensive.",
         "Romeos focuses on Lukas, a trans boy who is living in a dorm as he does some sort of community work. The film focuses on Lukas' relationships with his friend Ine, who knew him before his transition, and Fabio a man who Lukas has mutual romantic feelings towards, as well as Lukas' struggles and achievements during transition. Romeos is an enjoyable film, though it contains some homophobia and a fair amount of transphobia. As far as I can tell Lukas is played by a cisgender man, which is not ideal. The film has a happy ending, and is very effective in portraying Lukas' dysphoria and anxiety about passing as a cisgender man. (spoiler)There is a short scene which involves attempted rape. (end spoiler) Would not recommend for anyone in a fragile emotional position, due to excessive amounts of transphobia shown by certain characters. Nevertheless Romeos is an enjoyable movie, the narrative treats its protagonist with respect and dignity, and the acting and production value is good quality. (Spoiler) Contains miss-gendering, dead naming, upper body nudity, attempted rape, t-slur, other transphobic and homophobic language (end spoiler)",
         "Nice little, never boring love and sex movie, trying to convey a serious topic. Nice to be seen for one time. With sexy actors in often sexy action and a funny, over sexy, up to exciting content. There are only few seriously inspiring or aspiring parts: (potential spoiler!) e.g. the voip sessions and the scene with the little sister. Otherwise trivial, shallow or fake. Bads: Extremely cliché rich concerning the following clichés: overly macho-like, violent and homophobic Southern Europeans; homophobic Southern Germans (Bavarians); overly mobbingful young people; sexist clichés in young people, i.e. \"all girls are nice and sweet, all boys are nasty and mean\"; gay man have sex with each other always and everywhere. All that is not reality and is tiresome to watch. All people in the movie look like super models or at least pretty attractive (in a porno this would be good, a \"normal\" movie is only rendered incredible). And yes: The average German and also the average Southern European does not look like a model. Rich in crypto-pornography, i.e. something pretends to be non-pornographic, though it's actually not, e.g. if in a movie all people are super-hot with no content-wise reason; normally to be seen in most mainstream US-American movies. The movie shows the life of the roles as consisting only of party, sex, leisure time and a little bit of sleep (\"fun porn\"), although the protagonist lives in a dorm for civilian servicers/nurses, and I was curious what problems or difficulties may occur in his everyday work because of his transgernderness. That again are elements of crypto-pornography and unrealism. Too much \"deus ex machina\", i.e. incredible coincidences that are used to support and promote the action; also the cliché elements are particularly used in this way, what the authenticity of the whole movie suffers from. The precarious situations the protagonist runs into because of his transgenderness are also mostly incredible. Real transgenders are just much better in hiding their secrets. The end is no end, the movie just breaks off, and additionally in the best moment, to make the missing of the end dramaturgically particularly meaningful, a true content-wise meaning though (for me) is not recognizable. Gives a simplified (misleading) idea of transgenderness. Goods: The residual of the accustomed girl-like dealing with his female best friend from former times is well depicted by the protagonist. His reactions to the first positive responses from other boys to his new male appearance are well depicted by the protagonist. The female breasts (of the boy) look super-extremely real. In general, the actors do a good job. The basic ideas of the movie are super (would be great, if they would be realized more well in the future). The depictions of the actors are per se good and entertaining to see. Gives a simplified (easy to understand) idea of transgenderness.",
         "Much more. \"Romeos\" is a German movie from 5 years ago written and directed by Sabine Bernardi. No surprise to see she is back to directing mediocre television projects as her effort here for this film is fairly mediocre as well, sometimes even bad. It runs for slightly over 90 minutes and takes us into the world of a young woman who intends to become a man via surgery. The first and possibly biggest problem is that the protagonist is played by a male and, not at one single point in the film, looks physically in a way like she has ever been a woman from the biological perspective. So yeah, bad casting decision, bad makeup etc. Your pick to make. Speaking about the story, it is not more convincing either. They try so hard to make this a touching film, but it never really gets past the attempt. The acting is not good on many occasions and the script isn't any better. The most known cast mate is certainly Liv Lisa Fries, who has become a breakthrough artist in recent years and been the lead in her own coming-of-age films recently. But she cannot elevate the material here either. In my opinion, this film has the same problem as so many other LBGT-themed movies. It is about a certain subject and, as a consequence, gets appreciated by audiences and awards bodies a lot more than it should. Audiences to whom this concerns should not just suck it up because it is about a certain subject, but they also need to want a certain level of quality, a level that is not reached here at any point. You cannot even blame the filmmakers for putting in so little effort if including a certain subject is already enough for a film to be liked. This is not a good film here and deserves none of the appreciation and popularity it received. I do not recommend checking it out. Thumbs down.",
         "I liked this movie, but casting Rick Okon as Lukas was a serious problem for me. I never for one second believed he was or had ever been female, so I couldn't help relating to that character as a man and only a man. It's a sharp contrast to the casting 15 years ago of Steven Mackintosh in the mirror-image role of Kim in Different for Girls. Kim is a transgendered male-to-female, and Mackintosh is SO believable as a woman that I had to do considerable research to ascertain that the actor himself wasn't transgendered. He wasn't, and, in fact, he doesn't look the least bit feminine in real life, which makes his casting as Kim all the more remarkable. Romeos is a pretty good movie anyway, but it doesn't depict the transgender experiences of the character as successfully as it does his experiences as a man. The movie would have been better with someone else cast as Lukas or if Lukas had just been a gay man, which is how he comes across anyway. In order to make sense of the character Okon was portraying, I had to ignore all the transgender issues, which simply were absurd for that entirely male character, and I'm sure that's not what the director intended."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Boogiefilm",
         "Das Kleine Fernsehspiel (ZDF)",
         "Enigma Film"
      ],
      "summaries": [
         "Twenty year old Lukas (Rick Okon) is a female to male (FTM) Transsexual man, taking the steps through his gender reassignment treatment. His friendship with Ine (Liv Lisa Fries), who is lesbian, is making the changes and assimilation easier. Lukas sees his romantic world open up for him as Ine introduces him to gay life in Cologne. As he becomes more and more interested in a local gay boy (Max Befort), things are getting more and more complicated. Should Lukas tell this boy who he really is?",
         "A drama centered on the relationship between a two young men, as one of them navigates the difficulties of life as a transgender man."
      ],
      "budget": 0
   },
   "movielensId": 142240,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "2011-12-08",
      "dvdReleaseDate": null,
      "directors": ["Sabine Bernardi"],
      "runtime": 94,
      "movieId": 142240,
      "title": "Romeos",
      "mpaa": "",
      "actors": [
         "Rick Okon",
         "Maximilian Befort",
         "Liv Lisa Fries",
         "Felix Brocke",
         "Silke Geertz",
         "Gilles Tschudi"
      ],
      "imdbMovieId": "1830792",
      "originalTitle": "Romeos",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ZHFjDJzrjGE"],
      "plotSummary": "Lukas, 20, is a prisoner in his own body. As a pre-op transgendered person, he is constantly finding himself trapped in uncomfortable, compromising positions. His best friend, Ine introduces him to the gay scene in Cologne where he meets the confident and gorgeous, Fabio. The two develop a romantic relationship that tests the boundaries of love. ROMEOS forgoes stereotypes and conventions to offer an honest and humorous examination of the most basic of human conditions: friendship, sex, and love.",
      "tmdbMovieId": 81704,
      "avgRating": 3.81818,
      "releaseYear": "2011",
      "numRatings": 11,
      "posterPath": "/k4pdtoC8vG8J2jnYpMUIRoRRnHW.jpg"
   }
}