{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0069115",
      "video": false,
      "title": "Pourquoi Israël",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53744e24c3a36815390021a5",
               "name": "Claude Lanzmann",
               "profile_path": null,
               "id": 127491,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53744e48c3a36815180022e3",
               "name": "Véra Belmont",
               "profile_path": null,
               "id": 41518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53744e6ac3a368152000222e",
               "name": "William Lubtchansky",
               "profile_path": null,
               "id": 24822,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53744e7bc3a368150f002237",
               "name": "Colin Mounier",
               "profile_path": null,
               "id": 72920,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "53744eb7c3a36815300022b8",
               "name": "Bernard Aubouy",
               "profile_path": null,
               "id": 1179785,
               "department": "Sound",
               "job": "Sound Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.036504,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 269961,
      "vote_count": 1,
      "budget": 0,
      "overview": "Using interviews and other footage shot especially for this documentary, French director Claude Lanzmann investigates the state of Israel in 1972. This movie concentrates on Israelis going about their business of everyday living.",
      "similar": [],
      "original_title": "Pourquoi Israël",
      "runtime": 185,
      "poster_path": "/t9RKoSA1hQDV6StT8Wb7NUxNBja.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1973-10-01",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Lanzmann"],
      "runtime": 185,
      "synopsis": null,
      "writers": ["Claude Lanzmann"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069115/",
      "coverLink": null,
      "actors": [
         "Schmuel Birger",
         "Gad Granach",
         "Claude Lanzmann"
      ],
      "reviews": [
         "\"Pourquoi Israël\" (\"Israel, Why\", without a question mark) is Claude Lanzmann's first documentary. Lanzmann is famous for his most prominent work, \"Shoah\", a lengthy yet powerful and unforgettable history of the Jewish genocide during WWII. \"Pourquoi Israël\" examines life in Israel twenty-five years after the birth of the state. Lanzmann said that he was in Germany to study philosophy when the Jewish Agency became the Provisional government of Israel in 1948, therefore not at all aware of what was going on in Palestine. Not a fervent Zionist himself, Lanzmann is nevertheless haunted by what makes Jewish identity and anything related to this topic. It is interesting to note that Lanzmann started to shoot footage for \"Pourquoi Israël\" right after writing \"Elise, ou la vraie vie\" (\"Elise, or Real Life\" -- see that entry) which was a film on the Algerian war. Indeed, it may seem a little odd that someone who is clearly against colonialism would support the survival of Israel, but Lanzmann takes on a non Manichean approach (I wouldn't say \"objective\", that's something else) when he depicts the achievements and contradictions of the Israeli nation. Through a series of scenes, where the director spends time with many different people (German-Jewish migrants, dock workers, intellectuals, police, prison inmates, and the newly arrived -- especially from Russia), Lanzmann shows that the normality of a \"state like any other\" is actually abnormality itself. \"How peculiar is a place where there are Jews and nothing but\", he once stated in an interview. Is \"Pourquoi Israël\" \"Shoah\" before \"Shoah\"? Yes and no. It is already a lengthy collection of interviews (it lasts almost three hours; that's short by Lanzmann's standards), but it has a faster pace, some mise-en-scene here and then and, yes, some humor, as the film often addresses much lighter issues than \"Shoah\" (as one may expect). In any case, Lanzmann's works are meant to make you think. As always, you have to be ready to absorb their content and make something out of it. The title of the film is often incorrectly given as a question (\"Why Israel?\"). The documentary is rather an answer or an explanation. That is why it is still relevant to watch this documentary, even today (the film premiered in a difficult context, just when Yom Kippur war broke out in 1973), for most of the problems Israel still faces are exposed here. Lanzmann started to make extensive research for \"Shoah\" right after the release of \"Pourquoi Israël\", obviously the second part of an insightful trilogy on what is \"Jewishness\" today (the third part being the documentary named \"Tsahal\").",
         "What is the Jewish reality? How is it unreal, different than normal, and what does it mean for the people? This is at the center of this three- hour documentary on the state of Israel by the filmmaker Claude Lanzmann, whose biggest call to fame is apparently the later Shoah. He travels the country with his camera hoping more to amass rich and diverse contrasts than any easy set of answers. The film, made just before the Yom Kippur war, so when elation over the Six-Days was still running high, is loosely a series of interviews, with Lanzmann probing from all angles, visiting the rich and poor, prisons, construction sites, kibbutz. So what does the accordionist who was a member of the Communist Youth in 1933 Berlin have in common with intellectual German Jews, bankers and lawyers? Marxist kibbutz youth with the blue-collar dock workers of Haifa? How do the busload of complacent American Jews visiting from Boston partake of the same identity, the same reality as some of the first settlers of the Negev who made the desert bloom, then in their 70's? A few notes. You'll decide whether Lanzmann's decision to not give voice to Palestinians is omission or statement, especially resonant now that you know of Israeli efforts to isolate Palestinians behind walls. However, put that aside and this is an illuminating work on Israeli soul. You may note as connecting tissue the fact that all the people interviewed feel Jewish. The direct link of how deeply this is felt to how deeply it is opposed in the area and elsewhere. And yet, this instinctively felt 'Jewishness' emerges as not a single thing. Usually lost in polarizing talks of the Israeli-Arab conflict, Israelis are as diverse as their neighbors, even more so at the time. Religion, the Holocaust, the army, all three are shown to be strong social adhesives of identity—Lanzmann would make separate films on the last two. Why this hits deep is that you don't have political and historical 'experts' spouting analysis, this fluidity of identity is laid bare as part of actual life, in the stories of people. I am fascinated by the broader implications of the question of how we structure reality and self. Is it this or not this? Is there mechanism? I have been charting this through films, our best tool for structuring reality. My favorite bit here which I think explains a broader cycle is the following: an airplane is shown to dock in Tel Aviv, and out comes a fresh batch of Jewish immigrants to bolster the still young nation-state, these ones from Russia, from Georgia and Lithuania, some of whom don't even speak the language and whose only connection to their new home is that they identify as Jews. It is startling to see the face of a steppe- hardened old Russian, it's so evident he is from another faraway world. Jews in Russia, but suddenly Russians in Israel. As a matter of fact, Jews had a tenuous presence in Palestine up until the late 19th century, one of many tribal minorities. They had a rich history of dislocation, from Judea to Spain and Russia and so on. We can actually see, in the film, how diverse they grew to be in exile, contrast the Boston Jews with the Russians, the Germans with the Arab Jews. I know of no other film that offers this profound view of a people. The connecting tissue is the same as what compelled the return; tied to persecution, it was the story of a promised land, a place most knew as only part of the story of who they are. The journeys of those early pioneers are in a way mirrored in some of the stories of later settlers recounted here. So how revealing when you find out that Zionist planners lied and manipulated to entice settlers? So, fluid self. A fictional story as anchor mapping reality to come. Its power? It made the desert bloom. When the Jews started coming back, there was no Tel Aviv waiting for them, it was all built from scratch on sand dunes. There was, in fact, a whole slate of part-travelogue, part-advertisement films made in early 1930's Palestine to encourage settlement there, shown abroad, which I hope to write about in future posts.",
         "French professor, film editor and director Claude Lanzmann's debut documentary feature is the result of a started book and a reportage which was not made. It premiered at the New York Film Festival in 1973, was shot on locations in Israel and is a France-Israel co-production. It tells the story about a state with a signifying name which became instituted in the late 1940s some years after the end of the Second World War (1939-1945), the first émigrés from other nations who in the mid-1950s came to a place called Dimona which they had been told was a city, the people who live there, the people who relocate themselves to live there and to return to their ancestries, intentional communities located mostly in rustic areas which came into existence in the early 1900s during the Second Aliyah and the Ottoman Empire (1299-1923) and a renowned movement with origins going back as far as to an ancient Empire in Iraq which was established many years ago by human beings called Semites. Distinctly and subtly directed by French filmmaker Claude Lanzmann, this quietly paced documentary which is translated and narrated interchangeably from multiple viewpoints, draws a conversational, thematically substantial, melodic, authoritatively serious and disarmingly humoristic portrayal of the living conditions in this country at a period in time when many people of Jewish origins, especially from the former Soviet Union, came there as expatriates and how they experienced this transition. While notable for its atmospheric and versatile milieu depictions and reverent cinematography by French cinematographers William Lubtchansky and Colin Mounier, this dialog-driven and narrative-driven story reflects upon themes like Jewish identity, roots, linguistics, characteristics, culture, traditions and history, the history of Israel, the recurrent relations between Israel and Palestine, relations between Israel and Germany, their prominent military standards, laws which then said that only a person who is born to a Jewish mother, was converted to the Jewish faith and does not belong to another faith can be registered as Jewish, boarders, answers and naturally on human communication within a nation known by the names Eretz Israel, Land of Israel and the Promised Land which was declared a century after American abolitionists named Elizabeth Cady Stanton (1815-1902) and Lucretia Coffin Mott (1793-1880) held a convention in Seneca Falls, New York in USA, by a Polish-Jewish author and its first president named David Ben-Gurion (1886-1973). With interviews of interviewees like Israeli and Jewish citizens, students, professors, military officers, police officers, prisoners at Tel-Mond, Israel, dock workers, Gan Shmuel Kibbutz members, Israeli Black Panther members, American tourists, families and their children which underlines the normality of the State of Israel, the abnormality within the normality, sincere comments like: \"We may work with our hands, but we are not working-class. We have no common language\u0085\", \"If you come all this way, you build this country to let just people to die, then why did you make all this way. You can die elsewhere also\u0085\", \"We are trying to spread Judaism amongst Jews.\", \"I always prefer the product of man's work.\" and a timely response from a dock worker who asks the director: \"Would you give Paris to the Germans or the British?\", this multifaceted and monumental testimony which was made the same year as an Israeli politician from Tel, Aviv, Israel named Shulamit Aloni (1928-2014) inaugurated the civil rights movement in Israel, two years after a place in Copenhagen, Denmark called Fristaden Christiania was established, six years after a voice from Israel's history sang a song about Jerusalem and nineteen years before an American songwriter sang: \"\u0085Where are those angels when you need them - - Why do we crucify ourselves\u0085\" creates perspectives which represents generational and global significance. This territorial, historic and humanizing three-hour and twelve minutes introduction, journey and educational experience which is set in Israel in the early 1970s in the then twenty-four-year-old Jewish state where an Israeli politician named Golda Meir (1898-1978) was prime minister, an Israeli journalist named Zalman Shazar (1889-1974) was president and a movement called Nilahem was initiated, where the instructor keeps on asking why in French and English without a question mark, receives all kinds of answers which are both indiscreetly straightforward, genuinely accommodating and in its right unrequited and a newly arrived French speaking woman of distinguishable politeness says: \"But I am a Jew\" is impelled and reinforced by its fragmented narrative structure, subtle continuity, ingrained religious undertones, introducing and echoingly narrating scenes of the Dead Sea, comment by a secular non-Jewish mother and wife: \"Not being able to leave this country and come in contact on normal terms with other people\u0085\" and by an American-Jewish man: \"Why? It just does something to you.\" A mystical and informative documentary feature."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Stéphan Films",
         "Compagnie d'Entreprise et de Gestion (CEG)",
         "Parafrance Films"
      ],
      "summaries": ["A documentary examining life in Israel twenty-five years after the birth of the state."],
      "budget": 0
   },
   "movielensId": 142216,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1973-10-01",
      "dvdReleaseDate": null,
      "directors": ["Claude Lanzmann"],
      "runtime": 185,
      "movieId": 142216,
      "title": "Pourquoi Israël",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0069115",
      "originalTitle": "Pourquoi Israël",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Using interviews and other footage shot especially for this documentary, French director Claude Lanzmann investigates the state of Israel in 1972. This movie concentrates on Israelis going about their business of everyday living.",
      "tmdbMovieId": 269961,
      "avgRating": 5,
      "releaseYear": "1973",
      "numRatings": 1,
      "posterPath": "/t9RKoSA1hQDV6StT8Wb7NUxNBja.jpg"
   }
}