{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "evil doll",
            "id": 9707
         },
         {
            "name": "haunting",
            "id": 10224
         },
         {
            "name": "possessed",
            "id": 10375
         }
      ],
      "imdb_id": "tt4141368",
      "video": false,
      "title": "Robert the Doll",
      "recommendations": [
         192023,
         100541,
         157422,
         341886,
         28660,
         140750,
         20029,
         28344,
         225898,
         27712,
         308017,
         332624,
         28743,
         200803,
         193611,
         312131,
         16846,
         184710,
         214433,
         253794
      ],
      "backdrop_path": "/7FJv1bVpFr3MMUo2gvInCJ4Bwy5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Paul",
               "gender": 0,
               "credit_id": "574a24e29251417138003736",
               "name": "Lee Bane",
               "profile_path": "/jtV61c728Ai3CnE4ZZm77CcjVDk.jpg",
               "id": 1242063,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Martha",
               "gender": 0,
               "credit_id": "574a24fd925141713d003702",
               "name": "Megan Lockhurst",
               "profile_path": null,
               "id": 1627685,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Gene",
               "gender": 0,
               "credit_id": "574a256d925141144b000d4f",
               "name": "Flynn Allen",
               "profile_path": null,
               "id": 1627698,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Jenny",
               "gender": 0,
               "credit_id": "574a2583c3a368338d003caf",
               "name": "Suzie Frances Garton",
               "profile_path": "/3gDWsTxFVqrJ9Pkn031ZxziPNpL.jpg",
               "id": 1627699,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Agatha",
               "gender": 0,
               "credit_id": "574a259e925141144b000d58",
               "name": "Judith Haley",
               "profile_path": "/whP5KmRoC14iFE6M6Uf8xhdULr9.jpg",
               "id": 1512658,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Debbie",
               "gender": 0,
               "credit_id": "574a25b1c3a368338d003cb4",
               "name": "Cyd Casados",
               "profile_path": null,
               "id": 1507487,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Clarence",
               "gender": 2,
               "credit_id": "574a25c4c3a3682fd6000d69",
               "name": "Ryan Michaels",
               "profile_path": null,
               "id": 953198,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Steven",
               "gender": 0,
               "credit_id": "574a25d2c3a3682fa4000fc8",
               "name": "Samuel Hutchison",
               "profile_path": null,
               "id": 1627701,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Emily Barker",
               "gender": 0,
               "credit_id": "59809237925141496f01292e",
               "name": "Tiffany Ceri",
               "profile_path": "/fh8QTY1icsVRXxl65alziVMeUZM.jpg",
               "id": 1572898,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "574b315cc3a3683a5e001948",
               "name": "Andrew Jones",
               "profile_path": null,
               "id": 1161014,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "574b316ac3a36840cc0000c6",
               "name": "Andrew Jones",
               "profile_path": null,
               "id": 1161014,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.331617,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 356149,
      "vote_count": 29,
      "budget": 0,
      "overview": "In this chilling story based on real life events a family experience terrifying supernatural occurrences when their son acquires a vintage doll called Robert.",
      "similar": [
         250546,
         2655,
         91586,
         201085,
         138843,
         452507,
         396422,
         77949,
         259693,
         288158,
         620,
         134366,
         11618,
         23827,
         242512,
         243688,
         565,
         10014,
         11932,
         343674
      ],
      "original_title": "Robert the Doll",
      "runtime": 90,
      "poster_path": "/me4Cyy5F7SjQ3fmxL4Mo63UIg2A.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2015-08-24",
      "vote_average": 3,
      "belongs_to_collection": {
         "backdrop_path": "/dIhcKuQl3Pi6QvA9UONH8HEEvsv.jpg",
         "name": "Robert",
         "id": 479692,
         "poster_path": "/8z0HV7dnEjJRCNSVdLx0DgUhi0Z.jpg"
      },
      "tagline": "He wants to be your best friend...forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Andrew Jones"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Andrew Jones"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt4141368/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg4MjUyOTUwNl5BMl5BanBnXkFtZTgwMjY1NDM2NjE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Suzie Frances Garton",
         "Lee Bane",
         "Flynn Allen"
      ],
      "reviews": [
         "I don't normally write film reviews but feel like I owe it to potential watchers of this movie to write one. First of all, the people that gave this movie 7/8 put of 10.. have you ever actually seen a decent horror movie?! The acting if you can call it that was beyond terrible. Literally painful and cringey to watch. Felt like they were all auditioning for a commercial or something. This could have been so much better had they used decent actors and a slightly bigger budget. Also did anyone notice that the movie was filmed inside a hotel?! Nothing about the movie felt genuine and I didn't expect much from the movie but didn't realize it would be this bad! Please save yourselves the time and watch a proper horror movie instead. 'The Boy' for example is a great doll horror with a great twist.",
         "It's inevitable that Robert will be compared to Chucky and Annabelle, which is probably the pitch this movie going for. Neither dolls are perfectly harrowing, but even then Robert has no right of being lined with them. The movie is strictly poorly written and acted. Characters do nothing but scream to each other, and even worse, the wife is so unsympathetically annoying she makes the movie unbearable. You know the story already, a creepy doll talking to the kid and ruining the family. However, the worse criminal is the wife with her ear-rupturing high pitch voice. One can argue that the boy is expressionless or the husband seems detached, they are nothing compared to the terrible delivery of the wife. She literally screeches and shouts the entire movie, it's a torture beyond what the family has to deal with on-screen. It's like hearing dying animal every five minutes. Plot doesn't go beyond the typical \"who did it\" theme and the paranoid wife. It move so horribly slow, when it hits one hour mark it only tells stuff other movies had done in half the span. The horror itself consists of poor editing worse than old stop footage movie. It feels amateurish at best and completely ruins the thrill, which barely exists in the first place. When an inanimate object with creepy face plastered on it has better screen presence than the character, you know you're in for a terrible ride.",
         "I'm no stranger to bad scripts and stupid characters in horror films, but this film had me thinking it was written on bring your kid to work day. The Wife is an emotional mess that will believe anything, the son shows hardly any emotion towards anything that happens, the husband is a stereotypical 'my wife is crazy but I'll play along' guy... the only character that's worth being in the film is Robert, and he's hardly in it! Every scene had me re-evaluating what I considered a bad movie, which is a shame considering the potential it had; great graphics, a brilliant killer doll story, set in England. But alas it just wasn't to be, with the women all shown to be weak, the men being imbeciles and the doll practically not even doing anything most of the time (the film focuses on the poorly written Wife). If you like bad movies get this one, but if you're looking for something decent to watch for whatever reason, steer clear of this film like it'll give you Bubonic Plague.",
         "Wooden acting, and I don't just mean the doll! This is 'Child's play' with less dark comedy moments. *incoming spoilers* This old bat gets sacked as a house keeper and as she leaves she gives the family boy the ugliest doll since Chucky's last dump. Odd things happen, paintings get ruined, foot prints (CLEARLY not belonging to the boy) appear about the place. Mummy blames the boy. A baby sitter gets killed. Mummy gets taken as a crack pot by daddy. Realise doll is possessed. Doll goes whacko-Jacko. No bugger thinks to burn the stupid thing from the start. Doll gets it's comeuppance. Evil spirit enters boy. NOW!!! Why the mother spotted the paint foot-prints and doesn't know her son well enough to realise they are flippin' square prints, ergo NOT her son's, is a mystery. Why she insists on yelling at her son about it rather than looking at the sodding doll two feet away (with red paint all over it's feet) is another odd ball moment. Why, when she decides it must be the doll, she locks it in a shed full of garden tools rather than incinerating the bloody minded mannequin is stupid move round 3. How this jerky badly animated lump of kindling manages to overcome anyone enough to kill them is laughable. Why, when it advances on mum at the top of the stairs with a baseball bat (and takes a week to reach her) she simply slides down the wall to a convenient head height for the doll, rather than launching a good hard boot into the thing and making with the big legs out of there... who the heck knows. All of the above with a couple of dozen other 'what the fekk are you doing'? moments make this movie a face-palm mess from the start. 3 out of 10 because the doll didn't fluff it's lines and they managed to find the budget to make it in colour. Utter twaddle, but if you want to scare your 4 year old daughter then this might (and I stress the word might) just about do it.",
         "Brought this film because I'm into haunted object stories and the story of Robert the doll is a good one. However this film is massively disappointing. Stilted, wooden acting and continuity mistakes mean that it's more of a comedy than a horror. The doll is more like a ventriloquist's doll than the actual doll which is scary as hell. The woman playing the mother isn't really believable as a person, the father is every man role cliché imaginable and the child is unconvincing and lacklustre. Overall they have taken a brilliant story and turned it into 90 minutes of boring, badly acted rubbish. Don't waste your time.",
         "Horror is a real overstatement here. Maybe some terror but than for little kids. Acting was just terrible. The doll looked like the son of Chucky but even less scary the whole movie thru. You don't see him move and his actions are lame. The movie fails in so many ways it's a worst than a B-flick and even a T.V. movie. Really nothing positive about this production. You are better of watching anything else. It's that bad of a...well. Something negative. Minus 10 if possible.",
         "This movie makes \"Chucky\" look like \"Lawrence of Arabia.\" Definitely choose something else. You could actually make a drinking game out of spotting plot holes and continuity problems. It feels like a feature length student project. Also, why does the boy's bedroom seem as though it is inside the hall closet? My 12 year old daughter tore this one to shreds, and although we will never get the 2 hours back after watching this bore-fest, it was fun picking it apart. She spotted a camera operator in one of the mirrors in one scene. We got a few good laughs out of it. Actually, the end of the second act is hilarious. On second thought, if you look at this as a comedy, it bumps it up t about a 6.5/7 point movie. So, it's all subjective. Enjoy!",
         "I brought this film yesterday as it was released in the UK to buy yesterday, wasn't expecting much but on the front cover says before Chucky and Annabelle there was Robert, and also states it was based on a true story, the film is about a couple with a boy, and the story starts out by the woman of the household fires an old lady who is the house keeper the old lady then gives a doll to the little boy on her departure, and things escalate from there, I was absolutely disgusted by this film the acting is wooden and disgraceful the only reason I gave this two stars was for the doll itself looked scary and promising, but for the film itself do not waste your money like I did, it was so boring I nearly fell asleep to compare this with classics like child's play is beyond belief, bare in mind child's play is from the 80s it will not be beaten, it just annoys me why film makers these days can't learn from the oldies and make a decent film, this film had so much promise but as usual we get left disappointed again.",
         "I've seen it all before with these types of films. Possessed doll. Grim backstory. Child victim. It's all the same though each is different & unique all the same (depending), but it's the story & action which makes for it. This film, like so many others with the possessed doll horror genre just didn't cut it even in the slightest. The film is about a struggling family who fire a house keeper whose health is deteriorating & effecting her job. She then leaves the family's son a doll called Robert, who (surprise surprise!) is an ugly evil looking son of a b!tch that Chucky & Annabelle gave birth too! The doll (just like any other horror film of this kind) goes about doing bad things/kills people & the parents either accuse their son who denies the events he isn't responsible for, or either are dumb/naive & have f**k knows idea what to do! The biggest problem with this film is that there was too much story line & not enough action sequences like killing or seeing the doll in action which we saw VERY little of! What was the secret? We knew the doll was possessed, alive & an evil killing machine! Honestly! I also felt that the slow pacing combined with substantial amount of story- line didn't help matters. I mean, some parts of the film were completely boring & depressing to watch! Not to mention some scenes were quite awkward too. The lack of blood/violence, the watery/unlikable characters & the sheer isolation made this film very boring too. The only bit of blood we got was the splatter of blood when the father gets bludgeoned with the wooden bat (which being honest was weak) & the end sequence which was 'so so' & didn't do much for me. Realistically, that's all you got & like I said, not seeing \"Robert\" in motion was very scarce & limited! I also felt the entire film focused way to much on the boring things like story-line/pacing! It seemed like the good bits of this were very little to limited & didn't even deliver in a way it should've done. The kills were pathetic & lame too! They could've made them way more bloody, gory & violent considering this doll was evil! The ending wasn't the greatest. The twist also wasn't satisfying even in the slightest! It was just a crappy way to end a film basically! Take it from me! I overall didn't like this film. It was slow, boring & lacked action/violence/gore to even out the story-line segments which I felt were focused on way too much! 2/10",
         "Beginning with an obvious rip-off from 'Annabelle', the story orbits the hard-to-like character: wife and mother Jen. Pathetically fragile, self-involved, demanding, and laden with First-World problems - a victim before the film even begins. The actress turns in a good performance but some poor choices were made with the portrayal. With it being so difficult to get on-side with her, any suspense is lost in favour of sadistic hope. The child actor is nearly as wooden as the doll. It's distracting, whenever he has a line we're reminded that \"this is a movie\". It fails as a horror with more unintended laughs than scares.",
         "Yes, it is sad, but true. Acting was awful, the doll was a better actor than the cast. There were too much moments of uncomfortably silence, when an actor ended a line, the camera still showing actor's expression for a couple of seconds, a waste of time. The idea was good, but the movie was sadly bad. The ending is not bad at all, but this is one of these movies that you must watch alone in your room because you don't want to bore your friends. The original history could be better exploited. Best wishes and, though it was bad for me, thank you for the movie, it is a work and there is time from everyone on it.",
         "Robert did it! Not since 'Childs Play' has a doll been this mischievous, this terrifying, and, Holy hell - this damn UGLY. Okay, so the film is anything but terrifying. It's pretty bad, actually. There's been so many bad haunted doll films throughout the years, including the more recent 'Annabelle,' we can only hope this won't become another trend in the horror genre. The story is simple, and completely ridiculous, since it's supposed to be based on actual events. It's basically a cheaply made 'Childs Play' crossed with 'Pinocchio's Revenge' mixed with a little 'Dolly Dearest.' You can clearly see the influence these films had on Andrew Jones. It's nice to be influenced by your favorite films, but to miss the mark this badly? You have to do better than that. As for 'Robert' - I'm not sure what the real doll looks like, but the 'Robert' in this film looks like a ventriloquist dummy with down syndrome. It's more hilarious than frightening. The film, the story, the doll - they're all ridiculous, and poorly done. This film makes ''Annabelle'' look like the best horror film in the last ten years - and I assure you that is not the case at all. Random Ramblings of a Madman: 'Chucky' from the original 'Childs Play' film was frightening - and that's not something you can easily accomplish when it comes to killer doll horror. Even more unlikely, you can turn a story like that into a good film - Tom Holland accomplished both, but it's time for the rest of you writer/directors to put the toys away, and move on to something more sinister. Because Tom Holland, you are not.",
         "I gave this movie one star just for trying their best and made a 90min clip. First lets just talk about the weird looking doll, a 6 year old kid can make a better stuffed doll than this one, it's lame and not scary at all, well maybe just the face. Anyway i waited very much to see it move or try something scary but it barely moved during the entire movie, it was just sitting on the chair most of the movie. And of course you can't but notice the amateur acting and the boring side story of the family and the unnecessary events. To sum it all they had a good story elements for a good horror movie (a scary isolated house, hunted doll, and the old house maid witch).",
         "Everyone knows (or should) that when you see a movie in this genre (think ALL the \"Chucky\" movies), you pretty much throw plausible to the wind. You can give certain allowances for certain happenings because, well, it's a movie. Such is NOT the case for \"Robert.\" The movie opens with some sort of back-history about this doll's actual existence. It is supposedly sitting somewhere in some sort of museum in England. Good; it can stay there. A family consisting of a neurotic wife, an oblivious husband, and a son who acts completely removed from his surroundings, have had the same nanny in their employ for a couple of years. However, her senses seem to be diminishing--she can't remember the simplest of things, does not remember where her cleaning utensils are, etc. The wife fires her. But she will not go quietly into the night. Instead she leaves the son one of the UGLIEST dolls ever created. She tells him that Robert will be his friend from now on (again, think Chucky's \"friend-till-the-end\" line). She also warns the young boy not to make Robert mad. Well, it seems Robert is quite the temperamental bastard because anything seems to set him off. Mayhem ensues. Yawn. This movie was one of the most unbelievable pieces of crap I have ever MADE myself sit through. While Robert is killing anyone that moves, the son just sits idly by and says nary word except for \"don't make Robert mad.\" The couple's babysitter has just been knifed to death, but hubby still wants to go out for din-din. One of the wife's paintings is smeared with red paint (which shows up on the feet of Robert), but nothing is ever thought of that. Later on, Robby has brand-new shoes. Simply captivating. All the wife does is whine, the son looks like he's ALWAYS just been hit in the head with a brick, and the husband just wants to work. Yessir, I was scared to death. All I would ask for is to have Robert spend a night at my house. I'm almost out of kindling. Rated \"R\" for \"really?\", this is one movie that should never have been made. The movie has minimal violence and is as boring as watching paint dry.",
         "*** This review may contain spoilers *** The beginning of the film the Lady and her husband hear voices and strange things in their house and they think that the house inhabited by evil spirits but the maid tells them that the evil spirit living inside the doll and not home then started the movie the movie is slow bad representation I did not feel the thrill there was little horror my review is 1 of 10",
         "OK , so we have a doll that's haunted , aka Annabelle . It's an English version , for Christ's sake the producers got a cameraman , a set , a script .... Er but who the hell did the casting ? Z list actors , so wooden they gave the lifeless wooden doll a run for its money. The cast are ultimately what make this film dire, it's so bad. Sure the films been done before , but had they got decent actors it could have been OK. The film is basically a doll comes into people's home and torments them , app Chucky was based on this doll. I'm giving this film a really low score because its unwatchable for me , and hey I can enjoy some rubbish but not stuff this badly acted. I've reviewed some great recent horror and click my name to see reviews to see some great films as I don't want you wasting your time on this , if you haven't seen Annabelle which is about a haunted doll then watch that as its fantastic film , will give you chills , this just makes you laugh at the bad acting then later just fast forward from sheer boredom.",
         "Like \"Annabelle\" Robert is based on a supposed true story that you can look up on Google. The two stories are almost identical. And both dolls are locked up in glass boxes in museums, both of them with \"Do not open under any circumstances\" signs on their glass cases This movie desperately wants to be along the lines of \"Annabelle\",or even \"Child's Play\". The fact of the matter is, the movie just isn't very good. Its a bargain bin budget, and it shows. Unlike most low budget horror flicks, this is very talky, and it has a very low body count. I think there's only three at the most. If you wanna watch a good \"killer doll\" horror movie, stick with the staples like \"Child's Play\", \"Dolls,\" \"Dolly Dearest\", or even The \"Puppet Master\" or \"Demonic Toys\" series. Skip this one unless you have nothing better to watch.",
         "I always wondered when someone would actually make a movie based on Robert The Doll. Finally someone did it and is it any good? No! The movie is terrible. The movie is supposed to be based on the real story of Robert but it's not. If you're not aware of the real story you'll fast want to find out, and oh boy you'll disappointed finding out that they screwed up the story so bad. What they did was basically grabbing a story and try to make something on their own using small nods from the real one. First of all, The Otto's weren't British and never did they have a maid. This is one of those movies you want to stay away from. You'll find the small documentary clips on Youtube scarier. I have no idea what the writer was thinking when he made this movie or wrote it. If i had a foot inside the film business i would give them my script i wrote about Robert 3 years ago. Keeping through to the origins.",
         "I thought I would give this film a chance. After watching 30 minutes I was wanting to turn it off it was so bad. It was slow and not a lot happening what killed it was the pathetic acting and terrible scripting. The entire story has been ripped from other movies. It appears that because this film is English that English people feel inclined to say this is a good movie which it is not. I wonder if any of the people that love this movie have ulterior motives so many new accounts. A creepy wooden doll with more of a wooden execution...",
         "I liked the creepy English manor house setting and I liked the atmospheric way they made the doll look especially in the night scenes. Other reviews said he doesn't do a lot but he doesn't have to its disturbing enough the boy's folks let that creepy thing hang out in his bedroom! I thought the whole thing had a cool old school atmosphere to it. I appreciated they didn't go too much for the cheap jump scares with this film and took a more psychological approach to the horror with tension in the family being made worse when the doll comes into their lives. Overall probably not a movie the youngsters will have much patience for with the methodical pacing but people who like old school atmosphere in a movie may enjoy it.",
         "Obviously an effort to make a British Chucky but a lot better than it had any right to be. I think this story did a better job than the original Chucky to make it questionable whether or not the doll is really alive or whether the whole thing is the mother's psychotic imagination. If you can get into that part of the film then it's an enjoyable enough psychological thriller. The lead character of the mother comes off as unhinged sometimes and if you think about it the whole film could easily have been her fantasy. But people are probably more interested in seeing the doll in action. A higher body count would have won it more fans.",
         "I wasn't expecting much after some people trashed it but was pleasantly surprised to see how good the film actually was. It takes place in one house most of the film which gives it a decent claustrophobia and tension. The story doesn't carry many surprises if you've seen these doll possessed films before but there is added tension with the father and mother characters, an argumentative pair who are like a bomb waiting to go off for half the film. The suspense is pretty well done, lots of bits that reminded me of the opening scene of Halloween (original not crappy remake) and the ending was a rip of Halloween 4. A few performances are a bit hammy, but for the most part the actors play it serious and do an okay job. Films like this are clearly done with not much money to cash in so when one turns out to be quite well crafted it's well worth giving it some due. It's not perfect, but then I didn't need it to be to enjoy it. The films has a lot of good things going for it.",
         "the movie was a fail from start to finish..low budget poor and short music score for background effect to create an atmosphere of ominous and foreboding scenes of laughable and comical to me..in how such poor effects and props used to make us fell the doll was plodding with bunny slippers ..ive watched sting ray and and captain scarlet move more smoothly in giving animated steps..this was supposed to be a horror movie and for me it was cracking me up in laughter constantly throughout..poor Robert the Doll stunt double creation..and i found it comical he had one terrible cataract in one eye.. i felt sorry for the doll, and laughed when he was on the move ..particular scene where hiding in the bushes having gotten out the shed then flying across the garden.past the bushes .. Maybe if this story was taken on by a respected and accomplished director in Hollywood it could be a rather thrilling and terrifying events for viewers ..I assume that the doll if now in Florida museum never got to be looked at by the famous couple who are known well to have rid houses of evil forces of demonic and malevolent spirits of violence..and the objects which they came from and trapped back into ..are kept in a secure room all in sealed glass cases... so as not be kept from ever bevomeing another fmailies horror story.. i tried to connect ...to the film ..but it never once produced a way to have a hold on my attention ..never mind..",
         "It was just awful, really bad acting , script and just seemed like it was written in 10 minutes , it seemed like a low budget film , no actors that we knew and its based on true events but doesn't seem like it is and that it is made up it was just a joke of a film , we turned it of after 20 minutes as it was so slow to get into it"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["North Bank Entertainment"],
      "summaries": [
         "After Paul and Jenny part ways with their sinister housekeeper Agatha, the disgruntled former employee gives a vintage doll called Robert to their son Gene. Soon after Agatha's departure, strange events begin plaguing the household. Furniture is vandalized, objects are thrown around and maniacal giggles echo through the house in the middle of the night. But nobody believes Gene when he claims Robert is to blame for the disturbances. Paul and Jenny consider the possibility that a supernatural force has taken over their home. But as the occurrences escalate they discover that it's not the house that's haunted... it's the doll.",
         "In this chilling story based on real life events a family experience terrifying supernatural occurrences when their son acquires a vintage doll called Robert."
      ],
      "budget": 0
   },
   "movielensId": 142236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-08-24",
      "dvdReleaseDate": null,
      "directors": ["Andrew Jones"],
      "runtime": 90,
      "movieId": 142236,
      "title": "Robert the Doll",
      "mpaa": null,
      "actors": [
         "Lee Bane",
         "Megan Lockhurst",
         "Flynn Allen",
         "Suzie Frances Garton",
         "Judith Haley",
         "Cyd Casados",
         "Ryan Michaels",
         "Samuel Hutchison",
         "Tiffany Ceri"
      ],
      "imdbMovieId": "4141368",
      "originalTitle": "Robert the Doll",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["ja5Y5e_w00o"],
      "plotSummary": "In this chilling story based on real life events a family experience terrifying supernatural occurrences when their son acquires a vintage doll called Robert.",
      "tmdbMovieId": 356149,
      "avgRating": 2.4375,
      "releaseYear": "2015",
      "numRatings": 8,
      "posterPath": "/me4Cyy5F7SjQ3fmxL4Mo63UIg2A.jpg"
   }
}