{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "demonic possession",
            "id": 161261
         }
      ],
      "imdb_id": "tt0103802",
      "video": false,
      "title": "Beyond Darkness",
      "recommendations": [5752],
      "backdrop_path": "/nH7yNRo6aGaGu8Ss9BkYeLQBj29.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Father Peter",
               "gender": 0,
               "credit_id": "52fe461bc3a368484e07f093",
               "name": "Gene LeBrock",
               "profile_path": null,
               "id": 115515,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Father George",
               "gender": 2,
               "credit_id": "52fe461bc3a368484e07f08b",
               "name": "David Brandon",
               "profile_path": "/1IWSdp0umsgNq5odGRQp3Q4PR7B.jpg",
               "id": 99539,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Annie",
               "gender": 1,
               "credit_id": "52fe461bc3a368484e07f08f",
               "name": "Barbara Bingham",
               "profile_path": "/fZqsPosl3efS61l1agvB39zGsmM.jpg",
               "id": 64734,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Martin",
               "gender": 0,
               "credit_id": "52fe461bc3a368484e07f097",
               "name": "Michael Stephenson",
               "profile_path": "/jzbCTg0p5qawTY2ABDYYjzVEZYP.jpg",
               "id": 124713,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Reverend Jonathan",
               "gender": 0,
               "credit_id": "59daee22c3a36861ec05128b",
               "name": "Stephen Brown",
               "profile_path": null,
               "id": 115520,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Bette",
               "gender": 0,
               "credit_id": "59daee2992514124eb050a5e",
               "name": "Mary Coulson",
               "profile_path": null,
               "id": 102024,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461bc3a368484e07f087",
               "name": "Claudio Fragasso",
               "profile_path": "/rnppeu2Jv0xf70MH0keN3dKg4hW.jpg",
               "id": 45577,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55f40cdc9251414a56002acb",
               "name": "Claudio Fragasso",
               "profile_path": "/rnppeu2Jv0xf70MH0keN3dKg4hW.jpg",
               "id": 45577,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "55f40ce8c3a3686d1800290d",
               "name": "Rossella Drudi",
               "profile_path": null,
               "id": 47116,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59daed9cc3a368623e0502c4",
               "name": "Achille Manzotti",
               "profile_path": null,
               "id": 104043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59daedaa925141251405360f",
               "name": "Carlo Maria Cordio",
               "profile_path": null,
               "id": 42054,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "59daedb392514124cd052555",
               "name": "Laura Gemser",
               "profile_path": "/3jCfL6TGsLkmjKYkNoxDiDW4BUf.jpg",
               "id": 41127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59daedcbc3a3686200053218",
               "name": "Kathleen Stratton",
               "profile_path": null,
               "id": 31778,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.070833,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 60190,
      "vote_count": 6,
      "budget": 0,
      "overview": "A priest &amp; his family move into a new house, without knowing that it was built over the place where twenty witches were burnt at the stake. Soon the terror begins, with the house terrorizing its inhabitants with the elements that lie within the construction, like a possessed radio and a flying cleaver.",
      "similar": [
         394830,
         289416,
         280016,
         9552,
         241258,
         48171,
         80280,
         185341,
         11026,
         11586,
         76487,
         112170,
         157544,
         23827,
         8329,
         1250,
         138843,
         561,
         764,
         805
      ],
      "original_title": "La casa 5",
      "runtime": 95,
      "poster_path": "/esSVCEUDmyzsSB7BBmvrz56N68c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Production Group S.r.l.",
            "id": 95970,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmirage",
            "id": 6082,
            "origin_country": ""
         }
      ],
      "release_date": "1990-01-01",
      "vote_average": 4.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Unoffical Ghosthouse Series",
         "id": 123289,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claudio Fragasso"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Claudio Fragasso",
         "Rossella Drudi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103802/",
      "coverLink": null,
      "actors": [
         "Gene LeBrock",
         "David Brandon",
         "Barbara Bingham"
      ],
      "reviews": [
         "Explanation for this title. Evil Dead was La Casa in Italy. Then, Evil Dead II was La Casa 2. But, Ghosthouse, from Umberto Lenzi, was La Casa 3. Witchery, from Fabrizio Laurenti was La Casa 4. And this, the fifth.",
         "From the director of \"Troll 2\" comes this moderately amusing haunted house / exorcism movie. Gene Lebrock (\"Metamorphosis\") stars as Father Peter, a reverend who moves with his family into a house of horrors. Not surprisingly, terrible things happened on the same grounds many years ago, and Father Peter must team up with the intense Father George (David Brandon) to take on the forces of evil and save his son Martin (who's played by Michael Stephenson, a.k.a. the young hero of \"Troll 2\"). Flagrantly bad acting combines with director Claudio Fragassos' extravagant efforts to show the audience a good time. Fragasso gives this silly movie as much atmosphere as he possibly can, but the screenplay, which he wrote with Rossella Drudi, is pretty inane. The music score by Carlo Maria Cordio is over the top, which seems like an attempt to distract the audience from the fact that we're not seeing anything particularly interesting or unusual in this movie. The visual effects are variable, the makeup effects not that bad at all. The hunky Lebrock is very much a stiff, but \"Friday the 13th\" series fans might enjoy seeing actress Barbara Bingham (Mrs. Van Deusen in \"Jason Takes Manhattan\") in the role of his wife. Brandon does an awful lot of gnawing on the scenery. One person who likes like they're having fun is Mary Coulson, who plays the gnarly old crone Bette. One of the producers was an uncredited Joe D'Amato; the costume designer was Laura Gemser. Five out of 10.",
         "House five, is not the continuation of the other houses. House five, extension for the first time a true fact of property, recognized from the sacred Roman church. The history is draft from the book \" the 100 cases of demonic property recognized from the Holy Roman Church of father \"Malachia\" For the first time in a property film, the splitting of the two children is looked at entirety, l' real spirit and that possessed. An exchange of the two children happens, with the parents and its family goes that mistaking. The child will be saved with exorcism, from a priest who had lost the faith, tormented and scared, from the demon and now, alcoholic victim . This priest will return to the faith, during l' exorcism. It had lost the faith in order to have confessed a modern witch, condemned to the capital punishment on the chair electrical worker, in reality the woman was possessed from a demon between most frightful: Ameth, that it eats the spirits of the children in order to become stronger. (it is in the Bible) to the history appeals to me so much, for the depth. The film is to low cost, but the special effects beautiful because are made as years were made ago, when the computer did not exist. The film is of 1990 and task that would have to be praised who little succeeds with money to make a film that however it scares, thanks to the many ideas of the script and to a good direction. Task is easy to make good films when many money is had. The scene that it has hit to me more, is that of little the child, that it dreams to wake up sluice in a coffin, where, the family sees dead to it, but it is alive, she screams, and she screams, but she feels it to nobody, then encircle it to the witches, making them a magical deceit, in order to steal them spirit. The witches are devout people to Ameth. Much fear and much Gore. The Louisiana still renders more l' atmosphere. To see and to appreciate also for the suspense in the long, from the taste of the past, without those movements of movie-cam, too much fast times and you deprive of sense, within the history and in the turned scene, only used for giving rhythm, to case. The atmospheres thriller the fear, manifest in the waits. For this ballot 10/10. To revalue",
         "Beyond Darkness is a b horror picture about a haunted house. It's Poltergeist meets The Exorcist. A reverend and his unsuspecting family move into a house with mysterious supernatural symptoms. Even more mysterious was why a married Protestant minister was a part of the Catholic Church, but these are details, just a minor technicality! The creepy ambient music was doled out with a heavy hand and it worked. The special effects were on point, and the tone was camp-free. The acting was what you would want to see in this type of story. The hag and the Catholic exorcist killed it. The minister and his wife, not so much. The writing didn't make a whole lot of sense. It could have used more development, such as the backstory about the property being built on the sight of a mass witch lynching. The opening scene more than made up for the gaps in the narrative logic. Beyond Darkness is nobody's classic, but it delivers.",
         "\"La Casa 5\"/\"Beyond Darkness\" is another lamentable horror film from Claudio Fragasso,the man behind incredibly awful \"Troll 2\"(1990).The plot is simple:a priest(Gene Le Brock)and his family move into new house.Unfortunately the house was built over the place where twenty witches were burnt at the stake.Soon the terror begins...\"La Casa 5\" is a typical Italian possessed house horror which owes a lot to \"The Amityville Horror\"(1979).The script is mediocre,the acting is horrible and there is absolutely no gore.The special effects are also pretty bad including a possessed radio and flying cleaver.The film is not as painful as \"Troll 2\",but it's close.Skip it.My rating:4 out of 10.",
         "Without a doubt, this low-budget haunted house thriller pales in comparison to genre classics such as Poltergeist due to horrendous acting and a pervading student film feel. However, if you enjoyed the Amityville Horror movie and book (especially the book) you might want to give Beyond Darkness a try. Many of the most terrifying aspects of the Amityville book are an integral part of this movie including hooded entities lunging at the cast out of nowhere, doorways to hell, and some unforgettable scenes of inanimate objects like an antique radio becoming possessed by the dark forces in the house. Yes it's true that the portrayal of the family is perhaps too clean cut (I know for a fact that pastors' kids can sometimes be brattier than other people's!) and that the actress playing the executed serial killer is more than a little wan. However, if you don't expect Oscar winning performances in horror films, then you will find Beyond Darkness a creepy treat to watch alone on a stormy night. And before inserting the tape, you might want to turn off the radio first.",
         "This movie is a little bit stupid. But that is one of its best qualities. Acting ain't great. Special effects even worse (OK, they're better than SOME of the actors). I couldn't get over David Brandon (Caligula in http://www.imdb.com/title/tt0082133/?ref_=nm_flmg_dr_152) playing a priest. He may be a drunk, but still a man of the cloth. I still can't make it through Caligula 2: The Untold Story in one sitting. It is not only kind of mean-spirited, but actually gross. I got this on X-Rated (German video label, not MPAA) DVD in a fat box (große hartbox) and the box/case is actually a whole lot better than the film. Way better, as a matter of fact. It's called \"Ghost House 6\" on the box. Pretty sure it's called \"Beyond Darkness\" in the credits.",
         "Who better to take on the La Casa franchise - films that are not sequels and are not connected to one another - than the man who made Troll 2, a movie that is not a sequel and is also not about trolls? Yep. Claudio Fragasso (Monster Dog, Rats: Night of Terror) is in control of your movie watching experience and he's brought Troll 2 child actor Michael Stephenson along for another ride through the bottom of the movie making barrel. A priest and his family - right off the bat, you could see that this script has holes you can drive the Landmaster from Damnation Alley through because Catholic priests can't marry - move into a new house. Bad news for them, good news for us - it was built over the graves of twenty dead witches. Their son gets possessed, along with a radio and a meat cleaver. Oh yeah - there's also the ghost of a female serial killer who wants to eat the souls of children. And in another of those \"they should have known better\" moments, this is all filmed in the same building as Fulci's The Beyond! If you're looking for the madcap moments that Troll 2 has, you won't find them here. This is a more linear and controlled film, except for the crazed performance by David Brandon as Father George, an alcoholic priest whose contact with a demon has made him question his faith. You'll marvel as he wanders down real city streets with real people - not extras - ranting like a maniac! But what do you expect? He watched a serial killer orgasm in the electric chair surrounded by the trapped spirits of her victims!",
         "For the three hundredth Italian haunted house horror I've watched in a row, Claudio Fragrasso, director of Troll 2 and part time amok killer robot, brings us an Italian haunted house horror with a bit of the Exorcist thrown in, plus a bit of Poltergiest for good measure. Priest George (David Brandon from Stagefright) loses his faith after attending the execution of a devil worshipping child killer, so you've got your Father Damien there. Later, a family move into what I think was Priest George's house, the father of which is also a priest. This priest is played by the guy out of Metamorphisis and his kid is the kid out of Troll 2! Nice one. Things start going wrong right away, what with toys moving on their own and a door to nowhere attracting the kid's attention, and before you know it, one of the kids has been pulled into another dimension by some vengeful witches and that chick who got the chair at the beginning of the film. What bogged this film down for me and made my mind wander awfully was the amount of screen time devoted to all the priests talking about losing their faith and keeping their faith and so on. It kind of goes on endlessly as they all argue with each other. There's also an awful lot of wandering around the house and a certain scene where a wall melts almost had me nodding off. When the film did decide to do the haunted house bit things were fine, as was some of the make up jobs on the witches and those that get possessed. Some of the acting by the kids was worth a laugh too, but this film is more fog machine heavy than anything Fulci made. You can give this one a miss if you want. Is it just me or was there exactly one synth in Italy for composers to score soundtracks with? Every single soundtrack on these films sounds the same. Next: Cat in the Brain!",
         "This review contains some minor SPOILERS, so do not read it if you do not wish to have some points revealed to you. If you came across this title on this site and were like me, you were probably left scratching your head as to how `Beyond Darkness' could be subtitles `House 5.' This movie was made in 1990 and `House IV' was made in 1992. Well, it seems like someone just slapped the `House' label on to try and hide the fact that nothing else about it is interesting. This is nothing like the other `House' movies (though none of them are alike in any way either) and should not be thought of as part of the series. Instead, think of it as just another boring horror movie that you need to avoid. It was, after all, made by the same writer/director that brought us the universally panned `Troll 2.' To be fair, I believe that this movie has positive intentions. But good intentions do not necessarily make a good movie. The movie begins with a priest hoping to hear a woman about to be executed give her soul to God. This woman, who murdered a bunch of children in a house, is either possessed or is simply crazy. It is hard to make that out. She tries to tempt the priest by telling him to repent his religion to learn more about her evil Satanic ideas. He almost does it, and is thus haunted throughout the rest of the film by this guilt. When the woman is put in the electric chair, the priest sets out for the house in question faster than you can say \"The Horror Show.\" Apparently, the house is on the site of some ancient place where witches were once burned at the stake. While he is on his way there, a second priest is moving into the house with his family, and he was given the house by the local head priest, who knows of the evil and deliberately sends the priest and his family there to stop the evil. Huh? Well, they move in and are visited by evil spirits faster than you can say \"Amityville Horror.\" After the first few spooky happenings, one of which would really freak you out if it happened to you (but doesn't freak you out here), you would think the family would take the hint and get out of there faster than you can say \"Poltergeist.\" But no. Then your conflict, when the ghost of the executed woman and her laughable spirit helpers kidnap the priest's son, would not exist. When the first priest arrives, the two holy men join forces and set about to rid the house of evil faster than you can say \"The Exorcist.\" Yada yada yada. There's plenty more other than a standard plot that makes `Beyond Darkness' a lousy movie. First, the special effects are bad. I tend not to stress this sort of thing, but when a script calls for something that a budget just can't handle, it's time to either change the script or not do the movie at all. Most of the effects here are done in smoke-filled rooms to mask their low quality. This, however, just gets really bothersome. And boring. Another annoyance is the abundance of stereotypes. The entire family is so pious that you see right through their one-dimensional characters. And their acting of these stereotypes is really bad. Rarely do filmmakers find good child actors, and here they scraped the bottom of the desperation barrel. The boy playing the son is so horrid that you really hope the witch goes through with the sacrifice. But the worst thing about the film is how slow it all moves. Not once does the pace ever pick up, especially when the priests are battling the evil. I kid you not, I watched the scenes where the priests are walking through the house in fast forward and they were still moving like snails. Thus the only things that this movie has to offer are good intentions. I can get those from watching `House II,' which, unlike this movie, is fun to watch and in no need of renovation. Zantara's score: 2 out of 10.",
         "There's a reason why this claims to be a part of a series it's not: no one would watch it otherwise! A collared priest enters a prison to give last rites to a middle aged female serial killer. Somehow she's stolen a number of stout children's souls, and the priest can see them. He's somehow affected by her evil holy book, which has a picture of Satan and a house in it that look much more recent than all the other pages. He turns into an alcoholic who staggers around town. Apparently he is possessed and also having a crisis of faith. Anyway, another collared priest moves into the house from the book because an older priest gave it to him for him and his family of four. There's a strange giant black swan rocker in the children's room they assume was a gift for the kids. One of the doors has a poorly- bricked and stuccoed wall behind it with a slit that glows. Obviously supernatural bad stuff starts happening soon, but the family for some reason stays. Turns out the older priest knew that the entire family would be in danger, but he thought it would be a good idea anyway for some reason. The movie is filled with terrible editing, terrible dialogue, and terrible plotting. The special effects aren't so good, mainly the house being full of smoke and red light as the cast has sweaty faces. There's a bunch of somewhat spooky zombie witches. A mixture of witches and innocent women had been burned at the stake on the site years ago. What the connection is to the serial killer is anyone's guess. It's a poor mix of The Amityville Horror (haunted house), The Exorcist (exorcists, possession and crisis of faith), and Poltergeist (child taken into other world, stuff flying around). Don't bother! Who would actually believe this as a sequel to Evil Dead?",
         "Well, I'm not going to talk much about that movie, cause I agree in most point with the comment by Zantara, but I just had another thing concerning the Title. &The original title \"La Casa 5\" an the american subtitle just can't beat the german title \"Horror House 2\". I never saw a movie called \"Horror House\" in any video-tape library or on TV an no german homepage knows the first part. So if you think calling it House 5 is ridiculous, nope, german video producers beat that by far.",
         "This is the last in the Casa franchise and it surely shows why. this is really a turkey but somehow you keep watching to see what happens next. It's even so worse that the last shot just before the end credits aren't correct, you know what should happen but don't worry, if you wait until the end credits are over your wish will come true. The acting is so over the top, really wooden and normally flicks with haunted children should be scary but here it's just laughable. Nevertheless, all imaginable effects are used. Mostly the very cheap ones, scary, sigh, lights and smoke, an annoying score, bad make-up. Really, a must see to believe but that's the problem, it hasn't had a proper release and is only available on VHS. It was made in 1990 so for the effects available then this is really a turkey. And each time you think, ahaa the end is coming something new happens. And still I'm glad that I have seen it..."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Filmirage",
         "Production Group S.r.l."
      ],
      "summaries": ["A minister and his wife move into a haunted house."],
      "budget": 0
   },
   "movielensId": 142230,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-01-01",
      "dvdReleaseDate": null,
      "directors": ["Claudio Fragasso"],
      "runtime": 95,
      "movieId": 142230,
      "title": "Beyond Darkness",
      "mpaa": null,
      "actors": [
         "Gene LeBrock",
         "David Brandon",
         "Barbara Bingham",
         "Michael Stephenson",
         "Stephen Brown",
         "Mary Coulson"
      ],
      "imdbMovieId": "0103802",
      "originalTitle": "La casa 5",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A priest &amp; his family move into a new house, without knowing that it was built over the place where twenty witches were burnt at the stake. Soon the terror begins, with the house terrorizing its inhabitants with the elements that lie within the construction, like a possessed radio and a flying cleaver.",
      "tmdbMovieId": 60190,
      "avgRating": 1.5,
      "releaseYear": "1990",
      "numRatings": 1,
      "posterPath": "/esSVCEUDmyzsSB7BBmvrz56N68c.jpg"
   }
}