{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0096785",
      "video": false,
      "title": "Alien from the Deep",
      "recommendations": [],
      "backdrop_path": "/ZidbZnCOL9IAaGxGRjM9Nsp1eb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Bob",
               "gender": 0,
               "credit_id": "52fe456dc3a368484e05a231",
               "name": "Daniel Bosch",
               "profile_path": "/q5OF8ZJ2KIpJGqWIgtXET1vOXcH.jpg",
               "id": 556088,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jane",
               "gender": 0,
               "credit_id": "52fe456dc3a368484e05a235",
               "name": "Marina Giulia Cavalli",
               "profile_path": "/p8sRnkUGXlAYW6HGKRLHzkMot1F.jpg",
               "id": 42192,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lee",
               "gender": 2,
               "credit_id": "52fe456dc3a368484e05a239",
               "name": "Robert Marius",
               "profile_path": "/4xgOwzINsOodfY7s4KMvKIHEh4O.jpg",
               "id": 556089,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Geoffrey",
               "gender": 2,
               "credit_id": "52fe456dc3a368484e05a23d",
               "name": "Luciano Pigozzi",
               "profile_path": "/iSitmgdtPylwSkX9efVaTJLVfSa.jpg",
               "id": 30900,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Colonel Kovacks",
               "gender": 2,
               "credit_id": "52fe456dc3a368484e05a241",
               "name": "Charles Napier",
               "profile_path": "/90flwc0xLUDvS4pSUimZzyme2PD.jpg",
               "id": 16119,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Guard (uncredited)",
               "gender": 0,
               "credit_id": "54da4b5cc3a3685266000005",
               "name": "Roberto Dell'Acqua",
               "profile_path": null,
               "id": 100414,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Head Technician (uncredited)",
               "gender": 0,
               "credit_id": "5a31cf74925141547200adf5",
               "name": "David Brass",
               "profile_path": "/6GOsHTjuB6E87yfor67rGBqqP16.jpg",
               "id": 1299604,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Chopper Pilot (uncredited)",
               "gender": 0,
               "credit_id": "5a31cf9fc3a3680b9d180892",
               "name": "Kenneth Peerless",
               "profile_path": "/u0LAUN25SYIlw9cxhsTnpmzcneG.jpg",
               "id": 1275241,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Security Officer (uncredited)",
               "gender": 0,
               "credit_id": "5a31cfe20e0a264cc118e8d2",
               "name": "Michael Welborn",
               "profile_path": null,
               "id": 1299611,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Security Officer Carlos (uncredited)",
               "gender": 0,
               "credit_id": "5a31d007925141032c196288",
               "name": "Albert Bronski",
               "profile_path": null,
               "id": 1499819,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Technician (uncredited)",
               "gender": 0,
               "credit_id": "5a31d02cc3a3680b9d18093e",
               "name": "Donald Wilson",
               "profile_path": null,
               "id": 1483176,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Guard (uncredited)",
               "gender": 0,
               "credit_id": "5a3408e80e0a264cc11aed44",
               "name": "Frank Wannack",
               "profile_path": null,
               "id": 1871933,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Boat Crew (uncredited)",
               "gender": 0,
               "credit_id": "5a34090a0e0a264cbe1af31f",
               "name": "Curtis Carter",
               "profile_path": null,
               "id": 1483160,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Security Officer Griffith",
               "gender": 0,
               "credit_id": "5a34091f92514103241b0dd9",
               "name": "Jeff Griffith",
               "profile_path": "/6o7nhiAOyQFKSK3FWPbghXC73wQ.jpg",
               "id": 1483153,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Security Guard killed by Snake (uncredited)",
               "gender": 0,
               "credit_id": "5a43d8ff9251411fd2068deb",
               "name": "Philip Gordon",
               "profile_path": "/uZ6HAIvyO3Q4Kht9chFXAqjAMc0.jpg",
               "id": 1949010,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe456dc3a368484e05a227",
               "name": "Antonio Margheriti",
               "profile_path": "/mQE61ZpPTZqQFJ4wHy1WA0Iz8Te.jpg",
               "id": 5561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe456dc3a368484e05a22d",
               "name": "Tito Carpi",
               "profile_path": null,
               "id": 92928,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a32b2d30e0a264cc41981eb",
               "name": "Andrea Ridolfi",
               "profile_path": null,
               "id": 1321904,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a32b2e0925141547e01946a",
               "name": "Antonio Magheriti",
               "profile_path": null,
               "id": 1941245,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "5a32b2f9c3a3680b881a598f",
               "name": "Franco Gaudenzi",
               "profile_path": null,
               "id": 47117,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a32b30792514103361a42b9",
               "name": "Fausto Zuccoli",
               "profile_path": null,
               "id": 53190,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a32b315c3a3680b881a59a0",
               "name": "Mario Sbrenna",
               "profile_path": null,
               "id": 1120511,
               "department": "Camera",
               "job": "Camera Operator"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.982856,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 27909,
      "vote_count": 5,
      "budget": 0,
      "overview": "Somewhere deep in the jungle a chemical corporation dumps tons of toxic waste in a still active volcano. Two environmentalists try to expose these illegal ways of getting rid of hugely dangerous waste, but they get caught by the vigilantes working for the company. One of them, the super-hot Maria Giulia Cavalli, manages to escape and she is saved by a snake farmer who lives alone in the jungle. Together they try to bring down the company, but it’s too late. Years of chemical poisoning have spawned a deadly monster that is set out to exact revenge on humans that have unknowingly brought him to life. Directed by legendary Antonio Margheriti, the unholy master of Italian B movies, Alien from the Deep is one of the most beloved Italian rip-offs. A wildly entertaining ride, the movie is an inventive crossover where lots of different genres and styles are mixed.",
      "similar": [],
      "original_title": "Alien degli abissi",
      "runtime": 90,
      "poster_path": "/7SAoZbsxmdlYvNu2D3PnbCSG7GR.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "National Cinematografica",
            "id": 2185,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dania Film",
            "id": 1701,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gico Cinematografica S.r.L.",
            "id": 4787,
            "origin_country": ""
         }
      ],
      "release_date": "1989-10-15",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "Loads of gore and action, plenty of bloody shoot-outs, a hugely entertaining monster (the infamous “Big Claw”).",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Antonio Margheriti"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Tito Carpi"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0096785/",
      "coverLink": null,
      "actors": [
         "Daniel Bosch",
         "Marina Giulia Cavalli",
         "Luciano Pigozzi"
      ],
      "reviews": [
         "Antonio Margheriti's filmography is interesting and varied. It featured such well made Italian films as Danse Macabre and Schoolgirl Killer; as well as some trash, such as The Last Hunter, Death Rage and Cannibal Apocalypse. One thing you have to credit the director with, however, is that even when he's making trash; he usually makes it well, and while Alien from the Deep is not exactly a high quality piece of film-making; I do firmly believe that it would have been a lot worse in the hands of a lesser director. The title features the word 'alien' and the film was released not long after James Cameron's Aliens was a big hit; so seeing as this is an Italian film, it should be pretty clear that it's a rip off of the Alien films. Unlike the Alien films (but a bit like the first Predator film), this one takes place out in the jungle. We focus on a big (evil) corporation with an irresponsible approach to waste management; they're pouring it all down a volcano (oh yes), and naturally this leads to trouble in the form of a giant monster. The film puts it's focus on a couple of people aiming to expose the big corporation's social ills, and this gives it a bit of plot to work with outside of the main monster theme. It has to be said that it can be a little dull at times; but things never ground to a complete halt and Margheriti keeps our interest well enough until the monster appears on screen. Naturally, the monster is saved for as long as possible; but all the scenes featuring it are generally well orchestrated and amusing. Only parts of the monster are shown at first; and it seems to be a sort of scorpion-like contraption...but this leads to disappointment when it's actually revealed towards the end, as it turns out to look more than just a little bit silly (HR Giger has nothing to worry about). The cast is nothing to write home about really; but we do get a pleasant surprise in the form of Charles Napier, who is perfectly cast as the main bad guy. Aside from the monster there's a few interesting ideas, and the monster itself is fun in the way it attacks from underwater and underground. The film is most definitely trash and there's no denying it; but it's also a lot of fun and I can recommend it.",
         "Not exactly Margheriti's shining moment on screen, but it's still loads better than a lot of his other mid-to-late 80's work like CODE NAME: WILDGEESE or INDIO thanks to some energetic editing and rich special effects. Not to say the the effects budget was all that high, it was awfully low with plenty of painfully obvious miniatures blowing up in slow motion to make them look big. The goofiest effect has to be the full-sized robotic alien at the ending, which has lots of cool tubing and steam vents all over it but looked as though the crew had little or no control over it. When the alien first pops out of the woodwork it's legs dangle limply as though a crane is hoisting it up (and that's exactly what the crew probably used too). To my knowledge, this is the only time Margheriti worked for Franco Gaudenzi, who usually worked fairly exclusively with Bruno Mattei. In comparison with most of Mattei similar work from the same period, this film seems almost classic. There's a fair amount of cheesy gore and horrendous acting. Co-star Robert Marius from AMERICAN COMMANDOS and COP GAME has to be the worst actor in the history of cinema. Aside from a pretty passive cameo by Charles Napier and Luciano Pigozzi wobbling around in his last role, the acting was all pretty uniformally hopeless. However, I don't see how this film earns the status as \"Margheriti's worst film\" even though it does flagrantly lift musical cues right out of Larry Cohen's Q - THE WINGED SERPENT. The film is exciting and action-packed enough so that it's never boring, and the finale isn't too big an ALIENS rip, with them using bulldozers instead of robotic lifters of course. Low budget in the extreme, but with enough amusing dialog and funny special effects to earn it a certain place in history. Not nearly as bad as Gaudenzi's other ALIENS ripoff produced the same year, SHOCKING DARK aka TERMINATOR II, which has to be an all new low.",
         "Antonio Margheriti's Alien from the Deep is a gonzo Aliens rip-off, to be sure, and one not to be missed by fans of Margheriti's work as well as Italian exploitation cinema! Any film featuring Charles Napier as the tough-talking, no-nonsense, get-it-done military type is worth checking out but only Aliens from the Deep features Luciano Pigozzi doing his best impression of Lucio Fulci and an alien so outrageous, so comedic, that you will never look at crustaceous meals the same way again. There's no denying that Alien from the Deep is an uneven film, it starts out as an action adventure film with cheesy B-movie potential and then steadily declines into an unintentionally hilarious sci-fi horror film featuring a massive crab's claw swinging back and forth. As I mentioned above, cult actors like Charles Napier, Luciano Pigozzi and Robert Marius star in this delightful stinker so expect good to adequate acting. Hit or miss acting aside, there's no denying the quality of the production values in this film, I was greatly impressed with the colors, sets and costumes, despite the low budget. It boggles the mind how far some of these Italian filmmakers were able to go in order to stretch their dollars to get a certain \"look\" and \"feel,\" even if the film itself was a bomb. Aliens from the Deep is one of those films that you shouldn't over-think, it is what it is and you just have to kick back and enjoy the ride. For me two things really stood out in this production and that was the forehead-slappingly bad creature and the painful dialog. The minute you see the alien tooling about like a remote control car, wildly swinging its claw and, eventually, standing up to reveal its Rickets-riddled legs, you'll fall in love with this film. Before you get to the \"good stuff\" though you'll be forced to suffer through the dialog which mainly consists of the actors each getting a turn saying, \"Balls!\" Carpi must have had a rough time writing this gem! From beginning to end, I enjoyed this film. No need to polish a turd, my review is pretty clear. You're either going to be entertained or you won't be. I recommend giving it a rental.",
         "...If compared to \"Miami Golem\",\"Alien 2 on Earth\" and many other fanta-horror flicks from US and Europe.Dawson mixed with a certain success the war cliché with the alien cliché. More and more he threw in some environmentalist morals, as he did in Indio I and II.And all three aren't bad at all.Great shoot-outs,despite they are often useless as \"Predator\" 's ones.The Alien is not built by the SFX sensation Edoardo Margheriti-Dan Edwards, it we can note it immediately.The creature moves with some sort of stop-motion, so it's a bit strange that he could kill so easily its enemies. The monster, that many lovers of this film have rechristened \"Big Claw\" -because the remaining claw is its most seen part on this flick-, is the less valuable feature of the movie.Its end in the volcano was a worthy end. Luckily the effects of its venom are ravaging! The explosion are a must.The actors acted decently, especially Pigozzi and Napier. Marina Giulia Cavalli (Actual Italian TV movie and sit-com main actress) offered also a good acting with her great body.I still love you Mari Julia...Oh God what I would have given to see you wrapped into a topless amazon robe or a military outfit. It's entertaining and violent, very violent.It was partially filmed in Latina, inside Recordati industry.But the biggest part of the scenes were naturally filmed in the Philippines that the late,great Anthony Dawson loved so much. See this movie,and taste it. It's so funny! 8 out of 10",
         "\"Alien from the Deep\" is dull and dragging a horror/Sci-Fi from the usually great and reliable Antonio Margheriti, who admittedly already had to be retired around the time of release. Two young environmentalists venture to an island resort to battle against a chemical plant company that dumps its barrels of radioactive waste straight into an active volcano. You've got to admit that's a pretty clever type of shenanigans if you're a ruthless and power-greedy businessman! The two get caught, however, but the girl escapes into the island jungle and finds rescue in the arms of a lone snake farmer (what an awesome profession that must be) and together they attempt to stop the illegal dumping. But it's too late, unfortunately, as the years worth of industrial dumping spawned a hideous monster. You'll have to be very patient and tolerant if you want to see a monster or alien or menace of any kind. We're far beyond the 50 minutes mark until there's a bit of gore and at that same moment the director thankfully reminds us that this movie is actually supposed to revolve on a monster of any kind with the discovery of a giant claw. Luckily from then and onwards, the pacing remains steadily fast, the atmosphere becomes grimmer, the make- up effects are satisfying and even Charles Napier's supportive characters – which until then was a dull persona – becomes sleazier. Still, \"Alien from the Deep\" takes itself far too serious, what with all its environmentalist lessons, and even has a certain aura of pretension hanging around it. There are some nifty miniature settings to recreate the destructive sequences that cost too much to film with real equipment and the monster – when you eventually get to see it in all its glory near the very end – is quite a massive and reasonably admirable construction.",
         "Great entertainment here, folks. I had the pleasure to watch the UNCUT Japanese print of this cool Italian \"Alien\" rip-off. The action sequences are violent and full of automatic weapons. The soldiers are evil in their conquest to stop a man and woman from spilling the secret of nuclear dumping in a volcano. It seems before they can get away, the radiation attracts an evil alien intent on taking over the world. Even tho the alien monster is silly, the movie on a whole is a decent spaghetti-made gory alien monster movie! Rating: 7/10 because even tho the budget was small, director Antonio Margheriti still manages to catch the attention of the audience and the effects are pretty gory. If you liked this movie, also check out \"Cannibal Apacalypse\" and \"Blood For Dracula\" for more shocks!",
         "Antonio Margheriti still is one of my favorite Italian directors (thanks to his 70's & 80's films), but the mix he presents us with \"Alien From The Deep\", he has done before and much better already. \"Killer Fish\" mixes a heist movie while cashing in on Joe Dante's \"Piranha\". With \"Hunters of the Golden Cobra\" he gave us a hero with James Bond allures in a film reminiscent of an Indiana Jones adventure. In a way, \"Aliens From The Deep\" fits in perfectly with all other blends of Margheriti entertainment. It's not on par with the films it borrows from, but it tries to redeem itself by going over the top a little further. So what kind of blend does Margheriti present us this time? Obviously, the Italian title \"Alien Degli Abissi\" (which roughly translates to \"Alien Of The Abyss\") tries to cash in on James Cameron's 1989 hit \"The Abyss\". But that's where the comparison ends. Most of the film can be categorized as some type of 'adventure on a tropical island' film. Some military/governmental facility is dumping toxic waste into the earth. Some noble people try to expose this and ultimately stop them. Some action & some shooting. Fair enough. Now what's with the alien-aspect of this film? Well, we have to wait a good 50 minutes for it to show itself, and it's not really an alien, but some mutant giant monster (basically formed by toxic waste, creating a symbiosis of organic material & scrap metal – I know, that sounds way too smart for a movie of this type) emerging from the bowels of the earth. It somewhat looks like a black giant crab-robot monster of sorts. It just gets thrown into the movie's third act so they could rip off the climax of Cameron's \"Aliens\". Remember Ripley fighting the mother-alien in that yellow robotic worker-unit? Well, it's here too, only it's some type of bulldozer. So \"Alien Degli Abissi\" is just entertaining Margheriti nonsense (featuring yet again fun miniature effects) and nothing more. It's sub-par, as to be expected, but thankfully it's not boring. Oh, and it has Charles Napier running around in it, mainly behind computers. Other than that, he seems to have little else to do. Good Badness? Yes, fair enough fun & inept action/adventure/monster fodder. 4/10 and 6/10.",
         "Tirelessly prolific veteran Italian exploitation picture director Antonio Margheriti's cinematic oeuvre is a very mixed bag, running the gamut from delightfully sleazy (\"Cannibal Apocalypse\") to nice, spooky, dripping with sepulchral atmosphere fright film fun (\"The Virgin of Nuremburg,\" \"The Long Hair of Death\") to entertainingly goofy sci-fi (\"The Wild, Wild Planet,\" \"War Between the Planets\") to pleasingly tacky spaghetti Westerns (\"The Stranger and the Gunfighter,\" \"Take A Hard Ride\") to the unavoidable occasional dud. This sci-fi/horror/conspiracy thriller sadly constitutes as one of Margheriti's dullest and least satisfying features, mainly because it's crucially bereft of the gleefully trashy verve which distinguishes his more enjoyable efforts. In its place there's no sex or nudity, mild profanity, tame violence, an interminably draggy pace, a wearily drawn-out narrative, and tepid action sequences; in short, everything a solid, rewarding little B-movie needs to seriously smoke is noticeably absent here. The blah plot offers a tediously trite'n'tired mishmash of boringly overused clichés, centering on your standard evil corporation illegally dumping radioactive waste into a dangerously volatile volcano located on a remote obscure island. Two wet-nosed bleeding heart liberal limp dishrag Greenpeace workers discover the pernicious goings-on and spend the rest of the film being hunted down in the dense tropical jungle by the usual assortment of greasy company flunkies. Oh yeah -- and there's a lethal, clawed, slime-drooling, steam-expelling extraterrestrial subterranean creature the pair also uncover and do their best to protect from the conglomerate's vile, greedy clutches. Token semi-name rugged, craggy-faced, firm block-of-granite character actor Charles Napier portrays a typically malevolent nasty army colonel on thespic automatic pilot throughout, wearing a fixed scowl on his puffy, roughhewn mug and grumbling all his dialogue in a deep, earthy, barely audible rumble mumble. Napier's given precious little to do that's worth seeing, an unfortunately malady that infects this dismally dreary clunker as a lethargic whole.",
         "`It's gigantic, evil and invincible!' boasts the tagline. Well, this alien dwarfs the original alien in physical size only. Although the film takes place on a tropic island, a few similarities to `Alien' are obvious, down to the fact that the heroine has to stand the last fight with the creature wearing nothing but her white underwear. No, I don't complain about that ;-) Anyway, the huge creature which can move under the ground is quite scary (but only until it stands up and suddenly looks like a cross between a senile robot and a lunatic crab), the characters (including a snake hunter, Greenpeace investigators, a not-yet-mad scientist and an unscrupulous officer trying to `control' the situation) help to develop an interesting storyline, and I cannot agree with reviewers who consider this a simple rip-off. There is a lot more to see, `Alien degli abissi' is not too bad entertainment from an experienced director (voted 6/10).",
         "A cheap and cheezy sci-fi/horror clunker from director Antonio Margheriti, Alien From The Deep joins the select list of titles that have proved so tedious that they have taken me three successive nights to finish. Congratulations, Antonio! The film stars sexy blonde Marina Giulia Cavalli as Jane, a Greenpeace activist who, along with her cameraman Lee (Robert Marius), sneaks onto a high security island where an unscrupulous corporation has been dumping radioactive waste into the heart of an active volcano, an irresponsible act that results in a stream of pure energy being emitted into space, much to the annoyance of an huge, ugly alien who comes to Earth and smashes stuff with its massive claw. Judging by the amount of recycling that's going on here, Margheriti has clearly taken his film's ecological theme to heart: the director employs well-worn ideas from James Cameron's Aliens and The Abyss for his lousy script, while his monster looks like it has been constructed from old bits and pieces scavenged from a local junkyard. Antonio isn't wasteful when it comes to excitement or scares either, delivering very little of either, the action being repetitive and uninspired (lots of dreary running around the jungle and skulking around a factory) and the horror element almost non existent. The alien doesn't even make an appearance until about an hour in, and when it does show up, it's a massive disappointment, a poorly-conceived bio-mechanical being that looks like it's being wheeled around on a trolley before eventually rising to its feet where it wobbles uncertainly like a newborn baby deer. This kind of trash usually tries to compensate for its many inadequacies with some splatter and nudity, but Alien From The Deep fails to satisfy in both departments, with only one decent moment of gore (a diver emerging from the sea with his face melted off) and Cavalli only going so far as stripping to her underwear Ripley-style, except that her vest is baggier and her panties are bigger. 2.5 out of 10, rounded up to 3 for IMDb.",
         "Oh, how I loved this movie. It is filled to bursting with everything you could want from Margheritti, and then some! Lots of exploding miniatures, plenty of running through the jungle, and a heroine who keeps finding ways to lose her pants. The real charm of the movie is trying to count the myriad other films it is trying to rip off. Obvious nods to ALIENS abound, (flamethrowers,a battle with a towering monster and a big yellow vehicle), with plenty of allusions to the first ALIEN thrown in for good measure (building the weapons, the chamber filled with hanging chains). Amusingly the first hour seems to be a curious mishmash of either THE CHINA SYNDROME or SILKWOOD with, of all things, ROMANCING THE STONE!!!! It is all daffily endearing."
      ],
      "genres": [
         "Sci-Fi",
         "Horror"
      ],
      "productionCompanies": [
         "Dania Film",
         "Gico Cinematografica S.r.l.",
         "National Cinematografica"
      ],
      "summaries": ["Two members of Greenpeace discover that a local factory sheds radioactive waste into an active volcano, which has created a terrifying creature that wreaks havoc in the area."],
      "budget": 0
   },
   "movielensId": 142314,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1989-10-15",
      "dvdReleaseDate": null,
      "directors": ["Antonio Margheriti"],
      "runtime": 90,
      "movieId": 142314,
      "title": "Alien from the Deep",
      "mpaa": null,
      "actors": [
         "Daniel Bosch",
         "Marina Giulia Cavalli",
         "Robert Marius",
         "Luciano Pigozzi",
         "Charles Napier",
         "Roberto Dell'Acqua",
         "David Brass",
         "Kenneth Peerless",
         "Michael Welborn",
         "Albert Bronski",
         "Donald Wilson",
         "Frank Wannack",
         "Curtis Carter",
         "Jeff Griffith",
         "Philip Gordon"
      ],
      "imdbMovieId": "0096785",
      "originalTitle": "Alien degli abissi",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Somewhere deep in the jungle a chemical corporation dumps tons of toxic waste in a still active volcano. Two environmentalists try to expose these illegal ways of getting rid of hugely dangerous waste, but they get caught by the vigilantes working for the company. One of them, the super-hot Maria Giulia Cavalli, manages to escape and she is saved by a snake farmer who lives alone in the jungle. Together they try to bring down the company, but it’s too late. Years of chemical poisoning have spawned a deadly monster that is set out to exact revenge on humans that have unknowingly brought him to life. Directed by legendary Antonio Margheriti, the unholy master of Italian B movies, Alien from the Deep is one of the most beloved Italian rip-offs. A wildly entertaining ride, the movie is an inventive crossover where lots of different genres and styles are mixed.",
      "tmdbMovieId": 27909,
      "avgRating": 2,
      "releaseYear": "1989",
      "numRatings": 1,
      "posterPath": "/7SAoZbsxmdlYvNu2D3PnbCSG7GR.jpg"
   }
}