{
   "tmdb": {
      "original_language": "cn",
      "keywords": [],
      "imdb_id": "tt3801934",
      "video": false,
      "title": "Wild City",
      "recommendations": [
         277519,
         367882,
         457320,
         49095,
         56578,
         459073,
         348689,
         315509,
         270759,
         479718,
         335462,
         363790,
         281298,
         340746,
         435366
      ],
      "backdrop_path": "/cG7g4ycr8220vPjfRnvBkQwnyW0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Kwok Tin-Man",
               "gender": 2,
               "credit_id": "55459c4ac3a3680ce80058ff",
               "name": "Louis Koo",
               "profile_path": "/xFxfAv0NgSbR7INoIdcDMQiRJTX.jpg",
               "id": 78875,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Kwok Sui-Chung",
               "gender": 2,
               "credit_id": "55459c39c3a3680ce6005bff",
               "name": "Shawn Yue",
               "profile_path": "/vUqHw9944ZBN8MBuQ2QN6qDVNOd.jpg",
               "id": 78869,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Tong Yun",
               "gender": 1,
               "credit_id": "55459c53c3a3680ce6005c09",
               "name": "Tong Liya",
               "profile_path": "/gs4EnN8mrPBxamWsGtepJWD44hi.jpg",
               "id": 1173214,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Mona",
               "gender": 0,
               "credit_id": "574fa785c3a368794c000a8e",
               "name": "Yuen Qiu",
               "profile_path": "/yhoYlv4ZdSEcUQ2leZErKpqX1mA.jpg",
               "id": 119426,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Blackie",
               "gender": 2,
               "credit_id": "55b45b35c3a368210a005da4",
               "name": "Joseph Chang Hsiao-Chuan",
               "profile_path": "/jZY7c982XpzwUWmnLxDhP7QaypY.jpg",
               "id": 126717,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Wong",
               "gender": 2,
               "credit_id": "55459ccb925141586d0057b6",
               "name": "Simon Yam",
               "profile_path": "/Apus3dKsGBSRgsQg6N5T41F10at.jpg",
               "id": 20519,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "King",
               "gender": 2,
               "credit_id": "55459cbac3a3680cd7005c54",
               "name": "Jack Kao",
               "profile_path": "/9racQvqrPVmtfzJX6rJF3TQB6bm.jpg",
               "id": 1174366,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "George",
               "gender": 2,
               "credit_id": "574fa7d2c3a3687948000c3b",
               "name": "Michael Tse Tin-Wah",
               "profile_path": "/2kiRHdlbYHNN6tFOCyXypGUSZrG.jpg",
               "id": 21912,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Kwan",
               "gender": 2,
               "credit_id": "56e54205c3a3685a9200670a",
               "name": "Philip Ng",
               "profile_path": "/poOeV55q5r8MwCEOysv2ii2rdC1.jpg",
               "id": 100585,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Yan",
               "gender": 0,
               "credit_id": "55459cd5c3a3680cdb005b42",
               "name": "Sam Lee",
               "profile_path": "/peBEATyBMxLnbqdg9DLBZVyJXkY.jpg",
               "id": 74193,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Leung Ho",
               "gender": 0,
               "credit_id": "574fa7f19251417a2e000a86",
               "name": "Marc Ma Yu-He",
               "profile_path": null,
               "id": 1615891,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Kuen",
               "gender": 2,
               "credit_id": "574fa7fbc3a3687939000ac2",
               "name": "Philip Keung",
               "profile_path": "/8R2DjQPHsvc3q2aHjz1YYlq76LF.jpg",
               "id": 140478,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Gei",
               "gender": 0,
               "credit_id": "574fa806c3a368793f000c21",
               "name": "Alex Lam Chi-Sin",
               "profile_path": null,
               "id": 1143686,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Po",
               "gender": 0,
               "credit_id": "574fa811c3a3687957000a5e",
               "name": "Joman Chiang",
               "profile_path": null,
               "id": 236194,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Kwai",
               "gender": 0,
               "credit_id": "574fa8339251417a2a000afe",
               "name": "Edward Chui",
               "profile_path": null,
               "id": 1627422,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Big boss",
               "gender": 0,
               "credit_id": "574fa83d9251417a34000aaf",
               "name": "Tam Bing-Man",
               "profile_path": "/hzarQowrdxY1S2uM8y2a6ceF7fJ.jpg",
               "id": 1132614,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Fei",
               "gender": 0,
               "credit_id": "574fa8469251417a31000ab1",
               "name": "Marcus Fok",
               "profile_path": null,
               "id": 1626695,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Tiger",
               "gender": 0,
               "credit_id": "574fa84f9251417a25000b69",
               "name": "Law Ho-Ming",
               "profile_path": null,
               "id": 1616886,
               "order": 18
            },
            {
               "cast_id": 27,
               "character": "Badly",
               "gender": 0,
               "credit_id": "574fa859c3a368794c000ab7",
               "name": "Cheung Lap-Fung",
               "profile_path": null,
               "id": 1629644,
               "order": 19
            },
            {
               "cast_id": 28,
               "character": "Elderly",
               "gender": 0,
               "credit_id": "574fa862c3a3687953000a89",
               "name": "Kong Foo-Keung",
               "profile_path": null,
               "id": 1629645,
               "order": 20
            },
            {
               "cast_id": 29,
               "character": "Uncle Fung",
               "gender": 0,
               "credit_id": "574fa86ac3a3687948000c59",
               "name": "Kent Chou",
               "profile_path": null,
               "id": 1629646,
               "order": 21
            },
            {
               "cast_id": 30,
               "character": "Chiu",
               "gender": 0,
               "credit_id": "574fa8cb9251417a27000b37",
               "name": "Kit Cheung Man-Kit",
               "profile_path": null,
               "id": 1455929,
               "order": 22
            },
            {
               "cast_id": 31,
               "character": "Rick",
               "gender": 0,
               "credit_id": "574fa8d49251417a2e000ab1",
               "name": "So Hoi-Kit",
               "profile_path": null,
               "id": 1629647,
               "order": 23
            },
            {
               "cast_id": 32,
               "character": "Ming",
               "gender": 0,
               "credit_id": "574fa8df9251417a27000b40",
               "name": "Rodney Wong",
               "profile_path": null,
               "id": 1629648,
               "order": 24
            },
            {
               "cast_id": 33,
               "character": "Wah",
               "gender": 0,
               "credit_id": "574fa8fd9251417a2a000b1d",
               "name": "Yan Ngai-To",
               "profile_path": null,
               "id": 1629649,
               "order": 25
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55459b509251414c920031f8",
               "name": "Ringo Lam",
               "profile_path": "/qQVMNuvXFJZ6KK3ZRKdTBadejSh.jpg",
               "id": 26767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55459b5b9251414c920031fd",
               "name": "Ringo Lam",
               "profile_path": "/qQVMNuvXFJZ6KK3ZRKdTBadejSh.jpg",
               "id": 26767,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55459b7c9251415865005a62",
               "name": "Ringo Lam",
               "profile_path": "/qQVMNuvXFJZ6KK3ZRKdTBadejSh.jpg",
               "id": 26767,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55459bbbc3a3680ce80058ec",
               "name": "Kuo Hsing Li",
               "profile_path": null,
               "id": 1178886,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "55459bd492514119e0002dad",
               "name": "Ross W. Clarkson",
               "profile_path": null,
               "id": 1069627,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55459bf392514119e0002db2",
               "name": "David M. Richardson",
               "profile_path": null,
               "id": 23810,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.659445,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 338421,
      "vote_count": 13,
      "budget": 0,
      "overview": "Former cop-turned-bar owner Kwok and his underachieving half-brother befriends a drunken woman, they soon find themselves targeted by both her former lover, a high-powered attorney, and the gangster he employs. A suitcase full of tainted cash enters the picture as Kwok finds himself torn between the gangsters and his former colleagues.",
      "similar": [],
      "original_title": "迷城",
      "runtime": 102,
      "poster_path": "/k2FXkNxyOJluOE8Mx2xyQGde4dK.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mei Ah Films Production Co. Ltd.",
         "id": 41465,
         "origin_country": ""
      }],
      "release_date": "2015-07-25",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ringo Lam"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Ringo Lam",
         "Koon-Nam Lui"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt3801934/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM3Mjk5OTM2OV5BMl5BanBnXkFtZTgwMDMzODAyNzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Louis Koo",
         "Shawn Yue",
         "Liya Tong"
      ],
      "reviews": [
         "Ringo Lam's first feature in 12 years sees the Hong Kong auteur deliver the final part in a thematic trilogy that began with the Chow Yun- fat starrer 'City on Fire' in 1987 and continued with 'Full Alert' in 1997. Written and directed by Lam, 'Wild City' is firmly moulded in the filmmaker's socially conscious instincts and expressed through its lead protagonist T-man (Louis Koo), who observes in the opening reel how money is the root of all evil that contaminates people's dreams, conscience and even sense of justice. Indeed, despite being a disgraced cop who now runs his own bar, T- man is the only morally righteous individual in the whole story, driven instead by loyalty to his family, including his mother Mona (Yuen Qiu) and his hot-headed cab-driving step-brother Chung (Shawn Yue). Lam places T-man and Chung unwittingly in the path of a lawyer George (Michael Tse), a spoilt-brat young tycoon (Ma Yuke), and a closely- knit band of Taiwanese gangsters led by King (Jack Kao) and his lieutenant Blackie (Joseph Chang) after rendering an act of kindness to a drunk woman named Yan (Tong Liya), who happens to be George's ex- girlfriend. Turns out that Yan has in her possession a briefcase full of cash and gold from a hotelier who plans to use it as a bribe to obtain a gambling license in Macau, and besides stealing the money from the bad guys, has personally offended the tycoon by resisting his advances in a hotel room and knocking him up badly on the head. Not that we're being cynical, but you'll probably be hard-pressed in real life to find such Good Samitarans like T-man and Chung willing to put themselves in harm's way. Besides contending with these nefarious individuals, T-man and Chung also have to deal with a local triad led by Sam Lee and T-man's former police colleagues (played by Simon Yam, Philip Keung and Philip Ng in supporting roles). Their game of cat-and-mouse plays out entirely in Hong Kong, and sans a short refuge on Lamma Island, pretty much unfolds thoroughly along the city's thoroughfares. Just as his earlier two movies, Lam's script here is densely plotted but never convoluted, and part of its pleasure is watching T-man slowly unravel and untangle the intricate web of crime and deceit. There is a salient point that Lam is trying to make about money and corruption – which he drives home in a none-too-subtle moment right at the end when a stray bullet hits a Themis statue and shatters its balance scales – but the moralising comes off a little hollow. Instead, what registers is the mayhem that Lam wroughts onto Hong Kong's multiple-lane highways, pedestrian underpasses and downtown back alleys. Back in the 1980s and early 1990s, Lam practically defined the urban crime drama genre with his kinetic action sequences, and the years since has not dulled his sensibilities one bit. The fight scenes – whether by knife or firearm or a combination of both – are visceral and captivating, while the vehicular chase sequences are specifically designed and filmed to put you right up close into the centre of destruction. The old-school car mayhem is signature Lam all right, and fans of his earlier classics like 'Full Contact' will be glad to know that he has lost none of his flair nor derring-do in keeping it raw and real, with some able assistance from Ross W. Clarkson's fluid camera-work and David M. Richardson's tight editing. There is no doubt that 'Wild City' is a solid return to form for Lam after more than a decade's hiatus, but there is also no dismissing a faint waft of disappointment. Competent though it may be, there isn't anything particularly innovative like the 'bullet-eye view' that he pioneered in 'Full Contact'. The action isn't memorable in and of itself, and the finale seems a little too brief and low-key. Lam's script also lacks the rich symbolism of the earlier two entries in his trilogy, and in turn misses the opportunity to tease out an analogy about these clashing representatives from three disparate parts of the so-called 'One China' crossing paths. Rather, Lam goes for safe and familiar territory by pontificating about money and its ills, and while Lam's usual isn't a bad thing at all, neither does it add much to his oeuvre. Notwithstanding, Lam continues to be blessed with committed actors, and here Koo and Yue's dedication to their roles is evident from start to finish. That is something notable especially for Koo, whose prolific nature also means that he tends to phone it in every now and then. There is a palpable sense of brotherhood between the two lead actors, and it is an invigorating dynamic that more than capably sustains the character work required of the narrative. In a somewhat less developed role, Chang is nevertheless compelling as the unhinged baddie with utter disdain for the rule of law, especially after one of his own is accidentally killed by T-man. Thanks to these familiar elements, Lam's 'Wild City' isn't a missed shot; rather, this gangster neo-noir is more than an appropriate capper to his gritty trilogy that he started close to three decades ago. Both thematically and stylistically, Lam doesn't miss a beat, and fans should be thrilled that his combination of intricate plotting and kinetic action feels just as exhilarating here. Yes indeed, if Ringo Lam's familiar will do, 'Wild City' feels as if Lam never left in the first place.",
         "Chinese action movies tend to use fluent choreography or fluid martial arts theme, just like many of Donnie Yen's works. Wild City is the opposite of that nature, it opts for an audacious style, which feels realistic to a degree and a bolder choice for action. While this may result in more authentic look, it also loses the usual poise which makes the movie too frantic at times. Yun is a woman with shady past, as she's been involved with corrupt ex-boyfriend and gangster. As luck would have it, two brothers, T-Man and Sui Chong find her when she's intoxicated. The Good Samaritan deed doesn't go unrewarded since the gangsters chasing her eventually collide with their lives. The plot opens with more realism, or at least the gritty version of it. There are plenty of red district muse or night life scenes to set this up. Leading actors, including the antagonist perform in brash tone, talking in slang or behaving condescendingly. This is not the smooth precise showcase, but more of a dive in dark side of typical noir movie. Granted, it doesn't become depressingly gritty, though it deals with sufficient veritable theme that it feels all too brazen. This approach also fits, partially, with the action. Choreography in use is far from usual sophisticated fights, let alone wuxia wiring, this is more of blade and bat swinging seen at riot news. It can be awkward at times, both the fight and plot as it progresses. Some scenes feel forced and superfluous, especially when it recycles its mafia movie cliché towards the end. The sense of authenticity isn't consistent enough to last the entire movie. Wild City is a different taste of crime drama, it certainly delivers the wild promise of the title, although it can be rudimentary and unrefined sometimes.",
         "It's been twelve years since Ringo Lam directed a full length film, but his new movie Wild City doesn't feel particularly special. It's a low budget thriller about a bunch of sad sacks who steal money from a corrupt lawyer and are harassed by gangsters. Louis Koo plays T-Man, a disgraced former cop who owns a bar. One night a woman, Yun (Liya Tong), gets badly drunk at his bar, and T-Man, worried for her safety, takes her to the house of Mona, the woman who helped raise him. Together with Mona's taxi-driving son Chung (Shawn Yue), T-Man tries to help Yun get her car back the next day (she lost the key while drunk), but she's kidnapped off the street by a Taiwanese gang! After a car chase T-Man and Chung manage to stop the gang from escaping with her, but she disappears as soon as the police show up. It develops that Yun stole a lot of money from her lawyer boyfriend, who was heavily involved in organized crime. She convinces T-Man and Chung to help her retrieve the money, which is in a briefcase in the back of her car, resulting in an escalating series of chases, fights, and double crosses. Most of the movie lacks any distinctive style. The early action scenes would not be out of place in an American TV series. The big chase/shootout at the end of the movie includes moments that almost feel like they could be from golden age of Hong Kong action movies, but there aren't many of them. This is not the return to form fans of Ring Lam have been waiting for."
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "East Light Film Company",
         "Mei Ah Films Production Co. Ltd.",
         "One Cool Film Production"
      ],
      "summaries": ["A cop-turned-bar owner befriends a drunken woman at closing hours and finds himself pursued by her former lover and the thugs he employs. The chase turns deadly when the bar owner's deadbeat brother and a suitcase full of cash enter the picture."],
      "budget": 5000000
   },
   "movielensId": 142484,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "2015-07-25",
      "dvdReleaseDate": null,
      "directors": ["Ringo Lam"],
      "runtime": 102,
      "movieId": 142484,
      "title": "Wild City",
      "mpaa": "",
      "actors": [
         "Louis Koo",
         "Shawn Yue",
         "Tong Liya",
         "Yuen Qiu",
         "Joseph Chang Hsiao-Chuan",
         "Simon Yam",
         "Jack Kao Kuo-Hsin",
         "Michael Tse Tin-Wah",
         "Philip Ng",
         "Sam Lee",
         "Marc Ma Yu-He",
         "Philip Keung",
         "Alex Lam Chi-Sin",
         "Joman Chiang",
         "Edward Chui",
         "Tam Bing-Man",
         "Marcus Fok",
         "Law Ho-Ming",
         "Cheung Lap-Fung",
         "Kong Foo-Keung",
         "Kent Chou",
         "Kit Cheung Man-Kit",
         "So Hoi-Kit",
         "Rodney Wong",
         "Yan Ngai-To"
      ],
      "imdbMovieId": "3801934",
      "originalTitle": "迷城",
      "genres": [
         "Thriller",
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": ["v2Y4VL1v1KE"],
      "plotSummary": "Former cop-turned-bar owner Kwok and his underachieving half-brother befriends a drunken woman, they soon find themselves targeted by both her former lover, a high-powered attorney, and the gangster he employs. A suitcase full of tainted cash enters the picture as Kwok finds himself torn between the gangsters and his former colleagues.",
      "tmdbMovieId": 338421,
      "avgRating": 4.5,
      "releaseYear": "2015",
      "numRatings": 1,
      "posterPath": "/k2FXkNxyOJluOE8Mx2xyQGde4dK.jpg"
   }
}