{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1535419",
      "video": false,
      "title": "A Million",
      "recommendations": [
         52441,
         75006,
         320150,
         32213,
         82469,
         32157,
         31714,
         133983,
         257568,
         71620,
         55765,
         32149,
         32163,
         13311,
         264273,
         37870,
         43987,
         34777,
         52418,
         26781
      ],
      "backdrop_path": "/dG8gL8iV4VJTt3PcmcgvAxPHTaY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "한기태",
               "gender": 2,
               "credit_id": "53bf6b890e0a261576005b99",
               "name": "Park Hae-il",
               "profile_path": "/bzgD29gCOE5ImtU9m2Vjbrv5LlC.jpg",
               "id": 21687,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "장민철 PD",
               "gender": 2,
               "credit_id": "53bf6b980e0a2615820059c8",
               "name": "Park Hee-soon",
               "profile_path": "/7VoaJrwpaTrqP9KiBsIpSGX3M9g.jpg",
               "id": 93999,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Jo Yu-jin",
               "gender": 1,
               "credit_id": "53bf6ba40e0a26157c00584f",
               "name": "Shin Min-A",
               "profile_path": "/oAWw900x5sQnXlZT3v9A4nh0Ijn.jpg",
               "id": 116175,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Park Cheol-hee",
               "gender": 2,
               "credit_id": "53bf6bb00e0a261579005978",
               "name": "Lee Min-ki",
               "profile_path": "/i4X68hyNU1FCdCdw25sFbxVJb4v.jpg",
               "id": 1299351,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "김지은",
               "gender": 1,
               "credit_id": "53bf6d7f0e0a2615790059c1",
               "name": "Jung Yu-mi",
               "profile_path": "/k702MmVyx6bosScGlFchfInc2Rq.jpg",
               "id": 127720,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "최욱환",
               "gender": 2,
               "credit_id": "53bf6def0e0a261585005a4d",
               "name": "Lee Chun-hee",
               "profile_path": "/g0NjjxCHP2as3uNILgRbVmjiHkX.jpg",
               "id": 233437,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "559acfadc3a36824eb000131",
               "name": "Shin Dong-mi",
               "profile_path": "/hC0cykImuetAqKkLRup2zKVUhZD.jpg",
               "id": 1372475,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Lee Bo-yeong",
               "gender": 1,
               "credit_id": "564596789251410a4400885a",
               "name": "Go Eun-ah",
               "profile_path": "/9ajUEaMllFwqyEZmgXqFZOKfseW.jpg",
               "id": 1244814,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "542bb047c3a36868f5001439",
            "name": "Cho Min-ho",
            "profile_path": null,
            "id": 119405,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.972501,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 45083,
      "vote_count": 12,
      "budget": 0,
      "overview": "8 contestants compete for a billion wons ($1 Million USD) in a survival reality TV show. The challengers must spend 7 days in the Australian desert. On the second day, one contestant is found dead. The other contestants then find themselves in horrifying situations as they deal with each others' lies and deceits.",
      "similar": [],
      "original_title": "A Million",
      "runtime": 114,
      "poster_path": "/xLWt8JgN2lqMfMs4DN6O2xFTKWU.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Showbox/Mediaplex",
         "id": 10923,
         "origin_country": ""
      }],
      "release_date": "2009-08-06",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Min-ho Cho"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Min-ho Cho"],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt1535419/",
      "coverLink": null,
      "actors": [
         "Jae-ho Baek",
         "Seo-wu Choi",
         "Seo-eun Han"
      ],
      "reviews": [
         "Korean thriller about seven people brought together in a Survivor like game (They could probably sue the film makers over the emblem). They are taken to the Australian desert where they quickly learn that the losers don't go home. Told in flashback with a sting of sorts in the tail the film is a serviceable thriller that hits all the right notes to keep it mostly interesting. If there is any real flaw in the film, aside from being a bit too run of the mill plot wise, is that you could probably chop at least 20 minutes of of the film without losing anything. Its not a bad movie, but its not a particularly remarkable one either.Certainly its better than the endless variations that have been turned out by American B (c and D) movie makers over the last few years. I liked it, but as I said to a friend who asked me about it, its the sort of thing you'll watch once, enjoy and then pass on.(Actually its good but you really wish it was just a tad better) A rental or a loaner on an undemanding night.",
         "Okay movies like this has been done before but this one is about Koreans being in a survival contest to win a million dollars. Well they didn't know that it's really life or death when the enter. Now the problem about this movie is that you just won't care who lives or who dies cause none of the characters in this is particularly likable. And lot of the decisions they make doesn't make any sense at all. Which really takes away from the psychological aspect of this movie. I can sort of tell what message this movie wanted to show, but as a whole it just didn't work. For a thriller I was never on the edge of my seat and after like 30 or 40 minutes in I was bored with it and just didn't care. If there was a better well crafted psychological tension to this it might have worked. But it turned out to be a predictable and dull survivor movie that really isn't worth the time to watch. Oh and Shin Min-A's acting is overrated or she just wasn't trying. This tries to show the ugliness of humanity but it just wasn't effective. 3.9/10",
         "A token reality-based South-Koren thriller. Although not as simple as first thought. Sure the concept is routine and fairly drawn out, but it does offer up an impulsively shady twist that actually comes off. By virtually turning everything upside down. Even if the screenplay is ludicrous and possibly forced, but further along the story goes, the more engaging the plot becomes. After somewhat a bland beginning. Eight strangers are given an invitation to become part of a survivor type reality TV show set in the remote desert of Australia with the winner taking away one million dollars. But it doesn't take long for the contestants to realize the game has life or death consequences. The story starts backwards, kind of switching back and forth between time lines. I thought it was going to be a smarting social commentary with psychology brushes on the manipulative nature of reality TV and society's unhealthy obsession in becoming nothing more then a spectator, but that's left behind when the twists occur. Still the selfish side of humanity plays a big part in the story's progression and revelations. I think the biggest problem here, is the characters themselves. They're are poorly written character arches and quite unlikable. You don't really connect, but you feel like you're suppose to. You're simply compelled to what's the bigger mystery (the motivation) to it all, not for their well-being. The performances are hard to judge because of it. The choice of location is effectively brought across on the screen. Dangerous, forlorn and open, but still with a great sense of isolation. Direction is competent, even with its cheap look. However the director doesn't really generate much in the way of suspense, even his attempts of violent shocks lack any real impact. It's mean-spirited, but there's no real punch to it. I just got that blank feeling. Curiously watchable, if senseless survival thriller.",
         "Just visited \"A Million\". I visited I say? To tell the truth is the fourth time that I attempt to view it. Why? Because I love it too! Undoubtedly there are many other best Korean films of this but do not know how to explain it ... but this film as I say I like too, want to really charming atmosphere, both for the pathos that is able to convey, either for the rich characters and very often not devoid of morality and that are unexpected in their way of acting and of course for many other reasons. The plot is very smooth and is full of surprises, especially at the end that according to the tradition of Korean cinema does not disappoint the expectations of the viewer. I'm sorry to see many this film is not so much appreciated and it is unfortunate, and not to defend the film but I find it unfairly underestimate. It is not a perfect agreement, but I consider it a good movie survivor movie very addictive, fast-paced and full of facets"
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Showbox/Mediaplex"],
      "summaries": ["Eight young people try to survive a deadly game show for the million-dollar prize."],
      "budget": 0
   },
   "movielensId": 142606,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2009-08-06",
      "dvdReleaseDate": null,
      "directors": ["Min-Ho Cho"],
      "runtime": 114,
      "movieId": 142606,
      "title": "A Million",
      "mpaa": null,
      "actors": [
         "Park Hae-il",
         "Park Hee-soon",
         "Shin Min-A",
         "Lee Min-ki",
         "Jung Yu-mi",
         "Lee Chun-hee",
         "Shin Dong-Mi",
         "Go Eun-ah"
      ],
      "imdbMovieId": "1535419",
      "originalTitle": "A Million",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "8 contestants compete for a billion wons ($1 Million USD) in a survival reality TV show. The challengers must spend 7 days in the Australian desert. On the second day, one contestant is found dead. The other contestants then find themselves in horrifying situations as they deal with each others' lies and deceits.",
      "tmdbMovieId": 45083,
      "avgRating": 3.5,
      "releaseYear": "2009",
      "numRatings": 13,
      "posterPath": "/xLWt8JgN2lqMfMs4DN6O2xFTKWU.jpg"
   }
}