{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1129410",
      "video": false,
      "title": "The Immortal Voyage of Captain Drake",
      "recommendations": [
         104451,
         200670,
         226363,
         127475,
         39293,
         89148,
         104974,
         67328,
         43752,
         109936,
         212759,
         37123,
         11767,
         228558,
         58495,
         42242,
         43308,
         6587,
         44769,
         63480
      ],
      "backdrop_path": "/fvfeNDN1kdJWhrkIuU78VhY8uGh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sir Francis Drake",
               "gender": 2,
               "credit_id": "52fe45f69251416c9104464f",
               "name": "Adrian Paul",
               "profile_path": "/3BNKgYUbcWw7v9oIsPOW6fVlpkq.jpg",
               "id": 71900,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Don Sandovate",
               "gender": 2,
               "credit_id": "52fe45f69251416c91044653",
               "name": "Temuera Morrison",
               "profile_path": "/1ckHDFgKXJ8pazmvLCW7DeOKqA0.jpg",
               "id": 7242,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Peter Easton",
               "gender": 2,
               "credit_id": "52fe45f69251416c91044657",
               "name": "Wes Ramsey",
               "profile_path": "/wE1KG7kthjEijx4igRvWxBa5TXu.jpg",
               "id": 78595,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Baldassarre Cossa",
               "gender": 2,
               "credit_id": "58f3c7c4c3a368085a014c7a",
               "name": "Daniel Kash",
               "profile_path": "/i5OS6KtTSnPV4wFU9PhS6ptR3Bn.jpg",
               "id": 1797459,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Isabella Drake",
               "gender": 1,
               "credit_id": "52fe45f69251416c9104465f",
               "name": "Sofia Pernas",
               "profile_path": "/jUlVWn9wq4peNg2rC2ZPFtMYLI4.jpg",
               "id": 115625,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Wendon",
               "gender": 0,
               "credit_id": "52fe45f69251416c91044663",
               "name": "Nick Harvey",
               "profile_path": null,
               "id": 115626,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f69251416c91044645",
               "name": "David Flores",
               "profile_path": null,
               "id": 115624,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f69251416c9104464b",
               "name": "Rafael Jordan",
               "profile_path": null,
               "id": 105828,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.319244,
      "production_countries": [
         {
            "iso_3166_1": "BG",
            "name": "Bulgaria"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 36588,
      "vote_count": 5,
      "budget": 0,
      "overview": "Sir Francis Drake goes on a quest to find the legendary Tree of Life, battling the Spanish Armada, sea monsters, sorceress and his bitter nemesis Captain Don Sandovate on the way.",
      "similar": [],
      "original_title": "The Immortal Voyage of Captain Drake",
      "runtime": null,
      "poster_path": "/4z5U6B7DWTUsLOFuQy3tOYgEdWX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sci Fi Pictures",
            "id": 4774,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Voyage Productions (III)",
            "id": 7789,
            "origin_country": ""
         }
      ],
      "release_date": "2009-01-17",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Bulgaria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Flores"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Rafael Jordan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1129410/",
      "coverLink": null,
      "actors": [
         "Adrian Paul",
         "Temuera Morrison",
         "Wes Ramsey"
      ],
      "reviews": [
         "Let's keep in mind the venue. Sci Fi network is notorious for having poorly produced original monster movies. Which is why it should be complimented when one of their movies strives for something more. A fictitious take on an actual historical character's adventures is always a dangerous gamble. However, in the case of The Immortal Voyage of Captain Drake, Rafael Jordon does an admirable job of weaving actual historic legend with an interesting treasure hunt sort of storyline. At times the character's actions seem predictable, and some of the sailors/pirates are a bit cliché, but often the dialogue is witty and sarcastically humorous. The CGI is bad, (as always in these shows) but the film's locations are actually quite impressive considering it is all in Bulgaria. The score sounded very \"big\" for this genre. That is a good thing. It sounded like a real orchestra as well. That is rare for Sci Fi. The sound design and mix were great. Nothing stuck out as bad or wrong, which is usually the sign of a good soundtrack, again, for this genre. The sword fighting was very good and those sequences were cut together very well by the picture editor. This is saying a lot, considering the shooting ratio was probably 3:1. I know from previous movie reviews, that these shows are shot in under 20 days, edited for two months and the sound mix is done in 4 days. When you break it down, it's a miracle that the movie is made at all. Quite an accomplishment for all those involved. One of the best scenes in the show, is the slow motion filmed, pistol and sword dual between Drake and Sandovate, in the snow at the north pole. Very well done considering all the limiting factors of time and budget. Adrian Paul and Wes Ramsey deliver admirable (pun intended) performances given the nature of the material and the time they had to develop their character choices. And if this is Sofia Pernas' first role in a TV show or movie as her IMDb listing suggests, look out! She was excellent in this and we will see more of her I am sure. As far as other reviews submitted by haters, it is unfair to compare Sci Fi network originals with larger budget films. Everyone who is involved with these projects knows exactly what they are making and why. These movies are entertaining if you watch with the correct \"perspective\". Letting them tick you off because they aren't as good as you had hoped is a bit silly.",
         "1) The accents were cringe-worthily bad. I wasn't sure if I was listening to Cornish, Irish, Spanish or Klingon. The lead actor, particularly, was perfectly capable of putting all four into his lines and randomly mixing them up. 2) Rarely will you see an American \"period\" film which does anything but recklessly re-write history, usually to the detriment of the country or people it targets (bitter that America doesn't have one?). This is among the worst for that crime, but take a look at the writer and director and you cannot, surely, be surprised. 3) Considering it was made in 2009, I was under the impression I was watching something from the 70s. Poor acting on a scale as bad as \"Land Of The Giants\", poor story and even worse editing.",
         "Well, don't agree with the 1-star reviewer - it is all in expectations. If you expected a first class SciFi Fantasy, why then this is not \"Willow\", or \"The Fellowship of the Ring\". If all you expected is a good \"B\" movie, this passes the time, and the dialog is, for the genre, erudite - vide the comments and inscription on the scene of the \"Tomb of Caesarion\"!!! The by-play between Drake and his daughter was a nice touch. There are numerous mythological references - again, if you like that sort of thing, suspect older viewers will - which fold into the tale, Sandovate is certainly a satisfactory villain, and one tends to be interested in the characters. The one lamentable scene was the Turkish chase, if you are going to do tongue-in-cheek, do it with verve. crew should be better in the sequel.",
         "This was one of the worst movies I ever attempted to watch. I love Adrian Paul but his 'acting' was totally bad if you even want to call it 'acting'. It was as if he was resisting to even reciting the lines given in the script and just spit them out as 'whatever' - Okay so it was a badly written script. How desperate was Paul to do this? Even the sound track was bad! The whole movie was pitiful. I couldn't even finish it. I believe that anything (especially a film) to be done is worth doing right. It is possible to do even a low budget film in the right way but evidently the writer, producer and director of this film haven't figured that out yet and take absolutely no pride in what they do! Wes Ramsey (as 'Peter Easton') did the best acting of all even with the lame writing in the script. I believed his character anyway. Kudos to Wes for doing the best he could with such horrible dialog! Even George Lucas can write better dialog than Rafael Jordan! The overall storyline was interesting, even though it was certainly not reflective of actual events in the life of Sir Francis Drake. This venture was a total waste of time for the actors and anyone who was unfortunate enough to watch it, even for a few minutes. Even 'Ishtar' deserved an Academy Award compared to this flick. Of course, other reviewers seem to really like this one. Everyone has different opinions and take aways from films they watch. I have said this before and I'll say it now...SciFi (now SyFy) Channel should turn to the writers and directors of its wonderful 'commercials' to write a good 'original' film for its network! SyFy has proved to show horrible and poorly written 'original' films on a regular basis - Get with the program SyFy Executives! With the right writers, great made-for-TV films are possible - even on a lower budget.",
         "I just watched this movie, and it was great, especially thanks to the awesome Adrian Paul. He was FUNNY, in this role, which was so different than the serious Duncan MacLeod from his fantastic show, 'Highlander'. I was pleasantly shocked to see that he hasn't seemed to have aged a single day since Highlander. (He'll be 50 in May...he looks 35!) It was great to see him sword-fight the badguys, and just so cool to see him in the role of pirate. I hope that there's a second movie, as the ending was left open. You could really tell that Paul had fun filming this movie. The only oddity was that the girl playing his daughter looked much too old to possibly BE his daughter, because Paul looked so wonderfully young! LOL!",
         "Contrary to the other poster I found this to be a fun and delightful movie. Adrian Paul did a wonderful job with this slightly satirical role! It is very reminiscent of the flash back scenes in Highlander when McCloud was more cocky and naive. I loved the fictional spin on a historical figure. I hope they make a series out of this! I loved the repartee between Drake and his crew. The twist on this great historical figure coupled with the swashbuckling action will be enjoyed by anyone that has loved series like Hercules or Xena. The CG is a bit rough in places, but the style of the movie seems to demand an unreal quality to the effects. A definite must see for the Adrian Paul Fan!",
         "I felt the film was as good as it could possibly get, being that it was a film on the Sci-fi channel. Personally, I liked The Immortal Voyages of Captain Drake. I felt it was fun and entertaining. It was Adrian Paul at his playful best. It seemed obvious that he relished the role and was having a lot of fun. When the actors on screen have fun I tend to enjoy the film a little more. The Immortal Voyages of Captain Drake was not the usual Pirate lark. I felt it was a touch Homer's the Odyssey and a touch Pirates of the Carribbean with a hint of Shiharazard and Aladdin. A story filled with magic, great sword fights, more depth than one would expect from the commercials. Its a very adventurous story with lots of great FX and CGI. Of course I laughed a lot because, hello, it was almost B-grade, can you say Giant Lobster Monster? But in spite of some of the hilarious FX it was quite the romp and quite fun. Delightfully fun! There seems to be a showing of this film tonight, Thursday, February 5 2009 on the Sci-fi channel at 8 pm or 9 pm. I look forward to seeing it again.",
         "This SyFy Channel TV movie is an attempt to mix the life story of Sir Francis Drake, that heroic Brit who defeated the Spanish Armada, with some old-fashioned fantasy heroics along the lines of a Sinbad movie or JASON AND THE ARGONAUTS. The resulting concoction is a silly mess of bad acting, poor plotting, and the usual excruciating CGI effects that the SyFy channel deliver. I wanted to like this film, I really did. I love all the old Harryhausen movies so something made as a tribute to them sounded good. Unfortunately, THE IMMORTAL VOYAGE OF CAPTAIN DRAKE is just too cheap to really work. The ships and sets are never convincing and the hammy actors in support are very poor indeed. Adrian Paul is awful too, particularly his broad farmer's accent which keeps drifting all over the place and had me cringing every time I heard it. The usual gamut of sea monsters and basilisks and the like turn up at every opportunity but the action is schlocky and will only be enjoyed by those in a very forgiving mood.",
         "I wasn't expecting much watching The Immortal Voyage of Captain Drake, but got a little better than I expected. I hate most of the SyFy originals, but found this one of their more tolerable efforts. The costumes and locations are great, the editing is a cut above the choppy feel I've often seen, the music score is grandiose and often epic, much better than the sluggish and over-bearing scores of most SyFy movies, the sword-fighting is decent and not as clumsy as I thought it would and the performances from Adrian Paul and Wes Ramsey. The Immortal Voyage of Captain Drake does have its flaws though as well, namely the artificial-looking effects, the stilted and rather trite dialogue, scenes that aimed to have a tongue-in-cheek vibe but came across as lacking verve like the Turkish chase, clichéd characters and some of the other actors mumble through their lines. The story was a good idea to go on and had moments where it was crisply-paced and exciting, but others where it was rather dull and predictable. In conclusion, uneven but compared to other SyFy efforts it is reasonably entertaining. 5/10 Bethany Cox",
         "Well, I don't make a habit of watching television, and I certainly don't necessarily expect \"fine art\" when I DO. I was really looking very much forward to this and then rather disappointingly, fell asleep after about ten or fifteen minutes. But the part that I saw was exactly the lighthearted, entertaining fantastical fare I was expecting. I already KNEW from the ads that it wasn't intended to be a non=fiction piece and that it featured lots of CGI and special effects.. this is precisely what I was hoping. As to those who nitpick about \"poor acting\" and what have you, I will look forward very much to seeing YOUR efforts on the big screen very soon. My only regrets are that I wasn't able to see the whole thing, that I can't find any more listings or showings of it, and that it doesn't appear to be available on DVD yet.",
         "I gave this movie a 7 out of 10. Whats to like, Adrian Paul devours this role and has fun with it something rare for him to play a comedic action role and he seems to be enjoying every minute. The Dialogue for the SyFy channel is a few steps above the usual as are many of the production values some have been mentioned by other reviewers. No this isn't the multi-million dollar romp of a Capatain Jack not at all but this is Captain Drake so a few things look a bit fake but on the other hand some things look great. David Flores has directed a few B-Movies and been on the production staff of a few others he is beginning to mature if you ask me as a director of these types of movies its not always about the budget its about the creativity in how you use that budget. Realizing this movie at best had a 1.5 - 3 million dollar budget is whats important how much can you do on a shoestring. These movies take imagination and the duel someone else mentioned is really well done and stylish. Some of todays best directors came from these low budget bonanazas like Sam Raimi, Wes craven, heck John Carpenter sitll makes lots of B Movies hie latest the Ward was way better than Sucker Punch. So I have hope for David Flores and recommend this movie that its quiet obvious to me he had fun making the charm the little touches of style and flare. I liked it, and its a step above most films on the SyFy network. Now would I buy it on DVD maybe if its in the discount bin."
      ],
      "genres": [
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Sci Fi Pictures",
         "Voyage Productions (III)"
      ],
      "summaries": ["\"1592. Four years after England's defeat of the Spanish Armada, tensions still run deep, especially between Sir Francis Drake, \"The Queen's Pirate\", and his lifelong nemesis, Captain Don Sandovate. An encounter with a mysterious Syrian sultan, however, finds the two men and their crews engaged in a daring race against time, each embarking upon a desperate quest to exotic foreign lands where they face perilous obstacles and untold dangers at every turn.\""],
      "budget": 0
   },
   "movielensId": 142600,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-17",
      "dvdReleaseDate": null,
      "directors": ["David Flores"],
      "runtime": 0,
      "movieId": 142600,
      "title": "The Immortal Voyage of Captain Drake",
      "mpaa": "",
      "actors": [
         "Adrian Paul",
         "Temuera Morrison",
         "Wes Ramsey",
         "Daniel Kash",
         "Sofia Pernas",
         "Nick Harvey"
      ],
      "imdbMovieId": "1129410",
      "originalTitle": "The Immortal Voyage of Captain Drake",
      "genres": [
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sir Francis Drake goes on a quest to find the legendary Tree of Life, battling the Spanish Armada, sea monsters, sorceress and his bitter nemesis Captain Don Sandovate on the way.",
      "tmdbMovieId": 36588,
      "avgRating": 2,
      "releaseYear": "2009",
      "numRatings": 4,
      "posterPath": "/4z5U6B7DWTUsLOFuQy3tOYgEdWX.jpg"
   }
}