{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0280241",
      "video": false,
      "title": "Black River",
      "recommendations": [
         46222,
         56685,
         117342,
         69129,
         223899,
         43085
      ],
      "backdrop_path": "/oUBg3VO4AmNhWRxE8tZm9OBwy8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Boyd 'Bo' Aikens",
               "gender": 2,
               "credit_id": "52fe464ac3a36847f80f6df9",
               "name": "Jay Mohr",
               "profile_path": "/6HGBa7y15h6Xrg55Wr8BepS363R.jpg",
               "id": 12217,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Laura Crosby",
               "gender": 1,
               "credit_id": "52fe464ac3a36847f80f6dfd",
               "name": "Lisa Edelstein",
               "profile_path": "/mPTRiyPAf2cxAEfZJILIu9NDwjZ.jpg",
               "id": 41420,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mandy Pruell",
               "gender": 1,
               "credit_id": "52fe464ac3a36847f80f6e01",
               "name": "Ann Cusack",
               "profile_path": "/yQ68n8G6xl8TDMDr0534nnaGINS.jpg",
               "id": 59260,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mayor Tom Thompson",
               "gender": 2,
               "credit_id": "52fe464ac3a36847f80f6e05",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464ac3a36847f80f6e0b",
               "name": "Jeff Bleckner",
               "profile_path": "/8mgbryrtiwKvEeQe8K1aaQP2B04.jpg",
               "id": 69982,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe464ac3a36847f80f6e11",
               "name": "Dean R. Koontz",
               "profile_path": null,
               "id": 29923,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.074245,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43481,
      "vote_count": 13,
      "budget": 0,
      "overview": "Burned-out Hollywood screenwriter Bo Aikens (Jay Mohr) is fed up with life in Los Angeles. He heads out of the hustle and bustle of the big city and arrives in picturesque Black River in Northern California, seeking relaxation and artistic inspiration. In small, idyllic Black River, nearly everyone is happy, contented, and welcoming of strangers. But despite the beautiful setting, Bo begins to feel unsettled after several disturbing incidents. He discovers that all of his money has been transferred to a bank account in Black River, and a house has been purchased for him by someone on \"his\" instructions.",
      "similar": [],
      "original_title": "Black River",
      "runtime": 86,
      "poster_path": "/ienFEzajQdRoEP6zRts953vwa2d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/9qLH49995jKhMW1Dju9usFDs4aB.png",
            "name": "20th Century Fox Television",
            "id": 1556,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Patchett Kaufman Entertainment",
            "id": 4963,
            "origin_country": ""
         }
      ],
      "release_date": "2001-07-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Remote. Controlled.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Bleckner"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Daniel Taplitz",
         "Dean R. Koontz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0280241/",
      "coverLink": null,
      "actors": [
         "Jay Mohr",
         "Lisa Edelstein",
         "Ann Cusack"
      ],
      "reviews": [
         "You have always heard of small towns that are said to be the perfect American town. Well, Black River is a too perfect town. Everybody is nice. Anybody that is mean they get rid of. A perfect American town except there is something wrong with the town. There is a \"big brother\" watching you at every corner. You can never leave the town because \"big brother\" will not let you. It is a good movie. If you like weird movies then you should see this one.",
         "'Black River' appears, at first glance, to have all the nescessary ingredients for a bad horror movie. In fact it turns out to be quite watchable sort of Night-Gallery-ish mystery/SF hybrid. Put it this way, I didn't figure it out in the first 5 minutes. There is enough mystery and strangeness to keep you interested, even though you get the sensation that you've seen this movie several times before on Ray Bradbury's mystery theatre or something. Based on a Dean Koontz novella(?), a disillusioned writer leaves LA in search of somewhere to put down roots, and ends up by accident in a small town called Black River, which looks like it's probably in coastal Oregon or northern California. Only trouble is, he can't leave. Every attempt to depart is foiled by some unlikely set of events; many of the locals are just a bit weird, there's a mysterious black van following him around, and so on. Something very strange is going on. Is it supernatural, a government conspiracy, or what? I won't give it away, though to be honest I didn't think the ending was very credible at all, and rather let the film down. The acting and production values are better than you might expect. What really keeps the movie in the mid-range, score-wise, is a blandness in the direction. There are times when some spooky atmosphere would have been desired, but the thing unfolds in a workmanlike manner, with not a lot in the way of atmosphere. There is one thing I want to know, though: at the start of the movie, while still in LA, he is looking for a place to bury his beloved golden retriever. Now, in Black River, a dog keeps turning up who is the spitting image of his old pooch (Koontz has a thing for Golden Retrievers I take it, as there was one in Watchers as well). The thing is, you get the feeling the dog is on his side, and at other time that it's part of the 'conspiracy'. Thinking about it logically, I don't see any way that the latter could be true, though this is eventually implied. Little things like that bother me. Thankfully though, there were no big things that bothered me about the movie. Quite watchable, but perhaps I'd have been disappointed if it were an overnight rental. A solid 6 out of 10.",
         "BLACK RIVER is a great retelling of old TV show episodes, like the \"Star Trek\" episode where Kirk eventually discovers the townsfolk have been worshiping a computer in a cave. Koontz, who over the years has turned into the best of the three major horror writers with a series of novels that have become downright metaphysical, obviously loves \"The Twilight Zone\" and \"Star Trek\" and probably \"The Outer Limits.\" Jay (\"Jerry McGuire\") Mohr is a writer, originally from Vermont, who has become disillusioned with Los Angeles, and checks out a small Pacific Northwest town only to find he can't leave. Cameras are mounted on every traffic light, in every store and dwelling, and monitor everyone's movements while an unseen hand apparently controls the whole thing. Mohr is excellent as the frustrated prisoner, and is backed up by stellar performances from Ann (sister of Joan and John) Cusack as a too-happy waitress and Lisa (\"House, MD\") Edelstein as her architect sister who also has become trapped in the bucolic town of Black River. Other than what appears to be a limited budget and the fact it was clearly shot in Canada or some place other than the U.S., it is hard to tell this is a TV movie and not a theatrical release. The writing is first rate, and the actors have a ball with their roles in this old-fashioned paranoia thriller. Highly recommended. I can't wait for Hollywood to adapt any of Koontz's more recent output, which eschew standard horror plots in favor of near-transcendental stories interlaced with intermittent bouts of action.",
         "Here we have another egotistical super-intelligent computer; this one goes by the name of \"Pericles\" and has somehow continued to function after termination of a supposedly failed development project. (Doesn't anyone know where to find the plug for these machines?) In a fit of conscience, Pericles wants to set a better example than its storied predecessor computers, e.g., \"Hal,\" whose misdeeds had given their ilk a bad name. Its mission is to create a cultural oasis in its home town of Black River. To this end, it not only lures desirable residents but captures, though not necessarily captivates, selected others wandering through the town. Jay Mohr plays a successful novelist passing through, while Lisa Edelstein is a promising architect lured to the town. While Jay likes Lisa, that pull can't offset his desire to escape Pericles' machinations that prevent his leaving. Local color, you might say, is displayed by the waitress, real estate agent, police chief, and mayor, not to mention the telephones. This all sounds better than it is. In \"2001,\" Hal's actions were totally within the bounds of what an advanced computer controlling a spaceship could do. Alas, Pericles goes so far overboard, albeit sometimes in interesting ways, that the required suspension of disbelief is not achieved. That and the poorly managed tension and flow keep \"Black River\" far out of the top ratings, especially after having just seen some top classics and in recalling \"2001.\" \"Black River\" has a good start and a conclusion that slightly offsets the lengthy middle disconnect with the viewer. However, don't feel guilty if you bail out early on; the time you save is your own. 'Twas an idea that with more work might have turned into something good---or not.",
         "Yes I can be a bit snotty sometimes about movies, but this obvious mini movie (scenes fade black for the ads) made for enjoyable if semi-predictable viewing. Call me naive but this did last the distance interest wise for me. Maybe my 'Big Brother' dark side was calling? Comparisons to the more darkly humourous 'U-Turn' immediately rise, but what the hell, its' an engrossing subject trapped inside a crazy town... I hope I'm not the only one? Was it just me or everytime Jay Mohr, (seen him before on something?) actually had a good facial expression, they pull a wierd camera angle and lose it? Lisa Edelstien has an attractive allure and made her character the most believable in my opinion. Overall worthwhile, with time to kill afterwards... 6/10",
         "Is there some type of written rule in American TVMs ( And for the sake of argument I class this as a TVM - not a mini series ) that there must be a tear jerking scene included ? I`m just curious because BLACK RIVER opens with a man called Bo Aikens burying his dog and boy is the sentiment laid on with a trowel . Am I supposed to empathise with Bo because his dog died ? Well I don`t and even if I did any sympathy I might have had for him would have disappeared a few minutes later when he confesses he worked as a screenwriter in Hollywood , lived in a big house with his beautiful wife with a big car parked in a big garage , but decided to give it all up because he wanted to be taken seriously as a writer . So let`s see now , he was working as a Hollywood screenwriter ( And getting big bucks for doing so ) and gave it all up because he wasn`t getting enough critical acclaim ! In other words he`s a schmuck and deserves everything that comes his way in my opinion . I`ve heard the name Dean Koontz but have never read any of his novels and couldn`t tell you anything about the author and it wasn`t untill I looked up his profile on this site that I found he was American born . Watching BLACK RIVER I wouldn`t have believed it because the American stereotypes of middle America in general and Black River in particular seem somewhat overplayed with American pie hospitality and the occasional redneck scumbag in a premise that would have probably worked better as an episode of THE X-FILES. In fact I`ve seen this type of story umpteen times in that show",
         "As a reader of Dean Koontzs' work I looked forward to seeing Black River (originally created as a mini-series but shown in the UK as a short movie). I have always found his work fast paced and well constructed, but I was a little disappointed with this offering as there seemed at times only a tenuous link running through the plot. To me Bo (Jay Mohr) seemed a little 2 dimensional and somewhat lacking in substance. He seemed more interested in finding out who was behind what was going on rather than \"getting out of dodge\", an aim he professed throughout. I feel that the concept put forward by the author was interesting and could have been handled in a slightly better way. Jay Mohr has in the past delighted me with his performances, however in this case he seemed to have the aspect of someone running around like a headless chicken who shouted all his lines. All in all, a bit of a disappointment."
      ],
      "genres": [
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Fox Television Studios",
         "Patchett Kaufman Entertainment",
         "Bayonne Entertainment"
      ],
      "summaries": ["A writer visits a town that isn't what it appears to be."],
      "budget": 0
   },
   "movielensId": 142667,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-07-06",
      "dvdReleaseDate": null,
      "directors": ["Jeff Bleckner"],
      "runtime": 86,
      "movieId": 142667,
      "title": "Black River",
      "mpaa": "PG",
      "actors": [
         "Jay Mohr",
         "Lisa Edelstein",
         "Ann Cusack",
         "Stephen Tobolowsky"
      ],
      "imdbMovieId": "0280241",
      "originalTitle": "Black River",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Burned-out Hollywood screenwriter Bo Aikens (Jay Mohr) is fed up with life in Los Angeles. He heads out of the hustle and bustle of the big city and arrives in picturesque Black River in Northern California, seeking relaxation and artistic inspiration. In small, idyllic Black River, nearly everyone is happy, contented, and welcoming of strangers. But despite the beautiful setting, Bo begins to feel unsettled after several disturbing incidents. He discovers that all of his money has been transferred to a bank account in Black River, and a house has been purchased for him by someone on \"his\" instructions.",
      "tmdbMovieId": 43481,
      "avgRating": 1.41667,
      "releaseYear": "2001",
      "numRatings": 6,
      "posterPath": "/ienFEzajQdRoEP6zRts953vwa2d.jpg"
   }
}