{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "marriage of convenience",
            "id": 3686
         },
         {
            "name": "drama",
            "id": 8029
         }
      ],
      "imdb_id": "tt0021761",
      "video": false,
      "title": "Consolation Marriage",
      "recommendations": [],
      "backdrop_path": "/w5blyQWAJm1wQaZXkrXA3pwIJpF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary Brown Porter",
               "gender": 1,
               "credit_id": "52fe4c10c3a368484e1a4d6d",
               "name": "Irene Dunne",
               "profile_path": "/nkgi5ygQCGBUb3OvKdHdBAaHjS0.jpg",
               "id": 77158,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Steve Porter",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4d71",
               "name": "Pat O’Brien",
               "profile_path": "/nRd6AufixcDcptqRSJwq1pTLArX.jpg",
               "id": 3155,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jeff Hunter",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d75",
               "name": "John Halliday",
               "profile_path": "/soyfwUQtgcxahcylFig4lG9RvRs.jpg",
               "id": 14688,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elaine Brandon",
               "gender": 1,
               "credit_id": "52fe4c10c3a368484e1a4d79",
               "name": "Myrna Loy",
               "profile_path": "/2CR0ZjUmMWU5F03EVN32vnxkNvB.jpg",
               "id": 13577,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Aubrey",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d7d",
               "name": "Lester Vail",
               "profile_path": "/z7jenqulBoujLwIm1PLFXQzoEfS.jpg",
               "id": 952387,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "The Colonel",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d81",
               "name": "Matt Moore",
               "profile_path": "/7BwbVt0yCNNJJPeiGbIfzDfr3yt.jpg",
               "id": 61101,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Undetermined Role",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4d85",
               "name": "Elmer Ballard",
               "profile_path": null,
               "id": 229960,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Elaine's Butler",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d89",
               "name": "Wilson Benge",
               "profile_path": null,
               "id": 939842,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Mulligan - a Policeman (uncredited)",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4da5",
               "name": "Edgar Dearing",
               "profile_path": "/aHjtlKqJc3aa555TBO2Ksj1F11w.jpg",
               "id": 1240252,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dog Owner",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d8d",
               "name": "Tom Herbert",
               "profile_path": null,
               "id": 1008867,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Justice of the Peace",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4d91",
               "name": "Robert Homans",
               "profile_path": "/qgFVZf4Tl9GLNhTLgrEdSWeBbgY.jpg",
               "id": 95311,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Kate - Mary's Maid",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4d95",
               "name": "Gertrude Howard",
               "profile_path": null,
               "id": 590531,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Charlie - One of the Boys",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d99",
               "name": "Gladden James",
               "profile_path": null,
               "id": 985839,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Man Picking Up Stack of Newspapers",
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d9d",
               "name": "Dave O'Brien",
               "profile_path": "/2LVRGnrd1vHwgrJxCaJCvMliduy.jpg",
               "id": 118633,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Baby Porter",
               "gender": 0,
               "credit_id": "52fe4c10c3a368484e1a4da1",
               "name": "Pauline Stevens",
               "profile_path": null,
               "id": 1081188,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c10c3a368484e1a4d69",
               "name": "Paul Sloane",
               "profile_path": null,
               "id": 145837,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56ce5360c3a3681e500004d6",
               "name": "Humphrey Pearson",
               "profile_path": null,
               "id": 1017989,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56ce5369c3a3681e4400060a",
               "name": "Humphrey Pearson",
               "profile_path": null,
               "id": 1017989,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "56ce537b9251413e6a000586",
               "name": "Bill Cunningham",
               "profile_path": null,
               "id": 1582455,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56ce53919251413e5900054a",
               "name": "Myles Connolly",
               "profile_path": null,
               "id": 70496,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "56ce539a9251413e5c0005e0",
               "name": "William LeBaron",
               "profile_path": null,
               "id": 120449,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56ce53a39251413e59000550",
               "name": "Max Steiner",
               "profile_path": null,
               "id": 3249,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ce53aa9251413e5c0005e5",
               "name": "J. Roy Hunt",
               "profile_path": null,
               "id": 97048,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56ce53b39251413e62000575",
               "name": "Archie Marshek",
               "profile_path": null,
               "id": 3486,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56ce53cac3a3681e3e0005ed",
               "name": "Max Rée",
               "profile_path": null,
               "id": 1009388,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56ce53e4c3a3681e36000561",
               "name": "Charles Kerr",
               "profile_path": null,
               "id": 1307431,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56ce53eec3a3681e36000564",
               "name": "John E. Tribby",
               "profile_path": null,
               "id": 121315,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.62236,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 136109,
      "vote_count": 1,
      "budget": 0,
      "overview": "A sportswriter (Pat O'Brien) jilted by his globe-trotting girlfriend (Myrna Loy) marries a woman (Irene Dunne) jilted by her boyfriend.",
      "similar": [
         421044,
         435126,
         62206,
         4982,
         812,
         10530,
         20943,
         37710,
         9798,
         240,
         272,
         1538,
         2118,
         50620,
         37247,
         75780,
         238,
         289,
         947,
         67308
      ],
      "original_title": "Consolation Marriage",
      "runtime": 81,
      "poster_path": "/bRTAi5b6lED8zuOSNPQulWOlpZc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1931-11-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Paul Sloane"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Bill Cunningham",
         "Humphrey Pearson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021761/",
      "coverLink": null,
      "actors": [
         "Irene Dunne",
         "Pat O'Brien",
         "John Halliday"
      ],
      "reviews": [
         "Irene Dunne and Pat O'Brien marry each other on the rebound after each of their true loves marry someone else. It is agreed to be an \"open\" marriage, where each can leave at any time with no questions asked. The film tries to answer the question: what happens if either of their former loves came back and want them? That is exactly what happens in duplicate - both loves, Myrna Loy and Lester Vail, return almost at the same time and want their former sweethearts back. I enjoyed watching the stars perform even though the story was routine and the final outcome was never really in doubt. The supporting cast, especially John Halliday, was all very good. Myrna Loy was still stuck in her \"bad girl\" roles. Watch for the scene where Dunne and O'Brien drive by New York's RKO Mayfair. Its marquee is emblazoned with lights heralding two RKO features shown earlier in 1931, A Woman of Experience and Millie. You can even pick out ZaSu Pitts on the marquee, but a large screen TV and a VCR in the slow motion mode will help.",
         "One of Irene Dunne's earliest features (before \"Back Street\" would make her a star) rewards a second look in a time of heated discussions on the sanctity of marriage. Mary Brown and Steve Porter, both jilted by their longtime sweethearts, meet up and hit it off, based as much on their mutual melancholy as anything else. On a whim, Steve proposes marriage to Mary, while acknowledging that their hearts will always belong to others. They decide their marriage will be based on their friendship alone, and each will be free to walk away at any time with no regrets. It is, of course, inevitable that the original sweethearts will each turn up and test Steve and Mary's resolve. But what is most striking to me is that midway through their marriage Mary gives birth to a baby girl. Yes, of course, this film was made pre-Code, but nonetheless it's remarkable that it would be acknowledged that these friends in a marriage of nothing but convenience would have a sexual relationship as well. The pregnancy and birth aren't even a very big deal, and Mary's and Steve's open marriage agreement continues. There is even a suggestion that the existence of the child should be no impediment to either of the spouses' decision to go his or her own way. Of course, there's a happy ending, so the point is made moot. But it's having been made at all is what makes this film, to me, a little bit more than simply a run-of-the-mill Hollywood melodrama.",
         "The chance to see three Hollywood legends in their salad days is the best reason to see Consolation Marriage which stars Pat O'Brien, Irene Dunne, and Myrna Loy. It's the story of two people who think they've settled for second best in the marriages they make. Irene is jilted by Lester Vail who marries a rich girl and Pat O'Brien is similarly given the heave ho by Myrna. One night Dunne and O'Brien meet in a café and the two fall for each other, but not without a bit of nostalgia for their lost loves. They marry and have a baby girl, but both of them have Vail and Loy come back in their lives. I think you can tell where this one is going. What's kind of strange is that Loy who played the perfect wife for years and years after The Thin Man is the other woman here against Dunne who also played perfect wives and mothers. Dunne and O'Brien never worked together again, but almost 40 years after Consolation Marriage came out, Pat and Myrna were cast as Burt Reynolds's parents in The End, one of the last films for both of them. Consolation Marriage is a pleasant Depression era soap opera with three screen legends and a nice performance also by John Halliday as O'Brien's boss who kind of likes Dunne himself and wishes she were really free.",
         "Dunne and O'Brien's joyful relationship was fun to watch. Their patter was witty. They hit all the right notes. The others, well, not so much. This was a movie about modern couples trying to find their way through life and love, self-consciously not old-fashioned, finding out what worked for them and what was only good in theory or for others. There were no conclusions drawn that their choices should be the choices for everyone. Indeed, right and wrong was a complete non-issue. Leave your baby or not--up to you. Change spouses like socks or stick with the one you have--up to you. Then-current psychology was brought into it, that a baby would grow up happier if the mother left to be happy than if the mother stayed and was resentful. And that the mother would miss the baby more than the other way around. While it does have a happy ending, that makes sense considering the fact that the other two in the quadrangle were drips and for some people being in a marriage and having a baby DOES change their point of view in regard to past infatuations. And who would want to lose such an upbeat intimate partnership that included mutual love for a child? It was just a matter of recognizing that they had stumbled into a successful relationship in spite of themselves. I don't know if the two men trying to get them back together toward the end were gay or not but they acted as if they might have been. Gays and lesbians weren't uncommon in movies of that era but a person can read too much into things. I love pre-Code movies. They illustrate that liberalism doesn't go in a straight progression through time. My parents told me stories about people they knew that showed that even the average Joe and Mary on the street could kick over the traces of \"the old morality.\" If we didn't have these movies, and books, of the era we might believe that most people in the past clung to the conventions like limpets when in fact they were transitioning, too. We are still trying to figure out the answers to the questions raised a hundred or so years ago, such as how important is individual happiness and who makes the rules. The last lines were fun, too. Grrr. Go get him, Irene!",
         "Consolation Marriage (1931) A really good movie, and a very serious drama. The sincerity of the acting and the attempt for clarity about true love and romantic first love are both impressive. Yes, it is somewhat of a familiar kind of film and filming, not quite breaking rules or surprising you as it goes, but in a way this just adds to its solidity. The two female stars are what drew me first to the title, and it's the underrated and subtle Irene Dunne who gives the whole drama its depth. Myrna Loy is a second woman with a small role, but it's fun to see her so early in her career. The men were known at the time, especially Pat O'Brien, but they do less to make it convincing that simply fill in Dunne's deeper performance. What drives the thing is the plot, which is really sincere. Two couples in two different scenes are shown as romantically idealized—the starry eyed kinds of couples, true love and be-happy-forever types. Very impractical but compelling. And they both break up. (This happens right away, not a spoiler.) So the woman from one and the man from the other (Dunne and O'Brien) meet at a restaurant. And they get along so well, and have in common that their perfect relationships were now suddenly ruined, they decide to date. And so on. So this \"consolation marriage\" is a kind of means to survive, and happily. And they make a deal that they will always remember that they each had \"true loves\" earlier and elsewhere. And that they would have an \"open\" marriage. Then the ex-lovers re-appear. Inevitably. And the moral conflict is in their faces. Good idea, well done. It doesn't take it to emotional depths or to the complexity all these crossed affections suggest, but it does try. And that's where the move works so well. Underrated, in my view. It's not a thrilling pre-code classic, but it's worth seeing.",
         "Although the first ten minutes of the film are a trial, relishing as it does the cacophony of early films, the sheer bravado of Pat O'Brien and the iridescent charm of Irene Dunne soon make up for the horror of Myrna Loy, as stiff and plastic as her hairdo, and John Halliday, as a weak, chinless cretin musician. Once these two are left behind, the screenplay transcends its material and the dialogue and wit are as illuminating as the key lighting. The interaction between Dunne and O'Brien is what people mean when they say: \"They don't make movies like this anymore.\" The two simply become more than the sum of their parts. Discussing the ending would be akin to drowning a kitten. Suffice it to say that this is soap opera at its best and once the two weak sisters re-appear and disappear, we are left with an ending that allows us to feel morally uplifted. The material is dated but the inter-action between these two beginning stars of yesteryear makes up for any weaknesses. To fault the film for its age is simply ridiculous and makes such critics even less aware of just how good Hollywood films once were -- crowsfeet and all.",
         "This mawkish stilted chick flic from the 30s is concrete proof that they made them as bad back then as they do today (for a lot more money and with a longer shooting schedule). On the face of it Consolation Marriage is about a pair of progressive adults burned by love in the past who enter into an open marriage to protect themselves but find it hard to extricate themselves from it when both ex-beaus come a calling again. Consolation Marriage might have had a chance to resonate with its controversial theme if its bohemian protagonists didn't project such middle class personas. Irene Dunne's Mary makes a sorry attempt at being care free especially when she's deciding to jettison her 18 month old. Pat O'Brien in the meantime comes across cold and unemotional as if listening to confessions. A blond Myrna Loy looks alluring enough but not when she's reduced to fluttering her eyes and mouthing sappy lines like \"Oh darling look at this glorious night, it was made for us\" to a champion of the Catholic guilt complex. Director John Sloane does little to inspire his actors who morosely deliver their lines in two shot filled with pregnant pauses and embarrassed looks. Sloane manages to zap the energy out of nearly every shot while his clumsy cuts from scene to scene plays havoc with time and place. If there is any consolation to Consolation Marriage it is that Ms. Dunne at times rises above the material and Pat's anemic passion to project an effective and ideal portrait of a modern woman in turmoil. Thing is she does it just as well in better pictures.",
         "Since I first saw \"The Awful Truth,\" Irene Dunne has been one of the few performers whose presence in a movie will make me watch it. No matter what. This one is a real case of no matter what. (For the record, the others include Jean Harlow, Jean Arthur, and Constance Bennett.) This is a women's picture, directed at a snail's pace. In it, Ms. Dunne sports an exceptionally unflattering hair design, which makes her virtually unrecognizable as the star of such classics as the above-mentioned \"Awful Truth,\" Theodora Goes Wild,\" and \"Showboat.\" She looks like Edna May Oliver. She looks like Eleanor Roosevelt (my greatest heroine of the past two or three hundred years but hardly a beauty.) In this poky tale, Dunne actually leaves her child briefly. The child is indeed pudgy and very unappealing but women must have stalked out of theaters at that point. She and Pat O'Brien are not the most likely of couples but they are meant in the plot not to be. They are certainly more believable than Dunne and Spencer Tracy in unendurable \"A Guy Named Joe.\"",
         "Shopkeeper Irene Dunne (as Mary Brown) is in love with pianist Lester Vail (as Aubrey). Sports writer Pat O'Brien (as Steve Porter) expects to marry his high school \"Juliet\" Myrna Loy (as Elaine). Alas, Ms. Dunne and Mr. O'Brien lose their lovers to more well-heeled partners. Then, Dunne and O'Brien meet, get drunk, and bond in friendship as a cut-rate \"Bonnie and Clyde\" during a wild evening. Thinking any reconciliation with their true loves is impossible, Dunne and O'Brien decide to get married. Their \"Consolation Marriage\" is agreed to be an \"open\" one, but a child keeps O'Brien home and sober more often. Then, the marriages of Mr. Vail and Ms. Loy end - and, they want Dunne and O'Brien back... Predictable and unattractive, with some emphasis on the latter. **** Consolation Marriage (10/13/31) Paul Sloane ~ Irene Dunne, Pat O'Brien, John Halliday, Myrna Loy",
         "Pat O'Brien and Irene Dunne seem distinctly not made for each other in this odd romance, where she, a coffee shop proprietress, and he, a sports writer, are jilted by their respective fiances, meet cute, get a nice friendship going, and decide to get married. The open-marriage conceit feels daringly modern for 1931, but the dialog's pat and the plot coincidences are hard to swallow. Their respective true loves, Myrna Loy and Lester Vail, each come back from failed marriages at about the same time, and Dunne and O'Brien each leaves his/her spouse to pick up the pieces. It's hard to see why, when Loy is playing such a vain bore, and Vail such a needy weakling, and Dunne has an uncomfortable speech where she says goodbye to her baby daughter--her baby daughter!--to run off with an old lover. We all know the leads are going to discover they really love each other, but it's done so perfunctorily, with O'Brien just remarking to Loy, \"Wouldn't it be funny if we turned out to be just friends?\" and bolting upstairs to Dunne just in time for the happy fadeout. That's another thing--she can't make a great deal of money running a coffee shop, and he's unemployed more often than not, yet they have a gorgeous New York townhouse. Dunne's skill is somewhat evident, and O'Brien's fast talk is always entertaining, but he's not an ideal romantic lead, and this is not a credible romance.",
         "The so-called \"Pre-Code\" films were made up to about 1935 and were called this because although Hollywood DID have a long list of standards, they were pretty much ignored until an updated Production Code was adopted. These Pre-Code films were some times VERY racy and not at all what the average person these days thinks these early films were like, as some included nudity, foul language, racy topics and violence! While CONSOLATION MARRIAGE was made in this era and has SOME elements that would not have been allowed had it been made just a few years later, it is a relatively benign film--with no nudity or violence. Instead, its main plot line would NOT have been acceptable, as it concerns a marriage of convenience that is essentially an \"open marriage\". If either partner became dissatisfied or found someone else, then they both agreed the marriage was over and it was okay to leave! This rather selfish or amoral view of marriage NEVER would have appeared in films during the next several decades! This strange marriage contract, it seems, resulted from BOTH Pat O'Brien and Irene Dunne being dumped by their respective fiancés. So, out of loneliness, they were drawn together--at least until something better came along! And, later, BOTH Dunne's and O'Brien's old flames return and want them! And, at this point the couple have a choice to make--leave or stick around. This is further complicated by the fact that they now have a baby! How this whole thing is sorted out is, despite it being Pre-Code, rather conventional and predictable--as well as overly long and a tad dull. That's because this type of plot was, believe it or not, often copied! I have seen several very similar movies involving open marriages in the early 1930s and in each case, the film ends EXACTLY where you'd expect. Because of this derivative nature, it is a very skip-able film--especially if you've seen others like it. FYI--It's interesting to see that in this film Myrna Loy is a blonde!",
         "Man, this thing is old. Old in years, yes, but a film can be old and still fresh and relevant. This is old in that it's melodramatic and irrelevant, and dated. \"Consolation Marriage\" is from 1931 and stars Irene Dunne, Pat O'Brien, Myrna Loy, John Halliday, and Lester Vail. Dunne is Mary Brown Porter, who loses her childhood sweetheart, Aubrey (Lester Vail) to a rich woman. Mary tends to be a fairly understanding woman. Or else she's masochistic. She meets Steve Porter (O'Brien), another jiltee, and they decide to get married, even though they aren't in love. There's an understanding that Steve is still in love with the girl of his dreams, Elaine (Myrna Loy), but they keep breaking up. Mary again goes along with this arrangement. When I saw that Myrna Loy was supposed to be playing the other woman, I thought it was a mistake when I saw her. She did not look remotely like herself. Later I realized it was indeed Loy, who made a dazzling blond, beautifully gowned and coiffed. Steve and Mary get a dog and have a baby, but Steve slips away often to be involved with Elaine. Then Mary gets her big chance with Jeff (John Halliday). Will she take it? And will Steve ever leave her for Elaine? It's the rare woman who has the other woman over to her house and helps her dress. This is a movie about class distinction, a big topic in the old days, so it has a certain formality found in the theater and film before the Depression brought in the working man playwrights. I always liked Pat O'Brien, but I've never quite understood why he was used as a leading man in these romantic movies. Comedy, certainly. But unlike the other character actors who became leads - Bogart, Robinson, Cagney, etc. - O'Brien was not as successful. Irene Dunne is lovely in a difficult role, that of a woman being walked all over, putting up with it, and keeping her dignity. John Halliday refers to himself as an \"old man,\" and I thought to myself, \"I'll bet he's 40\" - you know how differently age was perceived in those days. Turned out he was 50. This is one of Dunne's first films, and if you're a huge fan, you may want to see it. I don't recommend it. At around 90 minutes, it seems like it's four hours long.",
         "If there's a single thing that might have saved this film, it probably would have been music. But this is one of those early films where music was seen as only needed during the opening and closing credits. So, in between, there's an awfully lot of \"dead air\". \"Dead air\" while the main characters silently emote, and \"dead air\" between scenes. It makes the movie seem very, very long, although it's actually only 81 minutes long. The premise of the film is actually interesting. A man (Pat O'Brien) and a woman (Irene Dunne) each break up with the loves of their lives (for the man, it's Myrna Loy). They then have a chance meeting in a bar/restaurant. They don't exactly fall in love...it's more a relationship of convenience...better to be together than alone. They marry, with the understanding that if their true loves return, they're each free to make their own decision. A child is born. And then, at the same time, the old lovers do return. Dunne leaves her baby and heads off with her lover (Lester Vail). But within hours, realizes she loves not only her baby, but also Pat O'Brien. She returns home to find that O'Brien is going to meet Loy, but instead she suggests bringing her to the house. Which O'Brien does, and that leads to a very awkward scene where Dunne attempts to keep a stiff upper lip and be very modern about what is happening...but ultimately breaks down in tears. Strikes against each character. Vail and Loy for horning in on a marriage...doubly so for Loy because she is such a cold woman here. Strikes against Dunne for being willing to give up her baby and husband...at least for a while. Strikes against O'Brien for bringing the other woman to his home to meet his wife. The actors play their roles relatively well, it's just that it's difficult to really like any of the characters very much. Each of the characters is remarkably callous at various times, and there's no clear good or bad guys (and gals) here. I did enjoy supporting actor John Halliday The movie is worth wading through if you like really old movies, though you won't want to wade through it more than once, and I doubt you'll want this clunker on your DVD shelf.",
         "This is without question Myrna Loy's worst movie (#44 that I saw). I thought there is no way you could take her and Irene Dunne, put them in a movie, and have it turn out bad. The problem was not that she was a bad character (she was that, but she played them before and better (including versus Irene Dunne in the classic horror film 'Thirteen Woman')), she was wooden and extremely unattractive with no figure. Dunne was also unattractive to look at with that haircut. I especially did not like the open marriage theme between Dunne and Pat O'Brien (spoilers ahead Dunne's near abandonment of the kid stands out). Come to think of it, there was not one character I actually cared one iota about. Who was best? It was actually Dunne, but that was only in comparison to Loy and O'Brien. I give it a generous one star."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": ["In prohibition-era Manhattan, shopkeeper Mary Brown loses Aubrey, her childhood sweetheart, when he marries a rich woman. Reporter Steve \"Rollo\" Porter has lost -his- childhood sweetheart, Elaine, who has also married another. Mary and Steve become friends, and make a marriage of convenience, based on a shared sense of whimsical humor as well as their mutual losses. When their old loves re-enter their lives a few years later, Mary and Steve must decide what is really important to them."],
      "budget": 0
   },
   "movielensId": 142681,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-11-21",
      "dvdReleaseDate": null,
      "directors": ["Paul Sloane"],
      "runtime": 81,
      "movieId": 142681,
      "title": "Consolation Marriage",
      "mpaa": "",
      "actors": [
         "Irene Dunne",
         "Pat O’Brien",
         "John Halliday",
         "Myrna Loy",
         "Lester Vail",
         "Matt Moore",
         "Elmer Ballard",
         "Wilson Benge",
         "Edgar Dearing",
         "Tom Herbert",
         "Robert Homans",
         "Gertrude Howard",
         "Gladden James",
         "Dave O'Brien",
         "Pauline Stevens"
      ],
      "imdbMovieId": "0021761",
      "originalTitle": "Consolation Marriage",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A sportswriter (Pat O'Brien) jilted by his globe-trotting girlfriend (Myrna Loy) marries a woman (Irene Dunne) jilted by her boyfriend.",
      "tmdbMovieId": 136109,
      "avgRating": 3,
      "releaseYear": "1931",
      "numRatings": 1,
      "posterPath": "/bRTAi5b6lED8zuOSNPQulWOlpZc.jpg"
   }
}