{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "based on true story",
            "id": 9672
         }
      ],
      "imdb_id": "tt4791594",
      "video": false,
      "title": "The Classified File",
      "recommendations": [
         32213,
         75006,
         369443,
         32157,
         121491,
         31714,
         41980,
         32149,
         13311,
         52441,
         50210,
         34777,
         37502,
         26781,
         37849,
         52418,
         43987,
         41441,
         206,
         32150
      ],
      "backdrop_path": "/k9zfHL3wSKBHR2QWTWVJzguomsn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gong Gil-yong",
               "gender": 2,
               "credit_id": "55883f0c92514161af000207",
               "name": "Kim Yoon-seok",
               "profile_path": "/k928qAOSI6kX0KL37pBZ8RvIN0c.jpg",
               "id": 75912,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Kim Joong-san",
               "gender": 2,
               "credit_id": "55883f13c3a368729a0001dc",
               "name": "Yoo Hae-jin",
               "profile_path": "/3M3r6x9Po79fbQYohwS4BicqMPf.jpg",
               "id": 84996,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Eun-joo's father",
               "gender": 0,
               "credit_id": "55883f19c3a36872a20001f8",
               "name": "Song Young-chang",
               "profile_path": "/dOnYp40NiTQGxPIlcu0Qivd5ZQF.jpg",
               "id": 88298,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Eun-joo's aunt",
               "gender": 0,
               "credit_id": "55883f20c3a36872a40001e1",
               "name": "Jang Young-nam",
               "profile_path": "/r4iJak5mZUWyzo3Ts1iPfGuGW15.jpg",
               "id": 93996,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Fortuneteller Baek",
               "gender": 0,
               "credit_id": "560666df9251413055001591",
               "name": "Lee Jae-yong",
               "profile_path": "/3iH0jsZu5WLoSH1GERmnvGBGIld.jpg",
               "id": 68904,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Gil-yong's wife",
               "gender": 1,
               "credit_id": "560666ebc3a368120d001595",
               "name": "Park Hyo-ju",
               "profile_path": "/iXyazjqokjdfM89ZM2Jejsz2gFG.jpg",
               "id": 939135,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55883f01925141619f000210",
            "name": "Kwak Kyung-taek",
            "profile_path": "/qKMuttRJAy8DBsXzbo4Zx1ALkpA.jpg",
            "id": 84998,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.027011,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 344476,
      "vote_count": 10,
      "budget": 0,
      "overview": "Busan in 1978. Gil-young, a veteran detective got the special request from the parents of a missing child, Eun-joo to investigate her case. As the clever kidnapper eludes the police, the case becomes more and more of a mystery. When Joong-san, the fortune-teller foretells Eun-joo’s whereabouts, people get to listen to what he says as the situation goes more despair with no remark on Eun-joo. He also tells that Gil-young is the only one who can save her. With no one to trust, Gil-yong and Joong-san come closing in around the kidnapper using any means possible. This movie is the record of 33 days of two men going through hell to find a missing girl and bring her back home alive.",
      "similar": [
         2163,
         275,
         8067,
         74997,
         562,
         4771,
         333371,
         264644,
         446791,
         270487,
         33107,
         8834,
         1571,
         193893,
         14869,
         984,
         398175,
         25376,
         9039,
         2320
      ],
      "original_title": "극비수사",
      "runtime": 108,
      "poster_path": "/jYxWcFew01XCMde9ZbeYLvekGG9.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [],
      "release_date": "2015-06-18",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "33 days of missing, nobody but them believed she's still alive.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": "KRW ",
      "directors": ["Kyung-taek Kwak"],
      "runtime": 108,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt4791594/",
      "coverLink": null,
      "actors": [
         "Yun-seok Kim",
         "Hae-jin Yoo",
         "Young-nam Jang"
      ],
      "reviews": [
         "I found this movie on IMDb while searching for something good to watch. The Koreans have always managed to make good serial killers/kidnapper movies featuring a washed out and hardened detective frequently and this movie is no expectation. The story starts when Eun-ju a, little girl is kidnapped from her school. Her mother visits Kim, an astrologer, who is not so well known by now. As per his calculation only a man born in a certain year and month can solve the case. Gong a hardened and honest to the core cop is then roped in by the rich parents and his fate collides with the the little girl and astrologer. They embark on a quest to find the kidnapper and get the girl back home safety against all the odds and their department which believes that the child has already been killed. If you look at the story it wouldn't seem that interesting and different, and i agree. What sets it apart is the acting and the way the plot unfolds. The pacing of the film is brilliant and though it is not an action thriller that will keep you on the edge your seat it manages to hold you attention through out the duration. The kidnapper is not shown to be a super human and their aren't a lot of fighting sequences. But the even fewer and smaller action sequences have been done in a gritty and realistic way. The only sore point for me was the inclusion of an astrologer and showing that his predictions were somewhat accurate. But i ignored it as this is supposed to be true story and some of it must have been based on real facts. Although i couldn't find any concrete material about the kidnapping when i goggled it. That being said this is a very enjoyable film nonetheless and every korean thriller junkie should give it a go.",
         "Movie: The Classified File (Geukbisusa)(15) rating: 4.5/5 South Korean movies are easy to relate to. The reason? Their realistic portrayal of events, characters, behaviours, action, thrills, and of course, story. From the bunch of various powerful South Korean films comes out a realistic, captivating and effective crime drama THE CLASSIFIED FILE. Directed by Kwak Kyung-taek and starring two master actors Kim Yoon-seok and Yu Hae-jin, this film draws your attention right from the beginning and compels you not to get up until it ends. With a not-so-long running time and a crisp editing, it becomes an even more exciting watch as time passes. The story and screenplay are well written, well portrayed and well presented in terms of entertainment too. The dialogues are quite powerful and many of them make a great sense. The action scenes are executed very well and in a very realistic way. In other words, this film is just another South Korean film which makes us think. The visuals and the cinematography too are excellent and eye-pleasing. Actors Kim Yoon-seok and Yu Hae-jin are a major strength of this film. The way their bond strengthens is good to watch. Both actors deliver powerful performances and you tend to believe that they aren't acting but indeed living the characters. It's undoubtedly true that THE CLASSIFIED FILE turns out to be both an artistic and entertaining film at the same time. Those who believe in watching good cinema, should definitely watch it. Since there's no vulgarity or obscenity, it's a clean family entertainer and hereby recommended for all ages, and because apart from telling an engaging story, it also has a unique message hidden for all. I classify it as excellent.",
         "I will just say this.. Korea makes the best movies by far than any other country, especially there drama's and crime films. This movie takes you through so many turns and is so beautifully thought out that its just amazing it didn't receive more attention abroad.So much detail and focus on each and every character you wiggle in your seat trying to help but know you cant! I love these kind of films where every character is carefully considered and its just not one main character stacked on top of everyone's work.It gently drives your mind crazy throughout while breaking your heart in parts only to build your interest in there investigation. I will watch this movie again and again excited to share with family as well. I truly wish American film makers would set aside the comic books and get back to making REAL movies like this one!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": [
         "A veteran detective receives a special request from the parents of a missing child to investigate her case. As the clever kidnapper eludes the police, the case becomes more and more of a mystery. When a fortuneteller foretells the child's whereabouts, people get to listen to what he says. He also tells that the detective is the only one who can save her. With no one to trust, the two come closing in around the kidnapper using any means possible.",
         "A detective and a fortune teller join forces to find a kidnapped child whom none expects to be alive."
      ],
      "budget": 5500000000
   },
   "movielensId": 142803,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2015-06-18",
      "dvdReleaseDate": null,
      "directors": ["Kwak Kyung-taek"],
      "runtime": 108,
      "movieId": 142803,
      "title": "The Classified File",
      "mpaa": null,
      "actors": [
         "Kim Yoon-seok",
         "Yoo Hae-jin",
         "Song Young-chang",
         "Jang Young-nam",
         "Lee Jae-yong",
         "Park Hyo-ju"
      ],
      "imdbMovieId": "4791594",
      "originalTitle": "극비수사",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Busan in 1978. Gil-young, a veteran detective got the special request from the parents of a missing child, Eun-joo to investigate her case. As the clever kidnapper eludes the police, the case becomes more and more of a mystery. When Joong-san, the fortune-teller foretells Eun-joo’s whereabouts, people get to listen to what he says as the situation goes more despair with no remark on Eun-joo. He also tells that Gil-young is the only one who can save her. With no one to trust, Gil-yong and Joong-san come closing in around the kidnapper using any means possible. This movie is the record of 33 days of two men going through hell to find a missing girl and bring her back home alive.",
      "tmdbMovieId": 344476,
      "avgRating": 3.375,
      "releaseYear": "2015",
      "numRatings": 8,
      "posterPath": "/jYxWcFew01XCMde9ZbeYLvekGG9.jpg"
   }
}