{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "exploitation",
            "id": 2804
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt0068471",
      "video": false,
      "title": "Delirium",
      "recommendations": [
         110022,
         118287,
         90590,
         29039,
         39020,
         47345,
         26196,
         26504,
         68146,
         27551,
         27439,
         77173,
         5434,
         42455,
         63025,
         84251
      ],
      "backdrop_path": "/96RpbIqNbEOFeGN6gARBDvNyJjR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Herbert Lyutak",
               "gender": 2,
               "credit_id": "52fe458cc3a36847f80cd88f",
               "name": "Mickey Hargitay",
               "profile_path": "/ctpJOiv4tDEmbFV4suVIpt3PLqp.jpg",
               "id": 116839,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marcia Lyutak",
               "gender": 1,
               "credit_id": "52fe458cc3a36847f80cd893",
               "name": "Rita Calderoni",
               "profile_path": "/pA4QpuahXbphfsx1IJSNS1xAoS8.jpg",
               "id": 27389,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Inspector Edwards",
               "gender": 0,
               "credit_id": "52fe458cc3a36847f80cd897",
               "name": "Raul Lovecchio",
               "profile_path": null,
               "id": 240915,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "John Lacey",
               "gender": 0,
               "credit_id": "52fe458cc3a36847f80cd8a1",
               "name": "Tano Cimarosa",
               "profile_path": "/x4A4eKik5JxvHWjj9828MgpkzGM.jpg",
               "id": 103627,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Joaquine",
               "gender": 0,
               "credit_id": "5652e011c3a3686afd002818",
               "name": "Christa Barrymore",
               "profile_path": null,
               "id": 1092872,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Laurel",
               "gender": 0,
               "credit_id": "5652e03d9251417a7b002936",
               "name": "Cristina Perrier",
               "profile_path": null,
               "id": 1092876,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Bonita (U.S. version only)",
               "gender": 0,
               "credit_id": "5652e07ec3a3686aef0029fa",
               "name": "Carmen Young",
               "profile_path": null,
               "id": 1539712,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Miss Heindrich",
               "gender": 0,
               "credit_id": "5652e0adc3a3686b03002ae0",
               "name": "Katia Cardinali",
               "profile_path": null,
               "id": 1539713,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe458cc3a36847f80cd88b",
               "name": "Renato Polselli",
               "profile_path": "/4PBAZQKp8tjSW0VXCSc1gYcAUUe.jpg",
               "id": 105343,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe458cc3a36847f80cd89d",
               "name": "Renato Polselli",
               "profile_path": "/4PBAZQKp8tjSW0VXCSc1gYcAUUe.jpg",
               "id": 105343,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5652e0fec3a3686b00002cd7",
               "name": "Ugo Brunelli",
               "profile_path": null,
               "id": 1092879,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5652e1239251415dc5000dd7",
               "name": "Otello Colangeli",
               "profile_path": null,
               "id": 40889,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.74928,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 40345,
      "vote_count": 7,
      "budget": 0,
      "overview": "A respected doctor becomes the prime suspect in a series of gruesome murders.",
      "similar": [
         357096,
         979,
         281,
         948,
         281957,
         3134,
         45569,
         123109,
         285840,
         15069,
         26390,
         8090,
         4771,
         238636,
         553,
         395834,
         588,
         1949,
         3597,
         12619
      ],
      "original_title": "Delirio caldo",
      "runtime": 102,
      "poster_path": "/jWMIVcADu82pUvA734fIb8JAOjp.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "G.R.P. Cinematografica",
         "id": 12727,
         "origin_country": ""
      }],
      "release_date": "1972-07-05",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Renato Polselli"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Renato Polselli"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0068471/",
      "coverLink": null,
      "actors": [
         "Mickey Hargitay",
         "Rita Calderoni",
         "Raul Lovecchio"
      ],
      "reviews": [
         "Whenever I take a look at today's big multiplex cinemasm playing nothing but dreck, I'm really happy, that, in better times, films like this one have been made: \"Delirio Caldo\" is a sick, a-logical and hilariously funny thriller, the nightmare of any \"cineaste\". There's lots of violence, psychedelic colours, stylish cinematography and enough of that naive \"misogyny\" prevalent in 70ies cinema to make any PC-feminists break out in tears. What else could one ask for? Be sure not to miss this treat. And, by the way, watch the continental cut, as the english-dubbed version has been shorn of nearly 20 minutes of fun!",
         "Not exactly a movie for the kiddies, I would consider 1972's Delirium to be some what of a grade B Giallo. The production is okay, the acting not bad, the dialogue average, but the violence is over the top with several grisley murder scenes. There is also way more nudity than your average Giallo. There are two versions, the American (85 minutes) and the European (102 minutes). The American version starts out with the main character, Herbert Lyutak, getting wounded in Vietnam. The movie mixes stock footage from the war with newly filmed scenes in a pretty ungraceful job of editing. But we do learn that Herbert was born in Hungary and immigrated to the US in 1961 and joined the army in 1962. He has done three tours of duty in Vietnam and is a decorated, model soldier. He has been wounded and is being taken away in a helicopter. He is looking at a nurse and she changes into another woman who we soon find out is his wife, Marcia, played by the lovely Rita Calderoni (The Reincarnation of Isabel, Nude for Satan). Right after the credits we get to see Herbert pick up a girl in a bar and drive her out to a remote spot, chase her into a stream and then strip her and beat her to death. It's a pretty violent scene and not for the squeamish. Of course that could apply to almost every murder in this movie. The European version really is quite different than the American release and I thought it had a more coherent story. Both versions are a bit confusing but the European version is more consistant. It also skips the whole Vietnam segment which wasn't very well done anyway. The endings are both quite different as well and a couple murders are filmed differently also. I don't want to give away too much but we do know that Herbert murders a girl at the beginning of both versions and after that it is a bit of a cat and mouse with the cops who are trying to solve the murders along with Herbert who is a criminal psychologists and suposed to be helping them in the investigation. His wife starts having weird S&M dreams invloving her husband as the sadist and their maid and another woman who we later find out is her niece. Ther three women fondle and kiss each other while Herebert watches. The editing from the dreams to reality is a bit confusing and at one point early in the film Herbert does beat and cut Marcia as a substitution for sex which he can't perform with his wife. He does seem troubled about his violent tendencies and does not want to unleash his murderous ways on his wife. But he does like looking at her throat which is a very enticing part of female anatomy for him. The picture on the European version looks fine and is presented in 1.85:1 widescreen. The American version however is missing a couple sections of the original so Anchor Bay had to take some Dutch footage from a VHS copy and splice it in. So you are watching and all of a sudden the picture gets worse and there are Dutch subtitles! But we are talking only a couple minutes worth so it is pretty minor actually. There is also a recently filmed 14 minute interview with director and writer Renato Polselli and Actor Mickey Hargitay which is pretty good really. I watched the US version, then the interview, and then the European version of the film. I did have more of an appreciation for the film after the watching the interview and as I said earlier, the European version is overall a better and more coherent storyline. The US version is dubbed in English and the European version is in Italian with English subtitles. Overall not too bad if you like extreme Giallo. Not nearly as good as say, What Have You Done With Solange, or most Bava's or Argento's, but certainly worthy of $15 or so.",
         "Thanks to a certain gray market outfit in south Florida that searches for obscure videos, I got stuck with the shorn American print of this movie, but it does have some very ridiculous added \"Vietnam\" footage which might make it the first movie ever to deal with the fallout from that war. A deranged Vietnam vet and forensic psychologist is driven by his traumatic war experiences (and implied impotence) to murder mini-skirted Italian co-eds (just like he did in 'Nam I'm sure). His loyal wife tries to cover up for him the only way she knows how. Mickey Hargitay is the name star. After seeing \"Bloody Pit of Horror\" I had no trouble buying him as a deranged killer, but a police psychologist?--c'mon. Mickey had apparently been making bad movies in Italy for so long by this point that he'd started speaking with an Italian accent. (Seriously, why did they cast third-rate American actors in these movies and then dub them when they're speaking English?). Rita Calderoni plays the wife. She wasn't a bad actress, but the enjoyment of her performance varies inversely with the amount of clothes she is wearing, and she's a little overdressed here (if you want to see a lot more of her check out the appropriately named \"Nude for Satan\"). There are also a lot of anonymous Italian girls in impossibly short minis (unfortunately, this is exactly the kind of sleazy movie that looks up their skirts while they're being strangled or shows them topless after they're dead). There's also a strange, recurring dream sequence where a shirtless Mickey strangles himself with a chain while his naked wife, maid(!),and college-age niece(!!) all writhe around on the floor at his feet. Anchor Bay apparently has included both this version and the longer European version on their legitimate DVD and it costs half as much used as what the more unscrupulous bootleggers are charging. Avoid just getting the American version, but I would recommend this to moral degenerates who enjoy this kind of sleazy, Italian-made filth (you know who you are).",
         "This is nasty stuff. Surprisingly strong for a 1972 movie, Polselli's over-complex and contrived giallo happily depicts what other people would only dare hint to in a number of jaw-droppingly misogynistic scenes of sexual violence. In one remarkably unpleasant scene, a black gloved killer masturbates a female victim as he strangles her. I find it surprising that movies like NEW YORK RIPPER are so infamous when extreme stuff like this and GIALLO A VENEZIA exist. It's quite amazing that these films were made at all, let alone had a cinema release! Focusing away from the violence, this is actually a pretty well made and tight giallo. Whilst a lot more sleazy than some of the classy entries into the genre, Polselli hits the viewer with some relatively innovative scenes and camera-work. The plot is hilariously winding- I won't give too much away, but fans of the more ridiculous giallos will not be disappointed. There is also a definite undercurrent of black humour, particularly in some of the scenes of violence. I think it is safe to say that the misogynistic humour will be left misunderstood by most. Unfortunately, DELIRIUM fell victim to distributor re-cutting in a big way. The American version is hugely different to the original Italian release, losing a lot of violence, gaining some new footage, and asa result suffering quite marked changes to the plot itself! The different versions are really quite different, and I'd advise any giallo collector to check out both. By all accounts, the French print of the movie is the most complete \"uncut\" form. Definitely worth a look for fans of giallos and of good, honest cinematic scum.",
         "The English-language print of this movie is incoherent. It adds stupid Vietnam footage throughout and cuts out all references to the fact that it takes place in England, as well as all the sexual violence, the lesbian relationship between the killer's wife and her maid, and the killer's \"masturbation\" scene. In the European version there are three killers but here there are only two, and the ending is completely different. The American version adds two murders that were left on the cutting room floor of the European version, but they're unimportant to the story. The final third of this movie has sequences that are basically incomprehensible and the film ends with a tacked-on series of stills from different sex scenes from the film! This may have satisfied the grind house audience of the Seventies but nearly thirty years later it just seems tame and silly. Anchor Bay needs to find the full version of this one and get it out on dvd. As it stands now it's a disappointment.",
         "Our good friends over at the Wikipedia website define the term \"Delirium\" as follows: an acute and relatively sudden decline in attention-focus, perception, and cognition. It is commonly associated with a disturbance of consciousness. Fair enough! That appropriately describes both the main characters' behavior in this film and the spontaneous reactions of us, the viewers! The least you can say about \"Delirium\" is that it is one strange movie. Not just the plot lines and character drawings are demented and - oh yeah - delirious), but even the cut, edit and release treatment it received back in the early 70's was highly unusual and peculiar. There exist two principal version of this film, which both feature on the fancy Anchor Bay release, namely the original Italian \"Director's Cut\" and the heavily altered American version. Most of the reviews and user-comments I encountered avidly discourage people to watch the American version, but I on the other hand, feel that BOTH versions are essential viewing. If possible, you should even watch one straight after the other, filter different aspects & sub plots of both versions together and mentally edit them back together in order to make up your very own final cut! Granted, the American version opens and finishes with a completely goofy and irrelevant Vietnam-trauma sub plot (illustrated through ancient recovered footage with Dutch subtitles!), but it also contains at least one supplementary and highly engrossing killing sequence and \u0096 in my humble opinion \u0096 the grand finale twists make much more sense here than in the original version. The director's cut is far gloomier and digs deeper into the main characters mental background, but it only just becomes a true Giallo highlight when mixed with elements of the American cut. Now, don't immediately fear that \"Delirium\" is an overly complex and inaccessible Giallo because of all this driveling about versions, because it's not! It's your basic and wondrously demented early 70's Giallo, rich on perverted themes, nudity & sleaze, sadistic killings and far-fetched red herrings. The story opens promising with a hunky middle-aged guy (real-life body building champ Mickey Hargitay) picking up a teenage girl in a bar and savagely murdering her in the middle of a mudflat river. Usually the purpose of a Giallo is to keep the killer's identity secret until the climax, but Renato Polselli clearly doesn't bother to do this. The first and highly ingenious twist promptly comes after the intro, however, as the same guy who we just witnessed committing a murder turns out to be a criminology psychologist. He, Herbert Lyutak, cooperates with the police regarding the series of disturbing murders, which naturally puts him above all suspicion. We also meet his wife Marcia, who loves him to death, and his horny housemaid who not so secretly craves for his body. We also learn a bit about Herbert's sexual-related issues that clarify his murderous tendencies. More gruesome murders of sexy young coeds follow; only now Herbert always has indisputable alibis. Is there suddenly a copycat killer? Does Herbert have an evil twin brother? The outcome of this riddle is fairly logic and easy to predict, but Polselli nevertheless maintains an admirably high level of tension and involvement. He inserts inventive sub plots (like vivid hallucinations of lesbian-laughter orgies and the innocent prime suspect's private investigation) and you undeniably look forward to each next gory murder that waits just around the corner. The soundtrack in this particular Giallo is slightly below average, but the photography is beautiful and surprisingly artsy considering the low budget, with an imaginative use of colors and POV shots. Even after starring in numerous low-keyed Italian smut movies (including the decadent \"Bloody Pit of Horror\"), Hargitay remains a horrible actor, but at least \"Delirium\" stars a series of indescribably hot wenches, and they all willingly takes their clothes of in front of the camera. This is a fabulously sensational piece of Italian cult cinema and comes highly recommended to fans with a healthy sense for adventure.",
         "The best translation for \"Delirio caldo\" would be hot delirium. When a desire (specially when it is a deep desire) is not fulfilled, it may turn into delirium. The film begins with sexual violence followed by murder and the identity of the killer is revealed right away. Well, I'm not giving anything away - this is the very beginning of the film. The killer is Dr. Herbert Lyutak (Mickey Hargitay). And this murder is just another one of a series of murders committed against pretty girls. When Dr. Herbert Lyutak returns home, his wife Marzia (beautiful Rita Calderoni) is waiting for him. Their marriage is not working, but she loves him very much. Marzia has suspicions about his alternative life, but she'll do everything for him. Other murders will happen and suddenly we are not so sure anymore about who really is the murderer. There are other characters, such as Joaquine (Marzia's niece) and the maid who works for Dr. Herbert and Marzia. Dr. Herbert is a psychiatrist that, ironically enough, helps the police in their investigations. From then on the story will unfold in many directions. \"Delirio Caldo\" is a very sensual film. The actors are committed to their roles. Rita Calderoni seems to melt all over when touched by Mickey Hargitay - Her liquid eyes roll and seem to vanish in an expression of ecstasy. Marzia dreams a lot. In her night dreams strange and erotic visions go through her mind, but in her daydreams, Marzia conjures kitschy visions of a normal happy life. Marzia's niece, Joaquine (Christa Barrymore) has also intense feelings for someone and even the maid will have her moment of divine ecstasy. The soundtrack is very good and underlines the different moods of the film - frenzy, tenderness \"noir\", romanticism etc.. \"Delirio Caldo\" is at the same time wild, tragic, pathetic and romantic, if I'm allowed to use so many adjectives. Open up your heart and mind and see this sensual and delirious masterpiece.",
         "DELIRIUM (Renato Polselli - Italy 1972). If it's sleazy '70s exploitation you're looking for, packed with sexual violence and some truly twisted proceedings, look no further. I've watched some weird stuff in my lifetime, but this one truly hits the mark. Clearly, Polselli is a first-class hack and this is an incredibly shoddy piece of work, but somehow it was compelling enough (or just plain weird) to keep watching. I'm not sure though what that says about the film's qualities. At least it says something... Hungarian muscle man Mickey Hargitay is criminal psychologist Dr. Herbert Lyutak who picks up a sweet young thing at a local bar, and gets the uncontrollable urge to strangle her at the sight of the girls legs. This is one wacky doctor that turns out to be a homicidal maniac, or is he? The local police doesn't suspect him, that's for sure, and treat him with the utmost respect. As a criminal psychologist, they even consult him to catch the culprit. The investigating police officers don't seem very trustworthy of a murder investigation. The one in charge is a skinny, somewhat suspicious looking chap, wearing a garish red blouse through the entire film (this is 1972, ya know). His assistant is a seriously groovy dude, impeccably coiffured with a perfectly trimmed beard and wearing some very cool Italian suits. No, he does not look tacky at all, the latest fashions is all he wears. But this was the English countryside, I digress. The primary source of income for the local female population seems to walk the streets, mostly on deserted country roads or the village square, where they don't seem to do a lot of business. It's only a small village, after all. But it's very convenient for deranged sex killers with a taste for young women. Problem is, our two police officers haven't got a clue how to crack the case. Even after the fifth killing, the two detectives come little further than exclaiming this is yet another identical case. They come up with the luminous idea of using some woman as bait (she was actually not just someone, but I can't remember) who is also killed, but these two don't hesitate to use this tactic again and employ some more female bait. To complicate matters, Dr. Lyutak's beautiful wife (Rita Calderoni) is tormented by visions of medieval torture and lesbian orgies, a perfect excuse to throw in some more naked female flesh and gratuitous torture scenes. Rather distracting is the film's English setting, unconvincingly done as usual in Italian films, since the film excels in very picturesque outdoor scenes in the Italian countryside and even a shot from a roof that immediately betrays the location as Rome(!). To make up for its completely nonsensical \"plotline\", Polselli throws in three killers(!) and since there are no likable characters in the film anyway, the only way to watch this is for an almost continuous wacky stream of hallucinations involving torture SM-style, chain whipping, bondage, masturbation and lost of killings of course. It's a glorious mess, but Polselli keeps the action going, so it's never really dull. Anchor Bay presents this as an \"astonishing 1972 oddity by the notorious Renato Polselli (under the pseudonym Ralph Brown).\" Well, this oddity is presented in both the Italian and U.S versions, which are radically different. The American version opens with Vietnam footage explaining how Dr. Lyutak got his trauma, an explanation completely lacking in the Italian version. Regarding the American version, Anchor Bay neatly explains the original Vietnam footage was lost and some of this footage was taken and inserted in this version from a Danish VHS-copy and is presented with subtitles. To my surprise, it's actually a Dutch copy they used here, the subtitles were unmistakeably Dutch. Furthermore, in the American version, Hungarian born Mickey Hargitay's own voice is used (he only spoke English, no Italian), but his accent is even thicker than Arnold Schwarzenegger in his early days (which Hargitay humorously admits in an accompanying interview), so it's very hard to understand what he's saying. Incidentally, Schwarzenegger would even play Mickey Hargitay in the 1980 film THE JAYNE MANSFIELD STORY! In any case, the Italian version is taken from a much better print, so I'd advise anyone to start with that one. Camera Obscura --- 7/10",
         "Sensationally sleazy giallo with loads of fab 70's gear worn by the men as well as the women and stacks of lurid action. When it's not sex or death on the screen, then it's shades of S&M in the cellar with chains, whips and other implements. Great looking, well OTT, eyes wide open shocker. Vivid killing in waterfall at the start sets the tone and we never look back, even the dead must have their clothing arranged in the sexiest possible way. Delirious ending but then this movie is true to it's title all the way. Perhaps the directing is not as stylish as some giallo and the music is rather muted. Some of the performances, especially towards the end are a bit uncontrolled but this is undeniably a very wild ride from start to finish.",
         "Major Spoilers!!! DELIRIUM is more like a trashy, super sleazy twisted soap opera than a giallo. The overwrought direction/script/acting/sleaze sends DELIRIUM in the irremediably silly and worthless category. If you thought BASIC INSTINCT was misogynistic in its view of women and lesbians, you have seen nothing yet compared to what DELIRIUM has to offer. Every woman is a \"helpless\" killer or a helpless victim. They're all lesbian, unfaithful, and insane. And more importantly, naked. This might sound shocking to some and some scenes do shock a little but it's because the film/scenes are more annoying than anything else. DELIRIUM is very typical 1970s Italian provincial style of film-making. The overacting and over everything is something more akin to the style of acting seen in cheap Italian soaps than movies, which is why DELIRIUM ends up looking like a twisted version of DAYS OF OUR LIVES. The story and direction are remarkably convoluted and confusing, and deliberately so. This in order to hide the obvious potboiler storyline: An important and rich doctor is married to a beautiful young woman. The problem is, the doctor is IMPOTENT and the wife is still a VIRGIN. The two have never consumed their marriage (gasp!). The frustration of being an impotent man married to a virginal wife is shown as the main reason for the doctor's dementia and why he goes around killing young women, as seen during the opening sequence when he brutally kills a young girl in river. After this murder, the doctor becomes a suspect and is interrogated by the police. The wife, who knows her husband is the killer, is madly in love with him, and will stand by him no matter what. As the police are interrogating him, another woman is strangled at a phone booth. Because of this one murder (and subsequent murders), the doctor is not seen as the main suspect anymore. Who is behind these new murders? Who doesn't want the doctor to be found guilty by the police? Who wants to protect him? Yes, you've guessed it. The wife, of course. The story is so melodramatic and stupid that the film actually tries to make the sick doctor look like the hero by the end of the movie by portraying every woman (the wife, her friend and the maid) as total nut cases and whores. The doctor's massive serial killing streak (at the beginning of the film, we are told that there had already been 17 murders) is suddenly trumped by the protective wife's recent serial killings. Needless to say, the end result makes it look like that it's okay if a man kills tons of whorish women because he's impotent, but it's wrong for whorish, insane women who kill for love. But the really funny thing about all of this is that even though the wife is shown to be totally devoted to her husband, to the point of wanting to kill in order to save him, she is having an affair with the maid AND her best friend. This begs the question: how much in love is she really with her husband if she's having sex with two women? I guess the virginal wife needed to get her kicks somewhere. So, the husband kills because he's impotent (what's with Italian movies and impotence anyway?). And the virginal but whorishly bisexual wife kills because she loves & wants to save her impotent, serial killer husband. Does that make any sense to anyone?!?! The storyline is so divorced from logic that it's pointless trying to make any sense of it. Throughout the movie, we see the wife crying because their marriage is less than perfect. Boo-hoo! Who freaking cares. I don't know what kind of message the movie tries to send (if any) but it seems to say that having a fulfilled marriage is the ultimate raison d'etre in life. Yeah, sure! And to think, all of this mayhem could have been prevented if viagra had existed back then. Anyway, to make things even worse, not only is the direction convoluted but, technically speaking, it's really terrible too. Some scenes are totally disjointed. In one scene, the husband is fully clothed. In the next scene, he's bare-chested and seemingly naked. The sloppy editing and direction reminds me of the style of direction seen in old Bollywood movies, where people would be seen entering an elevator with one type of clothes and leave the elevator with a totally different wardrobe. Those looking for sleaze might get a kick out of DELIRIUM but the trashy romance style of film-making might hinder any fun to be had from the shameless exhibitionism on display from time to time. Watching DELIRIUM is a more frustrating experience than an entertaining one, even in the \"it's so bad it's good\" way. I know, you can't take a film like this too seriously but that doesn't change the fact that it's almost totally worthless. The only good thing about this crappy, twisted soap-opera-disguised-as-a-giallo is the beautiful Rita Calderoni. She's one of the most beautiful women I've ever seen. She even comes out looking pretty good from this stinking pile of crap, which is hard to believe!",
         "I thought that the impious happenings in the Reincarnation of Isabelle couldn't be surpassed. Well I proved myself wrong after I witnessed this little picture. Although i enjoyed the film, I felt a little disappointed at times. I thought that the character of Rita Calderoni was a little over the top and i just expected more with the sexual content. The dialogue became a little risible at times and the plot to predictable. I didn't care for the ending either but overall it worked. Don't forget to check out the domestic release that is featured on the anchor bay dvd and witness for yourself how the Americans can destroy a film.",
         "As I've written any number of times, one of the things I enjoy most about Italian films is their convoluted plots. I've rarely run across a Giallo that I have difficulty making sense out of after it's over. But I've met my match with Delirium. It's a movie that I'm definitely going to have to watch again to fully comprehend what's going on. From what I did get out of the movie, Delirium is the story of a police psychologist investigating a string of murder that he himself may be responsible for. A number of young girls are killed in a variety of explicit and shocking ways. The doctor's wife appears to understand her husband's madness, but is so in love with him that she actively protects him. But can she also protect herself either from her husband or from going mad? (At least this is what I think the film is about.) Those interested in a variety of explicit and imaginative kills should find something to enjoy in Delirium. My \"favorite\" may be the first when the girl is stripped and killed in the river. As he proved in Bloody Pit of Horror, Mickey Hargitay could play a completely insane, over-the-top killer with the best of them. He may not have been the greatest actor in the world, but I certainly appreciate the passion and energy he brought to his films. If you're more into the sex aspects of Gialli, there's plenty of that found in Delirium. The most obvious example is the dream sequence where Hargitay is chained by his neck and forced to watch his wife, his niece, and his maid engage in a sexual romp. But, if you watch Gialli for the mystery aspects and to try to figure out \"who done it\", as I've indicated, Delirium may not be the best Giallo for you.",
         "The late bodybuilder/actor Mickey Hargitay stars as a criminal psychologist moonlighting as an unstable sex maniac who murders mini-skirted young women because of his impotency. The luscious and full-figured Rita Calderoni plays his beautiful wife who starts suffering from nightmares of medieval torture and lesbian orgies. The two leads are unwittingly pawns in this muddled, if hypnotic oddity of Italia sleaze that won't please the fainthearted but will delight grind house hounds. After viewing this film a second time, there are some flaws that I would like to point out. Renato Polselli (under the pseudonym Ralph Brown) directs with such competent gusto in a blatant attempt to explore the deeper psychosis of Hargitay and Calderoni. The dialog is so painfully uninspired and over-dramatic that it felt like a demented version of Mexican soap operas. On the positive side, Ugo Brunelli's psychedelic cinematography perfectly captures what it's like for the audience to be trapped in hell. And if you thought the murder scenes were bad, take a gander at the lesbian fantasy sequence if you dare. The Blue Underground release, obliviously a reprint from the Anchor Bay DVD, contains two different versions of DELIRUIM. The crappy, dubbed American version makes it worse with tacked on beginning and end sequences of Hargitay's psychological trauma as a soldier serving in Vietnam. The coherent, Italian language version contains more explicit material and different subplots which is a slight improvement to the latter cut. As a recommendation, the longer 102-minute cut is probably the best version to go for.",
         "Some Giallo's try to tell a serious story, while others are happy to revel in the sleaziness of their absurd plot lines. Renato Polselli's attempt at the genre may not be very strong in the story department, but this is made up for with an onslaught of nudity and sexual violence and if you like your Giallo's to be wayward; Delirium is an absolute dream film! The film exists in two versions; an American cut, and an uncut European version, the latter of which was, of course, the one that I saw. I've not seen the American cut as I have it on good authority that it's the inferior version, and I can certainly believe that as the European market has always been more accepting of sleaze and nudity, and I imagine that most of it was cut for the stateside release. The plot is one of the most convoluted I've ever seen, and follows a police psychiatrist that murders young women in the most brutal ways possible. His wife takes pity on him upon discovering his secret, and naturally, the police enlist his help to solve the case; but when the murders continue, the psychiatrist isn't sure that he's still the one responsible. Director Renato Polselli had a low budget to work with on this film, but he masks this brilliantly with an array of stark and contrasting colours, which give the film it's arty credentials, and provide some truly stunning imagery for the viewer - case in point; the sequence that sees a young woman strangled in a bathtub full of bold blue water! Mickey Hargitay gives a strong lead performance and always convinces as the psychopathic doctor. He is joined by Polselli regular Rita Calderoni, who looks hot in the role of his wife. The plot is complicated, and the director doesn't always seem keen to provide the viewer with a story, as the focus is always on the brutal murders and scenes of sexual torture, which can mean that it gets a little dry at times. But it all comes good by the end, as despite the fact that we know who the killer is from the beginning; Polselli still manages to pull a couple of surprises out the bag! The ending takes in all the main characters, and I won't hesitate to say that the final fifteen minutes are as good as Giallo gets. Overall, Delirium comes highly recommended to Giallo fans as there's nothing else quite like it!",
         "This is a somewhat crazed and depraved giallo. The Anchor Bay DVD contains both the international and the American versions of the film. Both are very different. The U.S. version has a Vietnam War framing device similar to that used in Jacob's Ladder almost 20 years later. It also contains two more murders and is slightly more coherent than the international version, despite being about 20 minutes shorter. But both versions of Delirium are, well, delirious. The film concerns a homicidal doctor who is a serial murderer of young women. Just when he starts to be questioned by police for his involvement in the killings another maniac starts a murdering spree that confuses the issue. The whodunit aspect of this movie is a little obvious. So the mystery element is less important. Instead, the film works best as a demented series of shock scenes, all strung together by a loose plot. The editing is not very good but it adds a bit to the haphazard nature of the film as we are jerked around from scene to scene. The music score by Gianfranco Reverberi is very effective in sustaining the delirious atmosphere. This is a very sexually explicit giallo. There is a multitude of female full-frontal nudity on display. The murder scenes are often pretty misogynistic, not something uncommon to the genre, but a little more extreme here than normal. There are also some well shot S&M dream sequences that feature writhing naked women! The plot is a little over-convoluted. Once again, this is a common giallo feature but, again, more-so here than normal. It can be quite difficult to follow the narrative as the story is all over the place. This fact is made even more apparent when watching both versions of the movie, you will see that scenes are ordered quite differently. Overall, this giallo movie is weak on narrative but compensates for that with, well, excess. The effect is a film that is true to it's title. It really is delirious.",
         "Renato Polselli's \"Delirio Caldo\"/\"Delirium\" is a sleazy giallo made in 1972.Of course the film isn't as good as Dario Argento's masterpieces but if offers plenty of sleaze to satisfy fans of Italian smut.The acting is pretty bad(really,this time it's horribly over-the-top,not even amusing!),but some killings are pretty nasty.According to my reliable friend the original edit of the film(the true \"director's cut\")is the Italian version that is on Anchor Bay's DVD release.The French video version under the title \"Au Dela Du Desir\" is the most explicit version available.This version,which is not the director's intended original cut has extra footage shot for a European market that demanded more X-factor in content.There are at times extra seconds to the violence and some much stronger sexual content(such as the bath murder where the victim enjoys the assault,even allowing herself to be masturbated with the end of a whip and sucking it before being lashed savagely to her death!).The re-arranging of the order of some sequences as well as the usage of alternate edits and new footage does create a different tale to an extent...Anyway,give this one a look.Oh,and Rita Calderoni is very cute.",
         "This is just nasty. Micky Hargity plays a psychologist who is helping the police investigate a spate of killings of young woman, only they don't know that he is the killer! We first get to see Hargity endear himself to us by bludgeoning a young woman to death under a waterfall. Which quickly sets the tone for this nasty film. This is after he failed to rape her, mind. Hargity is a killer, sure, but what do his closest kin think? His wife is sexually frustrated and regularly imagines bizarre lesbo/sado-mach trysts between herself and her hubby, but then Hargity's maid gets all hot about it all and starts feeling herself up (including some shoulder licking for some reason!). There's also someone that gets so worked up they start killing folk, which alarms Hargity as he's also a killer, like. It was hard enough to keep track of things without the aid of coherent subtitles, but then again the general tone of the film isn't hard to grasp either. This is a giallo with some very nasty deaths thrown in. You know what: I'm beginning to think that folks watching these films might think they are, just a little bit, sexist. Just a wee bit.",
         "This is another dire film that could have been much better as the story has a good premise. Dr Herbert Lyutak is a doctor of psychology and he is suffering from shell-shock after he returns from the war. While suffering from this psychological ailment he kills a woman he's given a lift too as she's rejected his sexual advances, though his mind blanks out the incident. As time passes he gets glimpses of the murder and informs the police of his visions. They, in turn, start to suspect that something isn't quite right with the good doctor. As we progress through the movie we get an insight into his newly formed sexual deviations and his wife's' ability to conform to them because of her love for him. There are a few twists and turns though it's the last twist which really makes this a \"Throw- away\" movie. Unfortunately, it's the unbelievably appalling acting, especially from the lead actors, and the abysmally bad writing along with awful direction and cutting that really kills this film. Mickey Hargitay (Dr Herbert Lyutak) acting skills come straight out of the redwood forests. There are actually times you think a makeup artist will come on with a sander as a puppeteer appears to move him into his next position. His wife, Marcia Lyutak, played by Rita Calderoni, is so over-the-top that it passes from amusing into dreadful. The pace is all over the place and there are some scenes that appear to have been thrown in just to titillate, especially the light S&M and lesbian scene as there's no sense or reason for them being in that section of the film. The lesbian scene is also one of the longest segments in the film. This is a shame as the opening sequence, the pickup and murder of the girls is done really well - nicely shot and thought out. I thought I was going to be watching a respectable movie... boy was I wrong. I wouldn't recommend this to anyone, not even fans of Italian Gallo as there are much better examples of it out there to watch.",
         "In Renato Polselli's bonkers giallo Delrium, Mickey Hargitay plays Dr. Herbert Lyutak, an impotent deranged lunatic who cannot stop himself from murdering pretty young women. When his devoted wife, still a virgin due to her husband's 'problem', discovers his secret, she decides to help rather than inform the police. Delirium certainly showed promise at the beginning, with a vicious murder scene that delivered both the requisite nudity and violence one expects from a 70s giallo. Unfortunately, what begins as a sleazy little thriller quickly descends into a mess of histrionics and incomprehensible craziness that ultimately leads to disappointment. Polselli packs his film with tasty young totty, with nearly every woman either wearing a mini skirt or a pair of hot pants, and all willing to get their kit off at the drop of a hat, but even these pleasing visual distractions couldn't make me overlook the dreadful acting, poor plot and just plain silly ending. The usual red-herrings abound, and there's even more than one killer just to make things more confusing, but as giallos go this one is definitely second rate. 4.5 out of 10 (very generously rounded up to 5 for IMDb).",
         "OK, what the hell was that? This story of a killer who kills out of impotence is way too disjointed to be comprehensible, way too tedious to be enjoyable, and way too asinine to be watchable. When a film has tons of nudity and perverseness AND you still find yourself drifting to sleep!! Well that my friends is a huge telling sign to do something better with your time. May I suggest watching paint dry? Avoid the American version that's shorter & turns it into a story about an insane Vietnam vet. Avoid the international version and i have no clue about the French version as I haven't seen it, but that probably sucks as well. Anchor Bay DVD Extras: Both American & Iternational versions; and a short documentary My Grade: F",
         "Renato Polselli's \"Delirio Caldo\" (aka. \"Delirium\") of 1972 is an incredibly sleazy, demented, and violent Giallo of which two very different versions exist. The original Italian version is 102 minutes long, whereas the American edited version runs only 85 minutes. They did not simply cut out some sequences for the American version, however, but added some (including an entirely different beginning and ending), which basically makes the two versions two different films. I first saw the American version over a year ago, and recently purchased the Blue Underground DVD which includes both versions. Overall, one must say that the Italian original version is the recommendable one, even though the American cut has some particular qualities as well. Criminal psychologist Herbert Lyutak (Mickey Hargitay) is a sadistic maniac whose impotence-induced rage forces him to sadistically murder young women in order to get off. He is assisting the police in the gruesome sex-murders committed by himself, which makes it easy for him to blame them on others. In spite of his sadism and impotence, his stunningly beautiful wife Marcia (Rita Calderoni) is completely devoted to him... The plot of (both versions of) \"Delirium\" differs from your typical Giallo-storyline in that the killer's identity isn't a secret. Herbert Lyutak is the sadistic strangler, which is revealed in the first five minutes of the film. However, as the film goes on, we get the impression that there is another beauty-killing maniac on the loose. Mickey Hargitay, the former husband of Jayne Mansfield and muscleman who appeared in other Italian cult-flicks such as \"Il Boia Scarlatto\" (\"The Crimson Executionner\", 1965), \"La Figlia Di Frankenstein\" (\"Frankenstein's Daughter\", 1971) and director Polselli's own \"The Reincarnation of Isabel\" (1973), is at his best in his incredibly demented role here. Hargitay is very effectively demented, psychotic and just plain scary in his psychopath role here. The ravishing Rita Calderoni, also known for her many revealing roles in other Italian cult films including \"The Reincarnation of Isabel\" and \"Nuda Per Satana\" (1974) is drop-dead gorgeous in the role of the psycho's submissive wife.The film is very sadistic and sleazy, even for Giallo-standards. The hot female cast members deliver plenty of nudity, the film is filled with demented sexual perversions, and the murders are gruesome and very sadistic. Director Renato Polselli is generally known for his bizarre films.The original uncut Italian version is almost 20 minutes longer and thus has a more elaborate storyline. Not too surprisingly, there is also a stronger focus on the sleaze and sexual perversions in the European version. The psychedelic orgy sequences, most of which are included in the Italian original only, truly earn the film the title \"Delirium\". This the delightfully bizarre stuff that Polselli is good at. While I certainly recommend the original version over the American cut, it is undeniably rewarding for a Giallo fan to watch both versions. The American cut lacks some of the elements that make the original so great, but it includes (a rather preposterous) alternate beginning and ending involving a war-trauma (which is typical for 70s American cinema). The war sequences which are only featured in the American version, are quite nasty, and therefore recommendable to the gorehounds out there. The American version also includes one nasty killing with a plastic bag, which isn't included in the original cut. Still, the original cut has more to offer (both story-wise and sleaze-wise). My advice to my fellow Giallo-fans: Definitely watch the Italian version. If possible, watch both. A true must for fans of the sleazier and nastier kind of Giallo.",
         "Psychosexual madness from director Renato Polselli regarding a psychotic impotent psychiatrist and his equally nutty wife who obsessively loves him to the point that she allows him to nearly strangle her to death! Mickey Hargitay stars as Herbert Lyutak who preys on young women, his demented eyes crawling up their legs, crotches and necks until the urge to strangle them proves too great to resist. We see in an opening scene where he offers a young woman, barely past her teenage years, a ride home, stopping on the way, pursuing her as she runs for her life. Catching up to her, he bashes her with a branch, while gripping her throat tightly, ripping away her clothes, with a look of sheer rage on his face..the inability to have sexual contact has created a madness beyond his control. We know right away what he's capable of. After this, he nearly murders his wife, Marcia(..the ridiculously sexy Rita Calderoni), who knows about his activities. Attempting to set himself up by tipping the police on alert for the perpetrator, someone else stabs a young woman in a telephone booth. Then, a whore, who was to be Herbert's target, gathers the knife used as the murder weapon wishing to talk to him, is drowned in the bathtub of her flat after being flogged repeatedly with a whip across the body. A suspect is a voyeuristic parking lot attendant, but he's merely an obvious red herring who actually eyewitnesses the Lyutaks' maid being put to sleep by a suspect off-camera. Living with the Lyutaks is relative Joaquine(Christa Barrymore)who may in fact be Marcia's lover. All sorts of sleazy, sordid shenanigans are on display in this crazy, violent giallo with a cast who lets it all hang out, holding nothing back, their wacky characters unrestrained. Bulging eyes, rough sexual violence, and harsh behavior using all sorts of tools add to the devious fun. To enjoy this, you need to have a degree of tolerance towards tasteless acts and outbursts of insanity. Hargitay's eyes, how they chillingly stare down potential young victims, are certainly hard to forget, as are his treatments towards those unlucky ones he treats harshly. The real star is Calderoni, whose love-crazed wife harbours an unhinged passion for her man, and the film highlights certain bizarre sadomasochistic fantasies she has regarding her husband and those who live within their home. The violence isn't gory but uncomfortable to watch at times because it deals mostly with naked(..or skimpily clothed) women being mistreated. Calderoni has quite a marvelous seductive presence and I couldn't take my eyes off of her. The mystery of who else, besides Hargitay, was killing, shouldn't be that hard to figure out. It's the outrageous behavior of the central characters which dominate this film. I watched the Italian version not the American one(..which alters the story regarding a violent tour through Vietnam which shaped Hargitay's dementia).",
         "Extreme, maybe, but after seeing so many average 'slasher' flicks', you will not be dissapointed.The use of the 'victim' being strangled and masturbated at the same time may arouse a few, and humor others, with major hints of dark comedy thrown in for good measure-Beware of the stateside 'CUT/VERSION', of this movie-the euro-version-is the one to watch to really appreciate this 'masterpiece'thriller'.",
         "Respected doctor Herbert Lyutak (Mickey Hargitay - former Mr. Universe!), who regularly works with the police in helping solve murders, picks up a girl at a bar and brutally murders her. He is identified by an eye witness when in police custody, but then another murder takes place in the same fashion. The police are forced to release Lyutak, who we begin to learn is a very disturbed man. His wife knows of him murdering the girl, but is so in love with him that she is prepared to satisfy his violent desires. As the murders build up, a bizarre cat- and-mouse game starts between the police and Lyutak, where apparently no-one knows what is really going on. First of all, I watched this believing it was the Delirium from the Video Nasty list, made in 1979, only later to find out I had watched the wrong film. But it was a welcome mistake, as the 1972 Delirium is actually quite good. This is one of the more extreme giallos I've seen. Usually the style eclipses the gore, and if the gore is heavy, then it usually comes with paint-red blood and an extra slice of cheddar. Here, although most of the violence is far from convincing, it is certainly unpleasant. One scene sees a girl being masturbated as she lies doped up and being strangled. It is the sexual edge that gives the film its unpleasantness, and the film is carried by a pretty good performance by Hargitay. Even for a giallo, the focus on the sexual is heavy. These type of films are always filled with beautiful 70's Italian women who are not afraid to show a bit of flesh, but here it dominates practically every scene. More disturbingly, it features highly during the murder scenes. Shirts and gowns open to reveal breasts, and legs twist and bend to reveal panties, all as they lie dying or dead. As well as being heavily exploitative, it also adds to the sleazy tone of the film, and makes the film just that bit more unnerving. This is one of the most bonkers giallos I've seen - there were moments when I just didn't know what was going on - but stick with it and it's lots of fun. www.the-wrath-of-blog.blogspot.com",
         "Rarely have I seen a film with absolutely nothing going for it... But every now and then somebody digs something out of the dungheap that makes you wonder how the hell they got the finance to put this on celluloid... And how anyone has the nerve to release this and expect people to pay for to see it... The director hasn't got a clue... It looks really bad... The story is ridiculous... The acting is non existant... But not in the way that can make these films a laugh... It's just plain rubbish... A complete waste of nearly 2 hours of your life... I can think of so many more interesting things to do in that time so have to admit after half hour I fast forwarded... But even at that speed it was just lacking in every department!!!"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinamerica International",
         "G.R.P. Cinematografica"
      ],
      "summaries": ["A respected doctor becomes the prime suspect in a series of gruesome murders."],
      "budget": 0
   },
   "movielensId": 142983,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1972-07-05",
      "dvdReleaseDate": null,
      "directors": ["Renato Polselli"],
      "runtime": 102,
      "movieId": 142983,
      "title": "Delirium",
      "mpaa": null,
      "actors": [
         "Mickey Hargitay",
         "Rita Calderoni",
         "Raul Lovecchio",
         "Tano Cimarosa",
         "Christa Barrymore",
         "Cristina Perrier",
         "Carmen Young",
         "Katia Cardinali"
      ],
      "imdbMovieId": "0068471",
      "originalTitle": "Delirio caldo",
      "genres": [
         "Foreign",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["mreZ8T0RzAc"],
      "plotSummary": "A respected doctor becomes the prime suspect in a series of gruesome murders.",
      "tmdbMovieId": 40345,
      "avgRating": 3,
      "releaseYear": "1972",
      "numRatings": 4,
      "posterPath": "/jWMIVcADu82pUvA734fIb8JAOjp.jpg"
   }
}