{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "documentary",
            "id": 10073
         },
         {
            "name": "nature",
            "id": 18330
         }
      ],
      "imdb_id": "tt4466550",
      "video": false,
      "title": "Antarctica: Ice & Sky",
      "recommendations": [],
      "backdrop_path": "/vZSNaVSg6UK2OS6IJdKZg0uqD89.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Self",
               "gender": 0,
               "credit_id": "562a8881c3a3681b54002b2b",
               "name": "Claude Lorius",
               "profile_path": null,
               "id": 1526049,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Narrator",
               "gender": 0,
               "credit_id": "562a8894c3a3681b61002bb7",
               "name": "Michel Papineschi",
               "profile_path": "/qQR7jyB8PdORSL0XxKtnUYDTYv1.jpg",
               "id": 1526050,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "554437ebc3a3680ce600339f",
               "name": "Luc Jacquet",
               "profile_path": "/b4hz0BmK9NCD2fC6g8Z8hTigqoI.jpg",
               "id": 18525,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "562a88b3925141284a002a59",
               "name": "Stéphane Martin",
               "profile_path": null,
               "id": 976617,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "562a88c89251412853002af7",
               "name": "Richard Grandpierre",
               "profile_path": null,
               "id": 51323,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "562a88d5c3a3681b5c00294e",
               "name": "Cyrille Aufort",
               "profile_path": null,
               "id": 1183015,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.491753,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 338273,
      "vote_count": 6,
      "budget": 0,
      "overview": "Documentary about the work of Claude Lorius, who began studying Antarctic ice in 1957, and, in 1965, was the first scientist to be concerned about global warming.",
      "similar": [
         114150,
         824,
         1370,
         585,
         10112,
         10404,
         62211,
         44214,
         45317,
         9472,
         401,
         105864,
         101299,
         55721,
         254470,
         630,
         1124,
         339403,
         354912,
         525
      ],
      "original_title": "La Glace et le ciel",
      "runtime": 89,
      "poster_path": "/8Wg0KioXoLSrWmC3Gu8WuZ2SBgF.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": "/cv1vihTOJIIN4NPNYLcf5SxUS9Y.png",
         "name": "Pathé",
         "id": 7981,
         "origin_country": ""
      }],
      "release_date": "2015-10-21",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Luc Jacquet"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Luc Jacquet"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt4466550/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzIxODY5MDUzOF5BMl5BanBnXkFtZTgwMzQ0NTE4MDI@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Claude Lorius",
         "Michel Papineschi",
         "Jacques-Yves Cousteau"
      ],
      "reviews": [
         "I went to see this documentary mostly because I saw that it was about Antartica because I've always been fascinated by it. I didn't know anything on the subject of the French scientist Claude Lorius or his life work, but I thought that even if I didn't like the documentary at least I'd see some nice scenes of Antartica. It turned out better than I'd expected, I really enjoyed every minute of it. The old footage of the expeditions were fascinating and the new ones breathtaking but the biggest surprise, even to me, was the story itself. I have always been curious about people's life journeys especially the ones of people who choose unusual life paths and I really appreciated the little details he managed to remember like wanting to quit each time he had to take his hand out of the glove or how he suffered the cold nights just to get a glimpse of the Aurora Australis. I guess the first part was a bit more interesting on an emotional level because I found myself trying to imagine how living on Antarctica for a year with two people would feel like and the second part was more interesting for the story. The documentary comes to a bitter sweet end, bitter because we know we're hurling towards an unpredictable future and sweet because somewhere in the audience somewhere in the world could be a future scientist feeling inspired to help. I would recommend this to patient viewers who find themselves fascinated by extraordinary life stories.",
         "\"Ice and the Sky\" is a French environmental movie from this year and it was the closing film at Cannes 2015. Writer and director is Luc Jacquet, who is mostly known for the Academy Award winning, 10-year-old penguin documentary \"La marche de l'empereur\". And in his newest film here, there is also one scene with penguins, but it's really only very short. Most of the 90 minutes takes place at the Poles again, but this one is not about the animals living there. Instead we find out about French scientist Claude Lorius, who is in his 80s now and spent more than 10 years of scientific research at these coldest places of the planet. Unfortunately, I cannot say I enjoyed this one. Sometimes it is too scientific, but really the biggest problem here was that it was simply not interesting. Maybe fellow scientists will appreciate this one, but honestly there was nothing memorable for me here in terms of his field studies. And the narration was pretty bad too. I am referring to the exact words here. The texts were so full of exaggerations that it felt very unauthentic and cringeworthy to me, like hundred times he thought about giving up being mentioned on several occasions and there was a lot more. Also mentioning the exact temperature 10 times does not help either. We know you are freezing. We don't need the numbers, especially if we see in the next scene a cook who wears thin clothes and smiles. That was odd. In the end, and on 2 or 3 other occasions, especially early on, there are references to global warming, something that was not a factor at all throughout the entire movie. If they wanted to make a film on this issue, they should have taken a completely different approach. It felt thrown in very randomly and without connection to almost everything we saw and heard before. Regardless of what you think about the issue, this deserved smarter inclusions I must say. I am fairly disappointed by Jacquet with this one. Not recommended and I hope he can get back to his best with future projects again.",
         "A beautiful documentary explaining and demonstrating how the ice cores tell their message. If the politicians had one-hundredth of the grit, determination, integrity, humility and humanity demonstrated by these scientists then the planet would not be in the mess it is in now. We are privileged to be able to view Monsieur Lorius' life story. At the end he shares \"Man is never so sublimely in his element than faced with adversity\". Sadly, this is for men like him and his bullet-proof friends, and not I would dare to suggest does it compare to the uninformed masses of slack jawed, obese, Youtube watching, materialistic consumers that now comprise \"developed\" society. Possibly an epitaph to the human race.",
         "It's a documentary about a French scientist Claude Lorius and his work in the Antarctic, and how he came to 2 discoveries: 1) measuring temperature in distant past by the predominant type of hydrogen in the snowflakes found deep below in the ice of Antarctica and 2) seeing climate of distant past by the air bubbles stored in that deep ice. If you like science and documentaries about nature you will definitely like this film, too. But for an average spectator the film is probably too slow-paced, and lacks the typical tricks modern American documentaries like to use to keep the viewer's attention. It's a European film, so it deliberately avoids cheap tricks and counts on the viewer's intelligence. Also, the film mentions facts about climate change. You've probably heard this many times already, and David Attenborough (and Carl Sagan) and many others have mention this over and over, but temperature is rising, and it's man-caused. And despite the Kyoto protocol et al, no one really cares. Btw due to the film's detachment for an average viewer, it won't ever be watched by deniers of climate change and basically most of the people who still need convincing. On a side note, I liked the positive light in which the Russian scientists and the Vostok station was mentioned. Apparently, their station and drilling tech was vital for collection of massive data about past climate on Earth. So rare to see anything positive about Russia in a western film these days. After watching this, all I wanted was to give this old Frenchman a hug and thank him for all his outstanding work. I hope we will still have enough people like him in this and coming generations."
      ],
      "genres": [
         "Documentary",
         "Adventure",
         "Biography"
      ],
      "productionCompanies": [
         "Eskwad",
         "Wild-Touch",
         "Pathé"
      ],
      "summaries": ["A documentary about global warming."],
      "budget": 0
   },
   "movielensId": 142973,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2015-10-21",
      "dvdReleaseDate": null,
      "directors": ["Luc Jacquet"],
      "runtime": 89,
      "movieId": 142973,
      "title": "Antarctica: Ice & Sky",
      "mpaa": null,
      "actors": [
         "Claude Lorius",
         "Michel Papineschi"
      ],
      "imdbMovieId": "4466550",
      "originalTitle": "La Glace et le ciel",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["-p6-zoN30_E"],
      "plotSummary": "Documentary about the work of Claude Lorius, who began studying Antarctic ice in 1957, and, in 1965, was the first scientist to be concerned about global warming.",
      "tmdbMovieId": 338273,
      "avgRating": 2.78571,
      "releaseYear": "2015",
      "numRatings": 7,
      "posterPath": "/8Wg0KioXoLSrWmC3Gu8WuZ2SBgF.jpg"
   }
}