{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "helicopter",
            "id": 720
         },
         {
            "name": "underground",
            "id": 1353
         },
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "shelter",
            "id": 4917
         },
         {
            "name": "quarantine",
            "id": 6898
         },
         {
            "name": "outbreak",
            "id": 9744
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "flashback",
            "id": 187844
         },
         {
            "name": "virus",
            "id": 188957
         },
         {
            "name": "creepy doll",
            "id": 212661
         }
      ],
      "imdb_id": "tt2131532",
      "video": false,
      "title": "Hidden",
      "recommendations": [
         338676,
         296065,
         301846,
         276488,
         265010,
         323370,
         210947,
         333674,
         155084,
         73588,
         403642,
         121606,
         169219,
         354251,
         291272,
         340103,
         257117,
         257087,
         46221,
         26587
      ],
      "backdrop_path": "/884cFOB5jgJXdRMqMMY7inGuxkv.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "Reno",
            "id": "5743785e9251414c0d0000a4",
            "content": "> The mysteries surrounding a family hidden from the actual world.\r\n\r\nProbably it is not a HIDDEN gem, but will take you with a surprise. Yes, the film would do better than anybody's expectation, well, mostly it does for sure. For such a small length film, the presentation was wonderful. The story was very simple that never required any kind of developments for its characters or the previous accounts like the film 'The Mist'.\r\n\r\nIt just opened with a family of three were hiding is a fallout shelter, but they never give us the reason behind it. That's the best part, because of that mystery which was improvised to the greater level under its theme limits the film looked so good. While hidden from the outside world, it also reveals how well they're prepared to face the threat posed by whatever out in there. A bit by bit the flashback story was told to balance the viewer's anticipation as well as to bring the curtain to the narration.\r\n\r\nIt is not a big cast film, but they all (three) were good. I know many people expressed disappointment over Emily Alyn Lind's performance, I thought same as well that she did a bit over expressions in some of the scenes. Other than that, she's a better actor that I know from her previous films. If you're bored of watching lots of high budget superhero films, you could try this for a change. It looks like a new brother combo is on their way in the line of Coen bros and others. It was theirs first directional venture and they did a good job, but the real test begins henceforth, so I hope they only climb upwards.\r\n\r\n7/10",
            "url": "https://www.themoviedb.org/review/5743785e9251414c0d0000a4"
         },
         {
            "author": "Gimly",
            "id": "583194b0c3a3685ba8023acd",
            "content": "A great, minimalist movie, but one that probably could have made a better short film than theatrical release.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._",
            "url": "https://www.themoviedb.org/review/583194b0c3a3685ba8023acd"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Ray",
               "gender": 2,
               "credit_id": "55ffcc11c3a3681334005552",
               "name": "Alexander Skarsgård",
               "profile_path": "/aVAPqwoElxk9O8QID96l6qG4x2E.jpg",
               "id": 28846,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Claire",
               "gender": 1,
               "credit_id": "55ffcc209251410471002ee1",
               "name": "Andrea Riseborough",
               "profile_path": "/5Qi1DVUts9gahVpj1dCtspbwcAC.jpg",
               "id": 127558,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "55ffcc3b9251411bd20021ea",
               "name": "Emily Alyn Lind",
               "profile_path": "/io63GZMwOc3blj3wd0s0adXsLIb.jpg",
               "id": 112742,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Jillian",
               "gender": 1,
               "credit_id": "55ffcc45c3a3681762002235",
               "name": "Heather Doerksen",
               "profile_path": "/nIF1GLQ2WPGS5pdogVGhOm2nYmh.jpg",
               "id": 83423,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Joey Neary",
               "gender": 2,
               "credit_id": "55ffcc509251411bd20021f1",
               "name": "William Ainscough",
               "profile_path": "/kp7ihlexDmfDhm4PnyLLE5h4fsp.jpg",
               "id": 1512709,
               "order": 5
            },
            {
               "cast_id": 28,
               "character": "Breather Lieutenant",
               "gender": 2,
               "credit_id": "5a80abc60e0a262aa00260a5",
               "name": "David Lewis",
               "profile_path": "/7vavqcvwCNwHChOaZgISst0cJbV.jpg",
               "id": 4095,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5604877a925141026f000064",
               "name": "Lawrence Grey",
               "profile_path": null,
               "id": 1514418,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "560487889251410282000063",
               "name": "Roy Lee",
               "profile_path": null,
               "id": 21036,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56048797925141027f0008c6",
               "name": "Mason Novick",
               "profile_path": null,
               "id": 52446,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "560487a6925141027f0008cb",
               "name": "Richard D. Zanuck",
               "profile_path": "/uoPXQ29L8vlphMuojaBlmuwi1Mu.jpg",
               "id": 1297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "560487b2925141027f0008cf",
               "name": "Michelle Knudsen",
               "profile_path": null,
               "id": 1514419,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "560487c6c3a3685c4900008a",
               "name": "Sebastian Aloi",
               "profile_path": null,
               "id": 1337319,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "560487d4925141027f0008d7",
               "name": "Katterli Frauenfelder",
               "profile_path": null,
               "id": 8275,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "560487e19251410276000073",
               "name": "John Powers Middleton",
               "profile_path": null,
               "id": 1276559,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "560487edc3a3685c5c000070",
               "name": "Jim Rowe",
               "profile_path": "/6D5at3zL9eYFE2DwSWWhIXlOURn.jpg",
               "id": 1514420,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "560487f9c3a3685c5c000079",
               "name": "David Julyan",
               "profile_path": null,
               "id": 558,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56048806c3a3685c51000082",
               "name": "Thomas Townend",
               "profile_path": null,
               "id": 968858,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56048811c3a3685c4d00008c",
               "name": "Jeffrey M. Werner",
               "profile_path": null,
               "id": 141303,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5604881c925141027f0008e0",
               "name": "Carmen Cuba",
               "profile_path": "/c6zX0b29FimnAQ6nkisWxYsCHvE.jpg",
               "id": 51922,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56048828925141027c000082",
               "name": "James D. Bissell",
               "profile_path": null,
               "id": 9967,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56048833c3a3685c5100008f",
               "name": "Harrison Yurkiw",
               "profile_path": null,
               "id": 1378684,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "57a8c4ccc3a36835f60071ae",
               "name": "Matt Duffer",
               "profile_path": "/rSvzuLKdZ2MkOpMgpK05FFPInzY.jpg",
               "id": 1179419,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57a8c5529251415cfb00873f",
               "name": "Ross Duffer",
               "profile_path": "/3fcRHwcD75nbOQXyl4MUyVIXOMC.jpg",
               "id": 1179422,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57a8c557c3a3682617007c85",
               "name": "Ross Duffer",
               "profile_path": "/3fcRHwcD75nbOQXyl4MUyVIXOMC.jpg",
               "id": 1179422,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57a8c560925141038f007261",
               "name": "Matt Duffer",
               "profile_path": "/rSvzuLKdZ2MkOpMgpK05FFPInzY.jpg",
               "id": 1179419,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 5.331338,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 360784,
      "vote_count": 240,
      "budget": 0,
      "overview": "A family takes refuge in a fallout shelter to avoid a dangerous outbreak.",
      "similar": [
         158011,
         9946,
         8834,
         10285,
         1572,
         238636,
         156022,
         562,
         281957,
         8413,
         168098,
         445954,
         133805,
         429733,
         3134,
         357096,
         11033,
         274,
         9654,
         8456
      ],
      "original_title": "Hidden",
      "runtime": 83,
      "poster_path": "/iyqwK3UU1KHR9Ey5tw5amRhSRXJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Primal Pictures",
            "id": 3911,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2015-09-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Fear will find you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Matt Duffer",
         "Ross Duffer"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Matt Duffer",
         "Ross Duffer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2131532/",
      "coverLink": null,
      "actors": [
         "Alexander Skarsgård",
         "Andrea Riseborough",
         "Emily Alyn Lind"
      ],
      "reviews": [
         "Don't really want to say too much about this since I feel that the best way to enjoy this film is to go in knowing as little as possible. That's what I did and I was thoroughly entertained until the credits rolled. This isn't an action packed gore fest, instead it is a well crafted thriller that does a good job of getting you attached to the characters. The slow build up helps to make the characters feel real, that and the excellent acting by the small cast. Some may be deterred by the slow pace but I felt the slow pace just made the finale that more thrilling and emotional. The screenwriters thought outside of the box for this one and it was really refreshing to see something new. 7/10",
         "First of all what defines horror? Jump scares or gore? There is all kinds of types of horror. I'd say the fear of losing your family can be horrifying. It's all a matter of perspective and maybe empathy at times. I for one really felt the bond between the father and daughter. The father constantly keeps his family's sanity together. The first half of the movie is all about these aspects and doesn't show anything remotely scary. The only mentioning about the creatures, referred as \"The Breathers\" comes from the daughter who isn't allowed to talk about them anymore. If you lost interest by now just because you didn't see anything scary then just stop watching. If you are wondering what they are hiding from stay tuned. In other words the horror aspect is more so the fact they are hiding from forces that are a threat to them, but you don't actually see them until the second half of the movie. The acting is well done. Script is well done. Claustrophobic post- apocalyptic environment is well done. Flashbacks are well spread out and not overdone. I have seen far worse horror movies and this is just different. Even if you strip away all the horror it is supposed to have it's still a great movie IMO. The twists are there as well and in this day and age those are hard to do. Just freaking enjoy the movie and don't be so technical about it. Don't bash it just because it's not your definition of horror.",
         "Quite reminiscent of The Road, Hidden is quite slow in the first half of the movie. This however is carried very well by the central characters, all very believable in their roles and they draw you into their world surprisingly easily. There's quite a bit of mystery and suspense builds slowly. Usually I'm a know it all about story lines however Hidden kept me intrigued and even surprised me. Its quite a dark movie and a slow burner and quite apocalyptic in it's nature so you'd need to be in the mood. I watched Pixels before hand which probably cost about 20 times as much and had a cast of 20 times the size and I definitely enjoyed Hidden more. Completely different movies mind, and Hidden is an adult movie of course. By the end however I did want more, although I doubt there'll be a sequel, however certainly in a crowded market a well made film.",
         "Absolutely incredible acting. The father and mother were, of course (considering who played them) great, but the girl in the movie was completely awesome. What a great twist on a \"zombie\" movie--and I'm not about to give anything away. Its time for you to spend some time on the edge of your seat like I did. I loved the way the story worked in what happened by flashes of the past that were still tied to the present. This movie is well worth what you will pay to watch it. This movie reminded me of a horror story of old like \" The Haunting\", where scenes took their time to build and had you fully invested in what was going on when anything dramatic happened. Watch it in a dark room and enjoy!!!",
         "In Kingsville, Ray (Alexander Skarsgård), his wife Claire (Andrea Riseborough) and their little daughter Zoe \"Zozo\" (Emily Alyn Lind) have been living in an underground shelter for three hundred days hidden from the \"Breathers\". They have created and follow four rules to stay alive. Ray frequently recalls when an outbreak reached Kingsville and the army bombed the whole town during the quarantine, and he believes they are the only survivors. When they find that many supplies have been stolen from the pantry, Ray finds that a rat is the responsible. They chase the rodent and there is an accident with a kerosene lamp that burns a table. Now they are afraid that the \"Breathers\" might have seen the smoke. Will they be safe in the shelter? The tense \"Hidden\" is a little gem in the horror genre. The plot seems to be a conventional post-apocalypse story, but the plot point is absolutely original and unexpected. Alexander Skarsgård), Andrea Riseborough and Emily Alyn Lind are very convincing in the role of a trapped family. The hopeless conclusion is too dark and the consequences will certainly be devastating for either side. My vote is seven. Title (Brazil): Not Available",
         "I don't normally do reviews but i enjoyed this film that much that i just had to. Firstly i thought it was going to be your average zombie movie (i like zombie flicks)...it isn't. It is about an infection outbreak that is having an effect on people however it is far from average zombie film. It is unique and don't think its ever been done before. Excellent plot!!! Well delivered. Really enjoyed it. So horror it isn't but worth watching it is. With a really good twist. I cant say more without giving the game away but i really cant recommend it enough.",
         "To start off, this movie was very slow and if you have the time and dedication to finish it I would truly recommend it. Some serious twist and surprising plot developments. Alexander Skarsgard was tremendous. If it wasn't for him, this movie would have fell face first. The script was the only thing that I thought could have been better. Poorly written but but again the acting was what it kept the movie together. I'm very tough on my ratings but an 8 of 10 is quite accurate. The final 30 minutes is when the tension builds up and captures the audience and I promise, if you can stay with the first half and not give up you will be very happy you did.",
         "I loved everything about this movie; the acting, the set-up, the slow burn, the reveal. Everything worked so well that it was a just a joy of a film to watch. That little girl is so damned talented, and the parents were so convincing, I actually wondered if they knew that they were being filmed while they were acting. Interestingly, the best thing about this film had to be the third act. You think the film is about one thing, and then it flips that upside down in such a way as to have you wondering how you never guessed where they were going with the story in the first place. It was just an amazing sense of progression that was well realized, nicely paced, and incredibly effective. If there is any movie that deserves to be seen by as many people as possible, this is definitely the one. No one saw this coming, and I am SHOCKED that this film did not receive a wide theatrical release. Everyone deserves to be praised for their work in this movie. It really is superlative cinema.",
         "I was *very* pleasantly surprised by this film. Is it a \"scary\" horror? No, not necessarily, although it did have a few moments. It ended up being a subtle story, brilliantly told for the most part, a great character study and acting. Filmed in a brilliant little set, claustrophobic and moody. If you're looking for jump scares and special effects, guns and explosions, screaming bimbos and tough-guy saviors, this is not for you. It was perhaps a little heavy handed in its last 1/4, trying to \"explain\" things, but we all know that directors often think an average audience can need that. I think a little subtlety would have gone a long way with this, esp in editing. I highly recommend not researching this film, knowing anything beforehand.",
         "Hidden posits one simple question, who are the real monsters? What hides beneath the facade we as people and as a society present to the world? This film looks at the nature of what it means to human and asks us to examine how we define our humanity. Are we tolerant of difference or are we frightened by it? How does this shape our interactions with those who are different from us? Are our assumptions about others really a damning reflection of our true selves or a vindication of how we value life no matter its form? This is a subtle, slow paced, emotionally moving film. The question it asks is done so quietly and as a consequence its message may be lost on those not paying attention. The acting from the cast is generally excellent all round. Its hard to find fault with the performances and I'd say given the environmental limitations imposed, the quality of acting is even more remarkable. Are there any shortcomings? This really is a somewhat subjective question when it comes to Hidden. If you like your science fiction thrillers fast paced then this is a shortcoming. If you expect every question to be answered then this film may, once again, frustrate you. I would say personally I did find Hidden occasionally, overly sentimental but this is a small consideration. In summary, for the most part, Hidden is an above average film. Its intelligent and its well directed and acted. Its message is a timely one too given the intolerance and cruelty people and societies seem to demonstrate on a daily basis towards one another. Eight out of ten from me.",
         "Not that it changed my life forever, but I thoroughly enjoyed this movie. The story starts so seemingly familiar, similar to many \"zombie/deadly virus apocalypse\" movies before it, that you don't really expect any twists and just enjoy watching, waiting for action and scares. They did well making every scene enjoyable on its own - not setting up the stage for any particular turn of events or a twist, but showing the \"daily\" life of this family. It's a pretty good story, and it is executed impeccably. For a movie that mostly takes place in the dark, cinematography is very well done. I also have to commend the child actress, because it's not rare in our days to come across movies with kids that are unbearable to watch. Emily Lynd, and the rest of the team, were pretty good.",
         "Hidden has a stunning plot, it's not like other zombie movies like \"Dawn Of The Dead\" or \"28 Days Later\". This movie is way different and way better and I highly recommend it to anyone who is interested in a \"End of the world\" type of movie. Hidden is also an extremely heart- wrenching movie due to the fight for survival of the family. Most definitely a 9/10 rating. If you are not prepared for the tears then I suggest you do not watch. I would most likely consider this a horror movie because of some jump scares and being on the \"edge of your seat\" at some parts. Personally, I am not interested in sitting down and watching a zombie movie but this caught my eye not even 15 minutes into it. This is the first movie I have seen about a fallout shelter and a desperate family trying to survive during a serious outbreak right above them. Give it a try, you will thank me later!",
         "I was skeptical of this but had read a good review so I thought I would give it a try. Starts and moves slow. Picks up speed. Acting better than some give it credit for. Low budget but good. The kid in it is one of the most annoying kids I have ever seen in a film. Part created that way I am sure. You have to wonder WHY some actors take the scripts they do. I understand why these actors chose this film. Different and original. I had to wonder what there WAS about this film that some thought was so good. It is unique is why. Different. THAT is difficult to find in a time of derivative plots. Give it a shot and watch out for the ending. Wait for it...",
         "Well this is a movie I am glad I watched. It's not an horror movie though so it should not be categorized in there. But it's a nice thriller. A thriller with a twist. And that's what I like the most about movies. When you don't see it coming, a total surprise. They don't make much of those movies because most of the times you figured out the end way before the actual ending. With this one you don't have that at all. We all know Alexander Skarsgård mostly from the series True Blood. And here in Hidden he proves that he is a good actor. The rest of the cast was also good, very believable in their respective roles. Nice suspense throughout the whole movie. And with a good ending like I said. I enjoyed it and will probably watch it again in a couple years.",
         "Hidden (2015) looked to be a great little thriller with it's dark and eerie trailer, though it lacked in many ways to be scary let alone the real-time value of characters and story-line. This is your typical thriller that could've been good with out the loud, spoiled little one that acted as if it was her first week in the place. You'd think that almost a year in any location, the ways of living would be pretty consistent; though this film follows my same comments as World War Z. This could've been a good movie if their were #1 better script, and #2 actors that could follow a real-timeline situation while doing their role. Honestly we almost fell asleep trying to watch this film and not once did it ever display much on the thriller, or horror genre. Sorry to say another not so good film to come out this year thought lately it is rare to find a good film anymore.",
         "When I first saw the trailer for this movie I was hesitant to see it due to the fact that I was all but certain it would only end one way; they'd die. I thought it was just one of those movies that would be an experience with an inevitable outcome like the movie Maggie starring Arnold Schwarzenegger and Abigail Breslin. However the ending of this film is what really makes it original. I love movies like this that drop vague hints throughout the film that don't seem important until later. Like their rule about \"staying calm\". Well what good does it do to freak out in a disaster so that rule makes sense and yet has a deeper meaning to it. Much like how you think the daughter saying \"what if I need to protect you one day\" is just a touching moment between mother and daughter but is really more of a deep seated concern for the daughter that makes more sense later. Of course I couldn't help but think of the possibility of them being vampires every time they called the monsters \"breathers\" and while that's similar to the truth not quite. What's interesting is this movie was a lower budget version of movies like World War Z but unlike other zombie films this one to me stands out with total originality. Brilliant.",
         "Although a little slow at the start, sticking with this film really rewards the viewer with a psychologically thrilling atmosphere and some shocking twists in the plot. The oppressive sense of doom and fear really make for a wonderful backdrop to this tale of family unity and it's hard not to feel empathy with the characters. Superb acting and cinematography (although a little too dark in places) make this a fascinating study of the psychology of isolation. It's wonderful to see a film that's different in so many ways and doesn't try to rehash the same tired narrative of so many others. If you're looking for a thrilling movie which surprises you at every turn, this is a real winner that I'd highly recommend to anyone.",
         "I never thought this movie was going to be as good as it looked like, I'm glad it proved me wrong. I have to say I didn't expect it to be as clever as it was, the unknown plays a huge part in the story and it's what keeps these characters going, having a strict set of rules to ensure there survival, although I wouldn't consider it a horror movie even if there are elements around it I see it as more of a post apocalyptic, this flick has minor flaws, nothing that will distract you or feel your being cheated. The acting in this one is superb all three actors bring the A material you see the family dynamic work masterfully. I don't get why Zoe gets so much backlash I felt her to be genuine and her reactions to be perfectly normal due to the situation, you can tell she acts her age. trust me it's worth the watch.",
         "I watched the trailer and was pretty lost on what it was going to be about. I decided to give it a try since I had never heard of it and it looked...different. I started it and I must say I remained lost for a while and on top of that a little bit bored with how slowly the story was developing. I think the actors did a very good job throughout the slow process which helped maintain my interest. The kicker for the 8/10 was the plot twist,though. Not only did the movie take a massive turn but it explained everything as well. I love twists that I absolutely do not see coming and this gave me just that and it also left me wanting to tell someone else to watch it. Certain points were weak, as most movies tend to have those, but overall the story came together. The end was a bit \"silly\" in my opinion but it continued to add a final bit of flavor to a movie that started out so very bland. Absolutely worth seeing just for a movie that does a complete 180 and deals a pretty good game toward the end. I'd hate to tell someone to watch a boring movie just for the end, but this one will be worth it in my unprofessional opinion.",
         "I am a sci/fi buff, so maybe I am more critical than a horror fan, but this movie has so many things wrong with it. First, who happens to find a fully stocked shelter in the middle of a disaster by a schoolyard, with nobody in it? Secondly, these are intelligent suburbanites in California, yet they call military personnel wearing gas masks \"breathers\", as if they are some kind of new monster. Thirdly, the whole movie is filmed in a small, dimly lit area and dragged on for eternity. Finally, when the surprise ending came I was relieved I could turn it off. Many more loose ends, such as what were their plans for when the food ran out and what about their kid and her future? Only gave it the extra star for not having offensive material.",
         "The plot and story held up until the last thirty minutes of the movie when the viewers are introduced to the antagonists. Without getting too far into the origins of the apocalyptic setting, we find out there is a \"virus\" that everyone is escaping from. Then the directors/writers/producers throw a curve ball, a cinematic Shyamalan-twist that belittles the audience's anticipation for a monster-ending. Instead, we find out the family is infected with the virus, and they turn into C.H.U.D.s (Cannibalistic Humanoid Underground Dwellers{or maybe just H.U.D.s}). They have the ability to flip the mutation/virus on and off when they feel threatened. So yeah, a bit disappointed that the \"breathers\" weren't giant, mutated beasts, but not entirely disappointed with the movie overall. Decent story, plot, acting up until the last 30 minutes . . . and where were they taking shits?",
         "If you've seen the plot synopsis for Hidden, you've probably realized how short it is. Consider yourselves lucky, as this simply incredible, amazing and superbly done film is best enjoyed knowing as little as possible about it. The main scenario is extremely familiar: the end has come, a group of survivors takes shelter, trying to hang on to their lives while hiding from the \"breathers\" that forever lurk above the surface. Sounds banal and unoriginal, doesn't it? Trust me, nothing could be farther away from the truth. The film portrays the dynamics between two parents trying their best to give their daughter a life worth living in a school bomb shelter where they have been hiding for the past 300 days. Their everyday problems include rationing canned food, drawing water, and being there for each other. The acting is absolutely incredible by all three protagonists. Alexander Skarsgård, as the father Ray, is definitely the family's rock, barely but constantly managing to keep hope alive and cheer up both his daughter and his wife during their impossible predicament. Andrea Riseborough, as the mother Claire, plays an excellent middle link, both supporting Ray in helping their daughter and being supported by him during her moments of despair. If Ray's the rock, she's definitely the glue, taking full charge in the very few moments when Ray's immaculate yet human composure fails. Emily Alyn Lind, as the daughter Zoe, is amazingly professional and convincing as the little 9 year old, trying to adjust to a life where she has no friends, very little food and pass-time activities, and is constantly tormented by nightmares and fear of being found. The scenes where Ray comforts Zoe are heartfelt and overwhelming, and only the truly hard can avoid shedding a tear (I couldn't). The story is intriguing, compelling and suspenseful, and the viewer finds themselves attached to the characters and worrying about them from the very beginning. The excellent script and direction work by the Duffer brothers, along with the spectacular acting, have made the characters relatable and lovable. The amazingly clever plot twist easily gives titans like the Saw series or The Sixth Sense a run for their money, and the entire turn of events is realistic and convincing, and in no way too \"Hollywoodic\" (for better or worse). I admit that I find it hard to rate Hidden objectively, as it's been a while since I've enjoyed a film so much. The scary parts are realistically frightening, the emotional scenes are realistically touching, and the all the situations simply feel entirely real. By far the best \"Post-Appocalyse/Zombies\" film I've ever seen. I can't recommend it enough. Not only a must see, but absolutely Oscar material (in a better world where the Horror genre receives its due fame). I believe many of you will find some shortcomings, certain features that could have been done better and should deduct a few points from Hidden's overall score. I humbly admit that I couldn't, and wouldn't want to. A well earnt and deserving perfect 10!",
         "Hidden by delightfully embedded narrative screws, the schematic of the post-apocalyptic zombie parable is turned on its head in a film duly concentrated on containment, quarantine and the adverse social affects of victims of bio-terrorism. As much as the set-up implies, the discernible threat of radioactive outbreak and impending annihilation is not the fundamental focus of this surprisingly insightful feature. This is not another walking dead leitmotif - far from it - this is its topical divergent. That the film conceals this so brilliantly until the end of the story, even by process of analeptic flashbacks digging towards the reveal, is a merit to how well the film's mise-en-scene is devised. Taking refuge in an underground fallout shelter outside a school atop a quaint suburbia, a family of three decide upon a methodically war-time, rationalistic survival in sustaining their existence from the catastrophic perils outside - the supposition of a viral outbreak and the consequential obliterative decay. Hence the film resorts to shooting a large chunk of the story within the minimalist locale in creating an intensified claustrophobia and an appetising mystery in stark correlation to the undisclosed remnants of the outside world. Such restraint on locality requires, accordingly, ample identification with the characters and their development. Such is established and refined by a magnificent cast-chemistry with tenable performances in due course to a sensationally written script full of dexterity in dialogue. One fine example of this is the audience's presupposed qualities of the conflictual creatures referred to as 'breathers'. Though wonderfully juxtaposed between past and present narratives in stringing along the sense of an investigatory closure, the film is at minor fault in bottle-feeding its penultimate reveal in a rehashing montage of prior scenes and dialogic double-entendre, but this shouldn't detract from the mischievous marvel of a film that utters against the grain.",
         "This was a terrible dark movie. And yes. That might be something good. Yet here... Not so much. Most of the movie was shot in the dark. So really no way of telling what was going on. Besides that: many \"flaws\"... A rat eating through a can without leaving a trace; A shelter with two \"entrances\" (one a door, one a \"window\"). One entrance that needs two ladders to climb out. The other can be climbed with the help of another person. Yet the floors of the shelter aren't mounting; Worrying about smoke leaving the shelter. Fine. Sure. But ashes leaving the shelter from a small fire? Not so much...; Creatures walking on top of shelter. They (inside) try to stay still and silent. Yet they don't worry too much (read: at all) about the lights that are still on and shining through their \"window\". They're leaving through the \"window\" when the breathers are entering their \"door\" rather slowly, and don't seem to care that the window and the door are in plain visible sight of each other (hence: girl watching the door from the window with the \"periscope\" earlier). Ehm... I really could go on for a while. This film had quite a good plot. But come on: it wasn't too realistic (a school shelter with only a hand full of bunk beds?). I never felt any tension at all while watching it, I was that much annoyed by flaws. Oh well. Maybe it's just me..."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Primal Pictures (II)",
         "Warner Bros."
      ],
      "summaries": [
         "In the film, Ray (Skarsgård), Claire (Riseborough) and their seven-year-old daughter, Zoe, are an average American family in Kingsville, North Carolina - except they have existed in a bomb shelter since escaping a day of devastation that changed everything. For 301 days, they have transformed their cement prison into a home, holding on to memories of the past and hope for a normal life someday. And for 301 days, the family has eluded what looms above the surface - the heavy breathing and booming footsteps that punctuate the night, threatening their fragile existence. All the while, the family has managed to stay hidden. Until now. Now their safe haven has been breached... and something is coming for them.",
         "In Kingsville, Ray, his wife Claire and their little daughter Zoe \"Zozo\" have been living in an underground shelter for three hundred days hidden from the \"Breathers\". They have created and follow four rules to stay alive. Ray frequently recalls when an outbreak reached Kingsville and the army bombed the whole town during the quarantine, and he believes they are the only survivors. When they find that many supplies have been stolen from the pantry, Ray finds that a rat is the responsible. They chase the rodent and there is an accident with a kerosene lamp that burns a table. Now they are afraid that the \"Breathers\" might have seen the smoke. Will they be safe in the shelter?",
         "A family takes refuge in a bomb shelter to avoid a dangerous outbreak."
      ],
      "budget": 0
   },
   "movielensId": 142999,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-09-15",
      "dvdReleaseDate": null,
      "directors": [
         "Ross Duffer",
         "Matt Duffer"
      ],
      "runtime": 83,
      "movieId": 142999,
      "title": "Hidden",
      "mpaa": "R",
      "actors": [
         "Alexander Skarsgård",
         "Andrea Riseborough",
         "Emily Alyn Lind",
         "Heather Doerksen",
         "William Ainscough",
         "David Lewis"
      ],
      "imdbMovieId": "2131532",
      "originalTitle": "Hidden",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": ["e5HvOjois-E"],
      "plotSummary": "A family takes refuge in a fallout shelter to avoid a dangerous outbreak.",
      "tmdbMovieId": 360784,
      "avgRating": 3.44393,
      "releaseYear": "2015",
      "numRatings": 107,
      "posterPath": "/iyqwK3UU1KHR9Ey5tw5amRhSRXJ.jpg"
   }
}