{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gay interest",
         "id": 10199
      }],
      "imdb_id": "tt0779722",
      "video": false,
      "title": "Amnesia: The James Brighton Enigma",
      "recommendations": [
         41922,
         6511,
         87107,
         73252,
         140208,
         39544,
         17539,
         9098,
         19958,
         51913,
         19654,
         21056,
         16240,
         86549,
         15850
      ],
      "backdrop_path": "/sNWAqyj0iRgNXRLtq5uahgqT6BO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Brendan",
               "gender": 0,
               "credit_id": "52fe45249251416c7504d0c7",
               "name": "Julian Casey",
               "profile_path": "/2XNBwtsBAtSnoYDnkGe0C1qShlm.jpg",
               "id": 29461,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "James Brighton / Matthew Honeycutt",
               "gender": 0,
               "credit_id": "52fe45249251416c7504d0cb",
               "name": "Dušan Dukić",
               "profile_path": "/we7xOgH5shk0AgukAwMHdKzEm4o.jpg",
               "id": 84832,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "599e4dafc3a3685a580049c0",
               "name": "Karine Lavergne",
               "profile_path": "/ehNUkDO7ou4HkT6bIe9B9ltcx37.jpg",
               "id": 1875578,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45239251416c7504d0c3",
            "name": "Denis Langlois",
            "profile_path": null,
            "id": 73629,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.615769,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 12794,
      "vote_count": 7,
      "budget": 0,
      "overview": "A young man wakes up naked on a pallet on the street in Montreal. Who is he, what is his name? How did he get here? The only thing he seems to remember is that he's gay. And so begins one of the most compelling gay-themed mysteries we’ve seen. Based on a true story, this young man has been through some trauma that caused his memory loss -- or is he an imposter avoiding the law in some way?",
      "similar": [
         380874,
         47643,
         413666,
         160165,
         184352,
         383526,
         425193,
         26933,
         258034,
         52799,
         322127,
         26280,
         167571,
         340684,
         449176,
         338189,
         382475,
         261776,
         376867,
         428493
      ],
      "original_title": "Amnesia: The James Brighton Enigma",
      "runtime": 90,
      "poster_path": "/tbrHkHSxPWSdQS19id8IxcNgqkq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "TLA Releasing",
         "id": 328,
         "origin_country": ""
      }],
      "release_date": "2005-01-01",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Denis Langlois"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Bertrand Lachance",
         "Denis Langlois"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0779722/",
      "coverLink": null,
      "actors": [
         "Dusan Dukic",
         "Tyler Hall",
         "Derek Lebrero"
      ],
      "reviews": [
         "The young amnesiac who awakes in Montreal knowing nothing of himself except that he is gay--the central key to his story--is excellently and sympathetically acted by Dusan Dukic, with generally fine performances by the supporting players as well. The story is a fascinating one, sensitively posing core philosophical questions of the meaning of identity, the effects on a person of suddenly losing it, the rewards and the risks of regaining it, and above all, the ways in which its loss affects one's relationships with others, present and past, and with oneself. The screenplay successfully avoids the clichés and psycho-babble that can afflict stories of this sort, emphasizing instead the mystery that is at the heart of the tale: how and why has this young man lost his memory? The difficulties everyone has attempting to unravel it comprise most of the plot and consistently hold the viewer's interest. The film's primary shortcomings are occasionally awkward transitions that can leave the viewer confused, and supporting characters who are too often underdeveloped or ill-explained and who arrive and disappear from the story with frustrating rapidity. Nevertheless \"Amnesia\" is a fine film, both entertaining and thought-provoking.",
         "AMNESIA: THE JAMES BRIGHTON ENIGMA (Amnésie: L'énigme James Brighton) is an independent Canadian film based on fact, but with alterations of names and places to protect/enhance the real people. The title's two operative words are 'amnesia' and 'enigma' because watching this film places the viewer in the uncomfortable position of confusion as to fact and fiction - a state of main that must imitate the art of the story! The story is a version of an incident that occurred in 1998: a young nude lad was found in a deserted lot in Montréal, taken to a hospital where he was found to have total amnesia except for the fact that he knows he is gay and he believes his name is 'James Brighton'. The story is enhanced by a strong script by Bertrand Lachance and Denis Langlois (who also directs) and by a cast that is able and convincing, especially the main character James Brighton/Matthew Honeycutt (Dusan Dukic). The grit of the film lies not so much in the storyline (that becomes fragmented at regular intervals due to the moments of memory return the main character experiences), but instead in the manner in which our amnesiac struggles to find his identity, a family, and a sense of belonging. Through the help of social workers, detectives, a gay hotline service, and the media the 'true' identity is slowly unveiled, but not without some serious setbacks - often presented to us as flashback bits and pieces as to who our amnesiac may be. The transitions between the Montreal scenes and the subsequent scenes in Tennessee (the apparent home of the amnesiac now known as Matthew Honeycutt) are choppy with sidebars of Pentecostal church services adding to the confused mix. Yet in the end the pleasure of the film is up to the viewer's interpretation of all the 'facts' that have been discovered: we are allowed to participate in the enigma. In Québecois, French, and English with variable subtitles. Grady Harp",
         "I just saw this film on DVD and thought it was very good. Based on true events the story tells of an American man found naked on a park bench in Monreal who has no idea who is is or how he got there. He is taken to hospital where he eventually realizes that he is gay and his name is James Brighton. The search is then on to find this man's identity since no one has reported him lost. He is taken in by a gay support group who help him find out who James Brighton is...which we find out is not this man. Has he stolen an identity or is he really amnesic? And who is the real James Brighton? Shot mostly on video the quality is quite good as is the acting. The film is in both French and English with English subtitles were required.",
         "It's a very hard task trying to describe the contents of this picture. The director's purpose was to link the story of the amnesiac to the condition of being gay. But there is more than that. The loneliness which affects so deeply this man who's lost his memory can be related to every human being. It's an experience that touches generally men or women who live in a special condition. Denis Langlois provides an effort which can help the existence of many people who experience alienation, loss, abandon, and many other ugly things. I was a bit disappointed seeing that this feature was only presented in gay cinema festivals. In my opinion, this needed a wider release. By this time, this is the last DL's feature. I sincerely hope we'll see more of him, for he is a very original and talented director, full of innovation in the field of human relationship.",
         "The most intriguing thing about this film is the title which would lead any curiosity seeker to view it based on the sparsity of reviews and the always intriguing subject of amnesia. The story is apparently a well known one and appeared on the HARD COPY reality TV show several times and is the sort of film whose story of a young, attractive man found in the middle of a seedy part of Montreal stark naked who has no idea who he is and only knows he is gay and the name James Brighton. An irresistible idea for a film which would appeal to both gay and straight audiences, but the good looking amnesiac makes for all the right stuff for the Film Festival circuit. Unfortunately, that's how it comes off. The nude young man is carrying a torn piece of paper with a town name and phone number without an area code.There are only a minimal of places one could have found it and that is not explained. Nor is why they never comb the United States area codes? He speaks English, but for some reason teach him French when he is in rehabilitation and where he meets a variety of people who do and don't believe his story and a young lady who is writing a thesis on the human mind. Just when you think he might be attracted to her, we see her in bed with a black, hip chick who thinks he is pulling a fast one on the world. Why intimate the attractive researcher was gay/bi? The main strength the film has is that it keeps you wondering just what his story really is, and it becomes apparent to me, that his life was so damned dull I would have checked out and gotten lost too. In the hands of a master film maker like Hitchcock, this film would have been one of his least favorites unless he let his wife rewrite the young man's life, make the young lady a silky blonde and have the amnesiac recover his memory while hanging from the Eiffel Tower.",
         "Amnesiac with minimal personal memory shows up in Montreal, with just knowledge of being gay, a name James Brighton and a chit of paper with a town name and a phone number, which doesn't check out. Months pass. At times I felt I was watching paint drying and just yearned, oh how I yearned, for him to hurry up and recover his memory. But the intrigue continued as a new identity for him showed up - where had these folk been all these months, why hadn't they reported him missing, were they themselves for real? It was all a puzzle. Common sense told me the guy had suffered some mental trauma, obviously not a rape to himself as even stupid doctors would pick that up. So what was it? The flashbacks suggested abduction. Exorcism? I watched on. That's the point of this film, it hooks you in and you keep watching. But in the end the flaw of the film is that the hero is such a blank canvas you ultimately don't really care who he is. Which is a shame, as he is not lacking in some good looks."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Les productions Castor & Pollux Inc."],
      "summaries": ["An American is found naked and amnesiac in a vacant parking lot in Montreal in 1998. He says his name is James Brighton, but the only thing he's sure of is that he's gay. What happened to this young American in search of freedom ? That's what Sylvie, a criminology student, tries to find out."],
      "budget": 871592
   },
   "movielensId": 143418,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2005-01-01",
      "dvdReleaseDate": null,
      "directors": ["Denis Langlois"],
      "runtime": 90,
      "movieId": 143418,
      "title": "Amnesia: The James Brighton Enigma",
      "mpaa": "",
      "actors": [
         "Julian Casey",
         "Dušan Dukić",
         "Karine Lavergne"
      ],
      "imdbMovieId": "0779722",
      "originalTitle": "Amnesia: The James Brighton Enigma",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young man wakes up naked on a pallet on the street in Montreal. Who is he, what is his name? How did he get here? The only thing he seems to remember is that he's gay. And so begins one of the most compelling gay-themed mysteries we’ve seen. Based on a true story, this young man has been through some trauma that caused his memory loss -- or is he an imposter avoiding the law in some way?",
      "tmdbMovieId": 12794,
      "avgRating": 2.625,
      "releaseYear": "2005",
      "numRatings": 4,
      "posterPath": "/tbrHkHSxPWSdQS19id8IxcNgqkq.jpg"
   }
}