{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0369738",
      "video": false,
      "title": "Moscow Heat",
      "recommendations": [],
      "backdrop_path": "/i4IP8Gy5X0UlZMo9EfWglqI0Dei.jpg",
      "revenue": 1100000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rodzher Chembers",
               "gender": 2,
               "credit_id": "52fe4a6bc3a36847f81ccc8d",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vlad Stepanov",
               "gender": 0,
               "credit_id": "52fe4a6bc3a36847f81ccc91",
               "name": "Alexander Nevsky",
               "profile_path": "/9rrILokBl0QOPemA2WxDjgxmkRl.jpg",
               "id": 146402,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nikolay Klimov",
               "gender": 2,
               "credit_id": "52fe4a6bc3a36847f81ccc95",
               "name": "Richard Tyson",
               "profile_path": "/fiGyqTvujEfbeN4j7qWjsSYujlr.jpg",
               "id": 14700,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Rudi Souza",
               "gender": 2,
               "credit_id": "54668af722136e15bf00044c",
               "name": "Robert Madrid",
               "profile_path": "/yNIX3fki3VW1btDzCuJRGBNLrRR.jpg",
               "id": 154548,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Uzhton",
               "gender": 2,
               "credit_id": "52fe4a6bc3a36847f81ccc9d",
               "name": "Andrew Divoff",
               "profile_path": "/3ana0vJs5uLDXb6dSHvp5naKmcl.jpg",
               "id": 36218,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sasha",
               "gender": 1,
               "credit_id": "52fe4a6bc3a36847f81ccca1",
               "name": "Joanna Pacula",
               "profile_path": "/697EWuER2k3lQ4oNZdYdkU6cvvd.jpg",
               "id": 36059,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Endryu Chembers",
               "gender": 2,
               "credit_id": "52fe4a6bc3a36847f81ccca5",
               "name": "Adrian Paul",
               "profile_path": "/3BNKgYUbcWw7v9oIsPOW6fVlpkq.jpg",
               "id": 71900,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56f61a85c3a3686a59001f45",
               "name": "Robert Madrid",
               "profile_path": "/yNIX3fki3VW1btDzCuJRGBNLrRR.jpg",
               "id": 154548,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56f61b6d92514130070000a5",
               "name": "Alexander Nevsky",
               "profile_path": "/9rrILokBl0QOPemA2WxDjgxmkRl.jpg",
               "id": 146402,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56f61b9bc3a3686a59001f76",
               "name": "Jeff Celentano",
               "profile_path": "/l8RRbTRHycVk6Q83Ejr5caOYSX0.jpg",
               "id": 93922,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56f61d06c3a36816e8001b7d",
               "name": "Philipp Fedorov",
               "profile_path": null,
               "id": 1596388,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56f61d2ec3a3686a5e00226d",
               "name": "John B. Aronson",
               "profile_path": null,
               "id": 1308306,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56f61d4fc3a36816e8001b94",
               "name": "Richard John Baker",
               "profile_path": null,
               "id": 1350137,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.572775,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 106546,
      "vote_count": 3,
      "budget": 0,
      "overview": "After a U.S. policeman is killed by black market weapons dealers, his partner, Rudy (Robert Madrid), and the murdered cop's father, ex-British Intelligence agent Roger Chambers (Michael York), head to Moscow to find the killers. The two begin to track down their targets, but their plan falters when Rudy's injured and Chambers is arrested. Enter Vlad (Alexander Nevsky), a Russian officer who's willing to help the men complete their mission.",
      "similar": [],
      "original_title": "Moscow Heat",
      "runtime": 89,
      "poster_path": "/dBL3Zfo4cHIxMHXD5EjoQWcP3yQ.jpg",
      "spoken_languages": [
         {
            "name": "Polski",
            "iso_639_1": "pl"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Kinokompaniya \"Tsar\"",
         "id": 74682,
         "origin_country": ""
      }],
      "release_date": "2004-11-24",
      "vote_average": 1.3,
      "belongs_to_collection": null,
      "tagline": "Vengeance is only the beginning...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Celentano"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Alexander Nevsky",
         "Robert Madrid"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0369738/",
      "coverLink": null,
      "actors": [
         "Michael York",
         "Alexander Nevsky",
         "Richard Tyson"
      ],
      "reviews": [
         "A retired diplomat, played nicely by Michael York, goes to Russia to get revenge on the Russian gangster that murdered the diplomat's policeman son. There the diplomat meets an exceptionally strong and decent Russian cop who helps him bring the Russian gangster to justice. I remembered the old action flicks of the 1980s that always portray the Russians as evil bad guys out to undermine the righteous U.S. government. It's interesting to see this time the Russian guy as a hero. Not a great flick, it's really typically a \"B\" action flick. Michael York lends some class to this mediocre movie. Alexander Nevsky, who plays the Russian cop is kind of \"blah\" but surprisingly has some chemistry with Michael York. Face it, Michael York is such a good actor that he'd have chemistry with anyone he's doing a scene with. Disappointingly, the handsome Adrian Paul gets killed within the first 15 minutes into the movie. Now, if Adrian Paul was in this movie longer, it would've been an above average \"B\" action flick. All I can say about Adrian Paul is that he is real nice to look at for the first 15 minutes of the movie. The villain, played by Richard Tyson, is your typical bad guy. He's very blonde and very villainous in this movie. Rent this flick if there is nothing else on TV to watch. It's okay. It doesn't suck too bad. The action scenes are decent. The acting could be better, the plot could've moved much faster, but hey, you get to see what Russia looks like today!",
         "But it does have some good action and a plot that is somewhat interesting. Nevsky acts like a body builder and he isn't all that attractive, in fact, IMO, he is UGLY. ( his acting skills lack everything! ) Sascha is played very well by Joanna Pacula, but she needed more lines than she was given, her character needed to be developed. There are way too many men in this story, there is zero romance, too much action, and way too dumb of an ending. It is very violent. I did however love the scenery, this movie takes you all over the world, and that is a bonus. I also liked how it had some stuff about the mafia in it, not too much or too little, but enough that it got my attention. The actors needed to be more handsome...The biggest problem I had was that Nevsky was just too normal, not sexy enough. I think for most guys, Sascha will be hot enough, but for us ladies that are fans of action, Nevsky just doesn't cut it. Overall, this movie was fine, I didn't love it nor did I hate it, just found it to be another normal action flick.",
         "This movie is a vehicle for Schwarzenegger-clone Alexander Nevsky. His charisma however is insufficient to lift this movie above the level of its poor script. He has little to add to his Arnie-act. Michael York is quite pathetic as the begging diplomat. Watching him revisit his D'Artagnan-act from the time that he was a better actor made me feel uneasy. Come on, you can do better than that! The story is full of holes and unexplained relations; top of this bill is the informer of Vlad, who sounds like an American woman, but from the context appears to be working for a Russian government-department. Although the story takes place well after the end of the Communist-regime, all the Russian characters are still very communist-like. In contradiction to that, Vlad is allowed to drive a pimped up all utility vehicle as police-car. The action scenes are poorly shot and therefore lack dynamics. Not a must see movie...",
         "It felt like I watched this movie thousand times before.It was absolutely predictable.Every time the story tried to get a bit twisted,every time I awaited something interesting to happen, I saw nothing but what I expected. Like \"The bread factory opened up another facility,because there was not enough bread\". In two words:Flat story,that has become a cliché,bad acting,bad special effects...Only the dumb Russian cop,Vlad, was a bit funny while punishing around the bad guys.The pile of muscles was so incredibly STUPID,that it made me laugh at him for a moment. I wonder why i waste my time spitting on that shame-of-a-movie... It won't get worse (because it is not possible) :D",
         "Roger Chambers (York) is a dashing former diplomat who loves fencing. His friend Rudy (Madrid) convinces him to take the trip to Moscow to try and track down the evil Nikolai Klimov (Tyson), who is responsible for the death of his son. While there, the Russian authorities figure out what they're up to and they don't like it. Hulking brute and police Captain Vlad Stepanov (Nevsky) ends up getting sucked into the quest to take down Klimov and his minions. With Rudy in the hospital, and Roger basically under arrest, it's up to Vlad to try and win the day. Can he do it? Moscow Heat is typical 2000's DTV product. It has a junky look, some very unfortunate green-screen effects, obvious dubbing, stilted dialogue, and plenty of silly moments. It also looks much older than it is, it seems like it came out in the early 90's. (The \"bullet time\" shot is very Sniper, 1993). The biggest lingering question seems to be why Michael York is involved. Maybe he wanted a trip to Russia. Or maybe Alexander Nevsky has a lot of pull. Alexander Nevsky, not to be confused with the medieval military hero and later Saint who lived from 1220 to 1263, or the 1938 Eisenstein film about him, THIS Alexander Nevsky apparently is a bodybuilder who co-wrote, co-produced and stars in his movies. At this rate, he could be the next Jorgo Ognenovski. But according to the back of the DVD box, \"he could be the next Schwarzenegger!\" Really the only thing they have in common is an impenetrable accent. (Though to be fair, there is a boat in the movie named \"The Terminator\". Coincidence?) In this movie, it takes too long for him to snap into action. But he does get his prerequisite torture scene. Richard Tyson plays the evil blonde guy (you know he's evil because he's blonde). Joanna Pacula has basically a sit-down role and should have done more. Same with Adrian Paul, who has very little screen time. Same thing again with Andrew Divoff. Characters play chess and drink vodka, and one of the baddies has a \"Russia\" jacket. On the one hand you want to get the Russian feel and atmosphere, but on the other hand you want to avoid clichés. So what can you do? But in the end we felt the whole experience was a bit dry and instead of Michael York futzing around, it should have been Nevsky mowing down baddies with a machine gun right from the jump. Unfortunately that's not the case. Maybe he'll learn his lesson and do that in the future. The music by Richard John Baker features an electric guitar theme that is very reminiscent of the days of Genesis and Super Nintendo, further emphasizing the \"this actually isn't a movie from the 90's\" feel. While we look forward to more producing/writing/acting or even directing from Nevsky, we felt Moscow Heat didn't tap into his promise as a potential DTV star.",
         "**SPOILERS** After his son NYPD detective Andre, Adrian Paul, was killed on a raid on Russian mobster Nikolay Kilmov upstate New York secret hide out Andre's father retired US diplomat Rober Chambers, Michael York, decided to track Kilmov down in his native Moscow and bring him to justice. Going to Moscow with Andre's partner in the NYPD Rudy Sosa, Robert Madrid, Chamber had no trouble at all finding Kilmov at a swanky Moscow nightclub but apprehending him was another story. In a wild shootout with both Chambers Rudy and members of the Moscow police department Kilmov made his escape killing Moscow police squad leader Denis, Jeff Celentano, in the process. Unknow to Chambers he got an unexpected ally in his hunt for the dangerous and elusive Kilmov Denis' good friend and partner in the Moscow Police Department Alexander Nevsky, Vlad Stepanov,to help him! Forming an unsays alliance Chambers and Stepanov work together, sometimes against their better judgment, to track down Kilmov and his gang of illegal arms dealing hoodlums. It also turns out that Kilmov is being protected by higher ups in both the police and Moscow City Administration in making illegal arms deals with any number of terrorists organizations, including El-Qeada, with them getting a cut in the profits! It's now up to Chambers and Stepanov to go on their own, with the Moscow PD under orders to lay off, against the Kilmov Mob before they sell a number of suitcase nuclear bombs to be used by international terrorists groups like Al-Qeada that would end up making the attacks of 9/11 look like child's play. It's former prize fighter and bodybuilder Alexander Nevsky who makes the film worth while as the soft spoken and head cracking Moscow cop Vlad Stepanov. Taking on both the Kilmov Mob and Moscow's corrupt politicians Stepanov has no trouble putting them away even, when he's later captured, with both hands tied behind his back. ***SPOILERS*** Chambers who uses his diplomatic connections to track down the Kilmov Mob soon finds out that they, those he trusted, set him and his crime fighting partner Stepanov up to be whacked by Kilmov & Co. It's Stepanov superhuman strength and endurance as well as Chambers expertise in fencing that not only got them out of that dangerous fix but put and end to not only Kilmov but those who were protecting as well as dealing with him. Playing a part that Arnold Schwarzenegger would feel very at home with Nevsky actually eclipses him in the film in how much bigger and muscular he is compared to the former movie Terminator. Standing at 6 foot 7 inches and weighing over 300 pounds, all solid muscles, with eye popping 23 inch arms Nevsky makes Arnold look like Danny DeVito, Schwarzenegger diminutive co-star in \"Twins\", when compared to himself!"
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": ["Czar Pictures"],
      "summaries": ["A retired Diplomat and an NYPD Detective seeking justice, pursue a psychotic murderer to Moscow. When the Detective is wounded and the Diplomat is arrested, they are assigned to be deported by a Russian Police Captain, who becomes an unlikely accomplice in exacting their revenge on an international black market nuclear arms dealer."],
      "budget": 0
   },
   "movielensId": 143432,
   "movielens": {
      "languages": [
         "Polski",
         "Pусский"
      ],
      "releaseDate": "2004-11-24",
      "dvdReleaseDate": null,
      "directors": ["Jeff Celentano"],
      "runtime": 89,
      "movieId": 143432,
      "title": "Moscow Heat",
      "mpaa": "R",
      "actors": [
         "Michael York",
         "Alexander Nevsky",
         "Richard Tyson",
         "Robert Madrid",
         "Andrew Divoff",
         "Joanna Pacula",
         "Adrian Paul"
      ],
      "imdbMovieId": "0369738",
      "originalTitle": "Moscow Heat",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After a U.S. policeman is killed by black market weapons dealers, his partner, Rudy (Robert Madrid), and the murdered cop's father, ex-British Intelligence agent Roger Chambers (Michael York), head to Moscow to find the killers. The two begin to track down their targets, but their plan falters when Rudy's injured and Chambers is arrested. Enter Vlad (Alexander Nevsky), a Russian officer who's willing to help the men complete their mission.",
      "tmdbMovieId": 106546,
      "avgRating": 1.33333,
      "releaseYear": "2004",
      "numRatings": 3,
      "posterPath": "/dBL3Zfo4cHIxMHXD5EjoQWcP3yQ.jpg"
   }
}