{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "quebec",
            "id": 3356
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "political satire",
            "id": 169086
         }
      ],
      "imdb_id": "tt4116116",
      "video": false,
      "title": "My Internship in Canada",
      "recommendations": [
         382509,
         377278
      ],
      "backdrop_path": "/AkA08Bc8nmv6tWn1c3lKRyabgqA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steve Guibord",
               "gender": 2,
               "credit_id": "55c9f3bd9251410c52001b51",
               "name": "Patrick Huard",
               "profile_path": "/UgSNJRU47uRVBPOulrFjvjbUuS.jpg",
               "id": 142995,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Souverain",
               "gender": 2,
               "credit_id": "573b5e4ac3a3684e1e000272",
               "name": "Irdens Exantus",
               "profile_path": "/rUaNfKUOnL4m5mOM4pw6XX1RIBb.jpg",
               "id": 1621572,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Suzanne",
               "gender": 1,
               "credit_id": "55c9f431c3a368752f001c0b",
               "name": "Suzanne Clément",
               "profile_path": "/zBvobKM2I248dAbGVZNr9ltprpf.jpg",
               "id": 142689,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lune",
               "gender": 0,
               "credit_id": "573b5e6392514113a4000298",
               "name": "Clémence Dufresne-Deslières",
               "profile_path": "/7feJLiYL7rvSRf8ebTKvzXL7q83.jpg",
               "id": 1162587,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Stéphanie Caron-Lavallée",
               "gender": 1,
               "credit_id": "594f11fc925141310c042009",
               "name": "Sonia Cordeau",
               "profile_path": "/499A7cFo78J2xg0tfucyNOuSWRD.jpg",
               "id": 1578300,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Premier ministre",
               "gender": 0,
               "credit_id": "573b5e72c3a3684e120002ec",
               "name": "Paul Doucet",
               "profile_path": "/78MDubrmJdwJpvP7iOhKA16pbew.jpg",
               "id": 145749,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Maire",
               "gender": 0,
               "credit_id": "594f122dc3a368328b03b403",
               "name": "Jules Philip",
               "profile_path": null,
               "id": 227601,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Rodrigue",
               "gender": 2,
               "credit_id": "594f1257c3a36832bd040535",
               "name": "Robin Aubert",
               "profile_path": "/nCoHeKMgZz531mJw90PfmUgyBdZ.jpg",
               "id": 234199,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Optimiste",
               "gender": 0,
               "credit_id": "594f12799251413155042f3c",
               "name": "Dangelo Néard",
               "profile_path": null,
               "id": 1838628,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Allison",
               "gender": 1,
               "credit_id": "594f129fc3a36832ca0404ca",
               "name": "Ellen David",
               "profile_path": "/8x2bmuUUnyvyD1gyeAZSsVtYMA5.jpg",
               "id": 115592,
               "order": 9
            },
            {
               "cast_id": 6,
               "character": "Mairesse de St-Philémon",
               "gender": 1,
               "credit_id": "573b5e9492514113a7000278",
               "name": "Micheline Lanctôt",
               "profile_path": "/swdDUHk1lzRPwDmHPOKXk3RqUOO.jpg",
               "id": 534894,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Conseiller du Premier ministre",
               "gender": 2,
               "credit_id": "594f12bbc3a3683265047329",
               "name": "Alexis Martin",
               "profile_path": "/q99VgLaqGLJeOeroCSliTDqseUx.jpg",
               "id": 95953,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Professeur Amin",
               "gender": 2,
               "credit_id": "594f12d5925141311f041c53",
               "name": "Paul Ahmarani",
               "profile_path": "/iJc83Aagsajon0PHBJVtLeSue73.jpg",
               "id": 81427,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55c9f389c3a368752f001bf3",
               "name": "Philippe Falardeau",
               "profile_path": "/eDSMQDMyG9vjYmlEzIWgWBTiHpx.jpg",
               "id": 81437,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "578b13da9251417b680046fd",
               "name": "Philippe Falardeau",
               "profile_path": "/eDSMQDMyG9vjYmlEzIWgWBTiHpx.jpg",
               "id": 81437,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.43846,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 304126,
      "vote_count": 13,
      "budget": 0,
      "overview": "Guibord is an independent Member of Parliament who represents Prescott-Makadewà-Rapides-aux Outardes, a vast county in Northern Quebec. As the entire country watches, Guibord unwillingly finds himself in the awkward position of holding the decisive vote to determine whether Canada will go to war. Accompanied by his wife, his daughter and an idealistic intern from Haiti named Sovereign, Guibord travels across his district in order to consult his constituents. While groups of lobbyists get involved in a debate that spins out of control, the MP will have to face his own conscience. 'My Internship in Canada' is a biting political satire in which politicians, citizens and lobbyists go head-to-head tearing democracy to shreds.  Film starring Suzanne Clément, Patrick Huard and Mardy Men",
      "similar": [
         77953,
         9388,
         9451,
         10139,
         9452,
         56339,
         23631,
         35056,
         1547,
         7446,
         109414,
         22538,
         262841,
         914,
         927,
         339967,
         402897,
         9982,
         26389,
         1585
      ],
      "original_title": "Guibord s'en va-t-en guerre",
      "runtime": 108,
      "poster_path": "/87JsnBVmYcFVFix6ypWWfXSEV6o.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "micro_scope",
         "id": 7029,
         "origin_country": "CA"
      }],
      "release_date": "2015-10-02",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Philippe Falardeau"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Philippe Falardeau"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt4116116/",
      "coverLink": null,
      "actors": [
         "Patrick Huard",
         "Suzanne Clément",
         "Irdens Exantus"
      ],
      "reviews": [
         "One day a young Haitian writes letters to all the Canadian Members of Parliament hoping to find someone who will take him on as an intern. His only response comes from Monsieur Guibord, sitting as an Independent, and representing a large remote area of the province of Quebec. The situation turns to chaos and hilarity quickly, when the Prime Minister calls for a vote on an important issue, and Monsieur Guibord's vote is going to make or break the decision. Guibord decides to look to the citizens in his riding to gauge their opinions - and everybody has one !! This being an election year in Canada, this film couldn't have been released at a better time. It takes a serious look at the business of politics, and yet never becomes heavy-handed. If you get the opportunity to see this film, please do so. It is excellent value for the ticket price.",
         "\"We always want what is good for us,\" said Rousseau, \"but we do not always see what it is.\" Often it takes the perspective of an outsider for us to see. Steve Guibord is a Member of Parliament from a remote part of Quebec who is suddenly thrust into the spotlight. When it becomes clear that he has the deciding vote in an important issue before Parliament, whether or not Canada will go to war, he is strongly courted by both liberals and conservatives. Steve is hopelessly undecided about how to vote and to make matters worse, his district and household are equally split. Steve's wife and daughter disagree on how he should vote, and his district includes right leaning miners as well as left leaning First Nations and peace protesters. All want their way with Steve, and who does he have to turn to but Souverain, the young Haitian intern he hired five days earlier and only because he was free. When Steve is responding on camera to the media, Souverain is feeding him quotes from Alexis de Tocqueville, Jean-Jacques Rousseau and Montesquieu. Souverain is chided for this. \"You've been with me five days,\" says Steve \"there's lots you don't know, and this is REAL LIFE we're dealing with here.\" Yet there is lots Steve doesn't know about his own system, district, family, friends and himself, and his life may not be as \"real\" as he thought it was. As Souverain and Rousseau would have it, Steve goes on a \"window to democracy\" tour to hear what voters have to say about the issue. The film is a brilliant satire about democracy and how far we drift from the principles we espouse. I enjoyed the film immensely, in part because I love the subject matter. With degrees in law and political science, and experience interning with lobbyists in Congress, I recognize the truths here. Not only is it a witty satire about modern politics, it is also funny and it offers unique perspectives about different cultures, finding balance in the decisions we make and thinking outside the box, among other things. The only drawback is how it is \"rough around the edges\" and would likely benefit from further monetary support, care and time. Towards the end of the film Steve is asked what he learned. I realized \"I know nothing,\" he says \"and that I have a friend.\" He begins to appreciate what is beautiful around him and that you don't drown just because you fall in the sea. Seen at the Toronto International Film Festival 2015. From the director of the wonderful Monsieur Lazhar.",
         "The most unfortunate fact about this film is that so much nuance would be lost in an English translation, and most won't watch it with subtitles. Cast: The acting was fabulous, and although the Haitian seemed somewhat stereotypical, I would give the director the benefit of the doubt and assume he meant to create a jolly character. He certainly was not stereotyped as unintelligent. Quite the contrary. Content: Not spoon-fed but clear. Excellent. Insightful both on a political and philosophical level. Humor: It is difficult to determine whether this would be funny to someone not well-versed in Quebec culture. But to someone who is, the humor was there throughout even the most serious parts. Nicely done. There is an abundance of blue collar humor that is nevertheless accessible to all. Editing: No obvious problems. Pace: Fast and fluent, with few exceptions. Story: One turn of events could have been better explained, as pertains to the main character's wife. Female characters: One gets the feeling that the daughter's role was written by a woman and the wife's by a man. The former was much better, though this is not a criticism on a feminist level, since both female characters were strong and prominent. Overall, everyone involved in this film should be proud. The Harper parody was hilarious!",
         "I saw this at a film festival and hope it gets wide distribution because it's a hilarious satire of politics. Many laugh-out-loud moments! It's set in Canada, but anyone in the US or elsewhere can identify with the characters, and the chemistry between the two leads is fantastic. The actor who plays the Canadian MP was in another great movie, Starbuck. The actor who plays the intern reminds me of a young Eddie Murphy -- great charisma, timing, and physical comedy. There is also a subplot with his family back home which shows the contrast between cultures and provides lots of laughs. All the supporting players are wonderful. Highly recommended!",
         "I saw \"Guibord s'en va-t-en guerre\" on August 10th at the Locarno Film Festival. Part of the cast, including director Philippe Falardeau, introduced the world premiere of the movie and joked with the audience (almost 5'000 people fitting the stunning setting of Piazza Grande: the outdoor cinema of the festival). I must say that the acting was very good, with solid performances by Patrick Huard, Suzanne Clément and Irdens Exantus. Guibord s'en va-t-en guerre played like a political comedy, sometimes quite funny, but overall boring. I fell asleep a couple of times during the screening (not an easy task, when you are sitting in front of a giant screen of 85x45 feet, filled with loud surround sound."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["micro_scope"],
      "summaries": ["An idealistic young Haitian travels to rural Quebec to intern for an independent Member of Parliament when a national debate erupts that finds the MP holding the tie-breaking vote."],
      "budget": 5400000
   },
   "movielensId": 143412,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2015-10-02",
      "dvdReleaseDate": null,
      "directors": ["Philippe Falardeau"],
      "runtime": 108,
      "movieId": 143412,
      "title": "My Internship in Canada",
      "mpaa": null,
      "actors": [
         "Patrick Huard",
         "Irdens Exantus",
         "Suzanne Clément",
         "Clémence Dufresne-Deslières",
         "Sonia Cordeau",
         "Paul Doucet",
         "Jules Philip",
         "Robin Aubert",
         "Dangelo Néard",
         "Ellen David",
         "Micheline Lanctôt",
         "Alexis Martin",
         "Paul Ahmarani"
      ],
      "imdbMovieId": "4116116",
      "originalTitle": "Guibord s'en va-t-en guerre",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["eSJoV6AljLQ"],
      "plotSummary": "Guibord is an independent Member of Parliament who represents Prescott-Makadewà-Rapides-aux Outardes, a vast county in Northern Quebec. As the entire country watches, Guibord unwillingly finds himself in the awkward position of holding the decisive vote to determine whether Canada will go to war. Accompanied by his wife, his daughter and an idealistic intern from Haiti named Sovereign, Guibord travels across his district in order to consult his constituents. While groups of lobbyists get involved in a debate that spins out of control, the MP will have to face his own conscience. 'My Internship in Canada' is a biting political satire in which politicians, citizens and lobbyists go head-to-head tearing democracy to shreds.  Film starring Suzanne Clément, Patrick Huard and Mardy Men",
      "tmdbMovieId": 304126,
      "avgRating": 2.3,
      "releaseYear": "2015",
      "numRatings": 10,
      "posterPath": "/87JsnBVmYcFVFix6ypWWfXSEV6o.jpg"
   }
}