{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt3740778",
      "video": false,
      "title": "Mountains May Depart",
      "recommendations": [
         12130,
         126529,
         117646,
         47046,
         36895,
         403579,
         17422,
         340448,
         118613,
         83373,
         97943,
         283711,
         54421,
         110391,
         222463,
         121036,
         125829,
         176651,
         31185,
         91067
      ],
      "backdrop_path": "/cggsO9sP9aTlmgI0mAKriTc6HOK.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "5835db049251416d2201a61d",
         "content": "**Like a changing urban landscape, the humans as well!**\r\n\r\nWhen everybody around me liked the director's previous film 'A Touch of Sin', I didn't. As a film fanatic, reject such kind of film is not an easy job without giving a proper reason. I thought that was a missed opportunity. I surely like art films, not the boring one like those aimlessly narrated. I really loved some of the scenes there, but here it was completely different. Most importantly, anybody would understand what the film is trying to say without trying too hard.\r\n\r\nThis is a theme where the China's rise was revealed from the three people's personal life perspective that was categorised to the three generations or the timelines. That's not it, the communism was also highlighted, how it held back the people's freedom. The writer was really smart to smoothly disclosing that to the world. I mean the film never dragged the China's ruling party or its system, but all were told from its character who struggled and if you use your brain, you will get it why.\r\n\r\nThe narration was divided into three episodes. The first one takes place in the year 1999, in a small town somewhere in the China which is economically backward. The story follows a young woman named Tao, who is caught in a love triangle. But for the practical reason, she has to choose one of them and when she does, the other guy leaves the town with the heartbroken. This is the foundation, that dragged for nearly 40 minutes. Obviously slow, but very realistic approach.\r\n\r\nI grew up in the 90s, my country was not much different than what's in this film was shown. So I liked the atmosphere, all those the 90s set, the automobiles, lifestyle, the landscapes of the small towns et cetera taken me back to that time. But the thing is, it was China, society and culturally different. Anyway, it was past and what follows are totally flips the narration, including the perspective.\r\n\r\n> \"You know the hardest thing, about love is caring.\"\r\n\r\nThe second episode takes place in the year 2014, which is something like the present. It reveals what's the status of all the main three characters, like where they're economically standing and the personal life struggles. Tao's married life did not go well and her son is around ten years old who visits her from Shanghai. The one who left the town is now returned and battling for his life for some reason.\r\n\r\nIn the last 15 years, the China significantly changed and still, this entire part is set in the same town which is now economically moved forward. Like the changing urban landscape, how these characters too changed were what focused on this section.\r\n\r\nThen comes the final episode where it is now in the year 2025, that takes place somewhere in the Australia. The perspective was changed, the little boy is now in his 20s, seems lost is root. With his behaviour, you would notice that his lack of knowledge about his ancestors. He who has the differences with his father, decides to make his life as he wanted. That is why the parents should take responsibility to teach their children all the good things about their culture and traditions, and to carry on, it's up to them. Because losing one's identity could lead to the failures in the life.\r\n\r\nThis is the part I liked better. Because it was something like what I encountered in my life. Most of the childhood memories that returns after we're grown-up as the deja vu, like the history repeating itself. Here for pointing out the freedom one to buy a gun was indirectly hit the communism. I mean gun was not a threat, it was just an expressed how it affects people in all the similar circumstances. I meant, what something was hidden brings more eagerness for us to know about it than those are in the out. So forcing something on people is sometime is a bad idea.\r\n\r\nAll the actors were good, but apart from the slow screenplay, I liked the idea of this film. There are some other similar films, like how different generations behave and now this is among them, yet not the best out of all of them. Very much watchable, only if you are capable of handling slow drag. If you know this director very well or the fan of his works, you will find it a pretty interesting film. I won't recommend it, but I also won't either suggest you to skip it.\r\n\r\n_7.5/10_",
         "url": "https://www.themoviedb.org/review/5835db049251416d2201a61d"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "552fa252c3a3686be2006153",
               "name": "Zhao Tao",
               "profile_path": "/zcnM5OPkJAcGwnWhWvtkxjlh30R.jpg",
               "id": 24044,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "552fa2619251415b7a001df2",
               "name": "Sylvia Chang",
               "profile_path": "/2gLgQxPqunlRMdEh57ZXhAjbVZi.jpg",
               "id": 26739,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "552fa277c3a3686be200615d",
               "name": "Dong Zijian",
               "profile_path": "/zBXrP5uRwVQtA1lkRKyzHT7oKm0.jpg",
               "id": 1353695,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "552fa2a892514136ed002765",
               "name": "Zhang Yi",
               "profile_path": "/zJh3O6zzQBpdp6gzkxDas0EfCEM.jpg",
               "id": 146098,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "5623f901c3a3680e1000eb99",
               "name": "Liang Jingdong",
               "profile_path": "/d3KpBTePZwZxgYJ4y91FMo36IU2.jpg",
               "id": 27999,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "5623f97692514171c500eca8",
               "name": "Lu Liu",
               "profile_path": null,
               "id": 1523950,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54a1c994c3a3682f2300d905",
               "name": "Jia Zhangke",
               "profile_path": "/3ktsTI4PzD7MJcdHGp3Mts43n1i.jpg",
               "id": 24011,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54a1c9ce9251414d27008361",
               "name": "Jia Zhangke",
               "profile_path": "/3ktsTI4PzD7MJcdHGp3Mts43n1i.jpg",
               "id": 24011,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5899499792514160a600090c",
               "name": "Shozo Ichiyama",
               "profile_path": null,
               "id": 73141,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a02fa0592514111f9016a1f",
               "name": "Nelson Yu Lik-wai",
               "profile_path": "/7g8aiO4jxaxjCDFKPqrsTbPax9g.jpg",
               "id": 25471,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a02fa1e92514111d2016d2e",
               "name": "Yoshihiro Hanno",
               "profile_path": null,
               "id": 105397,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a02fa299251411201016970",
               "name": "Matthieu Laclau",
               "profile_path": null,
               "id": 1425035,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.389742,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         }
      ],
      "id": 314388,
      "vote_count": 68,
      "budget": 0,
      "overview": "The life of Tao, and those close to her, is explored in three different time periods: 1999, 2014, and 2025.",
      "similar": [],
      "original_title": "山河故人",
      "runtime": 131,
      "poster_path": "/sin5Y3VK7ToIMfMMTW9fNlTrRCi.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shanghai Film Group",
            "id": 3407,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bitters End",
            "id": 4667,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arte France Cinéma",
            "id": 6916,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MK2 Productions",
            "id": 6274,
            "origin_country": "FR"
         }
      ],
      "release_date": "2015-12-23",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zhangke Jia"],
      "runtime": 126,
      "synopsis": null,
      "writers": ["Zhangke Jia"],
      "originalLanguage": "Chinese",
      "imdbLink": "http://www.imdb.com/title/tt3740778/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjMwNjgyMjk1OV5BMl5BanBnXkFtZTgwMzgzNDc5NzE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Tao Zhao",
         "Yi Zhang",
         "Jing Dong Liang"
      ],
      "reviews": [
         "Director Zhangke Jia is not afraid to tackle the problems of modern China, and 'Mountains May Depart' is no exception. The film touches upon issues such as growing inequality, poor working conditions and corruption, but the central theme is the price the country is prepared to pay for its obsession with material progress. The film is set in Fenyang, a northern coal mining city and the director's hometown. In 1999, at the eve of the new millennium, eighteen year old Tao (played by the director's wife Tao Zhao) has to choose between two suitors: the honest but ordinary coal miner Liangzi and the flashy bragger Zhang. She sees right through Zhang's bravado, but can't resist the promise of a better life, symbolized by his red Volkswagen, 'perfect for the next century'. Liangzi feels humiliated and leaves town. Fifteen years later, Tao is well-off, but divorced and unhappy. Her seven year old son is living the good life with his father in Shanghai. Liangzi, in the mean time, is terribly ill and returns to Fenyang. Filled with remorse, Tao helps him financially but doesn't seem to be able to relate to him on an emotional basis. Flash-forward another ten years into the future, and Tao's son is living with his father in Australia. He had to leave China, it turns out, because of anti-corruption campaigns. The boy is a spoilt and clueless brat, who refuses to speak Chinese to his father, but finds some emotional warmth with his Chinese teacher. The first two parts of the film are excellent. Tao's moral choices, the contrast between progress and tradition, the power of money - it's all shown in a beautiful heartfelt way. The director anchors the story with recurring images, like a tall pagoda on the banks of the Yellow River, and spices it with small symbolic items like dumplings and keys. An interesting feature is the changing aspect ratio: in the first episode the screen is almost square, and it widens until it is widescreen in the last episode. Another feature is the way dialogues are filmed: repeatedly the director frames only one participant. And a third peculiarity are some high-impact scenes without a clear meaning or function in the story: a crashing military plane, a coal truck losing some of its cargo, a nervous caged tiger. The sad thing about this movie is that the third part is very different from the first two parts, and lacks the quality of it. Not only are we introduced to different protagonists, also in this part the dialogue and acting are clumsy and unnatural, the story lacks focus and the scenes seem pointless. It's as if the director loses his golden touch when the story leaves China. Still, in this last episode, the message is hammered home: the strive for material wealth leads to emotional poverty.",
         "Jia Zhangke is a prominent figure in contemporary world cinema as one of the leading directors of the so-called sixth generation of Chinese filmmakers. He has become known for his personal films which discuss social transition in modern China through the experience of the individual. Zhangke's latest film \"Mountains May Depart\" (2015) continues this in an essential, if not exactly surprising, fashion. Like \"A Touch of Sin\" (2013) and \"Still Life\" (2006), the film has an episodic structure, but narrative is much more conventional and straight-forward. While there is a lot of change in narrative focalization, \"Mountains May Depart\" is strongly structured around the protagonist Tao, played by the director's muse Tao Zhao, whose life unfolds before us in three distinct periods: 1999, 2014, and 2025. Thus Zhangke takes a look behind, reflects on the present, and anticipates the future of the Chinese society. As a social film, \"Mountains May Depart\" studies the individual in the grip of a changing world. It tackles the difficulty of communication to the extent where parents need interpreters to talk to their children. Globalization, capitalism, and the new freedom of the 21st century do not offer comfort or help, but rather appear as rootlessness, alienation, and solitude in the lives of people. All of Zhangke's films are, more or less, about change, but in \"Mountains May Depart\" this theme manifests itself clearly on the level of style and narrative. Zhangke's narrative includes a modernist combination of perspectives, creating a simple complexity which is never disorienting, as different characters are followed throughout the film, enhancing a pluralist sense of multitude and change. While Zhangke's style has been known as consisting of long takes and complex camera movement, \"Mountains May Depart\" presents a greater variety in style. Zhangke's camera keeps a short distance to the characters, mainly on the level of the medium shot, but there are also memorable establishing extreme long shots which highlight the minuteness of the individual in a vast landscape. The camera does move a lot, though perhaps subtly, but the editing rhythm is not strikingly slow. One of the most conspicuous stylistic elements of the film is the changing aspect ratio. The first episode is shot in the letterbox 4:3 ratio, the second in the contemporary standard 16:9, and the last in the widescreen format 2.35:1. This constant widening of the aspect ratio of the image reflects not only the globalization of the Chinese society and the characters moving outside of their homeland but also a more primordial experience of change that is constant in human existence. It embraces the Heraclitean flux. Thus Zhangke poeticizes the experience of change in a cinematic fashion; that is to say, he utilizes cinematic means to articulate a profound, existential experience of change. This he does by combining features that change (the aspect ratio, the focalizing perspective) with perpetual elements such as recurring songs (\"Go West\" by Pet Shop Boys), dramatic motifs (the dog, the keys), and the intimate cinematography. Like the characters, Zhangke's style and narrative seem to be searching for a red line, something that gives meaning and coherence in a world of change. While \"Mountains May Depart\" might feel like a minor work in Zhange's oeuvre, it does redeem itself for a patient spectator. Like Zhangke's other films, it too looks at the contemporary Chinese society, the inevitable transition from the perspective of the individual, and modern identity in an ever-changing world. Although there certainly is sadness to all this, Zhangke's film is also quite optimistic and bright in comparison to his previous, darker film \"A Touch of Sin\". Mountains may depart -- the very borders of the image may broaden -- but something will endure. It is, in fact, as if higher levels of discourse were trying to find unity amidst variety: something that remains in the perpetual flux of change.",
         "Mountains May Depart starts on perhaps my favourite opening shot of the year. Kicking it off with the Pet Shop Boys' vibrant song \"Go West,\" we're straight in the middle of a dance routine with a room full of people clumsily bopping in sync. It's infectious and filled with unbridled hope and joy. Unfortunately, it's downhill from here, though the film is never aiming for the same type of exuberance. I'm not familiar with Jia Zhangke or his following – Walter Salles apparently has a hotly anticipated documentary about the director at this festival – but Mountains May Depart seems like an endearing and accessible introduction. Telling three stories in three separate time periods, I do enjoy the way it explores causality in how these small relationships and dramas at one time can feed into a dilemma 25 years later. The first story, set during the turn of the century in 1999 when Chinese capitalism was healthy, follows a love triangle between Tao, an aerobics instructor, Zhang, an egotistic entrepreneur, and Liangzi, a man who works for Zhang. The three hang out as friends but Zhang can't bear the idea of Tao getting close to Liangzi and despite emotional logic, it's social economical pressures that make decisions. Cut to 2014, Tao and her beau have divorced and she's now estranged from her son. Upon the death of her father, her son is forced to visit and she must make the decision of how connected she should be to him throughout his life. Then off to an imagined Australia in 2025, her son doesn't remember her and currently struggles with his relationship with his father where they now have a language barrier. With the help of a teacher he grows attached to, he goes in search for Tao. Each section of the film is approached in a different way, reminiscent of the way last year's The Grand Budapest Hotel and Mommy played with ratios. The first section is a tight 4:3, the second is a full frame, and the third is widescreen. However, these feel like they represent the period and the environment moreso than the character's emotions, with exception to the mid- section, which ideally captures Tao's regret and longing. It's a mixed bag depending on the talent, with some tender moments landing strong and some clumsily misguided, the latter most prominent in the last section. That first section has a bait and switch for the decades long heartache that the seemingly innocent love triangle causes. The theme of how people drift apart no matter how close they are resonates but it's unbearably melancholic without Zhangke offering much of a satisfying a silver lining. It's a shame that despite the film's strengths it has too many loose ends and unnecessary moments that don't appear to add to the character arcs or the themes. With a 25 year story like this where no single character carries us through the whole film, every moment has to count to something. There's little justification as to why the third section is in glorious widescreen and set in Australia, but perhaps this just speaks to how disconnected it is from the rest of the film. While mostly drenched in Chinese culture, I wish Zhangke didn't resort to certain American clichés such as sad montages of characters having deep thoughts set to music. However, with those time gaps, Zhangke does harness a powerful nostalgic through just a few song motifs carried through all three sections that are well executed. Both disarmingly simple and complex, his ambition is admirable, but it doesn't quite reach the potential that this expanse allows it to travel. 7/10 Read more @ The Awards Circuit (http://www.awardscircuit.com/)",
         "Saw this movie at the Rotterdam film festival (IFFR.COM) 2016. From the same film maker I saw A Touch of Sin in 2013 (saw it even twice), which experience I found marginally satisfactory (score 6/10), contrary to all positive reviews I've read before and after. I was prepared to give this successor movie as of 2015 a second chance, as it promises much more due to its intention to not only showcase a contemporary China, but also how it has changed/will change over a time span of 25 years. A daring undertaking, particularly as it is not easy to predict what the future looks like over 10 years. Overall I had three general issues. Firstly, I saw unsympathetic characters all over, none of them possible to sympathize with (maybe only Dollar, as he is the product of the others, hence not guilty). Secondly, I saw an illogical story line from begin to end. And thirdly I saw unnatural acting, of which I assume it is typically how Chinese actors behave? (I remember this vaguely from an earlier experience like this, when we were told in the final Q&A that this form of over-acting is normal in China). And I had a fourth issue, last but not least: the bold but failed attempt to cover 25 years (1999, 2014 and 2025). This time span is too large for us to jump through, needing time to pick the differences and the similarities. Especially a miserable attempt was to visualize the future (10 years ahead), because what we saw was not really futuristic and merely a slightly upgraded image of the present. A novel view on a possible future is always interesting, thought provoking at the least. Alas, this one was laughable and underestimated what can happen in 10 years time. Both movies of this film maker show that he is able to deliver an impressive product, both very watchable, but somehow neither landed with me considering its contents. Being interested in far-away countries where we know not much about, movies like this pique my interest and are more informative than what a superficial 3-weeks holiday can ever provide. A film festival like this offers an easy and accessible means to look around in the world.",
         "Finally caught up Jia's latest film in the cinema during my sojourn in China, more than one month after its national theatrical release, quite a long-run if you are familiar with China's booming but money-seeking film market, an art house feature can barely survive even for one week if attendance fails to hold up. Also notably it is his first theatrical release in China after 24 CITY (2008). MOUNTAINS MAY DEPART forms a ternary narrative within 3 different time-span with an ever- wider Aspect Ratio (1.37:1, 1.85:1 and 2.35:1). The first chapter is in 1999, in a Northern east industrial town, on the eve of the millennium, audience is invited to participate in a love-triangle among Tao (Zhao) and her two childhood friends Jinsheng (Zhang) and Liangzi (Liang), the stability of a harmonious triangle (Chinese are too materialistic and selfish to even have the gut to attempt the enticing romanticism epitomised half-an-century ago in JULES AND JIM, 1962) disintegrates when men's possession comes to the fore. Oscillating between a colliery upstart and a destitute coal-miner, Tao's eventual choice is perfectly legitimate if put oneself in her shoes, we might most likely make the same decision - a future capitalist is far superior than a working-class honest man. Then Jia's trademark metaphorical injection of a crashing seeder becomes the harbinger of a downcast future for Tao and at the end of first chapter, the title card belatedly appears on the screen, \"山河故人\", its literal translation should be \"mountain, river and old friend\". The second chapter fast-forwards 15 years to the present, in 2014, Liangzi returns to hometown with his wife and their child, suffering from undisclosed disease due to long-term hard labor, he is desperate to borrow money for his medical treatment, and Tao is his last resort. Divorced from Jinsheng, who has remarried and moved to Shanghai with their son Daole (homophonous to dollar), the forty-year-old Tao is a successful business woman owns a petrol company. Ironically it is also money, which has destroyed their rapport in the first place, finally mends their broken friendship, but also tragically shoves them drift farther away, leaving both a wistful aftertaste. Only so much for Liangzi, who will be left out altogether in the following story. A family funeral reunites Tao and an eight-year-old Daole (Rong) for a couple of days, but the gaping physical distance is too detrimental to shape an intimate mother-son connection, before leaving, Tao leaves him a key to remind him there will always be a home for him. The final chapter sets in the near future, in 2025, Daole (Dong), now a college student living in Australia with Jinsheng, experiences the Oedipus complex in the most impressionable age, aggravated by the strained relationship with his father (encapsulated by the language barrier), a lost sense of belonging, and the vague memory of his birth mother, he develops a may-December romance with his Chinese teacher Mia (Chang), a middle-aged divorcée. Home is calling, but Jia leaves an open ending, it ends with Tao dancing to Pet Shop Boys' GO WEST in the snow-land, completes a formative salute to the opening dancing sequence, the same song, 26 years apart. MOUNTAINS MAY DEPART tellingly marks that Zhangke Jia has transitioned to a new phase of filmmaking, less pungent (but not less insightful) in his social commentary but more aware of a film's holistic overview, it is also the first time in his works he creates a future scenario, although the third part is the weakest link, it is a step of trying something out of his comfort zone, where he masterly applies Sally Yeh's TAKE CARE, a Cantonese song from 1990, as a recurring motif to extract an air of undissipated melancholia. His script always finds its root in reality and excellently proffers a generous platform for its cast to portray various characters, Tao Zhao, Jia's wife and muse, delineates a demanding role ranging across almost three decades beautifully and compassionately, and Yi Zhang is the scene-stealing object of ridicule as a shallow parvenu, the excrescence of China's unbalanced development. In a nutshell, MOUNTAINS MAY DEPART can't be estimated as the crest among Jia's filmography, but in a promising way, it takes him out of the pigeonhole as an uncompromising social observer and critic, an art-house devotee whose film is solely aiming for western recognition, and signifies his potential to concoct something more eclectic and emotionally abiding.",
         "I like it more than I expected. Spanning over 25 years, it showed how personal relationships changed in China amid the exponential growth in economic development. We only see the snapshots of 1992, 2014 and 2025 and had to deduce what happened in between. Many changes take place over the years but something remain unchanged – Tao, the female protagonist, is upbeat, hardworking, and does not forget her roots no matter how bad the circumstance turns out. She is like a pillar against all the changes around her. Her dumplings, her love for her son, and her love for dogs did not change. She treasures keys. She even remembers the dance steps she learnt 25 years ago. According to Confucius teaching dated back more than 2000 years ago, a woman needs three obedience (三從): obey her father before marriage, obey her husband after marriage and obey her son after her husband is dead. Interestingly this movie mentioned these three important men in a women's life. However, the values are no longer valid with the feminist movement and the rapid changes in economic development and migration. In the case of our protagonist, Tao has a close relationship with her father before her marriage but she seems to have chosen someone her father does not approve. More than a decade later, Tao emerges into a mature business woman who is divorced. When her father dies she has no husband to obey but instead summoned her 7- year-old son to attend his grandfather's funeral. In the third part of the movie, we are not even sure mother and son ever reunite across two continents. And her son seems to be as lost as his father once was. Lovers, father, husband and son all left but Tao goes on with life, with the same smile, wrapping the same dumplings she had made for her loved ones. She has no one to answer to but only herself to depend on in new China and she seems fine. On the contrary, the male characters seems to be at a loss in one way or the other. In 1999, Tao's lover Liangzi left his hometown with a broken heart after Tao chose the wealthier Junsheng. He only returned to his roots after his life dwindled and health deteriorated. Perhaps if he and Tao has been together he would not have had to leave, then he would not have been sick. He always had that sad face and it is painful to see him struggle with life. But Liang is fortunate to have a nice wife who asks Tao for financial help. We do not see Tao regretting her choice even though she has kept his keys all along and passes it back to him. She even keeps the wedding invitation she sent him but he left in the house 15 year ago. Perhaps to her, that was all part of her history. Jinsheng is the one who changes the most throughout the years. In the beginning he wins Tao over with his wealth and material comfort. The aggressive high achiever even cuts off his friendship with Liangzi, in competition for Tao. He is so into wealth that he names his son Dollar. A decade and a half later, Jinsheng and Tao have been divorced and he works in risk management in Shanghai and sends their son to an international school. Again, he thinks money can do everything and provides material comfort to his 7-year-old son. Another decade later, in Australia, Jinsheng is a lonely old man who does not speak English and feels alienated in a strange land. He is even lonelier than before because he finally has freedom but he does not know what to do with it. He has escaped from his enemy so there is no one to chase or fight against. His freedom ironically forms an invisible jail that traps him in his huge mansion facing the beach. All his life he has been chasing for money; now he only has money: but no wife, no lover, no son, no life skills, no happiness or fulfillment. He cannot communicate with his son. From cars to money to guns, he has all the material comfort he can afford but he is still lonely and insecure and not happy. Could very well be how many rich Chinese feel because they do not know what they were working towards. Dollar, his 18-year-old son decides to quit college because nothing excites him anymore. He can do anything but he does not remember what his mother's name was. He has not met her since he was 7. Maybe that's why he develops a relationship with his teacher who could be his mom. He is open to new opportunities but he does not realize that reality can be tough – in this sense he is just like his father. Being uprooted is tough and Jinsheng has done it two times over 25 years while dragging his son along. Something exist throughout the three periods: dog (with Tao's old sweater), key to home, dance, Sally Yeh's song \"Treasure\", Tao's smile and calmness, her dumplings, mobile phone and electronic devices that supposed to be connecting people (in the third period it actually caused more misunderstanding because of Google translate) but instead making people even more alienated. Quite an inspiring and visionary piece to force us to reflect on what kind of life we are living in China or elsewhere, and what type of life we would like to live. Great acting. Highly recommended.",
         "Reading the reviews, you might suspect this to be a sophisticated, political film. You couldn't be more wrong: there's nothing sophisticated about it, it's about a heart that breaks over time. The story follows a woman, and two men from different social status (a mine worker and a director), who both love her. Eventually she has to decide for one of them, but as time goes by, she wonders whether she made the right choice or not. Told over a time span of 25 years, the film shows like few others how time changes our society, affects the private lives of individuals. Especially the last part set in 2025 is masterfully done, it could have turned out sophisticated, instead it hits right into the heart. The film says that things like social status and language do change our daily lives, and those changes can never be undone again. The usage of the movie format is genius (even more then in Xavier Dolan's 'Mommy'), it tells us, that even though the future broadens our perspective, it also makes us lose focus of what is truly essential to live a happy life.",
         "For the most part, this is a beautifully written movie. The direction and acting are excellent throughout. The writing is too. although the sequence set in Australia is rather unnecessary. I have read reviews saying they found this sequence awkward. it is mostly in English. I didn't find it awkward. It just didn't bring anything to the movie. We could have been spending more time with the wonderful Tao Zhao. As I said all the performances are excellent. But it's her's you will remember, and the film does end perfectly",
         "Read full review here: http://bit.ly/2eo9O3d Somewhere in Mountains May Depart there's a quote I can't recall that says, effectively, you can't spend your entire life with any one other person. While this may not be categorically true, if you think through the eras of a life - as a baby, toddler, childhood, teenager, young adult, middle-age, and so on - it is unlikely that any one person will be a part of your daily interactions throughout. Considering that, it can be true that the impact someone has on your life may be greater than the portion of time you spend with them. Through a handful of characters whose lives intertwine over three distinct periods of time - 1999, 2014, & 2025 - Chinese-born director Jia Zhangke explores and rejoices in the emotional resonance of our relationships in Mountains May Depart. The three epochs of the film are each brilliantly conceived aesthetically to provide a subtle atmospheric guide to the scenes they are home to within the story. The boxy, more realistic and grainy style of the 1999 sequence - designed to match actual documentary footage the director and his cinematographer shot from the same period - is a little more raw, like the youthful emotions the characters experience in their mid-20's. Here we have a love triangle where our central character, Tao, is confronted with a choice between the brash, rich, and charming Jinsheng and the humble coal-miner Liangzi. The 2014 section is a wider aspect ratio with a higher quality, yet natural visual reflecting Tao's middle-aged experience. Life's lessons have provided a bit more perspective and the muted colors are like some of her dreams that haven't worked out as planned. She's divorced and facing a continental estrangement from her 7-year old son. A fully widescreen format with an artificial, over-developed HD quality evokes a 2025 that is equally more advanced and more separated from the past. This is the backdrop as Tao's son Dollar has to learn why he feels unsettled in a life he's done little to create for himself. Here, in a bit of an Oedipal twist, he develops a relationship with a surrogate mother of sorts that reminds the youth, now so far removed from his past that he can't even speak his first language, where he came from. For the first time of his own volition he makes the choice to search and reach backwards so that he can progress and grow. It hurts. You don't know if he achieves what he's reaching for but the important thing is that he chooses to do it. Zhangke uses artifacts from his own life, from pop-culture, and of a more universal nature to serve as totems for emotional relationships that bridge the difference timelines. In 1999 Tao is young and bright, greeting each moment with a smile. She rejoices in music and food that bring her joy. Later in 2014 she faces losing everyone that is or has been important to her and these things become tools for holding on to what she's lost. A divorce left her with lots of money and a lost custody battle for her young son, whose father is abandoning all remnants of their culture and taking him to Australia. After panicking, Tao resolves to make the most impact she can on the impressionable and hungry heart of her little boy. She prepares several tokens for him to keep close through taste, touch, sound and feeling, as they will become further away than ever. The keys she gives Dollar are based on the director's own mother doing the same for him. It's possible she may never know the impact they have in his life but they become figuratively the keys to his unlocking his own freedom (see what I did there??) as he comes of age in 2025. These tokens used throughout the film, and especially two key pieces of music and the light-touch score from Yoshihiro Hanno, immediately have the same effect on the viewer each time they are re-introduced to signify a key relationship and emotion whose origin may be otherwise untraceable to the characters.",
         "'Mountains May Depart' does make audiences aware of its 131-minute runtime by a ostensibly prolonged third act that, despite possibly being in roughly equal length to its previous counterparts, trudges while following Dollar almost exclusively. As opposed to Tao, who's arguably the protagonist, I admittedly longed for more of Zhao's vigorously human display, breaking down into tears just as easily as striding with poise and zeal. In the acclaimed director's 7th feature film, Zhangke Jia has attributed epic scale and profoundly relevant ideas to the classic, albeit modernly exhausted, love triangle conflict. Through subtle use of tech, Jia supplies a new pair of eyes – proving it's not what we view, but how we view the world, cultures and people around us. FULL REVIEW HERE: http://indieadam.com/2015/09/17/mountains-may-depart-review- indieadam-tiff-2015/",
         "\"Mountains May Depart\" (aka \"Shan he gu ren\") is an odd experience of a movie. Why? Well, because it is on one hand a very nicely told story with three different story lines, but on the other hand the movie is excruciatingly slow paced to the point of where it tests the will to continue in the audience. There is no doubt that director Zhangke Jia managed to pull off a very good job here in terms of bringing the story to life on the screen. And it is a very unique and beautiful story told, one that sinks in deep and sticks with you. Just a shame that it was done in such a slow and monotone pace. The story is divided into three different segments, all of which are interwoven with one another in one or more aspects. And that is what makes the story so interesting. That, and because the story lines and subplots were interesting, and the characters portrayed in the movie were vibrant, colorful and realistic - giving the audience someone to relate to and identify with. Of course, all three stories were not equally great, and the audience will like one story better than the other. Personally, I enjoyed the first story centered on Shen Tao the most. As for the cast, well I can say that they had indeed done a great job in the casting process and gotten some really good talents to star in the movie. I was especially impressed with Tao Zhao's performance, and Sylvia Chang also really brought something good to the movie with her performance. While \"Mountains May Depart\" is without a doubt a beautiful movie, then it just lacked that particular ingredient to make the movie unique. But it is definitely well worth a viewing if you enjoy a good drama with a well-written storyline. However, keep in mind that the pacing of the movie is slow, very, very slow.",
         "The thoughtful critiques of other reviewers pretty much say it all. But I did want to add that Zhangke fans may feel disappointed by this effort. His prior films like The World and Still Life have an a lyrical quality that for me is subtle and moving, even when I didn't understand exactly what was going on. This film is more pedestrian. The first two segments are enjoyable but nothing unusual, even at times a bit mundane. The third and final segment is like the last season of Gilmore Girls or recent episodes of Modern Family, ie, in spots still intriguing but overall disappointing. If you're new to Zhangke I would try some of his other films first to get a better sense of what makes this director so special.",
         "When everybody around me liked the director's previous film 'A Touch of Sin', I didn't. As a film fanatic, reject such kind of film is not an easy job without giving a proper reason. I thought that was a missed opportunity. I surely like art films, not the boring one like those aimlessly narrated. I really loved some of the scenes there, but here it was completely different. Most importantly, anybody would understand what the film is trying to say without trying too hard. This is a theme where the China's rise was revealed from the three people's personal life perspective that was categorised to the three generations or the timelines. That's not it, the communism was also highlighted, how it held back the people's freedom. The writer was really smart to smoothly disclosing that to the world. I mean the film never dragged the China's ruling party or its system, but all were told from its character who struggled and if you use your brain, you will get it why. The narration was divided into three episodes. The first one takes place in the year 1999, in a small town somewhere in the China which is economically backward. The story follows a young woman named Tao, who is caught in a love triangle. But for the practical reason, she has to choose one of them and when she does, the other guy leaves the town with the heartbroken. This is the foundation, that dragged for nearly 40 minutes. Obviously slow, but very realistic approach. I grew up in the 90s, my country was not much different than what's in this film was shown. So I liked the atmosphere, all those the 90s set, the automobiles, lifestyle, the landscapes of the small towns et cetera taken me back to that time. But the thing is, it was China, society and culturally different. Anyway, it was past and what follows are totally flips the narration, including the perspective. \"You know the hardest thing, about love is caring.\" The second episode takes place in the year 2014, which is something like the present. It reveals what's the status of all the main three characters, like where they're economically standing and the personal life struggles. Tao's married life did not go well and her son is around ten years old who visits her from Shanghai. The one who left the town is now returned and battling for his life for some reason. In the last 15 years, the China significantly changed and still, this entire part is set in the same town which is now economically moved forward. Like the changing urban landscape, how these characters too changed were what focused on this section. Then comes the final episode where it is now in the year 2025, that takes place somewhere in the Australia. The perspective was changed, the little boy is now in his 20s, seems lost is root. With his behaviour, you would notice that his lack of knowledge about his ancestors. He who has the differences with his father, decides to make his life as he wanted. That is why the parents should take responsibility to teach their children all the good things about their culture and traditions, and to carry on, it's up to them. Because losing one's identity could lead to the failures in the life. This is the part I liked better. Because it was something like what I encountered in my life. Most of the childhood memories that returns after we're grown-up as the deja vu, like the history repeating itself. Here for pointing out the freedom one to buy a gun was indirectly hit the communism. I mean gun was not a threat, it was just an expressed how it affects people in all the similar circumstances. I meant, what something was hidden brings more eagerness for us to know about it than those are in the out. So forcing something on people is sometime is a bad idea. All the actors were good, but apart from the slow screenplay, I liked the idea of this film. There are some other similar films, like how different generations behave and now this is among them, yet not the best out of all of them. Very much watchable, only if you are capable of handling slow drag. If you know this director very well or the fan of his works, you will find it a pretty interesting film. I won't recommend it, but I also won't either suggest you to skip it. 7.5/10"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Shanghai Film Group",
         "MK2 Productions",
         "Bitters End"
      ],
      "summaries": [
         "China, 1999. Childhood friends Liangzi and Zhang are both in love with Tao, the town beauty. Tao eventually decides to marry the wealthier Zhang. They soon have a son he names Dollar... From China to Australia, the lives, loves, hopes and disillusions of a family over two generations in a society changing at breakneck speed.",
         "The life of Tao, and those close to her, is explored in three different time periods: 1999, 2014, and 2025."
      ],
      "budget": 0
   },
   "movielensId": 143531,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "普通话"
      ],
      "releaseDate": "2015-12-23",
      "dvdReleaseDate": null,
      "directors": ["Jia Zhangke"],
      "runtime": 131,
      "movieId": 143531,
      "title": "Mountains May Depart",
      "mpaa": null,
      "actors": [
         "Zhao Tao",
         "Sylvia Chang",
         "Dong Zijian",
         "Zhang Yi",
         "Jing Dong Liang",
         "Lu Liu"
      ],
      "imdbMovieId": "3740778",
      "originalTitle": "山河故人",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["IR6KMN6kOJE"],
      "plotSummary": "The life of Tao, and those close to her, is explored in three different time periods: 1999, 2014, and 2025.",
      "tmdbMovieId": 314388,
      "avgRating": 3.36364,
      "releaseYear": "2015",
      "numRatings": 22,
      "posterPath": "/sin5Y3VK7ToIMfMMTW9fNlTrRCi.jpg"
   }
}