{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2088832",
      "video": false,
      "title": "The Adventures of Mickey Matson and the Copperhead Conspiracy",
      "recommendations": [],
      "backdrop_path": "/wgZ2KkHmsDhkknUGW49njvsmggO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Mickey Matson",
               "gender": 2,
               "credit_id": "598e227e9251413848000a65",
               "name": "Derek Brandon",
               "profile_path": null,
               "id": 1606252,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Billy Lee",
               "gender": 2,
               "credit_id": "52fe4c989251416c910f9e81",
               "name": "Lee Arenberg",
               "profile_path": "/l4Zxsug0QpyJYLv0RosYMgRXiAm.jpg",
               "id": 1710,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Grams",
               "gender": 1,
               "credit_id": "52fe4c989251416c910f9e89",
               "name": "Patrika Darbo",
               "profile_path": "/ixUbj1NWOtLSpu1T2DN8EaQYHpi.jpg",
               "id": 54044,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sully",
               "gender": 0,
               "credit_id": "52fe4c989251416c910f9e8d",
               "name": "Francesca Derosa",
               "profile_path": null,
               "id": 1173017,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c989251416c910f9e77",
               "name": "Harold Cronk",
               "profile_path": null,
               "id": 937340,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c989251416c910f9e7d",
               "name": "Harold Cronk",
               "profile_path": null,
               "id": 937340,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 0.942844,
      "production_countries": [],
      "id": 191975,
      "vote_count": 9,
      "budget": 0,
      "overview": "When a mythical device from ancient times is rebuilt by a group of Confederates who feel the civil war never ended, Mickey Matson and his newfound friend, Sully, must follow a series of clues left by his dead grandfather to keep the evil men away from the three mystical objects that power the device. If he fails, it could mean not only the loss of his family's home, but maybe the demise of our country as we know it.",
      "similar": [],
      "original_title": "The Adventures of Mickey Matson and the Copperhead Conspiracy",
      "runtime": 93,
      "poster_path": "/8TBZb1MI6uxYLJT7bUIhcknqqlm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-05-09",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": "/lx54iOUV6TZZ1KOIIDXB9egGX8D.jpg",
         "name": "The Adventures of Mickey Matson Collection",
         "id": 386491,
         "poster_path": "/7Rgl7PKVuKqW15Z14f8JIMABNP.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.mickeymatson.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harold Cronk"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Harold Cronk"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2088832/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYyNjk2ODU3MF5BMl5BanBnXkFtZTgwMzc3MjIwMDE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Derek Brandon",
         "Francesca Derosa",
         "Patrika Darbo"
      ],
      "reviews": [
         "The title of this movie is a complete misnomer. It completely misleads one into thinking that there are a range of exciting scenes, however the movie just plods along due to a poor script with limited direction. I don't blame the main actors who are children, more the scriptwriters/producer/director whom, I presume are adults. I watched the movie with my kids who actually asked if they could do their homework..something that never happens with what we class as even a moderately 'good' movie. Whatever you do, don't get this movie due to the exciting sounding title or picture on the cover.",
         "Who finances this drivel and calls it a movie? I wonder how many scripts actually fall through just because they were worse than this utter mess. It's a bad wannabe of all the great kids movies that have come before it. The acting on the part of the lead boy and girl was so stunted it felt unnatural. The dialog was high-school level literature and the script was awful with nothing to save the movie. Great for a good laugh if you want to burn away an hour and half of your life. Yes this movie has good morals. most family movies do, so this isn't winning anything for that trait. No swearing or gore, it is for general audience, after all. But this movie was beyond cheesy and so corny it was painful to watch. Save your time and your money and don't pay heed to the \"rave\" reviews.",
         "This was one of the worst movies I have ever seen; and trust me, I have seen a lot of dumb ones. The script sounds like it was written for Axe Cop (but not designed to be commical), and aside from the 15 seconds that Christopher Lloyed graced the screen, the acting was terrible. The characters do stupid things for no logical reason and the filming is slow. The only strong point that this movie has is that after you have seen it, you can later make fun of it with your friends and family, always remembering it as the worst movie you guys have ever seen. If you don't plan on watching this movie with your friends or family, then you are better of spending your evening reading random wikipedia articles.",
         "This film was so much fun to watch with our kids. Everyone enjoyed it from the grandmas and grandpas to the littlest kids. There was adventure, action, suspense, and camaraderie. There was no foul language, just good clean fun. The bad guys were really bad without being nightmarish and the good guys, well, they were just as cute as could be. There was great camera action and the special effects were masterful. The story was plausible as if it could actually have been true and bringing in the historical aspect was a good way to get kids interested in the Civil War. To top it all off, it ended well. What more could you ask for.",
         "Personally the script isn't well written seems unrealistic to what actual people would say in that situation, or it could be the way the actors portrayed their character. If someone were robbing a bank a teenager would not yell at the robber and say \"You are not very nice.\" I can't be completely negative, It was okay. Technically it's about a boy, Mickey Matson (seen as a geek), who is given a rock by his late grandfather. He meets a girl, Sully, and they go on an adventure together. I'm chopping off most of the details for someone who wants to watch the movie. It is a good movie for very young children. in the end I wouldn't recommend it.",
         "Mickey Matson is a fun, family friendly film. It follows the adventures of a boy who begins searching for answers after receiving a rock from his grandfather. With the help of friends, he begins to unravel a mystery and discovers his grandfather's long kept secret. As he does so, he is forced to make some very tough decisions about doing what is right and learns that doing what is best is rarely the easiest option. There's a little action, mystery, history, and some hilarious bad guys. The story line was fun and is something everyone can enjoy. I liken it to the Goonies or a kids' version of National Treasure. The cinematography, lighting, and visual effects were also very nice! I enjoyed the visual aspect of the film as much as I did the plot.",
         "Excellent movie!! Great casting and acting, the cinematography was very well done. I highly recommend this to anyone with children who have a sense of adventure! It also has a very meaningful message and unfortunately most kids movies today miss that important quality. This writer really \"gets it\", when it comes to quality films for young adults. He helps show them that morals are important and that getting outside and exploring what nature has to offer is very exciting! My nephews loved it, (they range in age for 8-13), they asked me if I could set up a treasure hunt for them outside in the woods so they could explore. Thank you for helping me show them there is more to life then video games and for also helping me remember what it was like to be that age again. We all look forward to the sequel!",
         "No doubt that producers saw a series of these Mickey Matson films and another was made and another may be planned if there's public demand for same. But the McGuffin of this film, an alchemy machine is really a bit much. Only the littlest kids are going to swallow this one. Young Derek Brandon is an appealing young title character who lives in a really rural part of Michigan and as it opens we discover he's at the funeral of his grandfather Christopher Lloyd. Lloyd left him a rock which turns out to be the key to treasure. An unlimited treasure as it turns out because there was something to those medieval and ancient tales of alchemy where base matter can be turned into precious metal. There's also a secret society of people named after northern sympathizers to the Confederate cause, the Copperheads. They want that alchemy thing. Just think of the havoc it would reek on the economy of those damn Yankees. Brandon as I said is appealing as is his female sidekick Francesca DeRosa who is visiting her grandmother Patrika Darbo. But the story was just way too outrageous. For the little kids only.",
         "Another family movie, that tries to be a kid \"Indiana Jones\". It starts out with a really strange pace, that pretty much sets the tone for the rest of the movie, along with EVERY Cliché EVER TO BE IN A FAMILY MOVIE. Dead grandparent leaves map behind, Kid gets picked on by annoying bullies who play video games. It's all there. The clichés are definitely the main issue in the movie. By half way even the 6yr old was guessing what would happen next and was (no surprise) correct. This led to an extremely boring and predictable film. The only plot twist is at the literal VERY END. But it doesn't even really make sense, a lot like the entire movie. The only goodish part is the writing, which can be clever at times, but the acting seriously lets it down.",
         "In 1863 Sudan, a group of men discover a box containing what we later learn is a large sapphire. In present day North Bay, Michigan, Mickey attends the funeral of his beloved grandfather Jack. Young female relatives don't seem to care as they laugh at whatever is on someone's phone. But Mr. Stumpwater has wonderful things to say about the man. Later, Mickey finds out his grandfather left him a rock in his will. Not realizing its importance, the disappointed Mickey almost throws it into Lake Michigan before Mr. Stumpwater rescues it and reminds Mickey the rock is important. Using a microscope, Mickey discovers a map on the rock and decides to investigate with his new friend Sully, a Chicago girl staying with her Grams while her parents work out their problems. A couple of tough Southerners rob a local bank and proclaim the South will rise again. It turns out they are Copperheads working for Stalwert Priggish III, and their goal is to find the Alchemy Machine and make enough silver to take over the United States. Grams and several others are part of a group of Patriots formed by Abraham Lincoln to protect the Three Elements that control the Alchemy Machine. Mickey's rock is one of the three, and another is in Jack's museum. And the sapphire is also discovered. The Patriots and Copperheads now must fight to determine who controls the Alchemy Machine. Fortunately, the Southerners who robbed the bank are like the Three Stooges. I really liked Sully, and Mickey is pleasant enough and quite smart. Patrika Darbo shows intelligence and determination. Ernie Hudson does a great job and also shows courage. And Christopher Lloyd does his usual good job in flashbacks. The actors playing the Southerners are another matter. Rick Plummer is good as their leader. The bald man is funny and pretty good. The man with long hair, though, seems to lack talent and delivers laughs just because he is such a moron. This is an interesting mystery even if it occasionally turns violent.",
         "This is a wonderful movie. everyone must watch this. I am surprised that a lot of good movies do not get the recognition the should receive because they aren't 'popular' or 'in'. this movie I great, gives some in sight on the civil war, which helps the kids in a fun way with history, although there wasn't much, but if there were more, who would watch it right? lots of action pack, however there were scary scenes containing knives and guns. but it is rated PG for a reason is it not? overall a great movie. I really love the actor who plays Mickey. he is Derek Brandon. he is a good actor and hopefully become an extremely successful one like Josh Hutcherson or Logan Lerman.",
         "The only thing I liked about this movie was the setting. As a Michigan native I've been camping in a lot of the woods where the Mickey Matson movies were filmed. I also have family from that same area. Other than that I cannot recommend either movie. I suppose if you have nothing better to do or if you are six years old these flicks might be OK. Barely.",
         "This movie is Well Made, with Excitement and Adventure! Not too slow, but not too fast. It has good videography, good acting, and a well written story line. Kudos to the Director! A Great Movie for the Whole Family! Safe for kids, but enough action for adults. No inappropriate clothing, and no foul language. I think the PG rating is appropriate (not for the wee lads and lasses). Contains messages of Loyalty, Responsibility, Creativity, Courage, and plenty of Patriotism! Movies with a positive message are getting harder to find these days, and I like to support the makers when I find one (especially when they tell you in the bonus material, that they're planning on making more :) ). I can't wait for the next one to come out!"
      ],
      "genres": [
         "Family",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "10 West Studios",
         "EMC Productions",
         "Rebel Forge"
      ],
      "summaries": ["When a mythical device from ancient times is rebuilt by a group of Confederates who feel the Civil War never ended, Mickey Matson and his newfound friend, Sully, must follow a series of clues left by his dead grandfather to keep the evil men away from the three mystical objects that power the device. If he fails, it could mean not only the loss of his family's house, but maybe the demise of our country as we know it."],
      "budget": 0
   },
   "movielensId": 143666,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-05-09",
      "dvdReleaseDate": null,
      "directors": ["Harold Cronk"],
      "runtime": 93,
      "movieId": 143666,
      "title": "The Adventures of Mickey Matson and the Copperhead Conspiracy",
      "mpaa": "PG",
      "actors": [
         "Derek Brandon",
         "Lee Arenberg",
         "Patrika Darbo",
         "Francesca Derosa"
      ],
      "imdbMovieId": "2088832",
      "originalTitle": "The Adventures of Mickey Matson and the Copperhead Conspiracy",
      "genres": ["Family"],
      "youtubeTrailerIds": ["m4eTWg1653k‎"],
      "plotSummary": "When a mythical device from ancient times is rebuilt by a group of Confederates who feel the civil war never ended, Mickey Matson and his newfound friend, Sully, must follow a series of clues left by his dead grandfather to keep the evil men away from the three mystical objects that power the device. If he fails, it could mean not only the loss of his family's home, but maybe the demise of our country as we know it.",
      "tmdbMovieId": 191975,
      "avgRating": 2.75,
      "releaseYear": "2012",
      "numRatings": 2,
      "posterPath": "/yQKYYOeFigK5kQt5hV8wLEckeTG.jpg"
   }
}