{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rome",
            "id": 588
         },
         {
            "name": "gladiator",
            "id": 1394
         },
         {
            "name": "roman empire",
            "id": 1405
         },
         {
            "name": "gladiator fight",
            "id": 1527
         },
         {
            "name": "slavery",
            "id": 2831
         },
         {
            "name": "ancient rome",
            "id": 5049
         },
         {
            "name": "sklavinnen",
            "id": 5051
         },
         {
            "name": "ancient world",
            "id": 14704
         },
         {
            "name": "slave",
            "id": 14906
         },
         {
            "name": "escaped slave",
            "id": 187340
         }
      ],
      "imdb_id": "tt0361240",
      "video": false,
      "title": "Spartacus",
      "recommendations": [
         34469,
         19989,
         34734,
         111438,
         42053,
         19010,
         44349,
         31533,
         62878,
         82479,
         35429,
         30092,
         36737,
         17836,
         102758,
         82760,
         20385,
         14105,
         1163,
         34559
      ],
      "backdrop_path": "/fzfe2srDBAQLfvlYRpAACvwe39X.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Spartacus",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e741",
               "name": "Goran Visnjic",
               "profile_path": "/kMtnrBNrinINIgQIyWhATYRP8Ne.jpg",
               "id": 5725,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Antonius Agrippa",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e745",
               "name": "Alan Bates",
               "profile_path": "/fgfhPgDgFgw1h1FnuCnEcoYsgwp.jpg",
               "id": 27554,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marcus Crassus",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e749",
               "name": "Angus Macfadyen",
               "profile_path": "/qTplz89WHXM4dGu0PVSarWEYHcO.jpg",
               "id": 2464,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Varinia",
               "gender": 1,
               "credit_id": "52fe44d59251416c9101e75f",
               "name": "Rhona Mitra",
               "profile_path": "/5iaixWY0qTK9ouHA1wmlXi3t0ie.jpg",
               "id": 25702,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lentulus Batiatus",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e763",
               "name": "Ian McNeice",
               "profile_path": "/v217qBNPrwNBvcu9F3BVBPE0AwM.jpg",
               "id": 3547,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e767",
               "name": "James Frain",
               "profile_path": "/tQLuwlPodwk8CWd3ly067s1x1dh.jpg",
               "id": 22063,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Draba",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e76b",
               "name": "Henry Simmons",
               "profile_path": "/ajSaqDbQfi6eAFULhpCSezYplUF.jpg",
               "id": 67913,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Titus Glabrus",
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e76f",
               "name": "Ben Cross",
               "profile_path": "/oSGwl0y9ZQOKDYXbrEd2zeid1Bq.jpg",
               "id": 29068,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e74f",
               "name": "Robert Dornhelm",
               "profile_path": null,
               "id": 44644,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e755",
               "name": "Howard Fast",
               "profile_path": null,
               "id": 14489,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d59251416c9101e75b",
               "name": "Robert Schenkkan",
               "profile_path": "/bZ88GIuBcAm32CjT64NGnY8oMQN.jpg",
               "id": 53972,
               "department": "Writing",
               "job": "Teleplay"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 3.207722,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32528,
      "vote_count": 22,
      "budget": 0,
      "overview": "Sentenced to spend out the rest of his adult life laboring in the harsh deserts of Egypt, the Thracian slave Spartacus gets a new lease on life when he is purchased by the obese owner of a Roman gladiator school. Moved by the defiance of an Ethiopian warrior, Draba, Spartacus leads a slave uprising which threatens Rome's status quo. As Spartacus gains sympathy within the Roman Senate, he also makes a powerful enemy in form of Marcus Lucinius Crassus, who makes it a matter of personal honor to crush the rebellion.",
      "similar": [
         967,
         98,
         23759,
         49494,
         76203,
         9703,
         76649,
         9564,
         9453,
         583,
         12437,
         11047,
         8095,
         8868,
         11864,
         10156,
         9385,
         5066,
         17277,
         281783
      ],
      "original_title": "Spartacus",
      "runtime": 174,
      "poster_path": "/84cPM68NCCUNtuVHAiZXc7udNJN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "USA Cable Entertainment",
            "id": 11282,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nimar Studios",
            "id": 7636,
            "origin_country": ""
         }
      ],
      "release_date": "2004-03-17",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Dornhelm"],
      "runtime": 174,
      "synopsis": null,
      "writers": [
         "Howard Fast",
         "Robert Schenkkan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0361240/",
      "coverLink": null,
      "actors": [
         "Goran Visnjic",
         "Alan Bates",
         "Angus Macfadyen"
      ],
      "reviews": [
         "The TV miniseries opens in Gaul 72 B.C. where the Romans put an end to Varinia's world making her a slave\u0085 Meanwhile Spartacus (Goran Visnjic) is free from the hell of the gold mines of Egypt to be trained as gladiator in the establishment of Lentulus Batiatus (Ian McNeice). Most of \"Spartacus\" contains many of the miniseries' best moments\u0085 The operation of the gladiatorial school and its training program is impressive and expressive; the apprentice gladiators are treated like special animals, tutored to perform in the arena as spectator-sport-killers, and occasionally rewarded with a woman in their cells\u0085 In this degrading manner Spartacus meets Varinia (Rhona Mitra) and it is his love for her and his hatred for his captors that brings about his decision to escape and lead revolt\u0085 Particularly effective is the scene in which Marcus Crassus (Angus Macfadyen) and his bored entourage visit the establishment and request for a private showing at its best of a pair of Thracians\u0085 Crassus wanted to see courage, passion, and above all finality\u0085 Spartacus is matched with the African Draba in a fight to the death, but Draba (maybe rather than live as a beast) chooses to die as a man, attacking his spectators\u0085 The scene summarizes the iniquity of the situation, the cruelty of bondage, and the subsequent uprising of gladiators in Capua becomes a triumph easy to understand\u0085 Director Robert Donrhelm did a decent job, carrying the grandeur and the decay of ancient Rome\u0085",
         "The original Spartacus is a superior movie as movies go. However, this version has much to offer and won't disappoint. The depiction of the Gladiator fights has several authentic touches such as the branding on the neck of the losing fighter. The brand was to insure the gladiator wasn't faking death! They still got the thumbs-down crowd signal wrong. In the movies, the thumbs-down means the crowd wants the loser to die. In reality the thumbs-down meant to let the loser live and to signal the victor to put down their sword. The death signal was a thumb stabbing motion toward the heart. I suppose they can be forgiven because few people watching the movie would know that and it would probably confuse most people to change it. They likewise included the signal of the losing fighter to plead for mercy, but got that wrong slightly too because the signal is one finger, not two. Still, they obviously tried to get things more accurate. The gladiator characters were quite accurate as were their weaponry and armor. Very good job there. They obviously paid attention to the discoveries made since \"Gladiator\" came out in 2000. But the gladitorial combat scenes are a very small part of this movie. This is primarily a war movie and the war is a fight for freedom by slaves against the Roman empire. The producers retained much of the social commentary from Howard Fast's book. It fact they hit you over the head with it in case you didn't read the book. Most important in this the Draba character, the black gladiator who fights Spartacus. His role, though small, is key to the story. Also pay attention to Agrippa, the Roman Senator who is constantly making Crassius' life miserable. He's not what he seems, so pay attention. Watching the mini-series on USA Network over two separate nights days apart is unbearable. But when commercials are edited out and you can watch the whole thing without so many interruptions, the narrative is quite fluid. This would make a nice DVD because the photography is good, the costumes detailed, the acting/casting good, and the story excellent. It is just not the same movie as the 1960 version. Don't expect a simple remake. The ending is different. Spartacus' fate is different. It's more like Howard Fast wrote it originally than what Hollywood made of it in 1960. The 1960 version is superb, but it's not the same as this movie. It's a similar but different story. I highly recommend this version along with the original.",
         "The 1960 version of Spartacus remains one of the best historical epics ever made but this new film rates very well beside it. It is more historically accurate and much more faithful to the original Howard Fast novel on which both films were based. All the actors did a good job. Goran Visnvjic was an effective Spartacus and Rhona Mitra a feisty Varinia very much in keeping with the book. Alan Bates is at his best in the role of a senator playing a behind the scenes role in trying to stop Crassus in his drive for power over the Roman state. I was least impressed by Angas Macfadyen in the role of Crassus although it's still a competent performance. I guess that Lawrence Olivier who played Crassus in the 1960 movie is a hard act to follow. The battle scenes are competently performed but the armies look much smaller than the historical record said they were. I guess the original Spartacus had more money to spend on extras. A long standing wish of mine is for a Roman epic to get the armor right. The Roman soldier of this period wore short mail shirts and used oval shields. The segmented armor wasn't introduced until about a century later. I couldn't fault the history. Everything seems to be done right, from the first battle when the slaves abseiled down the cliffs of Vesuvius to attack the Roman camp to the splitting up of the slave army when Crixus and Spartacus had a falling out. The gladiator scenes are just as good as the original too. All in all, a great movie that even die-hard fans of the Kirk Douglas version should enjoy.",
         "This was a beautiful and touching version of the classic tale of a brave fight for freedom. The acting was wonderful; Goran Visnjic has a powerful presence and an emotional expression in his starring role. He had a depth to this character that I've never seen so well-portrayed in other versions. Angus MacFadyen's Marcus Crassus was not your typical \"flat\" villain. And Rhona Mitra was a wonderful Varinia; she and Goran made a perfect couple for the love story in this action picture. The action was exciting, and I'm glad that Goran and the other actors playing gladiators did their own fight scenes. Flipping through a book on Roman history as I watched, I was also surprised to find how historically accurate this version is in both the characters and the events that took place. I loved it! Highly recommended, especially for fans of Roman history who want a more accurate representation of the real event.",
         "I have done quite a bit of research regarding Spartacus and the slave revolt he was part of in the century preceeding the birth of Jesus. This version of Spartacus - made in 2004 follows the academic history of Spartacus and the uprising to the letter. Some versions show Spartacus being crucified, which is not true. Spartacus died in his last battle with Marcus Crassus, which is how the 2004 version is shot. The 2004 version also shows the fact that Pompey, a popular Roman General called upon by the Roman Senate to help stop the slave revolt, took credit for defeating Spartacus when in fact it was Marcus Crassus who actually defeated Spartacus and his army. If there is one thing I would have liked added it would be some sort of trailer language that described the remaining years of Marcus Crassus as he was a main character in the movie but the movie sort of left him \"hanging\" in the end. In truth, Marcus Crassus never achieved the glory he desired for himself and eventually met a very horrible end when he battled the Persian Army years after the defeat of Spartacus. The Persian Army captured Marcus Crassus after defeating his army and to kill him, poured molten gold down his throat. He was then beheaded and his head sent to the King of Persia as a trophy. I think this was a fitting end for a man who was very vain, a glory seeker and who despised the idea of freedom for all men, except the rich Romans.",
         "This is a new version about the true story of gladiator Spartacus (Goran Visnjic), formerly adapted by Kubrick in a famed masterpiece. At the beginning , the Thracian slave laboring in harsh rock, when he's purchased by obese Battiatus(Ian McNeice in the role of Peter Ustinov). Brought back to Capua in a gladiator's school, he knows corpulent gladiator named Draba(Henry Simmons in the role of Woody Strode) and Jewish slave named David(James Frain). He escapes and stirs up all gladiators and slaves in a revolt(73 B.C.) against the power of Rome . Meanwhile he falls in love with Varinia(Rhona Mitra, Jean Simmons's role). After various generals (Ben Cross) are vanquished , the rebellion is put down by Crassus(Angus McFadyen in the role of Laurence Olivier)who confronts with wily old senator Agrippa(Alan Bates, in a similar role to Charles Laughton as Gracchus)and Pompeius. Ultimately the rebels are defeated and crucified along Via Appia, in a sea of crosses silhouetted against a sunset. Spartacus actually died in battle and his body was not found. Spartacus history is imaginatively brought to life on impressive images with great production values and outstanding scenarios. Sword cross, drama, gladiators fights abound in this spellbinding adaptation on audacious Spartacus existence , one of the most rebels in the history. Magnificent climatic battle scenes , features by hundred real extras, adding computer generator soldiers. Although redundant to original movie , is a fitting description of Spartacus character, however is sometimes a shot for shot recreation but it doesn't insult the viewer's intelligence. It's all immensely epic, though predictable, as we have seen the former classic movie , but also its predictability is redeemed in part by the charismatic performances of excellent starring with flawless portrayals and all around with the best talent available. The film is dedicated to Howard Fast, novel's author, and Alan Bates, deceased during shooting. The film is well directed by Robert Dornhelm, a miniseries expert, about historic events and characters, such as Archduke Rudolf and Mary Vetsera, Anne Frank, War and Peace, Ten commandments and even Rudy Giuliani. The Spartacus life was previously adapted by Riccard Freda(1952) with Massimo Girotti and Ludmilla Tcherina, the prestigious version by Kubrick and following with 'The son of Spartacus'(1962) by Sergio Corbucci and with Steve Reeves. The movie will like to people enamored for historic deeds and epic feats.",
         "Goran Visnjic gave a very credible performance as Spartacus. Instead of the superhero-style portrayed by Kirk Douglas (which I happened to LOVE that movie), Goran added more depth to the character ... the strengths AND the weaknesses. I also liked how the show developed his skills as a gladiator by having him do some real fighting rather than how it was done in the original. Crassus (played by Angus MacFadyen) was likewise very three-dimensional. It was a shame that the movie was only 2 hours long (4 hours if you count the commercials). Given more time, it would have been enjoyable to see more of Crassus's political maneuvering. If that character had been born in our century, he'd be king of our country by now. And there were surprisingly strong performances by others in bit-parts, like George Calil as Pompey, Ben Cross as Glabrus, and Henry Simmons as Draba. You can see that they did their homework and put real work into their character developments. All in all, I give it an '8'. I'd like to give it a higher score, but I thought that the fight scenes were less than spectacular. Add a few thousand more stand-ins and maybe it would have been more believable. But I just didn't get the sense of volume that should have been there.",
         "I'll admit it right off. I've never seen the Kirk Douglas version of the film. From what I understand of it though, Douglas' portrayal was a much harder, gritty character than was Goran Visnjic's. Visnjic made you feel for he and all his men. The subtle undertone of sadness that permeated the character was breath-taking. While fighting, he moved with catlike grace and fiery hate towards those that enslaved him. The movie made me feel like I was there. The character jumped off of the screen with such truth that one could not help but cheer their victories and agonize and cry with them at their defeats. All in all, Spartacus was, in this humble writer's opinion, one of the most fascinating, beautifully choreographed and acted, and, most likely, underrated and unseen mini series of all time.",
         "Overall, I was not overly disappointed with this version of the Spartacus story - that of the Roman Gladiators Revolt. At points it actually was more factually correct than the 1960 Kirk Douglas version and played at a more rudimentary level than the glorified Hollywood original. What I did find strange and not so surprising (here comes the spoiler part - although I don't think so) is the imagery created by the crucifixion and closing dialogue of the David character. Anyone that knows the original movie or the actual events that inspired them knows that Crassius crucified the captured slaves along the Apian Way. As far as I know there is no factual basis for the character of David a Jew that revolted along with Spartacus from the Gladiator school. I guess the David character was also supposed to replace the Tony Curtis character from the 1960 movie. Here it is the SPOILER: To then have him, David, be the final crucifixion and for him to respond to Crassius that we will return by the millions (or something like that) and then to have Crassius stab him in exactly the same place that Jesus Christ was stabbed at his crucifixion was only done to add the idea (to the movie) that the Roman Empire will itself fall/convert to Christianity at a later point in history. Granted the point is also that slavery will not prevail. Note for those not aware Christ is supposed to have been descended from another David, King David of Israel. The scene also felt like it was trying to take advantage of those individuals and movie watchers recently enthralled by Gibson's The Passion of the Christ by evoking that image. Overall the acting was not bad. The story captivating for its content.",
         "There's some confusion about this Spartacus miniseries and the 1960 epic movie Spartacus. The stories are very similar because they both use the Howard Fast novel as a basis. The Kirk Douglas movie had another mission though as it was one of a group of movies made to regain the public's interest in the cinema with lavish spectacle. The scale of its production is much higher than the miniseries. What the miniseries has going for it is more historical accuracy; the gladiator/rebel army marched up Italy, got to the Alps and changed its mind (very puzzling), marched down to Italy's toe hoping to escape by boat but was foiled and was trapped for a time. They broke out only to quarrel amongst themselves and break up into at least two groups. This proved their undoing as the Romans first massacred the smaller group of Gauls and then defeated Spartacus in turn. Spartacus' body was never identified, but many were crucified along the road all the way to Rome. Spartacus and his army made the Romans pay in much blood and defeat leading up to his and their ultimate defeat, though, requiring 15 or 16 legions to chase them down. Spartacus is a favorite hero of the Communists, BTW, being the working stiff rising up against the ruling class, etc... The 1960 epic is short on accuracy, instead showing the rebel army defeating the garrison of Rome and another legion or 3 along the way to Brundusium, only to turn back and get overwhelmed by multiple Roman armies. It was a closer match to the actual scale of events, as the rebels numbered around 90-100,000. But they both have the same love story tacked on along with treachery in the Roman Senate by ahistorical Roman Senators, and a Crassus obsessed with possessing the strength of Spartacus by possesing his woman. The 1960 remains my favorite version simply because its a well-done big movie (I wouldn't want to be the one to reprise Olivier's Crassus!)although it was good to see a more accurate portrayal of the course of events shown in the miniseries. The acting was pretty good, with Spartacus' Visnjic a good choice for the title role.",
         "One of the previous reviewers, whose review garnered a \"useful\" label by 29 out of 29 people at the time of this writing, had the gall to correct the \"thumbs up\" vs \"thumbs down\" decision-making style of the gladiatorial arena. This is the height of hubris. In reality, there is not a person alive today who truly knows what motion of the hand meant what in ancient Rome. The entirety of our knowledge of the \"thumbs up\" thing comes from a passage in a letter written in Latin where it is mentioned that at a recent gladiatorial game the writer had observed that the fate was decided in \"the usual way\" by means of \"pressed thumb\". Hollywood interpreted this as thumbs up vs thumbs down, but who the hell knows what it really means. Where the previous author collected this notion of down meaning \"spare him\" and some kind of \"stabbing motion\" meaning \"kill him\" is completely mysterious and untrue. The arrogance with which he delivered the assuredly true claim forced me to correct him publicly, as his review of this film had been validated by 29 people, which by extension validated this fiction he perpetrates.",
         "I saw this on USA Channel and thought it was a great production. This is a remake of a wonderful story with Kirk Douglas and Jean Simmons. Directed by Robert Dornhelm and writing credits to Howard Fast for the novel, and Robert Schenkkan for the teleplay, it is an exciting war of the slaves against the Romans. The war scenes, however, would have been more spectacular on the big screen; however, they were bloody. This is different from the original because the love story is expanded; Spartacus fathered two children by Varinia; one is killed by Crassus, but the other lives after the crucifixion. Spartacus is played by Goran Visnjic, Lentulas Agrippa is Alan Bates, Pompey is George Calil, and Varinia is Rhoma Mitra. The lecherous and miserable Crassus is played by Angus MacFadyen. All actors play three-dimensional roles and are very good. If you want to enjoy good acting, music, and beautiful scenery, go for it! 8/10",
         "What can I say, I loved it. I saw the previous one with Kirk Douglas when I was like 7 or something like that so I don't really remember much. But this one is quite unique. The setting, costume, and overall outcome is extraordinary. The actors/actresses did a great overall job and it revealed tremendous leadership in a small man. Basically, it emphasizes the old ways and is ultimately a battle between the poor and the rich; Rome v. its slaves. Even though Spartacus doesn't make it, his legacy lives on. Anyone who loves movies about the ancient traditions, problems, romance, and especially WAR, you'll definitely enjoy this. Take my word for it, lots and lots of bloodshed.",
         "Spartacus was the kind of mini-series that I just knew would be good from the start. Spanning a two day special on USA I watched the first part and just couldn't wait for the second half. Spartacus is played by Goran Visnjic from the TV series ER and shows he can be a tough guy too. The film starts with Spartacus being bought by a wealthy Roman to be a gladiator. Spartacus excels quickly and learns to be an excellent fighter but soon sees the horrible life he faces along with the other gladiators. After his friend is killed by Roman guards for refusing to kill him, Spartacus rebels against the cruel family that owns him and quickly crushes them. Now Spartacus is on a quest, along with other gladiator rebels, to overthrow the Roman Empire and abolish the gladiator games. Along the way, Spartacus must deal with insubordination of his soldiers, betrayal, and love. The battles are well done but just don't show the overwhelming victories Spartacus actually achieved in his quest. Goran Visnjic is exceptionally strong as Spartacus and really has some great sword work in battle. This is a superb mini-series with good drama, good action, and fine acting. Spartacus. Starring: Goran Visnjic, Alan Bates, Angus Macfadyen, and Rhona Mitra. 4 out of 5 Stars.",
         "I have always loved the original Spartacus. Great movie, great cast, and great themes and emotion. When I heard that there was a made-for-TV remake of this, I dreaded the defiling of a classic. But it actually didn't turn out that bad. The update makes good use of newer effects and technology, making the movie much more authentic. Spartacus and Varinia were had more youth to them, but I am not sure if this is better or not. Goran Visnjic brought youth to the role, as well as more aggressiveness (in the original Spartacus, Spartacus was cited as being a coward and a bad fighter). I liked David, the Jewish gladiator,s in this movie, with more of an expanded role; Crassus was equally good, but didn't have as much seriousness to him as Laurence Olivier. No one will ever live up to Peter Ustinov's slave owner, for which he won an Oscar for. But the movie did manage to live up to some of the original's fame. SPOILER One issue that I had with the movie was the ending. Spartacus died in battle; there was no \"I am Spartacus\" scene, nor combat between two dear friends, nor Spartacus paying the ultimate price for his beliefs. For a while I thought that David would be the one to fight Spartacus, but it seems he took Spartacus's place on the cross. With this plot change, the movie loses several of the greatest emotional parts ever written or filmed: the famous, \"I am Spartacus\" scene, the fight between Spartacus and Antoninous, each trying to kill the other out of love, and the scene with Spartacus on the cross, and his last words to his wife. Although this remake was good, the original will live on forever. 7 out of 10.",
         "I happened onto this miniseries on the History Channel and became enthralled immediately. I stayed up late into the night to watch it because I could not turn it off. It is very well acted. Goran Visnjic was perfectly cast as Spartacus, the Roman Slave turned Gladiator who leads a slave revolt that shakes the foundation of the Roman empire. His chemistry with Rhona Mitra was palpable. The love affair between the two was expanded in this adaption and really added to the poignancy of the story. The cinematography and the costumes were also good and the fight scenes were very believable. I think that I actually enjoyed this version better that the Kubrick classic.",
         "Goran Visnjic delivers a compelling and convincing performance as Spartacus and in my opinion no one could have done it better. As Ebert and Roeper said recently in their review of another movie \"not only is he (Goran Visnjic) a handsome leading man but a great actor.\" The History channel aired a history of \"The Real Spartacus\" shortly after the airing of the mini series. The mini series followed the history fairly accurately. Without giving anything away as to the plot (for those who haven't yet seen it) one of the differences between the history and the mini series is in the scene where Spartacus is given a horse as a gift from his men. Spartacus sets the horse free and says he wishes to be on foot as an equal -- if they win they will all have horses and if they lose they'll have no need for them. In the history of \"The Real Spartacus\" he supposedly takes out his sword and kills the hore instead of setting it free. That kind of change I can live with. I hope there will be a DVD release soon.",
         "If you want to see the real movie, watch the Kirk Douglas movie. What's the purpose of this remake? part 1 is ok, part 2 is terrible. I gave it a 5 out of 10 only because there were some interesting scenes, but this 4 hours of mostly commercials will leave you in wonder as to how they somehow hoodwinked you into watching. Its a good movie to watch while balancing your checkbook, or getting done other projects. The actors seemed to be thinking the whole time \"geez, I am in a made for tv mini-series.\" Rhona Mitra is nice to watch, other than that, don't waste your time.",
         "well, i saw this movie before the gladiator, and i never really thought it is such good until i saw the gladiator. I had seen lots of good reviews of the gladiator which is a good movie. but when i saw it, i felt that something was missing. And that was when i remembered the Spartacus. Spartacus - a great story of a slave. It is really inspiring and some moments makes you wanna jump out of chair and kick some ass ;D maybe, it is because this movie is intended to be a POP. In comparing with gladiator, i think it is a little better and leaves a little deeper mark in your soul than gladiator. Gladiator was tried to be made not hack too hard. While Spartacus - no",
         "\"Spartacus\" is a movie which is a landmark in the film history, and inevitably this movie compared with the epic movie \"Spartacus\" of 1960 with Kirk Douglas as Spartacus. \"Spartacus\" divided into two parts. The first part of it is better than second because has more action and show us the effort of the people for freedom. Counter to second part which is not as good as the first, I think that the second part is boring and awful. The only good part of this movie is Rhona Mitra who played as Varinia and is really beautiful. If you want to see a movie of \"Spartacus\", then watch the classic movie of 1960 \"Spartacus\" not any remake of this.",
         "hi i'm new here, so i hope that i post that at the right place. i saw that film last thursday in the TV (in austria). i just love it (above all, goran visnjich is really handsome as \"spartacus\", isn't he?) Today i bought the roman from howard fast: \"spartacus\" and i'm going to read it immediately. i don't know if the film with kirk douglas is really better than this, because i've read a lot in the internet about people saying the actors act worse and there are too many bloody scenes but i don't think so. i mean, if you saw \"troja\" with brad pit: THAT'S only about fighting. i'd really recommend it, i think i'll buy it on DVD... greets from austria alicia",
         "Spartacus was of course a historical figure on who there are not that many details. I saw a Discovery Chanel feature a while back which had just the dry historical facts. However, as a figure that has inspired many,(the guy was a favorite of Marx) particularly because its' a story of the oppressed rising against the rich. Therefore many people have taken the skeleton of what's known and added their own fictional meat. There is an old book by an Italian, Raffaelo Giovagnoli which I read as a kid and really loved. It has Spartacus falling in love with Sulla's wife Valeria, and he has a son and so on. Then there seems to be the Howard Fast book which I haven't read. Kubrick's is but another interpretation of that story, and a very Hollywood one at that, with the positives and negatives that entails. For some reason, many people on this board seem to associate the name Spartacus only with Kubrick and Douglas and assume this is a remake. It's not. It uses the base of what is known about Spartacus and adds fiction like the girl (by the way, I'm a big Rhona Mitra fan, she is sssmokin'), and the love story and so on. I don't know if that is taken from the H. Fast book or not but if this series is treated as another re-interpretation of the story rather than a remake of the old movie I think people would enjoy it a lot more. That said, I thought that this series is really well done, as are many mini-series of this kind such as the Dune ones or Merlin. The actors are very solid and many are British which is always a good thing in my book. For some reason there seems to be a rule that in every historical movie the cast has to be predominantly British and they all make sure they speak with the appropriate accent. Altogether a good 3.5/5 with gusts up to 4.5 depending on how much of a fan you are of a) historical movies; b)Goran; c)Rhona Mitra; d)the strong supporting cast: Macfayden, McNeice, etc.",
         "This movie was done so incredibly well. It was apparently a remake of the Kirk Douglas version of Spartacus which I saw this week. However unlike most remakes it was BETTER than the original. The story was well told and the actors were very appropriate. There was lots of action but not too much blood. WHERE IS THE DVD? Watch this movie. Enjoy.",
         "This movie presents the story of Spartacus a Thracian slave that leads gladiator slaves out of a slave camp at Capua. The battle scenes are great reenactments and they show the brutality of the ancient world.The actor that portrays Marcus Crassus plays the aristocratic stuck up general quite well and his rivalry with fellow senator Agrippa keep the plot moving throughout the entire movie. Not only does this movie show you how these ancient people fought, but it also shows the brutality that the Romans had against there opposing armies. This movie contains all the elements of a good war movie: fighting, rivalries, and romance. Overall this movie is one of my favorites and Goran Visnjic was the perfect guy for the job."
      ],
      "genres": [
         "Action",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Nimar Studios",
         "USA Network Pictures"
      ],
      "summaries": [
         "Sentenced to spend out the rest of his adult life laboring in the harsh deserts of Egypt, the Thracian slave Spartacus gets a new lease on life when he is purchased by the obese owner of a Roman gladiator school. Moved by the defiance of an Ethiopian warrior, Draba, Spartacus leads a slave uprising which threatens Rome's status quo. As Spartacus gains sympathy within the Roman Senate, he also makes a powerful enemy in form of Marcus Lucinius Crassus, who makes it a matter of personal honor to crush the rebellion.",
         "After he is bought by the owner of a Roman gladiator school and trained as an gladiator A slave leads a rebellion of slaves and gladiators into revolt against Rome."
      ],
      "budget": 0
   },
   "movielensId": 143863,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-01-12",
      "dvdReleaseDate": null,
      "directors": ["Robert Dornhelm"],
      "runtime": 174,
      "movieId": 143863,
      "title": "Spartacus: Gods of the Arena",
      "mpaa": "",
      "actors": [
         "Goran Visnjic",
         "Alan Bates",
         "Angus Macfadyen",
         "Rhona Mitra",
         "Ian McNeice",
         "James Frain",
         "Henry Simmons",
         "Ben Cross"
      ],
      "imdbMovieId": "0361240",
      "originalTitle": "Spartacus: Gods of the Arena",
      "genres": [
         "TV Movie",
         "Action",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sentenced to spend out the rest of his adult life laboring in the harsh deserts of Egypt, the Thracian slave Spartacus gets a new lease on life when he is purchased by the obese owner of a Roman gladiator school. Moved by the defiance of an Ethiopian warrior, Draba, Spartacus leads a slave uprising which threatens Rome's status quo. As Spartacus gains sympathy within the Roman Senate, he also makes a powerful enemy in form of Marcus Lucinius Crassus, who makes it a matter of personal honor to crush the rebellion.",
      "tmdbMovieId": 32528,
      "avgRating": 3.42857,
      "releaseYear": "2011",
      "numRatings": 14,
      "posterPath": "/84cPM68NCCUNtuVHAiZXc7udNJN.jpg"
   }
}