{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0067719",
      "video": false,
      "title": "Scipione detto anche l'africano",
      "recommendations": [],
      "backdrop_path": "/p5QGujHDp6AwcvMXALgoz3SeM0w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "538f1dfd0e0a2644bc001971",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "538f1e090e0a2644c800170e",
               "name": "Silvana Mangano",
               "profile_path": "/8KFcMFxQbrOkXc0do7xuu8mNuNy.jpg",
               "id": 12520,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "538f1e140e0a2644ad0017a2",
               "name": "Vittorio Gassman",
               "profile_path": "/qjSYEX5zQuuJzRvznpFz5Xqfbvv.jpg",
               "id": 12259,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "538f1e1c0e0a2644b6001740",
               "name": "Ruggero Mastroianni",
               "profile_path": null,
               "id": 32053,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "538f1e240e0a2644ad0017a5",
               "name": "Turi Ferro",
               "profile_path": "/xCwRS3koOb2VHnDTaa5GwjmxTEH.jpg",
               "id": 50003,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "538f1e2f0e0a2644c10017fb",
               "name": "Woody Strode",
               "profile_path": "/hL6mQBnCxBxhUeG5rjx9SfO7AXM.jpg",
               "id": 4963,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "538f1dae0e0a2644ad001796",
               "name": "Luigi Magni",
               "profile_path": null,
               "id": 70562,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "538f1db40e0a2644c8001707",
               "name": "Luigi Magni",
               "profile_path": null,
               "id": 70562,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "538f1dc80e0a2644b900169d",
               "name": "Lucio Trentini",
               "profile_path": null,
               "id": 998152,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "538f1dd60e0a2644b0001798",
               "name": "Turi Vasile",
               "profile_path": null,
               "id": 33788,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "538f1de40e0a2644bc001968",
               "name": "Severino Gazzelloni",
               "profile_path": null,
               "id": 1327516,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "538f1def0e0a2644b000179d",
               "name": "Arturo Zavattini",
               "profile_path": null,
               "id": 51431,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.248122,
      "production_countries": [],
      "id": 273868,
      "vote_count": 2,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Scipione detto anche l'africano",
      "runtime": null,
      "poster_path": "/hlUG9PY4KK5XwM39vE43Q1abJnW.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1971-09-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Luigi Magni"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Luigi Magni",
         "Luigi Magni"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0067719/",
      "coverLink": null,
      "actors": [
         "Marcello Mastroianni",
         "Silvana Mangano",
         "Vittorio Gassman"
      ],
      "reviews": [
         "Such a courageous film, so full of history and culture but filtered through the irony of the centuries. The eternal ugly side of politics reflects itself on the mirror of the past, with the bitterness of Scipio, the cynicism of his brother Lucio, the moral (and physical) beauty of his wife Emilia (Silvana Mangano), the stern but utilitarian morality of Cato, the indifference of the Gods, while the roman ruins of the scenery, and the modern language (roman dialect in the original) of the characters (splendid all the actors),demonstrate that past is present. Forty years old, this movie keeps being a perfect metaphor not only of the actual Italian situation but of the human factors, tragedy and comedy together. For refined palates.",
         "This semi-historical talkathon about the Ancient Roman warrior Scipio Africanus is an attempt at an intimate 'anti-epic' in the style of Pasolini's Medea or Oedipus Rex. If nothing else, it reminds us just how inspired those other films are. Shooting in the deserts of Morocco or Eastern Turkey, Pasolini makes us feel his camera has somehow time-travelled back to Antiquity - and the story he tells has the intensity of Greek tragedy or primal myth. In the far-less-gifted hands of writer-director Luigi Magni, we get a bunch of big-name actors standing round in cut-price togas. All of them seem to wonder just what they are doing there, and whether or not they can be bothered to stay. Most ludicrous are the authentic Roman ruins that stand in for sets. Did nobody point out that these were NOT ruins at the time the story takes place, but new and glittering triumphs of modern architecture? A pity, because the cast is highly skilled. A bald Marcello Mastroianni tries hard as Scipio, Silvana Mangano looks predictably stunning as his wife and Vittorio Gassman is brilliantly slimy as his arch-enemy - the wily, cat-loving statesman Cato. The struggle between Scipio and Cato (i.e. between military force and civilian government) is as relevant today as it was when it happened. You can hear the same debate any night on the evening news...",
         "Much too difficult to be fully grasped by not Italian-mother-tongue people ... I'm afraid I don't agree with the main review by the Scottish fellow. Things are quite different from what appear to be, although I can understand the point of view of a non Italian ... This film is not so much about an episode in Roman history, as it is indeed about life and people themselves ... All over the world and all along times ... Here, the figure of Scipio is one that entails all men with an unbreakable ideal in their mind and his fight against a world of common people hopelessly prone to everyday trivialities ... It is a story about the impossibility for the later to comprehend the former, and about inevitability of disenchantment of this heroic figure, as he expects gratitude and respect for his out-of-the-ordinary deeds ... Even the role of his wife Emilia (well performed by Silvana Mangano) is there to underline the fact that Scipio was a problem even before his conquests, in his family relations, and afterward he became a problem to all Romans at large ... There are two connections to Greek tragedy as well in the \"narrating\" roles of Giove Capitolino (Turi Ferro) and Licia (Wendy D'Olive) ... Which represent the ideals of the mythological Rome of the Fathers; both of which - in the end - can't help but see Scipio go away and give up his home town with sadness and dismay ... I've watched this film every time it was broadcast by the TV, and I must admit that I myself was disappointed originally, because of some apparent approximations - like for instance the improbable aforementioned ruins - and mostly for the use in dialogues of present Roman slang ... But indeed this is an issue: The end of the heroes - like Scipio and Cato himself - didn't preserve the republic in the end and even today - in our present republic - we can see the same misery in human behavior; the ruins where already there in those times and were the ruins of humanity and decency; the use of Roman slang is the metaphor of the language of the resentful people, good only at talking about miserable things ... Scipio went to war to save his homeland and their national pride ... high-minded and ready to win or die for Rome ... But on his return, he found a different country; one without anymore fear and ready to live a quiet life in freedom and safety: NO MORE HEROES NEEDED ! Scipio learns the truth only thanks to a cruel outburst by Emilia, that clarify things to him. Then he goes to Senate and falsely confesses any kind of misdeeds ... This is the main point, in which a very cryptic (for non Italians) dialect exchange of lines explains why all that fuss was needed ... Scipio and Cato are finally aware - in private - of being probably the only two honest men in Rome, but nobody has to know ... for the sake of the Republic (in which everybody is - and must be - equal) ... the only important thing to be protected ... *** PS. Much too difficult to be fully grasped - in the original release - by not Italian-mother-tongue people ... Not even to mention it, in a dubbed version! ...",
         "Scipio the African is an Italian costume drama which takes endless dialogue scenes and throws them into a slow-moving historical story. I'm not sure why it's listed as a comedy as apart from a bit of irony and comparison with 20th century history and the occasional scene of raspberry-blowing there's little here that could be defined as such. Instead what we get is a bunch of middle-aged and older Italian actors standing around and discussing the important issues of the day while Woody Strode cameos as a tribal chieftain. The thrust of the plot is a political battle of wits between Marcello Mastroianni's Scipio and Cato the elder statesman, but the whole film seems utterly devoid of the basic film-making techniques of editing, suspense, and style to give it an 'oomph'. Instead it just feels staged and like a filmed play. I found it a snooze-fest."
      ],
      "genres": [
         "Comedy",
         "History"
      ],
      "productionCompanies": [
         "F.I.C.",
         "Filmgesellschaft",
         "Ultra Film"
      ],
      "summaries": ["Years after the Second Punic War, Scipio Africanus finds himself generally unliked, despite his defeat of Hannibal Barca. He and his brother, Scipio Asiaticus, are accused by Marcus Porcius Cato of the theft of 500 talents intended for Rome."],
      "budget": 0
   },
   "movielensId": 143849,
   "movielens": {
      "languages": [""],
      "releaseDate": "1971-09-09",
      "dvdReleaseDate": null,
      "directors": ["Luigi Magni"],
      "runtime": null,
      "movieId": 143849,
      "title": "Scipione detto anche l'africano",
      "mpaa": null,
      "actors": [
         "Marcello Mastroianni",
         "Silvana Mangano",
         "Vittorio Gassman",
         "Ruggero Mastroianni",
         "Turi Ferro",
         "Woody Strode"
      ],
      "imdbMovieId": "0067719",
      "originalTitle": "Scipione detto anche l'africano",
      "genres": [
         "History",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 273868,
      "avgRating": 2,
      "releaseYear": "1971",
      "numRatings": 1,
      "posterPath": "/hlUG9PY4KK5XwM39vE43Q1abJnW.jpg"
   }
}