{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0064019",
      "video": false,
      "title": "Love and Anger",
      "recommendations": [],
      "backdrop_path": "/h2MsbSJUL6Y4ZsWCLJ5uyiFKTGC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Dio",
               "gender": 0,
               "credit_id": "52fe4796c3a36847f813daaf",
               "name": "Aldo Puglisi",
               "profile_path": "/lfyyQ5BEV8RUQTEFLzE3u0ANY6z.jpg",
               "id": 55135,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dying Man",
               "gender": 0,
               "credit_id": "52fe4796c3a36847f813dab3",
               "name": "Julian Beck",
               "profile_path": null,
               "id": 130723,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Riccetto",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dab7",
               "name": "Ninetto Davoli",
               "profile_path": "/1c9lx9a6DfzN1ftpfshwhyKkip3.jpg",
               "id": 23367,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "The Actress",
               "gender": 0,
               "credit_id": "52fe4796c3a36847f813dabb",
               "name": "Christine Guého",
               "profile_path": null,
               "id": 592492,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dabf",
               "name": "Tom Baker",
               "profile_path": "/5YVqQyW8jiAPHnRsPEbR08fiOAQ.jpg",
               "id": 44865,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813dac3",
               "name": "Nino Castelnuovo",
               "profile_path": "/edyUJkPj8k8bEiRb4XFIlnqoCG9.jpg",
               "id": 5476,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4796c3a36847f813dac7",
               "name": "Catherine Jourdan",
               "profile_path": "/hLPxSkGrKjs6uN32AR8KaLNPJIa.jpg",
               "id": 20945,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4796c3a36847f813dacb",
               "name": "Paolo Pozzesi",
               "profile_path": null,
               "id": 1013078,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813da93",
               "name": "Marco Bellocchio",
               "profile_path": "/gIVYV8geh42m7yex0fG9wdU0I65.jpg",
               "id": 105866,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813da99",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813da9f",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813daa5",
               "name": "Carlo Lizzani",
               "profile_path": "/ub7mqgWBDwS3B1eGmP9PoOIpy1F.jpg",
               "id": 122016,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4796c3a36847f813daab",
               "name": "Pier Paolo Pasolini",
               "profile_path": "/zHqXNL85yvOokI7y12UGS1Lkm6D.jpg",
               "id": 5970,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "551b1c5e9251417fd70007e2",
               "name": "Elda Tattoli",
               "profile_path": null,
               "id": 1128183,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54ddcdc2925141195a0011e9",
               "name": "Puccio Pucci",
               "profile_path": null,
               "id": 1426728,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54ddcdd2c3a3684541001586",
               "name": "Piero Badalassi",
               "profile_path": null,
               "id": 1426730,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ddcde592514119560012e7",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ddcdf3925141027c000d57",
               "name": "Marco Bellocchio",
               "profile_path": "/gIVYV8geh42m7yex0fG9wdU0I65.jpg",
               "id": 105866,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ddce02c3a368454100158f",
               "name": "Carlo Lizzani",
               "profile_path": "/ub7mqgWBDwS3B1eGmP9PoOIpy1F.jpg",
               "id": 122016,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ddce11c3a36845550011e1",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54ddce1ec3a368537a000cd8",
               "name": "Pier Paolo Pasolini",
               "profile_path": "/zHqXNL85yvOokI7y12UGS1Lkm6D.jpg",
               "id": 5970,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.8655,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 49456,
      "vote_count": 8,
      "budget": 0,
      "overview": "Five short stories with contemporary settings. In New York, people are indifferent to derelicts sleeping on sidewalks, to a woman's assault in front of an apartment building, and to a couple injured in a car crash. A man, stripped of his identity, dies in bed with actors expressing his agony. A cheerful, innocent young man walking a city street in a time of war pays a price for this innocence. A couple talks about cinema while it watches another couple talk of love and truth on the eve of one character's return to Cuba. Striking students take over a university classroom; an argument follows about revolution or incremental change.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Amore e rabbia",
      "runtime": 102,
      "poster_path": "/yRvNAevx6jcIUBhbXh62j1DkdjG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ital-Noleggio Cinematografico",
            "id": 4990,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Castoro",
            "id": 10451,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Anouchka Films",
            "id": 14679,
            "origin_country": ""
         }
      ],
      "release_date": "1969-05-29",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Marco Bellocchio",
         "Bernardo Bertolucci"
      ],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Puccio Pucci",
         "Piero Badalassi"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0064019/",
      "coverLink": null,
      "actors": [
         "Tom Baker",
         "Julian Beck",
         "Jim Anderson"
      ],
      "reviews": [
         "The '60s at its most annoying, this has got to be the worst of all the European portmanteau films. There's very little of worth in these shorts even if you're a die hard fan of the directors. The one possible exception is Godard's segment, \"Amore,\" which is kind of pretty, mostly due to the two gorgeous actresses who star in it (Christine Gueho and Catherine Jourdan). Kind of an amusing cinematic deconstruction, it gets a bit lost in the leftist politics of the rest of the film. The first segment, by Carlo Lizzani, starts interestingly enough, as a cinematic study of the psychological principle of diffusion of responsibility. A woman in New York City is being attacked, but no one will help her. Then there's an auto accident, and a gravely injured woman is forced into the car of an unwilling bystander. The plot gets really silly as the driver of that car turns out to be a wanted criminal. The short just randomly stops. Bertolucci's segment comes next and is little more than some stuff left on the cutting room floor from his most recent feature, Partner. It's somewhat cinematically interesting, but it doesn't go anywhere and it gets annoying long before it ends. Pasolini's segment is third. It's probably the least annoying of the shorts, but it's also completely forgettable. Ninetto Davoli, that afro-ed boy who appears in many of Pasolini's films, walks along a busy street, often carrying a giant flower. Images of the Vietnam War are superimposed over the street scenes. Godard's sequence, which I've described above, comes next. The final and worst short is by Marco Bellocchio and Elda Tattoli. A bunch of student protesters burst into a university lecture and spout Maoist slogans. The subtitles become an uninterpretable wall of text after around one minute. It immediately brings to mind one of my favorite Kent Brockman lines from The Simpsons, when describing the 1960s: \"What a shrill and pointless decade.\"",
         "Comments have complained that this portmanteau film is dated. It would be better to say it registers a crucial political, cultural, and cinematic moment. Marco Bellocchio's short film works best to my thinking. His \"Discutiamo, discutiamo\" (Let's Talk; We're Talking; or maybe Talk and Talk, if you're inclined to be bored) is a dramatic imitation by students of the university movements of the late 1960s, and includes real differences of opinion (it starts with a lecture on Croce's aesthetics; later there's an attempt to set a Croce paperback on fire), and opinions worth remembering once existed. \"La lotta continua\" (class struggle), authoritarian schooling in ruling class values, the small percentage of youths of poor families in university--sure, that's so passé. And for Bertolucci there's Julian Beck as Artaud; for Pasolini, dialectic around the pleasure of Ninetto Davoli. Even Godard's go-gauche, lordly treating every opinion as a quotation, letting all the wind out of what might be concern--or Amore. (See better Bellocchio's \"La Cina è vicina\" for a fashionable leftism.) The Rabbia or righteous wrath of the title is mostly also left to viewers back then or now, and maybe it didn't get rooted.",
         "spotty collection of shorts by 5 directors. some are intriguing, others are just plain tedious. let's go through them in order. the first short is a merging of two stories about women being violated. they're two different narratives that are combined to tell the story of a woman in danger and then being saved. the first one starts off with a man chasing a woman through the city with lots of shots of indifferent people in their appartments doing their everyday thing. there are several shots of appartment buildings that gives a sense that this women is utterly helpless, she is lost in a world of concrete buildings that don't give any heed to her cries for help. cut to a different story about a guy trying to rescue a woman from a car accident, which seems like it was from another american tv show. the second one is one by bertolocchi (spelling?) and is the most tedious of them all. weird artsy dancing, montage poses and strange noises emitting from these dancers. at first you think this place is a weird therapy session cuz the dancers look like they were pulled off hte street and they sit in a circle chanting something. then they do these weird moves with lots of moaning and groaning and incoherent mutterings. i think the segment of this session is called agony, so i guess these people are doing artsy interpretations of agony. then an old man comes a long, who's dying and all these people start dancing around him. this one runs on for about 20 minutes...20 minutes i'll never get back. the third one is one about a man running through the streets. various shots of streets with various political images superimposed on top. i don't know what a lot of these images are, but i deduct they're about the vietnam war and other various political wars around the world. then occasionally, this man has a huge flower in his hands and he starts to dance in the streets to this happy dated italien pop music. it's these scenes that put a smile on my face cuz it's just so rediculous and fun to watch. the 4th short film is by Jean luc godard. i've seen many godard films and this is a very typical godard film. you've got a couple...the girl is jewish and the guy is arabic. he kisses her, carass her naked body and talks in a way only godard characters do...a mixture of musings on love and politics. intercut with another couple who talk about the film that they're in. saying things like....\"what's that over there?\" \"why, i think it's the opening of a film...\" \"i think they're gonna break up...\" \"if they break up, the film will be over...\" etc. i have a general understanding of what godard's references and what he is talking about, so it doesn't feel as tedious to me as it would to others. but still......those who don't have a bit of academic background in film...you'd most likely like to keep away from this. the last film is one about a debate going on in a university as a group of marxist students interupt a class to debate about marxist ideology and general anarchy against the university system. these students want a marxist revolution and a overthrow of the general university system. the dean, proffessor and the students in the class call for reform from inside the system. and there goes on a debate between change within the system vs. overthrowing the system. this discussion actually captivated me, despite the fact that this is pretty dated politics. this film being released in 1969, this is obviously a depiction of the kinds of political debates between students and institutions around 1968. where university students basically rioted and demostrated for a fairer university system and rejected old institutions while embracing marxism. for those who have an interest in the political demostrations of 1968 in europe, this film documents this point in time pretty well. it's clear that the film maker is on the side of the marxist students with the final shot of the film. so what can you say over all about this collection of short films? overall, it's mostly a political film, especially with the last three stories and the credits rolling with the sound of dull thuds of foam bats beating people symbolizing police brutality. i think this film has a very specific film audience...either young students in the late 1960s (this audience obviously no longer exists), people who have an interest in any of the directors here or people who are interested in the history of 1968 and want to see an artistic representation of it. to everyone else, you've been warned. it's a collection of artsy political films you'd probably wouldn't want to watch.",
         "One of these countless pseudo cinema vérité works which throve in the sixties in the wake of Godard and the events of 1968.This one is for highbrows ,die-hards.The rest of us can taketo their heel,or else they will yawn their head off. Segment one is \"l'indifference\" :the beginning is some kind of illustration of Phil Ochs's song \"outside of a small circle of friends\"(1967);but soon enough is enough and when the reluctant driver appears ,it totally fails to convince. Segment two is the most \"avant-garde\" ,so to speak ,of the lot: a dreadful pot-pourri of OM,Christian religion,group psychology(?).Some equivalent of one of Yoko Ono's pieces of work circa late sixties. Segment three is Pasolini's contibution to this bill of fare:his favorite actor ,Ninetto Davoli,is wandering (dancing?)in the streets ,hoding a big paper flower(that's the title of the short).Let He who Hath understanding see the meaning. Segment four is Godard's \"l'amour\".There are two sides:the political one,which focuses on Cuba,and some kind of self-criticism:his dogma ,his refusal to consider the movie as a story:at least here he says that it's not because you 've seen a lot of movies that you know the cinema;and that the seventh art is like maths before Euclide;and he goes not as far as to say that the nouvelle vague was Euclide.Modest,for a change.That does not make his segment interesting for all that. Segment five takes place in an Italian university where student exchanges trivia about the Bourgeoisie's stranglehold on the culture.Plus ça change.. The precedent user complains about the different languages that they used in the different segments:now English,now Italian ,now French,even German;it's all in the cinema vérité game! If you want to see a beautiful contemporary political movie that will not give you a headache ,take Luigi Comencini's \"lo scopone scientifico\" instead.",
         "This film is an attempt by five different directors to present their take on the theme of \"Love and Anger\". Five well regarded film personalities were gathered to offer their views in a disjointed attempt to make sense of theme. Alas, what comes out on the screen is, at best, a boring display by some of these men, who have done much better work, to try to interest us with their mostly leftist views without convincing us. As DB Dumontiel commented in this pages, the more modern the five creators wanted to be, the more dated their contributions become. Of the five segments shown, Carlo Lizzani's \"L'indifferenza\" is the only one that makes any sense. Filmed totally in New York, without an Italian dialog, it clearly illustrates one of the big problems in our society, and a phenomenon in our bigger cities where people totally ignore situations that claim for human intervention, as in the case of the selfish driver in this piece who tells the cops he doesn't want to get involved, and succeeds in doing so. The Bertolucci vignette is a heavy critique on religion, as he directs the New York based theater group headed by Julian Beck and Judith Malina and members of their eclectic group performing a ritual as a church higher up is dying. The Passolini contribution shows a young actor, Ninetto Davoli, cavorting on Rome's Via Nazionale while over imposed pictures of legendary leftist icons like Che Guevara appear over the action in the film. The Godard piece, is pretentious, at best, and the last piece, by Marco Bellocchio, shows a university class as they discuss nothing. This film might have appeared as revolutionary when it was released, but viewing it today, the only thing it elicits from the viewer is boredom and surprise in realizing that even great directors like the ones participating in this film can lay an egg without really trying.",
         "Five short films joined together. I guess they're all about Love and Anger but then just about any story could fit that vagueness. 'Indifference' by Lizzani shows people being indifferent to a woman being attacked, homeless people, and some car-crash victims. It has an unsatisfactory ending. Was probably pretty topical at the time - a woman called of Kitty Genovese was killed in New York in 1964 while others looked on. 'Agony' by Bertolucci is awful - just a bunch of people in a room dancing around and occasionally making cryptic statements. I strongly recommend you fast-forward this one and stop it only if you seem some interesting images. At this point in watching the film I started to get worried: pseudo-intellectual artsy stuff. And we hadn't even got to the Jean-Luc Godard segment yet. 'Sequence of the Paper Flower' by Pasolini shows an idiot wandering the streets of an Italian city (Rome?) and chatting to people. Double-exposed over him are shots of war and politicians so this is probably trying to say something deep but it wasn't clear to me what. 'L'Amore' by Godard is actually pretty good! Witty dialogue between a couple talking about another couple in a film, along with some striking images. This one warrants a second viewing. 'Talk, Talk' by Bellocchio and Tattoli is also good, showing a group of students acting out a protest against university establishment. In May '68 there were many student takeovers of universities in France and around the world so this was pretty topical. The arguments are great, tackling whether to reform the system from within or to strike at it from without. My guess is that the title implies that students were engaging in too much talk and not enough action. So only two of the five films work but at least all the films try to say something interesting which is more than most films today do.",
         "Once interested in viewing a script outline or a detailed dialog box inspired by the short séance \"DEL FIORE DI CARTA\", you are kindly requested to refer to the Italian revue ANTEPRIMA, No 5, Sassoferatto , Ancona, Italy, published in January 1998, page 31, where I published the film scenario entitled \"ISMAEL\", with a prologue about Laura Betti's opinion Nicolas Xenios, ISMAEL, Omaggio a Pier Paolo Pazolini, Translated and adapted by Tea Boldrini. The story is about an archetypal three-membered family of the western cultural context , who walk and talk about death in their typical middle class apartment . In parallel, a Guillotine is being prepared in a medieval small town in front of the prison where the leading role, Ismael, is about to be condemned to death by the local judge. The crowd is invited to accomplish the procedure by gathering in front of the prison, where the execution will take place as soon as the flower Narcissus near his prison window will faint. The unexpected fact will be that the prisoner's daughter, after her long prayers to God, will decide to replace the real flower Narcissus near her father's window by a similar paper flower that will, naturally, never faint. The result is that FEAR of the eternity will replace the existentialists fear for DEATH and the prisoner's shadow will purchase him for ever and ever. The text is published in Italian. You are welcomed to read and comment on it my Italian speaking friends. Bye thanks"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Castoro",
         "Italnoleggio Cinematografico",
         "Anouchka Films"
      ],
      "summaries": ["Five short stories with contemporary settings. In New York, people are indifferent to derelicts sleeping on sidewalks, to a woman's assault in front of an apartment building, and to a couple injured in a car crash. A man, stripped of his identity, dies in bed with actors expressing his agony. A cheerful, innocent young man walking a city street in a time of war pays a price for this innocence. A couple talks about cinema while it watches another couple talk of love and truth on the eve of one character's return to Cuba. Striking students take over a university classroom; an argument follows about revolution or incremental change."],
      "budget": 0
   },
   "movielensId": 144088,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "1969-05-29",
      "dvdReleaseDate": null,
      "directors": [
         "Marco Bellocchio",
         "Bernardo Bertolucci",
         "Jean-Luc Godard",
         "Carlo Lizzani",
         "Pier Paolo Pasolini",
         "Elda Tattoli"
      ],
      "runtime": 102,
      "movieId": 144088,
      "title": "Love and Anger",
      "mpaa": "",
      "actors": [
         "Aldo Puglisi",
         "Julian Beck",
         "Ninetto Davoli",
         "Christine Guého",
         "Tom Baker",
         "Nino Castelnuovo",
         "Catherine Jourdan",
         "Paolo Pozzesi"
      ],
      "imdbMovieId": "0064019",
      "originalTitle": "Amore e rabbia",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Five short stories with contemporary settings. In New York, people are indifferent to derelicts sleeping on sidewalks, to a woman's assault in front of an apartment building, and to a couple injured in a car crash. A man, stripped of his identity, dies in bed with actors expressing his agony. A cheerful, innocent young man walking a city street in a time of war pays a price for this innocence. A couple talks about cinema while it watches another couple talk of love and truth on the eve of one character's return to Cuba. Striking students take over a university classroom; an argument follows about revolution or incremental change.",
      "tmdbMovieId": 49456,
      "avgRating": 3.33333,
      "releaseYear": "1969",
      "numRatings": 3,
      "posterPath": "/yRvNAevx6jcIUBhbXh62j1DkdjG.jpg"
   }
}