{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0499540",
      "video": false,
      "title": "The Other",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Juan Desouza",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131613",
               "name": "Julio Chávez",
               "profile_path": null,
               "id": 583126,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Receptionist",
               "gender": 1,
               "credit_id": "52fe498ec3a368484e131617",
               "name": "María Onetto",
               "profile_path": "/5HPx91m8AGhp2NJi4pjknLhn746.jpg",
               "id": 1051297,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Woman",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13161b",
               "name": "María Ucedo",
               "profile_path": null,
               "id": 1051298,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Claudia",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13161f",
               "name": "Inés Molina",
               "profile_path": null,
               "id": 1282575,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Notary",
               "gender": 2,
               "credit_id": "52fe498ec3a368484e131623",
               "name": "Arturo Goetz",
               "profile_path": null,
               "id": 50929,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "Father John",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131627",
               "name": "Osvaldo Bonet",
               "profile_path": "/5rHGjxboKrZcPwRvZXC6gX0TwDN.jpg",
               "id": 999999,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13160f",
               "name": "Ariel Rotter",
               "profile_path": null,
               "id": 583125,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13162d",
               "name": "Ariel Rotter",
               "profile_path": null,
               "id": 583125,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe498ec3a368484e131633",
               "name": "Marcelo Lavintman",
               "profile_path": null,
               "id": 966352,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131639",
               "name": "Eliane Katz",
               "profile_path": null,
               "id": 969231,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.904603,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 78115,
      "vote_count": 4,
      "budget": 0,
      "overview": "Arriving at a distant town, a businessman decides to take the identity of a passenger who died during the bus trip.",
      "similar": [],
      "original_title": "El Otro",
      "runtime": 83,
      "poster_path": "/7jxxVLx3DgT9LM8lwOE8xVl27lF.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": "/aWrTeKCGu9jjsiiVSDsALC3vxu4.png",
         "name": "Celluloid Dreams",
         "id": 860,
         "origin_country": ""
      }],
      "release_date": "2007-05-10",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ariel Rotter"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Ariel Rotter"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0499540/",
      "coverLink": null,
      "actors": [
         "Julio Chávez",
         "María Onetto",
         "María Ucedo"
      ],
      "reviews": [
         "I think this is a film about life, the passing of time and getting older. It is a slow moving film, not much dialog and little action.But this is necessary to get you into the situation. Juan is a middle-age man who notices that he is getting old (he cannot see without glasses anymore). At the same time his wife is pregnant and his father is dying. These facts lead him to a journey throughout his life, an inside journey. \"The other\" is the man that he is not any longer, or the one that he is never going to be (other professions, other backgrounds).Life, death and time. The film is simple in appearance: Juan takes a bus and walks along the streets, meets different people, changes his name, etc. but it invites you to feel and understand his experience, that is human experience. Juan is very well performed by Julio Chávez and the characters look like people in a dream. In fact, I think that if it would have been a dream it wouldn't make any difference. i do not recommend this film to very young people, of those who like action and a clear argument. It is a film for people in the forties who like to think and discuss about important things in life.",
         "This nicely shot Argentinean film is a work of minimalism about Juan, a man who is going through a transitional phase in his life: he finds out he needs glasses, he has arrived at the point where he has to take care of his father like a child, and his wife has just realized she is pregnant. Then, on a bus ride a man who looks very much like Juan sits down beside him and dies somewhere along the way. Obviously disturbed, he goes on to his work appointment where he hears the story of a couple who has just died, leaving their substantial property to the bank they were heavily in debt to. Examining their house, which is still full of their possessions, is too much for Juan. He checks into a hotel instead of returning home and proceeds to take on various identities; he creates a new one for practically everyone he meets for the couple of days he sticks around. This is a subtle, carefully observed film full of long, still shots that tend to be very nicely composed. It's not a particularly dramatic film but it does succeed in drawing the viewer into the world of a normal man on the cusp of middle age. Basically, this is the type of film in which the protagonist has one last adventure on his own before settling into the next stage of his life. As such, this is an art-house version of a familiar type of film but it's executed well enough to make it worthwhile.",
         "This is a deeply psychological drama, free from any action. Slow movement with separate episodes forming a puzzle. Subtly and from various episodes, the movie constructs a picture of a man, who at some point was abandoned by his mom, and his dad became and remains his only real affection. The son barely speaks to his mom. The affection father - son is mutual and exclusive for anybody else, even for girlfriends/wife. Some females do appear in the picture, but they do not have his love extended to them, even after intimacies take place. The father is sick, and the son is emotionally engrossed into the thinking of death. He runs away from an evening in the bar. He comes to the funeral of a stranger he met on the bus to see how it looks like to be dead. He rents hotel rooms under the names of deceased men, and nobody comes to question him - because those men are already forgotten! He still wants to fight death, even when the dying person is an old lady, not particularly attractive while unconsciously spread on her bed in her underwear. The hero is disgusted by the view, but performs CPR and saves her life. The final exchange - a small number of words - serves as a key to the whole movie.",
         "As the story begins, several groups of letters appear. It is clear there is an eye examination going on. Juan DeSouza, a forty-something man needs glasses. Juan takes time from work to oversee the care of his bedridden father, something that is lovingly done by the son. The business trip taking Juan away from Buenos Aires to a provincial town, triggers something within him perhaps of the experience of seeing his seat mate die of an apparent heart attack. What follows is a kind of detour Juan takes to settle things within himself. He assumes different names, and professions, as a way to avoid being found out for what he really is. In the process Juan DeSouza will come to terms with a situation that will be revealed eventually at the end of this tale about search and discovery about oneself. Ariel Rotter, the creator and director of \"The Other\", does not like to adorn the film with superfluous incidents. His minimal approach works because the man at the center of the story, who at first appears to be an enigma, is an elusive man that takes a while to know. Mr. Rotter's admiration for Michaelangelo Antonioni is obvious, without falling into a parody. He has given us a man that appears to be at a crossroad in his life. On the one hand, his older father, weak and infirm, weighs heavily on his life, on the other, his acceptance of fatherhood is questioned by the way he acts throughout the story. This is an almost silent film since Mr. Rotter simply concentrate on the tale at hand without embellishments like a musical score. In Julio Chavez the director found a great actor that does a tremendous job in bringing Juan DeSouza to life. Mr. Chavez does not have the good looks that other of his contemporaries have. What he brings to the film is his integrity in portraying this tormented man and gives him a life of its own. Mr. Chavez is a wonderful presence in anything he does, being on the legitimate stage, or in films, and even television series. The supporting cast is excellent, especially Maria Ucedo, who does wonders with her character. Osvaldo Bonet is seen as the father, and Ines Molina and Maria Oneto add to the enjoyment of the film. Thanks to the cinematography of Marcelo Lavintman, who has worked with Mr. Rotter before, the film feels intimate despite the vast areas where it is set.",
         "El otro (The Other) is an Argentine film made in 2007, directed by Ariel Rotter. It's a small film about a middle-aged man, who suddenly becomes a father when his own father is dying. It is a movie about a man's identity crisis. A middle-aged man (Julio Chávez) who is taking care of his old father finds out that his wife is pregnant. In result of this he leaves his home and goes for a \"business-trip\". He walks down the vacant streets of Argentina and tries to find his place. In every situation where he has to introduce himself, he uses a different name, a different identity. The Other is a very quiet film. There's not much of dialog and not much happen in it. It's very minimalistic. But this makes the visual narrative even more important. The director let's us observe on our own and make our own interpretations. Ten minutes in and you will notice something unusual about the camera-work. The camera isn't moving, it doesn't follow the characters. This can be interpreted philosophically. The camera stays still, it takes distance to the main character. It just shows him walking down the streets, movement, but the camera itself doesn't move. So what we see is a man walking but not really moving forward. His life stays still. He is a prisoner of this stable situation that he cannot detach from. It's quite interesting to see if he'll find a solution? Will he be able to detach from his stable life? So who is The Other? Is it the man's other identity or is it the other father? Is it the man he never came? The shots of The Other are very beautiful. The man walking the empty streets, filling an empty chair. Beautiful film I must say. I will probably remember The Other from its minimalism: It doesn't have music at all, the dialog is marginal and it doesn't have a certain climax. I will also remember the good cinematography, which let the viewer to observe, think and get satisfied by the solutions.",
         "I'm thinking maybe \"Cordero de Dios\" and \"La mujer sin cabeza\", two of the most important Argentinean films of last year, may have taken a bit of inspiration from \"El otro\", writer/director Ariel Rotter's tale of desperation and loneliness. The visual search, with accentuated and well framed still cameras, the apparent nothingness of the events that take place (usually confused with the term 'boring'), speak well of Rotter-in terms of a filmmaker with something to say- and recall the movies previously mentioned. But the visual search here is clearer than in \"Cordero de Dios\" and the situation that leads to the 'journey' of the protagonist, Juan (Juio Chávez), is less specified than in \"La mujer sin cabeza\". In both aspects, \"El otro\" seems to be a riskier picture; a picture that is less willing to help the viewer solve its mysteries. And when I say 'journey' I mean not only the journey we see Juan experience on screen but also the one he's living inside; and don't forget a journey of the senses for the viewer\u0085A journey where the viewer is obliged to think. Suddenly Juan, an apparently calm lawyer, seems to run away from the comfort of his daily life. He finds out his wife's pregnant, he arrives home and we see him staring at her feet (an image that's recurrent throughout the film); then he visits his sick father (Osvaldo Bonet) and tells him he'll not be with him the next day because of a business trip. When we see Juan on the bus before leaving, he looks sweaty and tired. If you pay attention, you may conclude he's scared. And the journey begins. Why? How is it possible? Is there something more than the sudden news? With the car crash suffered by Vero (María Onetto, who also plays a small role here), Lucrecia Martel made it easier for the viewer, delivering something/somewhere precise to depart from, and showing us her inner circle of people. About Juan we know nothing, and it's to Rotter's credit that we follow the actions of this boring-and maybe bored-man with a lot of interest for more than an hour. I was never quite sure where Juan went for his business trip, but the movie doesn't want us to know about that particular place and its people. The only thing the movie wants from that place is that it appears as virtually deserted and has something appealing enough so Juan decides to stay for more than one day. The rest is improvisation, or it may all be a dream. Sudden convenient deaths, beautiful improbable women, two or more hotels (also virtually deserted), Juan walking in the dark night with his black suit: his fear, our fear. The morning: peace. With this title role, Julio Chavéz completes the 'silence' trilogy started with \"Extraño\" and \"El custodio\". Far away from the pretentious objectives of the first film, and with a lot of more room to talk than in the second one, Chávez finds in Juan a natural balance and exploits it achieving the best performance of the three. Some elements are the same (we are never sure of who the man is, what his intentions are and, of course, the silence), but the director's concept is more well-rounded than in the previous pieces and it comes to light in the actor's work. Let's never forget that cinema is many things, and making us think can't be something to underestimate. When Juan is all by himself at a funeral, without knowing exactly why he's there; when he's standing watching the coffin in his black suit, I thought about a chapter in Albert Camus' \"L'Etranger\". There, the main character expressed his inside thoughts of how he felt in a similar situation. I think Juan was saying those same things, or maybe not. What do you think?",
         "I just came back from \"El Otro\" playing here in Buenos Aires and I have to say I was very disappointed. The film is very slow moving (don't get me wrong, I enjoy slow moving films!), slow to the point of driving you crazy. All you hear is Julio Chavez breathing heavily throughout the whole film. This is a poorly made film, but more importantly, it is a film without a lick of inspiration, I felt nothing for the story or its characters. \"El Otro\" was made only for the sake of making a film... making it forgetful. I would advise you to pass on this one, if you want to see good Argentinian films, look for films by Sorin.",
         "The title should have been \"The walker\". That was only he did walk. There was nothing on the movie that was good. The description of the movie doesn't really comply with the plot. The only thing that I can get from the movie is that he was a good son, but a low life terrible person. I'm sorry that I expend my money and time, on this movie. I saw people leaving the theater in the middle of the movie. I stayed hoping that it will better....what a mistake. I got worse. If there is a suggestion that I can make to he producer is to re-direct his life to another field, because making movies is definitely no his cup of tea",
         "The title should have been the walker. The guy expend 90% of the movie walking. He doesn't know what he wants, or what he is. Go through life stealing peoples identity for nothing. He gets no benefit, no money, nothing pretending to be another person. No body was able to understand why he was pretending to be somebody else. The only thing that was clear in this movie is that he love his father and was a good son. But the rest was crap. May be director is a looser that would like to be somebody else. But what he really should do is to get a real job, because after his movie, I don't think he has a chance to make as a movie producer.",
         "I just finished watching \"El Otro\". I have always taken my hat off to Julio Chavez's performances, as he is a great actor, but this movie is really depressing and slow. I guess that it would have been even worse if it wasn't for Julio. Anyways, this is definitely a film that you will never understand if you are not from Argentina, and even if you are, I would advise you not to rent this movie in order to have a nice time with your girlfriend, boyfriend, family or friends... it is really depressing and incredibly slow, and the plot does not make a lot of sense neither. Probably the director wanted to show the fragility of the human life, but what he does is bore and impress the audience with scenes that shock you a little bit. It gives you something to think about, but not in a good way. Overall, I definitely didn't like this movie.",
         "Guy walking around without motive... I will never get those two hours of my life back. The guy kept on assuming identities and cheating on his pregnant wife. What was I thinking? How did this win a price anywhere? I understood he loved his father but other than that the movie was completely senseless to me. What was the purpose of walking so much and going to the funeral of a stranger for no apparent reason. How did this enrich his life??? Why did we have to see the dying old lady on her underwear????!!! Why???!!!! I though it would be deep or about something more interesting. I do not recommend the movie even to leave on while sleeping..."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Aquafilms",
         "Celluloid Dreams",
         "Selavy"
      ],
      "summaries": ["Arriving at a distant town, a businessman decides to take the identity of a passenger who died during the bus trip."],
      "budget": 0
   },
   "movielensId": 144037,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2007-05-10",
      "dvdReleaseDate": null,
      "directors": ["Ariel Rotter"],
      "runtime": 83,
      "movieId": 144037,
      "title": "The Other",
      "mpaa": null,
      "actors": [
         "Julio Chávez",
         "María Onetto",
         "María Ucedo",
         "Inés Molina",
         "Arturo Goetz",
         "Osvaldo Bonet"
      ],
      "imdbMovieId": "0499540",
      "originalTitle": "El Otro",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["kGUOfCJ1GIg"],
      "plotSummary": "Arriving at a distant town, a businessman decides to take the identity of a passenger who died during the bus trip.",
      "tmdbMovieId": 78115,
      "avgRating": 2.5,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/7jxxVLx3DgT9LM8lwOE8xVl27lF.jpg"
   }
}