{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "escape artist",
            "id": 154884
         }
      ],
      "imdb_id": "tt0010195",
      "video": false,
      "title": "The Grim Game",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harvey Hanford",
               "gender": 0,
               "credit_id": "52fe4d56c3a36847f825b8e9",
               "name": "Harry Houdini",
               "profile_path": null,
               "id": 1043380,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dudley Cameron",
               "gender": 2,
               "credit_id": "5626c59792514137c9000377",
               "name": "Thomas Jefferson",
               "profile_path": null,
               "id": 240803,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mary Cameron",
               "gender": 0,
               "credit_id": "5626c5a6c3a36827910003fe",
               "name": "Ann Forrest",
               "profile_path": null,
               "id": 1388114,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Clifton Allison",
               "gender": 0,
               "credit_id": "5626c5ba92514137bb00036c",
               "name": "Augustus Phillips",
               "profile_path": "/lvjk6PPiFAmQrTY18tmG2TaJ9KT.jpg",
               "id": 28973,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Richard Raver",
               "gender": 2,
               "credit_id": "5626c5ca92514137c7000396",
               "name": "Tully Marshall",
               "profile_path": "/zywfVcAvVfinpH4wI7f7wvgdDr9.jpg",
               "id": 13359,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Harvey Tyson",
               "gender": 2,
               "credit_id": "5626c5d992514137c400037a",
               "name": "Arthur Hoyt",
               "profile_path": "/zeXxwPwVOmLIIyO6qrsdYCVylzk.jpg",
               "id": 29263,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ethel Delmead",
               "gender": 1,
               "credit_id": "5626c5e7c3a368278600035e",
               "name": "Mae Busch",
               "profile_path": "/tb7nFi7ACR7fnZ0Crke0eVUJQqN.jpg",
               "id": 34757,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Police Reporter",
               "gender": 0,
               "credit_id": "5626c5fb92514137c70003a6",
               "name": "Edward Martin",
               "profile_path": null,
               "id": 1431239,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hannah",
               "gender": 0,
               "credit_id": "5626c609c3a368277f000431",
               "name": "Jane Wolfe",
               "profile_path": null,
               "id": 1524992,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "5626c61192514137c4000384",
               "name": "George Cowl",
               "profile_path": null,
               "id": 1170685,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d56c3a36847f825b8e5",
               "name": "Irvin Willat",
               "profile_path": null,
               "id": 1157584,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5626c63592514137bb000383",
               "name": "Walter Woods",
               "profile_path": null,
               "id": 1069379,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "5626c64ac3a368277a0003ed",
               "name": "Irvin Willat",
               "profile_path": null,
               "id": 1157584,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5626c65c92514137cf0003cd",
               "name": "Jesse L. Lasky",
               "profile_path": null,
               "id": 1004059,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5626c66c92514137c00003ff",
               "name": "Frank M. Blount",
               "profile_path": null,
               "id": 1524994,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5626c67c92514137cd0003b2",
               "name": "J.O. Taylor",
               "profile_path": null,
               "id": 3251,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.002363,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 175005,
      "vote_count": 0,
      "budget": 0,
      "overview": "Jailed unjustly for a murder he did not commit, a young man uses his amazing powers of escape to free himself and pursue the actual killers, who hold his fiancée captive.",
      "similar": [
         8067,
         1696,
         4771,
         275,
         9039,
         507,
         9373,
         562,
         10668,
         74997,
         123109,
         2320,
         2163,
         8090,
         984,
         10742,
         11423,
         274,
         1571,
         10285
      ],
      "original_title": "The Grim Game",
      "runtime": 71,
      "poster_path": "/4Sx9XP4Mb2vZnsPpjfEpcXcdoR7.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1919-10-11",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Irvin Willat"],
      "runtime": 71,
      "synopsis": null,
      "writers": [
         "Arthur B. Reeve",
         "John Grey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0010195/",
      "coverLink": null,
      "actors": [
         "Harry Houdini",
         "Thomas Jefferson",
         "Ann Forrest"
      ],
      "reviews": [
         "From Houdini.org: Magicians Dorothy Dietrich and Dick Brookz, from the Houdini Museum in Scranton, PA, tell the story of the finding and restoration of the long lost Houdini silent movie from 1919, \"The Grim Game\". Dorothy Dietrich and Dick Brookz from The Houdini Museum in Scranton, PA revealed, \"The film has not been shown to the general public for 96 years. This was one of the most sought after items in Houdini History. It has been considered the Holy Grail of Houdini history!\" Houdini's movie \"The Grim Game\" made in 1919, has been unavailable until now and has been considered lost by film historians. Brookz commented, \"The only complete copy of the film was hidden in the collection of juggler, magician, Houdini collector Larry Weeks. Dorothy and Dick had kept a friendly relationship with Larry Weeks and that is what helped to make this happen. Larry Weeks called himself \"Houdini's biggest fan\" and amassed a Houdini collection. He had the only known print of Houdini's lost film, \"The Grim Game.\" He was known to show it at various occasions in his life time. It is the best of Houdini's five films. Dick Brookz commented \"Over the years Larry invited us to see the film on two occasions. He found it odd and incomprehensible when I, Dick Brookz, told him that some magicians berated him for hoarding the movie that he preserved over the years at great personal cost.\" We called Larry Weeks on his private number and told him about our desire to have the film restored. It took several calls and over two weeks to convince Larry to meet with a go-between. Larry finally agreed and gave us permission to pass along Larry's number. A meeting was set up and he arranged to acquire the film for Turner Classic Movies who he done a job for. He then put the pieces together to pick up the film, have a company restore it and Turner Classic paid to also add an original movie score. The wonderful thing is that the film content is complete, although it required a lot of work by the restoration company. Just prior to this time we had spoken with Larry several times and he informed us of his rapidly diminishing health so time was of the essence. The deal was made!\" The last time we spoke to Larry after the deal he said to us \"Thanks, enjoy the film. The next time you will see me I will be in a box!\" Larry Weeks died October 13, 2014, before the public would get news of the acquisition on January 23, 2015. Many years ago Larry Weeks had bought a plot in the same cemetery as close as possible to Houdini and is buried there. The restored film has a musical score composed by Brane Zivkovic an award winning film, television, and theatre composer. This was all done with financial help from Turner Classic Movies, who premiered it as the climax at the 2015 4 day TCM Classic Film Festival Sunday, March 29, 2015, in Hollywood to resounding praise and approval. It was the finale of the event.",
         "Originally made in 1919 and long thought lost, this recently-restored full-length movie features the legendary Harry Houdini, performing the sort of escapes for which he was celebrated in his own time and is still famous even today. For that reason alone, this film deserves 10- out-of-10. Since his death in 1924 many magicians and escape artists have striven to replicate the incredible things Houdini did, and many of his feats have still not been done. Those expecting subtle characterization or modern production values need to look elsewhere. However, for those with an appreciation of something absolutely unique, something that simply cannot be duplicated today, this film is truly priceless.",
         "I was skeptical of this film and prepared not to like it, However, I was pleasantly surprised by the TCM 'television premier' last Sunday of a nicely completed full-length restoration. I find most films from the 1916-1920 era to be horribly dated with that era's overdone style of acting. There are notable exceptions like Pickford, Chaplin, and Fairbanks, of course, but these older silents are sometimes hard to watch and even absurdly clumsy. The Grim Game has some of that chewed-scenery aspect, but overall it is well done. The story is a bit far fetched, but nonetheless entertaining. And many of our later favorites - Tully Marshall, Mae Busch, and Arthur Hoyt - appear. As for Houdini, he performs as expected in several escape scenes which naturally is what one expects. I had never seen him before and considering that his name is still legendary after 100 years, the film is worth a look if only for that. The Grim Game also has some really interesting 'snapshots' of the era including an incredible (in the sense of 'not believable') aeroplane (sic) chase. All of that having been said, kudos to preservationists and restorers for their tedious and painstaking work on films like these. It is greatly appreciated by me and legions of movie buffs.",
         "FGM has fun reviewing lost films, which is apt to be confusing to some. A five minute excerpt from this film is all that survives, in the George Eastman collection, which is included as an extra on the disc with Haldane of the Secret Service in the recent Kino DVD collection of his films. There are explanatory titles on it that suggest the clip would be exhibited by itself without the rest of the film. Houdini goes up in an airplane and does a mid-air transfer to the other airplane, after which the two crash. Houdini and the female passenger survive. The closeups of Houdini on the airplane appear to have been done on the ground, and the crash landing must have been staged somehow, or else how would they have happened to have had the camera in the right place? Likewise, one can't imagine they would have put their star and leading lady in danger. It's a nice little clip and certainly more exciting than any single moment from the tedious Haldane film.",
         "The fact is that the \"The Grim Game\" was considered lost. Actually the only existing copy of the 71-minute feature was lovingly preserved by a private party (Larry Weeks) in Pennsylvania. In 2014, after financing by Turner Classic Movies (TCM), it was restored with a new music score; it was first televised in 2015. The first title card reads, \"Remote and isolated, behind high walls and barred gates, the Cameron home repels intrusion.\" There is even an armed guard at the main entrance. Nevertheless, Harvey Hanford (Harry Houdini) is able to enter through the side gate. He, a reporter for the Daily Call, is in love with Mary Wentworth (Ann Forrest). He has come to see her. But the wealthy recluse Dudley Cameron (Thomas Jefferson) is at odds with nephew Harvey. Now Cameron is cared for by his ward and heiress, Mary Wentworth (Ann Forrest) and two servants. Harry eagerly tells Mary that her first story will appear in Sunday's newspaper. It has been stipulated in Dudley Cameron's will that Mary will be unable to marry while he lives. Cameron has planned for Mary to marry Doc Tyson (Arthur Hoyt) after his death. Doc Tyson is a shifty type. Cameron has previously lent the owner of the Daily Call, David Allison (Augustus Phillips) cash to keep the paper afloat, but refuses to give any more. Phillips is desperate. Meanwhile lawyer Nick Raven (Tully Marshall) is in deep cow-plop. For Cameron has caught him forging his signature. Cameron will not turn in Raven as long as he does Cameron's will. So now we have met the three schemers: Tyson, Allison, and Raven. But they work independently of each other. Knowing that the Daily Call is failing, Harvey presents his plan to the three men. It is intricate and involves a false kidnapping, the temporary disappearance of Cameron. Harvey has also purposely planted evidence to incriminate himself. Of course, the main bad guy turns it into murder; Cameron's body is discovered in a well on his property. Harvey Hanford is accused and eventually imprisoned – but as he is really Houdini after all – he engineers a series of fantastic escapes, beginning with his breakout from prison shackles. He even slips away after he is tied up in a strait-jacket upside down alongside a multi-story building. There are several coincidences typical of many silent films, but Houdini hangs in there and shows his abilities and his stamina. Finally there is the aerial stunt: a biplane with the hero actually flying chasing another airplane with the bad guy (and Mary). It concludes with a real crash. Although the script offers little suspense until the last reel, this film is quite good, and it was nice to see the great escape artist/stage magician in action. Houdini was even a skilled aviator. He was born in Budapest, Hungary when it was part of the old Austro-Hungarian Empire. He immigrated to the USA in the nineteenth century and was raised in Appleton, Wisconsin. His attractive co- star, Ann Forrest, born in Denmark, was quite camera-friendly on screen. She makes a desirable lady-in-distress. The feature itself is a curio that should offer bona fide entertainment for movie buffs. It is said that perhaps 80% of all silent films are lost, so it is nice to have this one back from the grave.",
         "Do you really need a recommendation to watch this restored film from 1919? Come on - the real Harry Houdini is in it! A couple of other reviewers here go into the film's discovery and restoration with the cooperation of the Turner Classic Movie channel so there's no need to go into that. What's rather extraordinary is the fact that there's actually a real story here, a murder mystery that evolves from a rather shady plan orchestrated by newspaper reporter Harvey Hanford (Houdini himself!) in order to save the financially struggling Daily Call. It involved faking the owner's death, with Hanford setting himself up to be incriminated for murder, and then after a time, the owner Dudley Cameron (Thomas Jefferson) would simply show up none the worse for wear. In the mean time, the newspaper capitalizes on the publicity, saving itself via a news hungry public buying it's coverage of the story. This picture is considered the first and best of five movies Harry Houdini participated in. I haven't seen the others so there's no way to judge for my part. What I can say with this one viewing is that Houdini himself presents a very versatile, athletic and highly physical dimension to the role portraying his character Hanford. The movie itself is a forum for capturing some of his most famous escape routines on film, including a prison break where he extracts himself from a series of chains, along with a daring upside down escape from a straight jacket hanging a few stories in the air. I was also impressed by a maneuver that stunt man Yakima Canutt eventually made as one of his trademarks. Following the prison escape, Houdini scrambles underneath a moving vehicle and hangs on to the undercarriage to make a clean getaway. Quite impressive. As for the main story, a trio of individuals that are part of Dudley Cameron's circle agree to participate in Hanford's ruse, but then operate independently, each for their own benefit. With Hanford on the run from the now very real murder of Cameron, it will take all of his cunning to flush out the real killer and save his fiancée Mary (Ann Forrest), ward and heiress to the Cameron fortune. The picture ends with a thrilling airplane chase leading to a mid-air collision and plane crash, though the two planes involved in the original stunt actually landed safely. The quality of the restoration is laudable and the movie itself looks to be reasonably complete. At about the one hour mark there are significant imperfections that apparently could not be improved upon at both outer margins, and the effect appears almost psychedelic, like something you might have seen musical groups of the Sixties use during appearances on variety shows of that era. At least that's the way it struck this viewer. Otherwise, the quality of the picture is rather exceptional, no mean feat for a film approaching the century mark.",
         "The Grim Game (1919) ** 1/2 (out of 4) Reporter Harvey Hanford (Harry Houdini), wanting to save his newspaper as well as show how corrupt \"circumstancial evidence\" can be, stages a murder where the victim is actually alive but what little evidence there is shows that he's dead and that the reporter committed the crime. The plan is for the \"dead\" man to come back after the reporter is in jail and show how you can't always go by evidence. The problem is that once the reporter is in jail the man really is murdered so the reporter must break out of prison and search for the real killer. This same story would be redone decades later by Fritz Lang in BEYOND A REASONABLE DOUBT so it's interesting to see it done here first. For the most part this is an entertaining movie, although it certainly falls a bit short of actually being a good one. With that said, if you're a fan of the legendary magician then you'll certainly want to check this out since he does perform some nice tricks plus there's just not enough footage of him around so getting to see him in the few movies he made is nice. With that said, obviously the main reason to watch this are for the Houdini tricks, which includes him escaping several times throughout. The famous straight-jacket routine is performed here as well as other chains that the magician is strapped into. There are some nice action/stunts throughout including one where the magician (or his double) are hanging on a flag pole. The highlight of the film comes at the end when there are two planes flying and Houdini (or his double) are on a rope going from one plane to the other. I won't ruin what happens but the scene is terrific. The story itself is interesting but very little is done with it because people weren't really coming to this film for a story. People wanted to see Houdini in action so obviously that's what the producers gave them.",
         "The movie didn't seem to have a lot going for it. A non-actor in the lead role. The fact that it was from 1919. I wanted to watch a few minutes for historical purposes, then turn to another show. However... The movie wasn't bad. Admittedly, people were uglier back in 1919, almost deformed. Houdini would've never worked in film twenty years later. But, the man was a celebrity then. The plot is kind of silly, but one that has been used since: A fake kidnapping turns into a real murder. Houdini's character happily leaves evidence implicating himself thinking it was harmless; then, the \"victim\" is found dead. Suddenly, he's on the run! The escapes in the movie don't seem like special effects. In one handcuff escape, the man dislocates his thumbs to slide off the bracelets. Somehow, he ends up in a straight-jacket, hanging upside down from a rope, coincidentally just like a stunt he performed in New York. The big scene with the biplanes is pretty thrilling because these were real planes and real stuntmen. One plane actually crashed during the making of this film In short, it was compelling enough to sit through the entire movie when I never intended to.",
         "With financing from TCM, the only known print of Houdini's first film was restored to near-perfect condition (except for some deterioration damage toward the end) and found its television premiere on TCM on Sunday, October 18, 2015. A recap of the finding and restoring of the film can be found in ellebrennan's review here of October 20. Although Brennan's recap (excerpted from Houdini.org) credits renowned composer Brane \u008eivković with having created a new score for the restoration, what neither hers nor any other review here to date of the restored film mentions is that TCM showed the film twice that night, first with \u008eivković's score, then again later with a more traditional silent film score by Steve Sterner. Unfortunately, I missed what host Robert Osborne may or may not have said about the Sterner score, but in my estimation, although less innovative, it may in some way be preferable. \u008eivković's score is thematically more operatic in that characters have their own themes assigned to them. Since Houdini (and his character) is on the screen so much throughout the film, his theme eventually becomes monotonous. Variations of his theme would be highly appreciated. Sterner's score, being more traditional as silent film scores go, does not vary with the characters, per se, but if with anything, the action. Let the discussion begin.",
         "Harry Houdini reminds me of Jackie Chan. Both of them starred in action movies with implausible plotlines which were basically excuses to string together a series of stunts designed to showcase the star's particular talents: in Houdini's case, his incredible physical stamina and his ability to escape from all sorts of restraints. The plot of \"The Grim Game\" is basically a long string of stunts, but Houdini performs them with panache, and modern audiences will enjoy this film. The story is written primarily by Arthur B. Reeve, creator of the scientific detective Craig Kennedy (who was parodied by Douglas Fairbanks as \"Coke Ennyday\"). Harry Houdini stars as Harvey Hanford (same initials) who is engaged to marry Mary Cameron (Ann Forest). When Mary's guardian is murdered, Houdini is framed for the crime and sent to prison. He escapes (of course!) and then goes after the villains, but they keep chaining him up or imprisoning them, and of course Houdini keeps right on escaping. At one point they leave him hanging upside-down in a straitjacket off the roof of a skyscraper. No problem, and Houdini is home free before the villains can take the elevator back to street level. At the film's climax, the boss villain abducts Mary (of course) and flies away with her in a rickety biplane, which was a state-of-the-art aircraft when this film was made in 1919. Houdini jumps into another aeroplane and takes off in pursuit. The two 'planes crash in midair (nice photography here), but Houdini and his girlfriend get back to the ground in one piece... or rather, in one piece apiece. The entire film is thrilling but largely implausible. Houdini's feats are genuine, but the stunts are clearly designed to play to Houdini's strengths rather than realistic situations. The airborne climax takes advantage of the fact that, in real life, Houdini was a skilled aviator. (He was the first person ever to fly an aircraft in Australia.) \"The Grim Game\" is enjoyable, and parts of it are fast-moving, but don't look for a logical storyline. (The villains have no qualms about committing murder, so why don't they just kill Houdini instead of always chaining him up?) In the best sense of the term, this movie is escapist entertainment.",
         "I recently saw this as a DVD extra included with the film HALDANE OF THE SECRET SERVICE. Both films star Harry Houdini but THE GRIM GAME is only a film fragment today--the rest of it no longer exists. While I have enjoyed the reviews of both reviewers who have already reviewed this film, I really must agree with CryFi's review--and it reflects that most of the original film is gone AND gives nice information about the film. As for me, I can't see giving the fragment anything more than a 3. Although the clip is pretty good, there really isn't a coherent story and it is really just an excuse by Houdini and the film makers to use some accidental footage involving an air tragedy. It is funny to realize that Houdini took credit for the mid-air stunts he didn't even perform. This film is essentially a curio for history teachers, magic lovers and film historians. It is NOT a film that is coherent or worth seeking out because it only is a piece of a longer film."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["Jailed unjustly for a murder he did not commit, a young man uses his amazing powers of escape to free himself and pursue the actual killers, who hold his fiancée captive."],
      "budget": 200000
   },
   "movielensId": 144027,
   "movielens": {
      "languages": [""],
      "releaseDate": "1919-10-11",
      "dvdReleaseDate": null,
      "directors": ["Irvin Willat"],
      "runtime": 71,
      "movieId": 144027,
      "title": "The Grim Game",
      "mpaa": "",
      "actors": [
         "Harry Houdini",
         "Thomas Jefferson",
         "Ann Forrest",
         "Augustus Phillips",
         "Tully Marshall",
         "Arthur Hoyt",
         "Mae Busch",
         "Edward Martin",
         "Jane Wolfe",
         "George Cowl"
      ],
      "imdbMovieId": "0010195",
      "originalTitle": "The Grim Game",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jailed unjustly for a murder he did not commit, a young man uses his amazing powers of escape to free himself and pursue the actual killers, who hold his fiancée captive.",
      "tmdbMovieId": 175005,
      "avgRating": 3.5,
      "releaseYear": "1919",
      "numRatings": 2,
      "posterPath": "/4Sx9XP4Mb2vZnsPpjfEpcXcdoR7.jpg"
   }
}