{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0081053",
      "video": false,
      "title": "The Life and Times of Rosie the Riveter",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49d29251416c750d4653",
            "name": "Connie Field",
            "profile_path": "/e638HzoWS1TVAIbTdBbDE817ZGP.jpg",
            "id": 1012161,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.049412,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 97108,
      "vote_count": 1,
      "budget": 0,
      "overview": "Documentary about women's experiences of labour, in factories, mines and dockyards, in the USA during the second World War and how it affected their work and career aspirations once they were encouraged to give up such employment in peacetime.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         152532,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         12162,
         227306,
         424488,
         97630
      ],
      "original_title": "The Life and Times of Rosie the Riveter",
      "runtime": 65,
      "poster_path": "/p4RGnvkQUpPG6PHjJAaa7zfbUhg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1980-09-27",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Connie Field"],
      "runtime": 65,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081053/",
      "coverLink": null,
      "actors": [
         "Wanita Allen",
         "Gladys Belcher",
         "Lyn Childs"
      ],
      "reviews": [
         "This is by far, the best documentary on the American home front during the Second World War. It's also an excellent and extremely entertaining look at the spark that ignited the women's liberation movement nearly thirty years before it 'officially' planted its roots. With thousands of men leaving the factories to fight in the war, and with the urgent, escalating need for America to arm itself, women were strongly encouraged to join the factory workforce. They came from all over the country and discovered skills they never knew they had, both as laborers, and as independent women. They were self-sufficient and strong (many of them endured double-shifts on a fairly regular basis), and they eventually discovered new freedoms by earning their own incomes and making their own choices on how to spend that money. Connie Field has created an extremely entertaining documentary that's choked full of interviews with women from all walks of life. She intersperses lots of the newsreel footage and the popular songs that had been created in order to encourage and inspire the female workforce. And she illustrates the myriad of ways in which women were discouraged from working after the war had ended, and how strong a role the media played in encouraging women to raise families and stay in the kitchen. This film is rare glimpse of the Second World War from the female perspective, and a vital document of American history.",
         "You should find this interesting if you have an interest in learning about the social issues that were going on in the U.S. during WWII. You won't read about the subject of this film in any history book. Both from a feminist and a racial perspective. Admittedly, I wasn't born yet. So I wasn't a witness. But I had just always assumed that during WWII all of the prejudices had been put aside for the country to pull together. At least that's what certain aspects of historical propaganda had led me to believe. But this film set me straight. My mother and father were both a part of that generation. They're both gone now. The people of the country (and the world) endured a lot. From the Great Depression through the end of the war and much in between. Watching this showed me why my mother and my grandmother were so strong.",
         "Being a history/WWII buff I was highly disappointed with this \"documentary.\" Of the thousands upon thousands of Rosies they supposedly interviewed, they picked these 5 lunatics to make this movie.. Watch it if you want, but just take a gander at who made this film and you won't be surprised. Directed by one Ms. Connie Field. A die hard liberal from the 60's and is still producing garbage like this today. It sickens me that people like her and Michael Moore are praised and admired for their \"work.\" Here's the recap in case you don't want to sit through an hour + of nonsense. American white men are evil, racist, sexist pigs. The end. P.S. Since this still isn't long enough for IMDb I'd like to add that I do appreciate the work the homefront did, including the women in this film, who helped in any way possible to support our troops and win the war."
      ],
      "genres": [
         "Documentary",
         "History",
         "War"
      ],
      "productionCompanies": [],
      "summaries": ["Documentary about women working in factories during WWII and resultant loss of jobs after the war. Five women tell their stories. Fascinating clips of racist, sexist propaganda of the era."],
      "budget": 0
   },
   "movielensId": 144031,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-09-27",
      "dvdReleaseDate": null,
      "directors": ["Connie Field"],
      "runtime": 65,
      "movieId": 144031,
      "title": "The Life and Times of Rosie the Riveter",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0081053",
      "originalTitle": "The Life and Times of Rosie the Riveter",
      "genres": [
         "Documentary",
         "History",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about women's experiences of labour, in factories, mines and dockyards, in the USA during the second World War and how it affected their work and career aspirations once they were encouraged to give up such employment in peacetime.",
      "tmdbMovieId": 97108,
      "avgRating": 3.75,
      "releaseYear": "1980",
      "numRatings": 2,
      "posterPath": "/p4RGnvkQUpPG6PHjJAaa7zfbUhg.jpg"
   }
}