{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2297906",
      "video": false,
      "title": "Teenage Bank Heist",
      "recommendations": [],
      "backdrop_path": "/hiG50WOmwDH88Sty1PoaFgkEikw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joyce",
               "gender": 1,
               "credit_id": "52fe4d17c3a36847f824e2af",
               "name": "Maeve Quinlan",
               "profile_path": "/dm0W1L6dNPO3uPjkKPxinaZLgUq.jpg",
               "id": 21859,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cassie",
               "gender": 1,
               "credit_id": "52fe4d17c3a36847f824e2b3",
               "name": "Abbie Cobb",
               "profile_path": "/3ylPJlRq0111wPqACZvebAe39J2.jpg",
               "id": 968429,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Abbie",
               "gender": 1,
               "credit_id": "52fe4d17c3a36847f824e2d3",
               "name": "Cassi Thomson",
               "profile_path": "/6wPPxPSA1hpfXY4M1SDcNF8YXcd.jpg",
               "id": 205176,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Marie",
               "gender": 0,
               "credit_id": "52fe4d17c3a36847f824e2b7",
               "name": "Augie Duke",
               "profile_path": "/apvDx7L2xBClg6wWFSFRuzbgoc3.jpg",
               "id": 1014696,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d17c3a36847f824e2bd",
               "name": "Doug Campbell",
               "profile_path": "/s73PJwdj7H7uAODB3hMfG0r9Vy4.jpg",
               "id": 92227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d17c3a36847f824e2c3",
               "name": "Doug Campbell",
               "profile_path": "/s73PJwdj7H7uAODB3hMfG0r9Vy4.jpg",
               "id": 92227,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d17c3a36847f824e2c9",
               "name": "Nathan Perkins",
               "profile_path": null,
               "id": 1154514,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "577eae7092514123bb00218a",
               "name": "Ken Sanders",
               "profile_path": "/tt3ALUD5RZbApmRxAQc5svgvthQ.jpg",
               "id": 1591268,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.351035,
      "production_countries": [],
      "id": 171952,
      "vote_count": 4,
      "budget": 0,
      "overview": "Cassie works as a teller at the bank where her mother is the branch manager. When the bank is robbed, Cassie is taken hostage. She soon finds out that the bank robbers are teenage girls, one of whom is her best friend, Abbie. In this propulsive real time, ticking clock thriller, as the girls are on the run from the police, we learn that the real motivation behind the robbery is something unexpected.",
      "similar": [],
      "original_title": "Teenage Bank Heist",
      "runtime": 90,
      "poster_path": "/rbWb1XYpZSCPvOIqLe1tkzRZgce.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-11-09",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Doug Campbell"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Doug Campbell",
         "Nathan Perkins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2297906/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjIwODQwNTg2OV5BMl5BanBnXkFtZTgwMzQ3OTkxMDI@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Maeve Quinlan",
         "Abbie Cobb",
         "Cassi Thomson"
      ],
      "reviews": [
         "Thank you. Yes thank you actors, director Doug Campbell, and everyone else who was involved in creating this solid piece of film-making. This is a film you may typically skip over when looking for the big blockbusters, but don't. I actually almost did the aforementioned, but do to my interest in \"heist\" films, committed the title to memory from Red Box where I saw it, then scanned the web for further info on it. I'm pretty sure this was a direct to home video film from MCI but it plays as good as any high end Hollywood film. This is a \"TV movie\" because of the affiliation with the Lifetime network but you would never know that to be the case after seeing it in my opinion. Also it is shot in widescreen and doesn't have a clunky TV aura to it. I can tell you that the film is not so much about plotting and planning a bank robbery, but more about the dynamics that reveal themselves in between. The acting is top notch for this kind of budget restricted film, and I can be one tough critic. These are some \"giving it all you've got\" portrayals that deserve recognition. I was on the seat of my pants waiting for the next twist or latent clue to come that eventually did and never failed to satisfy. \"Teenage Bank Heist\" has some real actors in it that spout their lines with an incredibly realistic delivery. Almost nothing screamed \"fake\" to me and the little that did was based in pure sentimentality that works for films anyway. The camera shots were absolutely superb with limited but highly plausible action sequences. I would love to have seen extras on the DVD with interviews or behind the scenes footage but I don't even know if the film-makers knew how good a film they made. Plus, this was probably a package deal that had limitations with its distributing. This goes beyond just renting, its a keeper. I hope it catches on. The players: Maeve Quinlan: Joyce (Cassie's mom played with authentic determination) Abbie Cobb: Cassie (carries the film with bewilderment and empathy) Cassie Thompson: Abbie (knows how a gutsy thinking girl acts) Augie Duke: Maria (rage, spot on, period) Davida Williams: Grace (a quiet loss projected) James Ferris: Nick (has the unstable bad a$* role cornered) Rosa Blasi: Agent Mendoza (this is the FBI- a talented to the core portrayal with sugar on top) The \"secondary\" cast members more than held their own as well. And yes I know the two female leads Cassie and Abbie must have switched their real names with each other for their characters names- cool.",
         "Good acting, bad script. The acting is particularly good considering the terrible script. It must be hard to read stupid lines. It really takes some skill to keep a straight face as they do. The FBI defends the guard who shot at a moving vehicle with a hostage. Is this a stupid attempt at gun control politics? I can almost hear the producers, \"crap script - but young girls robbing a bank may get enough viewers to turn a profit.\" Did the director read the script first? He must be desperate for work! There's not much more to say about this movie.",
         "Well after seeing a lot of 10-star movies lately because of Oscar season, it felt weird seeing one of these movies. but of course this isn't meant to be some mind-blowing thing. Saw it at a party with some friends, didn't think I was going to like it. But it starts off pretty good and teenage girls robbing banks -- hey there's a lot worse, less interesting stuff out there. Acting wasn't too bad. lots of cheesy lines, but I guess you can say a couple of the actresses made lemonade out of lemons. I think overall, if you're young and looking for a little popcorn flick, this is a good choice. its not boring, has an interesting plot, and the girls are pretty of course.",
         "I missed the second 1/2 of this to visit a friend in the hospital, but since its a lifetime movie, got to catch it on the second play. Now I'm wishing I wouldn't have bothered! It started out well, but SO MANY plot holes! Someone else mentioned this already, but left out the biggest one...OK she robbed a bank and they're pinning it on someone else...but there's TWO DEAD PEOPLE SHE SHOT JUST LAYING THERE IN HER HOUSE!!!! And the movie just ENDS, no mention of this, just \"ok get out of here, I'll take care of this\". They had this woman arguing about leaving her daughter (I still don't know why) but it's perfectly fine the other girl murdered 2 people. That just spoiled the whole thing for me, and made me want the 2 hours I spent watching this back.",
         "Plot holes? Of course there are plot holes galore. You could drive TWO of those cash-carrying security armored trucks side by side through the unexplained gaps in this little flick's story- line. But I didn't buy it to experience the thrills of some superlatively- filmed teen bank robbery. No, I collect movies starring pretty girls, and I went from a 90210 guest star (Caitlin Thompson) to WALKING THE HALLS, and that DVD had this one's trailer, and I took one look, Just One Look, at this pretty squirrel fox who plays the female lead, and I thought \"good golly jeepers that kid looks just like Jennie Garth!\" which brought the circle back to BEVERLY HILLS 90210. Now, those were the heady days, I was so mesmerized by that one back then, And This, This Is Like Having Jennie Garth Re- Born! So, I am just sitting here, staring wistfully at this pretty actress, this wonderful beautiful young girl, and am I gonna complain about plot holes? Nope. Aw. The script takes on too much. Actually, I should say the story-line takes on too much. The creators thought about having pretty girls be the robbers, but they all (except one scapegoat) had to be innocent... and for a basically small project with limitations this causes immense stretching of belief. Cassi and her kidnapped by terrorists Dad. Too much. Way too much. I mean, my brain is turned to much by the beauty on-screen, but shucks, there are so many complications. Like, this junior bank official can sit there with freaking hot evidence and download a print-out unseen unquestioned? That kind of evidence, the FBI (or whoever) would have taken hold of immediately, as considerable cash is involved. Also, she rushes off, and later on, the police ask, where is she? D- uh, I mean, like, I am mesmerized by the blonde kid, but this TV movie really falters about within a few minutes. Notice the bloodless fatal gunshots. And Abbie is screwed big-time, as, like another reviewer has already pointed out, back home lies two (unexplained) dead bodies. So that little arrangement with Agent Mendoza is pointless. Like the movie. But complain? Man! Me? Gawd, if Abbie Cobb presented the bleeding weather forecast on telly, I'd damn well tune in.",
         "Cassie (Abbie Cobb) is a reluctant bank teller for her mother Joyce (Maeve Quinlan). Then 3 robbers come in. Cassie recognizes one of them as her best friend Abbie (Cassi Thomson), and she's taken hostage. She crashes the armor truck and injures her other friend Grace (Davida Williams). She helps them take care of Grace and finds out the real reason for the robbery. The other girl Marie (Augie Duke) is older and is doing it for the money with her boyfriend Nick (James Ferris). Meanwhile police agent Mendoza (Rosa Blasi) suspects that Cassie is actually in on the robbery. It's an ambitious bank heist story, and a passable Lifetime movie. The girls are perfectly likable. The dialog is a little clunky at times. It starts off slowly, but it gets better. However the ambitious plot goes over the edge with a lack of overall style and competent action directions. A big screen movie would push the action to the next level, but this just doesn't have the next gear.",
         "Had time to kill and wasn't very interested in Game 1 of the World Series, not a fan of either team, anyway back to my review. I was surprised by the start of the movie and how it was moving quite long and getting me more and more interested on how it would end. Very disappointed on the ending. First off, Agent Mendoza probably got jailtime for helping not only a bank robber but a murderer and would have have been joined by the girls and probably the Mom as well. The ending should have been that Cassie was able to get the rest of the money from Nick and Marie, they ended up at the exchange and got into a shooting match with the Mexicans and ended up killing each other. It could have then been a deal gone wrong with Nick and the Mexicans. Then have the Mom put the bracelet on Marie's wrist. Cassie could have stated that Nick and Marie \"kidnapped\" her father and as a way to force her to her a way to rob the bank.",
         "This movie had just too many plot holes. There are, in fact, three armored security guards per truck. Not two. - The money held in banks is marked, so while the girl could've used it to barter for her father, she wouldn't have been able to use it herself unless she had a money laundering business. Bagging and keeping anything above her required 500,000 would have been pointless. She seemed smart enough to have known this, given her heisting abilities. - The mother could have easily been arrested for actions. - The final fight where the FBI agent gives the gun to the dead Mexican... A) his prints would not have been on it. His fingers were barely touching. B) did she wipe that gun before handing it over? C) the gun was shot at the man in question, therefore cops would have noticed that the gun was used agaisnt him, and not that he used it agaisnt the FBI agent. D) The Mexican had a fully loaded AK47 at his feet... With his fingerprints all over it. Why would he be seen dead holding that crappy pistol? Just wrong. Wrong!"
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Johnson Production Group",
         "Shadowland"
      ],
      "summaries": ["When a teenager is kidnapped during a daring bank robbery, her mother vows to find her."],
      "budget": 0
   },
   "movielensId": 144170,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-11-09",
      "dvdReleaseDate": null,
      "directors": ["Doug Campbell"],
      "runtime": 90,
      "movieId": 144170,
      "title": "Teenage Bank Heist",
      "mpaa": "",
      "actors": [
         "Maeve Quinlan",
         "Abbie Cobb",
         "Cassi Thomson",
         "Augie Duke"
      ],
      "imdbMovieId": "2297906",
      "originalTitle": "Teenage Bank Heist",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "Cassie works as a teller at the bank where her mother is the branch manager. When the bank is robbed, Cassie is taken hostage. She soon finds out that the bank robbers are teenage girls, one of whom is her best friend, Abbie. In this propulsive real time, ticking clock thriller, as the girls are on the run from the police, we learn that the real motivation behind the robbery is something unexpected.",
      "tmdbMovieId": 171952,
      "avgRating": 2.3,
      "releaseYear": "2012",
      "numRatings": 5,
      "posterPath": "/rbWb1XYpZSCPvOIqLe1tkzRZgce.jpg"
   }
}