{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1826550",
      "video": false,
      "title": "Mad As Hell",
      "recommendations": [],
      "backdrop_path": "/waaHZcYQnxIsxk4aI3Ey5STWZaO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "535e4dbb0e0a264fde00644c",
            "name": "Cenk Uygur",
            "profile_path": "/rnWNVaJjUY6yAXWCxCsL2AvjIVL.jpg",
            "id": 1314544,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "535e4d990e0a264fde006447",
               "name": "Andrew Napier",
               "profile_path": "/ayBgEciG3vN4bLSmJft10GgHh7u.jpg",
               "id": 1314543,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "586ab13092514121380020b4",
               "name": "Daniel Katz",
               "profile_path": null,
               "id": 1731561,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.05113,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 267178,
      "vote_count": 1,
      "budget": 0,
      "overview": "MAD AS HELL follows Cenk Uygur's transformation from unknown talk show host on local Public Access TV to an internet sensation with his online news show \"The Young Turks,\" which has amassed over one billion views on YouTube. Once Cenk ventures from the internet into national television and lands the 6 PM time slot on MSNBC, his uncensored brand of journalism is compromised and Cenk becomes the nexus in the battle between new and old media.",
      "similar": [],
      "original_title": "Mad As Hell",
      "runtime": 80,
      "poster_path": "/yd8i3pLhEyoBghUCkxQZLrlR7XK.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-04-29",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Napier"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1826550/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjI2OTY4MjkzMF5BMl5BanBnXkFtZTgwNzcxNDcxMzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Cenk Uygur",
         "George W. Bush",
         "Connie Chung"
      ],
      "reviews": [
         "This is a great documentary if you've been somewhat skeptical about how regular news networks has handled different subjects and scandals over the last decade. This documentary shows the journey that Cenk Uygur has been through to seek the truth from politicians and other news networks. It shows all the successes of his work and the opposition he has had to go up against just because he never fears telling the truth. Instead he fears lying or going too soft on people and subjects. Which can be problematic in the news culture we have today, when the news organizations are competing for viewers and want to get guests back to their channel to be favored over other news networks by driving viewers interested in the guests (that they've soft-balled) to their channel. Or when they want to fill their time space with pop culture (whether it is internet sensations or celebrities) to get more of the young audience to their channel, even though it is in no way newsworthy. Let's not forget how facts are distorted or completely fabricated to fit with the agenda of their political party. Here is where Cenk and his news organization \"The Young Turks\" comes in. They are the antithesis of the current news culture. They're never afraid to be hard on people with power or fame. They always tell us the truth and when they get facts wrong, they quickly correct themselves in the next show so that they don't lose any credibility. They aren't afraid to have controversial opinions and they won't make excuses for their political party unless it's warranted. Cenk and his show grew to such fame that MSNBC hired him. Of course this was short lived since he didn't want to lie or take it easy on guests. Cenk has since returned to The Young Turks as the boss man and they are more popular than ever. They have gotten to the point now that they are getting more viewers than many regular television news channels. Lately, Cenk has started Wolf Pac. Their goal is to try (and succeed) with getting big money out of politics so that the \"One Percent\" has less control over the political system. And they have already succeeded in some states! All in all, this is the incredible journey of an incredible man and the work he has done with his incredible co-workers to affect the corrupt political system and news culture in the U.S.A. A lot of work and fights that has gotten them (and us) results and they'll continue to produce results as long as they continue this fight and as long as people are ready to listen to the truth. Thank you Cenk, The Young Turks and the Wolf Pac for helping U.S.A.",
         "If you want to see what the future of news media is, watch this movie. What brings people to watch a program like The Young Turks it is because they sense that they are being lied to and that the current media is doing them a disservice. A lot of people may not agree with Cenk, but you have to admire how genuine he is. There is no deceit or hidden agenda. He tells you what he wants up front, and he tells you how the establishment is screwing you over. This movie does a great job of examining the strange career of this man and the windy road he took. Liberal or conservative, take the time to watch this movie. It is so worth it.",
         "I am only giving 9 instead of 10 because I feel I may be biased. As a fan of The Young Turks, there was no way I was not going to see this, but what surprised me was the storytelling. I'm big on storytelling, and Andrew Napier has weaved a specific tale with a moving narrative and more than enough scope to make it something you want to sink your teeth into. If you've never heard about TYT or Cenk Uyger (pronounced JENK EUGER), then this is a good introduction. Cenk had a desire to share his ideas and opinions, and he worked against steep odds to make it happen. He started in public access television as a conservative, opinionated personality, very green and rough but very real. Now The Young Turks, the network's flagship daily 2-hour news and politics show, is the largest online news show in the world, and Cenk is the voice of the progressive movement. If you like your news delivered in a teleprompter-free, off-the-cuff, 100% real way, then you should check them out on YouTube. The film takes you through the highs and lows of Cenk's career and the rest of the TYT crew, but more importantly it gives you an insight into the psyche of the man himself. Summed up, \"Mad As Hell\" is the story of the American dream.",
         "This Movie Is So Amazing! Although I did think it was missing a few things. I wanted to hear more about Wolf-Pac & the progress that has been made. I also wanted to hear about Cenk & Keith Olbermann's falling out (so to speak). Also some of the older videos like Cenk doing the car tire commercial wasn't present. I have a few more quandaries with the movie, but I guess I wanted this movie to capture in it's 1 hour & 22 minutes the same magic that I loved everyday for years watching The Young Turks, so that even my friends would get a taste of what the worlds largest online news show is all about. So in those regards it fell a bit short. I suppose my hype for this movie was far to high, & it couldn't have had all the content in it that I wanted without being several hours long. So all in all I would say the movie is still pure amazing, & despite it's minor flaws I would still categorize it as my favorite documentary.﻿",
         "I've been watching The Young Turks for a couple of years now, and I what I admire the most is their honesty when it comes to speaking truth to power. Progressive politics is something I am entirely behind and TYT provides that in spades. What I wasn't aware of, partially given my newness to this YouTube phenomenon, is how it all started. I believe that is the most valuable part of this documentary. It shows what a fired-up young man with ambitious vision can achieve their goals through tenacity and sticking to first principles. I also wasn't aware that Cenk started as a Republican. Just saying that sounds really odd, but people can (and should) change their political stance when presented with new information. That is the other most valuable thing to take away from this film: that change can be a positive thing. It's this same idea that fuels their efforts with Wolf-Pac. Money has corrupted our political system and I think it's very courageous of TYT to start and promote such a worthy cause. For those thinking that this is just some plug for their show or a fluff piece to promote Cenk Uygur, I will say that you are wrong. Among the many interviewees, few are sparing in their assessment of him as a person. They aren't necessarily mean, but they don't back down when it comes to his overall personality. And of course, it helps to be loud and abrasive when your message is one of outrage at the status quo. Bottom line, whether you're liberal or conservative, you should give this a watch and hopefully be inspired in the process.",
         "I had gotten a freebie to see a screening of this last Spring from a Turkish American pal. I wonder if the film makers realize how ironic it is to do a non critical puff piece of a show and guy they are trying to portray as a hard hitting journalist? Look, the phenomena of Young Turks was interesting. A old story Howard Beale (the raving lunatic from \"Network\") imitator; combined with an old story yellow/sensationalist journalism; combined with a new story internet dissemination is an interesting combination of the old and the new. I get why it was popular, middle-low brow, few facts, lots of indignation and bombast. On style and substance Cenk Uygur is kinda like what you'd expect if Bill O'Reiley and Keith Olbermann had a fat baby. That is in fact entertaining -- for a while. The film lap dogs this guy's arc, but doesn't address why it burned out, not address place his phenomena occupies in partisanship (and he went from one kind of partisan to another with the wind) taking over the news business and the dumbing down that represents.",
         "Pretty solid documentary. I'd give it a 10 if not for two things that are missing and i consider important: First, Jimmy Dore's take was much needed. Even though he wasn't there from the beginning i'm pretty sure he'd have interesting things to say. Last, they should have addressed that episode when Ana Kasparian answered fans' complaints about the show giving more air time to celebrities stories than to serious issues.Some gems on that speech. It's been a while i've not been following Young Turks but i felt reconnected with the show after this doc. Even if you've never heard of Young Turks you'll be moved by the courageous struggle of Cenk and his team of idealistic employees trying to make anti-establishment journalism in a media driven only by big money."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Comedy",
         "Drama",
         "History"
      ],
      "productionCompanies": ["Wrecking Crew"],
      "summaries": [
         "The Young Turks, one of the most popular online news shows in the world, has amassed a YouTube network consisting of millions of subscribers and billions of views. But that wasn't always the case. MAD AS HELL documents the tumultuous, at times hilarious and altogether astonishing trajectory of Cenk Uygur, The Young Turks' main host and founder, as he traverses from unknown Public Access TV host to internet sensation by way of YouTube. When he ventures into national television by landing the 6 PM time slot on MSNBC, Cenk's uncensored brand of journalism is compromised as he becomes a thorn in the side of traditional news media; his unwavering dedication to speaking the truth puts him at the very nexus of the battle between new and old media, and makes MAD AS HELL not only entertaining, but incredibly timely as well.",
         "After graduating from law school, Cenk Uygur decided to create his own talk show on public access TV and became instantly hooked on political commentary. In an unlikely version of the American Dream, Mad as Hell follows Cenk's transition from those humble beginnings to his role as national host for MSNBC to the creation and success of his YouTube show The Young Turks-the most popular online news show in the world with over one billion views. With a mission to speak the truth, Cenk takes on traditional news media and becomes the thorn in their side with his controversial approach of never pulling any punches. Mad as Hell is a perfect example of the changing media landscape and our desire for different voices. We see how Cenk and his loyal team, with their uncensored brand of journalism, navigate the traditional world of news while at the forefront of a burgeoning new media."
      ],
      "budget": 0
   },
   "movielensId": 144180,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-04-29",
      "dvdReleaseDate": null,
      "directors": ["Andrew Napier"],
      "runtime": 80,
      "movieId": 144180,
      "title": "Mad As Hell",
      "mpaa": "",
      "actors": ["Cenk Uygur"],
      "imdbMovieId": "1826550",
      "originalTitle": "Mad As Hell",
      "genres": [""],
      "youtubeTrailerIds": ["29c_hA4Bu4s"],
      "plotSummary": "MAD AS HELL follows Cenk Uygur's transformation from unknown talk show host on local Public Access TV to an internet sensation with his online news show \"The Young Turks,\" which has amassed over one billion views on YouTube. Once Cenk ventures from the internet into national television and lands the 6 PM time slot on MSNBC, his uncensored brand of journalism is compromised and Cenk becomes the nexus in the battle between new and old media.",
      "tmdbMovieId": 267178,
      "avgRating": 3.66667,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/yd8i3pLhEyoBghUCkxQZLrlR7XK.jpg"
   }
}