{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mask",
            "id": 2546
         },
         {
            "name": "halloween",
            "id": 3335
         },
         {
            "name": "spider",
            "id": 3986
         },
         {
            "name": "costume",
            "id": 4328
         },
         {
            "name": "pumpkin",
            "id": 12198
         }
      ],
      "imdb_id": "tt3526462",
      "video": false,
      "title": "Honeyspider",
      "recommendations": [],
      "backdrop_path": "/duABxdH573NcusWIKRfdHMCNxfj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jackie Blue",
               "gender": 0,
               "credit_id": "540e19cfc3a36879ab005fe9",
               "name": "Mariah Brown",
               "profile_path": null,
               "id": 1362169,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Amber",
               "gender": 0,
               "credit_id": "540e1a24c3a36879ab005ff2",
               "name": "Samantha Mills",
               "profile_path": null,
               "id": 1362170,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Professor Lynch",
               "gender": 0,
               "credit_id": "540e1a5ac3a36879ae005ccc",
               "name": "Frank J. Aard",
               "profile_path": null,
               "id": 1362172,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Eddie",
               "gender": 0,
               "credit_id": "540e1ab0c3a368799c006116",
               "name": "Kenny Caperton",
               "profile_path": null,
               "id": 1362168,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Billy the Projectionist",
               "gender": 0,
               "credit_id": "540e1ad5c3a36879b2005a6d",
               "name": "Ethan Dunn",
               "profile_path": null,
               "id": 1362174,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "540e1990c3a36835d60004c2",
               "name": "Josh Hasty",
               "profile_path": null,
               "id": 1362167,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "540e19a8c3a36879a5005ce8",
               "name": "Kenny Caperton",
               "profile_path": null,
               "id": 1362168,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.310966,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 291336,
      "vote_count": 0,
      "budget": 0,
      "overview": "It's Halloween day in 1989 and college student Jackie Blue wants to enjoy a quiet birthday in the midst of a chaotic semester at school. Her friend Amber has other ideas and persuades Jackie to come to the annual Halloween party on campus after her shift at the local movie theater. As the night unfolds, it becomes apparent that Jackie will get more excitement than she bargained for on her birthday this year.",
      "similar": [
         11281,
         9479,
         948,
         11675,
         4232,
         956,
         5876,
         8810,
         1979,
         9313,
         557,
         671,
         9738,
         788,
         522,
         601,
         559,
         406997,
         8839,
         241848
      ],
      "original_title": "Honeyspider",
      "runtime": 76,
      "poster_path": "/j5hXCkKVLwDfyG8iUZ5WPLHAzRJ.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Black House Capital",
         "id": 32553,
         "origin_country": ""
      }],
      "release_date": "2014-10-18",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "...Let The Blood Of The Dead Inside.",
      "adult": false,
      "homepage": "http://honeyspidermovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Josh Hasty"],
      "runtime": 76,
      "synopsis": null,
      "writers": ["Kenny Caperton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3526462/",
      "coverLink": null,
      "actors": [
         "Frank J. Aard",
         "Anjali Alm-Basu",
         "Brad Baker"
      ],
      "reviews": [
         "One of the absolute worst pieces of garbage I have seen this year, this movie had no redeemable qualities and should be relegated to the annals of film obscurity. The acting was beyond bad (especially by the lead actress; please never act again), the premise made very little sense, and nothing (and I mean, nothing) of interest goes on for much of the film. The special effects are a joke, the soundtrack is amateurish at best, and it is just a complete and utter waste of time. There are movies that you watch and aren't very good and make you say, \"At least they tried\", while others (like this one) make you pray to God that the people involved in this travesty NEVER make a film again. I wish I had never wasted my precious time on this tripe. One of the worst films I have seen in my life. Avoid like it is contagious. To the people giving this movie 4-5 stars; you know, it's pretty damned disingenuous to give a movie high ratings because you know someone involved with the film (or were involved in it yourself). You are not doing anyone any favors by being a liar, and tricking people into watching garbage. If you only have one movie in your reviews log, and gave this movie anything more than the 2 it deserves, you are nothing more than a cheat. You should all be ashamed of yourselves.",
         "After wasting 76 min. of my life, enduring the abysmal ordeal that is Honeyspider, I can safely say that Mr. Hasty ( what a fitting name ) doesn't have a clue when it comes to creating horror and he should be thoroughly ashamed of himself having the affront to actually release s**t like this. Disgusting. Nothing works in this movie, and I mean nothing. The acting is horrendous, truly the epitome of bad, not a single syllable that is being spewed out of their stupid mouths is convincing in any shape or form, they have all the charm of cardboard and the tangibility of ghosts. The dimension of reality is non-existent. The pacing and editing is all kinds of wrong; obviously this \"director\" thinks that spending inordinate amounts of time watching the lead wandering aimlessly around in different settings is pure gold and he clearly don't have a clue as when to switch to another shot. But I guess it's nearly impossible to get this properly done when you have the sensibility of an elephant. The soundtrack isn't much to write home about either, and most of the time it doesn't fit the scenes at all. The story? Completely meaningless and soulless. In other words, one of the worst movies ever made. Please don't make another one Mr. Hasty, you and the rest of your crew have zero talent.",
         "I was fortunate enough to see the world premiere of this film in Kannapolis, North Carolina. Parts of the film were shot at the local, historic Gem Theatre, and it features prominently in the film. The Gem Theatre held the premiere, as a double feature with George A. Romero's Night of the Living Dead. As much as I adore Night of the Living Dead, I had more fun watching Honeyspider. It was fresh, highly ambitious, infectious, mysterious, and genuinely frightening at times. As an independent author and wannabe filmmaker myself, I'm always impressed at what independent filmmakers can accomplish with such a small budget. A lot of times, the smaller budget allows for an increase in creativity and devotion to a project, and Honeyspider is oozing around the edges with creativity and devoted participants. The film begins on a slow zoom in on our beautiful leading lady. Mariah Brown plays Jackie Blue, a college student celebrating her 21st birthday on the most glorious day of the year, Halloween. She works at the local movie theatre, has eccentric friends (two of whom are appreciably dressed as Columbia and Magenta from The Rocky Horror Picture Show, which is ironic, as I wore a Rocky Horror shirt to the premiere!), has to deal with a creepy professor, and has parents who don't really seem to care. Frank Aard plays Professor Lynch, the aforementioned creepy professor, who may be more diabolical than the viewer can imagine. As Jackie goes about her evening, tarantulas begin showing up, tormenting her. Setting the film in the late '80s was a very welcome touch, as I abhor a lot of modern technologies. If the characters were all playing on their current phones, tablets, etc. throughout the film, in twenty years, it would end up being a dated work, like plenty of other films through the ages. The filmmakers wisely set it in the '80s, thereby immediately stamping it as a curiosity piece, allowing the true characters and plot to unfold in a more universal manner. The slow pacing of the film is right up my alley. The best horror films build and build with suspense, thoroughly developing the characters, rather than relying on cheap scares. Take The Exorcist and The Shining, for example. They are based in reality, developing characters and a world which absorb the viewer. Honeyspider takes a page from that book, building a lead character and her world on a firm, believable foundation. Then, when the climax comes, it's that much more unsettling and terrifying. Another facet of this film that I adored was the music and sound design. Some of the sound design felt as though the filmmakers overdosed on David Lynch films before working on this project. Given the fact that the creepy professor's name is Lynch, that doesn't seem like a far-fetched possibility. The music is even one of the first scares in the film. After the first scene, the lead character starts walking back to her dorm, calmly, quietly. Suddenly, the image freezes, the title card appears, and the music strikes a boisterous, sinister chord that jolts the viewer and chills him to the core. What makes Honeyspider so smart, though, is the fact that it never takes itself too seriously. The slow pacing and high ambition never get in the way of the tremendous level of fun the film instills. This is most evident in the movie-within-the-movie. As stated before, Jackie works at a movie theatre. The theatre is showing a film titled, Sleepover Slaughterhouse Part III. This is where I really fell in love with the film. Honeyspider is shot in a 2.35:1 aspect ratio. The Sleepover Slaughterhouse Part III segments change to a standard 1.33:1 aspect ratio. I adore whenever a film uses varying aspect ratios to tell its story. Woodstock, Life of Pi, and The Grand Budapest Hotel all use this technique, and I love it. The opening credits of Sleepover Slaughterhouse Part III are a scream, not only because of the ridiculously campy faux cast and crew, but because they are fashioned after another famous, ridiculous Part III of a slasher series starring a certain hockey mask wearing individual. Sleepover Slaughterhouse Part III is every horror stereotype Honeyspider is not. This is how the filmmakers allowed themselves to be fun and crazy amidst the serious effort put forward in the rest of the film. My only qualm with seeing the first screening of a film in theatres is that I have to way so much longer for a home video release. I hope this film makes its way onto the home video market quite soon because I want to show it to everyone I know. Honeyspider is a self-proclaimed cult film, and I hate the fact that I didn't \"Join the Cult\" on the film's website early enough, so I could have gotten a shirt. I am proud to be a part of the Honeyspider cult. I think it's time to retire the V for Vendetta symbol I've been drawing random places, for I have found a new symbol.",
         "Kenny Caperton is the writer of this occult Halloween horror tale, and it is in the same vein as Zombie's \"The Lords Of Salem\". The story blends aspects of chilling atmosphere, macabre theatrics and almost hypnotic surrealism- the dream sequence that seems to tap into some metaphysical state is some of my favorite moments in the film. True art-house horror moments. But there is so much about \"Honeyspider\" that is so cool, retro and fresh that I just really enjoyed being pulled into the main character's story. And the occult stuff always gets me giddy in horror, especially films that build it around Halloween/Samhain. The special effects and makeup are complimentary to this dark, mystical nightmare. The atmosphere builds on some nice sounds that instantly throw you back into classic 80's horror. The cool addition of adding a film within a film gives some extra and much needed blood and gore. All of which is practical effects done masterfully. I personally loved the soundtrack from the first notes of the synth just after the intro right up until the very last moments of the film. The mix of songs from various indie genre artists and the instrumental stuff really put you in the attitude and emotion of the film. Nothing about the effects or the 80's setting felt fabricated or cheap. I guess you could argue that some of the props were more retro inspired than actual 80's, but it all looked and felt 80's to me. Overall \"Honeyspider\" is a well crafted horror tale with some truly instant classic moments. This is indie/ low-budget film making awesomeness! The cast give stellar performances and the dialog is short but effective. The film does take a slow and steady build up with occult, and suspense thriller mixing together in a methodical pace in away that pulls you into the story, and you just set and watch as it all unfolds. \"Honeyspider\" takes the best of the horror genre-from it's \"new\"beginnings in the Corman era, through the occult days, right into the totally awesome slasher/splatter days of the 80's. Definitely check \"Honeyspider\" out. I do think the ending may bother some horror fans but only if the ending to \"The Lords Of Salem\" bothered you! I love it and feel it begs a second installment.",
         "Horror films aren't exactly what I go to the movies for. For one reason or another, most don't do it for me. Honeyspider is one of two films that fall into the Horror genre that I can recommend to literally anyone. I didn't expect to like it as much as I do. A few friends of mine wanted to watch it, and for the first few minutes, I didn't pay much attention. But as the movie progressed, I became more and more immersed in it. It was like I was watching what every horror film should be. Considering production budgets, the film is a technical masterwork. Add in the entrancing and open-ended story, and just the general genre-savviness of the creators, and you have an instant Halloween classic. This isn't a movie that you watch and then go back to the rest of your day. This is a movie you watch, then watch again, then have a conversation with the people who made it on Twitter, and then write a review of while watching it for a third time. I can't express how finely tuned an instrument this film is. If you haven't seen it yet, you need to be watching it.",
         "This was a long awaited throwback Halloween Horror Thriller, loved it's slow paced creepy story\u0085 I can see this becoming a cult classic!, a sort of Halloween must watch every year movie\u0085 Although it's a very slow burning movie, it keeps you hooked with it's spooky weirdness and unravelling story\u0085 It's worth the wait! to get to a well delivered and unsuspecting ending\u0085 The sound track to this movie was just amazing, well fitting and just made the movie fresh\u0085 The acting was superb from newcomer Mariah Brown playing lead role as Jackie Blue on her wonting quiet birthday, \"well you can want\"\u0085 I'm not getting into the plot with this as all you need to know is in the synopsis above, i won't give you any spoilers\u0085 But i will say this, it's a must for any Horror \"low budget\" movie lover, you need this in the collection, and dig it out every year on Hallows eve\u0085...",
         "I'm always excited for Halloween horror films and 'Honeyspider' is one of the best new ones to come around in awhile. The first thing that struck me about the film was the soundtrack. And not just the known songs, but the overall backing music and intro song. For a very small film, the soundtrack was effectively creepy. Jackie is trying to have a quiet Halloween birthday, but her night takes a terrifying turn when she sees a mysterious symbol on the wall in her dorm shower, she receives a strange ring and huge spiders start appearing out of nowhere. Murder on the big screen during the horrorthon blends with real life slashing adds up to a lot of bloody mayhem and dead spiders. The style in which the film is shot creates an incredibly effective eerie and surreal atmosphere. Combining that with the music, and 'Honeyspider' is one of the creepiest movies I've seen in the past year. Reminiscent of horror classics such as 'Halloween', and 'Rosemary's Baby', and Stanley Kubrick in terms of atmosphere, the film also reminded me of Ti West's 'House of the Devil', which is a favorite of mine. I especially enjoyed the end of the film, which was executed in an artistic way. The Smashing Pumpkins song 'Honeyspider,' which the film was inspired by, plays over the last scene and wrapped up the film perfectly. Mariah Brown was excellent as the confused Jackie Blue. Frank Aard ('April Fool's Day' remake) was straight up creepy as hell. Director Josh Hasty was clearly inspired by his passion for the genre and did an amazing job with this film. I really hope to see more of his work in the future. Horror fans looking for that classic horror vibe that many of today's films have lost need to check out 'Honeyspider.' It's one of those films you will want to watch every year on Halloween. Originally Posted on Horrornewsnetwork.net http://horrornewsnetwork.net/articles/11911-honeyspider-review? Itemid=101",
         "\"Honeyspider\" is a new indie horror flick from writer and producer Kenny Caperton and producer/director Josh Hasty . The 2014 project serves as a rejuvenation of classic late 70's, early 80's films, and it is masterfully executed. There's a great balance between the retro feel and inventive techniques, sprinkles of humor, and a terrific atmosphere, the combination of which spin an intricate, delightful tale. The film follows Jackie Blue (Mariah Brown), a college student struggling with classes, work, and her parents' separation. It's Halloween, 1989, coincidentally Jackie's birthday. She's in no celebratory mood, however, but it's more than the stress of familial problems and school. Jackie's Halloween becomes increasingly frightening, filled with peculiar dreams, spiders, and a strange professor (Frank J. Aard). \"Honeyspider\" retains a distinctly retro feel, evoking classic horror movies like John Carpenter's 1978 \"Halloween.\" This comes as no surprise, considering writer and producer Kenny Caperton's dedicated recreation of the Michael Myers abode. Like Carpenter's memorable flick, there's a methodical pacing that establishes tension. Provocative camera work lends the sense of a sinister presence hiding just unseen. Additionally, protagonist Jackie draws some undeniable similarities to strong heroines like Laurie Strode (Jamie Lee Curtis), and Nancy Thompson (Heather Langenkamp, \"A Nightmare On Elm Street\"). Poor Jackie just wants a relaxing night, and instead she's plagued by bizarre visions, spiders, and dead bodies. Further fostering the throwback atmosphere is the actual setting. Filming locations include the aforementioned Myers House, as well as a gorgeous old cinema, The Gem Theatre in Kannapolis, North Carolina. Jackie drives an old Volkswagen Beetle, a throwback vehicle for sure. A corded phone even makes an appearance, and there's a cool shot in the projection booth featuring an actual film print. Similarities to past films however pay homage, rather than copying. \"Honeyspider\" bursts forth with innovation, and really freshens up the genre. There's a surprising, and much appreciated, dose of humor peppered into the narrative. It's subtle comedy, as opposed to slapstick found in \"The Evil Dead\" and \"Scream.\" While Jackie is working the concession counter at the theatre, each customer steals something without consequence, a hilarious sequence. It's witty snippets like this that make \"Honeyspider\" so unique. A particularly clever inclusion is the fictitious \"Sleepover Slaughterhouse III,\" which presents as a movie within a movie. It plays heavily on horror tropes, including the obligatory topless scene, a silent masked killer, and even an Ouija board. Plus, the name suggests it's one entry in a never-ending franchise. The movie jumps seamlessly between \"Honeyspider\" and \"Sleepover Slaughterhouse III,\" and the theatre-goers are pretty funny. One audience member, Jackson (David Hensley) keeps making unsuccessful moves on his date, comical segments in between the film within a film. Overall, \"Honeyspider\" is an imaginative, unique tribute to the horror films we've grown up loving. There are recognizable elements borrowed from beloved slashers, but a hearty dose of originality. Notably, the music is an underrated, but phenomenal aspect. The title derives from a Smashing Pumpkins track of the same name, the \"Monster Mash\" plays, and the finale features a haunting dream sequence. A disturbingly relaxing piano piece compliments eerie, black and white imagery. What truly sets \"Honeyspider\" apart is the way the supernatural components aren't fully elucidated. This leaves much to the imagination, which enhances the creepiness. Currently, \"Honeyspider\" is making various special screenings, including an awesome drive-in showing at the Raleigh Road Outdoor Theatre in Henderson, NC. Stay updated on the \"Honeyspider\" website, as it's a delectably fresh horror flick, one you'll certainly want to catch. Mitchell \"Moe\" Long http://www.examiner.com/movies-in-durham/mitchell-moe-long",
         "Saturday, October 18th marked the official world premiere of something that had been on my radar for some time. HONEYSPIDER, the first full-length horror feature by North Carolina filmmaker/writer Kenny Caperton alongside director Josh Hasty, held its first official showing at the historic Gem Theatre in Kannapolis, NC. Built in 1936, destroyed by fire in 1942, and fully restored in 1948, The Gem Theatre is one of the most iconic theatres in the Carolinas, as well as one of the oldest continuously running theatres in the United States today. Needless to say, The Gem has a certain \"Old World\" charm and arguable level of beautiful creepiness that was so appropriate for a horror film's premiere in the spookiest of seasons. Over the past several years, Caperton has become something of a fixture in the horror community, gaining much-deserved notoriety for building The Myers House: NC – a life-size scale replica of the infamous Michael Myers house from John Carpenter's HALLOWEEN franchise, which is not only his personal love-letter to his favorite genre/film, but also his own private residence. While the house has been featured in several films already, including Caperton's own Halloween-inspired fan-film prequel: 2010's JUDITH: THE NIGHT SHE STAYED HOME, this was Caperton's first attempt at writing an original feature-length horror. Set in the late 1980s, HONEYSPIDER tells the story of Jackie Blue (Mariah Brown), a college student about to celebrate her 21st birthday, which just so happens to also be Halloween. Trying to keep her grades up, struggling with divorced and rather disconnected parents, and a rather creepy professor, Professor Lynch (played by Frank Aard) who seems to have more than a little personal interest, Jackie seems intent on just keeping her head down and trying to get by, holding a job at the local movie theatre (the location of which provided by The Gem itself) where she takes time to study between customers. As Halloween (and of course, her birthday) approaches, Jackie begins to hallucinate, seeing tarantulas nearly everywhere she goes, and receives a mysterious ring as a birthday gift. When Jackie goes to work at the theatre for the big Halloween spookshow of \"Sleepover Slaughterhouse Part III\" (a film within the film) we're treated to some good old-fashioned slasher action, courtesy of a mysterious masked killer, who of course has his sights set on Jackie, culminating in a bizarre cult ritual. Who is the mysterious killer? Why are he and the cult targeting Jackie? Will she survive? What happens next? At least some of these questions will be answered, but certainly not all, and that's part of why I enjoyed this film so much. While the cult gives the audience just enough to get the gist of things, they never actually explain anything, focusing instead on their own reasons. This was so important to me because too many films these days tend to just give everything away. I mean, why would they explain anything? They know why they do what they do, but what kind of cult and/or killer would really, actually bother to explain why? I found this to be quite pleasing story-wise. Another thing I particularly appreciated was the authenticity of \"Sleepover Slaughterhouse Part III\" – the little film within the film, which not only captured the look, feel, and overall campiness of your typical 80s slasher flick, but also featured actual 80s title/credit fonts (that may or may not have been obviously inspired by another certain Part III of a slasher franchise), sound, and presentation of such a film that if I didn't know better, I'd be sure I could go find on VHS rotting away on some old video store shelf somewhere. About my only real gripe with the film, come with the sound department, whose audio came off as a bit uneven throughout the film, which could be easily fixed with a quick trip back to the mixing boards, but likely will stay as the one shining flaw in the production. I could argue that the final sequence was a bit drawn out, and could use a slight (and I do mean slight) runtime cut, but that's such a minor thing, that even as I write this review, I don't really see that as something that actually needs fixing that bad. Overall, HONEYSPIDER is a wonderful homage to 80s horror cinema, never taking itself too seriously, while refusing to dip into that dreaded (and quite frankly lazy) slippery slope of \"horror-comedy\" that so many independent horror films fall back on way too often. Hasty does a superb job of directing and bringing Caperton's story to life with excellent camera work, and the cast does an excellent job of delivering a natural, believable performance that is only strengthened by the fact that they all look like actual, real people as opposed to \"Hollywood\" types. There are obvious nods to Rob Zombie's THE LORDS OF SALEM with the symbolism and perhaps even some of the styling, and of course The Smashing Pumpkins with the title, but not nearly enough to be any sort of rip-off. This is an original, innovative, and refreshing take on the horror genre that pays its respects to the past while ambitiously looking forward to the future. Not bad for a debut effort, and we can only hope this is a sign of many more great things to come."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Scope"],
      "summaries": ["It's Halloween day in 1989 and college student Jackie Blue wants to enjoy a quiet birthday in the midst of a chaotic semester at school. Her friend Amber has other ideas and persuades Jackie to come to the annual Monster Mash party on campus after her shift at the local movie theater. As murder plays out on the silver screen during the theater's Halloween night Horrorthon, Jackie falls under a strange spell, all while a mysterious stranger watches over her every move. As the night unfolds, Jackie slowly unravels and everyone around her is turning up dead. Jackie finds herself helplessly trapped like prey in a spider's web, and all she can do is try to survive the night!"],
      "budget": 0
   },
   "movielensId": 144146,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-10-18",
      "dvdReleaseDate": null,
      "directors": ["Josh Hasty"],
      "runtime": 76,
      "movieId": 144146,
      "title": "Honeyspider",
      "mpaa": "NR",
      "actors": [
         "Mariah Brown",
         "Samantha Mills",
         "Frank J. Aard",
         "Kenny Caperton",
         "Ethan Dunn"
      ],
      "imdbMovieId": "3526462",
      "originalTitle": "Honeyspider",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": ["CbqtdDUWgmw"],
      "plotSummary": "It's Halloween day in 1989 and college student Jackie Blue wants to enjoy a quiet birthday in the midst of a chaotic semester at school. Her friend Amber has other ideas and persuades Jackie to come to the annual Halloween party on campus after her shift at the local movie theater. As the night unfolds, it becomes apparent that Jackie will get more excitement than she bargained for on her birthday this year.",
      "tmdbMovieId": 291336,
      "avgRating": 0.9,
      "releaseYear": "2014",
      "numRatings": 5,
      "posterPath": "/j5hXCkKVLwDfyG8iUZ5WPLHAzRJ.jpg"
   }
}