{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0407048",
      "video": false,
      "title": "No Man's Land",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Spooner",
               "gender": 2,
               "credit_id": "52fe4c69c3a368484e1b6e41",
               "name": "John Gielgud",
               "profile_path": "/jvTSqk7cuOrsdtf037olQ9BKRAe.jpg",
               "id": 11857,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hirst",
               "gender": 2,
               "credit_id": "52fe4c69c3a368484e1b6e45",
               "name": "Ralph Richardson",
               "profile_path": "/p9FyikB1ShTtq1cpMgkkhUrI9Bp.jpg",
               "id": 12689,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Foster",
               "gender": 2,
               "credit_id": "52fe4c69c3a368484e1b6e49",
               "name": "Michael Kitchen",
               "profile_path": "/bt1UWcegfSflLONcFN6XNqgayZt.jpg",
               "id": 10648,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Briggs",
               "gender": 2,
               "credit_id": "52fe4c69c3a368484e1b6e4d",
               "name": "Terence Rigby",
               "profile_path": "/cmg8qwt7Wo649ocgs2vxTPC2MnH.jpg",
               "id": 10748,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c69c3a368484e1b6e3d",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "594ec3f9c3a36832650425ea",
               "name": "Julian Aymes",
               "profile_path": null,
               "id": 1725158,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.010829,
      "production_countries": [],
      "id": 139637,
      "vote_count": 0,
      "budget": 0,
      "overview": "In this TV adaptation of the Harold Pinter classic, a seedy poet (Gielgud) shows up at the home of a rich writer (Richardson) and they start reminiscing about the \"past.\"",
      "similar": [],
      "original_title": "No Man's Land",
      "runtime": 90,
      "poster_path": "/wanWI3vEoVyxV6RmSMhg0bDHL0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1978-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julian Aymes"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Harold Pinter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0407048/",
      "coverLink": null,
      "actors": [
         "John Gielgud",
         "Ralph Richardson",
         "Michael Kitchen"
      ],
      "reviews": [
         "I recently saw a tape of this from a BBC4 transmission and was completely transfixed from start to finish. I can't begin to offer any explanation of what it's about exactly, or talk with any self assurance about the work of Harold Pinter, but can honestly say that this is like nothing else I've seen. Certainly, for me, the best thing Pinter's written. Even the Homecoming struggles to compete for sheer relentlessness malevolence and florid verbiage. Gielgud and Richardson are pure magic, with great support from Michael Kitchen (a far cry from Foyle) and Terence Rigby. The script is surreal, unsettling and hilarious. Tangental is possibly the best word I can come up with, for Pinter generally in fact, with the characters and context continually shooting off in new directions, so the mind is constantly readjusting itself to what it's being asked to understand. It's often said that Pinter is heir to Beckett (and Joyce even) but this is more real than Beckett and possibly has greater emotional depth. Nowadays people would probably say \"multi layered\" but \"multi dimensional\" is possibly more accurate. The exact relationship between the characters remains ambiguous to end, although some clarity does emerge in the last few scenes. To use a much used analogy, it's like listening to an hour and a half of free jazz. An acquired taste, therefore, but for some seeing this will be a truly momentous epiphany.",
         "This is a filmed record of the final teaming of Sir John Gielgud and Sir Ralph Richardson, who first appeared together at the Old Vic Theatre in \"Henry IV, Part I\" in 1930 and teamed on stage many times since, most memorably in \"The Tempest,\" \"A Day By The Sea,\" \"The School for Scandal,\" and \"Home\". This television broadcast made for BBCs Granada Television immortalizes their West End and Broadway success of Harold Pinter's fascinating though impenetrable play about the late night meeting between Hirst, a wealthy man of letters and Spooner, a down-at-heels Bohemian poet, which may represent the finest non-Shakespearean performances of either actors' careers. Particularly memorable is Gielgud, who presents Spooner as a clinging, fawning W. H. Auden-like poser which may be his most effective attempt at portraying a characterization on film outside of the typical stiff and very British Gielgud personae that we've grown accustomed to seeing in films like \"Arthur\" and \"The Elephant Man\". Richardson is also marvelous as the more mysterious Spooner, who sometimes recalls Harry Meyers in \"City Lights\" as a millionaire who invites a tramp into his privileged world when he's plastered only to forget him when he sobers up, as well as Michael Kitchen and Terence Rigby offering excellent support as Hirst's flunkies. But it is Gielgud's masterful work as a sleazy pretender that creates the greatest impression. Pinter's fascinating though somewhat baffling play has received some major revivals since its original production, most memorably with Christopher Plummer as Spooner and Jason Robards as Hirst (making his final stage performance) in a 1994 Broadway production and a 1992 London staging starring Pinter himself in the role of Hirst, but the play will forever be identified with Richardson and Gielgud in their final appearance together. I managed to see this televised version at the Museum of Broadcasting in Los Angeles, and can only hope that it will someday be made available on DVD to a wider audience who will be grateful at catching a glimpse of two immortal actors at the height of their power.",
         "I wore out the VHS copy of this production that I taped off cable in the 1980s, after which I wore out an audiocassette version of it. If it were out on DVD I'd buy it. It's like a classic performance of a great symphony that I just need to hear now and then. I just came back from a screening of the NTLive broadcast of the Ian McKellen/Patrick Stewart production, which was an entertaining and inventive interpretation, but not exactly definitive--sort of like Glenn Gould's march-like version of \"Moonlight Sonata.\" Playing Spooner as a wily old con artist trying to manipulate his way into a demented man's household in order to raid his liquor cabinet is a valid approach but reductive. I prefer the mysterious shape-shifting approach of Gielgud and Richardson, forcing us to focus on the language and the rhythms of speech without ever really getting in on what was actually going on. Because, of course, this is Pinter, and as he loved to remind us it's just a play. Of course this play is a four-hander and Michael Kitchen and Terence Rigby are awesome complements to Gielgud and Richardson."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Granada Television",
         "National Theatre"
      ],
      "summaries": [
         "A seedy ostensible poet, Spooner, visits the home of his wealthy and successful counterpart, Hirst. Their conversation suggests that they have come there after meeting in a pub. Further conversation suggests that they knew each other at university and share acquaintances and perhaps even lovers. Hirst's associates/assistants Foster and Briggs do their best to intimidate Spooner.",
         "In this TV adaptation of the Harold Pinter classic, a seedy poet (Gielgud) shows up at the home of a rich writer (Richardson) and they start reminiscing about the \"past.\""
      ],
      "budget": 0
   },
   "movielensId": 144166,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-01-01",
      "dvdReleaseDate": null,
      "directors": ["Julian Aymes"],
      "runtime": 90,
      "movieId": 144166,
      "title": "No Man's Land",
      "mpaa": null,
      "actors": [
         "John Gielgud",
         "Ralph Richardson",
         "Michael Kitchen",
         "Terence Rigby"
      ],
      "imdbMovieId": "0407048",
      "originalTitle": "No Man's Land",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In this TV adaptation of the Harold Pinter classic, a seedy poet (Gielgud) shows up at the home of a rich writer (Richardson) and they start reminiscing about the \"past.\"",
      "tmdbMovieId": 139637,
      "avgRating": 3,
      "releaseYear": "1978",
      "numRatings": 1,
      "posterPath": "/wanWI3vEoVyxV6RmSMhg0bDHL0.jpg"
   }
}