{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "old man",
            "id": 10938
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "father daughter conflict",
            "id": 204703
         },
         {
            "name": "father son conflict",
            "id": 226774
         },
         {
            "name": "failed exam",
            "id": 230872
         }
      ],
      "imdb_id": "tt4948452",
      "video": false,
      "title": "The Student and Mister Henri",
      "recommendations": [
         52617,
         342281,
         381353,
         347477,
         17407,
         334878,
         377799,
         338827,
         336811,
         344475,
         260312,
         266537,
         342878,
         416854,
         215303,
         341742,
         289153,
         383869,
         330333,
         52682
      ],
      "backdrop_path": "/gWLgE0Xl251O2CrLaFzP6IJE8sN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Monsieur Henri",
               "gender": 2,
               "credit_id": "55fe694c92514152b1002a78",
               "name": "Claude Brasseur",
               "profile_path": "/5x3Q8hgDe8hdRMoqV8T9vuYdAJs.jpg",
               "id": 1958,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Paul",
               "gender": 2,
               "credit_id": "56b6f7de9251414a3a005c8c",
               "name": "Guillaume de Tonquédec",
               "profile_path": "/mDPeqkKJgFMiH60gH32VTwgOHSp.jpg",
               "id": 17896,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Valérie",
               "gender": 2,
               "credit_id": "56b6f8059251410755000922",
               "name": "Frédérique Bel",
               "profile_path": "/ctA6Cxc6CkkHFdQg6RMG12OQQHe.jpg",
               "id": 65572,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Constance",
               "gender": 0,
               "credit_id": "56b6f831c3a36806ec00cda8",
               "name": "Noémie Schmidt",
               "profile_path": "/7vvr0M36jqIkH6TV97eNjq5k1iK.jpg",
               "id": 1573867,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mathieu",
               "gender": 2,
               "credit_id": "583f133b925141152100dadd",
               "name": "Thomas Solivéres",
               "profile_path": "/5aZRznX6bmStaao3JvmM6ywv1Pq.jpg",
               "id": 1069637,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "La mère de Constance",
               "gender": 1,
               "credit_id": "5a0eafe492514138f300c9ff",
               "name": "Valerie Keruzoré",
               "profile_path": "/mobR8MTteALLZAdgyemZ8f6EEEZ.jpg",
               "id": 146491,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Le père de Constance",
               "gender": 0,
               "credit_id": "583f13e2925141152a00e4e1",
               "name": "Stéphan Wojtowicz",
               "profile_path": "/AnPADaw3gddCzOf7RCZJtkXgfqS.jpg",
               "id": 7285,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Le frère de Constance",
               "gender": 0,
               "credit_id": "583f1427c3a368668a00e225",
               "name": "Antoine Glemain",
               "profile_path": null,
               "id": 1716420,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Arthur (as Gregori Baquet)",
               "gender": 0,
               "credit_id": "583f1480c3a368668700dcec",
               "name": "Grégori Baquet",
               "profile_path": null,
               "id": 1470767,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "L'examinatrice auto-école",
               "gender": 1,
               "credit_id": "583f14d2925141152100dc1a",
               "name": "Anne Loiret",
               "profile_path": "/gy2jC26ZrEZCQdKPuTPBYoLXIXA.jpg",
               "id": 13191,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Le DJ",
               "gender": 0,
               "credit_id": "583f14f8c3a368668a00e2dc",
               "name": "Nicolas Guillot",
               "profile_path": "/oJA0lwKBZwPcn4Onj9Qitv890I9.jpg",
               "id": 1136365,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57af1899c3a36821a5003b92",
               "name": "Ivan Calbérac",
               "profile_path": "/w1YXYYFguDvbiEIexybN8paWS4L.jpg",
               "id": 238400,
               "department": "Crew",
               "job": "Script"
            },
            {
               "gender": 0,
               "credit_id": "57af1967c3a36878b400517e",
               "name": "Laurent Aknin",
               "profile_path": null,
               "id": 1665590,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57af1a47c3a36802dc001e8a",
               "name": "Véronique Parnet",
               "profile_path": null,
               "id": 44076,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57af1aa292514172f4002052",
               "name": "Vincent Mathias",
               "profile_path": null,
               "id": 1018986,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57af1b0ec3a3680359002239",
               "name": "Ivan Calbérac",
               "profile_path": "/w1YXYYFguDvbiEIexybN8paWS4L.jpg",
               "id": 238400,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5863b167c3a36852c000d3a7",
               "name": "Ivan Calbérac",
               "profile_path": "/w1YXYYFguDvbiEIexybN8paWS4L.jpg",
               "id": 238400,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 9.179191,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 360638,
      "vote_count": 121,
      "budget": 0,
      "overview": "Because of his wavering health, Monsieur Henri can no longer live alone in his Paris appartment.  Particularly grumpy, he ends up nonetheless accepting his son Paul's suggestion that he let one of his rooms out to a young female student.  Far from falling for her charms, Henri uses her to orchestrate utter family chaos...",
      "similar": [
         806,
         10054,
         8967,
         1427,
         2288,
         4347,
         205,
         425,
         773,
         858,
         13,
         101,
         111,
         334,
         112160,
         39254,
         41630,
         452507,
         244772,
         281957
      ],
      "original_title": "L'Étudiante et Monsieur Henri",
      "runtime": 100,
      "poster_path": "/vcwKqfw1bQeDz4tS96ca1mHZqLV.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mandarin Films",
         "id": 12096,
         "origin_country": ""
      }],
      "release_date": "2015-10-07",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ivan Calbérac"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Ivan Calbérac",
         "Ivan Calbérac"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt4948452/",
      "coverLink": null,
      "actors": [
         "Claude Brasseur",
         "Guillaume de Tonquédec",
         "Noémie Schmidt"
      ],
      "reviews": [
         "I ask myself time and again... how do the French do this? They have a superb knack for taking a very simple story and turning it, without sentiment, into a beautiful, moving, intelligent and uplifting experience. This is another such gem. Beautifully acted by all players, a simple story of a girl who always 'fails' is turned into a story about how we all are... just humans who are trying to find our way. And sometimes it takes a stranger to see who we really are. Definitely one for parents who might need to put on their thinking caps. Highly recommended. Delightful.",
         "Another french feel-good comedy, once more with two outsiders helping each other getting on with life. Though a bit formulaic, this is a good one - entertaining, funny, well paced and with some feeling AND even an \"edgy\" or slightly unexpected ending (at least for a feel-good comedy, that is). First landlord and lodger, the grumpy old widower Henri, and the nice but shrewd and stubborn student, Constance, soon become a bit more invested than each of them planned to. The high points are the three main actors (Henri - he gets most laughs; Constance; and Henri's 40ish son, Paul, who initiated the whole lodging scheme so his father is not all alone). Other characters (among them Paul's wife) get rather shortchanged. The movie is based on a stage play, so the dialogue is snappy and very funny; the downside is that the whole thing is not very cinematic - I guess it wouldn't lose much on a home screen. But I recommend seeing this with a weekend crowd in the theater, always a nice experience with those comedies!",
         "I sometimes wonder if - should I ever relocate to France and have access to a steady diet of films of this quality - I would eventually become jaded and long for a London where, if you're lucky, you'll get a half- decent French film every other Fall. I doubt it because films as good as this are the oxygen of my cinema going despite what the trained seal at filmsdefrance says and if a certain actress is featured you could say I'll be there with Bels on. Now that she has just turned 40 Frederic Bel is not getting the ingenue roles she did in the three films she made with Emmanuel Mourcet - though this film is very much in the style of Mourcet - and here she is the much-married wife around whom the plot resolves given that her father-in-law, the great Claude Brasseur, despises her and bribes student Noemie Schmidt with the offer of a six- months free rental provided she will do her best to break up the marriage. Hardly War And Peace but entertaining and loaded with charm for all that. Put my name on the first DVD off the line.",
         "A simple but deep story which borders the comic and the tragic as 3 characters from 3 completely different generations are faced with family challenges they cannot solve alone. Constance (Noémie Schmidt) has problems with her nerves when attending exams and struggles to know what she wants to do in life. She is now making the big jump from school to university, and moving to Paris. Henri Voizot (Claude Brasseur) is offering a room to let in his nice old style French apartment but his misanthropic, grumpy ways are not easy to handle and finds his match in Constance. The old man ultimately seeks her help to interfere in his son's marriage before he makes a big mistake. Will Constance lower to such ignoble task to keep her room and also her student career? A great Claude Brasseur as the grumpy old man and a promising Noémie Schmidt make us accomplices as we watch their events unfold in this theatrical play made into a film for us to enjoy.",
         "\"L'étudiante et Monsieur Henri\" or \"The Student and Mister Henri\" is an award-winning French 95-minute movie that premiered a year ago already, but it took quite a while for the film to reach theaters outside of France. The writer (also of the play) is Ivan Calbérac and he is also the one who directs here. Almost 15 years since he started making films, this is probably his most known work now. The lead actress is Noémie Schmidt and you could maybe call it her breakthrough role. Claude Brasseur and Guillaume de Tonquedec play the two major supporting characters, father and son. This film is advertised with the general plot idea that a young woman is short of money and in order to be allowed to stay in her apartment, she has to help her landlord. \"Help\" in this context means that she he has to approach his son because the landlord really doesn't like his son's daughter and wants her to fins somebody better. All this is a true and happening in the film, but I personally felt this was just one part of the movie and not relevant to an extent where the film should be defined by this. In my opinion, it is much more about the life of the female main character, about her relationship with her parents, with lovers, with the landlord and his son, but also with the son's wife for example or with her colleagues and friends. And it is also, at least as important, about her professional life, about her struggles to get accepted into university, about her ambitions as a composer and pianist and about her work at a pub as a waitress. This is all that is much more in the center of the film than her being forced to try to destroy another man's marriage. And as such, thanks to the strong lead performance by Schmidt, the films works pretty well for the most part and I believe that she elevated the material considerably with her acting. Her character really is this movie. But I still believe all the other (major and minor) supporting players do a good job. Yes the film gets a bit stereotypical at times with Brasseur's character, but it is not so bad that it really hurts the movie. It's also overly melodramatic occasionally with the over-the-top tragic music when she sees she failed the test or with the old man's death at the end, which was not really necessary or also the slightly cringeworthy reference about the night that the child was conceived. Predictability is a minor concern for this film as some plot twists were really not to be expected, but others kinda were. For example, it is never really to be expected that the \"breaking the marriage\" plan would work out to the father's liking as he is presented as a good guy overall really or the death is really expected with these last words that he is telling her, which was very melodramatic. But as a whole, thanks to Schmidt and also de Tonquedec, I believe that the good easily outweighs the bad. The main character is easy to like thanks to her clumsiness and I actually feel the film is very relevant in terms of the lack of orientation of the generation of people who have the main character's age. Where to go? What to do? There is one quote from another character about the protagonist not having found her purpose yet and this was one of the best quotes and scenes of the film because it felt very real and accurate and it's a statement that describes hundreds of thousands of young people these days. These struggles in professional (and also slightly less in her private life) are the heart and soul of the film in my opinion and they make it easy to like the character and as a consequence the movie because everybody else are just side characters in her life and story. I must say though Schmidt looks so stunning in here for the most part that I wanted to tell the character that she finally needs to try modeling as a career path. To close this review, I want to emphasize again finally how Schmidt makes it work and from what I saw here I think she may have a bright career ahead of her, maybe also in Hollywood films. I recommend the watch."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Mandarin Films",
         "StudioCanal",
         "France 2 Cinéma"
      ],
      "summaries": ["An elderly curmudgeon lets out a room in his large apartment rent-free to a young student - on condition that she does everything in her power to ruin his son's marriage."],
      "budget": 0
   },
   "movielensId": 144204,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2015-10-07",
      "dvdReleaseDate": null,
      "directors": ["Ivan Calbérac"],
      "runtime": 100,
      "movieId": 144204,
      "title": "The Student and Mister Henri",
      "mpaa": null,
      "actors": [
         "Claude Brasseur",
         "Guillaume de Tonquédec",
         "Frédérique Bel",
         "Noémie Schmidt",
         "Thomas Solivéres",
         "Valerie Keruzoré",
         "Stéphan Wojtowicz",
         "Antoine Glemain",
         "Grégori Baquet",
         "Anne Loiret",
         "Nicolas Guillot"
      ],
      "imdbMovieId": "4948452",
      "originalTitle": "L'étudiante et Monsieur Henri",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["k9q551tvuVQ"],
      "plotSummary": "Because of his wavering health, Monsieur Henri can no longer live alone in his Paris appartment.  Particularly grumpy, he ends up nonetheless accepting his son Paul's suggestion that he let one of his rooms out to a young female student.  Far from falling for her charms, Henri uses her to orchestrate utter family chaos...",
      "tmdbMovieId": 360638,
      "avgRating": 3.58333,
      "releaseYear": "2015",
      "numRatings": 6,
      "posterPath": "/vcwKqfw1bQeDz4tS96ca1mHZqLV.jpg"
   }
}