{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "rancher",
         "id": 14574
      }],
      "imdb_id": "tt0051149",
      "video": false,
      "title": "Valerie",
      "recommendations": [],
      "backdrop_path": "/3ypAZ7hiXoojJUfR4LxY7hxHnsg.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "527810dd19c29551451f570c",
         "content": "Sinner or Sinned Against?\r\n\r\nValerie is directed by Gerd Oswald and written by Leonard Heiderman and Emmett Murphy. It stars Sterling Hayden, Anita Ekberg and Anthony Steel. Music is by Albert Glasser and cinematography by Ernest Laszlo.\r\n\r\nJohn Garth (Hayden) is arrested and put on trial for the wounding of his wife Valerie (Ekberg) and murder of her parents. The trial hinges on three testimonies, each telling in flashback what actually unfolded to lead up to the bloodshed. But who is telling the truth?\r\n\r\nSet in the West, a murder mystery with a noirish edge, with crisp black and white photography keeping things in the ream of sombre, Valerie is a mixed bag. Yet it works as entertainment, the screenplay has some surprises in store, where it’s not afraid to paint a world of wanton desires, seedy suspicions, violent mistreatment and possible war tainted masochistic tendencies. The court case at the centre of tale throws up the sometimes fragility of the law, with some biased spice and hurtful hearsay added into the mix, and it all builds nicely to a dramatically bleak finale.  \r\n\r\nHayden delivers one for his fans, all straight backed machismo and menacing drawl, and Ekberg scores well as a scenic beauty who deftly pulls of a dual portrayal that calls for seduction or victim credibility. Steel, Ekberg’s real life beau, is a bit lightweight but doesn’t harm the drama, while there’s not much airy landscapes to enjoy (filmed on location at Iverson ranch in Chatsworth). Still, this is very much one for fans of the stars to seek out, whilst noir and Western fans will find pleasures too. 7/10",
         "url": "https://www.themoviedb.org/review/527810dd19c29551451f570c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "John Huntington Garth",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec0b",
               "name": "Sterling Hayden",
               "profile_path": "/zFntWs4OdfXszzEauHrMURQJkRD.jpg",
               "id": 3088,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Valerie Horvat Garth",
               "gender": 1,
               "credit_id": "52fe48819251416c9108ec0f",
               "name": "Anita Ekberg",
               "profile_path": "/6cVesMXxY4dRO4K87Ni7msNdTPh.jpg",
               "id": 5961,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Reverend Blake",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec13",
               "name": "Anthony Steel",
               "profile_path": "/o3ssUNAkfs223vu3aHYckZkDhlN.jpg",
               "id": 33547,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Herb Garth",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec17",
               "name": "Peter Walker",
               "profile_path": "/g5zm1b82N0iSsBXQuQ1Zp8pGp15.jpg",
               "id": 153372,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Jim Mingo",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec1b",
               "name": "Jerry Barclay",
               "profile_path": null,
               "id": 537729,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Mrs. Lili Horvat",
               "gender": 1,
               "credit_id": "52fe48819251416c9108ec1f",
               "name": "Iphigenie Castiglioni",
               "profile_path": null,
               "id": 170577,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Mr. Louis Horvat",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec23",
               "name": "John Wengraf",
               "profile_path": "/ccb8ViZsmwCNogQspG2MfA8WCLl.jpg",
               "id": 12157,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Jonathan Griggs",
               "gender": 0,
               "credit_id": "52fe48819251416c9108ec27",
               "name": "Gage Clarke",
               "profile_path": "/ss2orebpqeAv9nLFy81uEPhZRSw.jpg",
               "id": 114329,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Dave Carlin",
               "gender": 0,
               "credit_id": "52fe48819251416c9108ec2b",
               "name": "Tom McKee",
               "profile_path": null,
               "id": 151868,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Judge Frisbee",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec2f",
               "name": "Sydney Smith",
               "profile_path": null,
               "id": 178269,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Lundy",
               "gender": 0,
               "credit_id": "52fe48819251416c9108ec33",
               "name": "Bob Adler",
               "profile_path": null,
               "id": 929008,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Dr. E. Jackson",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec37",
               "name": "Stanley Adams",
               "profile_path": "/lHMryF9N5VfyLj6fx07haIaD6mH.jpg",
               "id": 1947,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec3b",
               "name": "Malcolm Atterbury",
               "profile_path": "/A5bi0v9WuSt1Y6KyUnHvq6XKNHk.jpg",
               "id": 115460,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Nurse Linsey",
               "gender": 1,
               "credit_id": "52fe48819251416c9108ec3f",
               "name": "Juney Ellis",
               "profile_path": null,
               "id": 112936,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec43",
               "name": "John Dierkes",
               "profile_path": "/enFa8jeKSkySro8wto7PPcJ3bZ4.jpg",
               "id": 29645,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Linsey",
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec47",
               "name": "Norman Leavitt",
               "profile_path": "/5aAdqKXOZeWmAEGoMBOdJI3ZU0I.jpg",
               "id": 164974,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Earl Davis",
               "gender": 0,
               "credit_id": "52fe48819251416c9108ec4b",
               "name": "Darryl Duran",
               "profile_path": null,
               "id": 697047,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48819251416c9108ebdd",
               "name": "Ernest Laszlo",
               "profile_path": null,
               "id": 9103,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe48819251416c9108ebe3",
               "name": "Leonard Heideman",
               "profile_path": null,
               "id": 347498,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48819251416c9108ebe9",
               "name": "Emmett Murphy",
               "profile_path": null,
               "id": 929000,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48819251416c9108ebef",
               "name": "Hal R. Makelim",
               "profile_path": null,
               "id": 929001,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48819251416c9108ebf5",
               "name": "David Bretherton",
               "profile_path": null,
               "id": 3898,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec01",
               "name": "Don Cash",
               "profile_path": null,
               "id": 781296,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe48819251416c9108ec07",
               "name": "LaVaughn Speer",
               "profile_path": null,
               "id": 929005,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "52fe48819251416c9108ec51",
               "name": "Gerd Oswald",
               "profile_path": null,
               "id": 8626,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "571d1e15c3a368197c006fbe",
               "name": "Albert Glasser",
               "profile_path": null,
               "id": 88643,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.422714,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 82963,
      "vote_count": 3,
      "budget": 0,
      "overview": "A rancher has to prove that he didn't kill his wife's parents. Clearly inspired by Rashomon, the film offers contradictory flashbacks during a lengthy trial.",
      "similar": [
         12501,
         15573,
         18264,
         42328,
         199368,
         346819,
         296615,
         136966,
         11697,
         12690,
         14168,
         3089,
         24748,
         22660,
         43933,
         398265,
         38765,
         18721,
         21717,
         21242
      ],
      "original_title": "Valerie",
      "runtime": 84,
      "poster_path": "/gRqpZXGt0eaTltUkvViN3vlGdfm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1957-08-01",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Gerd Oswald"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Emmett Murphy",
         "Laurence Heath"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051149/",
      "coverLink": null,
      "actors": [
         "Sterling Hayden",
         "Anita Ekberg",
         "Anthony Steel"
      ],
      "reviews": [
         "Valerie is directed by Gerd Oswald and written by Leonard Heiderman and Emmett Murphy. It stars Sterling Hayden, Anita Ekberg and Anthony Steel. Music is by Albert Glasser and cinematography by Ernest Laszlo. John Garth (Hayden) is arrested and put on trial for the wounding of his wife Valerie (Ekberg) and murder of her parents. The trial hinges on three testimonies, each telling in flashback what actually unfolded to lead up to the bloodshed. But who is telling the truth? Set in the West, a murder mystery with a noirish edge, with crisp black and white photography keeping things in the ream of sombre, Valerie is a mixed bag. Yet it works as entertainment, the screenplay has some surprises in store, where it's not afraid to paint a world of wanton desires, seedy suspicions, violent mistreatment and possible war tainted masochistic tendencies. The court case at the centre of tale throws up the sometimes fragility of the law, with some biased spice and hurtful hearsay added into the mix, and it all builds nicely to a dramatically bleak finale. Hayden delivers one for his fans, all straight backed machismo and menacing drawl, and Ekberg scores well as a scenic beauty who deftly pulls off a dual portrayal that calls for seduction or victim credibility. Steel, Ekberg's real life beau, is a bit lightweight but doesn't harm the drama, while there's not much airy landscapes to enjoy (filmed on location at Iverson Ranch in Chatsworth). Still, this is very much one for fans of the stars to seek out, whilst noir and Western fans will find pleasures too. 7/10",
         "Respected rancher and Civil War veteran John Garth (Sterling Hayden) goes on trial for killing his in-laws and wounding his wife Valerie (Anita Ekberg) but flashbacks from the witness stand give conflicting accounts of what happened... Gerd Oswald's moody RASHOMON-like western doesn't explore the nature of truth the way Kurosawa's film does (in this case, someone's lying and someone isn't) but it's interesting to see how the same words and deeds can be used to bolster both the prosecution and the defense. In Garth's version, he's a long-suffering cuckold whose immigrant wife is a greedy slut with a yen for anything in pants while her testimony paints the war-hardened vet (who's job was getting information from enemy prisoners) as a sadistic psycho who's sole pleasure is making her life pure hell. There's also testimony from the town's Reverend (Ekberg's real-life husband, Anthony Steel) who's accused of being Valerie's latest paramour but in a rousing finale the real story comes out -and not a moment too soon, otherwise the townsfolk would have believed the wrong party. The film's been called a \"noir western\" but that has more to do with the adult themes than any Expressionistic, shadowy photography which would have been difficult in any event due to the sparse use of night scenes. The German émigré director painted it black in other ways and pushed the Production Code envelope by making it clear in Valerie's testimony that Garth raped his bartered bride on their wedding night, beat and belittled her for being a foreigner, accused her of adultery with both his brother and the Reverend, attempted to abort their unborn child, and tortured her with lit cigars. Whew. Prematurely weathered Sterling Hayden's dour demeanor doesn't give away the denouement (although his account does seem stilted) and as the titular enigma, Anita Ekberg looks gorgeous in period costumes but her overdone make-up makes the shapely Swedish somnambulist look like a modern day glamor girl, something the filmmakers no doubt intended as a come-on to entice audiences. That said, it's compelling trash with an ample amount of mayhem and well worth tracking down. Oswald & Ekberg reunited the following year for Columbia's SCREAMING MIMI, a lurid, gritty little B-noir psycho-thriller that predicted the Italian giallo cycle of the 1960s.",
         "This is an interesting western about a husband (Sterling Hayden) who shoots his wife (Anita Ekberg) and her parents. The story is told in flashback from both husband and wife, each story contradicting the other. It gives a chance for Anita to act, a chance she did not have in most of her films, where what counted was her physical presence. She is at her best when she uses her power of seduction with Hayden's brother. Hayden is very good as John Garth, a man who fought in the war for the Union, where his job was to get confessions from prisoners. Even Anthony Steel, who was married to Anita in real life and never was much of an actor is good here as the Rev. Blake who leaves us in doubt if he is having an affair with Anita or not.",
         "Like in \"the iron sheriff\" ,which also features Hayden as the lead,the movie begins when many important events happened . In this whodunit disguised as western, the hero wanted to piece together the past ,meeting several suspects ,during his son' s trial .We watched the story through different eyes . The same goes for \"Valerie\" which is nothing but a long flashback;whereas the scenes are told by the hero or his lawyer or by the showdown's victim,the story takes an entirely new meaning .The main inspiration is not the traditional western,but rather Japanese Kurosawa's \"Rashomon\"(1950) -which was remade by Martin Ritt as \"\"the outrage\" (1964) The story sustains interest throughout ,except for the final scenes which are botched.Anita Ekberg possesses enough ambiguity to pass for an angel or a demon.Sterling Hayden is ,as usual,an imposing individual,even in the scenes of his trial when he is supposed to keep a low profile.",
         "The western was generally a male-dominated genre, so it is unusual to come across one bearing the name of a female character for its title. Even a film like Nicholas Ray's \"Johnny Guitar\", which features two strong women played by Joan Crawford and Mercedes McCambridge, bears the name of one of the male characters. \"Valerie\", however, is not a typical western. Most westerns from the fifties tended to revolve around a few well-worn themes- Cavalry versus Indians, lawman versus outlaws, wagon train, range war over grazing rights, cattle drive, etc. This one is different. Indeed, it might be more accurate to describe it not as a western but rather as a courtroom thriller or domestic melodrama which just happens to be set in the Old West. Unlike most westerns, the story could, with only a few minor changes of detail, be transferred to virtually any other part of America- or, indeed, to many other countries- at virtually any other period in history. This perhaps explains why it was made in black-and-white; although colour was increasingly becoming the norm for traditional westerns in the late fifties, monochrome was still commonly used for psychological dramas. As the film opens, a wealthy rancher named John Garth is tried for shooting his beautiful young Hungarian-born wife Valerie, critically wounding her, and murdering her parents. Most of the story is told in a series of flashbacks, using for a framework the testimony given in the courtroom by various characters. The two main witnesses are Garth himself and Valerie, who has by now recovered sufficiently to give her evidence from her hospital bed. As might be expected, the two give very different accounts of their marriage. His testimony is that she was a cold, unloving wife who was unfaithful to him with his own brother and with the local preacher, the Reverend Blake, that her parents constantly interfered in the marriage and that the shooting was either a crime of passion or self-defence. She testifies that he was a brutal, foul- tempered husband who wrongly and unreasonably accused her of adultery in an attempt to justify the violence he wreaked on her in his frequent rages. The film has been compared to Kurosawa's influential \"Rashomon\", which also told its story from several different viewpoints, although as another reviewer points out, there is a difference. In Kurosawa's film the various conflicting viewpoints were all presented as equally valid, implying that truth is something subjective, whereas here truth is treated more objectively. One of the parties is telling the truth and the other is lying. Which of the accounts is true and which is false is revealed in the final denouement. This made Valerie a difficult role to play, as the actress playing her needed, effectively, to play two quite different characters, both the innocent wronged wife which Valerie claims to be and the heartless, promiscuous seductress which is how her husband depicts her. The role therefore needed someone more accomplished than the Swedish sex symbol Anita Ekberg who always, or so it seemed to me, got by more on looks than on talent, at least in her English-language movies. (She was perhaps fortunate that the early part of her career came in the fifties, at a time when the film industry seemed particularly obsessed with voluptuous blondes- Monroe, Dors, Mansfield, Bardot, Van Doren, et al.) Here she is rather disappointing, failing to portray either of the two Valeries with any great conviction. Sterling Hayden, however, is more convincing as Garth, possibly because the difference between the two versions of Garth's character is not as great. Even on his own testimony Garth is an unhappy, tormented man, haunted by memories of the Civil War in which he was responsible for torturing Confederate prisoners in order to extract information from them. The Reverend Blake is played by Ekberg's real-life husband, Anthony Steele. I had never heard of this film until I caught it when it was recently shown on television, and I note that mine is only the third review it has received, suggesting that it is not very well known. Yet despite the weakness of its leading actress, I feel that this is one of those westerns that deserves to be better known. Its German-born director Gerd Oswald handles his material well and the unusual subject-matter makes the film a welcome and refreshing change. 7/10"
      ],
      "genres": ["Western"],
      "productionCompanies": ["Hal R. Makelim Productions"],
      "summaries": [
         "John Garth (Sterling Hayden) is tried for critically wounding his wife Valerie (Anita Ekberg) and murdering her parents (John Wengraf and Iphigenie Castiglioni.) His testimony is one of disappointment with Valerie, her unfaithfulness with Reverend Blake (Anthony Steele),and the continual nagging by her parents; a combination of events that drove him to violence. He makes no mention of having a bad childhood. Valerie, from her hospital bed, testifies of a nightmarish marriage, constant brutality and an unreasonable suspicion of Reverend Blake who befriended her in her misery.",
         "After the American Civil War, former Union Major John Garth marries pretty settler Valerie but tragedy strikes and the two spouses end up in court where they give two different conflicting accounts of their marriage."
      ],
      "budget": 0
   },
   "movielensId": 144244,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-08-01",
      "dvdReleaseDate": null,
      "directors": ["Gerd Oswald"],
      "runtime": 84,
      "movieId": 144244,
      "title": "Valerie",
      "mpaa": "",
      "actors": [
         "Sterling Hayden",
         "Anita Ekberg",
         "Anthony Steel",
         "Peter Walker",
         "Jerry Barclay",
         "Iphigenie Castiglioni",
         "John Wengraf",
         "Gage Clarke",
         "Tom McKee",
         "Sydney Smith",
         "Bob Adler",
         "Stanley Adams",
         "Malcolm Atterbury",
         "Juney Ellis",
         "John Dierkes",
         "Norman Leavitt",
         "Darryl Duran"
      ],
      "imdbMovieId": "0051149",
      "originalTitle": "Valerie",
      "genres": ["Western"],
      "youtubeTrailerIds": [],
      "plotSummary": "A rancher has to prove that he didn't kill his wife's parents. Clearly inspired by Rashomon, the film offers contradictory flashbacks during a lengthy trial.",
      "tmdbMovieId": 82963,
      "avgRating": 1.5,
      "releaseYear": "1957",
      "numRatings": 1,
      "posterPath": "/gRqpZXGt0eaTltUkvViN3vlGdfm.jpg"
   }
}