{
   "tmdb": {
      "original_language": "tr",
      "keywords": [
         {
            "name": "frog",
            "id": 4456
         },
         {
            "name": "cop",
            "id": 8015
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "based on short film",
            "id": 13000
         },
         {
            "name": "madness",
            "id": 41410
         },
         {
            "name": "turkish horror",
            "id": 228712
         }
      ],
      "imdb_id": "tt4935418",
      "video": false,
      "title": "Baskın: Karabasan",
      "recommendations": [
         352372,
         362409,
         359025,
         323373,
         325302,
         279972,
         134812,
         291272,
         20481,
         354251,
         404713,
         40364,
         13570,
         254194,
         329160,
         138941,
         296503,
         369032,
         323665,
         347642
      ],
      "backdrop_path": "/uxrsznMDPgsGDqiZ7UkkFgBEglM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Yavuz",
               "gender": 0,
               "credit_id": "55cc0ec6c3a368570b00167f",
               "name": "Muharrem Bayrak",
               "profile_path": "/r6rGCsz4ub4x5KjKdyfyZfGiucw.jpg",
               "id": 107992,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Baba / The Father",
               "gender": 0,
               "credit_id": "55cc0eeac3a36857080017b9",
               "name": "Mehmet Cerrahoglu",
               "profile_path": "/4kPj1Ba7kIJuRbv5EEy7S7KbjPT.jpg",
               "id": 1496324,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Apo",
               "gender": 0,
               "credit_id": "55cc0f3f925141763e00186a",
               "name": "Mehmet Faith Dokgoz",
               "profile_path": null,
               "id": 1496325,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Arda",
               "gender": 0,
               "credit_id": "55cc0f6992514176480017fd",
               "name": "Gorkem Kasal",
               "profile_path": null,
               "id": 1449806,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Remzi",
               "gender": 2,
               "credit_id": "55cc0f84c3a36857080017da",
               "name": "Ergun Kuyucu",
               "profile_path": "/3oNi63alThJXZvEteDc5q3xdffl.jpg",
               "id": 1439926,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Sabo",
               "gender": 0,
               "credit_id": "55cc0fa992514176390016d9",
               "name": "Sabahattin Yakut",
               "profile_path": null,
               "id": 1146840,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Father's Servant / Master Creep",
               "gender": 0,
               "credit_id": "58610dd7c3a3681a6202ec4f",
               "name": "Şevket Süha Tezel",
               "profile_path": "/bg5GaRJCuom1thiLL0jUDnQipg3.jpg",
               "id": 1480500,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5520ac73c3a3683453000630",
               "name": "Can Evrenol",
               "profile_path": null,
               "id": 1265594,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55cc0c34c3a368055e0000cf",
               "name": "Alp Korfali",
               "profile_path": null,
               "id": 1449803,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55cc0ce9c3a36856f90018a9",
               "name": "Erkan Ozekan",
               "profile_path": null,
               "id": 1195906,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55cc0d05925141764f001765",
               "name": "Can Evrenol",
               "profile_path": null,
               "id": 1265594,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55cc0d9ac3a36856f90018de",
               "name": "Ogulcan Eren Akay",
               "profile_path": null,
               "id": 1449800,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55cc0dbc925141763c0017cf",
               "name": "Cem Ozuduru",
               "profile_path": null,
               "id": 1496322,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55cc0defc3a3685708001792",
               "name": "Ercin Sadikoglu",
               "profile_path": null,
               "id": 1496323,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 4.97691,
      "production_countries": [
         {
            "iso_3166_1": "TR",
            "name": "Turkey"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 334394,
      "vote_count": 90,
      "budget": 0,
      "overview": "Feature length version of the 2013 Turkish short film about police making a horrifying discovery in an apartment building.",
      "similar": [
         176,
         29427,
         12445,
         601,
         671,
         62213,
         54113,
         4982,
         9659,
         599,
         1573,
         44214,
         1927,
         418078,
         307663,
         9792,
         169813,
         9874,
         8285,
         382322
      ],
      "original_title": "Baskın: Karabasan",
      "runtime": 97,
      "poster_path": "/s2Roj8ZnGOvWBKBEs1NMZvtP3Vs.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [
         {
            "logo_path": "/rPnEeMwxjI6rYMGqkWqIWwIJXxi.png",
            "name": "XYZ Films",
            "id": 12142,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Film Colony",
            "id": 560,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mo Film",
            "id": 80529,
            "origin_country": ""
         }
      ],
      "release_date": "2015-12-31",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Enter a world of suffering and madness",
      "adult": false,
      "homepage": "http://www.baskinthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Can Evrenol"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Ogulcan Eren Akay",
         "Can Evrenol"
      ],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt4935418/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNDI2NzAwOTEzOV5BMl5BanBnXkFtZTgwMzMxNzI2ODE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Mehmet Cerrahoglu",
         "Görkem Kasal",
         "Ergun Kuyucu"
      ],
      "reviews": [
         "I love horror movies. I love even bad horror movies. This movie, was simply amazing. I was not expecting much, and I was not sure what a \"Turkish\" horror film would turn out to be, but it actually was pretty great. The first part of the movie sets the scene well, and we are taken on a journey of a tight-knit group of cops along their route for the night. Strange things occur throughout, finally leading up to a horrific ordeal inside what appears to be an abandoned house or chapel. The movie is very gruesome and disturbing, so for a horror fan like me that was great, but if you can't stomach it, you may need to pass. This movie was a fresh take on the word horror, the fact that it came from a Turkish studio and director does not diminish it at all but brings even more of an eeriness to it. Bravo!",
         "Baskin comes from a country for which horror genre outings are quite atypical to see. Despite not having much to compare with locally, it is clearly a passionate and well-made horror even when examined against countries that contribute to the genre much more frequently. Not terrific, but a great start to a young filmmaker's career. The film is about a set of five cops who are patrolling their neighbourhood at night. They receive a call for backup coming from a part of town associated with many fantastic and far-fetched story. Upon entering it, they find themselves in a place none other than Hell. I was quite entranced by Can Evrenol's direction, it was surprisingly confident for a first feature, daring to aim for difficult scenes and set-ups right off the bat. The opening 15 minutes in the restaurant were my favourites. They use numerous very long, very slow takes, which captured a sense of slow building dread despite the hilarious conversation going on between the cops. His flair for beauty and the abstract persists later on as well, especially in scenes where he combines multiple perceptions of reality (loved the room filling up with water). I am definitely a fan of his after seeing this movie. I do think that the first third of the film is its strongest, because oh the sense of undefined dread. Once the cops enter \"hell\", the movie is still entertaining but becomes more of a torture-porn outing, without that much story. I like the reference to the mythological hellish trials and tribulations from Greek mythology, but I would have preferred a stronger plot. The circular reference of the film kind of bothered me, because it is an extremely common trope of \"characters in limbo/hell\" movies (like House Hunting, Haunter, etc), and I would have liked to see something more original. The acting was quite fantastic for the budget. All of the cops did a great job, the likable ones managed to be truly likable, the hateable ones easily made themselves repulsive to the viewer. The physically \"unique\" actor who played the master of the hell domain was very creepy and good in his role, with zero prosthetics to boot! Great casting choice. Overall, Baskin could have used improvements in terms of storytelling, but it is absolutely worth seeing as a piece of horrific art, morbidly beautiful to watch. 7/10",
         "I went to watch this moving knowing that the best was kept for last. The final 30 minutes were promised to be filled with violence and gore. Maybe that is why it didn't bother me to \"wait\", taking the time to get to know the characters and build some anticipation for the final moments. That is also why I wasn't disappointed, as many viewers seem to have been. While I \"waited\", I was hinted by the dialogue on how to understand the horrifying last scenes, and what the Hell was going on, no pun intended. The movie leads us to several interpretations of the ending, I'll list mine below: **** SPOILERS **** **** SPOILERS **** . .. ... 1st theory: Arda was traumatized by his friend's death and dreamed the whole thing. 2nd theory: They were all a bunch of sinners (the prostitutes, the pork eating, the violence), died in a car crash and experienced eternal damnation to hell in a loop. 3rd theory: Ardra was the son of the Devil. The dream in which he hears his mother having sex refers to the night he was conceived - there is a hand pulling him from darkness, the same hand that reaches for him in the water (amniotic fluid) - his Father's hand. The master of ceremonies is \"The Father\" in the credits. Maybe Ardra's mother was impregnated by the devil (or her possessed husband), which is why they asked their friend (the Boss) to protect Ardra and keep him safe, as if they already knew he was in danger of something terrible happening to him. In the bar, the Boss asks Ardra to look further in the room, to check for a supernatural presence (The Father), which he can and does. Meaning the Boss knew there was something \"special\" about Ardra. The Boss says he's the key to the whole thing and ends up offering a key to Ardra that eventually kills The Father. This could be a metaphor to the fact that the boss knew the truth about Ardra's destiny - after using the key, he returns to his usual dream, but this time the boy in the dream is completely pulled into darkness. Also, after The Father kills the Boss, he bathes in his blood and Ardra does the exact same thing after killing Him. There are a lot of references to sex and breeding, there is even a \"woman\" giving birth to some sort of monster. So birth is a frequent reference in the movie. Frogs in dreams mean spiritual/mind transformation, so maybe that night was the transformation of Ardra into what he was supposed to be - killing the Father and becoming Him, which is why he can't leave in the end and ultimately gets hit by the van - maybe he's finally sent to Hell in the crash, while his friends survive and get on with their lives... but we can't be sure of this. ... .. . **** END SPOILERS **** **** END SPOILERS **** Baskin is an amazing movie if you want to take the time to interpret it. If not, it's just a slow burner with a gory ending. For me, it was an intelligent film that left me wondering and wanting to find out the origin of all that violence. The dialogues were smart and funny, the musical score was intense and well picked, the actors were superb, the effects were very good and the villain was unforgettable. Watch the movie while trying to create your own explanation for the gory climax, and you will absolutely love it, like I did.",
         "When I first saw this movie, I was at the Fantasy film fest and this was the last screening on the first day. I didn't expect anything and this movie just set a mark for me. This movie finally made a dark place really dark again, Since i know a lot of turkey people and know some words, I really enjoyed the conversation in this movie, cause they are quite realistic. So what I thought would turn out to a funny Turkish splatter-film, turned into a bizarre Minfuck Horrorfilm, which instantly made it in my personal Top20 of the year. I think its an movie half of the people will love, and the other half will hate it, but nonetheless a must see movie in my Opinion.",
         "If you are tired of modern horror films filled with cheap and forced jump scares constructed in a way of muting down the sounds and then throwing an explosion of loud noises in your face to try to scare you, and are rather interested in watching a film filled with tension, dreadful atmosphere, interesting characters, symbolism and pure nightmare images look no further. Baskin (aka Police Raid) is a Turkish horror film directed by Can Evrol (in his directorial debut) and is based on short horror film of the same name. Story follows a group of police officers who stumble upon a Black Mass in an abandoned building. Sure, probably not an original scenario. You might feel like you probably seen this before, but it is the approach and execution that allows this film to rise above most of today's horror films. Tension is always present in Baskin, and it's dark and dreadful atmosphere builds all around you and won't let go so closing your eyes will mean nothing but surrender. Also, instead of a group of stupid, drunk and naked teens, this time we have a group of mature, experienced police officers and seeing them being overwhelmed with terror is even more frightening. There is a scene in which one of those police officers enters a room only to behold scenery so terrifying he loses his mind and starts screaming. There were no jump scares, just genuine terror. Maybe the last 20 minutes were kinda disappointing compared to the first half of the film, but Baskin is still overall a strong horror ride. If you are not a fan of violent and gory films, better skip this one. But if you're open minded and enjoy all types of horror movies you should definitely pay a visit to this hellish nightmare.",
         "The market for international artsy horror flicks has been surprisingly lucrative in the past few years, with acclaimed films like The Babadook and Goodnight Mommy and even the American productions It Follows and The Witch. But probably the most imaginative and gory one of them all is the Turkish export, Baskin, an ultra-violent and bizarre descent into Hell with a capital \"H.\" In Baskin, a police squad is called to an abandoned building in a neighborhood surrounded by rumors and hearsay. When they enter the building, they unwittingly stumble upon a black mass intent on sending the lawmakers straight to Hell. The narrative of Baskin is a bit of a mess. At times, it's difficult to figure out how certain things connect to each other or what they represent, and I saw the ending coming from a mile away. However, the blurring between reality and fantasy is one of my favorite staples of the horror genre. I love horror movies where you're not completely sure what's real and what's not, and this one illustrated the descent into Hell in a beautifully brutal fashion. The visual aspect of Baskin certainly gives the movie an art-film quality. Director Can Evrenol makes everything from a car crash to a man's intestines being ripped out look stunning. Even if the film's internal logic is difficult to follow and the ending is predictable, Baskin is a nightmarish and inventive Turkish horror film that will give gorehounds a more cerebral torture fest than most.",
         "I'd had my eye on this movie for over a year. Constantly checking to see if, when, and where it was getting released. The first trailer for it immediately hooked me, and I needed to see this movie. Now I finally have, and I can safely say the wait was worth it. With what little reviews are even out there at this point, critics and keyboard warriors are complaining that Baskin is 'low on plot'. Hearing that as a complaint really grinds my gears. See, there are some movies that are just devoid of enough creativity to generate an interesting plot, and then there are other movies like Baskin, that are that way by design. If you don't like the movie... fine. But, it's REALLY well made. The 'low on plot' complaint gets more absurd the more I think about it because so many masterful and classic movies have threadbare plots and nobody even bats an eyelash. In fact, they praise how it does so much with so little. Where's THAT love for Baskin? Writer and director Can Evernol has crafted a wonderfully nightmarish movie that seems to understand the very fabric of a bad dream- a dream you keep trying to wake up from and can't. Baskin makes enough sense from scene to scene that you can follow the narrative as a movie, but there are enough plot threads and details that stick out to give the movie a thoroughly dreamlike quality. It dives in and out of deeper dream realms, characters deliver spooky speeches about fate and death. The camera fetishizes details that look irrelevant, so your eyes are drawn in, scouring the scene for clues or hints or something lurking in the shadows. Every scene is atmospheric and moody, giving the movie an uneasy vibe even when not much is really happening. The movie has a simple plot, but that doesn't mean it's a simple movie. It leaves a lot open to your imagination, but not in the way you might think. That concept when married to horror movies usually means that the killers or the monster isn't ever really seen, or that all the gory stuff happens off screen. Neither is true of Baskin. It lets you use your imagination when it comes to the story. There's obviously a much bigger and more complex history to the antagonists of this movie, and thinking about what that might be is just as unnerving and scary as watching them kill their victims. And, speaking of victims, by the time our protagonists, a team of five police officers, happen to stumble across their lair, an old abandoned police station- we can clearly see they've been at this for a while. This small cult has killed dozens and dozens of people in extremely brutal and ritualistic manners. Also, I've got to give props to the filmmakers for creating one of the most disturbing looking cults I've ever seen. Especially the perfect casting of the cult leader in Mehmet Cerrahoglu. Now, obviously, that name won't mean much to most audiences because this is Mehmet's first and only screen credit. But... oh my god. His performance was deeply unsettling and extremely disturbing. I can see a bright (or dark..?) future for him in horror movies. He's like a new Michael Berryman, and I say that with as much love and fondness for this genre and the actors in it as humanly possible. He stole the whole show away from the well established leads up to that point. Mehmet had dynamic and chilling on screen presence. A lot of Can Evernol's inspirations are readily apparent to genre fans. Clive Barker, Eli Roth, David Lynch, and Nicolas Winding Refn- to name just a few. He manages to blend an eerie Euro art-house vibe with a hardcore splatter flick vibe. Actually, no- scratch that. He doesn't blend them- he does something a lot riskier. The first half of the movie is eerie Euro art-house cinema, and the second half of the movie smashes in, rubbing our faces in the anxiety inducing, gross- out, extreme gore, of your (above) average splatter flick. Baskin might not be the bloodiest or most insane movie ever, but just because I- as a genre fan, am jaded as hell, doesn't mean I can't recognize it for the demented and wild ride that it is. It's a sick and haunting movie that is more concerned with moods and instantly disturbing imagery than it is with backstory and plotting. The necessary story bits are told through the characters and their interactions, and that was fine to me. I liked that aspect of the movie. Baskin succeeds overall, but excels in leaving you with memorable images of things the average person wouldn't ever want to see, let alone have it stuck in their head. Baskin doesn't look cheap, or low budget. It's immersive and gritty, and it's readily apparent flaws can be chalked up to differing tastes and opinions. Some people like more plot-heavy horror movies, so obviously they might be let down by Baskin a bit, but that doesn't mean it's thin plot is a flaw. In retrospect, the movie does feel rather small. It only really has three locations, a restaurant, a highway, and the old not-so-abandoned police station. What makes it feel small is how little actually happens in each location. The movie milks each second it can out of every setting it has, and it's surprisingly effective. In lesser hands, this movie would've been an absolute misfire. But, as is, it's a slick and well made piece of gore-splatter cinema. It's moody cinematography, vibrant colors, and synth heavy score bring to mind an extra bloody and Satanic spun Wrong Turn by way of Nicolas Winding Refn. I couldn't say that like it's a bad thing even if I tried. Baskin is destined for overnight cult status, and genre immortality. I loved it.",
         "If \"being a good horror movie\" was purely a matter of inserting cruel images, nightmarish scenery and petrifying characters in your movie, then \"Baskin\" inarguably was one of the greatest horror masterpieces of the past 2-3 decades. This film is literally chock- full of grueling gore and the decors are so disturbing that viewers with a weak stomach won't even be able to digest them. Unfortunately, however, \"being a good horror movie\" is also about a solid script, originality, a coherent structure and a minimum of empathy with the lead characters. These are all elements that I missed in \"Baskin\" and which prevent me from labeling as a true genre delight. What remains is nevertheless a more than remarkable and grotesquely violent horror movie from Turkey. This country has a rather bizarre tradition when it comes to making horror/cult movies. During the 70s and 80s they mostly just made shameless and unintentionally hilarious imitations of famous blockbuster, like \"Turkish Superman\" or \"Seytan\" (a blatant copy of \"The Exorcist\"), but since a few years there's a new generation of Turkish horror directors and at least they want to uplift the quality level of their national horror cinema a bit. The protagonists in \"Baskin\" are five police officers and, I don't know whether it was director/co- writer Can Evrenol's intention or not, but the film doesn't exactly draw a positive image of the Turkish authority figures. They're sitting in a filthy roadside diner, telling vulgar stories about their meeting with (male) prostitutes to each other and collectively harass a young waiter. Kind of like Joe Pesci did in \"Goodfellas\"; they pick on a poor sucker because he dared to laugh with their stories even though he wasn't invited at the table to laugh. A few moments later they decide that the physically ill person of the bunch can drive the van and they have a little karaoke party in their service vehicle. Doesn't really encourage you to trust the Turkish police, now does it? They subsequently receive a vague radio report that leads them to an abandoned mansion where a satanic sect is in the middle of holding a black mass. The high-priest is excessively cruel in his execution rituals, but there also seems to be a link between the events here and the recurring nightmares of the youngest cop Arda. I've read a review on \"Baskin\" that described the film like a compound between the narrative styles of David Lynch and Rob Zombie. The comparison definitely makes sense, although our pal Can Evrenol is not (yet) as skilled and experienced as those two. Many, many sequences are truly sickening to watch, with explicit footage of eye-stabbings, slit throats and cut open stomachs. One last thing I simply have to mention - and genuinely applaud – is the terrific casting work! Particularly the supportive roles are masterfully cast; most notable two actors with faces that were seemingly made to have a career in horror cinema (although this may come across as very disrespectful because they both obviously suffer from a physical condition that makes them look that way). Mehmet Cerrahoglu depicts the high-priest and he's the kind of actor who only looks scarier from the moment he removes his mask. The other actor is named Seyithan Özdemir and he is credited as \"giant man/frog hunter\". He instantly reminded me of 1940s actor/horror icon Rondo Hatton! I would strongly advise Mr. Özdemir to pick up a few words of English and purchase a plane ticket to Hollywood, as he can surely make it big in Hollywood with a mug like that.",
         "A solid horror film from Turkey, Baskin tells the existential story of some young police on patrol. The atmosphere in the first half of the film was one of dread and tension stoked to nearly psychedelic heights. While the first and second halves of this movie look different from one another, there is continuity and the narrative is mostly linear. Not only does it make sense, it is superbly acted and directed, with shades of Clive Barker. Fans of Hellraiser, Candyman, Nightbreed, or any of his other titles will probably enjoy this film. Use of lighting, daring casting, and practical effects create a horrific atmosphere toward the end. I thought the story paid particular attention to the behavior of evil spirits, and that made it all the more fun. Good stuff!!!",
         "I saw the premise of the film and was interested. Adding to my interest was the fact that the film was foreign. I was curious what a Turkish horror movie would look like. The movie starts out with an amazing film score that sets this tone for an early 80s euro giallo style. It takes a while for the Horror to begin as we watch a group of cops go through some strange events before the real deal goes down. And when the horror sneaks up to ya, it's very freaky and deranged, almost torture porn like. It made me squirm in my seat. I must admit that overall I thought the movie was far too corny. It could be the culture gap, or it could be the Tarantino like built up to the horror with a lot of dialog, that may have been more interesting in the native language. Can't really say that I like it all that much, though it made me uncomfortable, it was not in a scary way.",
         "So, after long anticipation Baskin (Raid) delivers, to an extent. It could be divided into at least two sections but none of it matters much cause director clearly intended to use a slim story of 5 policemen on call as an excuse to thread the torture ground and expose hell, or his vision of it. Only, it's not entirely his, cause the body horror, torture and the whole lot has been covered a few times already. Turkish horror deals with religious themes mostly, exorcism and possession. This time it gets to be gory, bloody and more violent and that's what places Baskin in different category and offers some fresh material and worthy entry to their cinematography. We get to meet group of less-than-sophisticated men in the local restaurant talking about football and sex, picking fights with poor unsuspected waiter. But then, they got a call and head to check out the given address, not many details and not much to go on...long story short, they end up in some sort of a hell or limbo, with strange creatures, mutants, torture devices, flesh eaters etc. Here's where elaborate conversation from the beginning gets a bit broken and reality gets divided into two realms, the parallel reality if you will. Not a big fan of those myself, but demons and hellish torture, floating in and out of reality usually exist so they can teach the characters involved some lessons? Not here, mostly it is torture for torture's sake, by a little, disfigured person, a master (without pins and needles). A Father, or whatever, is a sort of a Pinhead figure here but there's hardly any point to his lessons or hardly any sin to be punished...I honestly didn't see the higher purpose to this inferno. And that is a bit of a problem, the visual part and direction are quite satisfactory but not much actual story or 'point' to back it up. So, it did feel a bit bizarre and random, although so was Demons('85) for example, and people still love it! However, as a directorial debut it was rather nice an effort, director's heart was in the right place, you could tell it was made by a horror fan with all the right role models in mind. Props for that, and I certainly am looking forward to future films of his.",
         "The movie starts out really well with the amusing police singing in their van and what appears to be the main character having curious flashbacks and I was waiting to find out what it was all about, but it never comes through. The gore is fantastic certainly and the visuals creepy, disgusting and realistic. The movie keeps you watching in hopes of giving you an idea of why the main character is special. It did its job of making me want to know what was going on, but left me really disappointed. In fact the ending is a horror movie cliché done badly. Who are these people that give out good reviews to crap films?",
         "Baskin is a surreal hear-trip invitation to a black mass. What starts as an atmospheric cop thriller, set in some backwoods Turkish town most definitely doesn't end that way. I couldn't tell you what exactly this movie was on about; it becomes a back and forth between two different plot strands that incoherently come together to signify nothing, not just in terms of meaning but also in tension, drama or audience engagement. But it doesn't matter as much as you may think. This film has its own unique aura, one that can't be denied, and it makes you feel you've witnessed something that you shouldn't have. There is some truly twisted stuff in this film, some of it probably a tad too much (not in terms of good taste but in a comical form of one-upmanship with itself). Mad props to the best horror heavy of the year, motherf***ing Mehmet Cerrahoglu as Baba. May he haunt every child's nightmares for the entirety of their formative lives.",
         "Holy mother of the cosmos what the f*** was that? I went into this not knowing anything other than it was a Turkish horror with a low score on IMDb and no expectations and I was put through the grinder in the most pleasant way possible. This is a truly terrifying ride. I was drawn in from the opening act, there was no warm up period at all. It sets the tone and is pretty creepy, couple tense scenes gave me goose-bumps. The acting is great and seems very organic. There was literally no scene from anyone where the acting felt unnatural or forced which is a rare treat especially in the horror genre. In the pits of hell with the goblin looking fellow, it becomes uncomfortably dark and it is fantastic. I was watching it alone in the dark with a candle in the distance, when I got up to go pee I had to turn the bathroom light on, which normally I wouldn't do. I'm a grown ass man. When the goblin is dropping Darwinian science in the midst of sacrifices, everything he says oddly resonated and left a feeling of despair in my stomach. Had me questioning my own mortality and my inevitable fait. Man dying is gonna suck. I just want to curl up in bed with a bag of candies and watch some comedy for a couple hours. Very unexpected and amazing movie in my opinion. I found it to be multi-layered and oddly thought provoking in a very sinister way. What the hell is a 5.7 rating about? If you watch a horror movie willingly and aren't expecting or HOPING for something disturbing, provoking and or traumatizing, then you might be confused. Stick to what works for you and quit messing up the scoring system. If you are seeking quality horror in it's purest form, then check this out.",
         "I've rated this movie 5 stars and not 4 because it is Turkish, they tried something, and I compared it to a movie that lacks the possibilities of a Hollywood production. I'm going to start with the main problem here. The movie as the director himself said, has a lot of parts that \"were made to look cool\"! Yes, you got that right, there was no real meaning behind every scene, some of them were thrown there to shock, to surprise, to disgust, to look uber tough! And we can't really have that now can we? I mean if you're going for something, either go full in or go home. Other problem consists on the plot itself, because it tries to stay together, but has some parts that can't be tied to the rest of the movie. And that seriously doesn't look good at all, because instead of focusing on getting some closure and offering a decent end, they chose to find more ways to \"look cool\" on screen. But all in all, the acting is good, the soundtrack is lovely, the camera is OK, for a horror fan, this one gets close to a good result. It's a shame that they didn't try just a little bit harder. Cheers!",
         "I've seen quite a few good reviews for this film but clearly I think people saw a different film than what I witnessed on my in home movie night. This film is sloppily put together with an undeveloped story line and characters with no background. I'm not sure where this film was going. I didn't give this film 1 star because those of us who do enjoy a good bit of gore its great but for what it lacks in its story cannot be made up by a film splashes of blood here and there. Not worth the watch. try it out if you feel so compelled but you will be disappointed.",
         "It was really complicated to get access to this film and really, the trailer looked awesome. I love the Babadook movie and was wishing for the same creepy feeling of horror you felt when you were young. But this movie just walk around in circle and nothing happens. Basically, you follow five cops that you don't really like (no attachment are made so that they are likable). They go to a creepy place at night and get sequestrated by a satanic cult. Basically, they all die and you really don't care. There's is really no story and this kind of movie could last only 15minutes really. I was disappointed. The big satanic boss is a dwarf and not scary at all. No originality. I was bored bored bored. I don't recommend it. Watch Babadook again instead.",
         "Baskin is a fairly new Turkish horror film from director Can Evrenol, it is his first feature film and it is based on a short he did in 2013 of the same name. The film follows 5 police officers who are just finishing up their shift when they receive a call on their radio requesting back up at an old abandoned police station. On the way to their destination the police officers crash their van and from there pretty much all hell breaks loose. My major complaint with Baskin would be it's pacing, the first 50 minutes or so are rather dull, there are a few redeeming scenes however for the most part the first half of the movie is uneventful filler. They kind of make an attempt to get you attached to the characters but none of them are really that likable to be honest. This is something that is present in a lot of horror movies, a dull first half that leads up to an exciting finale. I have never been a fan of this style of pacing, some would say it's a way to build tension but in my opinion it just seems like an easy way to eat up film time with cheap easy to shoot scenes. So after quite a bit of dullness the police officers finally arrive at the abandoned police station, from here the film does a complete 180, the boring filler scenes are replaced with scenes of chaos and gore. The film does a good job of making this abandoned police station really feel like a living hell, and it actually made me feel a sense of dread for the characters experiencing this nightmare. Pretty much all the scenes in the police station are done very well, costume design on the baddies is cool, gore looks real enough, and the main bad guy is fairly creepy and interesting. The only problem during this portion of the film is that they keep cutting away from the chaos to these dream scenes (I guess that is what they are, it's never fully explained), and that really kind of kills the chaotic mood of the second half. Overall Baskin is a mixed bag, the second half is pretty insane and should please most horror junkies/gore hounds, but some may be deterred by the slow humdrum first half. Still I would suggest checking it out for the last half alone.",
         "You know the golden rule of shooting a movie? If a scene does not move the story forward or give detail about the character, it shouldn't be in the movie. Apparently no one told this guy anything about this so, he just decided to throw some scenes here and there that has nothing to do with the story. Well,actually there is no coherent story which is the other problem of this mess. Basically, a few police officers respond to a dispatch call to find out that the village they are going is somewhere wicked. They bump things in the night etc etc. After one hour thirty minutes, you realize that the ending is not only terrible, it is also extremely cliché. Gore fans however will feel right at home because of some disturbing scenes, though they are nothing special nor haven't been seen before. I would strongly suggest to pass this one, unless you want to end up with anger and disappointment in the end. Can Evrenol, please don't rip off from Hills Have Eyes again and stop using the hell out of blue filter just because it is a horror movie. Being a good director requires a lot more than that. 1/10 Awful. Stay away.",
         "A twisted, surreal & nightmarish journey into the bottomless depths of hell, Baskin is an extremely disturbing, utterly unusual & overly ambitious tale that feels like something that came straight out of the abyss and, thanks to its stomach-churning violence & gore as well as multitudes of themes & symbolisms, it isn't an easy film to decipher in one sitting. The story of Baskin follows a squad of five police officers who, after dining in a restaurant, receive a distress call from a nearby town and head there to investigate the issue. But once they reach the crime scene, an abandoned building that used to be a police station during the Ottoman era, they find themselves inexplicably trapped in a world of madness & suffering. Co-written & directed by Can Evrenol in what is his feature film debut, Baskin is adapted from his short film of the same name and is one phantasmagorical ride from start to finish that's as bizarre as it is bewildering. The plot is filled with flashbacks & dream sequences and in between lies some real nasty stuff as well that's definitely not for the easily-distressed. Each frame of it is instilled with a foreboding sense of doom and its dilapidated sets, sophisticated yet eerie camera-work, shaded colour tones, steady pace & stimulating score, all contribute greatly in enhancing its overall impact, and is all the more amplified by the gruesome brutality that Evrenol puts on the screen, for the level of violence that's on display here is absolutely sickening. Performances are good even if the characters aren't that well-defined. More than individual inputs, it's the chemistry between the five actors that makes their characters believable. But nobody even holds a candle to the performance that comes later in the story from a first-time actor. Playing the antagonist, Mehmet Cerrahoglu chips in with a show-stealing work and makes for one intimidating villain. On an overall scale, Baskin is one of the most shocking, disturbing & emotionally upsetting films of the year that's drenched in dread, revels in suffering & bathes in body horror. The labyrinth-like structure of its plot does go over the head sometimes but there is still an intriguing quality to it that keeps the interest alive until the very end. A convoluted mess but also an undeniably powerful experience, this Turkish horror about five cops who inadvertently wander into hell isn't for everyone. Enter at your own risk.",
         "Whoever criticises this movie under the assumption that it is too slow, or that the plot lacks internal consistency, is clearly illiterate when it comes to the horror genre. The cinematography is heavily inspired by classic Italian horror icon Mario Bava, the building setting is reminiscent of Argento, while he was still alive, artistically speaking, and Fulci, and cannot easily be erased from memory, especially given how the director chooses to represent the black mass cultists as a sort of orgiastic congregation of zombies. Besides the whole concept of the movie could be seen as a mixture of John Carpenter's \"Assault on Precint 13\" and \"Prince of Darkness\". To sum up, if you haven't seen anyone of the movies quoted above, please do not write negative reviews for the best horror flick of the decade, it only shows your illiteracy.",
         "First and foremost. The few times you could actually see the \"gore\" in this movie, then it was good. For the rest. Worthless. I would assume this is an \"art\" movie but for me, who just want a good horror movie: Big no-no. The story is confusing, there are tons and tons of questions that you don't get an answer to. The building is extremely long without anything real happening and the acting are not worth debating when compared to \"real\" movies. I am alittle satisfied that you get quite some time to actually see the villain, and try to understand his/hers (to avoid spoilers) character, and not just have it as a dark figure in 0.5 seconds clips. At the same time that raises a lot of questions to why the villain does as he does, et cetera. All in all: Waste of time.",
         "BASKIN is a much-lauded Turkish horror film about a squad of cops who face a literal descent into purgatory when they answer a call for help in an abandoned house. On arrival they venture into the subterranean depths to find themselves menaced by a psychotic father figure who controls an army of sub-humanoids. Have the cops entered into hell itself or are they merely at the behest of a very human psycho? Don't go looking for many answers in this rather ambiguous and low budget slice of film-making. It's a deliberately arty film which is short on answers and long on questions, playing with the narrative structure at times to mess up the viewer's head. Sadly, the sum is rather less than some of the more interesting parts, particularly as this is a straight gore fest with little wit or insight to it. The first hour is a dullish bore in which the viewer must endure the company of some particularly moronic and unlikeable characters, while the last half hours turns into torture porn with some good effects and a largely repellent tone. I found it brutish and predictable, and hardly worth the bother.",
         "I have seen flicks coming out of Turkey that I thought, what the hell, they can make great flicks too and I can say that this one here can be listed under excellent horror flick. Of course it's spoken in Turkish so some can be turned off by that but for me that's not a problem. There are UK subs available when this is shown at the festivals nowadays. Even as it all starts slowly it's a flick that will grab you by your throat because it slowly turns into a flick that delivers creepy and gory moments. I should compare it with The Hills Have Eyes (1977) and Borderland (2007). Because what should be an easy back up for the cops involved turns into a nightmare but there's more going on. And being left with a lot of questions in the beginning it all reveals itself toward the end. And it's beautifully merged throughout the script. On part of the effects they are great too even as there aren't that many still it do has nasty gory moments. But it's the abandoned house that will reveal the horror. A must see for those seeking a typical blockbuster horrors but a straight in your face flick. But said before, you have to sit a slow first 30 minutes especially in the restaurant. It doesn't show where it's going, may that be the strength of this Turkish delight. Gore 2/5 Nudity 0,5/5 Effects 3/5 Story 3/5 Comedy 0/5",
         "Baskin is really terrifying from the beginning to the end. Psychological horror elements were set intelligently to assist its atmosphere. I was very surprised to see a different kind of horror movie since Turkish horror movie industry was always focusing on that genie topic. Its a brave movie that can change your perception of the hell. It is disturbing the audience by cannibalism, gory-porn and demonic ritual influences. Also it presents one of the best OST album in horror movie genre. I think Baskin catches that deep-immersing atmosphere thanks to its soundtrack. They are well made and perfectly integrates within the story. Can Evrenol is a must-follow director if you're a horror movie fan."
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Film Colony",
         "Mo Film",
         "XYZ Films"
      ],
      "summaries": ["A squad of unsuspecting cops go through a trapdoor to Hell when they stumble upon a Black Mass in an abandoned building."],
      "budget": 0
   },
   "movielensId": 144224,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2015-12-31",
      "dvdReleaseDate": null,
      "directors": ["Can Evrenol"],
      "runtime": 97,
      "movieId": 144224,
      "title": "Baskin",
      "mpaa": "",
      "actors": [
         "Muharrem Bayrak",
         "Mehmet Cerrahoglu",
         "Mehmet Faith Dokgoz",
         "Gorkem Kasal",
         "Ergun Kuyucu",
         "Sabahattin Yakut",
         "Şevket Süha Tezel"
      ],
      "imdbMovieId": "4935418",
      "originalTitle": "Baskin",
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": ["y9SfWmXQY3o"],
      "plotSummary": "Feature length version of the 2013 Turkish short film about police making a horrifying discovery in an apartment building.",
      "tmdbMovieId": 334394,
      "avgRating": 2.95455,
      "releaseYear": "2015",
      "numRatings": 55,
      "posterPath": "/s2Roj8ZnGOvWBKBEs1NMZvtP3Vs.jpg"
   }
}