{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "secret mission",
            "id": 3269
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "bullying",
            "id": 6733
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "motorcycle",
            "id": 14735
         },
         {
            "name": "government assassin",
            "id": 41336
         },
         {
            "name": "north korean",
            "id": 41344
         },
         {
            "name": "north korea",
            "id": 158538
         }
      ],
      "imdb_id": "tt3144098",
      "video": false,
      "title": "Commitment",
      "recommendations": [
         257568,
         32213,
         13311,
         32163,
         32150,
         269340,
         281298,
         180651,
         50458,
         35851,
         280612,
         253775,
         37850,
         128842,
         82469,
         29977,
         77504,
         68252,
         81460,
         248376
      ],
      "backdrop_path": "/d7f8PBLKSqeyjyraG1XIfixWgFm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ri Myung-hoon/Kang Dae-ho",
               "gender": 2,
               "credit_id": "52fe4e4ec3a36847f82892b5",
               "name": "Choi Seung-Hyun",
               "profile_path": "/9rkMgFBvgQEfJxwpYLbivIvfZnv.jpg",
               "id": 80981,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lee Hye-in",
               "gender": 1,
               "credit_id": "52fe4e4ec3a36847f82892b9",
               "name": "Han Ye-ri",
               "profile_path": "/49R6IcNF2nQBHlMQRrWFHQVqE3n.jpg",
               "id": 1057068,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cha Jeong-min",
               "gender": 2,
               "credit_id": "52fe4e4ec3a36847f82892bd",
               "name": "Yoon Je-moon",
               "profile_path": "/3IIcZsGsgwv1hqsyGx2rx8JNPOA.jpg",
               "id": 141541,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Moon Sang-cheol",
               "gender": 2,
               "credit_id": "52fe4e4ec3a36847f82892c1",
               "name": "Cho Seong-ha",
               "profile_path": "/e79fd8q8tHBFal9BG7LBzaF6szk.jpg",
               "id": 551171,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ri Hye-in",
               "gender": 1,
               "credit_id": "52fe4e4ec3a36847f82892c5",
               "name": "Kim Yoo-jung",
               "profile_path": "/97tbdGKO5vZowDyR3sRiZUK3lpQ.jpg",
               "id": 140335,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "North Korean Spy - Granny",
               "gender": 1,
               "credit_id": "52fe4e4ec3a36847f82892c9",
               "name": "Lee Joo-sil",
               "profile_path": "/2MUDMgopRnLC4r6BveLj4Wgn7m3.jpg",
               "id": 138525,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "North Korean Spy",
               "gender": 1,
               "credit_id": "52fe4e4ec3a36847f82892cd",
               "name": "Kim Sun-Kyung",
               "profile_path": "/gGnJLGRMihMsEpUhOzBmxTEXsEP.jpg",
               "id": 1086309,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Big Dipper",
               "gender": 0,
               "credit_id": "52fe4e4ec3a36847f82892d1",
               "name": "Jung Ho-Bin",
               "profile_path": "/wHDabbTRxlaJRNDebyvmWYL79vk.jpg",
               "id": 63444,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "North Korean Liaison",
               "gender": 2,
               "credit_id": "52fe4e4ec3a36847f82892d5",
               "name": "Kim Min-jae",
               "profile_path": "/p9KXHTwC9NLLfOqxt5NlpIDzmy4.jpg",
               "id": 573792,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Myung-hoon's Father",
               "gender": 2,
               "credit_id": "52fe4e4ec3a36847f82892d9",
               "name": "Park Sung-woong",
               "profile_path": "/2WSKE6iUouA3nV3P7EmRvPIaeHO.jpg",
               "id": 139493,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "waffle store part time worker",
               "gender": 0,
               "credit_id": "559d79cd925141251b00039f",
               "name": "Kang Han-Na",
               "profile_path": "/eGgpGcSXACT0oTcW5lwxQm7JfVc.jpg",
               "id": 1311803,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Kim Sun-myung",
               "gender": 2,
               "credit_id": "5675587192514179dd002847",
               "name": "Yoo Jae-myeong",
               "profile_path": "/d3B1RYJGNazodAX88KdsNg22dEB.jpg",
               "id": 1336804,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57a95a3dc3a368726300233c",
               "name": "Kim Jae-beom",
               "profile_path": null,
               "id": 38016,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57a95b63c3a368733b002501",
               "name": "Kim Sang-beom",
               "profile_path": null,
               "id": 10108,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e4ec3a36847f82892b1",
               "name": "Park Hong-soo",
               "profile_path": null,
               "id": 1276241,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e4ec3a36847f82892df",
               "name": "Sooyoung Kim",
               "profile_path": null,
               "id": 1281534,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e4ec3a36847f82892e5",
               "name": "Park Hong-soo",
               "profile_path": null,
               "id": 1276241,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53414c00c3a368151e0019de",
               "name": "Lee Seong-hun",
               "profile_path": null,
               "id": 1296336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53414c3ac3a36815170019b1",
               "name": "Kim Gi-tae",
               "profile_path": null,
               "id": 1099788,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53414c47c3a368152f001b18",
               "name": "Park Hui-joo",
               "profile_path": null,
               "id": 1296465,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53414c80c3a368152f001b20",
               "name": "Gyeongseok Kim",
               "profile_path": null,
               "id": 1295401,
               "department": "Crew",
               "job": "Lighting Camera"
            },
            {
               "gender": 0,
               "credit_id": "53414cccc3a368150f001a7a",
               "name": "Hyeongu No",
               "profile_path": null,
               "id": 1294776,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "53414d9a0e0a2679a700211e",
               "name": "Jaejun Choe",
               "profile_path": null,
               "id": 1307593,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53414dc6c3a368151e001a18",
               "name": "Sojeong Jin",
               "profile_path": null,
               "id": 1307594,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.892222,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 235704,
      "vote_count": 55,
      "budget": 0,
      "overview": "The son of a North Korean spy decides to follow in his father's footsteps to protect his little sister. After his father’s botched espionage mission, North Korean Myung-hoon and his young sister Hye-in are sent to a labor prison camp. In order to save his sister’s life, Myung-hoon volunteers to become a spy and infiltrates the South as a teenage defector. While attending high school in the South, he meets another girl named Hye-in, and rescues her when she comes under attack. South Korean Intelligence soon discover Myung-hoon’s activities and begin tracking him, all the while his own government sends a vicious assassin to eliminate him.",
      "similar": [
         238636,
         133805,
         49021,
         49797,
         36599,
         8456,
         1948,
         101,
         2503,
         681,
         956,
         156022,
         281957,
         59967,
         10017,
         3597,
         12619,
         241848,
         445954,
         21484
      ],
      "original_title": "동창생",
      "runtime": 113,
      "poster_path": "/hNBuJ4ucaYvDcnWxtKCq65t5fft.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lamp, The",
            "id": 21170,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Fish Pictures",
            "id": 21171,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Showbox Entertainment",
            "id": 11420,
            "origin_country": ""
         }
      ],
      "release_date": "2013-11-05",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hong-soo Park"],
      "runtime": 113,
      "synopsis": null,
      "writers": ["Soo-young Kim"],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt3144098/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODIzNzcyMTQ0Nl5BMl5BanBnXkFtZTgwNzg4ODI3MDE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Seung-hyun Choi",
         "Ye-ri Han",
         "Je-mun Yun"
      ],
      "reviews": [
         "Commitment is a spy drama that takes place during the change of guard in North Korea where forces in the North are jockeying with forces in the South. Into this struggle, the son of a murdered spy is recruited to go to South Korea as an assassin, his reward being that upon the successful completion of his mission he will be reunited with his sister. The acting is uniformly good, especially from Seung Hyun Choi as the spy, Ye-ri Han as the girl he meets, and Park Ji-Il as the South Korean agent who hunts him down. Most of these actors will be unfamiliar to U.S. audiences. In recent years Korean films have been able to master the art of action sequences - \"OldBoy\" (2003), \"The Chaser\" (2008), \"Bittersweet Life\" (2005), \"The Man from Nowhere\" (2010). The current film does well, but at the heart of an action film one must believe that the hero is capable of performing the feats ascribed to him. In this case, it's only partially true. Neither by dint of his own physicality, nor the back story, are we able to believe that Seung Hyun Choi is capable of the martial arts skills he displays. In fairness to Choi , he does do OK, so it's not a question of disbelief, but neither is there an unquestioning acceptance. Apart from some good action sequences, the film is an interesting travelogue about life in South Korea, as well as a look at police work in that Country.",
         "Commitment is a tense thriller, mixed together with the young espionage and love story. Myung-hoon (Seung Hyun Choi) is the son of a North Korean spy who has been killed on the job in South Korea. Myung-hoon and his younger sister are trapped in the North Korean camp and will get the freedom only if he becomes a spy himself. He is now trained and has been sent to a South Korean school as a high school student. He befriends a girl in his class who is being bullied by a group of students. After all He understands that his own country is trying to eliminate him and now he has to save his sister and new friend as a commitment. He is committed to protect his sister and friend even at the cost of his life. Seung Hyun Choi delivers an exceptional performance with gritty facial expressions and body language. His character remains as powerful as it is writing for him. We see guns, explosions, martial arts and good action sequences laced with a fantastic espionage genre. However, the love story seems a bit clichéd but it has been managed with somewhat skill as it never goes over the top. The dirty political between North and South Korea, introduces the plot but has been left aside midway, you may feel the requirement of some more implications. In a nutshell, it is a real treat for Asian action thrillers, this is a definite must see film. You will enjoy the quick and perfect action sequences. My Vote 7.2/10",
         "While this movie has not as much impact as other Korean action movies, this still has quite a lot of punches in it. The movie itself stars with one big punch that hangs over the movie the whole time. It's about suppression and blackmail and it is about the late North Korean dictator too. But some of it is just facade. There are motives to some of the characters that come off as clichés and you'd be excused if you didn't like this because of that. But look beyond that and you'll see a more than decent action movies. The action stunts are really good. The main character could have a bit more flavor though and some story strains get left behind to get to the whole picture. Good, but not great then",
         "After his father is killed by South Korean security police, his teenage son, \"Ri Myung-hoon\" (Seung Hyun Choi) and daughter \"Ri Hye-in\" (Yoo-Jeong Kim) are sent to a North Korean concentration camp as punishment for their father's failed mission. At least that's what they are told. The real reason behind their imprisonment is to entice Ri Myung-hoon into volunteering for a highly classified mission in which he is to assassinate North Korean agents working in the South but under a rival official. Naturally, he isn't told anything but what he needs to know and since his sister's life depends on him he doesn't ask any questions. However, upon getting into South Korea he is then instructed to assume the identity of a high school student and this makes his mission even more difficult. Now rather than reveal any more of this film I will just say that I thoroughly enjoyed the political intrigue and accompanying drama. Although Seung Hyun Choi looked a bit too old for a high school student he still managed to perform in an excellent manner as did Ye-ri Han (as \"Lee Hye-in\") to a lesser degree. In any case, as anyone who has been to South Korea surely knows, the North Korean mindset is more than a little fanatical and this movie manages to capture it pretty well. That's not to say that this movie is totally realistic because it isn't. But it's still enjoyable all the same. I have rated the film accordingly. Above average.",
         "Movie: Commitment (15) Rating: 4/5 I didn't know about this film until I found that it was dubbed in Hindi. I saw it and found it to be unexpectedly good as most South Korean action thrillers are. COMMITMENT doesn't add anything new to the genre but provides a pretty great deal of action packed entertainment with a good portrayal of human emotions and relations, though the emotions slightly falter towards the end. Choi Seung-hyun is good in his role. This is his first film I've seen. Other actors too were good. The screenplay is decent, and there are a lot of impressive moments throughout the film. The action scenes and visuals are amazing, as is the cinematography. Editing is fine. Besides, COMMITMENT also has a great portrayal of emotions throughout. The story being realistic helps to connect to the characters and feel their pain. The heartwarming brother-sister relation is brought out very well. Full marks to the director for utilising and extracting great performances from his actors. However, the film falters in the end. The climax was a good one but the emotions didn't come out well. It's only here that it's hard to feel for the characters, otherwise there's not a single scene where you won't. But that being a minor flaw doesn't affect the film's entertainment quotient, and due to that I recommend watching COMMITMENT.",
         "The son and daughter of a falsely-accused North Korean traitor are imprisoned for their father's crime; one day, the son is given the chance to not only earn their freedom, but to erase the stain on their family name by becoming a spy. Sparing us the needless training scenes, our anti-hero enters the South, the Republic of Korea, as a refugee, where he is \"adopted\" by North Korean handlers (despite being an adult) and sent to school. Okay, so I've no idea at what age Koreans leave school, but this seemed weird... but not as weird as teachers bullying pupils with a wooden cane before leaving them unsupervised. Still, carry on... The lead soon develops an attachment with a classmate, and even though there's never any romance per se, there is a genuine chemistry, which makes their relationship feel more meaningful than just two horny teens bonking. And this is important, because we already know she'll most likely be kidnapped - but certainly used against him - later on by his enemies. This is an action flick, after all. But what's this? As our spy sets about his duty, a rival faction's bumping his fellow spies off as a major player seeks to usurp power in the North. Yeah, I really liked this part of the plot, just as I really liked how our young spy understood none of it, being naive to the ways of the world. Anyway, the story twists and turns, there are shoot outs, plenty of kick-arse fights scenes and then we get to the ending, which is either going to be the typical Hollywood ending (the hero rides off into the sunset with the girl) or the typical Korean one (i.e. everybody dies), because so far, the film hasn't broken any seriously new ground to elevate it beyond being a merely good action-thriller. And South Korea knocks them out by the dozen. So, if you're new to Korean cinema, you'll likely love this flick, but for fans who have seen it all before, there's really not enough here to recommend, even though it is very enjoyable while it lasts.",
         "Fans of well-written stories and interesting spy/espionage films (similar in nature to the Bourne Trilogy) coupled with competent, convincing acting, smart direction, and sharp (but not dizzying) action editing should really appreciate this film. The character development unfolds in a manner that draws the viewer close enough to care for the 19 year-old North Korean spy (brilliantly played by Seung Hyun Choi) as well as several other characters who convincingly convey deep emotions with economical use of dialogue, non-verbal expression, and relatively limited screen time. The action film includes a balancing dose of drama by placing an equal emphasis upon character development; and, the story also gives the talented actors an opportunity to emote some cultural insight related to the feelings and hardships associated with the political division of a culturally homogeneous North and South Korea. I look forward to future films written by Kim Soo-young, directed by Hong-soo Park as well as films that include the young, talented actor Seung Hyun Choi.",
         "Cool is all this movie is, and I don't mean that in a completely positive way either. This movie suffers from what made \"71: Into the Fire\" lacking in substance. It has some action sequences with good enough choreography but underneath it all, there just isn't much. This movie tries to attract younger audiences with the main characters being in high school and with the main protagonist constantly trying to act cool. Which is fine, since it worked in \"The Man From Nowhere\" but just doesn't really work here. Sure there are parts with characters getting all emotional and all, but it doesn't pierce the audiences. The way it's developed I just couldn't care for the protagonist and his situation. The martial arts sequences are alright but that is all that is going for this movie, which is fine if it's main focus is the martial arts but that isn't the case either. It tries to integrate a thrilling and gripping story, but fails. I may get some heat from T.O.P fan girls but the guy can't act and I just couldn't believe that a scrawny skinny guy like him is able to beat the crap out of people by slapping the around. He does his trademark look of looking oblivious until another fight scene starts. I know this is to show the characters innocence which he tries to do with every show and movie he is in but it gets tiresome. His stage performance as a rapper is fierce and cool though. I am fine with him wearing make up on stage as a rapper, but he freaking wears eyeliner in some scenes where he plays the action hero in a movie. Which does not work for me, no matter how big the pretty boy trend is in Korea. I just couldn't take him seriously. Anyways when it comes to the action sequences, they are far between and when it tries to focus on the story without the action it gets boring real easily and seems to drag without much interest development. Even the climax wasn't much, it's a forgettable movie overall and I think it just stood out in Korea because T.O.P is a popular entertainer. 5.5/10"
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "CJ Entertainment",
         "Lamp, The",
         "Golden Fish Pictures"
      ],
      "summaries": [
         "After his father's botched espionage mission, North Korean Myung-hoon and his young sister Hye-in are sent to a labor prison camp. In order to save his sister's life, Myung-hoon \"volunteers\" to become a spy and infiltrates the South as a teenage defector. While attending high school in the South (his cover), he meets another girl named Hye-in and rescues her when she comes under attack by school bullies. South Korean Intelligence soon discovers Myung-hoon's activities and begins tracking him, all the while as his own government sends a vicious assassin to eliminate him.",
         "The son of a North Korean spy decides to follow in his father's footsteps to protect his little sister."
      ],
      "budget": 0
   },
   "movielensId": 144302,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2013-11-05",
      "dvdReleaseDate": null,
      "directors": ["Park Hong-soo"],
      "runtime": 113,
      "movieId": 144302,
      "title": "Commitment",
      "mpaa": null,
      "actors": [
         "Choi Seung-Hyun",
         "Han Ye-ri",
         "Yoon Je-moon",
         "Cho Seong-ha",
         "Kim Yoo-jung",
         "Lee Joo-sil",
         "Kim Sun-Kyung",
         "Jung Ho-Bin",
         "Kim Min-jae",
         "Park Sung-woong",
         "Kang Han-Na",
         "Yoo Jae-Myung"
      ],
      "imdbMovieId": "3144098",
      "originalTitle": "동창생",
      "genres": [
         "Drama",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["tzRdFw-ZC6U"],
      "plotSummary": "The son of a North Korean spy decides to follow in his father's footsteps to protect his little sister. After his father’s botched espionage mission, North Korean Myung-hoon and his young sister Hye-in are sent to a labor prison camp. In order to save his sister’s life, Myung-hoon volunteers to become a spy and infiltrates the South as a teenage defector. While attending high school in the South, he meets another girl named Hye-in, and rescues her when she comes under attack. South Korean Intelligence soon discover Myung-hoon’s activities and begin tracking him, all the while his own government sends a vicious assassin to eliminate him.",
      "tmdbMovieId": 235704,
      "avgRating": 3.57895,
      "releaseYear": "2013",
      "numRatings": 19,
      "posterPath": "/hNBuJ4ucaYvDcnWxtKCq65t5fft.jpg"
   }
}