{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "execution",
            "id": 13129
         },
         {
            "name": "stranger",
            "id": 156104
         },
         {
            "name": "no memory",
            "id": 220885
         }
      ],
      "imdb_id": "tt3118452",
      "video": false,
      "title": "Circle",
      "recommendations": [
         97051,
         254191,
         296065,
         265010,
         250574,
         291272,
         360784,
         276488,
         306947,
         279690,
         29917,
         323665,
         306964,
         253306,
         354251,
         376570,
         34335,
         273271,
         323262,
         121606
      ],
      "backdrop_path": "/hf3xwAORLbxMxdOopqXeOLknUes.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "The Wife",
               "gender": 1,
               "credit_id": "552e71e3c3a36804cd000cf2",
               "name": "Julie Benz",
               "profile_path": "/3ymRPOitD5IKXZgDLoy8FLRGQCn.jpg",
               "id": 35551,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "The College Guy",
               "gender": 2,
               "credit_id": "552e72609251413b3b0004a1",
               "name": "Carter Jenkins",
               "profile_path": "/fGVndWC3hgwK1uVrhiyzTUyIaxW.jpg",
               "id": 86653,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Tattooed Man",
               "gender": 0,
               "credit_id": "552e72c3c3a3683f0d0021ac",
               "name": "Cesar Garcia",
               "profile_path": "/6KkknahgOIBaZfz3ip3UV89iVFO.jpg",
               "id": 53255,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "The Lesbian",
               "gender": 1,
               "credit_id": "552e72e49251413f9c000bdc",
               "name": "Mercy Malick",
               "profile_path": "/um3k6lzN5V8KKgAUzqbCXls7LhZ.jpg",
               "id": 155293,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "The Cancer Survivor",
               "gender": 1,
               "credit_id": "561fe64a92514171d40042e8",
               "name": "Lisa Pelikan",
               "profile_path": "/9pA1C6RTJ9OT2S0J2xeOKxVqvl4.jpg",
               "id": 115888,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "The Little Girl",
               "gender": 0,
               "credit_id": "561fe65892514171d00041f3",
               "name": "Molly Jackson",
               "profile_path": null,
               "id": 1504904,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Pretty Girl / Christina",
               "gender": 1,
               "credit_id": "561fe66ac3a3680e1d00456a",
               "name": "Sara Sanderson",
               "profile_path": "/6udFB1MUBzyXgINimwOyDvTgpby.jpg",
               "id": 1190818,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Eric",
               "gender": 2,
               "credit_id": "561fe679c3a3680e2000453f",
               "name": "Michael Nardelli",
               "profile_path": null,
               "id": 212267,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "The Asian Kid",
               "gender": 0,
               "credit_id": "561fe68792514171c5004208",
               "name": "Lawrence Kao",
               "profile_path": null,
               "id": 1367306,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "The Old Woman",
               "gender": 1,
               "credit_id": "561fe697c3a3680e10004206",
               "name": "Fay DeWitt",
               "profile_path": "/10trHkyA6zuHoWfZWOttK1xqjiI.jpg",
               "id": 85837,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "The Deacon",
               "gender": 2,
               "credit_id": "561fe6a4c3a3680e20004546",
               "name": "Kurt Long",
               "profile_path": null,
               "id": 1216707,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Man 1",
               "gender": 2,
               "credit_id": "561fe6bbc3a3680e140042a0",
               "name": "Kevin Sheridan",
               "profile_path": "/4BYcvbP2XcBK1j0INM0njU0c6Ox.jpg",
               "id": 84895,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "The Husband",
               "gender": 2,
               "credit_id": "561fe6c79251417f47002551",
               "name": "Matt Corboy",
               "profile_path": "/cOrGWvESrNU2AWt6nBcGjE3stY.jpg",
               "id": 111451,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "The Bearded Man",
               "gender": 2,
               "credit_id": "561fe6d7c3a3680e16003cf2",
               "name": "Kaiwi Lyman",
               "profile_path": "/5H63NaGfhYGRDrQkanUI3k9x9HQ.jpg",
               "id": 968742,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "The Soldier",
               "gender": 2,
               "credit_id": "561fe6e892514171c7004100",
               "name": "Jordi Vilasuso",
               "profile_path": "/xAts6zTNVcO2i84jIhrgOiWhgrK.jpg",
               "id": 114052,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "552e6f9292514103ce007142",
               "name": "Aaron Hann",
               "profile_path": null,
               "id": 1454563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "552e6fa79251413838002043",
               "name": "Mario Miscione",
               "profile_path": null,
               "id": 1454564,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "552e6fc3c3a368615c0007f8",
               "name": "Aaron Hann",
               "profile_path": null,
               "id": 1454563,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "552e6fe0c3a368615c0007fe",
               "name": "Mario Miscione",
               "profile_path": null,
               "id": 1454564,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.93189,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 335866,
      "vote_count": 478,
      "budget": 0,
      "overview": "Could you trust a jury of your peers with your life? The contestants of a mysterious death game must make harrowing decisions as they strategize for survival in this psychological sci-fi thriller.",
      "similar": [
         19908,
         290512,
         75174,
         281957,
         49049,
         6479,
         76341,
         336843,
         238636,
         20766,
         390062,
         44115,
         14211,
         1562,
         12244,
         2787,
         9659,
         9693,
         110415,
         38050
      ],
      "original_title": "Circle",
      "runtime": 87,
      "poster_path": "/b90K9KbdrcIRbVhSG1V638lwDbJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Votiv Films",
            "id": 34455,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Taggart Productions",
            "id": 51235,
            "origin_country": ""
         }
      ],
      "release_date": "2015-10-02",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "In here… everything gets you killed.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Aaron Hann",
         "Mario Miscione"
      ],
      "runtime": 87,
      "synopsis": "A woman wakes up in a crowded room. She begins to panic. Another young guy speaks up and warns her not to move and tries to calm her down. As she panics, another woman wakes up, the young guy yet again reassures them of what he knows. Suddenly, every one else awakens, and hysteria is evident throughout the large group. The guy shouts for people to calm down, but most ignore him. Some listen, some are instantly killed when stepping off their circle. One guy figures out that whoever dies is controlled by their hands, seemingly 'voting' for who should die next. Around 5 people are killed before a young guy steps up and announces that they should kill the older people (6) to buy them 10 minutes of time to discuss what is going on. The older victims beg for their lives and cry as they are wiped out one by one. One man tries to lie and say that he saw 'wet black aliens' in a bid to buy some time. The group does not believe him and he is killed. The guy that suggested the older people die targets a woman with Cancer, accusing her of 'not being 52' and other members of the group join in to defend her when he says 'cancer or not, she will still die next'. One guy says that anyone over 35 should have a problem with this guy. The noise that starts the voting begins and the young guy realises he will be killed. He begs for his life but is killed by almost everyone in the room. People start to try and figure out what is going on. The lady that has Cancer says everyone should talk to each other and try to make sense of the situation. The group decides that 'no names' is an easier way to communicate after the lady that starts telling them about her life in detail is suddenly killed. A man points out that his wife is standing next to him. Another man says he knows someone standing in front of him as well. A policeman points out that he recognises a man that 'beat the shit' out of his girlfriend. Everyone asks if the domestic abuse is true and he admits it. He is killed after a confrontation with the cop. A lady points out that they need to decide 'who is good, and who is bad'. Another man, who is black, sarcastically comments that everyone should just 'kill the black people'. Some of the group start shouting and arguing. The cop starts saying that black people think they deserve everything and starts being racist. He is killed by the group. A U.S Marine comments that everyone wants to live so they all need to work together because they are probably 'being studied'. People decide to all vote for the person next to them in a bid to stop the program. It doesn't work and a random person is killed. They try it again because they think someone got it wrong. Suddenly a bright light appears over a pregnant lady and a man who has not yet said anything. The man is killed. A man comments that he voted for the man who was killed because he saw him vote for the pregnant lady and that was the only way to stop him. The group conclude that it's a game. Another guy comments that it will be 'the kid or the pregnant lady' that win and that if they kill them now everyone else has a better chance of living. The group begins to vote but the tie lands on an elderly asian woman and the little girl. The little girl is spared. The group are torn between protecting the pregnant lady and little girl or killing one of them. The voting resumes again and suddenly a man behind the pregnant lady and little girl is selected into a three way tie. He is hysterical and shouts 'Just kill them both' and dies. A man suggests volunteers to die and asks people to step forward. Nobody does for a few moments until a 16 year old boy named Sean suggests he will volunteer because he doesn't want to kill anyone. Another man suggests that he is 'just a kid' and shouldn't die. An older black man at the back suddenly says 'No, I will do it' after the group argue that Sean is either too young or he is 'allowed to make his own decisions'. Sean says he still wants to volunteer after being asked. The group kill him. The marine suddenly feels targeted as people look at him and states that he was in Afghanistan 'saving them' and justifies why he shouldn't die. People ask for volunteers and an older lady says that she will. She cries and is killed. A minister states that God is watching over the group and that he has a plan. A guy starts shouting at the minister and being abusive. After the vote a tie ensues between him and a lady that didn't say anything. The guy states that he knows a woman next to him is a pornstar. She says she doesn't do porn and he insists she does. He says that she is a mistress of a man called 'David' who has a family. He is killed by the group. Someone suggests people should take into account if people have families and that people without children should step forward and volunteer. The voting resumes and as a guy is telling a woman about himself, a girl who stated that she is 'still just a kid' is killed. A woman says she's gay and is targeted by the guy who was telling the group about himself and he says the woman has sinned and isn't worth dying for. The man says that being gay is wrong. The man gets killed by the group. Nobody votes on the next round and the man and woman that knew eachother from before both tie, and choose to die together. A man who has previously spoken up a lot begins to question if the pregnant lady is a good person. He states that she might not be a good person and asks where the baby's father is. She is flustered and he does not stop asking her questions. The voting sound begins to play and people seemingly ignore it. A random man is killed. A black man who has previously spoken up a lot questions the same man on whether or not he is a good person himself and asks what job he has. He answers saying he is a banker. He insists he is a good person as he gives to charity and 'lends people money to help them' but others aren't so convinced when a lady, a graduate student, mentions the possible salary he earns. He gets annoyed and asks the graduate what she does. She answers. She then starts to whisper in another language to a man who cannot speak English. She is killed by the group. People start to say that there are 'sides' and cracks begin to show in the group now that there are less and less people left. A guy takes charge and says the 'good side' need to protect the pregnant lady and child. People are confused but agree. A tie ensues between the man who can't speak any English and the child. He sacrifices himself to save her. An argument starts between the marine and the banker. The marine says the banker would 'kill a kid to save his own life' and is disgusted. The banker states that he wants to live and that he'll see what the marine does when it comes down to it. He is angry and begins chanting at the group that they need to kill the child and pregnant lady. People start arguing over 'sides' and the banker starts shouting loudly. One group says that they are voting for the child and one says they are voting for the banker. A tie ensues and the banker is killed. A man says that everyone should 'vote for the guy with one arm' who was in favour of saving the child and pregnant lady because it will 'even things out'. The guy gets killed. The marine says that the couple (husband) should die. As the husband panics and says that he will swap his wife for himself, the marine suddenly tells everyone to 'vote for the black guy'. A man laughs saying 'true love conquers all' and shouts saying that everyone has killed themselves. He says that they probably aren't married and that they are lying and that they are just lying to survive. He says \"Nobody wants to kill someones husband or wife, especially in front of them\". People quiz the couple with questions like 'What's his birthday, what are the names of his parents\". A lady asks what her husbands name is and the group realise that he said his name before, but the 'wife' doesn't answer. The group realise the couple are lying and they admit it. They both accuse each other of starting the lie first but the group kill the man. The same man that accused them of not being married, states that he can help keep her alive and that she shouldn't have lied. The marine steps in and claims that he is just trying to use her. The woman agrees to join the 'side' that wants to kill the group. A man stays silent as he is asked what side he is on. The gay woman has her emotions played with by the man who is trying to rally up group to kill the pregnant lady and child. A tie ensues between 5 people. All die (Marine, lady with cancer, the woman who was accused of being a pornstar and a random) except the leader of the bad side. He tries to enlist the pregnant lady to vote against the little girl but she says she won't do it. 6 people are left after a man says that he is sorry to the pregnant lady and sacrifices himself. It is now an even vote. People begin to vote but a man refuses and the lady who lied about being married dies. The two guys that are left question the guy that didn't vote. The group decide to 'vote against him' and the leader of the bad side agrees. He suddenly realises he has been played and is killed. The good guy, the pregnant lady and the child realise they have to vote for the old man. He is killed. With just the guy, pregnant lady and child left, they start to say it was likely an experiment to 'learn about us'. The guy says when he is gone they will need to decide who steps forward or both will be killed. The little girl says she will go and the woman starts crying. He says it's very brave of her and that they will go together. The voting beeper starts to go and he shouts at her to go. She steps off her circle but the guy also selects the pregnant lady to die. He sighs in relief. The voting beeper goes off again and he begins to shout, thinking he will die anyway. A tie ensues, between him and the baby that is inside the dead pregnant lady. He selects the baby to die and the screen goes black. The guy wakes up on concrete. He looks up at some kind of spaceship and sees lots of them floating around. He walks for a while and sees a group of people looking up at them. He looks with them at a huge spaceship in the sky.",
      "writers": [
         "Aaron Hann",
         "Mario Miscione"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3118452/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg0Mjg0MjUwOF5BMl5BanBnXkFtZTgwNjk0NzQ4NzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Allegra Masters",
         "Aimee McKay",
         "Ashley Key"
      ],
      "reviews": [
         "This is a fairly simple movie, a bunch of people wake up in a strange room and are rapidly picked off one by one. However the kicker is that they get to vote off who dies next. I really enjoyed this, it felt like a reality show from hell. The film gets going almost right away, there isn't really any build up or character development before people start dying. As the group gets smaller we slowly start to get to know some of the characters, but no one main character is ever really determined. I like that they did this, it made it so it was pretty unpredictable as to who would die next. The film is also pretty heavy on dialogue, I am pretty surprised that they were able to find a fairly unknown cast that was able to pull this off well. The majority of the characters are believable and deliver solid performances. There are a few negatives that are worth mentioning though. One is that some of the kills were too random, it's pretty much like \"Why would they randomly kill that person when they could have easily killed the person who is clearly giving them a reason to do so?\" Not a huge complaint but just kind of took away from the film in my opinion. Also the ending was a bit stale, not so much to ruin the movie but wasn't exactly the payoff I was hoping for. Overall this is a very entertaining film, it held my attention throughout and actually had me on the edge of my seat a few times. If you enjoyed films like Saw and Cube I would definitely suggest checking this out. 7/10",
         "Some seemingly random people appear in a circular room, every now and then one of them is executed. They quickly realise there is a way to 'vote off' your fellow circle dwellers in a very terminal way. It is not long before prejudices and biases start to arise. Someone notices more black people are getting zapped than white people. Coincidence? Some of these biases are played out very professionally with flair and drama, others are handled a bit clumsily leading to some very cringey dialogue. This film lives and dies by how much you are prepared to invest into it. If you think about the scenario logically, then a lot of the choices people make seem rash and rather stupid. But if you can put yourself in the characters shoes, and imagine that you - staring wide eyed down the barrel of a gun - are about to be killed over some scum bag rapist, in reality wouldn't you want that extra two minutes of life over them - just on principle? This is where the film needs to draw you in. The acting, lighting, effects and sound are all good enough. However, some of the characters aren't, forcing some of the actors into a corner they have to ham their way out off. Then the spell starts to crack. If you can remove all distractions and try to engage your emotions and blot out the signals coming from the rational parts of your brain then this is very good for Netflix fodder. I was fully prepared to have one of those stupid no answer endings. I was pleased to get a bit more than I expected.",
         "After reading the synopsis of this film prior to viewing it I thought \"Aha! This will suit my penchant for sadistic thrillers.\" I was hoping for something similar to Cube and instead got a feature length study of human nature. This was fine. What was not fine was the so-so delivery of such an exciting premise. It was messy and just seemed to miss some key element. For a movie that was so dialogue heavy it was disappointing to have it not delve a little deeper. Also the voting system was a little confusing and haphazard which made the whole thing seem a little sluggish, rather than clean and fast paced. Despite these flaws, Circle did manage to hold my attention quite well and had me engaged with the characters at points, as each stereotype of society is represented and played with, however fleetingly. The plot twist at the end was not entirely shocking as it summed up the true nature of most humans quite accurately. I believe the crushing sense of disappointment I experienced after watching this film was at least partially intentional, and for that I give it credit.",
         "Just finished watching this enjoyable indie film, which is somewhere between an episode of The Twilight Zone and Black Mirror. 50 people trapped in a room who quickly come to realise that they have to vote who will die next, each death at 2-minute intervals. What we see is the obvious discussions and arguments regarding race, sexuality, who has lived the most valid life, should the oldest be first, etc. ... anything that can be argued to be a black mark against somebody who isn't you, so that they you have a reason for them to be the next victim (and you to live). The film moves along at a good pace, it never felt like it was dragging. I found the acting to be pretty good and the twist at the end was a surprise. Well worth a viewing in my humble opinion.",
         "'Circle.' It's a pretty tight little film, basically filmed only in the one location for an hour and a half – the location being a completely pitch black room with fifty red spots on the floor. In each, stands a random stranger and every couple of minutes one of which gets zapped by – er – something and brutally killed before their body is dragged off into the gloom. Confused? How do you think the fifty people feel?! And that's that – fifty people turns to forty. Forty turns to thirty and so on. It's a tough sell and it's probably never going to be a mainstream hit (especially as about the most well-known face is Dexter's wife from the TV series of the same name). Anyway, I think it deserves a cult following as I'm sure it will find an audience out there somewhere. Its simple premise and delivery kind of reminded me of other (rather fun films) such as The Human race and Cube. Yes, it's hardly action-packed. The fifty people can't even move off their little red spot on the floor – if they do, that nasty zapper comes back for them again and that's that for them. What you have is a kind of morality tale about what people would do in this situation. Would they vote to kill people they don't know just to save themselves, or would they try and save everyone? It's not going to be everyone's cup of tea. I can see plenty of people finding it boring, or being annoyed at the ending (I won't say why – you'll have to check out the internet message boards!), but if you're in the mood for something a little different and without any major car chases or Marvel superheroes destroying entire cities then give this one a go. I found it on Netflix and was glad I did – definitely worth seeing if you're in the mood for something dark, talky and that will make you question what you'd do in this most of weird and extreme of situations.",
         "Circle is a thought provoking movie that is definitely not worth a 9/10. So why then did I give it just that? For reasons that I don't fully understand, I find myself mesmerized by the end of an hour and a half long serial execution by jury. This style of movie has been attempted multiple times before with the likes of Cube, Saw, and a couple underground indie flicks, where in the premise, at it's basis is kill or be killed. Though surprisingly none others quite matched up to the tone and imaginative nature of Circle. Let me try to explain in more detail and I emphasize try: Circle is a very simplistic movie where 50 people are trapped in a circle (thought to be trapped by E.T's), a circle that forces the unlucky individuals to choose who to kill in 2 minute intervals. Where it gets interesting is the evolution of everyones mindset on how to go about killing each other. The psychology used, the ruthlessness at the core of seemingly everyday people, the innocence, the betrayal, the discrimination, and the humanity in others is what is so mesmerizing about this indie. It is a lower budget, decent acted psychological thriller that educes the imagination in so many ways. With a semi intriguing simplistic idea, they were able to create an entertaining thought provoking humanistic experiment, simply with dialogue, and a Circle. I give this movie a 9/10 for the simple fact that there is nothing else quite like it. And whatever is quite like it, still isn't quite like it. In general movie terms, I wouldn't dream of rating this movie higher than a 6/10. However, when you walk away satisfied yet still wanting more, disgusted yet applauding, and tired yet contemplative, I have no choice but to stick with my rating.",
         "If you like car crashes, sex scenes and special effects, don't watch this film. But if you like thought provoking, intelligent suspense, do watch it. I was hesitant; there is very little info online about the movie and even fewer reviews, but Netflix offered it, so I had a go. My wife and I don't always like the same kind of movies, but we both enjoyed this and discussed what we'd do in that situation. The judgements and discussions that occurred during the film made me realize how judgemental we really all are. Even though it is very dialogue heavy, I didn't get bored. In fact I couldn't believe how quickly the time passed. So glad I watched it..... wish I could forget it and watch again....",
         "Typical 'date night' with my wife on a Sunday evening...she wants to watch some scary movie and I cannot stand them because they never seem to live up to the hype and/or only implore cheap \"BOO\" shots. Not this movie... We picked this out of 100+ on a streaming service and we were very happy we did. The movie very quickly gets going, no long build up and catches your interest from the first 'zap'. And it quickly exposes humanity's almost complete lack of compassion and everyone's brutal opportunistic self. The underlying social and moral values that are revealed are very poignant and on more than 1 occasion we found ourselves asking \"What would you do...?\" So I ask you... \"What would you do if you were locked in a dark room with 49 strangers of various walks of life, and had to choose who dies every 2 minutes until there is no one left? How would you handle yourself?\"",
         "Fifty people wake up in a room, trapped standing on circles on the ground while an orb picks them off one by one. Soon they realize that they can vote for who dies next and a vicious power struggle for survival takes place in which only one person can come out alive, if anyone makes it out at all. At first glance this film seems like pretty typical Saw-esque horror fare, characters drop one by one as they try to solve their predicament in seemingly logical and ethical ways. But where a lot of those films suffer from 'torture porn' syndrome, IE making entertainment out of cruel and inhuman grotesqueries and human suffering, Circle probes a little bit deeper and doesn't make the constant deaths, though occasionally amusing, the focal point of interest. The deaths are all clean and it never becomes sadistic or sickening, which I appreciate. I think that this film has a lot to say and it gets its points across in a mind-blowing fashion in my opinion. Once the characters figure out what is going on in the room, they all try different tactics to stay alive and to present their ethical ideas to the rest of the group. Prejudices emerge. They could easily feel clichéd but they don't, and one reason for this is that the film feels allegorical in its denouement. It would seem unlikely that so many people from seemingly every different walk of life would wind up in that room together, but it's important to the point that I think the film is trying to make. I think that every moral and ethical idea presented is relevant and all of the characters add something new to the 'idea' of the film. As political sides emerge and different viewpoints clash, it becomes clear that this group of people is sort of like a microcosm of our modern world. It becomes a study in sociology, psychology, morality and Darwinism. Human beings tend to hold their hatred for each other inside and never let others see it. But when life and death are at stake, when everyone's back is against the wall, and when the power to kill another to save yourself is as easy as closing one's fist, how would people really react? I think it's realistic in it's portrayal of seemingly good people turning on each other. Granted it's not totally nihilistic. A lot of them want someone to survive at the end who deserves it, but the group spends so much time bickering and arguing with each other, killing each other through frustration and anger, and even through strategy in trying to survive that they end up wiping out most of the best people early on. Human beings are traded like pawns in a game as strategies come head to head. And in the end, who walks away the winner out of all of the chaos that we humans put ourselves and each other through with our endless judgments of each other and our pointless struggle to the top of the food chain? HERE BE SPOILERS The psychopath. The manipulator. The deceiver. The smartest and least ethically bound out of all of them takes the grand prize. If this isn't a metaphor for the elite in our society then I don't know what is. He pretends to be on the side of the weakest in the room, promising to sacrifice himself for them if one of them can do the same. But then he turns on them, survival instincts kicking in. How many people would have done the same in his position? Way too many in this world. His victory totally negates the sacrifices of all of those who came before him, because it's totally unethical. But it makes the movie as a whole mean so much more because of that negation. But going back to one of the main themes of the movie, is it really our place to judge him? As he stands amidst a group of survivors, we see that they are mostly children and pregnant women. If the aliens are trying to purify the world down to 2 percent of our current population, wouldn't the new world need some strong, smart people to lead the needy and the weak? It really makes you think. And that's why I think this film is great. It makes you think not only about society and the dilemmas humans face as a whole but it asks you to take a look at your own judgements and values and ask whether or not they are really what is best for others and for society. Personally I do think Eric is evil though. We're all faced with the eventuality of our own death, maybe all we can do is live truly good lives and hope that the world that is left after we are gone is a better one. But we need to watch out for those manipulators and evildoers at the top of the pile or they will take everything we've struggled for centuries to achieve. Overall this is a very disturbing film, but a poignant one. It brings up a lot of interesting questions about human nature and provides no easy answers. This is a bold film, a challenging film, and a film not for everyone, but if you can stomach the subject matter I highly recommend it.",
         "It holds you, pulls you into it and has you rooting for people. The problem was simple, to be honest. The ending was so flaccid, based on the build up, it leaves you thinking \"Come on..\" I was surprised , based on how the film ended, at the level of acting in this movie.That was the shining point when you factor in the ending or the lack of context and content. It was nice to see \"Rita\" after her demise in Dexter, finding a roll and playing it well :) If it had a bit more context, content or a bit more story, I think it would have been a terrific movie. Instead it went down the pseudo- cerebral path and fell on it's face. I Would not recommend this to anyone unless it was a .99 rental at a red-box simply because it is missing the delivery that comes after the build up",
         "There are several movies that have done this sort of thing before. Put a cross section of society in an isolated situation (Desert Island, Hostile Planet, Booby Trapped Death Cube, Reality TV Show etc.), and observe their behaviours to see who is a team player, and who is a selfish aback-stabber. Circle reminded me of a more extreme version of the TV game show 'The Weakest Link'. Only there is 50 people involved, and each is voting for their own life. It's a neat premise on paper, but ultimately, the movie doesn't really go anywhere with it. As a social commentary, we are presented with a broad cross-section of some very unpleasant stereotypes across the spectrum. Nothing was spared, whether race, gender, age, disability, sexuality, the movie provided some very sloppy examples of stereotyping & discrimination. As a sci-fi movie, there is no character development at all. The movie only has two ongoing questions and they are 'Who will everyone vote for next?\" and \"Why?\". The first question is answered every few minutes, and the second answer seems to be \"Isn't it obvious?\". - There is a third question \"What the hell is going on?\" and to its credit, the movie does not have an ambiguous ending. It does actually answer that question, but the answer feels like a tacked-on epilogue that doesn't really tie all the loose ends. All in all, I found myself getting a bit bored & impatient with the movie to start going somewhere. I continued watching a bunch of people squabble over strategic voting and each round became more telegraphed. Even the 'twist' final rounds were predictable. There are much better socially based sci-fi movies around The Cube & The Exam, for example, allowed for some character development, and for moral ambiguity. Overall, I wouldn't recommend this film as an in-depth moral commentary about humanity, but if you are into the whole 'watching people stab others in the back' thing, then this will kill an hour or so.",
         "No matter what society we live in or what culture we came from we are making decisions that seem small but are affecting the lives of others, we are different and separated because of culture, race, religion, income, sex orientation... but at the same time we are the same: we all want to live, this is what this movie is about. When it comes to political decisions and who deserves to live or must most profit from resources the question gets complicated, this movie tries the clarify some of the motivations groups of humans have to reject the other and how these motivations only make sense in the heads of people who have them, in nature things are different and it is shown in the ending that the one who gets to live have done that by a mix of intelligence and luck. This movie is more about political science and sociology than science fiction or horror.",
         "I tried to get into this movie, and by the time it was over, I realized I had wasted an hour and a half of my life. The only reason I stayed with it was because it reminded me of 2010's NINE DEAD, a far better movie. CIRCLE tells the story of a group of strangers who wake up inside a darkened room, all standing in lit red circles placed in a larger circle in a few rows so that everyone can see and hear each other. A mysterious orb in the middle of the room starts killing each of them off one by one, seemingly without any rhyme or reason. The characters begin trying to figure out how the killing process works, and surmise that the orb kills off another person every two minutes, and that the survivors have the collective ability to vote for the person who will be next. They also discover that death befalls anyone who leaves the lit circle in which they are standing, as does having physical contact with anyone standing near them. The group spends a little time trying to figure out how they all got there, and to see if they have any ties to anyone else in the room. Not enough time is spent on this investigative process and the uncovering of the layers that might keep the audience interested. Instead the generic conclusion is that a giant ship from outer space reached down and grabbed each of them and brought them to the ship and placed them in captivity. The group then exercises flawed reasoning as to who should be killed next, whether it be determined by age, race, or socioeconomic standing. The screenwriters tried to portray the group as a random cross section of people: The young, the old, people of different races and occupations. The story then unfortunately takes too many pot shots at stereotypes, particularly conservative ones. For example, the one police officer in the group is labeled judgmental for pointing out the one criminal in the group, and the one the white collar worker wearing a tie and suspenders (a white male, of course) is branded as a racist for his words to a black man in the group. And the stereotyping wouldn't be complete without the same white male devaluing the lesbian mother's life and worth. Even the one minister in the group is scoffed at for suggesting that God is the answer, while the continued elimination of people in the group suggest that God is nowhere to be found. And the lone soldier in the group is accused of having information about the spaceship that he was keeping from the rest of the group. As the herd thins out, the remaining survivors deduce a convoluted idea that with enough votes in one direction, the young girl and pregnant lady in the group can be spared death. How the script got to this point is fuzzy, and the story was already too far gone for the audience to care if anyone survived. In the end, the lone survivor is seen on the ground outside the ship, with onlookers gathered to watch the ship leaving the skies above the earth. No further explanation is given, and whatever attempt at a bombshell explanation that is given by the survivor's narration at the end of the movie was ineffective. I finished this movie feeling cheated and empty, like I had been lectured to.",
         "So you've read the synopsis and want to see if this is something you might be interested in. Have you ever seen, \"The Man from Earth\"? Did you like the movie? Where they talk and talk and show nothing characteristically typical of a Sci-Fi flik. Well, \"Circles\" does something similar with all the talking, except with strong horror undercurrents and themes that focus more on sociology and politics. There is a similar \"Cube\" feeling, that confined atmosphere of death but \"Circles\" has a far better pace and manages to keep the intrigue all the way to the end with only ever using one room. admittedly I first viewed \"Cube\" well after its release and I find it so dated and difficult to stay awake through. It lulls me to sleep no matter what time of day. But I digress. \"Circles\" could have fleshed out some of those intimate moments of the actors more thoroughly but I'm assuming budget effected time which meant that there were only a few takes. So boom. That one will just have to do. Nonetheless I appreciate the themes this film shoots for. I enjoy a film that enrages me a little when portraying human nature as it systematically makes my brain wheel turn. Is this plausible, are we capable and would I really behave like that? I don't think this a horror or sci-fi genre specific, rather more of a drama with the other two built in. I think if you enjoy a good drama but have gotten tired of the opaque sadness the genre likes to play in, then give this a shot. I think you'll have a good time wading through the tension. In the end it was a great film where it simply holds a mirror up to the 2010's and says, \"Take a look, what do you see? Wanna talk about it\"",
         "Who would have thought that a movie about 50 people standing in a circle could be a good idea? But it turned out to be not bad at all. Everybody wakes up and they start to panic a bit until a couple of them die from a strange light in the centre of the circle. Some of them remember running from some possibly alien threat and waking up in the circle. Every couple of minutes someone gets killed and its then they realise that they are choosing who dies and that's when it gets more interesting. A nice study of stereotypes and prejudice. Who is worthy to survive and who isn't. To me it seems as if the 'aliens' were using this circle as a form of entertainment and possibly gambling on the outcome. Who will be the last 'man' standing? And why? The ending was quite clever and not what you would expect. Overall a decent movie filmed on a limited budget but with some good ideas and a clever script and some reasonably good acting. I enjoyed it and give it 8*",
         "My vote is 1. Could have painted the house instead of wasting my time. Boring. No plot. Actors you can't stand. Lacking in script or story. Watching people kill off those around them just to live 2mins longer makes no sense to me. Having a pregnant woman and a 10 year old kid killed by a selfish bunch of people doesn't make for very good viewing in this country. Some movies just cross the line and this is one of them. I can only hope anyone who watches this trash hasn't wasted their money. If you like it then my next vote would be for you.",
         "A bunch of people are gathered in a black room with red circles and a weird machine kills them all. End of story. So you put in the movie, watch the first 5 minutes, you think \"hmm this could be interesting\" So you keep watching it. About 20 minutes into the film you know it's going to be a really crappy film with a terrible ending. This qualifies for the first place of \"Give me my money back now\" films of all times. Maybe more. If you're reading this and you haven't watched the movie. Please just choose something else. Anything. Go watch Bambi again or something. Such a terrible thing to compare this hideous film to The Cube. I think this movie has a larger agenda in it's sleeve. It's to make you a complete idiot after you've watched it. I kinda felt that way towards the end. It seems someone took a really nice script, put it in a public toilet, waited a couple of hours, reached in the toilet and pulled it out and then shot the film with what was left of it. Let me guess. The sequel will feature a bunch of people in a dark room with red circles and a strange black ball shoots all of them to death. End of story. Again. If you're interested in relations between different kinds of people and studies in social behavior, just go watch a court drama. I suggest any version of the movie 12 angry men. Don't say I didn't try to save you money. It's not even worth a free download. Waste of space on your hard drive. Last but not least, don't ever mention this film to your friends. You will most likely lose a couple of movie buddies instantly.",
         "Fantastic concept that is beautifully executed. All the decisions and rationale behind them feel disturbingly real. I found myself yelling at the characters on many occasions. My one gripe would be that it was hard for me to imagine how certain characters would survive as long as they did given their actions. That said the turmoil did cause me to become that much more involved in the story. This film falls in line perfectly with others that similarly take a unique concept and flesh them out into intriguing narratives. If you like Cube, The Game, The Box, or even Adjustment Bureau (not nearly as sappy so don't worry) you will love this movie. Side note if you watched this movie and liked it you should also check out the ones I mentioned above.",
         "Looking at the votes for this film, I struggle to understand why, at writing, they averaged out at a 5.8. I would say that the unfortunate truth is, simply, most SF viewers are not very bright. The thrust of this story would have gone over many of their heads. By the time they realised that the whole film is a group of protagonists standing around in a circle, trying to deflect their own doom, they were probably grabbing their own heads and wailing about that and about the fact they couldn't follow it either. And that explains a lot about the western world - and not just SF fans, since: everyone votes. OR should vote. This story is politics distilled to its very essence. Factions, voting systems, altruism and reciprocal altruism, dirty deals, sociopaths hiding in plain site... the works. If I could fault it... I don't know, something prevents me giving it a 10. The very ending, atmospheric though it was, contained a bit too much non-sequitur for my liking, and that's a trend in metaphorical films like this - one that annoys me greatly. But it deserves at least an 8 or 9. Might get the disc of this and put it up on the shelf next to 'Cube', 'Nothing' and 'Pi'. - -- ---",
         "As it usually goes with movies that are flying by under our radar we go in with no big expectations. But from time to time we find a jewel that is hiding and just waiting to be found. For me, Circle is a jewel. Yes, the premise is absurd, and therefore some things are a little too convenient but still it offers a good look into ourselves, and how we truly are inside. There is a burning question that is constantly hovering over during the movie and that is \"what would you do or say to stay alive?\" but unlike many other movies, whatever you do or decide to say has to be backed up by other people. Alone, you are powerless up until the very end. The movie is entirely made up of dialogue that is, in my opinion, very good. Acting is not spectacular, but is definitely solid. There are no big or familiar names which works very well for this flick because from the beginning till the end you cannot predict who will come on top. You cant help but ask yourself how would you react in their shoes and the suspense is present during the whole ride. Yes, my 10 star rating is perhaps a little over the top, but I really couldn't contain my excitement during the final moments of the movie and it did hit me directly in the heart so yes - I will give this indie jewel a 10 and hope that people behind it continue to move forward in their career. Give it a try, you will have a blast.",
         "I will say this movie pulls no punches and goes in a very crude direction. I guess it's the directors interpretation of humanity, motives and realism. What arsenals with mind games human beings will use in order to survive. Of how in the real world, what people usually ends up winning in the end. Well at least in this world we are living in currently. So yeah, this movie might leave a bad aftertaste for some viewers. Actually probably many viewers, especially with the ending and all. It's something no Hollywood movie with a big budget would try to tackle. So I give the filmmakers props for going in a gutsy direction with it all. However this film tries to go in a direction that tries to destroy all hope for humanity. Like I said the ending is a realistic portrayal of what would go down from a nihilist perspective. To be honest I think this movie is probably the most nihilistic and skeptical movie I have ever seen. So I suggest that if you are dealing with depression to stay far away from this one. To sum up this setting overall, it's like some sort of evil and vile game that the Joker would play to bring out the true colors of humanity. 7.3/10",
         "Circle is a movie that, when you get to about the middle of the movie true peoples primal/animal instincts truly come out. This movie is about who can be the last one standing in a twisted version of Russian Roulette, They cast was amazingly played. I came into watching this movie with very low expectations. But I am truly amazed when the movie was playing out. The twists and turns that happen in this movie are awesomely written by an awesome screen writer. I would suggest this movie to all my friends. 9.5/10",
         "If I could give this movie a 0 or less, I would. Matter of fact, I will. I give it a -1,000,000. I mean, seriously! What a bunch of liberal horsecrap. Every political/social flash point is brought up here and it is force-fed to you by cramming it down your throat with a steel pipe. I am ranking this up there as the absolute worst piece of contrived human excrement that has ever been witnessed by mankind. I want to cancel my Netflix subscription, get rid of my internet, and throw my 55\" big screen into the trash bin, so as to never, ever, ever have even the slightest chance that this garbage of a movie be played in my home again. I mean, right now having just finished wasting two hours of my precious life that I will never recoup, I am beyond angry.I think I'm turning green, growing gargantuan muscles, and have ripped my shirt away and torn my pants, which have also somehow turned a shade of purple. I am about to go on a rampage!!! I will begin by saying - this looks like it was filmed on some liberal arts college auditorium stage and that they rounded up a bunch of homeless bums and paid them with a bowl of chicken broth and cup of tepid coffee. How Julie Benz managed to get herself into this is a mystery that Scotland Yard wouldn't be able to solve. Perhaps she has a coke or heroin addiction and the only way to pay it off was to either sleep with the producer or do this film. Or both. Who knows. But one thing is sure - her reputation as an actress has been flushed down the toilet along with the diarrhea that was the script of this fiasco. How much garbage did the writer/s really need to dump over the audience's head? I mean, I'm surprised they didn't have a person who was wearing a lot of jewelry and another person who was a blood-diamond peddler there as well, just to cover that moral conflict. Or have Sarah McLachlan wailing away \"I Will Remember You\", wearing an ASPCA tee shirt and holding an abused puppy standing across from an evil puppy-mill breeder. I mean, WTF!!! And of course the white cop was a racist. Wouldn't want to spoil the twisted narrative going on in the United States these past two presidencies. The only reason I watched until the end was to witness this complete and total train wreck try and sum up with its \"profound\" ending. It didn't. But then again, I really wasn't expecting it to. At the end, the group of morons looking up at the spaceships in silence. Really? Are we to assume they're trying to comprehend what just happened? Are they in shock? Are they glad to be alive? Teed off? I mean, seriously, what a lazy, lazy ending to an already ridiculous movie. I really don't understand the rating its received and I hope my 1 manages to drag it down some more. The pretentious posers giving this high praise, especially one reviewer who needs to stroke his or her own ego by commenting that if you didn't like it, you must be an idiot, are completely full of themselves and are the type of douches that you'd find working at your Starbucks or Whole Foods. I'd sum up by saying, if you haven't seen this, do yourself a favor - watch it. Watch it, get angry, and then go find yourself a pitchfork and torch. Call me up and we'll go hunt down the m'therf'kers who made this movie.",
         "After watching this film I found myself satisfied. Not with the content of the film; but with the freedom to draw my own conclusion. So , here it is. I believe the movie really magnifies people and who we really are. In situations like this any good or bad person can find themselves acting out of character. Some in a negative way and some in a positive way. Yes , this film was somewhat suspenseful but eventually the suspense is gone because you come to realize someone is going to die no matter what. So as the film went on I found myself submerged with the actors and actresses . As if I was there with them. Trying to find a solution. The movie is well worth a mid week evening where there is simply nothing else to do. This is not a film i'd plan to watch with friends as it is so far left or right of mainstream. It left me thinking but most people these days just prefer an overdose of action, violence or horror. This film does not have an abundance of either. If you truly enjoy debate or analytics then yes . Watch this with someone who shares these interests too. Otherwise watch which ever blockbuster is out that month. Not judging any one persons' taste in movies . It's just some people simply want to be entertained and this movie does half the entertaining the rest is for you to do when the movie is over. So for these reasons I give it a 5/10. Others who may partake in debate or discussion after watching may give it 6 or 7 out of 10.",
         "For all of you bad reality show TV lovers out there, comes a new horror film based around that concept. Only difference is, if you get voted off here, well, you won't be around to make a spin off or to annoy us with your laughably bad sex tape (If only our bad reality TV had the same consequences.) Most horror fans suffer from a bad case of impatience, and this film will certainly test you, with a slow moving plot about a large group of people standing in one spot for 90 minutes trying to figure out a way to get out of the situation, but quickly turning to what the human race is best at - screwing each other over. Now, my enjoyment of the film took a slight turn once I noticed both the pregnant character, and the child standing next to her. Let me just add a minor spoiler here for those of you who will want to move on, once you decide that the outcome is as predictable as I thought it was going to be - DON'T! A plot this slow does tend to feel as if it's dragging on, and personally, I feel this is the type of material that would be a better short film - The finale really made it worth while, though. There's people who think doing the right thing will lead you down the right path, and then there's the group of people who believe only the strong/smart survive. 'Circle' gives us the perspective from the latter side - and I have to say I enjoyed every second of it. The writer/director really deserve some credit here for having the cojones to settle for this type of outcome. The surviving character used his wit, and his charm to get out of a situation designed for the most 'innocent' human being on the planet. Brilliant. Random Ramblings of a Madman: If you ever find yourself in a situation like the one in 'Circle,' don't spend your time trying to figure out how to help the people around you. Put that brain power to better use, and start figuring out how to screw them over. Either way, give 'Circle' a chance. It's slow, too long, but worth while at the end."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Felt Films",
         "Taggart Productions",
         "Votiv Films"
      ],
      "summaries": [
         "In a massive, mysterious chamber, fifty strangers awaken to find themselves trapped with no memory of how they got there. Every two minutes, one of them must die... Executed by an electrical pulse generated from a source within the chamber. At first the attacks seem random, but, soon the strangers realize that they, as a group, have the power to decide who will be the next to be killed: by the power of the vote. Mob mentality at its finest hour. A chance to control the machine. How will they choose who deserves to die? What happens when there's only one person left? \"Circle\" is a film about humanity. How we value one another and how people react when they are forced to make decisions under the worst possible circumstances. It's a film that speaks to the very core of what makes us human - Who we are, what we believe and ultimately, the lengths we will go to in which to save ourselves.",
         "Held captive and faced with their imminent executions, fifty strangers are forced to choose the one person among them who deserves to live."
      ],
      "budget": 0
   },
   "movielensId": 144482,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-10-02",
      "dvdReleaseDate": null,
      "directors": [
         "Aaron Hann",
         "Mario Miscione"
      ],
      "runtime": 87,
      "movieId": 144482,
      "title": "Circle",
      "mpaa": "",
      "actors": [
         "Julie Benz",
         "Carter Jenkins",
         "Cesar Garcia",
         "Mercy Malick",
         "Lisa Pelikan",
         "Molly Jackson",
         "Sara Sanderson",
         "Michael Nardelli",
         "Lawrence Kao",
         "Fay DeWitt",
         "Kurt Long",
         "Kevin Sheridan",
         "Matt Corboy",
         "Kaiwi Lyman",
         "Jordi Vilasuso"
      ],
      "imdbMovieId": "3118452",
      "originalTitle": "Circle",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["JAlpm2oRzy8"],
      "plotSummary": "Could you trust a jury of your peers with your life? The contestants of a mysterious death game must make harrowing decisions as they strategize for survival in this psychological sci-fi thriller.",
      "tmdbMovieId": 335866,
      "avgRating": 3.20614,
      "releaseYear": "2015",
      "numRatings": 342,
      "posterPath": "/b90K9KbdrcIRbVhSG1V638lwDbJ.jpg"
   }
}