{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "japanese film",
         "id": 208523
      }],
      "imdb_id": "tt2825120",
      "video": false,
      "title": "Crows Explode",
      "recommendations": [
         52445,
         82469,
         32150,
         32213,
         29977,
         77504,
         32163,
         208429,
         37502,
         206,
         10109,
         74718,
         32229,
         37850,
         32162,
         36681,
         75006,
         246205,
         13311,
         18816
      ],
      "backdrop_path": "/5BVPwRfZEFmKQqreSDUi0m2isZQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Kaburagi",
               "gender": 2,
               "credit_id": "54622fc60e0a2672a700256b",
               "name": "Masahiro Higashide",
               "profile_path": "/6YOBIQ22Y7ZCkuk50QRotvUAl7v.jpg",
               "id": 1185386,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Ryohei Kagami",
               "gender": 0,
               "credit_id": "54623001c3a3686f2e002431",
               "name": "Taichi Saotome",
               "profile_path": "/x3Hp9SS1WiWZmhz9cQ5XpuTzH15.jpg",
               "id": 1384551,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Toru Goura",
               "gender": 2,
               "credit_id": "557de309c3a3682198000348",
               "name": "Yuya Yagira",
               "profile_path": "/1bTy4wXJStfQiKe3hCseOjjrgZ7.jpg",
               "id": 25648,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Kenichi Ogisu",
               "gender": 0,
               "credit_id": "5691358792514179aa000084",
               "name": "Ryo Katsuji",
               "profile_path": "/xNgBKUtEj4xDa7kYX2S5U4DgeAB.jpg",
               "id": 96477,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hiroki Shibata",
               "gender": 0,
               "credit_id": "54622fd6c3a3686f2e002427",
               "name": "Takanori Iwata",
               "profile_path": "/iUTcpjpK4890CqFX1CndeHI3EbG.jpg",
               "id": 1384549,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Yamashita",
               "gender": 0,
               "credit_id": "54622fb10e0a2672a7002566",
               "name": "Elly",
               "profile_path": null,
               "id": 1384546,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Fujiwara",
               "gender": 2,
               "credit_id": "54622ff60e0a2672a700256f",
               "name": "Kento Nagayama",
               "profile_path": "/zGj1BCPzAyWhLye7tiqcj84vnQ6.jpg",
               "id": 237363,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Katagiri, Ken",
               "gender": 2,
               "credit_id": "54623014c3a3686f44002187",
               "name": "Kyôsuke Yabe",
               "profile_path": "/wH19swkJaWiLUGcdpLCFzAZngY3.jpg",
               "id": 94017,
               "order": 8
            },
            {
               "cast_id": 4,
               "character": "Megumi Hayashida",
               "gender": 0,
               "credit_id": "54622fbcc3a3686f4c0025d0",
               "name": "Motoki Fukami",
               "profile_path": "/tYsd50iAcW9FvydLDa4U4kfk568.jpg",
               "id": 129706,
               "order": 9
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "54622fcdc3a3686f3100268e",
               "name": "Ryusuke Ito",
               "profile_path": null,
               "id": 1384547,
               "order": 10
            },
            {
               "cast_id": 9,
               "character": "Tetsuji Takagi",
               "gender": 0,
               "credit_id": "54622fec0e0a2672b3002650",
               "name": "Kenzō Maihara",
               "profile_path": null,
               "id": 1193900,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Takashi Makise",
               "gender": 0,
               "credit_id": "5462300a0e0a2672a7002575",
               "name": "Tsutomu Takahashi",
               "profile_path": "/lg2GqgRSYMFdILRFIpOV8lQHLg.jpg",
               "id": 1268632,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 1,
               "credit_id": "5874d671925141448a0075dc",
               "name": "Suzu Hirose",
               "profile_path": "/2QPyHhJQ0BY7GEsH3L5g8DhxPTQ.jpg",
               "id": 1454976,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e809251416c91133cb9",
               "name": "Toshiaki Toyoda",
               "profile_path": "/iMolLmPzsRs5OpT8Ko36NSeKMqb.jpg",
               "id": 81107,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e809251416c91133cbf",
               "name": "Hiroshi Takahashi",
               "profile_path": null,
               "id": 27785,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.624524,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 253451,
      "vote_count": 17,
      "budget": 0,
      "overview": "A month after Genji Takiya graduates, a new battle for supremacy at Suzuran All-Boys High School begins. Transfer student Kaburagi Kazeo combats Kagami Ryohei for the coveted top spot, amidst a brewing inter-school conflict with Kurosaki Industrial High.",
      "similar": [
         38551,
         436049
      ],
      "original_title": "クローズ EXPLODE",
      "runtime": 129,
      "poster_path": "/4g4M16pXdr6JKYDDtEfNTzG9xb0.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tristone Entertainment Inc.",
         "id": 38100,
         "origin_country": ""
      }],
      "release_date": "2014-04-12",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/gO7rOvpYIRFPoMZgMq6EZkznmBc.jpg",
         "name": "Crows Collection",
         "id": 192174,
         "poster_path": "/cCk7eolipCWIGb9AJcnvraHRUCr.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Toshiaki Toyoda"],
      "runtime": 129,
      "synopsis": null,
      "writers": ["Hiroshi Takahashi"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt2825120/",
      "coverLink": null,
      "actors": [
         "Elly",
         "Motoki Fukami",
         "Masahiro Higashide"
      ],
      "reviews": [
         "I am a big fan of this series and in fact have treasured the copies of first two movies as If it is my personal goldmine. I had waited patiently for the third movie for years. The last movie came out in 2009 and now its 2014 so imagine how long has it taken for the movie franchise to come out with a sequel but was it worth waiting this long? Absolutely not First of all we have to deal with the absence of its original star casts like Shun Oguri as Takiya Genji and Takayuki Yamada as Serizawa Tamao. They had immortalized their characters and the entire franchise with their power packed fists and acting. The new release on the other hand does not have an impressive star cast. The franchise which is known for its action is what is lacking in this movie primarily. If I am watching a movie from the crows series, I need to see some action but sadly the only action in this movie is right about at the beginning and at the very end and that too for a very brief second and long gone before you can even feast your eyes. Masahiro Higashide as Kaburagi Kazeo is good with acting but bad with action. He does not impress with his action skills but Yuya Yagira as Goura Toru was still impressive and so was the character black dynamite (only for action). Kento Nagayama as Fujiwara Hajime has a meaty role in the movie but that is what is bothering me. It felt as if the whole plot deviation just took out the essence of the basic movie. A recurring character Rinda man was totally wasted with barely there presence The movie franchise which entirely sprouted from its action sequences forgot that basic element in its new movie and instead diverted with a somewhat lukewarm performances and plot, totally disappointing the fans who have been dying for the sequel for a really long time.",
         "Seriously guys?? what's with the review? It didn't help people who didn't watch the movie yet. As someone who watch Crow Zero and Crow Zero 2, and read the WHOLE 'Crows' manga, this movie is really bad. Not only it's not connected to any Crow series, the plotting is bad. I know, the director doesn't want to make it similar to the Crow manga and bla bla bla.. It's just like Crow Zero (1), main character comes to the \"Crow\" school as senior, not a junior, are destined to conqueror the school and in the end trying to defeat the unmatched guy in the school, Rindaman. At least Crow Zero (1) was unique. The Fighting scene, gurhh~~ really, really, really bad. Most of the guys just know how to punch using the right hand and swing it wide and kick using the right foot. Only the dynamite guy got some good move. Even though Shun Oguri not that good with fighting seen, at least he made it look real. I'm writing this sincerely. If the director want to make a 3rd movie, he should at least consider where to put the storyline as the Crow Zero as the title suggested, Zero = Prequel to Crows story. Maybe he just should make it after the storyline of Crows series.",
         "The first 30 minutes is OK but the pacing become slow and slow till the end. Its boring. The first 2 Crows by Takashi Miike is awesome, its not this director is bad or what because he have make some good movie before. The real problem is the storyline, it doesn't have any strong plot in this movie. They use Kenzo story, the former character from previous Crows as a subplot but it still not works. Woman character is less used too in this sequel. But they forget something important in Crows Zero, something really important. The action scene! Although this movie only using street fighting as its martial art, they forget to hire any choreographer! We can see that all action scene here just use some random punch and kick here and there without any art, just like the director or the actor who know nothing about fighting choreographed the fight scene, which is really important for this movie. Even the names are not memorable and stylish at all, we still can remember Genji and Serizawa and it feel so good and cool to saying their name. This movie, I have forgot all their name, I think the hero named Kazeo and its not cool at all. Stay true to the book is the only way.",
         "That Explode Crows name of the title of this film , a film which is a continuation of FilmCrows Zero and Crows Zero 2 , the film adaptation of Hiroshi Takahashi's comics artificial entitled \" Crows \" . Explode Crows movie still tells the story of high school students who aspire Suzuran to the school master. This time the story will revolve around Kaburagi (played by Masahiro Higashide), third graders who moved into Suzuran school and first year student named Ryohei Kagami (played by Taichi Saotome) who wants to be the strongest person in Suzuran. The story itself starts a month after graduation Genji Takiya, so it is rather difficult to expect the character of the two series",
         "Crows as a testosterone fueled, violence heavy gangster series always has its niche. I was rather taken back of how different Explode was to its first two predecessors. It doesn't have the same flair of comical wit, brash vicious scuffle or even the pristine visual. The worst mistake is how it churns so many subplots that none are actually fleshed out. Whereas it's easy to care for Genji and his rag tag friends, the short focus makes it hard to invest to any of Explode's characters. There are simply too many characters presented in short amount of time. With about four plots running at the same time, each with intertwined relationships, the story is hectic and muddled. You have the Suzuran boys, the rival school, yakuza and the other side characters, each with their own back stories and all tied up in convoluted struggles. Even the main character, Kazeo, isn't fully developed. It doesn't help that he as protagonist has so little range, but without wanting to compete or talk for that matter, Kazeo is surprisingly dragged by others. Pacing is plodded with unstable twist, some characters apparently have long relationships despite scarcely being in the same scene for a few minutes. Explanations leave much to be desired as most only mentioned slightly, but later on they would be talking privately merely for dramatic effect. There's not much ground to build on, leaving the eventual clash lackluster. Previous Crows needed two movies to introduce the rival school, but here it's thrown in about one third of the movie. It's probably better to highlight the struggle on Suzuran first as there are considerably many individuals that can be showcased or have feud with each other. As it stands now, most Suzuran students are only shown briefly with one, mostly two, fights under their belts. Compared to its prequels, Explode's most easily notable change is the visualization. It looks significantly drab, lacking the poise that makes Crows Zero seemed clean regardless the murky battle the characters often found themselves in. The shots are appropriate on some instances, but mostly the movie is confined, and for the fight scenes, sadly they don't bring the same level of anticipation. There's a bit of comedy either, but that doesn't really resonate. Fights are pretty good, thankfully the bread and butter of the series serves well. However, even this has some flaws on its choreography. In some cases, characters are seen swinging wild randomly or just standing unmoved. This shouldn't have happened since with few polished and good editing it would look better. I had much hope for Explode, but frankly, and sadly, without the Crows brand it would be just an ordinary gangster movie.",
         "I knew that Takashi Miike wasn't involved with the title, so I kept an open mind when I started watching it. But the fact is this movie was horrible, and It felt like I have been watching this movie for 2 hours when I was only 60 minutes in. First, the casting for this movie was horrible, none of the new actors looked like they are suited for their roles. They tried to do a more complex story but it wasn't captivating, and left out a lot of great character development that we saw in the previous 2 films. The bad storytelling also made a lot of the fights in the movie seem meaningless. Most of the great elements in the series(not only the movies) that made Crows great are completely missing in this film. The moments in the previous movies that made you pumped up along with the great music that came on at the exactly right moments are gone. They tried to forced the issue in the movie with similar situation/music, but it just completely failed because I wasn't into the characters and the story. The fights were also extremely boring lacking the moments where they would pull off some sort of choreographed move. There are a lot more reasons but those are some of the main reasons that I didn't like this film. I can't say that this is an unwatchable film, but all of the different things that they did very well in the franchise are all missing. So, I am guessing you might like it if you didn't like the first 2.",
         "Crows Explode departs from the flashy and energetic style of the previous Crows Zero films by being adopting a somber tone and giving a few of the characters real, fleshed out emotions and struggles. The problem is that this realism is mixed with the typical Crows action craziness of having various cartoonish thugs fighting for control of Suzuran, a high school that apparently has no classes or teachers. There's not enough time devoted to either and the film is unsatisfying as a result. And to be honest, I came for the fighting, but I left wishing there was more time spent on the drama. The dramatic scenes are in that classic Asian macho drama mold of cool/tough guys suddenly bursting into emotion they can no longer contain, with anger, fear, honor, and respect all coming together at once. It's the kind of awesome stuff that Asian cinema does best, but there just isn't enough time spent on the drama here. Too bad, as the little that is here is pretty good.",
         "I am gonna come right out and say it: \"Crows Explode\" is my favorite entry in the Crows-franchise. When I heard the news about a new Crows movie I was excited. Even more so when it was clear that Toshiaki Toyoda will be in the director's chair. I really enjoyed the previous Crows movies and Toyoda's \"Blue Spring\". They show a very unique, if stylized, filmic portrayal of the high school delinquent topic. The combination of Toyoda and Crows works perfectly and results in a Crows movie that really feels like a fresh take the material. Compared to its predecessors \"Crows Explode\" sticks more to the manga source material and presents a wider array of characters. Admittedly none of them sticks out the way Genji Takiya did but they don't need to. The story works even if the characters aren't as defined as in the previous Crows movies. Aside from that the story follows the same formula as before - nothing special here. The way the characters and locations are designed & presented feels even more stylized and over the top than before. But here it really works to the films advantage. I always felt like \"Crows Zero\" and \"Crows Zero II\" never quite managed to find the right balance between realism and the highly stylized action, weird Asian humor and exaggerated drama. Unfortunately \"Crows Explode\" lacks the humor completely. But what I liked best were all these homages (small & big ones) to the first two crows movies and even \"Blue Spring\". From the soundtrack to the set design this film is overflowing with elements reminiscent of the franchise's history. Although I gotta say that I would've liked the soundtrack to be more extensive. Especially from Toyoda I expected \"Crows Explode\" to be exploding (pun intended) with all the timelessly cool songs from \"The Mods\", \"Thee Michelle Gun Elephant\" and \"The Birthday\". I mean they did it before and it worked great why make it different this time? It's kind of funny. I watched the first two movies while I was graduating from school myself so I basically grew with them. They taught me not to have any regrets for my youth and to stay loyal to the people that went on the journey of growing up together with me. It also taught me that we will all have to grow up eventually but should never forget where we once came from. I'd like to see this recent entry in the franchise teaching these principles to a new generation of young viewers who now stand where I stood before them. And I gotta say so far it does this fairly well.",
         "Despite the absence of Miike, Oguri Shun, Yamada Takayuki and the rest of the amazing crew, I never actually held previous prejudices on Crows Explode. But after viewing it, I can clearly state that it falls behind compared to its prequels. Being a fan of Miike's filmmaking, it was unavoidable to miss the highlighted foolish characterization, extreme violence and hilarious black humour inserted everywhere. That being said, I never expected Toyoda to do the same. After all, two different directors have entirely dissimilar ways of making their pictures. Crows Explode leaned to the realistic side way too much which was a bit wrong in my opinion; don't get the wrong idea, immersing the characters and fighting scenes in realism didn't sound like a bad treat but when it's over-done with this type of film then things are bound to become bothersome. To make things clear, this film had too many similarities with its famed prequels. The fight to become Suzuran's top leader was still used as the main thread to drive the plot. However, the fighting sequences to reach that objective were surprisingly demure and repetitive in a worrisome way. Although Toyoda tried to focus on the human emotions between his characters, he didn't exploit his main leads' potential to the fullest. Thus, many feelings couldn't get pass the screen barrier to reach the watcher's heart. Crows Explode narrative pattern was composed of several side stories that didn't serve any meaning at times. At the matter of fact, few of them were just used to fill the running time instead of building characters' back stories. To some extent, most of them were heavy to watch especially with the obvious lack of fighting scenes; they became utterly irrelevant to the film's development. Let's not forget the near-disappearance of black humour – which I clearly don't blame Toyoda for it. The last fighting sequence wasn't blowing but it delivered a nice punch after all. The entirely different cast is worrisome, isn't it? I know that many people can't imagine the \"Crows\" without Oguri Shun and Yamada Takayuki on top of them. I am a big fan of those two actors myself but shockingly, their disappearance didn't make me feel bad. I did want them to be in here but the new faces weren't bad at all. Led by rising stars like Higashide and Yagira, the acting department did the trick for the lack of better words. Some actors didn't convince me much but I can't put all the blame on them, the way their characters' were written didn't allow them to show a wide range of emotions or action. The cinematography was trying to be the same as the two Crows Zero but it didn't come out that way, I believe the yellowish atmosphere is the film's way of distinguishing itself from the others. The directing style and the setting of fighting sequences are debatable but Toyoda made sure to leave his mark which is more than enough to respect a director. Crows Explode had its own touch of filmmaking but the serious realistic depiction that Toyoda decided to use didn't come out entirely right, just like it wasn't entirely wrong. Due to its entirely different pattern, this sequel should be viewed for its own merits, comparing it to Miike's Crows will only make it harder to watch and judge.",
         "Not being familiar with the manga upon which this movie franchise is based, I have nothing to compare it to. So it is solely based on seeing the movie alone that I can review this 2014 movie. First and foremost, I must say that the fight scenes in the movie were plenty and often quite good. But with that being said, I should also move straight on to saying that this movie was essentially nothing else than just one pointless fight scene after another. I managed to last one hour into this movie before I gave up out of sheer and utter pointlessness to the movie. It was nothing else except fighting, and that wore thin already within the first half hour. But I decided to stick with it, as I would assume that the movie would pick up and add some story-telling to the layers. But no, that was not to be. There was no storyline to \"Crows: Explode\" (aka \"Kurôzu Explode\"), none whatsoever. And that fact was something that the movie suffered from tremendously. I just threw in the towel after 1 hour and I am not going to return to finish this movie, and I am not going to take the time to watch any of the other movies, because the torment of watching this for one hour was more than enough. I can't even comment on the acting in the movie, because there was literally no acting in it to base such a comment on. I am sure that people in the movie were good enough fighters in each their own way, but it just didn't appeal to me in any way. This is definitely for a fans of the manga, but for anyone looking for an entertaining movie that is driven by a story, stay well clear of this one.",
         "This Crows movie is GAY!!!! Let me be clear, I am an avid Crows-X-Worst and I have read the mangas including side stories but I am clearly not impressed with the movie unlike Crows Zero 1 & 2 did. The following supports my review. Plot - the plot is a mediocre REMAKE of Crows Zero 1 since I think it's a lot the same. The King of the Hill fight/s for example, for me was the signature scene of CZ1 and I don't think using the same will yield the same impact as the first movie did. Although on the manga, fighting for the top spot is prevalent and the movies does not follow the exact storyline but I am sure the makers could possibly make something more interesting than this from the comics which will wow the audience. For instance, instead of having the King of the Hill fight as the main scene, they could instead make an all out war between Otsu Group(Yakuza) and a one-time unity between all leading factions of Suzuran and alliance with Kurosaki Industrial. It's up to them how to detail the connections on the participants on the war. Fight Scenes - this is the best factor which really disappointed me. Unlike the previous movies where fights were brutal and extremely violent and bloody, it was natural to expect to see the same. But I am very disappointed with those half-ass-ed fights. Honestly, the feeling of excitement from Kagami and Ryohei's brawl was not even worth comparing to Genji and Serizawa's fight to the top. On a side note, I guess the movie guys were told to minimize the violence in the movies, I don't know who reprimanded who but this is just my guess. Lastly, to explain as to why I still rate the movie with 5/10 though it totally left a bad after taste was because they added or should I say enhanced a movie effect/factor, that is the Emotional movie scenes and/or inputs. Let me cite examples which made me appreciate this movie. a. Each main character like Kagami, Ryohei, Shibata and Fujiwara were introduced with back stories with different levels of sadness and emotion. b. Ken Katagiri was already understood to live a normal life in the 2nd movie and acts as support to some characters. I appreciate the role they had for Ken in this movie because he stood not only as an Suzuran alum but also the straightened out Jarhead Ken. Adding a bit of romance between a woman also adds interest in his character. c. The camaraderie between the boys are still decided or leveled with fistfight but, since the characters had deep seated emotional back stories, the friendship they like to show was way more emotional(not that strong and manly) making the bond look like the typical Crows-X-Worst way. Lastly, the movie was not that exciting and thrilling to watch because if you're following the mangas, you will get the feeling of disappointment that they are not advancing to the real storyline on the manga. I know everyone has been waiting for Bouya to come out, honestly I initially thought this will be the prequel movie having the Maki-Pon-Hiromi VS Hideto Bandou characters before officially introducing Bouya but to my disappointment it was not. To sum it up, the makers REALLY need to improve the next movie(if they will still make one) or at least level it up with the first two movies. If they will continue this, chances are, they will defame the Crows-X-Worst mangas prestige also affecting our dear Hiroshi Takahashi's name(which we don't want, right?) and most likely that their upcoming movie adaptation will not sell. Cheers."
      ],
      "genres": ["Action"],
      "productionCompanies": [
         "Akita Shoten",
         "Chubu-nippon Broadcasting Company (CBC)",
         "Happinet"
      ],
      "summaries": ["A month later. Genji Takiya has graduated. New fights begin to see who will climb to the top at Suzuran High School. Meanwhile, a battle against nearby Kurosaki Industrial High School begins."],
      "budget": 0
   },
   "movielensId": 144472,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2014-04-12",
      "dvdReleaseDate": null,
      "directors": ["Toshiaki Toyoda"],
      "runtime": 129,
      "movieId": 144472,
      "title": "Crows Explode",
      "mpaa": null,
      "actors": [
         "Masahiro Higashide",
         "Taichi Saotome",
         "Yuya Yagira",
         "Ryo Katsuji",
         "Takanori Iwata",
         "Elly",
         "Kento Nagayama",
         "Kyôsuke Yabe",
         "Motoki Fukami",
         "Ryusuke Ito",
         "Kenzō Maihara",
         "Tsutomu Takahashi",
         "Suzu Hirose"
      ],
      "imdbMovieId": "2825120",
      "originalTitle": "クローズ EXPLODE",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["fRMxLsNn-ZY"],
      "plotSummary": "A month after Genji Takiya graduates, a new battle for supremacy at Suzuran All-Boys High School begins. Transfer student Kaburagi Kazeo combats Kagami Ryohei for the coveted top spot, amidst a brewing inter-school conflict with Kurosaki Industrial High.",
      "tmdbMovieId": 253451,
      "avgRating": 2.86364,
      "releaseYear": "2014",
      "numRatings": 11,
      "posterPath": "/4g4M16pXdr6JKYDDtEfNTzG9xb0.jpg"
   }
}