{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "patriotism",
            "id": 1627
         },
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "test of courage",
            "id": 2414
         },
         {
            "name": "vietnam war",
            "id": 2957
         }
      ],
      "imdb_id": "tt0444626",
      "video": false,
      "title": "Faith of My Fathers",
      "recommendations": [
         73897,
         32162,
         32241,
         162006,
         32163,
         10109,
         32157,
         32150,
         58679,
         15286,
         77504,
         210966,
         29977,
         52418,
         137400,
         28917,
         44133,
         65881,
         14561,
         41980
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John McCain",
               "gender": 2,
               "credit_id": "52fe478c9251416c7509d74b",
               "name": "Shawn Hatosy",
               "profile_path": "/deVcvUyZEybTQuyBYiioVJ4Lyst.jpg",
               "id": 52647,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Jack McCain",
               "gender": 2,
               "credit_id": "52fe478d9251416c7509d779",
               "name": "Scott Glenn",
               "profile_path": "/aKUJwCKhl4qCi7j7M7TRpqWLmmO.jpg",
               "id": 349,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Carol McCain",
               "gender": 1,
               "credit_id": "58c7d9989251417a2300c164",
               "name": "Erin Cottrell",
               "profile_path": "/tzCRE0xrvD2a4VTzbFzWpxwhfru.jpg",
               "id": 88834,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Cat",
               "gender": 2,
               "credit_id": "58c7d8f7c3a3683dcd00cb17",
               "name": "Cary-Hiroyuki Tagawa",
               "profile_path": "/6KLAW9vcrI1FLLLrTAm0obL4qxc.jpg",
               "id": 11398,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Craner",
               "gender": 2,
               "credit_id": "58c7d908c3a3683dc500bfad",
               "name": "Joe Chrest",
               "profile_path": "/fVaVq1UetdXuWyCHeiLsi0704Qg.jpg",
               "id": 141762,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Prick",
               "gender": 0,
               "credit_id": "58c7d91492514179d200ceb6",
               "name": "Chi Muoi Lo",
               "profile_path": "/mlBxR3PuzUappuaIvKv9ebgOebo.jpg",
               "id": 554095,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Bud Day",
               "gender": 2,
               "credit_id": "58c7d95ac3a3683df300cdfc",
               "name": "Troy Ruptash",
               "profile_path": "/fKW4WbSNM7fDFksevdixUHr9JSD.jpg",
               "id": 102315,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Norris Overly",
               "gender": 2,
               "credit_id": "58c7d96792514179da00c7cb",
               "name": "Shea Whigham",
               "profile_path": "/xlLI0hrutcyKOIHs4b47iSh65NU.jpg",
               "id": 74242,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Charles Larson",
               "gender": 2,
               "credit_id": "58c7d9f5c3a3683ddf00d10c",
               "name": "Jason Alan Smith",
               "profile_path": "/otSnRjxizClhZNrQjFm2YrYsp3j.jpg",
               "id": 106217,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Henry Witt",
               "gender": 2,
               "credit_id": "58c7da24c3a3683ddf00d160",
               "name": "Brian F. Durkin",
               "profile_path": "/u4WCVT4AMZ8vlrUsYQ6L7jsoPzz.jpg",
               "id": 146020,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Captain Hart",
               "gender": 2,
               "credit_id": "58c7da3092514179de00ca9f",
               "name": "Michael Arata",
               "profile_path": null,
               "id": 1037912,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Becker",
               "gender": 2,
               "credit_id": "58c7dafdc3a3683dd700b8e0",
               "name": "Nick Gomez",
               "profile_path": "/aBMQnvk2zayzgfWrp0rS0Ji1xIs.jpg",
               "id": 84760,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Sailor",
               "gender": 2,
               "credit_id": "58c7db09c3a3683ddf00d25b",
               "name": "Douglas M. Griffin",
               "profile_path": "/5QTBIsyxZRo21uYGtpGBxvkz6cB.jpg",
               "id": 60881,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "58c7dc3a92514179da00cb26",
               "name": "John McCain",
               "profile_path": null,
               "id": 223820,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 2,
               "credit_id": "52fe478c9251416c7509d751",
               "name": "Peter Markle",
               "profile_path": "/1fFVurMyXSE742lnz5jCfcNJmCH.jpg",
               "id": 67632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe478c9251416c7509d757",
               "name": "Alan Barnette",
               "profile_path": null,
               "id": 83471,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478c9251416c7509d75d",
               "name": "Peter Markle",
               "profile_path": "/1fFVurMyXSE742lnz5jCfcNJmCH.jpg",
               "id": 67632,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe478c9251416c7509d763",
               "name": "William Bingham",
               "profile_path": null,
               "id": 83472,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe478c9251416c7509d775",
               "name": "Scott Boyd",
               "profile_path": null,
               "id": 34400,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58c7d8bec3a3683deb00b87f",
               "name": "Vincent M. Cresciman",
               "profile_path": null,
               "id": 1339183,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58c7d89fc3a3683dc500bf2e",
               "name": "Bill Roe",
               "profile_path": "/5LCr1ALwS0YEFtjYUFIE633bKuc.jpg",
               "id": 60712,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58c7d8af92514179d200ce32",
               "name": "Velton Ray Bunch",
               "profile_path": null,
               "id": 67637,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58c7dc5a92514179f700c70a",
               "name": "Mark Salter",
               "profile_path": null,
               "id": 1776330,
               "department": "Writing",
               "job": "Book"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.623991,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18638,
      "vote_count": 7,
      "budget": 0,
      "overview": "Faith of My Fathers is based on the story of Lieutenant Commander John McCain's experiences as a prisoner of war in North Vietnam for five and a half years during the Vietnam War, interleaved with his memories of growing up in a heritage rich with military service.",
      "similar": [
         1369,
         1368,
         13,
         289,
         28,
         11778,
         2604,
         5925,
         826,
         409,
         676,
         14574,
         792,
         855,
         227306,
         452,
         600,
         103,
         423,
         10590
      ],
      "original_title": "Faith of My Fathers",
      "runtime": 90,
      "poster_path": "/vrb2xzkNvCpUlJypDmU0LLYkpCj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2005-05-30",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Markle"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Peter Markle",
         "William Bingham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0444626/",
      "coverLink": null,
      "actors": [
         "Shawn Hatosy",
         "Cary-Hiroyuki Tagawa",
         "Joe Chrest"
      ],
      "reviews": [
         "\"Faith of My Fathers\" tells the tale of Senator John McCain's survival as a POW in Vietnam under the harshest of circumstances. His arms and one leg broken in his shoot-down over Hanoi, McCain is stabbed, denied adequate medical treatment and eventually left for dead by his captors, saved only when two other American POWs, Bud Day (who later received the Medal of Honor for his heroism as a POW) and Norris Overly become his cellmates and minister to his injuries. McCain is later faced with a greater moral dilemma when the Vietnamese offer to release him just as his father, an admiral, is about to assume command of all the US forces in Vietnam. McCain sees it for the propaganda ploy that it is and refuses early release even though his injuries warranted him accepting it. He sticks it out for three more years before returning with honor. Despite some of the comments by others, I found Scott Glenn's performance as Admiral McCain quite good. Admiral McCain is a war hero himself and he has to balance his role as a father with his role as a military leader. Invariably Admiral McCain sacrifices his personal concerns for his son's safety in favor of his responsibility for all of the Americans in Vietnam. His sense of honor is as stout as his son's. Admiral McCain seeks no privileges for himself or his son despite his son's harrowing ordeal. The Obama camp can only hope that his movie, first broadcast in 2005, isn't run again and again during the on-going election in 2008. Nothing in Obama's life story begins to even compare to the heroism and character that McCain demonstrated in his life and which is depicted in this movie. People should watch it to get insight into this man who may become President.",
         "This story is a great tribute to those who withstood the horror of being a prisoner of war not only during the Vietnam War, but any conflict. I knew of Senator McCain's story at the time for I was 21 years old when he was released, but did not know the whole story until now. The young man who portrays McCain, Shawn Hatosy, is riveting, he catches every emotion the senator must have gone through during those five years. You can see the touching relationship he had with his career-navy father was the strength he drew from in the years he was imprisoned. It makes you think....how can another human be so utterly unfeeling to another human to think nothing of inflicting such torture and pain. I know the recent photos of our own military inflicting horrible torture upon others makes me see that any human can be inhuman, that it doesn't matter who you are or what country you were brought up in. But that is no excuse and you can see that in this story of how one man stood high and above his captors and never lost his respect for himself or the other prisoners there with him. God bless John McCain.",
         "Shawn Hatosy appears to be managing his career carefully. For a young, relatively unknown actor he seems to look for work in films with casts that include accomplished, known co-workers. He hasn't made the mistake of accepting anything that's offered. The story (McCain's harrowing experiences as a POW) should make one appreciate what McCain has given to his country but my lasting impression of this film is Hatosy's work. His was a very, very good piece of acting. This is an actor who has established a floor under his work which he will not go below. He has relatively high standards which assures viewers that anything he appears in will be good, or very good.",
         "United States Senator and Presidential Candidate John McCain's story about his five and half years in Vietnamese prison camp as a prisoner of war is told here. Most of the cast members are not well-known but they all play very well in this ensemble. The movie does it's best to show the brutality of war and the humanity that sometimes comes within. The actor who plays John McCain as the wounded soldier does a brilliant job in portraying him as a complex but likable fellow. The story offers a background regarding his complex relationship with John's father, a high ranking military man and the family's military history. We only see mother, Roberta, and hear her reaction that her son may not be coming home when his plane is shot at down. The same scene for his wife and the mother of his three children is also shown. We also see how he met his first wife, Carol. The five and half-years is well-documented as painful, violent, and inhumane at times but it built character in John to protect his squadron as well as remain behind rather than go home sooner than later. He couldn't bear to leave his men who became his friends behind. This movie is about politics but about a man's battle to survive with broken limbs but not a broken heart.",
         "FAITH OF MY FATHERS tells the true story of John McCain's military service, capture, and imprisonment in Vietnam during the Vietnam war. Nearly all of this made-for-TV movie is shot with a hand-held camera bringing the drama in close and making it personal. The pacing is fine, although the commercial breaks tended to disrupt more than average. The acting was the highlight of this production. The unknown actor playing John McCain really captures his essence. About the only thing that did not work in FAITH OF MY FATHERS was the shower peeping scene. It was out of place and did not advance the story. Interestingly, the conflict in FAITH OF MY FATHER -- Vietnam communists captors versus the American prisoners of war -- no longer holds water as Vietnam today is mostly known as being Asia's new shining tourist destination. All of the torture inflicted upon John McCain and his fellow servicemen was ultimately for naught. The heroic resistance of the American prisoners was also pointless. As John McCain may run for President again, the war crimes depicted in FAITH OF MY FATHER connects to today's Iraqi prisoner abuse. Would a President John McCain, a torture victim of the Vietnam War, approve of the proxy torture and trained rape canines currently used against today's Iraqi war prisoners? FAITH OF MY FATHER is a fitting companion piece to 1987's HANOI HILTON -- another drama focusing on the daily suffering, torture, and brutal treatment the American P.O.W.s in North Vietnam's Hoa Lo Prison. If I am not mistaken, John McCain was a technical adviser to HANOI HILTON. Very interesting.",
         "This movie appeals to those viewers who are either military or related to a military member. It is a story of what people endure at the hands of the enemy, regardless who that enemy is (reverse roles and you have the Iraqi prison scandal). War is not sterile or \"cool.\" The anger, frustration and hopelessness of those involved in its day to day actions is well expressed in this film. One commentator found fault with the Admiral's (Glenn's father) lack of emotion. As a seasoned military man, emotions are things which the professional soldier puts on hold until the issue at hand is resolved. This story is NOT a warm and fuzzy. McCain endured for years what most people in the US could not endure for one week. We are quick to jump on the depiction of the events and criticize the story but those of us who HAVE served this country in times of conflict can only say that were the shoe on MY foot, would I have the temerity and fortitude to endure this torment? McCain, unlike the present Commander-In-Chief, IS a war hero and this film does justice to him, the US Military and the Code of Honor that upholds our military traditions.",
         "I expected more for an A&E production, and I found the budget lacking. After watching other A&E productions, I found the producers cut a few corners with the high standards of previous A&E movies sets. Faith of my fathers has an excellent message about character, and going the extra mile. I find with my studies, work and my sick wife the movie is inspirational. It shames me into not feeling sorry for myself. The story is lacking in spots. I have never read the book, but I bet it is a long one. When you compress a long book into a hour and a half the viewer only gets a glimpse of the event. I love the part with grandpa and when John talks to his father and the reply is that John left nothing behind. God bless him and his character. I have no idea what I would do in such a situation. I give it a 6 out of 10. The movie left me looking for more. I think I will read the book after finishing one of my majors.",
         "Faithful biography depicting the life of Sen. John McCain as a prisoner of war during the Vietnam War. Coming from a strict military family, McCain is able to weather the storm on confinement and brutality of the North Vietnamese during the conflict. A weak student at the academy, McCain is backed up by his father, a very good performance by Scott Glenn. Glenn portrays a totally dedicated military official who doesn't even shake an eyelid when he informed that his son has been captured. The torture chambers and the torture inflicted on McCain and others is well shown. McCain is definitely pictured as a hero in this film. He refused to be released if it meant having to participate in North Vietnamese propaganda. A very good story dealing with military honor, call to duty and undying patriotism by our men and women in uniform.",
         "Basically a 2-hour film showing McCain getting abused as a POW. I learned nothing about McCain from this except that he was horribly abused. Even how or whether he stood up to it was deliberately left unclear. Or maybe I dozed off in the middle and missed it. What's left out was his reaction, his growth, what he thought about during his time, and what he did when he got out that made him enter politics. In other words, the movie was totally lacking in merit. I gotta figure that McCain's book (on which the movie is based) had to provide all this detail but the producers had no interest in that aspect. As for Scott Glenn, I cannot understand how he agreed to this role. There was no meat here for him to sink his teeth into. Anyone can play the role of a father that never shows his emotion. But the opportunity to go into his inner conflict between being a major leader of the Vietnam conflict and his son's confinement was dealt with in less than 1 minute of the film. Acting from other players was similarly disappointing. For example, there was no in-depth struggle by the actors playing the soldiers who confessed for fear of more torture. What a disappointment.",
         "This movie covers the period time Sen. John McCain spent as a POW at the Hanoi Hilton during the Vietnam war. For those of you who enjoyed this movie but have not read the book I would strongly encourage you to do so. For those of you who have read the book and felt a little unsatisfied with the movie, I feel the same. Unless I missed it they left out Hanoi Jane's visit to the camp which is totally unacceptable. Also, McCain's theft of another persons washrag was not part of the movie. I'm glad a movie was made from this great book, but as is often the case, the movie is substantially inferior to the book.",
         "I wasn't surprised but yet surprised by the treatment that Senator McCain received during his 5 yrs as POW. I thought the movie was rather moving in the fact on how the military can prepare ones own mentality to \"hold on\" to survival and to fight that of brainwashing tactics. I was surprised however to question why the Vietnamese just didn't shoot him and the rest of the POW's......why didn't he leave when given a chance? I believe that there should have been more movies out like this shortly after they ended \"the conflict\" to show the American people more in-depth of the treatment of our herons. With this said, it would of, I believe, been more opened, understanding and welcoming arms reached out to our herons coming home. I thank everyone of them every day in prayer :-)"
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "A&E Television Networks",
         "Alan Barnette Productions",
         "L.I.F.T. Production"
      ],
      "summaries": [
         "John McCain is a poor student, except at wrestling, but toughs it out in Annapolis at the US Naval Academy with the goal of becoming a career naval officer like his father and grandfather, who were both admirals. Love at first sight leads to a marriage and children with Carole. During the Vietnam War, he's shot down and captured by the Vietcong, who torture American POWs. He resists years of torture and misery, only breaking once due to his busted limbs, and eventually returning home after five and one half years in captivity.",
         "The story of John McCain's experience as a Vietnam War POW. Base on the memoir of the same title."
      ],
      "budget": 0
   },
   "movielensId": 144468,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-05-30",
      "dvdReleaseDate": null,
      "directors": ["Peter Markle"],
      "runtime": 90,
      "movieId": 144468,
      "title": "Faith of My Fathers",
      "mpaa": "",
      "actors": [
         "Shawn Hatosy",
         "Scott Glenn",
         "Erin Cottrell",
         "Cary-Hiroyuki Tagawa",
         "Joe Chrest",
         "Chi Muoi Lo",
         "Troy Ruptash",
         "Shea Whigham",
         "Jason Alan Smith",
         "Brian F. Durkin",
         "Michael Arata",
         "Nick Gomez",
         "Douglas M. Griffin"
      ],
      "imdbMovieId": "0444626",
      "originalTitle": "Faith of My Fathers",
      "genres": [
         "War",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Faith of My Fathers is based on the story of Lieutenant Commander John McCain's experiences as a prisoner of war in North Vietnam for five and a half years during the Vietnam War, interleaved with his memories of growing up in a heritage rich with military service.",
      "tmdbMovieId": 18638,
      "avgRating": 3.5,
      "releaseYear": "2005",
      "numRatings": 10,
      "posterPath": "/vrb2xzkNvCpUlJypDmU0LLYkpCj.jpg"
   }
}