{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "coma",
            "id": 732
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "vision",
            "id": 10629
         },
         {
            "name": "car accident",
            "id": 13063
         },
         {
            "name": "school teacher",
            "id": 154842
         }
      ],
      "imdb_id": "tt0341334",
      "video": false,
      "title": "The Dead Zone",
      "recommendations": [
         32162,
         32157,
         32150,
         15286,
         77504,
         29977,
         210966,
         10109,
         37850,
         52418,
         28917,
         206,
         74718,
         137400,
         257568,
         33338,
         44133,
         32229,
         128842,
         73897
      ],
      "backdrop_path": "/cqsRmHf9QPhutrNJVCpeVSH6As7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Johnny Smith",
               "gender": 2,
               "credit_id": "55b8acc092514123d50017b7",
               "name": "Anthony Michael Hall",
               "profile_path": "/eQnkUzHVrO69bQ08W82Qa9idJxp.jpg",
               "id": 1904,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Sarah Bracknell Bannerman",
               "gender": 1,
               "credit_id": "55b8acc8c3a3684afb001655",
               "name": "Nicole de Boer",
               "profile_path": "/2aEdXU5l5VAPfFpDV1Z1j0CbysI.jpg",
               "id": 5888,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sheriff Walt Bannerman",
               "gender": 2,
               "credit_id": "55b8acd792514123d80016ea",
               "name": "Chris Bruno",
               "profile_path": "/wYvuh28G2TgdBzuxChsr4k39atV.jpg",
               "id": 128346,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Reverend Eugene 'Gene' Purdy",
               "gender": 2,
               "credit_id": "59058eac92514169e101949e",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dana Bright",
               "gender": 1,
               "credit_id": "55b909ddc3a3684ae90022b5",
               "name": "Kristen Dalton",
               "profile_path": "/hJE14DbGUWXVQHUxdIClpEcUfFo.jpg",
               "id": 18475,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Dr. Tran, Ph.D.",
               "gender": 2,
               "credit_id": "55b909d292514119cb000d69",
               "name": "Rick Tae",
               "profile_path": "/gHhC2Bm6LHOelOwhlgPQJL7ZyT8.jpg",
               "id": 80351,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Vera Smith",
               "gender": 1,
               "credit_id": "55b909e6c3a3684af5001f6e",
               "name": "Anna Hagan",
               "profile_path": "/ceKbJ7E9FIAHawFnG1vY8o0ySbw.jpg",
               "id": 33046,
               "order": 6
            },
            {
               "cast_id": 3,
               "character": "Bruce Lewis",
               "gender": 2,
               "credit_id": "55b909c792514123d5002289",
               "name": "John L. Adams",
               "profile_path": null,
               "id": 1224831,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55b90a7b92514123dd002434",
               "name": "Robert Lieberman",
               "profile_path": null,
               "id": 27146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59058d20c3a3684ab40199a4",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "59058d3f92514169d8019005",
               "name": "Michael Piller",
               "profile_path": null,
               "id": 2514,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 0,
               "credit_id": "59058d65c3a3684b07016d86",
               "name": "Shawn Piller",
               "profile_path": null,
               "id": 1222720,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 0,
               "credit_id": "59058d83c3a3684a4e0194a7",
               "name": "Shawn Piller",
               "profile_path": null,
               "id": 1222720,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "59058d9792514169e1019411",
               "name": "Michael Piller",
               "profile_path": null,
               "id": 2514,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "59058db292514169fb019945",
               "name": "Michael Piller",
               "profile_path": null,
               "id": 2514,
               "department": "Writing",
               "job": "Teleplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 1.226705,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 352128,
      "vote_count": 8,
      "budget": 0,
      "overview": "A young man awakens from a six-year coma with the ability to see into peoples futures. This is the first two episodes of the television series.",
      "similar": [
         11336,
         336843,
         281957,
         101299,
         12149,
         182560,
         198663,
         75780,
         346364,
         2501,
         2503,
         340666,
         300668,
         169917,
         452507,
         346685,
         1903,
         397837,
         10320,
         343674
      ],
      "original_title": "The Dead Zone",
      "runtime": 83,
      "poster_path": "/oxH3j0MMMcuHIIWDaKiWCEZXWcB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Tiếng Việt",
            "iso_639_1": "vi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Lloyd Segan Company",
            "id": 873,
            "origin_country": ""
         },
         {
            "logo_path": "/uwZ8comDrz5CJWc6hM8CqFsvzwB.png",
            "name": "Lions Gate Television",
            "id": 7601,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Piller2",
            "id": 89704,
            "origin_country": ""
         }
      ],
      "release_date": "2002-11-05",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "The reluctant psychic.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Lieberman"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Stephen King",
         "Michael Piller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0341334/",
      "coverLink": null,
      "actors": [
         "Anthony Michael Hall",
         "Nicole de Boer",
         "Chris Bruno"
      ],
      "reviews": [
         "This is an excellent, first rate series and way better than the original in my opinion. Anthony Michael Hall is utterly perfect as Johnny. He has that certain something that gives his character great intensity and warmth. I'm not the biggest TV fan anymore but with this show, I am totally on the edge of my seat. Take another look at Anthony Michael Hall, he is superb. Great cast, great directing, great plots...this is what good entertainment should be about. I highly recommend it to all.",
         "This is the one that started the superb series that is currently airing! The pilot film stars its regulars Anthony Michael Hall, Nicole de Boer, Chris Bruno, John L. Adams, David Ogden Stiers, and Kristen Dalton. I really liked this film and I have really grown to love the series! I can't say that I am familiar with any of these people but I will say that everyone is very good. Hall makes the whole thing so great. He is really a gifted actor. He makes Johnny Smith have such a great personality and a great guy. Its a weird thing but he kind of reminds of one of My favorite wrestlers the late great Curt 'Mr. Perfect' Henning. Nicole de Boer is a fine actress. Bruno is very good and like hall he reminds Me of another wrestler and shooter fighter and that is Ken Shamrock. Adams is very good and hilarious. Stiers is a very talented veteran actor and he reminds Me movie composer John Williams. Dalton is a good actress too. The music is very good. I love the special effects and how everything stops! If you love Stephen King and really entertaining stuff then I strongly recommend that you see this today! Movie Nuttball's NOTE: This pilot movie is located on the first disc of the Dead Zone: The Complete First Seaon DVD Set. It does however have its own release on VHS and DVD but I recommend that you pick up the DVD set instead of the single because of the on going excellent series! Stop by Amazon.com today! You wont be disappointed!",
         "this is the complete pilot episode for the TV show of the same name.it's surprisingly very entertaining.it's from the novel by Stephen King,and directed by Robert Lieberman.it's very tautly directed and well acted,especially by Anthony Michael Hall,who is the lead character.i liked his character a lot.he was sympathetic and likable.this is one of the better Stephen King adaptations.it isn't necessarily original,but i liked what they did with the material.it doesn't seem fast paced while you're watching it,but it's over before you know it.it is only 87 minutes,but it doesn't feel incomplete at all.the ending is ambiguous,but obviously there are more episodes in the series.for me,The Dead Zone is an 8/10",
         "I never would have believed that Anthony Michael Hall could act like this! This endeavor is wholly impressive. This is the same guy who played Rusty Grizwold in the first Vacation movie. He also starred in Weird Science, Sixteen Candles, The Breakfast Club, and more recently he portrayed Bill Gates in the Pirates of Silicon Valley! *rolls my eyes* Geez. And now, here he is, putting out the quality performance of an accomplished actor! Simply amazing. It simply is not possible that Robert Lieberman pulled from him a great performance, as nothing Mr. Lieberman has ever done has been noteworthy, as yet. Is this a fluke? We can only wait and see. In my opinion, Mr. Hall successfully surpassed Walken's performance with this remake! He is completely believable in the impassioned portrayal of a coma victim who awakens to find himself imbued with powers he can neither explain nor understand. The cinematography of this straight-to-video endeavor is astounding. The pans and the cut-ins are pure professionalism; truly inspired work. The flash backs experienced by Mr. Hall's characters are quite realistically portrayed, lending a feeling of reality to the tale that otherwise was not present in the original theatrical release. Some critics and movie fans have questioned my rating this version higher than the original, but I stand by my judgment of this work. The sense of reality is so high with this adaptation, where the Christopher Walken version is now badly dated and lacks the serious hard-core feeling of this production. \"Atmospheric\" doesn't cover it. All in all, this is much more poignant. The finished product really surprises you. The original is still a classic, and should not be negated. Rather, I suggest you watch the original, then watch this one, and determine for yourself. It rates a 7.4/10 from... the Fiend :.",
         "The straight to video version of the dead zone is a great movie provided you dont expect the whole plot of Greg Stilson in it. For time constaints and budget this flick only focuses on the Murders and how Johnny Smith has to stop the killer. Not as good as the origional movie but worth renting for a good scifi/drama. Highlights: anthony Michael Hall's Johnny Smith. 6.9/10",
         "Nicole plays the perfect part in this series.she has such a open face that tells a thousand story's at a glance. i would love to see her get back with her old flame johnny.they are so suited for each other but i know it would take out the whole mystery of the series.i would like to see them interact more in the series.it always good to see the jealousy that it brings into the story.i feel that his Son is not involved enough in the film.the son and father should go camping and stuff to get the husband to get jealous.this could bring a whole new meaning with the husband being jealous of Nicole and johnny and the son.the whole series is a very true to life series if you think of what mediums can pick up from people.Nicole all i can say is you really rock in the series and it would never be the same if you left.thanks for making my week worth waiting for. Robin",
         "When i first saw the Dead Zone series in the videostore of me residence i never thought it would be so good.I mean if i have to compare it with the shining of Mick Garris and Carrie the 2002 version i say it is a lot better.Of course the film was much better but still this new version is very well directed.The main actor is quiet good and the plot is not bad.I mean i haven't read the book but i can imagine this show follows directly Stephen King's book.I believe Stephen King would be proud of this version. why wouldn't he?It has all these characteristics of a good show.I wonder how the serial would because the video film contains the first episodes of season 1 ''Wheel of fortune'' and ''What it seems''.It is somehow connected with David Cronnebergs it is like you see the first half of 1983 film.A very good choice you will no regret.",
         "This made-for-video movie is actually the first two episodes of the TV series stitched together. They cover roughly the first half of the 1983 David Cronenberg film \"The Dead Zone,\" based on Stephen King's novel. I've never read the book, but I love the movie. And I was looking forward to an updated version with fresh ideas. All this did was poison my memory of the original, which I watched immediately afterwards as an antidote. Johnny Smith (Anthony Michael Hall) is a high school teacher in love with Sarah Bracknell (Nicole de Boer), a music teacher at the same school. But Johnny is smashed up in a horrendous car accident and slips into a coma that lasts for six years. When he awakens, Sarah has married another man, while his once-latent psychic powers come to flower. He now has visions that reveal things from both the past and the future. And this puts him in the path of a serial killer. This version's bumbling efforts show you how difficult it is to make this essentially silly material credible and affecting. Cronenberg made it look easy, while these filmmakers make it seem like an insurmountable feat. What did the writers think when they watched the original? That all the deft, subtle touches needed to be replaced with sledgehammer blows? Take the way these two versions handle Johnny's latent psychic abilities. In the movie Johnny has a weird headache on a roller coaster, which may or may not be a premonition of the car accident he's about to have. In this video-movie we know Johnny is latently psychic because he repeatedly anticipates an old carnival huckster's game of chance. And because he always knows where his mother left her glasses. And because he gets a bad vibe from his mother's new sweetheart. And because of a prologue where Johnny as a little boy correctly predicts that a hockey teammate is about to fall through the ice. So you're saying he has psychic abilities, right? Did they think the story needed less suspense? The movie generates a lot of tension because we never know when the touch of a hand will trigger a new vision. This video-movie kills it by making it a matter of course. Johnny touches someone, he has a vision. It comes off like a comic book superpower, rather than an unmanageable affliction. Did they think the story needed a lot of trick work? It's bad enough anyone would want to lard this story with unnecessary special effects. But when it doesn't even have the budget to pull it off? Johnny now has the ability to freeze-frame a vision and walk around in it. Yet we see the extras blinking and shifting. And the visions are accompanied by flashing lights and sudden camera moves and strange sound effects; the sounds in particular reminded me of the robots changing into cars on \"The Transformers.\" Did they think the story needed less emotion? Both versions have only a brief time to convince us Johnny and Sarah are in love before they are torn apart. The movie does this with a few skillful brush strokes. The video-movie adds some lustful groping, but convinces us only that these two are really attracted to each other. The triumph of the movie is that even with flourishes like psychic powers, a serial killer and an evil lunatic capable of blowing up the world, it's still the story of two star-crossed lovers, still the story of an ordinary man caught up in extraordinary events. It's still human and down-to-earth. This show tries to capture that, but they fail badly. One problem is Anthony Michael Hall. I haven't seen him in anything since his days of playing high school nerds. I was surprised to see that he's aged into a creepy-looking guy with an icy stare. That also describes Christopher Walken, who played Johnny in the movie. But Walken commands enormous sympathy in his role while Hall comes off as shallow and self-satisfied. Nicole de Boer manages to imbue a bit more humanity into Sarah – and bears a striking resemblance to her forerunner, Brooke Adams. But it's not enough to make the love triangle affecting. Chris Bruno plays Sarah's husband (an amalgam of two characters in the original movie) with bland semi-competence. Johnny's physical therapist, who has a few lines in one scene of the movie, now becomes a full-blown character – a wise-ass, dreadlocked sidekick played by John L. Adams, whose every quip is more tedious than the last. And the less said about the eye-candy (Kristen Dalton) playing a snooping reporter, the better. The only intriguing character is the Reverend Eugene Purdy, played by the always-wonderful Donald Ogden Stiers. Johnny doesn't like the reverend, yet the character is neither written nor performed as a standard villain. In fact, he seems sincere and likable and may prove not to be a villain at all. Stiers would be the only reason to continue watching this series. But he's not enough.",
         "Michael Piller works for \"The Dead Zone\" together with his son, Shawn Piller is gorgeous and in its very attractive. Michael Piller is a genius of this time, and all of his work in STAR TREK and \"The Dead Zone\" much use different from the rest of the content. Wherever he showed his initiative in each scenario and the various cinematic work - and it left a very positive mark in the correct general work. Looking at all of his works, you notice how big they are and what their contribution is large, even with a futuristic perspective from the point of view of sociology and psychology. All of his work is notable for its discernment to details. A man who not only did, but created, he could feel the details and pass them so well, that others have not even pondered in his mind. All of his work and ideas have made a great contribution. It is a kind of a genius of our time. Thank you, Michael... And thank you all for your attention, good luck to all you."
      ],
      "genres": [
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Lions Gate Television",
         "Piller2",
         "Lloyd Segan Company, The"
      ],
      "summaries": [
         "Johnny Smith is a high school teacher in love with Sarah Bracknell, a music teacher at the same school. But Johnny is smashed up in a horrendous car accident and slips into a coma that lasts for six years. When he awakens, Sarah has married another man, while his once-latent psychic powers come to flower. He now has visions that reveal things from both the past and the future. And this puts him in the path of a serial killer.",
         "A young man awakens from a six-year coma with the ability to see into peoples futures."
      ],
      "budget": 0
   },
   "movielensId": 144540,
   "movielens": {
      "languages": [
         "English",
         "Tiếng Việt"
      ],
      "releaseDate": "2002-11-05",
      "dvdReleaseDate": null,
      "directors": ["Robert Lieberman"],
      "runtime": 83,
      "movieId": 144540,
      "title": "The Dead Zone",
      "mpaa": "R",
      "actors": [
         "Anthony Michael Hall",
         "Nicole de Boer",
         "Chris Bruno",
         "David Ogden Stiers",
         "Kristen Dalton",
         "Rick Tae",
         "Anna Hagan",
         "John L. Adams"
      ],
      "imdbMovieId": "0341334",
      "originalTitle": "The Dead Zone",
      "genres": [
         "Drama",
         "Science Fiction",
         "Thriller",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young man awakens from a six-year coma with the ability to see into peoples futures. This is the first two episodes of the television series.",
      "tmdbMovieId": 352128,
      "avgRating": 3.52941,
      "releaseYear": "2002",
      "numRatings": 34,
      "posterPath": "/oxH3j0MMMcuHIIWDaKiWCEZXWcB.jpg"
   }
}