{
   "tmdb": {
      "original_language": "ko",
      "keywords": [{
         "name": "howling",
         "id": 15265
      }],
      "imdb_id": "tt2186819",
      "video": false,
      "title": "Howling",
      "recommendations": [
         75006,
         32213,
         50210,
         31714,
         264273,
         52445,
         37849,
         121491,
         344476,
         27516,
         70131,
         71620,
         104176,
         194872,
         133603,
         45089,
         108972,
         42507,
         52418,
         55758
      ],
      "backdrop_path": "/giwTSL7NenQpzX0tcZzK0Okj3rZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 26,
               "character": "차은영",
               "gender": 1,
               "credit_id": "53c1fdc90e0a26157f00a763",
               "name": "Lee Na-young",
               "profile_path": "/A9Wu7L6sCVMwiETu3jrXYJFGd93.jpg",
               "id": 123408,
               "order": 0
            },
            {
               "cast_id": 27,
               "character": "구영철",
               "gender": 2,
               "credit_id": "53da450a0e0a2652e800245d",
               "name": "Lee Sung-min",
               "profile_path": "/3THm2oYIktQ4sqIvhHeRjYLaWXn.jpg",
               "id": 141548,
               "order": 1
            },
            {
               "cast_id": 23,
               "character": "Sang-gil",
               "gender": 2,
               "credit_id": "530de14092514114240023c3",
               "name": "Song Kang-ho",
               "profile_path": "/1JL0Shq6js9Ox2FEIW2vHqIISv9.jpg",
               "id": 20738,
               "order": 2
            },
            {
               "cast_id": 24,
               "character": "서반장",
               "gender": 0,
               "credit_id": "5340150a0e0a26361c001953",
               "name": "Shin Jung-geun",
               "profile_path": "/1uwSOhiUTuyCwkvsBB49KbaNYsq.jpg",
               "id": 578838,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5304ea5cc3a3683a99215c6e",
               "name": "Yoo Ha",
               "profile_path": "/sob06JDhh5U16BgvjcAmZEqVzZ6.jpg",
               "id": 1294627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5304eab9c3a3683a6d1fcd41",
               "name": "Yoo Ha",
               "profile_path": "/sob06JDhh5U16BgvjcAmZEqVzZ6.jpg",
               "id": 1294627,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5304eac6c3a3683a73241ed3",
               "name": "노나미 아사",
               "profile_path": null,
               "id": 1294628,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5304ead4c3a3683a99216e88",
               "name": "Gyeongho Sin",
               "profile_path": null,
               "id": 1294629,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5304eae0c3a3683a9121e240",
               "name": "공평재",
               "profile_path": null,
               "id": 1294630,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5304eb06c3a3683aa120d842",
               "name": "이지연",
               "profile_path": null,
               "id": 1294632,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "53401e89c3a36815270000ab",
               "name": "Daehui Kang",
               "profile_path": null,
               "id": 1299478,
               "department": "Crew",
               "job": "Lighting Camera"
            },
            {
               "gender": 2,
               "credit_id": "57a95c92c3a368254e00e02a",
               "name": "Kim Jun-seok",
               "profile_path": null,
               "id": 459872,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.68919,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 116227,
      "vote_count": 38,
      "budget": 0,
      "overview": "A man is found burned to death inside of a car. Detective Sang-Gil (Song Kang-Ho) and his co-workers investigate the scene. Sang-Gil doesn't want to take the case, because it looks like a simple suicide case and won't help him get the promotion that he desperately wants. Furthermore, rookie female detective Eun-Young (Lee Na-Young) is selected as his partner for the case.",
      "similar": [
         75174,
         12819,
         38500,
         320293,
         188061
      ],
      "original_title": "하울링",
      "runtime": 114,
      "poster_path": "/gQKUQ0CG8F7jlneQ6ZmWKhr7wKu.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Opus Pictures",
            "id": 7270,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CJ Entertainment",
            "id": 7036,
            "origin_country": ""
         }
      ],
      "release_date": "2012-02-16",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.hancinema.net/korean_movie_Howling.php",
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ha Yoo"],
      "runtime": 114,
      "synopsis": "A series of mysterious murders to which the only clue is an animal bite mark There is a reason behind his killings. Sang-gil (SONG Kang-ho) is a homicide detective who is perpetually passed over for promotion. One typically dismissive day hes gets assigned yet another simple case, a suicide, as well as a rookie female detective, Eun-young (LEE Na-young), as a partner. Sang-gil grudgingly starts the investigation, but the case turns out to be a premeditated murder intricately designed to include a time-bomb. Blinded by the chance to earn a long overdue promotion, Sang-gil continues to investigate on his own without reporting to his superiors. Eunyoung questions the oddity of the bite mark on the body, but Sang-gil ignores her. Meanwhile, a seemingly random wild animal attack kills another person, and Eun-young senses a connection between the two deaths. Without realizing the seriousness of the situation, Sang-gil stubbornly continues to investigate the case alone, and Eun-young reluctantly follows along. When the two discover the bite marks on the bodies belong to a wolfdog, a cross between a dog and a wolf, they also discover that all the victims are connected to one another Why did a wolfdog go on a murder-spree?",
      "writers": [
         "Ha Yoo",
         "Asa Nonami"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt2186819/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYxNjQ4MzczMF5BMl5BanBnXkFtZTgwODI1MTAzMjE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Kang-ho Song",
         "Na-yeong Lee",
         "Jang In-ho"
      ],
      "reviews": [
         "This is not a horror or a supernatural movie that the title or poster may imply. This movie is actually a cop thriller that many of us like to see with some intense scenes and it stars in my opinion one of Korea's best actors \"Song Kang-Ho\" (Memories of Murder) who plays the role of the not so straight cop with family issues. Detective Sang-Gil played by Song Kang-Ho is being assigned to solve what appears to be a small suicide case and to train the new unwelcomed lady recruit Eun-Young (Lee Na-Young) to which he refuses. Being bitter because he was passed over for a promotion to another colleague, the detective reluctantly agrees, while his new colleague is being treated differently by her very sexist colleagues. During the course of the movie the new partners discover that a string of murders could be connected and they wonder if the murders are justified and intentional or not, while trying to overcome work and family problems. The lead star gives a good believable performance along with decent performances from supporting actors. The film has a good original story on hand that may have fell a bit short due to a mix of directing, writing and probably length of the movie? Otherwise this is a good movie that could have been a powerful thriller.",
         "Flying below the radar this summer season here between Hollywood tentpole releases is Korean cop thriller The Killer Wolf or Howling, whose rather cheesy title betrays the storytelling quality associated with a genre that the Koreans have become rather expects at delivering. What more, there's one of my favourite Korean actors Song Kang Ho in the lead role, playing what else but a cop who's not exactly squeaky clean, frustrated for being passed on for a promotion he so desires. And add to that, he, and his homicide department, are quite the sexist lot, giving rookie female detective Eun Young (Lee Na Young) one of the worst welcome anyone can provide for new colleagues. The team gets busy with what could have been a straightforward open and shut case of suicide involving self-immolation, but soon the clues start to pile and point to homicide, and then with more bodies turning up with fatal wounds seemingly caused by a wolf going for the jugular, before investigations reveal a loose link between all the victims, and a drug and underaged prostitution ring. Based on the novel by Asa Nogami, The Killer Wolf has plenty of red herrings thrown around, typical of any detective stories to keep you engaged, interested, and hooking you in to contribute your own thoughts about what's true, what's not and who's guilty, but in essence this investigative development turned out to be rather secondary. Written and directed by Yu Ha, whose last film was 2008's A Frozen Flower, The Killer Wolf is very much about the leading characters, and both Song Kang Ho and Lee Na Young excelled in their partnership as unlikely cop comrades who have to transcend their personal prejudices and baggage in order to work together toward their respective goals. For Sang-Gil (Song), he needs a big case all by himself to provide just cause for a promotion, and in Eun Young's case, something to justify her transfer from the traffic police department and to make it as a homicide detective. Emotional baggage comes in the form of Sang-Gil's delinquent son, and in Eun Young's broken marriage no thanks to her late nights as a cop, but these are as fleeting as introduction goes in an attempt to provide a little more depth to the cops. What made this a compelling watch isn't really how the duo went about their investigations, but like what's been seen in other Korean crime thrillers, how sometimes cops can effectively be inept, hampered by their lack of coordination and cooperation amongst themselves, and strangely enough, the sexism here is very much pronounced. Eun Young gets verbally abused countless of times, and what took the cake was that tight slap delivered by a fellow colleague, to which her response was to stand in silence. And all that stemming from listening to her partner and not calling their investigations in for backup purposes for personal and professional selfish reasons. But what doesn't break you only makes you stronger, and the narrative for the most parts deals with Eun Young's determination to make it in her career and posting of choice despite having many first time jitters, and her dogged (pardon the pun) nature puts her very much in the driver's seat as far as investigations into the killings go. Song Kang Ho would fade off into the background from the mid way point, but Lee Na Young more than makes up for his absence with strong charismatic screen presence, who balanced her demure demeanour (some may even claim that it's submissive to her male colleagues) with some action sequences when called upon to become more physical. The suggestion of a wolf-dog hybrid is also intriguing for tossing up plenty of questions, creating an entire arc and characters involving motivation to do what got done, together with bringing on plenty of sleaze factors amongst the guilty. Some may cry foul over how convenient this actually was in coming up with scenes and characters to link everything together, but as already highlighted, the story's really secondary to the strength of characters on display, and has the director keeping every development on a very tight leash, paced well and delivered where it mattered most. Recommended!",
         "Billed as South Korea's answer to 'The Howling'- which is in fact its English title in most, if not, all other territories, 'The Killer Wolf' proves to be so much more than your generic werewolf movie. Indeed, former poet-turned-director Yoo Ha's latest brings to mind Bong Joon- ho's 'The Host', which successfully reinvented the monster movie with sharp social commentary- and though Ha's attempt doesn't reach the heights of Bong's classic, it does successfully breathe new life into the subgenre by combining its sensibilities with that of a crime thriller. It is in the form of the latter that the movie opens, as veteran detective Jo Sang-gil (Song Kang-ho, who coincidentally is also the lead of 'The Host') is teamed up with a young female rookie Cha Eun-young (Lee Na-young making the leap from her usual staple of rom-coms) to investigate the possible self-immolation of a middle-aged male in his own car. Adding to the mystery of that individual's cause of death are the unusual bite marks on the deceased, which suggest he was bitten by some large dog, or even a wolf. With some forensic help and the requisite stakeouts, the pair of detectives manage to pin down the identity of the deceased- though a visit to his apartment unveils a much more sinister background. It turns out the victim was, together with four others, in the business of underage sex trafficking, using his apartment as a den for older men to indulge in their teenage girl fantasies. Clue by clue, Cha stitches together the pieces of a despicable criminal organisation, even as one by one the deceased's associates meet their demise at the mouth of a vicious half-dog half-wolf hybrid known simply as a 'wolfdog'. A lot of the fun in Ha's film is guessing how the many disparate pieces of the puzzle fit together, as the narrative- based upon a Japanese novel by Asa Nonami- twists and turns to reveal the origins of the 'wolfdog' as well as the reason behind its series of targeted brutal attacks. The less you know about the plot the better, and the more attention you pay to the unfolding events the wiser, given the plethora of supporting characters as well as the plot complexities. There is a lot going on, but Ha manages to keep it all together while maintaining a tight tense atmosphere throughout. But anyone who's seen Ha's previous films 'A Dirty Carnival' or 'A Frozen Flower' will know that he is not simply interested in plot but also equally in character. That explains the effort he spends setting Cha apart from the rest, painting her as the newbie ostracised by her colleagues for simply being a pretty female face but who turns out to be smarter and sharper than anyone else. Kudos to Ha for giving Cha more depth than the usual stereotype of a tough determined woman, though his execution- especially a flashback that explains her steeliness- could use a bit more finesse. Next to Cha, Jo is unfortunately sidelined as the gruff old-hand still rankling at being passed over for a recent promotion- and even a subplot very early on about his troubled relationship with a delinquent son is quickly forgotten as the events of the case take precedence. Nonetheless, despite his character's significance in the course of the narrative, it is Song Kang-ho's low-key performance that holds the movie together. There's nothing particularly challenging here for the actor of more demanding fare such as 'Thirst' and 'Sympathy for Mr Vengeance', but Kang-ho is a perfect foil against the entirely serviceable performance of Na-young. It isn't difficult to see why the actress had chosen Cha as her breakout role, but the sweet fresh-faced Na-young is sadly out of her depth here. That's particularly apparent in the scenes where she is required to imply an emotional connection between her character and that of the 'wolfdog' after the latter saves her life, which could have been more poignant in the hands of a more capable actress. Still, she isn't as bad as some reports have made her out to be, though a large part of that credit goes to her co-star Kang-ho. Arriving in the midst of much summer bombast, it's easy to overlook a smaller, less-hyped movie like 'The Killer Wolf'- especially given its rather tacky English title. Yet those looking for some good old- fashioned intrigue and suspense will find that this Korean hybrid of a werewolf movie and a serial killer thriller offers both in one taut package, and if it's something different from the typical Hollywood spectacle you are looking for, then make this your film of choice. www.moviexclusive.com",
         "The opening credit sequence gives away the heart of the story away, but does not of course, gives away the structure or the journey of the story. You got to admire how far the S.Korea movie industry (in fact everything form electronics, cars, TV drama, to movies ..etc) has come within last 5-10 years. They had a good base of directors and technicians, and keeps on turning out more. You see the way most of the dialogue between the 2 main leads is carried out in a different way. Facing the camera, like they are talking to you. It mixes me up. At times you are looking in their eyes reacting to the moment. At times, it is kind of distracting, taking you out of the movie. Yet the plot, progression and character built up is the ride of this movie. Piece by piece, clue by clue, the journey builds. Even though it's a basic copy buddy movie, it's not a pair you see. A male and a female pair in an Korean setting. And yet this is a smoke screen. The main lead is the female, as she gets stronger, tougher, more determined, even though she is out numbered most of the time, even when she is with her team. She is the smarter one, the more intuitive one, an surprisingly, the more gutsy one. ** spoiler *** The identification with the wolf is what makes this different or fantastical almost. In a lone, loyal, sentimental animal you see the feelings, tragedy behind the case. And it's heartbreaking to force the hand at the end. It is the with repressed emotion that leads the traffic cop is able to solve the case, and it is with full release of this that she needs to end the case. But she can not. What a heart breaking ending. But she forever remembers the night she ran with the wolf.",
         "I was fooled by the cover and the title. Not only that, it was filed here under horror, had to do better research before buying because this had nothing to do with horror, it's just a straight thriller. But not a bad one I must admit. The killer here is a wolf. And it never becomes cheesy or hilarious because what happened throughout this flick could really happen. Only the girl working together with the police is a bit funny because you could see it coming that she will become the hero. Still, it's watchable and not bad after all but doesn't contain much red stuff although the wolf do attack. If you are looking for an original story then this is your stuff but to say that it is suspenseful that's exaggerated. Gore 0/5 Nudity 0/5 Effects 2/5 Story 3/5 Comedy 0/5",
         "I just watched it, and... don't know what I gonna say because its actually not good enough. Song kang ho is the reason why I watch this movie, and as usually Korea always come up with a different idea for their movie such as Howling whatever but still cannot run from their cliché policemen movie like memories of murder, chaser, secret reunion etc. That's make me frustrated. The story is about a man who died cause by a natural combustion, but after further investigation they found out that is the homicide, later then someone killed by wolf and coincidentally related to that burned man and investigation happen. Not like what I expected, their investigation just running happily, I mean no surprise at all. Lot of predictable moment, same kind of policemen from The Chaser and same kind of hero from Secret Reunion, they save our eyes by put one girl on the screen but unfortunately forget to fill in some love interest that make this movie look drain. Just curious why they always give Kangho the same character, he is a good actor but always become a policemen or crooklike man, yelling and kicking. I gave 7 because its a good movie, but maybe I watch too many korean stuff so I get used with their work thats make me demand more. Enjoy this if you like a mystery movie! Worth watching once in a lifetime then forget it.",
         "Howling takes a somewhat unbelievable plot and runs like a wolf with it. The two detective protagonists do an exemplary job carrying the film... but the real hero of the film is the avenging wolf-dog. I must admit I was never bored during the shots of the beast running or staring out with piercing eyes. If this were an American film I'm sure Hollywood would have made a mess of the sexism subplot and turned the whole thing into some clumsy \"message\" movie. In this context the other detectives came off as jerks and one couldn't help but root for Eun-yeong & Sang-gil to solve the case before their colleagues. Once it was determined that the deceased were all \"bad guys\" it seemed a little odd that revenge wasn't even considered as a motive until later. The scene with final kill was sad and expertly done. That sealed the deal for me. Unless you dislike avenging wolf-dogs, you can't really go wrong with Howling.",
         "More character study than thriller, with terrific performances by Korean mainstay Song Kang-ho (Snowpiercer) and preternatural beauty Lee Na-young as detectives on the trail of a murderous dog trainer. Working amidst sexism, incompetence, and infighting among the police, Lee's rookie cop begins to identify with the true killer as the case becomes more complicated. Lyrical drama is well written and acted, as the characters struggle to understand each other and inflict pain without knowing why. Even the one committing the murders is an innocent who desires human connection. A cut above boilerplate Korean thrillers and worth seeking out.",
         "So, this film plot is dumb. Just really dumb. It kept me engaged for the first hour , I will admit. I can't tell you why. Maybe because I didn't know yet that the \"killer\" was a dog. I ended up turning it off right before the big ( I assume) ending. I knew the dog killed everyone and why, but there was one more victim, that they had not found yet. I turned it off because it wasn't worth investing anymore. First of all, this movie has the most annoying characters I've ever met in my life. Not being Korean, or from Korea, I deduced that this was an inside peak at some very culturally revealing scenes and dynamics ( realism) the misogyny was disturbing. The woman drove me up a wall. She was such a wimp, and just let herself be abused by these ugly jerks in the police department. I couldn't stand that aspect of the film. I think I watched it for so long because I was waiting for this woman to get her revenge , somehow. It never came. She just kept getting slapped by her co workers, insulted and blamed for everything that wasn't her fault. Over again. At the point when she packed up her stuff, and left her desk, I said bye bye. Your plot was stupid. Your entire cast except for her and two criminals hard to look at, I hated all of the characters except for her, you suck. Korea. You suck. I did manage to get some gratitude going on for being American , which rarely happens now a days. I can't believe that Korea was OK with the release of this film. It makes them look so bad. They are almost as bad as the Islamic nations , as far as women are concerned. Well, at least you don't get gang raped if you leave your house alone. Ya. Skip this one. It's a dud. Stupid, far fetched plot. No climax, too long, and just doesn't deliver ; anywhere. It would have been cool if the woman, who was a better detective than any of the men in the department, would have gotten some sort of acknowledgment or revenge- like kick the living crap out of half those guys. Esp the jerk that got the promotion. Korea, if you're reading this, I have a huge resentment against you. Time for some changes, buddy.",
         "The plot was a little too far-fetched and the sexism ruined the film for me. The way the female detective was treated in this film was pretty vile. You can tell it was written and directed by men. The story had promise, but once it unfolded it was a little too unbelievable. I wanted to see the female at some point take charge and not sit back and allow herself to be physically and mentally abused by her male counterparts. It was obvious that she was more intelligent than the guys around her, yet she continued to allow them to ridicule her and treat her poorly. Perhaps this film needs to be remade with a strong female lead."
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "CJ Entertainment",
         "Opus Pictures",
         "Film Poeta"
      ],
      "summaries": ["Veteran detective Sang-gil and beat cop Eun-yeong are in charge of a case that seems to involve a simple act of self-immolation. Sang-gil initially thinks that it was an accident, but dog bite marks discovered on the body lead him to believe that someone had terrorized and murdered the victim. He and Eun-yeong investigate the source of the drugs found in the body and discover the victim had been pimping out young girls. At the same time, another murder involving a wolf-dog crossbreed occurs The two cases are labeled serial killings. With a connection between the victims uncovered, Sang-gil and Eun-yeong track down a potential witness. While questioning her, one of the mysterious dogs strikes out of the blue, killing the witness and stunning the cops."],
      "budget": 0
   },
   "movielensId": 144550,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2012-02-16",
      "dvdReleaseDate": null,
      "directors": ["Yoo Ha"],
      "runtime": 114,
      "movieId": 144550,
      "title": "Howling",
      "mpaa": null,
      "actors": [
         "Lee Na-young",
         "Lee Sung-min",
         "Song Kang-ho",
         "Shin Jung-geun"
      ],
      "imdbMovieId": "2186819",
      "originalTitle": "하울링",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A man is found burned to death inside of a car. Detective Sang-Gil (Song Kang-Ho) and his co-workers investigate the scene. Sang-Gil doesn't want to take the case, because it looks like a simple suicide case and won't help him get the promotion that he desperately wants. Furthermore, rookie female detective Eun-Young (Lee Na-Young) is selected as his partner for the case.",
      "tmdbMovieId": 116227,
      "avgRating": 3.03846,
      "releaseYear": "2012",
      "numRatings": 13,
      "posterPath": "/gQKUQ0CG8F7jlneQ6ZmWKhr7wKu.jpg"
   }
}