{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "killing",
            "id": 627
         },
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "evil doll",
            "id": 9707
         }
      ],
      "imdb_id": "tt0416853",
      "video": false,
      "title": "The Doll Master",
      "recommendations": [
         284063,
         132957,
         376549,
         32161,
         37502,
         32173,
         153750,
         75931,
         10109,
         73897,
         238647,
         32170,
         21797,
         45089,
         21792,
         72074,
         32152,
         32249,
         84251,
         32242
      ],
      "backdrop_path": "/8fUVQFAYwQcsSD378JzTtCP1hkV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hae-mi",
               "gender": 1,
               "credit_id": "52fe4913c3a36847f8187edf",
               "name": "Yu-mi Kim",
               "profile_path": "/ycCSshJEJUk90Po5MhfqSOC1tZw.jpg",
               "id": 145379,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mi-na",
               "gender": 1,
               "credit_id": "52fe4913c3a36847f8187ee3",
               "name": "Lim Eun-kyeong",
               "profile_path": "/3pqxG9MhSTssNv8EBgwQQeobuHa.jpg",
               "id": 232017,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tae-seong",
               "gender": 2,
               "credit_id": "52fe4913c3a36847f8187ee7",
               "name": "Shim Hyung-tak",
               "profile_path": "/m6mBboU3kKovG5iKEnrylu5xWeB.jpg",
               "id": 232018,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Yeong-ha",
               "gender": 1,
               "credit_id": "52fe4913c3a36847f8187eeb",
               "name": "Ok Ji-young",
               "profile_path": "/6v54Yo7XXtA0kvck93dKPOIR2GG.jpg",
               "id": 120901,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jeong-ki",
               "gender": 2,
               "credit_id": "531ac14dc3a3685c3d0041c3",
               "name": "Lim Hyung-jun",
               "profile_path": "/o2MXDUEYQytCRPYTONgDSMwhafc.jpg",
               "id": 1299473,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Seon-yeong",
               "gender": 1,
               "credit_id": "56255ef992514163d500755c",
               "name": "Ka-Yeong Lee",
               "profile_path": "/rxUQYdtTgwRdRc4A7QCWvYsDd1h.jpg",
               "id": 1524360,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Director Choi",
               "gender": 2,
               "credit_id": "564f48319251414b01004140",
               "name": "Cheon Ho-jin",
               "profile_path": "/o3qqszP1yoWxUtdCsJ8t5um1MyH.jpg",
               "id": 87090,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5a881d83c3a36862a7049dd2",
               "name": "Jeong Yong-ki",
               "profile_path": null,
               "id": 583175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a881d980e0a2653b304ea28",
               "name": "Jeong Yong-ki",
               "profile_path": null,
               "id": 583175,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.107262,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 56790,
      "vote_count": 25,
      "budget": 0,
      "overview": "Five young people, a quiet doll maker in a wheelchair and her dedicated helper, a chained old man in the basement and a mysterious young girl in red... all together in a lonely doll museum in the woods. What starts out as a fun trip to pose for new dolls soon turns into a nightmare that not everyone will survive.",
      "similar": [
         1690,
         250546,
         19994,
         1991,
         4232,
         19912,
         10764,
         2667,
         16871,
         396422,
         156022,
         126889,
         298250,
         381288,
         76617,
         282035,
         505177,
         588,
         1949,
         49530
      ],
      "original_title": "인형사",
      "runtime": 90,
      "poster_path": "/8vWjjP1v96RAKqnjs1ApUTOGv9W.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [],
      "release_date": "2004-08-06",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yong-ki Jeong"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Yong-ki Jeong"],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt0416853/",
      "coverLink": null,
      "actors": [
         "Yu-mi Kim",
         "Eun-kyeong Lim",
         "Hyeong-tak Shin"
      ],
      "reviews": [
         "I wandered into Blockbuster with a friend the other night having decided that we were too broke and too lazy to do active. She decided she wanted to watch Closer, which seemed like such a repellant idea that I had to rent another film for once she'd gone to bed. Looking around I didn't see much that interested me, but saw The Doll Master in the new releases section. Just based on the cover sleeve (A woman with a doll-like face crying tears of blood) I thought this would be interesting enough to rent. As for the film itself, watching it in an almost empty house, with all the lights turned off it was pretty scary. I must admit I've always had a bit of a phobia of dolls since I was a kid (and watched an awful film called Asylum, one of the stories in it involved a mental patient creating a doll which killed people. Lame, but scary at the time) and the first three quarters of this film really hit the spot for me. The first half hour in particular was awesome. The creepy foreboding atmosphere really set the scene well, and without moving the dolls seemed genuinely threatening. But unfortunately as soon as they did start to move it all got a bit cheesy, I was a bit disappointed when moments that could have been genuinely frightening made me laugh because of the way they were filmed. As for the characters, it's a horror film, you're not really expecting anything memorable. I found I remembered names and faces better than most Asian horror films I've seen, which suggests there must have been some hidden character development that I didn't consciously notice. The typical stereotypes are out in force in this movie each one having some kind of character quirk that sets them apart from the others, from shy and quiet Yeong-ha and her doll Damien, to the outgoing bimbo Seon-yeong. The plot itself was fairly cool, even though the ending, which bought together many of the loose strands of plot, seemed a bit confused and didn't really do anything for me, although it did have a couple of really cool plot-twists that I won't ruin here. The basic plot is a bunch of kids are invited to be modelled as dolls by a famous reclusive old doll maker, they have to stay in the creepy house (adorned with scary dolls, some big some small) and things start to happen as our heroine Hae-mi starts to explore areas of the house and things start happening to the other inhabitants. Overall, I would definitely recommend the film, not to watch with too many people as some of the moments would probably make you laugh if surrounded by friends, but as something too watch on your own in the dark, with the windows and doors open just a bit, just in case any dolls feel like watching with you. It really does leave you guessing for most of the film, allowing you to go off on wild conspiracy theories only to completely destroy them later on. If you really get into it and ignore it's cheesiness in places I can guarantee you'll check under your bed before you go to sleep and maybe even leave the lights on. Or maybe that's just me :P As for Closer, it was OK but I preferred this.",
         "I couldn't disagree more with those who says this is a lousy movie. Me and my friend went to see it during the Stockholm film festival and this was actually one of my favorite movies during the festival. Dolls being used in horror movies aren't something new but I haven't seen that many movies were it has been as well carried out as it is in this movie. The atmosphere, the setting, the actors, the camera-work.. everything is just beautiful. And they really work well with each other. Now if you expect this film to be another Grudge or Ring then you probably won't like it. But if your out for a good, stylized scare then it's perfect. Even though it's pretty predictable and at some times laughable I still recommend this to anyone who likes horror flicks. Go see it. Now.",
         "A cute sculptor Hae-mi and four other people are invited to a gallery of dolls.They are excited to pose to be a doll model.Superintendent Mr. Choi and Jae-won a doll-maker are the hosts who invite them to this gallery.After just being in the house a short while strange things start to happen to each one of the newly arrived guests and there are also other strange things going on there,like a man being chained in the basement and some weird acting girl in a red dress showing up every now and then.I must admit that the dolls in \"The Doll Master\" are spooky as hell.However the climax is disappointing and the pace is slow.Still \"The Doll Master\" is decent enough to watch it once.6 out of 10.",
         "It's quite simple that those who call this movie anything below \"decent\" do not know their cinema. \"The Doll Master\" creates a sense of dread and suspense rarely seen in movies outside of Asia. Think of a mixture of \"Manga\" and \"Ringu\" rolled into one and this is what its all about. First rate acting, first rate direction, first rate sets and effects. This is right up there with the best of Asian horror cinema; Ringu, Dark Water and A Tale of Two Sisters. An absolute must. Take it from a guy who knows his movies.",
         "I have recently watched many j-horror movies and now i find this South Korean horror masterpiece and it really shows that South Koreans can also make good horror movies. I give this movie so high rate because i found it really distressing because of these frightening doll's. Many good ideas synthesise with good execution and result is this. This director really knows how to make distressing atmosphere. Normally i would rate this 8 but i give 1 plus point because this is so underrated. South Korea shows what's horror all about. I recommend this to all j-horror fans.",
         "So the Koreans are now knocking off American horror flicks. But they are doing so with style. DOLL MASTER is a close copy of PUPPETMASTER and DOLLS, and even has a little CHILD'S PLAY going for it. Several young adults are invited to attend a special event at a gallery filled with dolls, only to find they are targets of a vengeful spirit. The dolls come to life and do some pretty nasty things to the kids. The gore level is reasonably high, the photography and set design and production values are first rate, the acting isn't all that bad, and the scares are definitely there. DOLL MASTER may not be in the same league with A TALE OF TWO SISTERS or even DEAD FRIEND, but it's close. Give it a watch. You won't be disappointed.",
         "Tale of curse that's spawned by the killing of a doll maker who made a life like doll of the woman he loved. The doll comes to revenge the descendants of those who killed the doll maker in modern day Korea. The movie is well made. The visuals are stunningly good. Plot is pretty exciting, but acting by some of the actors are spotty that takes away from the near perfect production of this film. Korean movies have made a giant leap forward in the 21st century, and it shows in this movie. I think this movie is better produced than some of the venerable Japanese horror movies. The actors are all very good looking. In this sense many of the K movies out does Hollywood produced movies. But as mentioned earlier, in this particular movie, acting could have been better on few of the scenes. Good horror film from Korea, and is worth a watch if you're an Asian horror movie fan.",
         "Yong-ki Jeong's \"Puppet Master only with scary parts\" was the most recent Korean Horror flick I had the pleasure of watching. With the title of \"Inhyeongsa\" in Asia, this movie struck me immediately when I saw it reviewed online, with images that made me think of Puppet Master, Childs Play and other toy/doll based horror flicks in the past. But for some reason I didn't think..\"Boy, this will be tacky\", I imagined it would be creepy and fun. Toysome horror done well almost. The movie starts slowly, but I like that, so it was fine. The score, almost like I found with Acacia, was beautiful and very much reminded me of classic horror scores of the past. I wont give much away, but the story was strong in this one, and I would highly recommend it to any fan of Asian HORROR. It isn't extreme, it isn't to be taken with utmost seriousness, but it is really good.",
         "Well, I just saw this movie and I started thinking that may be I have seen too much Asian horror because I just had one good jump of fear while watching this film. Even when I have to say that this is the most \"frightening\" scary-dolls movie I have seen, I have to say as well that, as an Asian film I was expecting more tension and good psychological horror. It actually only contents a little dose. It has more gore than I expected and that I'm used to (regarding to Asian's movies). Besides, at some point it gets quite predictable, the climax is loose, and a pair of special effects are cheesy. On the other hand the acting was really good, the atmosphere was well studied, because,I mean, the dolls were amazingly creepy and well located. The plot is not bad, it's well justified, but I realized that this is an Asian movie with a north American horror style and that's what I didn't like of it. No offense. Anyway... at this moment I'm wondering if to get rid or not of my old Barbie doll that I keep in my wardrobe. May be she can get upset. :D",
         "Here we have the perfect example of a novice writer and director (Yong-ki Jeong) who, bereft of original ideas, draws on every genre film of note in the mistaken notion that all the classic aspects of old favourites bundled into one movie will add up to a kind of genre mega-movie. So we have a creepy wheelchair-bound woman in black, an old-style lift with security shutters, a maze-like cellar filled with spooky passages, a dungeon in which is chained an Oldboy lookalike, a bunch of young kids ripe for slaughtering, a creepy little girl, a monster with long black hair covering much of her face, murderous dolls and a vampire in a flowing black cloak\u0085 Well, OK, I made that last bit up, but you get the idea\u0085 The central theme of the story \u0096 which someone elsewhere has pointed out is curiously close to the concept behind the Toy Story flicks \u0096 is a good one, and a degree of poignancy is occasionally attained on the rare occasions that writer/director Jeong can tear himself away from providing repeated LOUD NOISES and jump cuts in his unwavering desire to cram as many cheap scares as he can into the mercifully modest running time. But such brief poignant moments are outnumbered ten to one by those that are either illogical or just plain stupid. Twice, chained people are free with one bound with no explanation as to how they achieved such a feat, and our nominal hero is an undercover cop who manages to remember his undercover handcuffs but leaves his undercover keys back in his room and has to nip back to get them in the middle of the action. He does give his suspect a gun to keep them company while he's gone though\u0085 I could go on in the same fashion that the film's conclusion does but that would be cruel. The only positive points I can make about this mess is that the life-size dolls look pretty cool, and the heroine has the cutest smile\u0085 Do yourself a favour \u0096 if you want to watch a film about rampaging dolls rent a Chucky movie; they're trash too but at least they are up front about it\u0085",
         "I really liked \"The Doll Master\". The atmosphere is unique,as the story is set in an old house,in the forest, which is a doll museum. I enjoyed the way the first scene set in the past was connected to the last scenes: we can actually understand the motivations of some characters and the why they act in a certain way. One of the best k-horrors!",
         "The Doll Master is the directorial debut of South Korean director Yong- ki Jeong. It is a story in the House on Haunted Hill (1959) format whereby a wealthy eccentric invites a group of unwitting outsides to their manor for twisted reasons that they're less than upfront about. In this case the eccentric rich person is some sort of doll maker who adorns her house with creepy, life-sized dolls. Every room has some sort of doll in an unsettling pose. Of course, it isn't long before people start dying and you can guess the rest. This film was not entirely thrilling as it was a hackneyed, cliché premise and the acting and filming weren't entirely impressive either. Worth a watch if you're in for some light entertainment a la Steve Beck's remake Thir13en Ghosts (2001), but hardly an earth-shattering experience. This review originally appeared at http://paranoidcinephilia.blogspot.com",
         "Doll Master is an example of a lousy horror film, fallen somewhere in the space with it's two not so well established genres, a horror film and an emotional drama film. Seems like The Doll Master tries very hard to be a very scary horror film, but it fails. The noise of the dolls while moving is like taken from the croak of Kayako in Ju-On, and the crawls are like sadako esquire. The killing dolls will remember you a cute version of \"Chucky\". But compared to Child's Play, this film is more superb. But the story seems a nothing, the brilliant camera shots and the brilliance of acting was taken away cause of the plot. Don' watch this if you are expecting great shocks.",
         "Bought this quite cheap at a video-store and since I've always been fascinated by dolls I simply had to buy it! The film starts out a bit slow, but here you really get to know the characters and their personalities. Then when it starts to speed up you'll be introduced to the horror and how scary dolls really can be. You'll cover your eyes and ears during some parts. The tension is extreme throughout the movie and it constantly changes your perception of the horrors that the characters encounter. What I mean by this is that once you think you've figured out how the horrors can take place, the movie throws something different at you to make you think different. It's a little reminiscent of The Grudge, and adds a new twist to the \"evil doll-genre\". All the actors did a great job, but the once who really stand out are the guy who invites everyone to the mansion and Yu-Mi. Especially Hae-Mi as Yu-Mi delivers a stunning performance. The story is very strong with a lot, and I mean A LOT of twists as well as impressive writing. The plot throws something different at you every 10 minutes or so, never leaving you bored or making you take your eyes off the screen. Only watch this if you want to enjoy a rich story, get freaked out, scared out of your mind and love dolls! 10/10",
         "I have seen few K-horror movies, so I respect the users who have been disappointed but I am shocked that the movie gets such a low rating (5.8 at this time) as it is much better than that. This is not primarily a gorefest though there are violent killings, so go elsewhere if you are looking for that. Rather, all hinges on whether you are ready to go along with the main supernatural premise of the film - if you cannot, then you will find it difficult to enjoy. If you can then there is much to savour in a decent cast of characters, a literate script (especially the first half), great visuals and a true sense of foreboding generated by the inherently spooky rural setting and clever lighting. I let myself go with the flow and found the whole experience truly disturbing. Admittedly the ending is a bit drawn out and melodramatic but contains a really effective twist. As always where possible I watched the movie in the original format with English subtitles - to me that is essential to getting the full atmosphere as intended by the director.",
         "Have to say, the film has a lot of potential to be something really spooky but unfortunately resorts to the almost Hollywood like style sense of horror with the predictable deaths of its characters which makes this look more like a slasher film. It doesn't help that all the characters feel like card board cut outs - the annoying college girl, the annoying male, the uptight and serious guy, the awkward weirdo girl who can't be removed from her doll and our heroine who is sort of in the middle of everyone. They are all invited to a house so the owner can model dolls from their features and find well....there is more going on in this house than meets the eye - like you couldn't work that out for yourself. The film doesn't build up the suspense which would have been perfect considering there are so many creepy dolls in this house - but relies more on the cheap scare tactics which doesn't work at all here. And it is a pity considering the production design and the look of the film has so much to work with. If the director had seen A Tale of Two Sisters and tried to make that approach by slowly revealing things while still maintaining a sense of mystery instead of throwing it down your throat, this would have been a much better film but unfortunately, is on the same level as a teenager slasher film. Disappointing - has its nice moments but overall just as hollow as normal doll - all looks but nothing inside.",
         "The concept for this movie was quite good. But somehow the execution failed on many parts. There aren't many horror movies that I can think of that used dolls that looked so realistic. Especially when these dolls start blinking their eyes or moving hands. So much could have been done with this premise. There were a lot of scenes where there was room for tension and suspense. And I really was expecting creepy things to happen. But never did the movie managed to be scary. One of the main reasons is that the story is too minimal and predictable. I actually thought that they did this on purpose in order to surprise us with some wonderful twist. Sadly this doesn't happen. Well at least not in the way that I hoped for. The cast also failed to make it all believable. It would have been nice if more background was given on the characters. In the beginning when we get introduced to the main character. It seems that she and other characters are invited by some sort of artist. But it also is apparent that they don't have an idea themselves what they are invited for. Of course this is part of the mystery. But it does seem unlikely. If I got an invitation without having a clue what the deal is I simply would not go. Furthermore most characters aren't real likable with the end result that you never actually care for them. Another flaw is that the director deviates from the basic premise which is scary enough and brings up new elements that never get explained and aren't even relevant to the \"Doll Master mystery\". Overall this movie has been a big disappointment to me. If you want to see a good horror movie involving dolls go see \"Dead Silence\"!",
         "The worst ever Korean movie! The plot is ridiculously complex, unbelievable, and the film creates not a single shock. It builds up suspense well enough then leaves you agitated providing no shock or jumpy moment. Whenever there is a chilling moment you are not bothered by it as you're still trying to work out who is who and what is going on! It goes something like this: a modeling company recruit 4 people for a modeling career. but the owners are not what they seem, they have model dolls of everyone and a strange girl is seen walking about the place and the owners have no recognition of a girl. It turns out that everyone is there for a reason and thats as much as i could grasp. The ending is a muddle of killings and you don't know who's a doll who's real and who's dead! i don't recommend it to fans of Korean/Asian horror films.",
         "Have to disagree with people saying that this is a lousy horror film with good acting and camera-work - I'd say it's an okay horror flick RUINED by shockingly abysmal acting and poor camera-work - watch 'Ju-on : The Grudge instead of wasting your time with this garbage. The principal idea behind the film is rather an original one, considering the abundance of killer-doll-based scare-fests which have been foist upon us over the years; unfortunately, the story is handled with all the subtlety of the latest Michael Bay actioner, with a cast of characters which are uniformly unlikable and played with precision-perfect dreadfulness by actors presumably sifted from daytime Korean soap operas. It isn't scary and only succeeds in dampening your expectations of the next Korean horror movie to come-a-calling. Oh well.",
         "Dolls come to vengeful life in this rather predictable little horror tale from South Korea. Despite the Asian influence, in feel and format this is very much a Hollywood-lite production, with a group of rather bland characters brought together in a creepy old house before being bumped off one by one by the porcelain menaces. It's mildly entertaining, featuring some nicely inventive death sequences and a focused pacing, but it's also all so predictable. There are one or two Eastern twists but for the most part this is a very familiar piece of film-making, offering little that hasn't already been mined to death by American producers. The characters are acceptable and drawn true-to-life, but they're a little bland with it and the villains just aren't, well, villainous enough to be memorable. It's entertaining enough by itself, but in the scheme of things, THE DOLL MASTER is a bit of a dud.",
         "Being a fan of horror movies in particular and also being a big fan of Asian cinema, I bought this movie from Amazon and was sort of excited to watch it because it had gotten fairly good reviews, and the cover of the DVD looked appealing. And the cover also said \"Exciting... An atmospheric terror story... A welcome addition to the genre of Asian horror.\" - So with those words and the movie's first impression, I popped it into the DVD player. The story was easy enough to follow, it just didn't really make any particular sense. There were a couple of glitches and holes here and there in the plot, which really made the movie come off less believable than intended. The overall plot is basically discarded dolls returning to life by some spirits and seeking vengeance on those who threw them away and needed them no more. Yeah, alright, not really much of a solid plot right there. As far as \"The Doll Master\" goes for scares, then there was none for me. But I am sure Asian people sitting down with the movie will be in for the odd shock here and there, because of the thing they have with the hair covering the face, lots of that trick being used in the movie. That never was scary to me though. The acting in the movie was adequate enough, though the main actress did put me off. She wandered around with a constant look of grand surprise and shock on her face, that really didn't work. It was like watching a female Asian version of Nicholas Cage here - one facial expression for every scene no matter if it was a sad scene, scary scene, funny scene, etc. That didn't' work well, and I think had they opted with another actress, that would have made it a tad more enjoyable. Don't get me wrong, her acting was fine enough, it was just her lack of facial expressions aside from the one that was glued on there. One of the best things about \"The Doll Master\" was the attention to detail. There was a lot of really nice touches to the house and the dolls in particular, in this movie. So that, at least, was working in favor of the movie. And the scene that worked out the best for me in the entire movie was the toilet scene. I will not spoil anything here and give away anything, just watch it. If you enjoy Asian horror movies, and have nothing better to do, you can give \"The Doll Master\" a go, though you will not be in for anything extraordinary or spectacular. And there are far better Asian horror movies available out there, both new and old movies. I wasn't impressed with this movie one bit, though I did sit through it from start till end."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Ma-in Entertainment",
         "Pilma Pictures"
      ],
      "summaries": ["5 young people, a quiet doll maker in a wheelchair and her dedicated helper, a chained old man in the basement and a mysterious young girl in red... all together in a lonely doll museum in the woods. What starts out as a fun trip to pose for new dolls soon turns into a nightmare that not everyone will survive."],
      "budget": 2000000
   },
   "movielensId": 144526,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2004-08-06",
      "dvdReleaseDate": null,
      "directors": ["Yong-ki Jeong "],
      "runtime": 90,
      "movieId": 144526,
      "title": "The Doll Master",
      "mpaa": null,
      "actors": [
         "Yu-mi Kim",
         "Lim Eun-Kyeong",
         "Shim Hyung-tak",
         "Ok Ji-young",
         "Lim Hyung-jun",
         "Ka-Yeong Lee",
         "Cheon Ho-jin"
      ],
      "imdbMovieId": "0416853",
      "originalTitle": "인형사",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": ["naF8-ji4y8A"],
      "plotSummary": "Five young people, a quiet doll maker in a wheelchair and her dedicated helper, a chained old man in the basement and a mysterious young girl in red... all together in a lonely doll museum in the woods. What starts out as a fun trip to pose for new dolls soon turns into a nightmare that not everyone will survive.",
      "tmdbMovieId": 56790,
      "avgRating": 3.2,
      "releaseYear": "2004",
      "numRatings": 15,
      "posterPath": "/8vWjjP1v96RAKqnjs1ApUTOGv9W.jpg"
   }
}