{
   "tmdb": {
      "original_language": "ro",
      "keywords": [
         {
            "name": "gypsy",
            "id": 394
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "romania",
            "id": 179882
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt4374460",
      "video": false,
      "title": "Aferim!",
      "recommendations": [
         130824,
         123648,
         336216,
         355600,
         215407,
         186332,
         270886,
         56256,
         58227,
         47100,
         46707,
         36241,
         43974,
         164328,
         334924,
         374452,
         336212,
         128042,
         328216,
         38775
      ],
      "backdrop_path": "/3z4GoitKfBdo6t3oapfGF7ZBBmk.jpg",
      "revenue": 105097,
      "reviews": [{
         "author": "Reno",
         "id": "56cdf1c692514152ab0001b9",
         "content": "> Adventurous,  funny, thrilling and shocking!\r\n\r\nThe second movie for me from this director after a beautiful child custody dramedy, 'Everybody in Our Family'. This was totally different, a historical theme that takes place 200 years early to the present. This is a black and white flick that perfectly blends with the timeline of the narration. The Romania's submission for the 2016's Oscars. I have not seen all the foreign movie nominees, but having seen the out of the contest films like this and Brasil's 'The Second Mother', they are a lot better than the actually in the race film, 'A War'.\r\n\r\nComing to this movie, I was almost certain that I wasn't going to write a review after knowing about it through the trailer and the synopsis despite good ratings and praised by the critics. Because I felt this must be a boring kind, so was thinking to get over with it. Like there's a saying, don't judge a book by its cover, it happened right here for me with this movie. So this is where I realised after the watch that the Academy Awards was totally wrong for snubbing it. In fact, this was one of the best foreign movies I have seen in the last six months or so.\r\n\r\n> \"When a wise man opens his mouth, open your ear.\"\r\n\r\nThey might have had a solid reason for that, that I don't know, but my guess is the film's ending. The opening was slow, the dialogues were loud, but sometime foolishly funny and sometimes wisely funny. Overall you must pay close attention, so that you can enjoy jokes. Definitely a wonderful adventure, like any other man hunt films, this was so serious on that affair, but viewers won't realise that till the final scene. A well supported music throughout to tell an incredible tale about two men on the mission who meet different people, land, culture and language.\r\n\r\nIt is 1835, in the Eastern Europe region, Wallachia, the father-son duo from the police force on a trail to track down a runaway slave. They must go beyond their territorial limits to find him. On their way, they came forwards to the people they just met needed help, and vice versa, After the intense search they grab him in the remote place, but his version of the story to flee differs. So what comes later is the final act and a very shocking conclusion.\r\n\r\n> \"Fear is shameful, but healthy. It's God's gift.\"\r\n\r\nNot so interested to very into it is something that I was not expected. The reason was obvious it was funnier than I thought. Besides that, I was uncomfortable with the slavery theme. It's turning me off from having a good time and beginning to concern. But that's how the old world was, as it was based on the old documents and texts of the real event. After that horrifying finale, the bold statement from the father to son that goes like this 'God, even looks after worms and we can't look after each other' is what made me think we had come a long way since, yet do everything has changed now? And you know the answer to that.\r\n\r\nIt was not an unusual storyline, I have seen hundreds of other similar films, but it was from the different country, hence different language, culture, comedies, landscapes and different outcome result. Well, this film gets you at with the different moods at the different level of the narration. A fine merges of multiple genre, and yet delivers more than you anticipating. If you are wondering what is the meaning of the title, 'Well Done' or 'Bravo' is the English translation.\r\n\r\nLow budget movie? But, that's the reason this movie makes a very interesting. Because the 19th century tale and this film that kind feels like made in the early 30s (except the high framerate) pretty unlike to any modern black and white films. Definitely a must see if you're interested in this year's Oscar nominees for the best foreign movies, even though it did not make.\r\n\r\n8½/10",
         "url": "https://www.themoviedb.org/review/56cdf1c692514152ab0001b9"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Costandin",
               "gender": 2,
               "credit_id": "54e07995925141027c004baa",
               "name": "Teodor Corban",
               "profile_path": "/pwUTD7HMK45B8Mo9R5DyMm6HIts.jpg",
               "id": 479941,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Ionita",
               "gender": 0,
               "credit_id": "54e0799c925141195a004e96",
               "name": "Mihai Comanoiu",
               "profile_path": null,
               "id": 1427391,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Carfin Pandolean",
               "gender": 2,
               "credit_id": "54e079a3925141454f002d80",
               "name": "Toma Cuzin",
               "profile_path": "/kiyQ6mtblJiP1HAG4M6so0YwhHp.jpg",
               "id": 592230,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Iordache Cîndescu",
               "gender": 0,
               "credit_id": "54e079aa925141194b005639",
               "name": "Alexandru Dabija",
               "profile_path": null,
               "id": 1315264,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Smaranda Cîndescu",
               "gender": 1,
               "credit_id": "54e079b19251411953004feb",
               "name": "Luminița Gheorghiu",
               "profile_path": "/obAYbjfxsY9t3pinft5vH2QzwBJ.jpg",
               "id": 39961,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Stan Paraschiv",
               "gender": 0,
               "credit_id": "54e079b9925141027c004bac",
               "name": "Victor Rebengiuc",
               "profile_path": "/rUAgbA3pxUWsLnuJh1V3jhR6Xaz.jpg",
               "id": 557862,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Tintiric",
               "gender": 0,
               "credit_id": "54e079bfc3a3684541005d8d",
               "name": "Alberto Dinache",
               "profile_path": null,
               "id": 1427393,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Priest on the road",
               "gender": 2,
               "credit_id": "54e079c8c3a3684551005a14",
               "name": "Alexandru Bindea",
               "profile_path": "/vDRnU7BL3gg2oLkd7IbMNiraopC.jpg",
               "id": 559779,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Sultana",
               "gender": 0,
               "credit_id": "582f2d789251417f8c003cf5",
               "name": "Mihaela Sirbu",
               "profile_path": null,
               "id": 1112874,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Zambila",
               "gender": 1,
               "credit_id": "582f2d88925141381800d749",
               "name": "Adina Cristescu",
               "profile_path": "/6GA5RrhziAOyLjdSXxhYrQhLAY3.jpg",
               "id": 1628053,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Traveler",
               "gender": 2,
               "credit_id": "582f2d95c3a3683e2c0040c5",
               "name": "Șerban Pavlu",
               "profile_path": "/zRxb750VJrnlWs57kMXRNN3peFt.jpg",
               "id": 592227,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Vasile",
               "gender": 2,
               "credit_id": "582f2da49251417f8c003d25",
               "name": "Gabriel Spahiu",
               "profile_path": "/orChMrEqTkwdWWnB0FfqT9qow5v.jpg",
               "id": 60422,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54bf25349251413635008b9e",
               "name": "Radu Jude",
               "profile_path": "/aRVYVYQvKBXKI7zIkaoN3vaU2uu.jpg",
               "id": 588822,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54e07945c3a368537a0049c5",
               "name": "Florin Lazarescu",
               "profile_path": null,
               "id": 1315263,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54e07951925141027c004ba2",
               "name": "Radu Jude",
               "profile_path": "/aRVYVYQvKBXKI7zIkaoN3vaU2uu.jpg",
               "id": 588822,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54e0795dc3a3684551005a07",
               "name": "Jiri Konecny",
               "profile_path": null,
               "id": 1425608,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e07967c3a3684551005a0a",
               "name": "Elie Meirovitz",
               "profile_path": null,
               "id": 1427387,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e07972c3a36857560033ad",
               "name": "Ada Solomon",
               "profile_path": "/7NjdcEuPcaL1mAGh4UvY4AbG0Um.jpg",
               "id": 60407,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e0797c925141027c004ba6",
               "name": "Rossitsa Valkanova",
               "profile_path": null,
               "id": 1427389,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e07987c3a3685446004354",
               "name": "Marius Panduru",
               "profile_path": null,
               "id": 931382,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54fee71c9251410e51001504",
               "name": "Dana Paparuz",
               "profile_path": null,
               "id": 1437663,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54fee73a9251417893001293",
               "name": "Augustina Stanciu",
               "profile_path": null,
               "id": 1389453,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54fee74cc3a36810a4001769",
               "name": "Catalin Cristutiu",
               "profile_path": null,
               "id": 1437664,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54fee782c3a368109800159c",
               "name": "Viorica Capdefier",
               "profile_path": null,
               "id": 1437665,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 2.281644,
      "production_countries": [
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         },
         {
            "iso_3166_1": "BG",
            "name": "Bulgaria"
         },
         {
            "iso_3166_1": "CZ",
            "name": "Czech Republic"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 319993,
      "vote_count": 36,
      "budget": 1379375,
      "overview": "Set in early 19th century Romania, a policeman, Costandin, is hired by a nobleman to find a Gypsy slave who has run away from his estate after having an affair with his wife.",
      "similar": [
         27066,
         283227,
         37265,
         4507,
         28468,
         244772,
         1259,
         843,
         6114,
         24016,
         21484,
         86467,
         36630,
         713,
         69,
         116,
         1907,
         581,
         1955,
         14
      ],
      "original_title": "Aferim!",
      "runtime": 108,
      "poster_path": "/1JDfbdR6RaLc8smQRZmDadQrmhw.jpg",
      "spoken_languages": [
         {
            "name": "Română",
            "iso_639_1": "ro"
         },
         {
            "name": "Türkçe",
            "iso_639_1": "tr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "HI Film Productions",
            "id": 8698,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Klas Film",
            "id": 70098,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Endorfilm",
            "id": 80500,
            "origin_country": ""
         }
      ],
      "release_date": "2015-01-22",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Black and White",
      "budgetCurrency": "€",
      "directors": ["Radu Jude"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Radu Jude",
         "Florin Lazarescu"
      ],
      "originalLanguage": "Romanian",
      "imdbLink": "http://www.imdb.com/title/tt4374460/",
      "coverLink": null,
      "actors": [
         "Teodor Corban",
         "Mihai Comanoiu",
         "Toma Cuzin"
      ],
      "reviews": [
         "A runaway gypsy slave in early 19th-century Wallachia is hunted down by a constable and his son in Radu Jude's most accomplished and original feature yet, \"Aferim!\" In his two previous films, Jude's leitmotif was people's inhumanity to one another, full of power games and humiliations. Here he stays true to the theme, using this black-and-white oater to trace the roots of Romanian society's less positive characteristics. While its tone is occasionally overly strident, \"Aferim!\" is an exceptional, deeply intelligent gaze into a key historical period, done with wit as well as anger. \"Aferim!\" is an Ottoman Turkish expression meaning \"bravo!,\" a word used with deep irony in the film but one that can equally be directed, without any irony, at the director. A great deal of the freshness lies in the way Jude dispenses with traditional historical-film trappings even while cleaving to the classic structure of fugitive-hunting Westerns.There's nothing staid or prettified here, and while a significant amount of background research is on show, the helmer uses it to re-create an atmosphere rather than a specific, sacrosanct event.",
         "I think it's almost impossible for someone who is not a Romanian speaker to really get most of the dialog in this movie. There are a lot of archaic words and expressions from funny to sad or contemplative that are for sure lost in translation. I am a Romanian, born and raised in this country, and I didn't understand 30-35 % of the words. I have to see it again with subtitles on to fully appreciate the mesmerizing Wallachian dialect. It's a great movie nonetheless, with beautiful cinematography and solid performances from the actors, so I strongly recommend it to anyone who wants to see how life was 200 years ago in Romania.",
         "Being based on lots of writings from that era, I suppose that this movie reflects a fair image of life in Tara Romaneasca (Wallachia) of the 19th Century, with its' patterns and prejudices. It probably does some justice to today's Romani, when Europe encounters them again and there is no narrative to explain who their ancestors were. And maybe it does some justice to today's Romanians too, when the European public finds out what is the distinction between Romanians and Romani. The movie can evoke amusement, disapproval, empathy. However, the spectator discovers more and more that comedy turns to tragedy. I appreciate the fact that Aferim has complex characters that are not entirely positive or negative.",
         "I'm of Romanian descent, so I'm not entirely objective on this, but as far as film can actually change perceptions of how we see the world around us, \"Aferim\" is without a doubt an unmatched masterpiece and an absolute first in many ways. It's a rare Romanian historical drama set before the 20th century (with the exception of historical biopics of communist era). It's thematically a Western (or Eastern), since it involves a long journey on horseback, strongly and intentionally recalling \"The Searchers\". Most importantly, it's an endless series of interchanges with representatives of society back then, by which virtually every social problem of the present day is touched. The genius of this film is that it follows a timeline, through which the spectator is at times bemused and at times horrified by the behavior of the main protagonist, a constable charged with capturing a runaway slave accompanied by his inept son. In a thoroughly realistic way unlike any historical film I have ever seen, we see him treat priests and nobles with respect and peasants and Roma with indifferent cruelty. Sometimes he shows a conscience, as when bonding with his son or asking the slave owner for clemency upon returning him. Sometimes he is shockingly ruthless, like when he sells a Rom boy they also picked up to a passing noble because he wants to afford drinking and whoring. Not only is this the first portrayal of slavery in Romania, a topic not taught in schools and therefore quite controversial. It is a completely naturalistic portrayal as well, unlike any emotionally charged tales out of Hollywood. It easily beats the credibility of \"12 Years a Slave\", because Jude maintains a sardonic, matter-of-fact narrative instead of drenching his film in moral lessons about the nature of good and evil. Teodor Corban delivers his cop character as a product of his times, with no judgment or exoneration of his actions. If there is one slight weakness at all, it's that the dialogues are sometimes very fast and probably very difficult to translate. As a Romanian raised abroad, I found myself guessing at roughly half of the vocabulary, and even though I got most of the irony, I would not know how to explain it to foreigners and keep the meaning intact. \"Aferim!\" means \"Excellent!\" as a Turkish exclamation (recalling that Wallachia at he time was a vassal to the Ottoman Empire - when the constable sends a Turkish carriage the wrong way to spite the Turks, this is how his son praises him. So the title perfectly describes the film in one word - a tale of a time when the ignorant hated everyone else, not realizing how similar they were. When the privileged few treated the abject poor as mere objects, aided by the apathy of commoners, who could not imagine any alternative. This horror mixed with irony resonated strongly with audiences, and would certainly justify a foreign language Oscar next year.",
         "an useful film. for understand the roots of modern Romania. a beautiful one. for archaic language's flavor, for the nuances of emotions, for the powerful clichés who defines the Walachian society not only in the year 1835. a seductive film. for the good performances, for the crumbs from great films, for the art to broke the limits between artistic film and documentary. an interesting film. for the science to reflect a period's deep lines of life. for humanity and for the grace of details. for the art not to remand but recreate not only a portrait but a state . for dialogs and for the values. for something who reflects the profound Romania behind the definitions or verdicts. Teodor Corban does an admirable job and Radu Jude becomes more than a promise for Romanian cinema. because, for the foreign public Aferim ! could be a slice of exotic world from Balkans in the XIX century. for the Romanians it represents chain of answers for a lot of questions. and, maybe, an exercise of honesty.",
         "What critics and audiences call 'the Romanian New Wave' is not that new any longer. Already in its teens it has focused on the present times, and the recent past of Romania - the last decade of the Communist era and the 'transition' period the country went through after the fall of the Communism. By doing so it neglected a tradition built into the history of the Romanian cinema - the historic movies. The first grand Romanian movie made more than a century ago was already a historic film, bringing back to screen the War of Independence of Romania in 1877 several decades after the event. The genre was taken over and polluted in the Communist period by many films which not only brought on screen heroic episodes and heroes of the Romanian history but also distorted it on the lines of the National-Communist propaganda of the regime. This may be the reason Romanian directors, producers, and audiences as well avoided the genre for a while. It is only in the last few years that historical themes came back to screens in more significant movies - the war period and the Holocaust first. Now 'Aferim!' by Radu Jude goes further back in the past, to the first half of the 19th century. His film (blessed with an important prize at the Berlin Festival early this year) however has also strong and explicit implications in the realities of today's Romania as well. Folks who know the history of Romanian cinema and remember some of the films made decades back will recognize elements of atmosphere and quotes. The 'Eastern' genre which took the structure of the classical American Westerns bringing on screen local characters or even changing the landscape to the fields, forests and mountains of the Romanian countries was popular in the 70s with the 'Haidouk' series but also in the works of Dan Pita (the 'Ardelenii' series). The inspired black and white cinematography credited to Marius Panduru and the very conventional generic that opens the film brought in mind the even older 'Tudor' by Lucian Bratu made in 1962 which dealt with events that took place 14 years before the year 1835 when 'Aferim!' is situated. The violently naturalistic nature of some of the scenes has also its roots in the Romanian literature (Liviu Rebreanu's novels) which were also brought to screen. Yet, this film aims more. The story of the local sheriff (let us use this name for the sake of the international audience) and of his son searching for a fugitive gypsy in the forest and swamps of Wallachia is not just a road movie or an initiation story from the perspective of the young lad destined to inherit the profession of his father. It is a deep and cruel reflection of the prevailing attitude not only of the ruling class but of the whole or great majority of the population of Romania towards other nationalities. The story and the characters come in a frontal manner against deeply rooted stereotypes like the welcoming attitude of Romanians towards strangers or the positive role of the Orthodox church in the moral fiber and education of the masses. It is actually a priest who speaks on screen a tirade full of prejudice against all categories of strangers living or getting in contact with the Romanian at that time - Gypsies of course, but also Jews, Turks, Russians, etc. Folks less familiar with the history of Romania should know that by 1835 Romania was still broken into smaller countries under Turkish, Austrian and Russian rulers - so what is seen on screen has a historical perspective. It is however the relation with the present that comes in mind immediately for those who know history and present. Romania as other East European countries have a big social and ethnic problem with the lack of integration of part of their Roma (gypsy) minorities. The roots of this situation lay to a great extent to the slavery practiced on this minority until mid 19th century. Slavery was abolished (in 1855-1856) but prejudices stay. The merit of Radu Jude is to avoid any excuse or sweetening of the historical facts, while telling a coherent story and creating characters who are not only credible but also memorable. He carefully builds the atmosphere, habits, language of the time in a well documented manner. He is helped by a fine team of actors - Teodor Corban and Mihai Comanoiu as the father and son, Toma Cuzin as the fugitive (would have deserved maybe more screen time to give more complexity to his character), and Alexandru Dabija as the cruel but credible landlord. Two of the best actors of Romania from the older generation Victor Rebengiuc and Luminita Gheorghiu appear in short roles, which shows that even important artists were interested to be part of this cinematographic experience. I feel that 'Aferim!' is a film that was much talked about since its release, and will be even more talked about in the future.",
         "Set in 1835 in Walachia, Romania, we meet Consatndin who is a Constable – he is accompanied by his eager but less effective son – Ionita. They are chasing an escaped slave, this is a Roma man who has stolen money and run away from a Boyar (who has the most impressive hat imaginable). Along the way the two men come across many more Roma – whom they refer to as 'Crows' (because crows are black) and treat them like the underclass they believe them to be. They also run into a number of other – less than savoury – characters including the World's most xenophobic Priest. What follows is story that can be seen as comedic, harrowing and at times almost bewildering in its depiction of what times were like. The enslavement of the Roma is a subject rarely mentioned and so this is groundbreaking in many ways. It is filmed in black and white and is lit in such a way to make this seem many years older than it is, Director Radu Jude said this is a western and did a lot to evoke the early westerns in theme and composure of the story, but he has also created a film that is unique too. There is violence here and scenes that some may find upsetting but it is just an amazing watch. Languages are Romanian, Turkish and Roma with OK sub titles to be fair. The title 'Aferim' means 'bravo' in Turkish and as the Romanians hated the Ottoman Empire it is ironic that they use this word as a form of praise – but that is intentional. Nominated for the 88th Academy Award for Best Foreign Language film I feel this is in with rather a big chance and is a film that I can absolutely recommend to all World cinema fans.",
         "an old story. about a society and its people, traditions and every day life. a film who reminds a world who has only reflection for a lost age. same brutal language like many Romanian films after 1989, the same desire for appreciation, using dark clichés. . but a special message. like a testimony, a kind of parable, as a bitter story about life, world, destiny, justice and faith. Radu Jude does an good work.with a profound commercial purpose. but he explores the profound manner to discover/define an universe who describes the habits of present Romania. so, a gray movie , decent performances, nice script - puzzle of old writings, songs ,careful documentation, delicate traces from Bergman, trip in heart of a circle who remains frame from Balkans. a film who could be a deep subjective history lesson. in fact, only support for reflection. about the roots of present.",
         "By Daniel K. Buntovnik \"Aferim!\" is (virtually) the first film ever to depict the enslavement of Rromani people that occurred for some five hundred years in the present day territories of Romania. The film's writers set out elucidate a period which Romanian society is for the most part reticent to acknowledge — much less critically engage with. The void is not less existent in the Anglosphere. While critics have proclaimed \"Aferim!\" to be \"something new\", they have also touted the film as a Western à la Vlach, pointing to influence from this genre observable in its frequent shots of expansive landscapes with men on horseback and wagons. This is hardly groundbreaking in and of itself, since the conventions and tropes of this seemingly quintessentially American film genre were long ago appropriated (and, to an extent, subverted) by Europeans on both sides of the Iron Curtain, giving us the Spaghetti Western and the Red Western, aka the Eastern. Both had significant overlaps with the Revisionist Western: a genre that undermines narratives of the Wild West as the domain of the white settler. \"Aferim!\" has also drawn comparisons to more recent American slave movies, but it is certainly much more than a rehash of these films, never losing sight of the brutal particularities of the 19th century Wallachian context. Insofar as this particular historical period has until recently remained unvisited by cinema, we are not coming back to anything, but approaching something new. What we do revisit in \"Aferim!\" are actually present day social attitudes (in particular, antiziganism). The Revisionist aspect of the film also means pushing back against what little narrative does exist acknowledging the enslavement of Rromani (and Tatar) people at the hands of the Romanian Orthodox Church, nobles, and principality-states. In Romania, the \"official\" narrative is to downplay and minimize the reality of Rroma enslavement. Its main tactics are to highlight alleged fundamental differences between \"sclavie\" (slavery) and \"robie\" (another supposedly milder form of servitude unique to this region). This stress of difference between \"sclavie\" and \"robie\" is at the same time accompanied by a playing up of the similarities between \"robie\" and feudal serfdom. \"Aferim!\" demolishes these pedantic arguments by laying bare the chasm of difference between social statuses ascribed to Gypsies and Wallachian peasants. In this regard, \"Aferim!\" is a \"Revisionist Eastern\". Despite its orientation towards the past, the film is clearly forward thinking. At one point, Costandin engages in an interrogatory monologue about relations between the living and the dead; he wonders how \"we\" (21st century people) will remember \"them\". What will we say about \"them\"? But this monologue is ambiguous. \"They\", the dead, could be he and his son (and the larger white, Orthodox community they belong to), but the dead could just as easily be the Gypsy slaves in their captivity. Costandin's comments reflect the research of ethnologist Patrick Williams presented in his book \"Gypsy World: The Silence of the Living and the Voices of the Dead\". For Williams, the way that European societies erase and render Rromani communities invisible was reflected in the way the French Gypsies he lived with (seemed to) render the dead invisible by avoiding talking directly about them and by discarding their belongings whenever possible, and treating the belongings with a special level of care and respect if it was not possible or very undesirable to discard them. \"In order to constitute their real presence,\" Williams writes, \"they have chosen to refer to real absence.\" Accordingly, Costandin is quite right when he concludes with the assumption that any breach of this silence will be a curse (\"If our descendants do say anything about us, it will only be to curse us,\" he says, and I paraphrase.) \"Aferim!\" is a Revisionist pox upon the \"official\" narrative of Gypsy slavery because it does much to break the silence about it. The film brings dishonor to the dead partisans of slavery in exposing them as the cruel, naive, close- minded bigots that they were, and it may even bring shame to their descendants, those who have vicariously and transgenerationally inherited their attitudes. It was without a doubt for this very reason that King Carlos III of Spain demanded the erasure of any mention of the \"Great Gypsy Round-up of 1749\" (which resulted in decades of enslavement for Rroma in Spain) from the preamble to a new law on Gypsies in 1772 on the pretext that \"it does little honor to the memory of my brother (Fernando VI).\" Costandin illustrates a middle class psychology in a lot of ways. He exalts himself over the slave Carfin, while he practically cowers in fear of the master Iordache. Costandin almost seems to redeem himself when he shows skepticism towards the dehumanization of Rroma; he asks a spiritual authority if Gypsies are indeed human beings. He is not impervious to the injustice inherent in enslavement, but within the logical confines of the system, profit is simply higher on the priorities list. Costandin attempts to put \"a human face\" on slavery. When this proves to be impossible, social atomization allows him to sacrifice others on the altar of his narrow self-interest. Ultimately, \"Aferim!\" shows that promises of \"gentler injustice\" are likely to end in depraved perversity.",
         "Indeed, you have to know the 19th century background of Romania, however it portraits it in a very good manner: the atmosphere of the epoch and the subject is dealt with in depth! It seems that we already saw this movie (or its subject)with other slaves (mostly black people in other countries endorsing slavery)however this one is a special case.All actors are excellent and the black and white colors intensify the dramatic aspects (wonderful forest takes!). I am lucky to know modern Romanian, because the dialog is very important, revealing the behavior, tradition and prejudices of the time (that in some areas of the country are still there...)far away from so called \"politically correctness\" endorsed in the western culture!(watch the priest opinion about different nations, especially the Jews!). In relation to dialogue, the last sentences of the father to his shocked son are an excellent example of how most of the people behave in face of horrors and injustice!",
         "If we had to give into the tradition of selecting the best movie of the year, I would undoubtedly select \"Aferim!\" for 2015. What strikes first is the quality of the image, an elaborate black and white with subtle tones of grey, very sharp texture and dramatic grades of shadow and light. This creates an aesthetical contrast with the grim atmosphere and living conditions depicted. It is the story of a manhunt in 19th century Romania, where a policeman (actually a mercenary hired by the boyar, a local noble) and his son chase a Gypsy to bring him back to the boyar. (Note: I will use the term \"Gypsy\" and not \"Roma\" to avoid confusion.) *** WARNING: CONTAINS SPOILERS *** One of the strengths of the movie is its successful combination of genres and styles. HISTORICAL. \"Aferim!\" very realistically depicts the life of the region at that time and notably Gypsy slavery which lasted until mid-19th century (a very rare topic in cinema). There is a strong historical research behind the movie. The structure of society is extremely pyramidal, with the boyar at the top, then his henchmen, then poor peasants, and at the bottom Gipsies. Women always are a level lower than men (wife, daughter, prostitute). There is no law: the boyar is the law, he decides what happens on his territory and hires mercenaries to have it mercilessly applied. We understand this happens on all territories. It is a reign of terror: if the policeman fails he will be severely punished. This is why we cannot fully blame the latter for what he is doing: he is brutal, but he is constrained by a system and his ignorance. Ironically, the title \"Aferim\" (highlighted by an exclamation mark) means \"Bravo\" in Ottoman Turkish, but we wonder what one could say bravo about in that society (characters use this word in the movie, since the region was for a long time part of the Ottoman empire). Important side note: it is not a movie bashing Romanian history since it has universal reach; the same barbarity happened elsewhere at different periods, including today. MORAL. The movie addresses many topics, the main ones being oppression and intolerance. There is widespread racism (against Gipsies mostly), anti-Semitism and xenophobia notably against Turks. Interestingly, this hatred is most virulently expressed by a priest (pope in Orthodox religion), in contradiction with the tolerant message of Christ: it shows how widespread these feelings were at the time. The policeman is also strongly prejudiced against these communities, and throws in some misogyny and homophobia for good measure; nevertheless he is persuaded to be on the right side of the law and ethics. Ironically, the Gypsy he is chasing, who for him represents evil, turns out to be friendly, more instructed and moral than he is. Another important topic is justice: at the beginning of the story we think the Gypsy did something terrible to justify such a chase, but it is only adultery; at the end, the punishment is completely disproportionate. We also witness poverty, corruption (the policeman searches for bribes and bribes a colleague), superstition mixed with religious beliefs, education, sexuality, etc. As the director highlighted, many of these themes refer to the present world. WESTERN. The director admits being inspired by old Westerns which partly explains the choice of black and white film: a policeman on a horse, a manhunt, suspense, the theme of good vs evil which actually turns out to be complex, different encounters on the road. It also is an initiation story, as some Westerns are: the son is being trained by his father to become a man, according to his beliefs. PICARESQUE. The movie resurrects the tradition of picaresque novels: main character as anti-hero, succession of small and big adventures, meeting of varied and strong characters, realism, satire, pessimism, pseudo-philosophical speeches, etc. However, it goes further down the road of crudity and cruelty. FANTASY. The movie sometimes drifts to unreal scenes, for instance when the policeman and his son in a dark forest are almost run over by a mysterious carriage going full speed. Or when they discover bodies following a massacre they don't understand. Encounters feel at the same time real and dreamlike: a lonely priest, an illegal fisherman, a wealthy traveller, etc. This reinforces the absurdity and arbitrariness of the world depicted. One of the most successful scenes is the frenetic party at the inn, where alcohol brings all men and women together. In this noisy climax the characters show a more human side, although a simple, vulgar one. We feel people could be happy if oppression were not dominant. But the following morning life goes on as before. In summary, \"Aferim!\" is compelling, ironical, sometimes humorous and mostly harsh (be warned: the end is extremely violent). The movie efficiently mixes tones: we are sometimes amused, sometimes appalled by characters and situations. Photography and acting are especially impressive. Pace is fully mastered: not too slow to be intriguing, not too fast to be realistic and provide breathing space. Aferim to all the artists who gave us this grand film.",
         "Why the hell is this film in black n white? I don't have any issue with greyscale photography but from the looks of it, Aferim! appears as if a colourless filter was applied to it without any consideration of how to make it look better for the little enhancements that could've turned its images more expressive & attractive are sorely missing. Set in Wallachia in the early 19th century, the story of Aferim! concerns a local policeman & his son who are hired by an Iordache to track down & retrieve one of his slaves who had run away from his estate after having an affair with his wife. The plot follows the journey of this father & son duo during which the former tries to impart some wisdom to the latter. Co-written & directed by Radu Jude, Aferim! addresses the Roma slavery and covers all the absurdities of religion & caste system that only discriminates one from another. Although its subject matter is harsh & affecting, the fine use of wit in conversations between the father & son keep the experience lighthearted for the most part but its final act turns out to be more disturbing than expected. It's quite evident from the background that the locations are beautiful to look at but it would have looked far more appealing if the entire movie was filmed in colour for its black-n-white camera-work only ends up seeping the life out of those images, thus rendering it colourless both literally & figuratively. Performances are quite good, Editing however is lethargic & it's a pain to sit through if the conversations don't work out for you. On an overall scale, Aferim! is driven by its heavily-worded screenplay, brilliant contribution from its leading duo, and its discomforting depiction of a shameful era in Romanian history. Dressed as a western, the film will manage to keep the viewers' interest alive solely on how they react to the father-son conversation which virtually goes on from start to finish. A very strange mix of brutality & hilarity, Aferim! was good for me only during the final 15 minutes.",
         "Great historical ode about Romanian people and other ethnicities that could have been found in early 19th century Romania. Aferim! explores some essential questions and subjects about life, religion and relationships between human beings, with the consciousness and mind typical for the man of that time. Also, there were a lot of films this year with great cinematography but Aferim! takes my vote in that department. I think the best yet simplest description for this film would be \"Romanian Andrei Rublev\". Another jewel in European filmography but before all enormously important film for Romania, from cultural and historical aspects.",
         "A grand film from Romania, directed with surety by Radu Jude, is even stronger because it is dealing with age old bigotry against gypsies, offered in contemporary language (many F bombs here – at least in the translation) that suits the theme well, and since we are dealing with prejudices on every level, the choice to make the film in Black and White makes it all the more pungent. AFERIM! Is not only an interesting historical statement, but it is also a parody of the religious practices of the 19th century – Christian monasteries and encountered priests on the road speak of why gypsies are inferior descendants of Noah's son Ham and there for are to be reviled. But gypsies are not the only people who are mocked by the father/son travelers in this quest for capturing a renegade gypsy: the father speaks about the nasty traits of the Turks, the Greeks, the English, the French, etc etc etc leaving no one in the world (which by the way is not round but ends in a precipice!). But on to the story – and there is one worth seeing: 'Set in early 19th century Wallachia, when a local policeman, Costandin, is hired by Iordache, a boyar (local noble), to find Carfin, a Gypsy slave who had run away from the boyar's estate after having an affair with his wife, Sultana. Costandin sets out to find the fugitive, beginning a journey full of adventures. Gypsy slavery lasted from the 14th century up until the middle of the 19th century, a situation which is very little known and almost nonexistent in the public debate today, although its impact continues to influence Romania's social life.' This little film slipped by viewers and it is hopeful that under the auspices of BIG WORLD PICTURES it will garner enough attention that audiences today will witness the very profound lessons it tells with such a gift of comedic dialogue. We all have much to learn from this film.",
         "It is 1835. Constandin and his son are searching for a runaway slave, to be returned to his owner for a reward. Constandin is the local constable and during the journey he is trying to teach his naive, uninterested son what his job entails. Constandin is the protagonist of the piece, and the story is told through his eyes and he is in nearly every scene. His character is the most developed and I felt the son and the slave's personae could have used some padding out. I have never been to Romania and know little of its history. We find that prejudice and racism are endemic in the country at this time, as well as abject poverty and blind ignorance. The screenplay is shot through with these traits and in many ways mirrors the U.S. around the same period. The slave in question is a Gypsy, who apparently were a despised minority and subject to the same indignity and humiliation as minorities in our country were. If we are to believe the screenplay, there was a distinct lack of national moral character and ethical bankruptcy rife in Romania at this time. Constandin, who is the most upright individual we encounter in the film, trying to make a man of his young son, stuns us and hires a whore for him at an overnight stop. He congratulates his son afterwards and continues to impart some of his unique wisdom and worldliness as they continue their travels. Earlier, they come across an Orthodox priest who delivers a comical rant containing all the bigotry and prejudice he can muster, omitting no ethnic group. Do such deeply-held sentiments and moral lapses continue in present-day Romania? The film was shot in black-and-white, although the poster on the website is in color, and is billed as a comedy/western/drama. The latter categories fit better, as there is very little humor to be found. I appreciated the photography which as a reviewer mentioned gives it an authentic look. But \"Aferim!\" is a bleak and depressing film and ends on a very downbeat note. As such, it does not fall under my definition of entertainment, and I can only recommend it on the basis of its technical accomplishments.",
         "Some displays of racism can be so lurid and outlandish that they actually short-circuit the usual feelings of outrage one ought to have when witnessing such things. (The 1975 film Mandingo immediately comes to mind.) It's not hard to believe people thought and felt this way back in the day, but it's hard to relate to them as actual human beings and not just demented caricatures of humanity's ugly collective past. Thus, it's much harder to actually feel anger towards them. Aferim! does a fine job of offering you both sides of the coin - the absurdity and the outrage - in one masterful cinematic package. The modern viewer can observe a place as alien as 19th century Wallachia with clinical detachment, smirking as these ignorant bumpkins - a slave-catcher and his teenage son (along with a priest who briefly tags along) - ride across the bucolic countryside and discuss gypsies (and Jews) in the most over-the-top, Borat-esque way imaginable. But the sentiments expressed and their social consequences are of course very real (in fact, some of the dialogue was taken from \"historical record\"). After the runaway is captured and his interactions with the father-son duo imbue all three with relate-able human qualities, the underlying dynamic of the film is driven home in the brutal, visceral finale - and the floodgates of outrage and sadness are bludgeoned open, leaving the weight of all you've just witnessed to simmer in your soul for days to come.",
         "Aferim! (2015) is a Romanian movie written and directed by Radu Jude. Aferim! is a truly unique film. According to the introduction (by Yuriy Reznik), the Roma (called Crows by the Romanians) were slaves in Romania for centuries. (Slavery of the Roma was not outlawed until 1856.) This historical fact has been forgotten, presumably because it was actively suppressed. In fact, Aferim! is the first and only modern movie to show us Roma slavery. The movie is extraordinarily complex, but the plot is basic. A Roma slave named named Carfin Pandolean (Toma Cuzin) has escaped. Constable Costandin (played by Teodor Corban) has been sent to find the slave and bring him back to the local nobleman. The constable takes his son, Ionita (Mihai Comanoiu) along with him as his assistant. What follows is a film of immense beauty (at times), with moments of fascinating folkloric tradition, and moments of extraordinary brutality. In their odyssey, father and son meet many strange characters. I have no way of knowing whether director Jude is accurately showing us what Romania was like in 1835. However, the movie has the feel of reality about it. Constable Costandin is basically a decent human being. However, he has a job to do, and he's going to do it. He knows that, in this case, the job is an extremely dirty one. He worries about it, but he does it anyway. Constandin is not an educated man, but he has an endless fund of folk wisdom, which he dispenses whenever it's needed. At one point he says something like, \"We have the life we have, not the life we might want.\" That's true of almost everyone in the movie. The wild scenery of Romania is strikingly photographed at first. Each frame looks as if it could be made into a still photograph that would compare with a photograph by Ansel Adams. It might have been my imagination, but it seemed to me that the cinematography got rougher and harsher as the movie progressed. We saw this film as part of the Rochester Premieres series at the excellent Dryden Theatre at the George Eastman Museum in Rochester, NY. It won't work as well on the small screen, but if that's your only option, take it. This is a must-see film for anyone interested in modern European cinema. Warning: the action is set in Romania in the 1830's. It's a harsh, violent society. Be prepared for some horrible events.",
         "The second movie for me from this director after a beautiful child custody dramedy, 'Everybody in Our Family'. This was totally different, a historical theme that takes place 200 years early to the present. This is a black and white flick that perfectly blends with the timeline of the narration. The Romania's submission for the 2016's Oscars. I have not seen all the foreign movie nominees, but having seen the out of the contest films like this and Brasil's 'The Second Mother', they are a lot better than the actually in the race film, 'A War'. Coming to this movie, I was almost certain that I wasn't going to write a review after knowing about it through the trailer and the synopsis despite good ratings and praised by the critics. Because I felt this must be a boring kind, so was thinking to get over with it. Like there's a saying, don't judge a book by its cover, it happened right here for me with this movie. So this is where I realised after the watch that the Academy Awards was totally wrong for snubbing it. In fact, this was one of the best foreign movies I have seen in the last six months or so. \"When a wise man opens his mouth, open your ear.\" They might have had a solid reason for that, that I don't know, but my guess is the film's ending. The opening was slow, the dialogues were loud, but sometime foolishly funny and sometimes wisely funny. Overall you must pay close attention, so that you can enjoy jokes. Definitely a wonderful adventure, like any other man hunt films, this was so serious on that affair, but viewers won't realise that till the final scene. A well supported music throughout to tell an incredible tale about two men on the mission who meet different people, land, culture and language. It is 1835, in the Eastern Europe region, Wallachia, the father-son duo from the police force on a trail to track down a runaway slave. They must go beyond their territorial limits to find him. On their way, they came forwards to the people they just met needed help, and vice versa, After the intense search they grab him in the remote place, but his version of the story to flee differs. So what comes later is the final act and a very shocking conclusion. \"Fear is shameful, but healthy. It's God's gift.\" Not so interested to very into it is something that I was not expected. The reason was obvious it was funnier than I thought. Besides that, I was uncomfortable with the slavery theme. It's turning me off from having a good time and beginning to concern. But that's how the old world was, as it was based on the old documents and texts of the real event. After that horrifying finale, the bold statement from the father to son that goes like this 'God, even looks after worms and we can't look after each other' is what made me think we had come a long way since, yet do everything has changed now? And you know the answer to that. It was not an unusual storyline, I have seen hundreds of other similar films, but it was from the different country, hence different language, culture, comedies, landscapes and different outcome result. Well, this film gets you at with the different moods at the different level of the narration. A fine merges of multiple genre, and yet delivers more than you anticipating. If you are wondering what is the meaning of the title, 'Well Done' or 'Bravo' is the English translation. Low budget movie? But, that's the reason this movie makes a very interesting. Because the 19th century tale and this film that kind feels like made in the early 30s (except the high framerate) pretty unlike to any modern black and white films. Definitely a must see if you're interested in this year's Oscar nominees for the best foreign movies, even though it did not make. 8½/10",
         "Aferim! (2016) is sharply funny and uniquely crafted. Usually in a historical movie such as this one you would see a celebration of a certain culture. However, that is totally not the case here. Rather than being traditionally celebratory, the story presented shows how immoral the world used to be. I really loved how telling the story was, while at the same time being incredibly humorous. I also loved how confined yet vast the entire world felt. There were still several moments where I was absolutely bored. I can't say that I was entirely invested throughout the entire duration of the film. Yet there were still scenes which made this movie completely entertaining to watch. Going back to the story: I found that to be the overall best part of the film. Something about it felt completely distinctive and uncommon. The languages used are probably a key factor in helping to create that feeling. 'Aferim!' is charming as a whole, but boring in parts."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "History",
         "Western"
      ],
      "productionCompanies": [
         "HI Film Productions",
         "Klas Film",
         "Endorfilm"
      ],
      "summaries": [
         "Set in early 19th century Wallachia, when a local policeman, Costandin, is hired by Iordache, a boyar (local noble), to find Carfin, a Gypsy slave who had run away from the boyar's estate after having an affair with his wife, Sultana. Costandin sets out to find the fugitive, beginning a journey full of adventures. Gypsy slavery lasted from the 14th century up until the middle of the 19th century, a situation which is very little known and almost nonexistent in the public debate today, although its impact continues to influence Romania's social life.",
         "Set in early 19th century Romania, a policeman, Costandin, is hired by a nobleman to find a Gypsy slave who has run away from his estate after having an affair with his wife."
      ],
      "budget": 1250000
   },
   "movielensId": 144784,
   "movielens": {
      "languages": [
         "Română",
         "Türkçe"
      ],
      "releaseDate": "2015-01-22",
      "dvdReleaseDate": null,
      "directors": ["Radu Jude"],
      "runtime": 108,
      "movieId": 144784,
      "title": "Aferim!",
      "mpaa": "",
      "actors": [
         "Teodor Corban",
         "Mihai Comanoiu",
         "Toma Cuzin",
         "Alexandru Dabija",
         "Luminița Gheorghiu",
         "Victor Rebengiuc",
         "Alberto Dinache",
         "Alexandru Bindea",
         "Mihaela Sirbu",
         "Adina Cristescu",
         "Șerban Pavlu",
         "Gabriel Spahiu"
      ],
      "imdbMovieId": "4374460",
      "originalTitle": "Aferim!",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set in early 19th century Romania, a policeman, Costandin, is hired by a nobleman to find a Gypsy slave who has run away from his estate after having an affair with his wife.",
      "tmdbMovieId": 319993,
      "avgRating": 3.55556,
      "releaseYear": "2015",
      "numRatings": 27,
      "posterPath": "/1JDfbdR6RaLc8smQRZmDadQrmhw.jpg"
   }
}