{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "1960s",
         "id": 208992
      }],
      "imdb_id": "tt4660952",
      "video": false,
      "title": "The Day the '60s Died",
      "recommendations": [],
      "backdrop_path": "/8ORTQQn4lHx4dF5BRubzcxWDj3u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "5585da6e9251416ccb0004db",
               "name": "Gregory Antoine",
               "profile_path": null,
               "id": 1479514,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5585da77c3a368273500134f",
               "name": "Terry Braun",
               "profile_path": null,
               "id": 1479515,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5585da7b9251416ccb0004e3",
               "name": "Gregory Antoine",
               "profile_path": null,
               "id": 1479514,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5a076fe4c3a36833bf004821",
               "name": "Pat Buchanan",
               "profile_path": "/dd42aFTbrbsNj3QoRsKePk8mLWQ.jpg",
               "id": 1230027,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5585da49c3a36837e9000026",
               "name": "Jonathan Halperin",
               "profile_path": null,
               "id": 1376961,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5585da51c3a368274c0012b4",
               "name": "Jonathan Halperin",
               "profile_path": null,
               "id": 1376961,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5585da609251411e8d00005a",
               "name": "Anna Bowers",
               "profile_path": null,
               "id": 1479513,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.256648,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 345519,
      "vote_count": 3,
      "budget": 0,
      "overview": "The Day the '60s Died chronicles May 1970, the month in which four students were shot dead at Kent State. The mayhem that followed has been called the most divisive moment in American history since the Civil War. From college campuses, to the jungles of Cambodia, to the Nixon White House, the film takes us back into that turbulent spring 45 years ago.",
      "similar": [
         319067,
         69,
         23514,
         120467,
         407448,
         399055,
         381284,
         83666,
         171274,
         1949,
         86829,
         273895,
         2604,
         8469,
         34653,
         843,
         50014,
         403,
         283227,
         10734
      ],
      "original_title": "The Day the '60s Died",
      "runtime": 56,
      "poster_path": "/lCnMP8m9xIYW3PtUERDPnbBzsiD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Room 608",
         "id": 55989,
         "origin_country": ""
      }],
      "release_date": "2015-04-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "During an anti-war protest on May 4, 1970, four students are shot and killed at Kent State in Ohio.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Halperin"],
      "runtime": 55,
      "synopsis": null,
      "writers": [
         "Anna Bowers",
         "Jonathan Halperin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4660952/",
      "coverLink": null,
      "actors": [
         "Gregory Antoine",
         "Terry Braun",
         "Pat Buchanan"
      ],
      "reviews": [
         "I found this documentary on Netflix streaming. It is very well made and summarizes the student unrest in the early 1970s that probably led to Nixon ending the USA's involvement in the wars of Cambodia and Viet Nam. I mostly grew up in the 1960s. I graduated from high school, I graduated from college, I got married, I was rejected for the draft, I got my advanced degree, I started my career, my first child was born, and I saw us land men on the moon. All in the 1960s. The focus of this documentary are the student campus rallies and protests starting in 1970, militant college students egged on to protest the war. Things got out of hand on the campus of Kent State, and they went so far as to burn down the ROTC building. Everyone agitated to the breaking point shortly National Guard began shooting and 4 Kent State students were killed. The film includes old interviews on the street with common citizens, many of them saying the students deserved the shootings and maybe more of them should have been killed. Also interviews with many of the adults who were students at Kent State during the violence, plus some who were the peace-keepers. Through the years of 1971 and 1972 mostly peaceful demonstrations were held and famously at 5AM Nixon actually walked out of the White House and to the Lincoln Memorial to meet face-to-face with the protesting students there. This was not a good time in our country's history, we will never know for sure because Nixon was a crook and you never could be sure he was truthful, but it is quite possible that were it not for the student demonstrations, and even the shootings, the war in Viet Nam may well have lasted many more years.",
         "It really doesn't matter if you consider yourself Liberal, Conservative, Moderate or don't give a crap. If you decide to see the PBS documentary \"The Day the '60s Died\" I submit that you maintain a balanced perspective throughout. The horrific shooting deaths of four and wounding of nine (including one paralyzed for life) Kent State University students by Ohio National Guard Troops during a campus demonstration against the Vietnam War in the viciously volatile month of May, 1970, in our country is eternally unconscionable and unforgivable. But as this film so poignantly makes clear, this is a tragedy that certainly did not come to pass within a vacuum. Highly recommended viewing as both a vivid American history lesson and a stark discourse on disquieting political machinations.",
         "No single war (at least not until Iraq in 2003) was as divisive in American history as the war in Vietnam. It divided the nation in ways that it had not been divided since the Civil War; and in a great many ways, that division has never quite fully healed. Of all the events surrounding that war that signified just how great the divisions in our country would be, perhaps none was as great as what took place on the campus of Kent State University, a mid-size college in northeast Ohio, just 40 miles south of Cleveland, on May 4, 1970. The events leading up to and past it are looked at in the 2015 PBS documentary THE DAY THE 60S DIED: THE KENT STATE SHOOTINGS. As related by those who had been students at that campus during that incredibly turbulent time, along with Vietnam veterans, and, most notably, Pat Buchanan, then a speechwriter for President Richard Nixon, the Kent State tragedy was the culmination of several years of student dissent that only needed a catalyzing event to have the whole thing explode in the faces of the American people. This event was Nixon's extending of the war into Cambodia on April 30th to eliminate what he claimed were Vietcong strongholds right along the Cambodian/Vietnamese border. Only ten days earlier, on April 20th, Nixon had continued to prop up the idea of winning a just peace in Vietnam that would not besmirch America. Unfortunately, the Cambodian incursion and the televised speech that went along with it had the effect of pouring an immense amount of gasoline on what was already a raging firestorm. Colleges, universities, and more than a few high schools around the nation became hotbeds of extreme dissent. And Kent State was the flashpoint, with the campus's ROTC building being put to the torch two nights after the speech, and right after Nixon referred to the student protesters as \"bums\". On the orders of the very hard-right wing Ohio governor James Rhodes, the state's National Guard was called in to stop the disturbances; but as with a lot of things that involved force, it only had the opposite effect. And at 12:24 PM on May 4, 1970, for reasons that remain shrouded in controversy, a contingent of National Guard troops fired into a group of twenty protesters on a knoll on the campus. Thirteen students were shot. Nine were wounded, one so severely that he suffered from permanent paralysis. Four others students—Allison Krause; Jeffrey Miller; Sandra Scheuer; and William Schroder—died on the spot. The killings sparked outrage among the young, and a vicious backlash among supporters of the war in general and of Nixon in particular (some even saying that more students should have been killed). It was a savage time, one that only got worse when, on May 14th, two African-American students, Phillip Gibbs and James Earl Green, were gunned down by highway patrolmen outside a dormitory at Jackson State University in Mississippi. THE DAY THE 60S DIED, though just a little less than an hour in length, does display the kinds of divisions that had been fracturing America for several years already, and how those fractures still exist (and may, in some ways, be more insidious now than even in 1970). But while the \"establishment\" may have won the battle for the hearts and minds of the American public of the time, they would go on to lose not only the Vietnam War but, as the \"cultural warrior\" Buchanan admits, other even more significant \"wars\" of the American culture, with the birth of the environmental, gay rights, and women's rights movements. As horrible as Kent State was, it was also a reminder that a lot of good can come from such horror, which is what this documentary shows with incredible force. The ideals of the 1960s have lived on, even if the decade itself died with those four on that horrible day."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Room 608"],
      "summaries": ["Chronicles May 1970, the month in which four students were shot dead at Kent State. The mayhem that followed has been called the most divisive moment in American history since the Civil War."],
      "budget": 0
   },
   "movielensId": 144774,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-04-28",
      "dvdReleaseDate": null,
      "directors": ["Jonathan Halperin"],
      "runtime": 56,
      "movieId": 144774,
      "title": "The Day the '60s Died",
      "mpaa": "",
      "actors": [
         "Gregory Antoine",
         "Terry Braun",
         "Gregory Antoine",
         "Pat Buchanan"
      ],
      "imdbMovieId": "4660952",
      "originalTitle": "The Day the '60s Died",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Day the '60s Died chronicles May 1970, the month in which four students were shot dead at Kent State. The mayhem that followed has been called the most divisive moment in American history since the Civil War. From college campuses, to the jungles of Cambodia, to the Nixon White House, the film takes us back into that turbulent spring 45 years ago.",
      "tmdbMovieId": 345519,
      "avgRating": 3.5,
      "releaseYear": "2015",
      "numRatings": 2,
      "posterPath": "/lCnMP8m9xIYW3PtUERDPnbBzsiD.jpg"
   }
}