{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0080796",
      "video": false,
      "title": "God's Angry Man",
      "recommendations": [],
      "backdrop_path": "/7WwJnoSw6gsWquatYxlqqSdMgWP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46c8c3a36847f8111d13",
            "name": "Werner Herzog",
            "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
            "id": 6818,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.276826,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 45555,
      "vote_count": 4,
      "budget": 0,
      "overview": "This documentary focuses on the unusual life and ministry of Dr. Gene Scott.",
      "similar": [],
      "original_title": "Glaube und Währung - Dr. Gene Scott, Fernsehprediger",
      "runtime": 44,
      "poster_path": "/qMCAC01ZzzFVgJxzagophdX25Q.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "1980-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Werner Herzog"],
      "runtime": 44,
      "synopsis": null,
      "writers": ["Werner Herzog"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080796/",
      "coverLink": null,
      "actors": [
         "Gene Scott",
         "Werner Herzog"
      ],
      "reviews": [
         "This probably isn't one of Herzog's best films -- and it certainly doesn't compare to some of his other documentaries, including \"My Best Fiend,\" \"Little Dieter Needs to Fly,\" \"Lessons of Darkness\" or even \"Gesualdo.\" However, the subject matter is fascinating. I won't attempt to explain the late Dr. Gene Scott -- he needed to be experienced to be understood. For a while I was privileged to live where I could hear Dr. Scott on the radio 24 hours a day, and I have to confess that I found him compulsively listenable. Sure, he was a preacher, but in my experience he rarely really talked about religion. When he did, he preached strictly to the choir. The upshot is that Scott never really seemed to be trying to communicate with anyone, but carrying on a tortured inner dialog in a kind of code. The many flashes of paranoia and anger (usually directed at the government and his audience) and his borderline-abuse of his co-workers (constantly ordering his music director -- what was his name again -- to play the same song for the umpteenth time) further suggested that we were just watching or listening to a man struggling with himself. The problem is that the best and most unbelievable Scott documentary would simply be to present a 90 minute segment of him doing his usual show -- I don't think even Herzog would dispute that. Here, we get a bit of Scott doing that, but also a lot of time is spent watching his volunteers answer phones, hearing from his parents and hearing Scott talking, very lucidly, in the back of a car. Scott also modestly described himself as just an employee-at-will reporting to some unseen church board of directors (likely only in the sense that Hank Greenberg was one). While it was interesting to hear where his anti-government diatribes came from, the movie was very tame and restrained compared to the man himself. Still, anyone who had the longevity Scott had (yes, he's still on the air, albeit posthumously, and you can hear him streaming over the internet 24/7) can't really be a raving lunatic, and Scott was far from one. This comes across strongly in the documentary. What Herzog succeeds in showing us is not so much anger as extreme isolation and detachment. Scott was a brilliant man (we're reminded of his Stanford pedigree a couple of times) whose disdain for the world the rest of us live in caused him to build and occupy a startlingly persistent mirage. In this sense, the film is of a piece with Herzog's other documentaries that explore the many points of articulation between sanity and madness, reality and dream.",
         "Live TV at it's best\u0085 I just had the opportunity to watch a print of this and I can't recommend it enough\u0085a really fascinating documentary. It starts of so farcical that you wonder what Herzog's motives are in making this short film. However, we soon discover that this larger than life TV evangelist is not quite the pillar of towering strength that he portrays to his devoted audience (which as he reminds them, has grown well into it's 1000's). What I found so fascinating about Dr Eugene Scott and his live telethon style broadcasts wasn't the usual reactionary opinions (although he had his share; homosexuals, women's rights etc). It was the surreal, completely unbelievable set-up of his television broadcasts. If you tried to make the most over the top parody of a TV evangelist possible, the result would still be nowhere near as ridiculous and captivating television as Scott's broadcasts. I've spent my share of time in America, seen many TV evangelists, but none of them have ever come close to Eugene Scott. From the over the top set dressing, to his in house singing duo, to the old ladies manning the telephones (all major credit cards accepted) the whole broadcast really is quite astounding. The highlight though is Scott himself. Herzog shows us some quite extraordinary moments of television captured live by his small on-set crew. At one point the Dr grumbles \u0091I will not be defeated tonight... (pause) not one more word until that thousand comes in'. At which point the presenter crosses his arms and just glares into the live camera refusing to speak until his requests for donations are met with. With the Dr in full swing, resistance seems futile. Soon Scott is reporting on the incoming donations, all of which are in there hundreds, many thousands of dollars. However, it's just as well \u0091It's not about the money!' as Scott screams at one point when again his requests to meet a larger target of a quarter of a million dollars are not met. Even when Scott's financial desires have been satisfied he still feels the need to insult his audience for not parting with their \u0091few hundred miserable dollars' earlier. The strength of this documentary though is in Herzog's one on one interviews with Scott, carried out on his estate or in the back of his stretched limo. Herzog's candid questioning shows an altogether different side to the TV persona his viewers were only allowed to whiteness. I've read that since Herzog's film, the FCC shut down Scott in the early 80's. I would suggest searching the Internet for Dr Scott. He seems to have embraced the Internet in order to continue his teachings.",
         "This is a documentary about a reverend attempting to raise money for his church in 8+ hour long TV shows that are - to put it softly - out of the ordinary. If you've seen Herzog movies before, you know more or less what to expect: A weird atmosphere, a quite crazy character whom you'll still sympathize with, subtle strange and disturbing things happening all along, and when it all ends you find your eyes are slightly crossed and your mind very bent. You'll see something not very unlike the insane \"dancing chicken\" ending of Stroszek and the interview with Grizzly Man's parents. There is also some absolutely amazing Hammond organ backed music here, live from the TV show - with some exceptionally passionate singers that will give you chills, one way or another! Herzog's choice of music is as always utterly fascinating - just like the rest of the movie. Herzog fans can't miss this. If you don't know who the hell Herzog is, go see Grizzly Man - and return to this documentary once you're hooked.",
         "As ever with a Herzog documentary, the filmmaker doesn't try to preach or narrate his subject; instead he lets the subject matter speak for itself, and in this case the subject matter is a crazed tele-evangelist, Dr Gene Scott. In this 45 minute short, we witness Scott as he goes into his many angry rants, begging his viewers for cash and throwing childish tantrums when he doesn't get what he wants. The narrative explores the true nature of American evangelism and those who front such shows. The segment in which Scott reads out the donations coming in is literally jaw dropping, you won't believe what you're seeing or how people can be so gullible. In fact, it's all so extreme that it feels like an absurd comedy, made all the more absurd by the fact that it's real. The surreal ending, with the toy music-making monkeys, brings to mind the glorious heights of the dancing chicken in STROSZEK.",
         "This is a portrait of Dr Gene Scott a televangelist who ran into problems with the FCC in the late 1970's and early 1980's. Scott was eventually shut down, briefly, by the FCC. The documentary, which consists of little more than interviews with Scott and clips from his show, doesn't really deal with the reasons why the FCC was after him, rather it tries simply to show a man on a mission trying to save people while battling his inner demons. This is an amazing one of a kind documentary that probably could only have been made by Werner Herzog. Herzog isn't interested in showing anything other than the man. There is no judgment as to what Scott is all about, there is just Scott talking to Herzog and to his audience. The result is a portrait of a man on a mission, who is doing what he feels to be right. The result is that you walk away from the film feeling that you've just met a real person and not a manufactured man of god. If you can track this down its worth seeing. As with all of Herzog's documentaries you get to see something, or someone in a way that is very unexpected.",
         "Dr. Gene Scott, was a televangelist who daily broadcast marathon length live broadcasts demanding donations to his church. In this film we see parts of his performance, which includes him ranting at his audience and even refusing to speak until sufficient money is donated. We also see him count the huge sums that evidently and quite amazingly were donated by unknown disciples. Taking into account that the subject matter is very interesting coupled with the fact that it is directed by Werner Herzog, this has to be considered a bit disappointing. Herzog has made several films, both fact and fiction alike, featuring central characters who are so very far removed from societal norms to the point of being isolated in life. Scott is another character very much in this vein, yet this film never makes as much impact as it should. In fairness, it's not helped much by Herzog constantly translating into German over the top of the English dialogue. Obviously this must have been on account of this being targeted at a television audience in Germany, yet it is still very distracting and it is unfortunate that subtitles were not simply used for non-English speakers. Anyhow, Herzog interviews Scott behind the scenes and he is an altogether different character in this context; full of doubts and fears, unlike his TV persona who is black and white in his opinions and sure of his position. Also of note, we are exposed to several musical numbers by Scott's in house band The Statesman. These are very strange religious songs, sung along to heroically horrendous music and performed by unusual scarily upbeat men. These songs were interesting in their utter bizarreness.",
         "1981 was a very religious year for German filmmaker Werner Herzog. He shot two documentary movies of roughly 43 minutes each dealing with faith in Black and White communities in the United States. This one here is about televangelist Gene Scott and his approach to the issue of religion. I actually liked this one more than the other. One reason would be that it is not just 40 minutes of sermon, but actually elaborates on the issue of church and money a whole lot more than the other did. Another difference would be that Herzog narrates and translates in this one as well. And we find out a lot more about the central character. I knew absolutely nothing about Huie after watching the other, but I do know quite a bit about Gene Scott now. He is a fascinating character. Obviously he is struggling hard with some issues and that also brought him in trouble with the law. Herzog never tries to let you see Scott in a positive or negative light. It's all up to you what to make of this documentary, but it's almost impossible to have a neutral attitude towards Dr. Scott after seeing this one. The protagonist died 10 years ago, but thanks to Herzog we have an important and interesting memory about him, which also tells us about America in general in the 1970s and 1980s and also about American television back then. Another good thing is that you do not really need a religious background yourself to find this piece of filmmaking interesting. Good watch and I recommend it.",
         "This is a surprisingly short and clumsy attempt at revealing the jaded, isolated and estranged life of the late Dr. Gene Scott, who was a career pastor and televangelist before he turned over his position to his then wife, Melissa Scott. I remember in youth as early as the 5th grade, flipping through the TV channels and coming across this distinguished and White haired guy wearing a three-piece suit, sitting and pontificating in some fancy chair. Initially, this was something where most people would just switch the channel in a blink of an eye. But after a while we noticed that this guy was on TV nearly 24 hours a day it seemed. You turned on the Tube only to find this stodgy old grunt talking straight into the camera. Sometimes you would find him on more than just one channel. Dr. Scott became a somewhat figure of intrigue in Southern California media for those who bothered to notice. Known for his histrionic tirades and cantankerous rants, Dr. Scott ensued a notorious reputation in the media as a blustering tyrant who was fleecing all the unsuspecting followers. Subsequently his program, through all of its changes, lasted until his death. Werner Herzog's documentary is very low-budget and looks tawdry to the quality of documentary filmmaking today. The film's biggest weakness is treating us to five musical numbers of his program's quartet, The Statesman, a group of middle aged men wearing bad hairpieces, polyester suits who sing as if they were singing at an amateur talent contest. Subjecting us to one ear-wrenching song once would have been plenty, but this takes up at least one-third of the film to which it renders itself pointless. As the Call-in numbers for pledges flash on the screen we go back and forth to the choir and Dr. Scott. But we don't really get to see much of Dr. Scott's complete persona while performing. We don't get to see him teach the Bible or make moral references to such. All we see are his explosive tirades, hollering at guests and condemning them for not sending him enough money for God. Whoa! Televangelists are never this blatant or bold in their attempts to fleece their followers. But Scott makes no bones about it. Although his character is entertaining, I wonder if this guy was for real or if he was a conscience charlatan. Nevertheless, he was crazy and unstable. There are two poignant scenes in the film where Herzog interviews Dr. Scott up close one on one. As Scott speaks, he is more calm, articulate and intelligent than he reveals on his program. After all, he has a Phd from Stanford University! Who would have known? During these brief and intimate discussions, we see Scott as a jaded, lonely and broken figure of a man. The strength and perspicacity he expresses in his program speeches is merely a façade for his inner vulnerability and uncertainty. He expresses his woes about his life, career, his battles with the FCC and how he is being used by the congregation as a tool to further their scheme. He hasn't any assets, money or possessions of his own, so he says. Listening from across the room we see a young, beautiful and scantily clad woman reclining on a couch for a few seconds, who we assume is his lover or girlfriend. I'm not sure what Herzog was trying to accomplish from this. Knowing that Herzog himself is an atheist, I am tempted to believe this was his agnostic expression of exposing the hypocrisy and con artist elements of TV Evangelism. But I'm not so sure if this was partly his intention or if he wanted to give an intimate portrait of a troubled man who expresses his anger and control by manipulating and browbeating viewers. The guess is up to us. In retrospect, this whole piece of celluloid looks dated and tawdry from the fashion, hairstyles and crude photography. It's too late, the cat's out of the bag, and televangelism has been marred by shameless hucksters as Dr. Gene Scott, but you may gain a more intriguing and sentimental viewpoint about the man and his \"Festival of Faith\" after seeing this.",
         "For a long time I was slightly disappointed with this documentary. I've had a semi-perverse fascination with Scott for many years, his degree from Stanford rather than from a bible mill, a somewhat scholarly approach to his subject on occasion which set him apart from his \"peers\" who merely disgusted me, and his lack of shame at appearing as a lunatic on the airwaves which set him apart much further from those who pose as the \"status quo\" keepers of morality and decency for average folks. This movie failed entirely to portray this essential difference. But it did capture what I now recognize as a very common underlying element to all of Herzog's movies I've seen, a character of mythic dimensions. Scott's quixotic nature to do battle with the FCC puts him on par with Aguirre or Fitzcaraldo. A living individual going all the way, taking it as far as he can, like the guy in \"Grizzly Man.\" Herzog does something more deftly than any other director, create updated mythology for our era, and a portrait of a televangelist, even if it misses part of its subject is a very worthy part of this mythology.",
         "I was an overnight computer operator in the early 80's. I discovered Dr. Scott on late night TV and watched him every night. I was both intrigued and appalled and really didn't know what to make of him. One thing is sure: I was hooked. This guy was so unwatchable, yet he would teach Biblical history sometimes, so he was fascinating. I ended up watching him until his show was over at about 5AM or so. Anyway, for whatever reason, I began to think about him recently, couldn't remember his name at all. It finally came to me in a dream and I typed his name into Google the next morning.. wow! there he is! I always assumed he was some Bible-thumping huckster. I had no idea he was an educated guy. Regardless, he was one of the most interesting guys I've ever seen and I'm sorry he's gone so soon.",
         "God's Angry Man (1980) ** 1/2 (out of 4) Werner Herzog documentary about teleangelist Gene Scott who came under fire by the FCC in the late 1970s. Scott is certainly a strange character and Herzog does a good job at showing how much power this guy had over his viewers and he's also honest in showing why the FCC and others would come after him. The only somewhat annoying thing really isn't the films's fault but in the interview clips Scott will be speaking in English and then Herzog will narrate, in German, just what he said and this goes on throughout the documentary."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Werner Herzog Filmproduktion",
         "Süddeutscher Rundfunk (SDR)",
         "Sudfunk Stuttgart"
      ],
      "summaries": ["The documentary follows Gene Scott, famous televangelist involved with constant fights against FCC, who tried to shut down his TV show during the 1970's and 1980's, and even argues with his viewers, complaining about their lack of support by not sending enough money to keep going with the show. Werner Herzog presents the man, his thoughts and also includes some of his uncharacteristic programs."],
      "budget": 0
   },
   "movielensId": 144858,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1980-01-01",
      "dvdReleaseDate": null,
      "directors": ["Werner Herzog"],
      "runtime": 44,
      "movieId": 144858,
      "title": "God's Angry Man",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0080800",
      "originalTitle": "Glaube und Währung - Dr. Gene Scott, Fernsehprediger",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "This documentary focuses on the unusual life and ministry of Dr. Gene Scott.",
      "tmdbMovieId": 45555,
      "avgRating": 3.25,
      "releaseYear": "1980",
      "numRatings": 10,
      "posterPath": "/qMCAC01ZzzFVgJxzagophdX25Q.jpg"
   }
}