{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0076218",
      "video": false,
      "title": "Could It Happen Here?",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Ferruccio",
               "gender": 2,
               "credit_id": "53d696afc3a3686b97005ffc",
               "name": "Luc Merenda",
               "profile_path": "/uSM73n88qekWYfcReVv9CROsvH6.jpg",
               "id": 36913,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Marco",
               "gender": 0,
               "credit_id": "53d696b7c3a3686b97006000",
               "name": "Lou Castel",
               "profile_path": "/tcFGR2TRAhPYXJUOH9n0DNbDOuQ.jpg",
               "id": 32827,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Bruno",
               "gender": 0,
               "credit_id": "53d696c2c3a3686b88005f04",
               "name": "Andrea Franchetti",
               "profile_path": null,
               "id": 1315510,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mara",
               "gender": 1,
               "credit_id": "53f3bfffc3a36822fa0003a9",
               "name": "Marcella Michelangeli",
               "profile_path": null,
               "id": 225392,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53d696d3c3a3686b9a005c40",
               "name": "Massimo Pirri",
               "profile_path": null,
               "id": 592208,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53d696e8c3a3686b8b0062e2",
               "name": "Morando Morandini",
               "profile_path": null,
               "id": 228758,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.018201,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 260886,
      "vote_count": 0,
      "budget": 0,
      "overview": "Italian political thriller directed by Massimo Pirri.",
      "similar": [],
      "original_title": "Italia: Ultimo atto?",
      "runtime": 95,
      "poster_path": null,
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Una Cinecooperativa",
         "id": 28490,
         "origin_country": ""
      }],
      "release_date": "1977-11-24",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Massimo Pirri"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Morando Morandini Jr.",
         "Massimo Pirri"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0076218/",
      "coverLink": null,
      "actors": [
         "Luc Merenda",
         "Lou Castel",
         "Andrea Franchetti"
      ],
      "reviews": [
         "COULD IT HAPPEN HERE? is an oddball Italian crime film with a heady political angle. Genre regular Luc Merenda plays a terrorist who - along with his buddies - stages an assassination, the build up to which takes place in flashback. The film strives to present a volatile atmosphere and cheats a little by frequently utilising stock footage clips of real-life riots in order to give it some edge. There are some decent action bits here and the character stuff is interesting at times, but COULD IT HAPPEN HERE? is also more than a little disjointed and I was wondering why I was supposed to care about what was taking place on the screen.",
         "This is a flick that you don't see that often. It was released on a Italian label but something went wrong with the transformation from 8MM to VHS. So that one is OOP. Furtheron it was released on a Greek VHS still to find and on American VHS on the MOGUL label. MOGUL is something strange. Nothing is known who was behind it and there isn't a list of the VHS they brought out. Therefore MOGUL VHS are hunted down by freaks and some are ultra obscure, most of them where European flicks, nowhere else to find. Some are nowadays available on DVD but this here isn't. I knew that a lot of MOGUL releases are pure trash and this here is really boring as hell. Luckily I paid almost nothing for this version on MOGUL because the label on the VHS was missing. But the VHS was in perfect condition, not a copy. What also was missing was suspense. It's just a story about a few friends who want to do terrorism in Italy. But don't think that you will see gore or even red stuff. It's a flick where they are talking and talking and nothing really happens. The masturbation scene in a toilet was in tact but even that was low standard. There are a few inserts with news footage from Italy where people do strike and of some riots where you can see dead people. It reminded me a bit of Faccia Di Spia (1975), another cult flick and well sought after but boring as hell. The only thing that is weird is that it is all about terrorism and destroying Italy. But just look what happened, one year later Italy was full of The Red Brigade (Brigate Rosso)and the killing of Aldo Moro (1978). Still, hunted down by the VHS geeks and goes for around 75$ on MOGUL. Was I lucky to pay only 10$... Gore 0/5 Nudity 0/5 Effects 0/5 Story 2/5 Comedy 0/5",
         "I went into this film under the impression that it would be an Italian crime flick. It is; but it's not the type I'm used to, as instead of all the fights and car chases that I would usually expect from this sort of film, we merely get lumbered with a load of talking and theories that don't have much weight behind them and thus the result is really boring. The plot focuses on a small group of terrorists. Three of them try to kill somebody; one ends up dead and the other two flee. But there was a last minute change of plan, which causes trouble in the terrorist cell. The problem with this film being so boring is that it's very difficult to follow. I honestly found it hard to care about anything in this film. It's not that I need things like car chases to make me like a movie; but I do watch films for enjoyment more than anything else, and this one didn't deliver anything like that. The film stars Luc Merenda, who despite being great in many Italian films; is not enough to elevate this one above tedium. I have no idea if the film was trying to make a point about something going on in Italy in the late seventies, but whatever the point was went right over my head and I would not recommend anyone seek this dull film out!"
      ],
      "genres": ["Action"],
      "productionCompanies": ["Una Cinecooperativa"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 144852,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1977-11-24",
      "dvdReleaseDate": null,
      "directors": ["Massimo Pirri"],
      "runtime": 95,
      "movieId": 144852,
      "title": "Could It Happen Here?",
      "mpaa": null,
      "actors": [
         "Luc Merenda",
         "Lou Castel",
         "Andrea Franchetti",
         "Marcella Michelangeli"
      ],
      "imdbMovieId": "0076218",
      "originalTitle": "Italia: Ultimo atto?",
      "genres": ["Crime"],
      "youtubeTrailerIds": [],
      "plotSummary": "Italian political thriller directed by Massimo Pirri.",
      "tmdbMovieId": 260886,
      "avgRating": 1.5,
      "releaseYear": "1977",
      "numRatings": 1,
      "posterPath": null
   }
}