{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0043350",
      "video": false,
      "title": "The Blue Veil",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 3550000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Louise Mason",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb2e9",
               "name": "Jane Wyman",
               "profile_path": "/nw2qjwNEEJvhJbgqSu9DmqBGY0W.jpg",
               "id": 20391,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Fred K. Begley",
               "gender": 0,
               "credit_id": "52fe4b44c3a36847f81fb2ed",
               "name": "Charles Laughton",
               "profile_path": "/vEfcV6RA6tJr035OAG9U9o4uRyL.jpg",
               "id": 10921,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Annie Rawlins",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb2f1",
               "name": "Joan Blondell",
               "profile_path": "/7nS5gqycNArcTdnRO2lXj9rYnkG.jpg",
               "id": 13568,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gerald Kean",
               "gender": 2,
               "credit_id": "52fe4b44c3a36847f81fb2f5",
               "name": "Richard Carlson",
               "profile_path": "/dGBs79xPf6fFI9p0rEiasmn5G3X.jpg",
               "id": 67685,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Palfrey",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb2f9",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Stephanie Rawlins",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb2fd",
               "name": "Natalie Wood",
               "profile_path": "/1Z4HYNFGVpXfvteNLGJteetojfW.jpg",
               "id": 2769,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Alicia",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb301",
               "name": "Vivian Vance",
               "profile_path": "/z9D5Ys28CZAnHk9kv6q5mbx4Srk.jpg",
               "id": 153254,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Helen Williams",
               "gender": 1,
               "credit_id": "52fe4b44c3a36847f81fb305",
               "name": "Audrey Totter",
               "profile_path": "/fgueibehw30drMtbIrYfuGJ0BMd.jpg",
               "id": 19413,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Frank Hutchins",
               "gender": 2,
               "credit_id": "52fe4b44c3a36847f81fb309",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "District Attorney",
               "gender": 0,
               "credit_id": "52fe4b44c3a36847f81fb30d",
               "name": "Everett Sloane",
               "profile_path": "/7VjHejF5JE3XTbAs4iOVlUIcEzw.jpg",
               "id": 11027,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Prof. George Carter",
               "gender": 2,
               "credit_id": "52fe4b44c3a36847f81fb311",
               "name": "Alan Napier",
               "profile_path": "/mmOemlQeMp0ViF4cy8QL1bArm4y.jpg",
               "id": 6933,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Joplin",
               "gender": 2,
               "credit_id": "52fe4b44c3a36847f81fb315",
               "name": "Les Tremayne",
               "profile_path": "/mWXxR42D22b4vRLCUOqC4zyIPs.jpg",
               "id": 2648,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Hugh Williams",
               "gender": 2,
               "credit_id": "52fe4b45c3a36847f81fb319",
               "name": "Dan O'Herlihy",
               "profile_path": "/e84845dAoAbBYEggRd08vMrFipO.jpg",
               "id": 6836,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Charles Hall",
               "gender": 2,
               "credit_id": "52fe4b45c3a36847f81fb31d",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b44c3a36847f81fb2e5",
               "name": "Curtis Bernhardt",
               "profile_path": "/9XzWdOPGfQO8ZCEAnNTwiahALYy.jpg",
               "id": 33062,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a36847f81fb323",
               "name": "Norman Corwin",
               "profile_path": null,
               "id": 148560,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b45c3a36847f81fb329",
               "name": "Franz Planer",
               "profile_path": null,
               "id": 1940,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "584606a5925141042b00766c",
               "name": "Busby Berkeley",
               "profile_path": "/fNM46pXBDgT6hXXNLKw1nRsFjh.jpg",
               "id": 95293,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.524198,
      "production_countries": [],
      "id": 114081,
      "vote_count": 2,
      "budget": 0,
      "overview": "Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges, the children of various employers, grow and soon find themselves ready to face the world. When it seems that she will be alone, the nurse finds that her 'children' have ideas of their own in regards to helping their beloved mentor.",
      "similar": [],
      "original_title": "The Blue Veil",
      "runtime": 113,
      "poster_path": "/35BSBX1RPD4ApMJjyycN0QjHahl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wald/Krasna Productions",
         "id": 10852,
         "origin_country": ""
      }],
      "release_date": "1951-10-26",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Who is the real Mother of this Child? The woman who gave it life... or the woman who gave it love?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Curtis Bernhardt",
         "Busby Berkeley"
      ],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "François Campaux",
         "Norman Corwin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043350/",
      "coverLink": null,
      "actors": [
         "Jane Wyman",
         "Charles Laughton",
         "Joan Blondell"
      ],
      "reviews": [
         "Remember Channel 9 in New York City? So many times they would show the classic THE BLUE VEIL with Jane Wyman, Richard Carlson, Charles Laughton, Vivian Vance, Natalie Wood and Joan Blondell. It was part of what was known as THE MILLION DOLLAR MOVIE. Go know that this magnificent film would disappear. Jane Wyman is now past 90 years of age. It would be a tribute to her to show this outrageously good movie. While Wyman was nominated for best actress in it in 1951, she lost to Vivien Leigh in A STREETCAR NAMED DESIRE. Few people know that Wyman won the Golden Globe Award for best actress of the year for this remarkable film. The film pulls out every emotional stop imaginable in depicting the life of a woman who cares for other people's children. The film begins with a newly widowed World War 1 Wyman losing her child after giving birth. From that point on, the viewer is taken on an emotional roller-coaster, as the film shows every situation she encounters while caring for other people's children. Affectionately known as Lulu, Wyman is at her best. In tribute to the long career of Jane Wyman, this film should be released while she is still living. We should demand this. After all these years, I was able to obtain a copy and I saw this wonderful film the other day. The picture is even better after all these years. Wyman is better than terrific here. She always played the part of the victim in her pictures. Those sad-dreary eyes will get to you. After 56 years, my eyes filled up with tears. This is an unforgettable tear-jerker of the highest quality. They sure knew how to make pictures in those years. What a wonderful supporting cast. Wyman sacrifices her life to care for other people's children. How many women would do that in today's society? The opportunity was there to marry for convenience. Please note the fabulous performance of Charles Laughton in a supporting role, as a lonely widower left with an infant. He is totally out of his usual domineering character here. His performance is marvelous and well understated. Natalie Wood is just fine as Stephanie. She will also tug at your heart when she refers to Lulu (Wyman) as her mother when her own mother, played by nominated supporting actress Joan Blondell fails to arrive at her communion.",
         "There are several truly excellent movies that have apparently vanished from general distribution. THE BLUE VEIL sadly lies in a vault somewhere, for some unknown reason. My guess: some copyright dispute, be it literary or musical. Please, someone, \"PAY THE TWO DOLLARS!\" As Louise, a governess, Jane Wyman gives a performance that is easily the equal of JOHNNY BELINDA. In two scenes alone, Miss Wyman could, and does, wring tears from a stone. She is supported by a fine cast which includes Joan Blondell, Charles Laughton and Natalie Wood. Performances which are of this caliber should not be allowed to disappear, unknown and unappreciated. This was an RKO release, which spells TED TURNER. Why don't we bring pressure to bear where it counts? THE BLUE VEIL deserves to be seen.",
         "If you LOVE a tear-jerker then have the tissues ready. This one will have you bawling. It tugs at the heart strings and doesn't let go. If you love movies that involve high emotional soap opera drama then this movie is for you. The ending wraps everything up into a beautiful neat package and I love this movie. I wish it were out on DVD. Jane Wyman give a very convincing performance. The children will break your heart. This kind of soap opera is no longer made and is definitely a chick flick. I never tire of watching this film and certainly recommend it to all of you. If any of you have ever watched \"About Mrs. Leslie\" with Shirley Booth and loved it then you'll probably love this one too.",
         "\"The Blue Veil\" is an excellent movie. Even though it hasn't been shown for years on TV, that's where I first saw it. The cast is excellent (especially Jane Wyman) and you follow her through many different homes as she cares for many different children. The ending is great! Really well done.",
         "After searching for 21 years I finally got a copy, albeit not a great one, but at least I got to see it. Jane Wyman as the self sacrificing nursemaid makes your heart break and eyes water as she puts her \"children\" ahead of her for her entire life. After losing her own baby shortly after birth and being a widow with no skills, she goes to an employment agency where she is encouraged to take a 2-3 week stint with a new born. Understandably she is hesitant but accepts and in what will become a pattern for her, has to move on to new children. The last one is a heartbreaker, after raising a child for 8 years, she has to give him back to his mother and stepfather who finally resurfaced after spending time in England during and after the war. Now she is elderly, and winds up cleaning in a school just to be around children. When her eyesight fails, the doctor she goes to turns out to be one of her \"children\". She recognizes his name and tells him who she is. He invites her to his home for dinner the next week where he gives her the greatest surprise imaginable. I recommend doing whatever you have to in order to see this movie.",
         "The Blue Veil is truly a movie classic. I, too, have searched for it on TV and tape and have not been able to locate it. Is there any way one can request its availability from RKO or elsewhere? Rarely has there been a film with so many star performers! I would like to know the names of the child stars who added so much to the story. The movie is discussed in the biography called Jane Wyman; the actress and the woman, by Lawrence J. Quirk, and published by Dembner Books in 1986. Since the story covers a 50 year period, the fantastic job of aging Miss Wyman is remarkably accomplished. The book discusses this and other facts of the movie as well as Wyman's many other stellar roles in such films as The Yearling.",
         "I was a very impressionable young girl when I saw this movie...not on tv, but at the local theater. I remember running out of tissues, I cried so much. An elderly couple seated next to me passed me more tissues and reassured me that it was \"only a movie\". I have never forgotten this film, and I have yet to see it on tv. Jane Wyman should have had the Oscar that year.",
         "This is a 1950s melodrama which tells, in episodic fashion, the story of the adult lifetime of Louise Mason (Jane Wyman, yes, the first Mrs. Ronald Reagan). Louise dedicates her life to being a nanny, i.e. raising other people's children. Wyman gives a very sympathetic, understated performance, and received an Academy Award nomination for it. She's surrounded by familiar character actors, some relatively understated (Charles Laughton)and some over the top (Cyril Cusack). Also look for Agnes Moorehead, Vivian Vance (better known as Lucy's landlord, Ethel Mertz) and Joan Blondell (Academy Award nomination for best supporting actress). Without giving away the story, I would compare the film's emotions to a nanny version of Goodbye, Mr. Chips. This film is not available on video, and is very hard to find, but's it's definitely worth a look if you do.",
         "Although my home for the past 25 years has been here, I was born and educated in London England. I remember seeing THE BLUE VEIL as a young child and I have never forgotten it. I couldn't stop crying for days, that's how intense Miss Wyman's outstanding performance had a hold on my heart. I have managed to collect quite a good number of old favourite movies and mini-series of mine. Luckily we have the Turner Classic Movies channel on our cable TV, but although there have been many classic movies, \"THE BEST\" (in my opinion) has not been forthcoming. I buy the weekly TV Guide as soon as it hits the shops hoping for a miracle that I will finally see this BEAUTIFUL movie once again. Being quite a newcomer to the Internet (only 1 month) I haven't yet been able to locate enough old movie stores or companies, so my search for this film has failed till now. However, I won't give up especially after reading other viewers' comments and I hope our letters will finally reach their goal and someone with influence in the right place can see to it that this movie is once again aired.",
         "Long before I saw my first TV (in the hardware store window on Main Street), Family Night at the drive-in theater was a huge treat. If the movie happened to be a \"tear-jerker\" - so much the better! I only saw \"The Blue Veil\" one time (almost 50 years ago) but I still rate it as my all-time favorite two-hanky movie (followed closely by \"Imitation of Life\"). I have looked for it on video but have not found it..... I wonder if it is as good as my memory of it... I'd bet \"YES!\".",
         "As another reviewer noted, \"The Blue Veil\" is apparently entangled in rights litigation, which would certainly explain why this wonderful movie is never shown on TV nowadays; nor, sadly, is it available for release on video. Over the years I have noticed that a number of the great Jane Wyman's 1950's movies seem to have fallen off the radar screen. \"Magnificent Obsession\" and \"All That Heaven Allows\" seem to be the only titles that have been released to video or warrant reasonably frequent TV airings. While these two Douglas Sirk titles are undeniably fine, what about the others? I clearly remember seeing such Wyman films as \"The Blue Veil\", \"So Big\" and \"Lucy Gallant\" on TV in the 1960's and very early 1970's. Since that point, many of these 1950's and early '60's movies have disappeared into oblivion (at least in my immediate TV viewing area). As there does not appear to be any hurry to release these great films on video, I can only lament the loss.",
         "My cousin Dee Pollock played Tony in this Movie. He was about five I think.I have seen The Blue Veil several times on television on the old movie channels, but never been able to find it anywhere. Dee has searched for years for a copy of this movie, to no avail. He just Passed on December 27,2005. So, I would like to take up where he left off and still try and find a copy.My cousin was a really a great guy and a good actor. I thought this was one of Jane Wyman's best roles. I can't watch it without crying. They just don't make movies like that anymore. So, please if anyone has or knows where I can get my hands on this movie. Please let me know. boopsk@msn.com",
         "What a shame that this wonderful film has not been made available to the public. I searched everywhere to obtain the film to finally come upon this site and find out it is not available. Would liked to have given this to a friend of mine who is a receiving home for children. Told her about the film and the ending and wondered if ever these children would find her again down the road.",
         "I remember seeing this movie when I was ten years old. It was a winter day and I was home from school, sick. The movie came on and we didn't have remote control, and I was too weak to get out of bed, so I was really forced into watching it. It turned out to be one of my favorite movies, even though I've only seen it once. It is a transforming story as we watch Jane Wyman go from family to family through many years, taking care of the children, and then being moved on when they become too old for a nanny, each time breaking the hearts of all involved. the end is so moving, but if you haven't seen it, It wouldn't be fair for me to ruin it for you. See it, by all means. This is a rare movie that I have never seen on Video nor on TV since that time. If you run across it, I highly recommend that you tape or buy it, whatever the case may be.",
         "I just thought of this movie and decided to check out IMDb. How wonderful to see that others had the same memories of this movie as I did. I was a little kid when I saw this movie (we had Million Dollar Movie in Los Angeles, too!), and I remembered crying for hours afterward. Although I haven't seen it since, it still sticks in my mind. Please! Whoever! Get this movie out on DVD! Interestingly, I don't remember Natalie Wood being in the movie. I was so young when I saw it, she hadn't crossed my radar yet. So, now I do want to see it again just to see her. To me she was one of the best child actors ever -- similar in nature to Christina Ricci's early roles. But, of course, this is Jane Wyman's movie. In my memory, she was better here than in \"So Big\" or \"Johnny Belinda.\" Ah, I'm getting misty-eyed right now.",
         "Get out the bath towels for The Blue Veil. Jane Wyman will have you weeping before this film is halfway through. Set over a 40 year period Jane Wyman gradually ages throughout the film, a tribute to the subtle yet effective makeup job done on her. When we first meet her she's a recent young widow who has just suffered a double tragedy. She lost her young baby in infancy and now has to survive. To fill a true ache in her heart Wyman takes the first of many jobs as nurse/ governess to the children of others. Sad to say though she sometimes lets the boundary lines erase between an employee and an actual parent. One such time was with young Natalie Wood when she raises her literally in the absence of Wood's actress mother Joan Blondell. In this case Wyman recognizes the problem and voluntarily moves on. This happens again, but the situation is truly forced upon her. When World War II starts, Audrey Totter follows her English husband back overseas and does war work there. She and husband Dan O'Herlihy leave their son Dee Pollock in Wyman's care. O'Herlihy is killed flying for the RAF and Totter is in service there. Eventually she marries Harry Morgan, but all that takes a number of years. Meanwhile Wyman is back on this side of the pond raising Pollock and who could blame her for thinking of him as her own. District Attorney Everett Sloane does not want to prosecute Wyman either, but he works a way out to keep her out of jail for kidnapping. Still she has to give Pollock up. It's a gut wrenching scene. Which sets up my favorite scene in the film. She takes a job as a cleaning lady in a public school and she tries to mother young Jimmy Hunt. The kid is suspicious, we know her motives, but he runs from her, leaving her with yet another ache. Wyman was nominated deservedly for Best Actress losing to Vivien Leigh for Streetcar Named Desire. Joan Blondell got an Oscar nomination for Best Supporting Actress but she lost to Kim Hunter for again Streetcar Named Desire. In a fine cast that RKO and director Curtis Bernhardt assembled, Wyman really dominates this film. Charles Laughton is in this film as well in a strangely brief role for an actor of his stature. He plays the widower father who first hires Wyman. It's a kindly role for Laughton with very little to work with to make him noticed. Cyril Cusack plays an iconoclastic owner of a toy and novelty shop who has a thing for Wyman, but Jane just wants to take care of children and fulfill her needs. He waits for years for her. The Blue Veil is such a moving film that it will be impossible to view without a sense of poignancy. Some argue that this is even a better role for Jane Wyman than her Oscar winning Johnny Belinda and they may be right.",
         "In the opener of this hard-to-find Jane Wyman film, we see her just giving birth and discovering due to complications, the baby died. That on top of having lost her husband in the war puts her into despair. But quickly she drudges on and looks for a job. But, as she is hardly qualified for many other jobs, she is encouraged to be a nursemaid in the care of babies. Though she didn't want to, she comes to see it's the hand life has dealt her. If in fact, she hadn't done so, she might have become very bitter and distant. Through a series of separate stories, we see her affect the lives of others and how they affect her, as she takes care of babies and children. In the first, we see Charles Laughton who has become recently widowed, with his wife dying in childbirth, leaving a baby to be cared for and he is hardly capable. But when he starts to have feelings for Jane and she can not reciprocate them, she leaves them, after he eventually marries someone else. The next family situation consists of Richard Carlson who in turn falls for her. Through it all, we see Jane as she ages and her sacrifice and dedication to \"her children.\" Another story has her taking care of a young Natalie Wood, with Joan Blondell as her own inattentive mother. This film has been on my Find-and-Watch list for a long time and I finally decided, instead of waiting further for an authentic DVD, I would find buy a dvr copy, when I found a website that has it. That was my way of actually getting a copy of it, and I'm certainly glad I did. It was a very well-made film that is obviously sentimental and a weeper. The only reservation I have is that it seemed a bit hokey and/or unrealistic that she would get a chance to see all of \"her children\" at the end of the film. But the final shot of her and the children now in her care was very moving and sad. \"The Blue Veil\" is a memorable film that needs to be discovered today.",
         "Copyright 27 October 1951 by Wald-Krasna Productions, Inc. Released by RKO Radio Pictures, Inc. New York opening at Loew's Criterion: 26 October 1951. U.S. release: October 1951. U.K. release: 26 November 1951. Australian release: 8 February 1952. 10,256 feet. 114 minutes. SYNOPSIS: After the death of her own baby, a World War 1 widow devotes her life to looking after other people's children. NOTES: A re-make of the 1942 French film of the same name, directed by Jean Stelli from an original story and screenplay by Francois Campaux, starring Gaby Morlay. Jane Wyman was nominated for an AMPAS award for Best Actress, losing to Vivien Leigh in A Streetcar Named Desire. Joan Blondell, nominated for the AMPAS award for Best Supporting Actress, dipped out to Kim Hunter, also of Streetcar. However, Jane Wyman did win the 1951 Golden Globe Award (voted by members of the Foreign Press Association) for Best Actress of the year. With a world-wide film rentals gross of $3.55 million, one of RKO Radio's most popular pictures of the year. In Australia, the movie proved a particularly strong draw-card, coming in at number 20 on the nation's list of major ticket-sellers for 1952. COMMENT: A lengthy portmanteau film, tied together by a nurse who is not only the script's central character, but its active protagonist who appears in every single scene! Naturally, the film will stand or fall by the casting of this central role — and unfortunately it falls. Jane Wyman is totally inadequate. This is a woman who is supposed to have spunk and personality, but Jane Wyman's portrayal is consistently dreary, — the mousy, self-effacing stiff-upper-lip of the earlier scenes turning into the garrulous, old, cliché- chattering windbag of the concluding episodes (which are doubly slow-moving as Miss Wyman has chosen to totter through them at half her normal, snail-like pace). The only other character that runs through the film is that of the misanthropic toy-shop proprietor, a creation of mind-boggling incredulity. It is never revealed that this character has any hidden wealth or private means, yet his shop is always well-stocked even though he persistently chases his few customers away. It is hard to see how the Jane Wyman character could be attracted by this anarchist, especially in view of the charmless manner in which he is played by Cyril Cusack. The rest of the cast is rather better. Laughton over-acts atrociously, but Joan Blondell brings plenty of zing to her sketch and is only cowed by the impossible dialogue in a climax of sheer bathos. The other cast members flit across the stage but briefly and do not get a chance to make a deep impression, though Agnes Moorehead, Audrey Totter, Everett Sloane and Henry Morgan make the most of their limited opportunities. The direction is competent but stolidly undistinguished, though it is well-served by the photography and art direction. Still, no matter how good these factors might be, you can't build a house on a foundation of straw — a script that descends to bathos and cliché at every opportunity and a lackluster performance in the pivotal role."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Wald/Krasna Productions"],
      "summaries": ["Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges, the children of various employers, grow and soon find themselves ready to face the world. When it seems that she will be alone, the nurse finds that her 'children' have ideas of their own in regards to helping their beloved mentor."],
      "budget": 0
   },
   "movielensId": 144842,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-10-26",
      "dvdReleaseDate": null,
      "directors": [
         "Curtis Bernhardt",
         "Busby Berkeley"
      ],
      "runtime": 113,
      "movieId": 144842,
      "title": "The Blue Veil",
      "mpaa": "",
      "actors": [
         "Jane Wyman",
         "Charles Laughton",
         "Joan Blondell",
         "Richard Carlson",
         "Agnes Moorehead",
         "Natalie Wood",
         "Vivian Vance",
         "Audrey Totter",
         "Cyril Cusack",
         "Everett Sloane",
         "Alan Napier",
         "Les Tremayne",
         "Dan O'Herlihy",
         "Harry Morgan"
      ],
      "imdbMovieId": "0043350",
      "originalTitle": "The Blue Veil",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges, the children of various employers, grow and soon find themselves ready to face the world. When it seems that she will be alone, the nurse finds that her 'children' have ideas of their own in regards to helping their beloved mentor.",
      "tmdbMovieId": 114081,
      "avgRating": 3,
      "releaseYear": "1951",
      "numRatings": 1,
      "posterPath": "/35BSBX1RPD4ApMJjyycN0QjHahl.jpg"
   }
}