{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "knight templars",
            "id": 208681
         }
      ],
      "imdb_id": "tt0073461",
      "video": false,
      "title": "Night of the Seagulls",
      "recommendations": [
         28067,
         12550,
         28058,
         67737,
         7454,
         79258,
         236035,
         111438,
         64725,
         5796,
         102758,
         40721,
         7513,
         29191,
         14105,
         49212,
         50108,
         34104,
         36600,
         3054
      ],
      "backdrop_path": "/lnqd8xhobIBIrV6yM3glhBef0iK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Henry Stein",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc8d",
               "name": "Víctor Petit",
               "profile_path": null,
               "id": 99566,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Joan Stein (as Maria Kosti)",
               "gender": 1,
               "credit_id": "52fe4577c3a368484e05cc91",
               "name": "María Kosty",
               "profile_path": "/wfxhzKCcNmWWE0FPgY0TeTOOyeP.jpg",
               "id": 97630,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lucy (as Sandra Mozarosky)",
               "gender": 1,
               "credit_id": "52fe4577c3a368484e05cc95",
               "name": "Sandra Mozarowsky",
               "profile_path": "/4ZkWSHRmphmInpqBwI1Hf25p3xt.jpg",
               "id": 99567,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tilda Flanagan (as Julie James)",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc99",
               "name": "Julia Saly",
               "profile_path": "/iUjOAj3LSqLuh1xJydPGgoCEhhS.jpg",
               "id": 99568,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Teddy",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc9d",
               "name": "José Antonio Calvo",
               "profile_path": null,
               "id": 99569,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cca1",
               "name": "Javier de Rivera",
               "profile_path": null,
               "id": 99570,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mrs. Flanagan",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cca5",
               "name": "María Vidal",
               "profile_path": null,
               "id": 99562,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Flanagan",
               "gender": 0,
               "credit_id": "580e421cc3a3685990001557",
               "name": "Fernando Villena",
               "profile_path": null,
               "id": 23604,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "580e4229c3a368598c0014f4",
               "name": "Oscar Phens",
               "profile_path": null,
               "id": 1698980,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Girl sacrificed at the beginning",
               "gender": 1,
               "credit_id": "580e423d9251416e120016d6",
               "name": "Susana Estrada",
               "profile_path": "/glOR4exhV5NVp3vOaQqBHQLRA2H.jpg",
               "id": 1336175,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "580e42479251416e120016dc",
               "name": "Luis Ciges",
               "profile_path": "/1374WzJLyuhkipOefkNcmhAwvu7.jpg",
               "id": 37525,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4577c3a368484e05cc89",
               "name": "Amando de Ossorio",
               "profile_path": "/yGqpK7RjXyyCaD9GyTU7Cf2xCLa.jpg",
               "id": 72891,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546ba0c4c3a368513d0004b6",
               "name": "Amando de Ossorio",
               "profile_path": "/yGqpK7RjXyyCaD9GyTU7Cf2xCLa.jpg",
               "id": 72891,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5754a2f39251411762001534",
               "name": "José Ángel Santos",
               "profile_path": null,
               "id": 1631229,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5754a30992514106fe00055c",
               "name": "José Antonio Pérez Giner",
               "profile_path": null,
               "id": 97634,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5754a31fc3a3685f810009da",
               "name": "Antón García Abril",
               "profile_path": null,
               "id": 72894,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5754a33b92514132f8000049",
               "name": "Francisco Sánchez",
               "profile_path": null,
               "id": 105121,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5754a34cc3a368091a000720",
               "name": "Pedro del Rey",
               "profile_path": null,
               "id": 37503,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "580e4272c3a3685990001586",
               "name": "Ana Criado",
               "profile_path": null,
               "id": 1698981,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "580e427fc3a3685993001530",
               "name": "Cristóbal Criado",
               "profile_path": null,
               "id": 1095244,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "580e429bc3a3685993001546",
               "name": "Modesto Pérez Redondo",
               "profile_path": null,
               "id": 97661,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "580e42a89251416e1c0016b9",
               "name": "Pedro Pardo",
               "profile_path": null,
               "id": 1696728,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "580e42b89251416e1600176e",
               "name": "Alfredo Fernández",
               "profile_path": null,
               "id": 1698982,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "580e42c6c3a3685998001467",
               "name": "Antonio Luengo",
               "profile_path": null,
               "id": 1698983,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "580e42d3c3a36859900015c5",
               "name": "Blanca Rodríguez",
               "profile_path": null,
               "id": 1176395,
               "department": "Editing",
               "job": "Assistant Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.854142,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 28071,
      "vote_count": 14,
      "budget": 0,
      "overview": "The Knight Templars return in this fourth installment of the Blind Dead seris. On this outing, the Templars haunt a fishing village, where they rise seven nights every seven years to claim their sacrificial offerings in return for the safety of the townspeople.",
      "similar": [
         74997,
         588,
         357096,
         10781,
         133805,
         362057,
         9373,
         73861,
         1696,
         15069,
         238636,
         3600,
         28691,
         2652,
         156022,
         281957,
         39899,
         663,
         341006,
         6312
      ],
      "original_title": "La noche de las gaviotas",
      "runtime": 89,
      "poster_path": "/naz4U7pAy7PquTY7cgRsHoVNaqF.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pérez Pareja, M. Flor",
            "id": 38791,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ancla Century Films",
            "id": 38792,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Profilmes",
            "id": 4948,
            "origin_country": ""
         }
      ],
      "release_date": "1975-01-01",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Blind Dead Collection",
         "id": 108170,
         "poster_path": "/svH0zAbEIDh6mCFDHy5DjR3R79X.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amando de Ossorio"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Amando de Ossorio",
         "Amando de Ossorio"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0073461/",
      "coverLink": null,
      "actors": [
         "Víctor Petit",
         "María Kosty",
         "Sandra Mozarowsky"
      ],
      "reviews": [
         "I can not think of anything bad to say about this movie. It has everything- Goth, zombies, gore, virgin sacrifices, good acting, likeable characters, scares, and fun. If you have not seen this movie you are not leading a complete life! See it now!!!!!",
         "The fourth installment of Amando De Ossorio's 'Blind Dead' series, \"La Noche De Las Gaviotas\" aka. \"Night Of The Seagulls\" is a very creepy Spanish Horror Exploitation flick, and, after the great original, the second best part of the series. When Dr. Henry Stein (Víctor Petit) and his wife Joan (María Kosti) come to a fishing village in the middle of nowhere, where Henry is to replace the old local doctor, the locals seem hostile and refuse to talk to the young couple. The young couple hear strange noises at night, and after they employ a local girl, Lucy (Sandra Mozarowsky), they begin to find out why the locals are not so keen on talking to strangers. The little village is haunted by the Living Dead. Devil-worshiping Templars, who had been blinded and executed for their evil habit of sacrificing young women and drinking their blood in order to gain eternal life in medieval times, rise from their graves for seven nights every seven years. And the villagers have to pay a horrible price to the blind dead for sparing their village... \"Night Of The Seagulls\" is not quite as great as \"Lan Noche Del Terror Ciego\" aka \"Tombs Of The Blind Dead\", the first part of the series, but it is definitely a very entertaining horror flick and creepy as hell. The performances are better than in the second and third part, Víctor Petit and María Kosti are good in the leading roles and Sandra Mozarowsky (who was only 16 when this film was made, and who sadly committed suicide at the age of only 18 in 1977) fits into the role of Lucy very well. Amando De Ossorio definitely invented some of the horror cinema's creepiest creatures when he created the Blind Dead, and these evil Templars are once again scary as hell. This fourth installment of the series is, in my opinion, actually the second-creepiest part after the first. The incredibly eerie score was one of the greatest aspects of \"Tombs Of The Blind Dead\", and since it worked so well with the first one, Amando De Ossorio wisely used it for all of the sequels too. And I couldn't imagine any other score that would fit as well into \"Night Of The Seagulls\", as this eerie choir, which manages to even intensify the creepiness and suspense. The last part of the \"Blind Dead\" series, and the second-best to the first, \"Night Of The Seagulls\" is a creepy and amazing little film that no lover of Eurohorror can afford to miss!",
         "I got to admit I am a big fan of the first three Blind Dead movies, although three has many flaws, it's still pretty damn good. Now comes the last of the series, and in my opinion the best. There are still some character issues and makes you wonder who sent the doctor to that village? But this final answers allot of questions left open in the first three films. Plus it comes to a great climax scene which I will not give away. You'll have to see it to believe it. The dubbing was pretty good, the voice over actors do a good job, they stay loyal to original script without any major changes, that I can tell. I might be wrong on that. A cool movie series has a very cool climax and every one of them is a buried treasure and if you enjoy blind monsters killing naked virgins for they're blood, this is the movie for you. I give it a perfect 10 STARS.",
         "Even if you don't rent a lot of Zombie flicks and you aren't familiar with earlier titles in the Blind Dead series, you may find joy in this one. It is certainly the fastest paced and most satisfying of the Knights Templars films, at least in US video release as Night of the Death Cult.",
         "\"Blind Dead\" tetralogy(1971-1975)is among the best and most famous Spanish horror films of their time.These movies are surprisingly well-made and creepy.The best feature of the films is their title menace:the Blind Dead,mummified zombies which rise from their graves to drink the blood of their victims.\"Night of the Seagulls\"/\"La Noche de las Gaviotas\" is regarded as the weakest film of \"Blind Dead\" series(the other three movies are \"Tombs of the Blind Dead\",\"Return of the Blind Dead\" and \"Ghost Galleon\").I think that this film is unfairly criticized-there is actually plenty of atmosphere here.Particularly effective is the sense of stoic dread that hangs over the village.Every seven years,these people must give up seven of their children,so that the others might live.Unfortunately the Templars are treated with far less mystery and awe than they are in other films.Still the climax is quite suspenseful and the Templars look terrifying.Overall I enjoyed this film,so if you liked this highly original and imaginative series give this one a look.",
         "You should be ashamed of yourself for voting this particularly unique entry into the horror canon a 5.4! The Blind Dead quadrilogy is unique in that the 4th film might be the best of the series, at least in my mind after just recently watching all four. Most trilogies or quadrilogies fail to meet up to expectation in the third or fourth installment, but I think this one might be the most interesting of the Blind Dead series. Amando de Ossorio expands and enriches the evil mythology of the Templar Knights and their use of black magic, giving it a much more disturbing quality than seen in the previous three films. Technically this film is better photographed, has better acting, and truly delivers characters you believe in and empathize with. Also the Blind Dead creatures move with more fluidity than seen in the previous three. My only concern with this box set is the lack of the original voice track with subtitles included, perhaps that is why these kind of films get rated so low. I admit the voice over work can be hard to listen to, especially when you have lines from a 25 year old girl being read by a 55 year old voice over artist. The scene of Teddy (Jose Antonio Calvo) peering in through the bedroom window leaves a lasting impression, especially after we see local boys pushing him from the cliff. It's a striking scene because it shows a village with a history with the Knights Templar so long that they have begun to imitate the Knight's evil ways. Usually I really like the darker horror film endings seen in Tombs of the Blind Dead and the Ghost Galleon--truly great nihilistic contributions--but i was actually hoping for a happy ending in this one. And you can almost see this film as a piece of Anti-Totalitarian agitprop if you really think about it. One small family overturns a long tradition of systematized brutality that saves an entire village. I think this film is smarter than people give it credit for. I can honestly say I prefer this film to Tombs of the Blind Dead. This is definitely worth returning to. 9 out of 10 Stars.",
         "Fourth and enjoyable sequel of the Templars dead series . The blind dead Templars return again from the 13th century with this eerie story . The film starts when a couple formed by a doctor ( Victor Petit ) and his wife ( Maria Kosti ) go to a coastal small community where are unfriendly received . Only the village's dumb ( Jose Calvo ) and a young orphan ( Sandra Mozarowsky ) make acquaintance with them . They aware that for seven nights every seven years, the villagers have to sacrifice their virgin daughters to these eyeless dead during a nocturnal ceremony on the beach . Then the priests warriors wake up from the tomb worshipping a strange idol and begin their criminal rampage . Ancient Zombies return of graves causing wreak havoc on the village , horrifying and torturing the rural population . They make a brutal massacre in the little village and the protagonists are surrounded in a house . Meanwhile the starring attempts to save the damsel in disgrace . This third following ,the first sequel was ¨Return of evil dead¨ , from the original ¨Tombs the blind dead¨ also we find the famous blind dead zombies which rise from the tombs 500 years after to wreak havoc upon some beautiful Euro-babes . The zombie-like pack of ancient warriors priest awake and rising from the graves to kill and torture the unfortunate victims . They were condemned and eternally dammed by cult practicing human sacrifices and blinded by crows. They encounter their victims by means of screams and sounds. This is a cheap Spaniard production with lack luster and low budge t. Special effects are ridiculous and embarrassing, absurd and frankly lousy . In the film appears known Spanishtrash actresses as Sandra Mozarowski, Susana Estrada , Julia Saly and Maria Kosti . This atmospheric horror movie contains scary scenes when appear the living dead Templars . It's the third following of the first great success and immensely popular ¨Tombs of the Blind dead¨ which to be continued by a trilogy : Return of evil dead, Ship of Zombies or Blind dead 2 and this one also titled Blid dead 3 or The night of the sea gulls . The Zombi-like are blinded by crows but they made human sacrifices and were executed and the clergymen return eventually to the life . Good exteriors filmed on seaside outdoors as Tossa De Mar and Ampurias, Girona and interior set in Talamana del Jarama (Madrid) , location in which during the 60s and 70s were filmed several Spanish terror movies . Creepy and frightening music especially when the dead attack is well composed by Anton Garcia Abril, author of the four eerie soundtracks . This lack budget film is regularly directed by Amando De Ossorio but is amusing and entertaining . This is a mediocre attempt to cash of following exhausted medieval warriors saga.",
         "You certainly can't reproach Amando De Ossorio of being lazy or repetitive, as this fourth & final installment in his terrific \"Blind Dead\" series is again very different in tone and content than any of the previous three. \"Night of the Seagulls\" is more mysterious and atmospheric than the other films and De Ossorio also throws in an compelling, albeit unoriginal, outsiders-in-a-closed-community sub plot. Young doctor Henry and his wife Joan arrive in a remote seaside village where they're given a VERY unfriendly reception by the oddly behaving locals. Only the town's nut Teddy and maiden beauty Lucy make acquaintance with the new arrivals and also inform them about the village's inescapable \"pact\" with the undead Templar Knights. For seven nights every seven years, the villagers have to sacrifice their virgin daughters to these eyeless zombies during a nocturnal ceremony on the beach. Okay granted, the sacrifice element in the story is definitely not new and the Templars are given less screen time than usual, but still this is a genuinely creepy exploitation highlight! You can either begin to sum up all the shortcomings and stupidities in the script (and yes, there are quite a lot of them), or enjoy the tense atmosphere and unique filming locations instead! The very weakest moments of the film \u0096 like that horribly lame ending \u0096 are somewhat more difficult to forgive, but there's graphic gore and sleaze to make up for that. By the way, did you know that skeletons that are dead for more than six centuries still bleed when you destroy them? Oh yeah, massively even! Throughout filming four similar movies, Amando De Ossorio's directing always remained solid, the choreography was always stylish, the music was always petrifying and the acting performances were always above average! That's definitely praiseworthy, too. Every single entry in the \"Blind Dead\" saga is highly recommended to every true horror fan.",
         "The Spanish zombie film series known as the \"Blind Dead\" films finishes with this typically well done horror show. The Knights Templar are once again doing what they do best. This time, they haunt the residents of a coastal village for seven nights, every seven years. Beautiful young virgins must be sacrificed for the village to receive some semblance of peace. Into this setting come the intrepid young doctor Henry Stein (Victor Petit) and his lovely wife Joan (Maria Kosty). The locals make it clear that he is not welcome, but he insists on meddling in their business, and naturally comes to regret it. \"The Night of the Seagulls\" is good and solid in the best tradition of Euro horror. It's as beautifully atmospheric as the best in the genre. Director Amando de Ossorio, who'd done all the previous entries, is in his element, and he crafts an effectively macabre outing. It's not going to be nearly gory enough for some viewers, but dwelling on the graphic violence is clearly not de Ossorios' priority this time around. It's all about the mood and the style. One can hardly fail to notice that there is an absence of strong primary colours, therefore the picture doesn't exactly \"pop\". It's done in a true \"black & white film in colour\" manner. The music score by Anton Garcia Abril is sometimes repetitive, but overall it's eerie. The admittedly simple story plays like a nightmare come to life. The acting is generally engaging; Henry and Joan are obviously not the brightest bulbs in the drawer, but they're not unlikable. Both Petit and Kosty are fine. Standing out are Sandra Mozarowsky as the brave Lucy, who's willing to befriend the couple, defy her peers, and divulge as much exposition as she knows, and Jose Antonio Calvo as the much abused town simpleton Teddy, for whom it's not hard to feel sympathy. The Knights Templar are as spooky and hideous as they've ever been. Well worth watching for genre buffs. Seven out of 10.",
         "A doctor and his wife open his practice in a traditional coastal town, where they are met with distrust and hatred from the locals. The couple soon find out that town harbours an ancient evil - offering resident women for sacrifice to the zombie dead Knights Templar then to be eaten by crabs. Although only connected by the Knights returning to life Night of the Seagulls (La Noche de las gaviotas) is the fourth and final zombie Templar film from Director /Writer Amando  De Ossorio.  Although it takes about 20 minutes for the Knights to rise from their graves in the seaside town, Night of the Seagulls is the faster paced of the bunch. This borrows from H. P Lovecraft, clearly Dagon has influenced this instalment. There's more fog, more eerie music and the dreamlike visuals come thick and fast, odd townsfolk, zombie knights on horseback and screaming seagulls.  There are fewer leads, the couple and the village girl are adequate enough and there are plenty of worn and old faces on display, Amando De Ossorio throws in the obligatory slow 'village idiot' that is hounded by the community. Debatably I maybe being to critical here but as a standalone film it works better if you haven't seen the other Blind Dead films, but for those familiar with them it's old trodden ground, a remake of a remake, that's it hard to enjoy fully without fresh eyes. The dubbing and seventies jumpers aside this last Blind Dead retains it's creepy atmospheric factor and trades the better sets for some character development.  Technically it's put together well but the closing act with a siege on the a house has been done and despite some good makeup effects is somewhat anti-climatic. That said, it redeems itself with the church showdown and conclusion. All in all a mix bag of enjoyable bones.",
         "Having recently caught some snippets of the fourth entry in \"The Blind Dead\" saga on late-night Italian TV, I did not have high hopes for it but, surprisingly, it was a definite improvement on the previous film. Although the film is ostensibly set in contemporary times (in Scotland?), everything looks several centuries removed with diffident, superstitious villagers suspicious of foreigners, quaint religious customs smacking of Paganism, etc. It's a small wonder that I was reminded of films like STRAW DOGS (1971) and THE WICKER MAN (1973) as it played on, not to mention a village idiot straight out of RYAN'S DAUGHTER (1970)! But this eclectic, disparate air only manages to lend the film a freshness missing from previous outings in the series. One thing that I was always curious about is that while the Knight Templars are always seen to wear white in the 'flashback' sequences, the resurrected \"Blind Dead\" are clad in grayish-brown cloaks; perhaps the color white was thought to give them too benign a look? Although this was officially the last of \"The Blind Dead\" films, infamous Spanish film-maker Jesus Franco apparently made his own version of the tale in LA MANSION DE LOS MUERTOS VIVIENTES (1982); unfortunately, I missed out on a chance to rent this on DVD-R while I was in Hollywood a couple of weeks ago!",
         "Night of the Seagulls is the last movie of the famous Blind Dead series made by Spanish film director Amando de Ossorio. This is one of the best low-budget horror movies of the seventies. It does contain many mistakes, of course, but that is to be expected in this type of movie. We can not wish here for production values such as in \"Gone with the Wind\". Amando de Ossorio had enormous difficulty in financing this movie, which was just about to become one of those forgotten movies who could not be finished due to lack of money. Finally, they managed to solve the situation with the help of a friend of Ossorio, J. Bermudez de Castro, an aristocratic Spaniard from an old and wealthy family who possessed a vast culture and particular tastes in literature and cinema. This movie has also some peculiarities that make it an important film, or at least a curiosity. One of them is the fact that Sandra Mozarowsky is one of the actresses. Sandra Mozarowsky is the pretty and young brunette maiden called Lucy. This girl died in mysterious circumstances not even three years after making this movie , being just 19 years old. The strange death of Sandra Mozarowsky conmotioned Spain at the time. This girl used to die in nearly all the movies she appeared in, and her mysterious \"suicide\" still remains a matter of controversy, as she was rumored to be friendly with high personalities of Spain. The script, photography and story are pretty good. Also, the HP Lovecraft touch goes very well with the story. The Pagan Idol worshiped by the Templars resembles very much the Philistine idol dagon, or the Carthage-Phoenician deity \"Moloch\". Human sacrifices in coastal states were not unknown in history. The \"Dagon\" or \"Horror of Dunwich\" twist sits well with the movie. The scenes where the ritualistic human sacrifices take place, at dawn in abandoned beaches, are beautifully filmed. The scenes of the Idol Sacrifice and worship are very good, and the Blind Dead Knight Templars are convincing and creepy as usual. Very interesting little gem, with the added charm of the presence of the sad and hauntingly beautiful Sandra Mozarowski, a pretty maiden with a tragic destiny.",
         "Night of the seagulls is my favorite Amando De Ossorio's movie . All the flicks he made about the legend of the templars zombies are pretty decent given the difficulties to surmount to fund and create an horror film in the late 60s early 70s Spanish industry . La noche de las Gaviotas appears as the more credible and well rounded outcome among his creations ( well don't know if we can use the term credible when we are referring to templars zombies) . Ossorio manages to transmit an eerie and creepy atmosphere throughout the film . All action is located in a remote and isolate village in the Galicia's seaside , whose villagers are encircled by the Blind Dead cult . Sole solution to ease the templars' blood thirst is to offer them young virgin for sacrifice . A young doctor and his wife arrived there and, obviously they don't seem to agree with local traditions . Villagers don't seem to love foreigners either , so you can expect a tied match Well , plot might seem a bit dull and won't dare to deny that actually is , but what counts here is the atmosphere Ossorio manages to create a chilly and eerie ambiance , maybe due to the remote localization in which the film was shot but for whatever reason film is actually very effective . Scenes where templar's appears on the beach to regain their victims are pretty well filmed",
         "A doctor Henry Stein and his young wife Joan move to a remote seaside village,. Its Klein's first attempt at his own practice and despite early doubts about the village they stay. The villagers are all odd, they don't like outsiders, even the previous doctor warned them to get out. Sure enough strange things begin to happen immediately, they witness a ritualistic procession to the beach with the women of the village all wearing black hooded habits, they are leading a young girl in white, the Kleins heeding the advice they were given, do not meddle and return to their home and wait until morning to investigate. Befriending a local girl they slowly begin to piece things together, locals girls are being sacrificed to ward off the Blind Dead from the village. Night of the Seagulls improves immensely on its predecessor and is a darker instalment in the series, with a welcome return of the gory virgin slayings. The Blind Dead showing a slightly improved turn of pace as they feed on the newly disembowelled victims. The film is still lacking in some departments, with the nightly sacrifices becoming rather samey, its not until near that the pace picks up as the Dead Knights Templars advance on the village to take revenge on the Kleins. Solid entry, but its pace will turn many off.",
         "The first two Blind Dead films were excellent horror movies, but after the stumble with the third film; I feared that the series may have ran its course. However, inventive director Amando De Ossorio wasn't happy to create a film like the rest of the series, and this fourth instalment; Night of the Seagulls, is wickedly different to any of the other films in the series. The Templar's really do get everywhere, and after their escapades in a small town and aboard a 16th century galleon in the middle of the sea, we find them in a small fishing community. Their mythology has changed again, and they have this little village at their mercy as they rise from the grave for seven days every seven years to claim virgins for sacrifice. We pick up the plot as a doctor and his wife move into town, only to be greeted with a frosty reaction to their presence. Shop keepers won't serve them, and townsfolk don't want to be treated by the doctor - only the village idiot and a beautiful young girl have anything to do with the couple...and what's the deal with the circling flock of seagulls? The title, Night of the Seagulls, sounds a bit silly; but at least Ossario gives the audience a reason for the choice. The reason is actually quite good, and while overall the film lacks originality; the way that the director pulls elements such as the sacrifices, the seagulls and his own troupe of Blind Dead Templar's together is really well done, and ensures that this is more than merely a third sequel to an obscure Spanish zombie movie. The Templar's themselves don't appear in the movie for very long, but at least they get to ride their horses this time; something severely lacking in the previous instalment. Even during the scenes where the stars of the show aren't present, Ossario keeps the action going with a fairly decent story surrounding the lead characters, and a decrepit and foreboding atmosphere, which is the real star of the show if you ask me. Considering that the Blind Dead series can be aptly described as Eurotrash, it's surprisingly well produced; and this film doesn't disappoint in that respect. Night of the Seagulls may not be one of the best zombie movies ever made; but it's a nice little film and comes highly recommended along with the rest of Ossario's series!",
         "Not sure what exactly it was about \"Night of the Seagulls\" that makes it stand apart from the other Blind Dead films to me, but it just has an ambiance to it that the other films were missing. I got the Blind Dead Box Set, which includes a little book that says that \"Night of the Seagulls\" is regarded as the weakest of the four. So, I went into it a little jaded. Maybe that's why I felt rewarded at the end of this one. The plot is similar to the other films, but the overall creepiness was just better and more effective. There are a few scenes where the templar dudes are trying to get into houses or chasing people and the tension is thick and very real. Anyway, I really liked this one. Definitely as good or better than \"Tombs of the Blind Dead.\" 7 out of 10, kids.",
         "I watched this movie after seeing \"Zombie Flesh Eater\" thinking it would be just as satisfying. Nope. The evil skeletons (Knights Templar) return again, but they always move in slow-motion on horses, a cheap effect. What really bites about this installment is the fact the dialogue is so boring. Plus, I still can't understand what the crabs were all about. Every time a virgin was brought back to the lair, we see slithering crabs around her hair. Did the Knights transform into these crustaceans? I really don't care. This movie is very forgettable. I recommend \"Zombie Flesh Eater\" instead. The opening coffin scenes are much more eerie...and the skeletons don't have crabs!",
         "This fourth and finale movie in the Spanish zombie franchise The Blind Dead is sadly the worst one in a series that progressively got worse and worse from the outset. My ratings were 8, 6, 4 and now a 3 so maybe it's best that the franchise ended when it did. I really was blown away by the first film, I simply didn't expect to enjoy it as much as I did and gradually became mortified upon realising that this franchise wasn't going to continue with that level of quality. The first film was original, atmospheric, well paced and genuinely fascinating. Sadly they simply ran out of ideas and it all fell apart. This fourth movie tells the story of a doctor and his wife who move to a beautiful coastal village only to discover that girls are being sacrificed to the Blind Dead. Though the concept is solid, the delivery falls flat. You barely see the dead at all, the execution is flacid and it breaks my heart to say it simply isn't very good. The Blind Dead collection had all the tools to be the stuff of legends but for me will be remembered as squandered potential. The Good: Couple of okay ideas Cast are competent The Bad: Novelty is gone Poorly made Really quite dull Things I Learnt From This Movie: When sacrificing a woman its best to get her boobs out first, because reasons Dead templars like to give their victims crabs",
         "This fourth and finale movie in the Spanish zombie franchise The Blind Dead is sadly the worst one in a series that progressively got worse and worse from the outset. My ratings were 8, 6, 4 and now a 3 so maybe it's best that the franchise ended when it did. I really was blown away by the first film, I simply didn't expect to enjoy it as much as I did and gradually became mortified upon realising that this franchise wasn't going to continue with that level of quality. The first film was original, atmospheric, well paced and genuinely fascinating. Sadly they simply ran out of ideas and it all fell apart. This fourth movie tells the story of a doctor and his wife who move to a beautiful coastal village only to discover that girls are being sacrificed to the Blind Dead. Though the concept is solid, the delivery falls flat. You barely see the dead at all, the execution is flacid and it breaks my heart to say it simply isn't very good. The Blind Dead collection had all the tools to be the stuff of legends but for me will be remembered as squandered potential. The Good: Couple of okay ideas Cast are competent The Bad: Novelty is gone Poorly made Really quite dull Things I Learnt From This Movie: When sacrificing a woman its best to get her boobs out first, because reasons Dead templars like to give their victims crabs",
         "What a way to end a series! This entry is a few notches above the previous film and perhaps just a hair lesser horror than the first 2 movies and overall it's European horror in it's purest form. This film is a bit more surreal and dreamlike than the other Blind Dead films and I'd probably also call it the scariest of the series. Another plus is it kind of plays out like Night Of The Living Dead combined with Straw Dogs. Of course I'm not comparing this film to either of those masterpieces, but what great templates to use. The plot of unwanted visitors to a cursed village might feel familiar to fans of Italian or Spanish horror. While in today's cinema they'd probably CGI a creepy, coastal village but of course nothing beats the real thing. You could probably look into where the movie was actually filmed, but I prefer to think it just exists in a dream (or nightmare if you prefer). When you watch this movie you'll understand what I mean. This locale, combined with some of cinema's best looking zombies, along with the requisite hints of blood and nudity will make any horror fan want to watch. The film starts strong and then slows up a bit in the middle to build tension. The zombies look so good and are so creepy that you'll wish they were on screen more. Never fear because the final 35 minutes are dedicated to our Blind Dead \"heroes\" and their siege on the doctor's house. Will mankind triumph over the evil zombie hoard in this final chapter or are we all doomed? You'll have to watch the movie to find out.",
         "Slow Plot, Acting is only OK, the Templars are only OK, the kill scenes are unconvincing, the ending sucked. Very slow plot, needed more work. The acting was only OK, sucked in most part. The village idiot was the best part. The creepy town had tons of potential but it failed there. The Templars looked good, but when they swing the swords, it looks like children playing, don't swing too hard, you may hurt someone. The kill scenes were weak. The movie has atmosphere because of the cinematography and the locations. The ending was the worst. Just knock over the statue and the undead are killed off. Not good. Tons of potential but it just didn't work well. The first Blind Dead movie had issues as well, but so far that may be the best one. Rating is a C, for a B movie, or at most 5 stars for the creepiness, cinematography, and location. I originally thought that the rating would be a C or D, or 3 stars, but the atmosphere saves this film.",
         "This proved to be the last in Spanish Director Amando de Ossorio's four-part Blind Dead series. The set-up is far less contrived than in the previous 'Ghost Galleon' (1974); instead of an ill-advised publicity stunt gone wrong, here we have the simple premise of a Doctor (Stein, no less, played by Victor Petit) and his wife (Maria Kosty) moving to an isolated fishing village. Although, why he insists on staying here to take up his post when everyone is either openly hostile, or completely ignores him, is typically baffling. And yet, without such wilfulness, where would horror plots be? Only local Lucy (Sandra Mozarosky, who tragically died not long after filming was completed at the age of 18) and José Antonio Calvo's village idiot Teddy show any friendship towards the couple. There is no denying Ossorio's skill at evoking a creepy atmosphere. Many familiar staples are here – misty graveyards, creaking doors, wonderfully isolated locations and decaying-looking sets. Every effort seems to have been made to make the seaport a closed, sinister, uninviting place. And pretty soon, the Knights Templar are emerging from their foul tombs with agonising slowness, their spindly clawed hands looking as if they could barely give you a tame stroke without turning to dust (perhaps it would have been better to dress the actors' hands, rather than provide separate twig-like appendages). The slow build-up to Lucy's final scene on the beach is excellent, very Jean Rollin-esque. Knowing what is going to happen to her doesn't make us optimistic of a less than grisly outcome. The ever-present shrieking birds from the title have a part to play too – according to Teddy, the pretty girls taken to sacrifice 'become the seagulls,' which is creepily enigmatic. Other than a fairly standard ending, this doesn't necessarily feel like final closure for these withered knights. The series could have continued. Perhaps it still might; there is plenty of mileage left in these memorably ethereal creatures.",
         "The last of the Blind Dead films features an absence of the scares the first two provided, but makes up for this with atmosphere by the bucketful. It is creepy as all hell, and dreamlike. A great many Euro- horror films are called such, but this is generally just a polite way of saying they are languid, boring or make no sense - see films from Fulci's mid-career, and some of Jean Rollin's early work for examples of this. Such is not the case with \"Night of the Seagulls\". In this Blind Dead offering, a seaside township has struck a bargain of sorts with the sightless spectres that prey on them: they will leave an offering of a young virgin girl (who else?) whenever the Blind Dead leave their tombs. This nefarious arrangement is threatened by the arrival of a doctor and his young wife, who immediately find the township strange and threatening. Only an \"idiot\", the village fool, reminiscent of the monobrow-having man in Return of the Evil Dead, is willing to help them. The last Blind Dead film opens with a shockingly violent scene as a girl's still beating heart is ripped from her chest. There is little violence afterwards however. There are some glimpses of bare breasts also, but nothing compared to the generally sleazy nature of Spanish horror ala Naschy and Franco. Overall, fans of atmospheric horror owe it to themselves to check this movie out.",
         "*Spoiler!* The last installment of the funny Blind Dead-series is a bore that extremely lacks in suspense and dramatic! Even more, it is a poor rip off from the first two parts where you can´t find any new ideas by far: middle aged rites, a feeble minded cripple and an under siege-sequence - you´ve seen it all before! The biggest disappointment however is the unspectacular showdown and the script writer was obviously out of any inspiration when he wrote this part! I won´t tell you the solution now, but they were killed much too easy when you consider that they´ve been able to terrorize a poor village for many centuries... I love the culty first part, the trashy second and even the third, but this one´s just unnecessary! 2 out of 10",
         "The last of the four Blind Dead films is possibly the weakest. That title is normally given to The Ghost Galleon,but at least that mustered some originality. This one mostly seems content to rehash things from the first two films {The Dead besieging a house,a flashback depicting a sacrifice,you get the picture},and the few original ideas are full of holes,such as the periodic sacrifice of virgins to the Dead in a TINY village that never seems to run out of them. Just wait for the 'explanation' for the seagulls flying at night! Still,the first half of the film does have quite a good atmosphere of dread,and Ossorio again shows how well he can build suspense. The Blind Dead,who appear less in this instalment than in the previous two,are still effective menaces,but all the scenes they appear are considerably weakened by what is probably the most pathetic day-for-night shooting ever. The scenes just look like they are taking place in the early morning. The film's last half hour is fairly exiting,but it's almost as if Ossorio didn't really care about this one,and just concentrated on odd little details,such as the crabs which crawl over the Dead's victims,a good and grisly touch. The Blind Dead remain classic movie monsters though. How about a Hollywood remake featuring slightly improved versions of the Blind Dead and a budget to do them justice?"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Ancla Century Films",
         "Profilmes",
         "Pérez Pareja, M. Flor"
      ],
      "summaries": [
         "The Knight Templars return in this fourth installment of the Blind Dead series. On this outing, the Templars haunt a fishing village, where they rise seven nights every seven years to claim their sacrificial offerings in return for the safety of the townspeople.",
         "In this final installment of the Blind Dead series, a doctor and his wife move to a small inhospitable coastal village where he plans to start a practice only to discover that undead demon-worshiping Templar Knights haunt the place."
      ],
      "budget": 0
   },
   "movielensId": 145010,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1975-01-01",
      "dvdReleaseDate": null,
      "directors": ["Amando de Ossorio"],
      "runtime": 89,
      "movieId": 145010,
      "title": "Night of the Seagulls",
      "mpaa": "",
      "actors": [
         "Víctor Petit",
         "María Kosty",
         "Sandra Mozarowsky",
         "Julia Saly",
         "José Antonio Calvo",
         "Javier de Rivera",
         "María Vidal",
         "Fernando Villena",
         "Oscar Phens",
         "Susana Estrada",
         "Luis Ciges"
      ],
      "imdbMovieId": "0073461",
      "originalTitle": "La noche de las gaviotas",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Knight Templars return in this fourth installment of the Blind Dead seris. On this outing, the Templars haunt a fishing village, where they rise seven nights every seven years to claim their sacrificial offerings in return for the safety of the townspeople.",
      "tmdbMovieId": 28071,
      "avgRating": 1.5,
      "releaseYear": "1975",
      "numRatings": 5,
      "posterPath": "/naz4U7pAy7PquTY7cgRsHoVNaqF.jpg"
   }
}