{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2889112",
      "video": false,
      "title": "Patrick's Day",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Maura Fitzgerald",
               "gender": 1,
               "credit_id": "52fe4e779251416c9113286b",
               "name": "Kerry Fox",
               "profile_path": "/6EVZpzoOVUHKqaLqgFrNTT014IN.jpg",
               "id": 17258,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Patrick Fitzgerald",
               "gender": 2,
               "credit_id": "52fe4e779251416c9113286f",
               "name": "Moe Dunford",
               "profile_path": "/ooCdXhEBN0sBPnDZccE6v9iKC48.jpg",
               "id": 1288730,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Karen Prescott",
               "gender": 0,
               "credit_id": "5301db7892514121a123689e",
               "name": "Catherine Walker",
               "profile_path": "/mwdMmbvkNQV8ak9XA56dfmaYHMs.jpg",
               "id": 232941,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "John Freeman",
               "gender": 2,
               "credit_id": "5301db9692514121952427a9",
               "name": "Philip Jackson",
               "profile_path": "/7SWbGBb0FUWvsS0j95kuNsfRWCg.jpg",
               "id": 25532,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e779251416c91132861",
               "name": "Terry McMahon",
               "profile_path": "/e0RPFhDyC0pl3ATp0cH0idxahen.jpg",
               "id": 1111202,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e779251416c91132867",
               "name": "Terry McMahon",
               "profile_path": "/e0RPFhDyC0pl3ATp0cH0idxahen.jpg",
               "id": 1111202,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5301d9d492514121a72390ea",
               "name": "Michael Lavelle",
               "profile_path": null,
               "id": 1293568,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5301d9e6925141219b223f35",
               "name": "Emer Reynolds",
               "profile_path": null,
               "id": 73292,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [],
      "popularity": 0.189155,
      "production_countries": [],
      "id": 253273,
      "vote_count": 3,
      "budget": 0,
      "overview": "A young man with mental health issues becomes intimate with a suicidal air hostess but his obsessive mother enlists a dysfunctional cop to separate them.",
      "similar": [],
      "original_title": "Patrick's Day",
      "runtime": 102,
      "poster_path": "/3KE1h25ZqCbQxryNPrErPhmdROt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-03-08",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terry McMahon"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Terry McMahon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2889112/",
      "coverLink": null,
      "actors": [
         "Kerry Fox",
         "Moe Dunford",
         "Philip Jackson"
      ],
      "reviews": [
         "I didn't know what to expect from this small Irish film, but I was blown away by its script and acting. Patrick's Day was extremely well- received by the audience at its world premiere at Austin's SXSW Film Festival. This setup that the story is about a mentally ill man's quest to find love turns out to be much more complex as the role that his mother plays in his life becomes clear. The film explores issues such as the meaning of intimacy, memory, sanity and love. Writer/Director Terry McMahon has done an excellent job of exploring these issues and Moe Dunford does a beautiful job in the lead role. This is the type of gem that one can often find at a festival like SXSW, but which often have a difficult time getting wider distribution. I hope this small film gets wider distribution, because more people really need to think about the complicated issues that it raises.",
         "I saw this film at the Galway Film Fleadh. I found it deeply moving and in a creative way, disturbing. I was pondering it and reliving it for several days afterward, and in fact have never forgotten its impact, which continues to evolve as the weeks go on. It is beautifully acted, directed and edited; all that skill contributes to a kind of magic, the film's ability to dive directly and compellingly into the emotions of the situation from the point of view of each character. The plot summary will never do it justice, as the film itself calls into question almost every easy name for anything. From my own point of view it is a film of love and heroism. But that's just how I see it myself. I have had strenuous arguments with other viewers defending their points of view, which are equally well supported. It's a film that stimulates strong emotion, not least because it avoids preaching about anything. The result is a very meaningful, heart-opening experience.",
         "Patrick's Day is beautiful\u0085\u0085.This movie written and directed by Terry McMahon does not stop at the end credits. It feeds you, stays with you and makes you re 'THINK' aspects about life, love and the endless conflict and struggles of 'the state of mind' or even the state of certain 'mind' predicaments. I expected to see another rendition of Jack Nicholson's 'The One Who Flew Over The Cuckoos Nest' but was pleasantly brought into a more grisly sincerity, a bold uniqueness that many films fail to grasp on the subject of mental illness. 'Patrick's Day' is today and a celebration of it's freshness and innovativeness on a sensitive subject, those living inside and those outside. It brings an audience to the fore, the here and now of attitudes, and methods of certain medical institutions and how these problems are addressed and challenged by many people today. It is informative and skillfully playful at the same time. Dunford is breathtaking and his performance leaves an almost hair-raising experience, one that may be familiar or even cutting-edge to its viewers. It is bold and subtle at the same time. It is crafted with care and intelligence by McMahon who could have easily missed the mark and gone in the other direction of pure 'stereotypical depiction'. Another side is the extraordinary cinematography of Michael Lavelle combined with Emer Reynolds gifted editorial decisions to bring an audience up close and personal to this provocative and ravishing tale of love, betrayal, vulnerability and sheer 'madness' in a magnificent sense. This movie is to be respected and considered instructive as well as acclaimed for it's outstanding veracity and candor. My favorite Nicholson quote \"We live, we die, and the wheels on the bus go round and round\" and there is no escaping the truth some people just can't handle! This is a movie not to be missed by anyone! This is by far one of the best movies I have ever seen bar none. It makes me very proud to be Irish.",
         "I saw Patrick's Day last night in Dublin! I've been looking forward to seeing this movie for a long time mainly because I admire Terry McMahon the writer/director. What he did with his first movie Charlie Casanova was one of the most inspirational stories of the recession. Getting it made and then picked up by studio canal at a time when everything seemed impossible, was a fist pumping \"get in there\" achievement! Terry should be a hero for any independent filmmaker and indeed any artist with the desire to undertake a project that's immense and insurmountable while encumbered by the economic vicissitudes of reality today. Taking all that into account I probably would've been happy enough if Patrick's day just didn't suck. I know the film has won awards and was lauded by many influential people who appear in the marketing material that wild-card distribution are using. But I'm afraid, I've become a cynic of late. I just don't believe anything that I read or see on the Internet any more, least of all anyone's self promotion. Despite my newly found cynicism I bought my ticket and popcorn, picked a seat in the middle of the middle of the theatre and strapped myself in for an experience where I knew absolutely anything could happen. I found over the years that when it comes to watching Irish made films, I've had to dramatically lower my standards and just watch it as a probably scarlet, Paddy flick and allowances would have to be made for its myriad flaws! Patrick's Day is not one of these movies, no dropped standards or allowances were required! Indeed all the balls stayed firmly in the air throughout. Not a scarlet moment, does it have! It sounds great, it looks great and it tells a riveting story which although it is original, it's dripping with the stuff of universal human condition! I'm not going to give anything away about the plot, I think the less you know about it before you see it, the better! The DP Michael Lavelle did an outstanding job! I don't remember walking away from many Irish films before, thinking about how the colour palettes were used to reflect the different moods of the characters. Is it usual to watch an independent movie and come away musing on one-point prospective and the symmetry of staging? I don't think so! They use some very clever camera work with first person perspective shots slipping in and out of focus to visually represent to the audience moments of intoxication or madness! In another quite magical and incredibly intimate scene the DP manipulates background light to create these abstract shapes erotic human union. That might sound a bit artsy fartsy but it's not because none of the techniques are gratuitous and the pace of the movie never drops enough for you to put your bitchy critical hat on! The sound-design, effects and tracks were all perfectly and seamlessly mixed together. This sounds like a platitude but audio is one area where an indie-movie can let itself down tragically. On the contrary, here I believe the whole sound department did a whopper job with more than a couple of stand out 'wow that's really impressive audio' moments. At times reminding me of a Joe Wright movie like Atonement because at cretin subtle audio effects are ratcheted in the moment up to tale over the senses for dramatic effect! Patrick's Day is Patrick Fitzgerald's story! Patrick is a schizophrenic man in his mid 20s who's been institutionalised for most of his life! Moe Dunford plays the part just like a fully-fledged movie star. For a relatively unknown actor it's ridiculous that he has such a strong camera presents! I have no doubt that we'll be seeing Moe again on the big screen, he's a proper actor who brought the good stuff to every scene! Kerry Fox who played Patrick's mother Maura was also very good as was Catherine Walker who played the love interest Karen Prescott. It's a story about mental health, sexuality, parenting, lies, control, authority, betrayal, violence and truth but it's primarily about love! Love under madness or madness under love! It's a provocative, compelling story, which skips along with nimble pace, only stopping to labour a point when some captivating acting demands it. There are some extraordinary scenes throughout the movie showcasing exceptional acting skill! You can see the actor's motivations and objectives, the obstacles in front of them and exactly what they're prepared to do to overcome these obstacles. During the 102 min's, I was moved to tears, laughed out loud a few times and even managed to squeeze in a fist pump. This movie isn't for pussies, it's a deliberate attack on the scenes and it will stay with you for some time afterword. This director is someone who is never short of something to say, so I found it remarkable that the same man makes choices with his direction, which favour showing over telling, again and again. As the writer, he's in every frame of the movie and the choices always appear to be objective, there's a definite reason why everything is done. He's telling us something, something gross and something subtle with the faintest whisper of the writers devices and chicanery, left only for the very perceptive to notice! This is a really good movie, it ticks so many boxes that it's easy to see why it swept the boards at all the festivals. I'm Very proud of Terry and Moe and everyone else involved, looking forward to seeing it again and I'm also super excited about what Terry will do next. Make sure you go to see it and support Irish Film.",
         "Director Terry McMahon courted controversy in 2011 with his debut, a satirical thriller called Charlie Casanova. A film he described as his 'punk rock statement', it was a feature made for the impressive sum of E1000 with the aid of a cast and crew assembled mostly through Facebook. Casanova was more than a bit rough around the edges, but McMahon kept that provocative streak for his second effort - and caused a stir for all the right reasons. Patrick's Day tells the story of Patrick (Moe Dunford) a young man in his late twenties who suffers from schizophrenia. We open at Dublin's St. Patrick's Day parade with Patrick on day release from the institution he calls home, having a day out with Mother Maura (Kerry Fox) to celebrate his birthday. Together they enjoy a fun fair, buy novelty hats , eat candy floss and do everything you would do with a ten year old on his birthday. But when Patrick and Maura get separated in the crowd, Patrick meets Karen (Catherine Walker) who is a bit tipsy and takes a liking to him. 'I have schizophrenia,' he feels compelled to blurt out to her, 'Sure haven't we all?' is her response. Patrick falls for Karen, to Maura's horror. She drives her son back to the institution, and even enlists a detective (Philip Jackson) to help her convince him that Karen is merely one of his delusions. Patrick is rocked, forced to confront the draconian way he is treated because of his illness, and is compelled to escape and find her. Or at least find out if she's fictitious. Patrick's Day is a remarkable piece addressing the lingering stigma surrounding mental illness, and a mentally ill person's right to intimacy. It is a fiercely humane drama, one of those rare ones that shatters you then sets you soaring, all the more moving for extending it's understanding toward well-meaning antagonist Maura. And that's not an easy task, in a film reminiscent of One Flew Over The Cuckoo's Nest. The writing is snappy ('Only a woman could demolish you with a compliment,' grumbles Jackson's beleaguered detective) and it's well shot too, McMahon and DoP Michael Lavelle filling it with expressive images. A vital and thought-provoking piece, it gave me a new perspective and made me re-think my attitude towards the topic and people in my life, and there's no higher praise than that. Not that there's no lightness to the film - 'Patrick is a twenty-six year old schizophrenic virgin...' was the entirety of the blurb for it at my local cinema, and that captures this film's mischievous spirit.",
         "Oh, the web love weaves. The Patrick's Day plot, along with perfect casting and acting and Tim Palmer directing (really, name one single scene or line which fails ... none exists!) This story presents a perfect analogy of our ability to wander in and out of believing what is real and what is manufactured reality. Love is the PERFECT example. Human frailty, psychosis, and plain over-reaching doctors, mothers, and police intervention(s) along with accompanying pathos combine to make this not only interesting but thought provoking as well! Did I like it? I would like to describe the film as an action, drama, thriller undercurrent story telling success story. Totally not possible without the excellent supporting cast of Patrick's friend, Freddie (Aaron Monaghan) The Cop (Philip Jackson) Karen (Absolutely perfect performance - the flight attendant / love object) the DOG (man the dog is even perfect!) and Maura (Kerry Fox over the top Smothering Mom). Appreciate good music? Thank you Ray Harmon. This is an unforgettable movie. Thanks to all involved and not named - Renamed last minute by me - Kerry and the CooKoo's.",
         "I couldn't wait to see this in the run up to it's release, and I certainly wasn't disappointed. Patrick's Day is a very moving piece of work, an assault on the emotions, and has a fantastic central performance from Moe Dunford. There is excellent support from the rest of the cast, and especially Kerry Fox, brilliant as the manipulative mother who has convinced herself that everything she does is for Patrick's sake. Nicely shot too, with several compositions that seemed to evoke Patrick's state of mind at the time. It is an extremely compelling film, and difficult to come away from. There are different kinds of love, and this film shows us how far people will go to give it, receive it, and to feel it. In all it's forms. Love is madness. Great film.",
         "I was finally able to see this film here in the US after reading several reviews about it and I was not disappointed! It is a very unexpected love story between 2 people with mental issues and the jealousy of a mother that tries to prevent it at all cost. I don't think I ever hated a person as much as I did her while watching this film!! Terry McMahon really brings out the intensity of every character's feelings and emotions in Patrick's Day. Kerry Fox and Moe Dunford put down a remarkable performance! A beautiful and intense drama/love story that I definitely recommend! I can't wait to see more from this Director.",
         "I'd been wanting to see Patrick's Day from the moment I read about it. I have vivid memories of how affected I'd been by Terry McMahon's previous film, Charlie Casanova. I've followed the progress of Patrick's Day on social media, and was frustrated at the time it took to be shown in England. Thanks to the Tricycle for supporting its first London screening, I had the privilege to see Patricks Day in my home town last weekend. What an extraordinary film it is! One measure of a film for me is how many times during the screening that I 'leave' the film and think for myself. I was captured from the first frame as Patrick, in his own world, wheels a supermarket trolley around the store. From that moment I was completely drawn into Patrick's (Moe Dunford) world. Moe was utterly compelling as Patrick, as was Kerry Fox, who played his mother. Terry always takes on challenging subjects, and a film about a schizophrenic is as challenging as it comes. I came away from the cinema quite shaken, and moved by my experience. I'm not a film critic, but I know what I like. I'm also not a cinematographer, but I know sublime visual storytelling when I see it, and I know sublime visual moments when they are offered, like a gift. If you want to be challenged, and asked questions; if you want to be drawn into both anger and sadness, and then dumped back into a seat in a cinema, alone but surrounded by people who have just undergone the same emotional ride as you, then see this film! Haters will always hate, but if you have a gramme of decency and compassion you will be moved to a new understanding by Patrick's Day. If you don't then I recommend Jeremy Kyle.",
         "There are only three people, whose work, I would do whatever was necessary to see immediately. Terry McMahon tops that list. Having thoroughly enjoyed the dark complexity of his first film, Charlie Casanova and finding early reviews of Patrick's Day, intriguing, I made certain to view it in theater and procure the DVD. My opinion of this film intensifies with each viewing. Besides wanting to partake in the latest McMahon film creation, I was captivated by the synopsis of this film specifically, as it promised an engaging plot, multi- faceted characters, and an experiential journey in love as it traverses various psychological mine fields, in ways that we are not usually privy to. Each of the characters in Patrick's Day goes through a major metamorphosis, each caused by love. Each of them ignites our compassion, our rage, and at least for me, also my empathy. Love is neither good nor evil, a power greater than any other due to its visceral integration in every system of the human being – mind, heart, body, and soul and to that end can be savior or destroyer, a tool for the wielding of our choice, for ourselves and others. While Karen Prescott (Catherine Walker) a suicidal flight attendant is elevated out of the darkest space she has ever been in, by Patrick's innocently sincere, passionate, and unrelenting love for her, another woman in his life takes the purest of love and becomes a monstrous manipulator. Maura, brilliantly portrayed by Kerry Fox, has a vise like grip on her son, Patrick's life. Or rather she did until he fell in love with Karen. Invigorated and emboldened by the power of love surging through him, motivating him, and inspiring him, Patrick bucks authority, hides truths and actions, to preserve his romance and hopes for the future. Even Maura's outrageous and extreme efforts to convince him that Karen was a mere figment of his imagination and fantasies, do nothing to eradicate Patrick's feelings. Aside from a few tangible trinkets, it is truly Patrick's emotions, the experience of his heart, which keeps him on course with his memories while at odds with all the authority in his life. Maura's concern over how intense emotions of both love and passion, will affect the tenuous stability that her son maintains through medication, a controlled living environment, and daily routines, is well founded. What she does with that concern, how far she goes, how hard she pushes him, is simply horrifying. It is evident that she knows she cannot diminish the value or impact of romantic love on her son's psyche or heart, so instead she goes to desperate lengths to convince him, the love, the target of his affection never even existed. The psychological torture that she inflicts on her son is well within villainous scope. Is she a bad mother? Has she gone mad herself from fear for her son? Is she afraid for him, or of losing a part of herself if she loses him to another woman of influence in his life? Moe Dunford as Patrick Fitzgerald. How does one describe or praise a performance so realistically embodied – lived – that it is beyond a stellar portrayal? As you watch Patrick love and suffer, doubt and be certain, recede and assert, you just want to rescue him and somehow allow him to be free to love, to be himself. But who determines who he is since he is mentally impaired? Who makes the judgment calls on what is real/safe/possible for him as a young man with mental health issues? He argues and fights his mother, knowing his experience, but then allowing his trust in her to create self doubt. The lengths this drives him to, are – to most minds I believe – an unforgivable result of his mother's manipulations and lies. Dunford brings Patrick to life with powerful gentility, innocent reticence, passionate drive, raw honesty, and a heart so pure that it absorbs both the beautiful and the hedonistic equally and openly to his core. This poignantly humble and yet emotionally impactful indie film covers and uncovers some of the deepest concepts in life. Every scene held layers of subtleties that impacted as strongly as the direct actions and dialogue. There is nothing superfluous or gratuitous in this film. Nothing for shock value, even if shocking. No special effects to create drama, just true quality characters and plot that effectively stir dramatic emotional reaction. Every word, prop, scene, staging, and note or lyric of music in Patrick's Day is essential and an intricate detail in the landscape it paints for us of love, in its various forms, stages, and champions. Patrick's Day is a true gem, has deep resonating value, and that, to me, was clear in how it was presented from its trailers, synopses, etc, with dignity, accuracy, and integrity. Substance matters and Patrick's Day is indeed a substantial work of epic cinematic excellence. This film was crafted in such a way, so as to inflame emotions on every side, from every angle of a situation. This level of emotional multi- tasking makes most people uncomfortable. Patrick's Day goads us into facing the complexity of life, of emotion, and certainly of love specifically. Terry McMahon has done it again. This man's work cranks open the mind and lets in light that makes us truly examine our inner shadows: the motivations, agendas, foibles, weaknesses, and strengths. We are mesmerized by the characters Terry creates, so much so that we cannot look away, there is no averting the eyes, nor ego, as we come to realize, each time, we are looking at a part of ourselves. Having universal appeal due to its sheer humanity, this film MUST tour the globe; More must experience it, in theaters, and repeatedly via DVD.",
         "Sheer gorgeousness. The rich color scheme, the enchanting atmosphere, the dreamlike meeting, as well as the perfectly chosen Damien Dempsey soundtrack all move together rhythmically to make Patrick's Day the Irish Fairytale that it is. And like all tales, our characters must endure the initial turbulent journey in order to reach this elusive land we all know as the \"happy ending\". In Patrick, Maura, the detective and Karen's case, this journey is a struggle through dead notions of normalcy to reach a state of acceptance and peace, of community. The dreamlike field where Karen takes him on their first real date outside her dim lit, dread-filled room. The field called possibility. Through Karen's influence, Patrick sees a plane for the first time. A plane that really represents all that could be. All that awaits him outside the little world his mother has built for them both out of her own fears of the world, her own mistrust of people. A mistrust that turns both her and her son into prisoners. In the end, it is Patrick who then brings all of these strangers back to this field called hope: this sublime space that seems to exist somewhere in between reality and dreams, just as the dark corners of McMahon's Charlie Casanova existed somewhere between reality and nightmare. Through their trying to understand him, through their acceptance of him, they become more open-minded themselves. They free themselves from the shackles of old ideas. All of these details are why I would argue that the film is fundamentally a fairytale, a fairytale about the redemption of humanity through the cultivation of community.",
         "Patrick's Day, is a breath of fresh air. In it we meet Patrick (Mo Dunford), a young man who suffers from a variety of mental health problems as he embarks upon a romantic relationship with an enigmatic flight attendant named Karen (Catherine Walker) who, as it transpires, has mental health issues of her own, albeit ones which would be less obvious to an onlooker. Patrick's fiercely protective mother (Kerry Fox) is unimpressed by the pair's fledgling relationship and seeks out the help of a world weary cop (Philip Jackson) in order to bring an end to it – by any means necessary. The relationship between Patrick's mother and her 'hired gun' is arguably every bit as interesting as that of Patrick and Karen, if not more so. Here are two people who have been left severely damaged by the great lengths that they have gone though in order to achieve what they felt was right. In a sense they are kindred spirits, both of whom are struggling with the increasingly morally ambiguous path that they have embarked upon. It is a testament to McMahon's great writing and direction in that what is essentially a sub-plot manages be so compelling. At a glance, Patrick's mother could be perceived as a sort of wicked stepmother archetype as seen in the likes of Cinderella. However, such an interpretation of her character would be an uncharitable one. Her determination to drive Patrick and Karen apart is not indicative of any inherent cruelty or malice, but rather genuine love and a powerful maternal connection to her son. While her methods may seem cruel, they are born of her desire to protect Patrick, even if her protection is the last thing that he wants at this stage in his life. Kerry Fox plays the role wonderfully; here is a complex and challenging character who, while cast as a sort of villain to the piece, never feels like a truly bad person and is every bit as deserving of our sympathy as the star-crossed lovers who she opposes. Ms Fox is but one excellent performer in what is a brilliant ensemble cast. No amount of praise is too great for Mo Dunford in the titular role. His performance is simply spellbinding as he conveys a character who is suffering at the hands of his mental health demons. Vitally though, Dunford never allows said mental health problems to define who Patrick is as a character. He is a charming and affable young man first and foremost and, as such, has much the same needs and desires of others in his demographic. The fact that he has mental health issues is something of a secondary consideration as far as he is concerned. The film makes a point to highlight that Patrick is a product of who he is, not what he is. Patrick's Day, it must be said, is not the easiest watch that a viewer will encounter as it becomes apparent quite early on in the film that a happy ending where everything works out for the best is highly unlikely. It is however, a finely crafted story with impressive characterisation and powerful themes which, while difficult at times, is an absolute triumph which will leave much for the audience to contemplate long after the closing credits have finished rolling.",
         "I had been eager to watch this film since i first heard of it and was disappointed that it did not get a general release in the UK.The subject matter being very close to my heart (i work in mental health) pricked my interest.There are several films out there that deal with the subject of schizophrenia,With A beautiful mind ,The fisher king and Donnie darko probably being the most noted. I was captivated by Patrick from the start ,a very human character trying to deal with his illness the best he could , having been dumped in a care home by his overbearing mother. The fact that Patrick suffers from schizophrenia is never over played .The film is difficult to watch in parts mostly due to the abuse dished out by the orderly which made me cringe and the emotional abuse handed out by Patrick's mother, who has clearly convinced herself that everything she does is in Patrick's best interests.So when Patrick falls in love with a suicidal woman ,his mother sets out to turn the fact that Patrick is schizophrenic to her advantage she decides that because of his illness Patrick is not capable of being in love and convinces him that it was all just a delusion.This immense cruelty really hits home as it shows how people often dehumanize the mentally ill and class them as incapable of ever having a \"normal\" life! Not only is this film in itself educational about schizophrenia it is explained during the chief Gardie joke telling scene .It portrays people with mental illness as just that ...\"people\".",
         "Terry McMahon's highly successful film Patrick's day is an experience and likely an emotional one. If you are looking for a predictable slick block buster with flawless production values that requires one to forage for a plot line then Patricks Day is not for you. If you have an enlightened soul who embraces art and empathises with the vulnerable of our world, then yes, this is the film for you. Sadly all too often todays block busters predictably succumb to Celebrity method acting with weak plot lines that throw money at effects with an emphasis of confining to rigid conforms of a people pleasing genre, in the hope it will fill seats and line pockets. MacMahon, avoids the predictable, like all accomplished artists he breaks new ground. His original directorship is refreshing. Michael Lavelle's cinematography alone is mesmerising and emotive. The performances are from the heart. The flawed characters grate, and at times can be off kilter and even test viability yet they are consistently in keeping with Moe Dunford's character Patrick, the protagonist. Dunford gives a raw outstanding, gut wrenching, convincing performance of a young man with who suffers from schizophrenia. Kerry Fox plays the emotionally fragile mother/carer to Patrick and her entire performance is unstable and uncomfortable, Catherine Walkers character Karen as the sexy, edgy, empathetic, depressed seductress is honest and uneasy. Oddly the off kilter pays off. Patrick's Day examines how we (normal people) with the best of intentions treat people who are mentally challenged. The taboo core story-line questions the right or hope, an extremely sensitive mentally challenged person has of experiencing a sexual relationship, a taste of love, and sadly it reflects the fear and ridiculous lengths society and a well-intentioned mother out of love will go to protect her son to prevent such an explosively terrifying situation. The film gives us a gritty reality of how vulnerable Patrick is in the arms of his seductress, yet it caresses our humanity with an intense intimacy that encourages us to want Patrick to have his day out. Patricks Day has won awards for best film, best screen play, best performances across the globe, because it's universal in its subject matter, and because over all it offers a solid storyline with a payoff. This Irish gem leaves the audience in an emotional turmoil of wondering who is actually crazy and questions our crazy perception of normality.",
         "I am voting 10 out of 10, for the original power and ground-breaking courage I have felt in this film. It was almost been a big half year, since I have set my feet again in the cinema; which is considered highly infidel to a self-claimed film-lover like moi. I went to cinema often last year, beside occasionally one or two good films or some magical on-screen moments, I found out that most of the time when I walked out of the cinema the thing beating in my head is how snack bags popping around me. I smelled the smell of warm or cold popcorn floating in the cinema air. I unconsciously took snaps and woke up and found out the film was still going on...In other words: There left no trace in my head what and how the film is. I wonder where is the true purpose of cinema now. Films had became consumptions, like popcorn. But this is not what I see in Patrick's Day. I hold doubt in the beginning, but as I saw Patrick pushing that shop trolley, and saw how the cameras and music were used as Karen walks into the picture...Some of the film-lover instinct in my heart reacted and a strong sense of reminiscence flooding up onto me--Then I knew there will be a story to see. Immediately you would realize, that this is something done through true gut feelings and united hard-work. You would sense this desire behind the camera to call for the audience to listen, to feel, to see, and to share. On the other hand all these are done in a sincere and honest way. The way a film belonged to--a telling of a true and delicate story. The leading actor, as well as the director, they are not household famous names yet, but the beauty lies in this. The caterpillar is waking up, now the power begins. The most important feeling for me, is how this film brought up such a nostalgic sensation from within. I stepped back from all those pointless crowdedness in the cinema, and stayed at home with old film DVDs to 'wash' my eyes and saw some true beautiful film arts on my laptop screen. I realized this explained the reminiscence sensation of me while watching Patrick's Day--its shooting and directing style, all remind me of those beautiful old films I savored time and time again. It reminds me some of the old European films as well, in which every inch of the air on screen seems to have impregnated with indescribable desire and feelings. Compare to the director's previous works, this film seemed softer and more romantic. It might be because of the power of female actresses that had brought this film pink breezes. But in the meantime the director did not lost his signature edgy touch. God I hope he never will. Dublin sky in Patrick's eyes is pure,blue,and at times full of hope. There is hope, even at the darkest time, there will be light. And hope comes in the most unprepared shape, and yet you felt that you have known it all along...I still have hope for films, after experienced the days of life, with Patrick. I guess I will never see Dublin the same way again.",
         "Terry McMahon's PATRICK'S DAY is a profoundly moving masterpiece, and a wake up call to Irish filmmakers to quit with the self-mocking crime caper film which never takes itself seriously and to make meaningful films that stick in our heads long after the credits roll. It takes balls to make a bold film like this. It probably wasn't since after Gaspar Noe's 2002 film IRREVERSIBLE that I staggered out into the Dublin daylight, trembling with emotion, numb\u0085my mind racing with possibilities in the car on the drive home, trying to recollect the immensity of what I had just witnessed. All of the craft elements coalesce perfectly – photography, editing, music, direction, script, performance, everything else – and a piece of true cinema magic is born. The film is a sledgehammer to the jaw – a raw and honest film from a writer/director who is the real deal, and who is going to play a huge role in shaping Irish cinema moving forward. It's one of the most powerful films I've ever seen -- I was moved to tears many times. I would personally rank this with the best of Irish cinema, up there with greats such as IN THE NAME OF THE FATHER. A modern classic. A must see. Go out and buy it and support hardworking Irish filmmakers who need our support.",
         "its refreshing to watch a film that doesn't rely on explosions or fancy stunts to keep your attention, in real life you change your opinions of characters you meet , i found my opinion of the characters in this film changed as the story progressed especially patricks mother whos character i disliked as selfish but by the end of the film i realised deep down she was doing what she really believed for her son ,for anybody who has been treated for mental health issues im sure the treatment scenes will be seen as realistic , this film has all the ingrediants - love tragedy comedy and sadness a great film that i thoroughly enjoyed every minute of",
         "Stunning work. The writing, direction, cinematography and acting are all remarkable. David Fincher talks of the difference between movies and films however the best of both blur the lines of each, and Patrick's Day does just that. From the very opening Patrick and his world are seen caged as we view them from the inside a shopping trolley Patrick pulls and pushes. Immediately it is obvious there is more than narrative at work. His world may be behind bars, but so are we. Static locked inside the trolley. We are pushed and pulled by him and his world, by him and his day, and by Terry McMahon's film. And if you have drowned so deep in Patricks Day and the madness of love by the ending that you have forgotten your part in it all...even then you will still find what you need. It's as open as Moe Dunford's performance. Moe who won many accolades for his Patrick is central to the creation of Terry McMahon's hyper-real dream. He is sublime. As a piece of Irish Film, in keeping with the best of Irish Films, it could be set nowhere else and yet it's setting is irrelevant. It is a universal story being told where it needs to be. The passionate commentary and probing of a culture and society makes it immediately universal. There is not a single motif of the worst of Irish movies to be seen or thankfully heard. It stands to all critique, and unusually for a lot of Irish film it warrants and stands to a political, social and film reading. There are no post-modern laughs from a comedic social underclass. There is no easy trite targeting of the 'okayed' cultural targets. It's original. It's fresh. The writing and narrative are so strong that the 'movie' happens while the 'film' happens...seamlessly as one. Is it masterpiece? No. Because after watching Terry McMahon's debut, zero-budget, punk, polemic, political critique 'Charlie Cassanova', and now watching this stunningly accessible yet multi-layered love story, which he created for next to nothing...you can only be excited by how good he could be with time and money. Perhaps this would be a masterpiece for some...but I hope the McMahon masterpiece is yet to come and I get to see it. But if all you ever did as a film maker was half of what these two films do...that'd be a victory. Love is madness. Dive in.",
         "Patrick's Day is a tribute to the much misunderstood and beautifully brilliant world of mental illness. Those affected, are disabled by society and not by their condition. The film will open the door to much needed change in social attitudes. It is too real and raw to even begin to describe the flawless acting, let alone the magnificent script writing and I was not surprised to learn of its worldwide success. From the opening scene of this film I was entranced. The camera work from beginning to end, is superb; but especially the initial tracking shot which creates intimacy with Patrick from the first second. The film, like its predecessor Charlie Casanova, took me straight out of my comfort zone; this may be disconcerting for some, but we need this perspective and true insight. Patrick's Day is a love story in its most raw form. The film is a must see for anyone struggling to understand the dynamics of love and vital importance of intimacy. When the two lovers meet, they each need, trust and almost demand that intimacy. This is how it could always be, if people weren't caught up in social 'norms' and expectations. It is obvious that Patrick's innocence, beautiful mind and body are the perfect sanctuary for a very obviously traumatised Karen. It all makes magnificent sense. For intimacy we need trust, and in trust we need truth. So frightening, rare and beautiful, that truth is often found in those we choose to call 'disturbed', or 'mentally ill'. Karen and Patrick find solace in each other. It is their unique bond that holds the story together, while every other character seems to fall apart. The film masterfully contrasts the simplicity of a loving connection with a complex dysfunctional environment. It brings the viewer feelings of unsure empathy for the abusers. This is rare and true art. No one should watch this film needing to understand it, or over-analyse it; far better to just feel every second of it and allow it to resonate. We are all oppressed in one way or another, sadly tending to accept the unacceptable. This film, in a myriad of ways shows how fundamentally wrong that acceptance is. To coin an apt phrase, in so many senses, 'the lunatics are running the asylum'... A truly beautiful film.",
         "Patricks Day is a powerfully transformative film that I have no doubt will stay with me for a lifetime. Turning the phrase 'mental health' on its head this film bravely explores depths of conscious to an extent that is rarely seen. Moe Dunford delivers an earth shattering performance as Patrick and Kerry Fox left me contemptuous with her awe inspiring performance as his over bearing mother. Having the courage to make a film that explores topics such as schizophrenia, mis-diagnosis, the right to intimacy and the damaging effects of the abuse of power must be commended and this film, it's maker Terry McMahon and all involved in it deserve every award that they win and more! I can only hope that we will be seeing more of this type of Irish film that gives a voice to those who are subjected to many societal misconceptions. Go Patrick and go Terry!!! You've got so many openly taking about a huge issue in Ireland that must be addressed. Wonderful and inspired work with outstanding cinematography! Ill be buying a copy for everyone I know this Christmas."
      ],
      "genres": [
         "Drama",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Ignition Film Productions",
         "Underground Films",
         "Irish Film Board"
      ],
      "summaries": [
         "Patrick is a warm, open, twenty-six year old virgin schizophrenic. Pills and his mother's protection means Patrick is no threat to himself or others. Until he falls in love. Maura is Patrick's obsessive mother and her need to control her son blinds her to the reality that sometimes the only thing more damaging than hate is misguided love. Soon to be redundant, alcoholic air-hostess, Karen, books into an hotel to end her life unaware that the intimacy she shares with Patrick will reintroduce her to living. Dysfunctional loner cop, Freeman, wants to be a stand-up comic, but, when Maura loses her son, Freeman will use his position to help her find him, for a price. A provocative love story about the right to intimacy for everyone Patrick's Day suggests, when it comes to love, we're all a little crazy.",
         "When a young man with mental health issues becomes intimate with a suicidal flight attendant, his obsessive mother enlists a dysfunctional cop to separate them."
      ],
      "budget": 0
   },
   "movielensId": 145036,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-03-08",
      "dvdReleaseDate": null,
      "directors": ["Terry McMahon"],
      "runtime": 102,
      "movieId": 145036,
      "title": "Patrick's Day",
      "mpaa": "",
      "actors": [
         "Kerry Fox",
         "Moe Dunford",
         "Catherine Walker",
         "Philip Jackson"
      ],
      "imdbMovieId": "2889112",
      "originalTitle": "Patrick's Day",
      "genres": [""],
      "youtubeTrailerIds": ["Odxus8Pi3pw"],
      "plotSummary": "A young man with mental health issues becomes intimate with a suicidal air hostess but his obsessive mother enlists a dysfunctional cop to separate them.",
      "tmdbMovieId": 253273,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": "/3KE1h25ZqCbQxryNPrErPhmdROt.jpg"
   }
}