{
   "imdb": {
      "country": "Thailand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chayanop Boonprakob"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Chayanop Boonprakob",
         "Thodsapon Thiptinnakorn"
      ],
      "originalLanguage": "Thai",
      "imdbLink": "http://www.imdb.com/title/tt1869682/",
      "coverLink": null,
      "actors": [
         "Jirayu La-ongmanee",
         "Pachara Chirathivat",
         "Nattasha Nauljam"
      ],
      "reviews": [
         "If you're wondering about the title of the movie, that's the name three high-school kids give to their band, in tacit acknowledgement of their actual musical abilities vis-à-vis their peers. But while their band may, for the lack of a better word, suck, rest assured that this high- school musical drama doesn't- in fact, it has plenty of spunk, loads of verve and infectious spirit to make it one of most original and lively Thai films we have ever seen. First-time feature film director Chayanop Boonprakob is also the co- writer of the film, and he brings 'oomph' to what could otherwise have been a standard teenage drama about friendship, falling in love and getting the girl. Koong (Patchara Jirathiwat) and Ped (Jirayu La- ongmanee) are the two protagonists- the former confident and ostentatious, and the latter shy and reserved. But despite the differences in personality, Koong and Ped have been childhood friends and it is Ped whom Koong turns to one day to start a rock band and compete in the Hotwave Music Awards for high-school bands across the country. His motivation is less than noble- Koong's twin-brother Kay is a talented guitarist in a rock band called The Arena and the object of affection of many high-school girls, so Koong decides to follow in Kay's footsteps partly to upstage him and partly to attract girls. The one they attract is their primary-school classmate- a sweet, charming girl called Earn (Natcha Nualjam)- whom Ped has had a crush on since they were young. In fact, Boonprakob begins the film from their early childhood years when Earn lends the musically clueless Ped a cassette tape after their music class- a Loso song if you must know- that marks the start of Ped's feelings for Earn. Nonetheless, the older Ped is equally timid to admit his feelings to either Koong or Earn, and even more so when Koong declares that he likes Earn. And like any such teenage rom-coms, you can probably guess that Ped and Koong's affections for the same girl will turn their bond of friendship sour. Still, Boonprakob and his four other writers boldly take liberties with formula by getting Koong to pluck up his courage to tell Earn his feelings halfway through the movie, such that Earn will leave their band even before they start competing to join The Arena. Just as well, Boonprakob doesn't miraculously turn Ped, Koong and their drummer Ex (Thawat Pornrattanaprasert)'s band into some kick-ass team by the end of the movie- rather, the trio pretty much remain true to the name of their band, which is coincidentally the title of their self-composed song too. Sure the movie celebrates the underdog spirit, but kudos to the scriptwriters for keeping their film real and not resorting to a happily-ever-after ending in order for the band to go from zero to hero. Rather, the make-believe embellishments come in the form of music-video interludes featuring popular Thai rockstars- Pu Blackhead, Big Ass, Paradox, So Cool and Bodyslam. Some of these references will likely be lost on a non-local audience, but these vignettes are nonetheless colourful and entertaining. A lot of the movie's raw charm also rests on the chemistry of the young cast. Jirathiwat does go over-the-top quite often, but he nails most of the funny lines and the setups well. La-ongmanee gives a pleasantly sensitive performance as Ped, especially in portraying his character's suppressed affections for Earn. But the scene-stealer here is newcomer Nualjam- the daughter of veteran Thai blues axeman Laem Morrison has a natural unaffected charm and awesome musical talent on the guitar. Contrary to what its premise may suggest, this is more than just a teenage drama for the high-school crowd. Indeed, it celebrates the best and the worst of adolescent years- standing out, fitting in, falling in love, and most of all, holding on to our dearest friendships- with such exuberance and empathy that you can't quite help but be moved and stirred by it. Add to that some infectious rock tunes, and this is one high-spirited celebration of being the best you can be- even if you may suck! www.moviexclusive.com",
         "This movie was simply A-Mazing. I'm usually not the kind of guy to watch teen comedies or that such, but this movie was so good, I had to write my first review for this film. What can I say, everything about it is great. This film really made me laugh out loud literally nearly every five minutes and the rest of the time, with a broad smile. Not only is it funny, but the story and acting are also executed perfectly. As the story gets more emotional near the end, it really shows us another side of the movie that really makes it great: the value true friendship and love. It may sound like a really corny film for a macho guy to watch but I guarantee you that you'll enjoy it if you're under 30. I think this film should receive more attention because nearly everyone thinks thai film makers only make horror and tony jaa films. No one would really expect such a movie coming from the same famous film production company that made those good horror movies.",
         "The other reviews do a good job telling you the plot. I had seen the soundtrack for this film several times in the Thai record stores and was intrigued by the track list and artists who were involved. Otherwise I didn't know anything at all about the film. The album cover made me suspect it was a dumb teen comedy. But when I saw it listed in Thai Airways' AVOD system on a recent flight I decided to check it out. And I was very pleasantly surprised. Far from being a dumb comedy (although there are plenty of funny moments) it's really one of those unrequited love triangles. And I love those kinds of films. I'm not ashamed to admit I shed more than a few tears. The acting is excellent, especially Ped. I imagine that for an actor playing that type of withdrawn, shy character must be a real challenge. And while the relationship between Ped and Ern seems to be the center, it's really the relationship between the boys, Ped and Koong that is what holds the film together. Their break up and reunion had a palpable realness to it that really hit me. Poor Ped just can't figure out how to ask for what he wants or needs from anyone. So he is a bit isolated. You feel really sad for him when he loses the girl and the boy. The music is great. And I also enjoyed the cameos from the music stars. Definitely worth checking out!",
         "Its been quite sometime since I last saw Thai movie cause more than half the time it end up very much disappointing. The good thing was not this time, this time I felt great. The movie left me with this really good heartwarming friendship bonding kind of feeling and by the end the movie it managed to make me laugh, weep, and enjoying myself through and through. Synopsis: Like most teenage boys Ped and Koong, the two best friends decide to form a band. The problem was they suck. So they decide to recruit Ex - a drummer and Earn a guitarist. Things when haywire when Koong started to fell for Earn who was Ped secret childhood crush. I must say there is nothing new in this movie. It is the story that has been told like a thousand times but something was different this time. There is a good balance in the substance and it has been executed pretty good. The story might be a little childish when compare to Western culture but it is more or less accurate to the Asian culture. I love the fact that they managed to entertain me for over two hours without forcing sex into the movie like most teen movie do. This one is about friendship. I love the casting, it is one of the best thing that GTH production can do and most of the time they always able to nail in this department. All the four characters are likable; the best part was they all have enough screen time for us to feel for them. I must say the group work out a whole lot better than I expected. Plus Earn is so freaking cute. Their acting might be dub as unacceptable if compare to Hollywood but I somehow don't really get distracted by it. I even love some of the expression and some of the scene they acted even it seem by force. When it comes to the technical stuff, Thai movie is nothing to really speak of – it is very ordinary. But since it is Chayanop first feature films I say do is doing just fine. Another thing that can't be left out is the music accompanying this movie. It is a great combination of Thai rock music. Each song define how each characters feeling which sadly for those who doesn't understand Thai might not enjoy it as much as one should be. Overall I love this movie and will definitely be adding this to my DVD collection. Recommendation: I highly recommend this movie to anyone that below 35. You will love it if you're a teenager. Rating: 7.5/10 (Grade: B)",
         "The Thai production house GTH was probably synonymous with the horror genre, until last year's romantic drama and surprise hit Hello Stranger made one sit up and take notice that they too are capable of churning out hits outside of their established genre. SuckSeed just proved once again that they are as comfortable as the Japanese in taking the zero to hero formula and coming up with an awesome coming of age tale of a group of students trying to make it to the finals of their high school rock band contest, and comes complete with the requisite love story, comedic antics and plenty of rock music to make up the soundtrack. Directed by first time helmer Chayanop Boonprakob, SuckSeed tells the story of good friends Ped (Jirayu Laongmanee) and Koong (Pachara Chirathivat), opposites in character with the former being the shy boy nursing an infatuation toward fellow classmate Ern (Nattasha Nauljam), and the latter being the daring buddy with the slightest of attention spans, having to dabble in plenty of hobbies but never settling for any, until his envy of his twin brother Kay's success with his band Arena made him want to start his own, besides the notion of assuming that being in a band will mean being an automatic chick magnet. Roping in basketballer turned drummer Ex (Thawat Pornrattanaprasert), the trio obviously don't have the talent necessary to entertain nor perform, but that doesn't mean that they're giving up in true blue zero to eventual hero formula, willing to even parody themselves by calling their band SuckSeed, where first you have to suck, before success will come. After all, once you hit rock bottom, the only way is up, no? And this is the surprise package that delivered where it mattered, be it the musical numbers, thanks to real life Thai bands and/or their frontman making cameo appearances (one of my favourite Thai songs came on as the first, how cool is that?), the more dramatic moments or the comedy where the actors, mostly first timers as well, will put some veterans to shame with their exuberance. While the story was written by a host of writers, it didn't fall prey to the too many cooks spoiling the broth syndrome, where the end product would turn out to be rather scattered and piece meal. Rather, SuckSeed proved to the contrary, with the ensemble cast playing (pardon the pun) their hearts out in their roles. One may think of it as being quite generic at times, with subplots like unrequited love, teenage romance, sibling rivalry and the likes that pepper movies featuring teenage characters, but the delivery of its charismatic leads here more than make up for it, especially between Jirayu Laongmanee and Pachara Chirathivat as best buddies, and that between the former and Nattasha Nauljam in their romantic angle. Chayanop Boonprakob also utilizes different techniques to keep things varied and interesting, where animation also came into play more than once to spice things up in style especially in its manga inspired moments when dealing with introducing of band members, or even the rebirth of SuckSeed in phoenix style where it rose out of its ashes after two members got burnt by their failure to snag the girls they fancy, and decide to pour their energies into making their band a success. Or not. Like Japan's Beck this year which also had the formation of a band as its premise and the focus on the relationships between band members, SuckSeed is the Thai equivalent, and powers its way into one of my favourites this year. It's a complete film as much as emotions go in its roller coaster ride, where friendship, romance, comedy and rock all fuse together in synergy to bring forth a crowd pleaser. Highly recommended and an inspiration to those who suck - I Need You! Want You! Love You!",
         "This movie made me laugh so hard I had stomach cramps after. Suckseed is a Thai Romantic Comedy film centered on friendship. It's a story of three high school boys who wants to make it big as a rock band even though they obviously don't have talent in music. This is the second Thai movie I watched and I love the simple yet endearing stories of their films. I have mix opinions with this film. I liked it but it isn't enough for me to love it. The story is okay and the funny scenes are remarkable. I only have problems with the characters. I'm not really a fan of selfish, self-centered, bashy people. Okay pessimism aside, there are still things I liked with this film. First is the soundtrack. I love the songs! Music is the strength of this movie. I also loved the way they incorporated the original artists who sang the soundtracks in the film. It's as if you're just watching a music video. The songs reminded me of our local rock bands. It's a bit the same and I'll never get tired of listening to them. Second is the setting. Their school reminded me of my high school Alma matter. Almost similar without the shorts for boys (I mean they wear pants). I went to a public high school in Pangasinan and the time I spent there was the craziest and most memorable years I had. Third is Ex—the drummer. I don't like him because he's cute or anything. I like him because he squeals like a girl! Hahaha. He has a very manly introduction in the movie—then boom! He screamed! That was amusing. I recommend this movie to all rock music fans out there. If you're looking for a good laugh, I guarantee SuckSeed is a good choice."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Jorkwang Films Co."],
      "summaries": ["Ped (Jirayu La-ongmanee) was a shy boy who had never listened to music until introduced to the world of Pop and Rock by would-be childhood crush Ern (Nattasha Nualjam). Ern soon left for Bangkok, however, and it is six years later in their final school year when she is re-introduced to Ped and his brash best friend Koong (Pachara Chirathivat). Koong convinces Ped, along with schoolmate Ex (Thawat Pornrattanaprasert), to form a band, partly to be cool and attract girls, partly as an attempt by Koong to try and one-up his popular twin brother Kay. Their musical talents aren't great, but that doesn't stop them from trying. However, when Ern decides to lend them her outstanding guitar skills, Ped and Koong's shared attraction to her puts a strain on the band's survival, as well as their friendship."],
      "budget": 0
   },
   "movielensId": 145050,
   "movielens": {
      "languages": ["ภาษาไทย"],
      "releaseDate": "2011-03-17",
      "dvdReleaseDate": null,
      "directors": ["Chayanop Bunprakop"],
      "runtime": 130,
      "movieId": 145050,
      "title": "Suck Seed",
      "mpaa": "PG-13",
      "actors": [
         "Chirayu La-ongmani",
         "Natthacha Nuanchaem",
         "Pachara Chirathivat",
         "Thawat Phonrattana Pprasoet",
         "Nattasha Nauljam",
         "Napat Chokejindachai",
         "Gunn Junhavat",
         "Touchchavit Kunkrachang",
         "Tossaporn Chertkeitkong",
         "Aungwara Mongkhonsamai",
         "Tonhon Tantivejakul",
         "Tanat Palakul",
         "Warinthorn Makhornsirisri",
         "Parnphirat Phadungcharoen"
      ],
      "imdbMovieId": "1869682",
      "originalTitle": "SuckSeed ห่วยขั้นเทพ",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of high-school students forms a band even though they’re not remotely gifted with music. Their intention is to be cool and attract girls. But when a pretty young student turns up and wants to join the band as a guitarist, things start to get interesting.",
      "tmdbMovieId": 72792,
      "avgRating": 4,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/fUTUXmNohcXtdGT4GRNs5b2JcR0.jpg"
   }
}