{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bricklayer",
            "id": 156084
         },
         {
            "name": "little italy",
            "id": 156085
         }
      ],
      "imdb_id": "tt0041416",
      "video": false,
      "title": "Give Us This Day",
      "recommendations": [
         40793,
         46042,
         65637,
         44931,
         45740,
         25550,
         151545,
         62098,
         60743,
         59895,
         156316,
         41173,
         106630,
         121455,
         124485,
         42481,
         33025,
         101929,
         80739,
         93520
      ],
      "backdrop_path": "/4KxssQLUcg8wWMnLc2B3q3h4OPF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Geremio",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc635",
               "name": "Sam Wanamaker",
               "profile_path": "/aE8H0qNiON4ZN1r7KDBgPuDSA73.jpg",
               "id": 21520,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Annuziata",
               "gender": 1,
               "credit_id": "52fe49109251416c750bc639",
               "name": "Lea Padovani",
               "profile_path": "/1aqgSLCdXZDdahmVR3nz7kT2eVM.jpg",
               "id": 132785,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kathleen",
               "gender": 1,
               "credit_id": "52fe49109251416c750bc63d",
               "name": "Kathleen Ryan",
               "profile_path": "/9bc4iRo1mM6eMPbNTqXmkftqZNb.jpg",
               "id": 98152,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Luigi",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc641",
               "name": "Charles Goldner",
               "profile_path": null,
               "id": 115062,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Julio",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc645",
               "name": "Bonar Colleano",
               "profile_path": "/d9GgImcumA0hMq9yHQ9EjATcHQr.jpg",
               "id": 132598,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Giovanni",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc649",
               "name": "William Sylvester",
               "profile_path": "/iz3JAVIColzTaQ3PFvxdlFaCzfW.jpg",
               "id": 247,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The lucy",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc64d",
               "name": "George Pastell",
               "profile_path": "/q72ZOJdHT9305Dn99AoOOIwwDlq.jpg",
               "id": 9900,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Head of Pig",
               "gender": 0,
               "credit_id": "52fe49109251416c750bc651",
               "name": "Philo Hauser",
               "profile_path": null,
               "id": 998539,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Murdin",
               "gender": 2,
               "credit_id": "52fe49109251416c750bc655",
               "name": "Sid James",
               "profile_path": "/9dMtCoy4lvc7blUersBo4ypao1M.jpg",
               "id": 40952,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49109251416c750bc631",
               "name": "Edward Dmytryk",
               "profile_path": "/s7E1zzpOeg7VBmLjA9MBgl2jizD.jpg",
               "id": 64114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49109251416c750bc661",
               "name": "Guy Roe",
               "profile_path": null,
               "id": 98151,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe49109251416c750bc667",
               "name": "Fred Maguire",
               "profile_path": null,
               "id": 140073,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe49109251416c750bc66d",
               "name": "Roland D. Reed",
               "profile_path": null,
               "id": 1057407,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5554e010c3a3687779000099",
               "name": "Ben Barzman",
               "profile_path": null,
               "id": 92720,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5554e0159251411e4d0000cd",
               "name": "Ben Barzman",
               "profile_path": null,
               "id": 92720,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573919c3c3a3686e21000b7e",
               "name": "Herbert Smith",
               "profile_path": "/RzwYmeyvBcgXKXq4PX6jobuImg.jpg",
               "id": 41400,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.615111,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 92819,
      "vote_count": 7,
      "budget": 0,
      "overview": "On the outs in Hollywood due to the blacklist, director Edward Dmytryk briefly operated in England in the late 1940s. Though filmed in its entirety in London, Dmytryk's Give Us This Day is set in New York during the depression. Fellow blacklistee Sam Wanamaker is starred as the head of an Italian immigrant family struggling to survive the economic crisis.",
      "similar": [
         224,
         263815,
         53429
      ],
      "original_title": "Give Us This Day",
      "runtime": 120,
      "poster_path": "/xuziC3ymXKEfoctXhuTqcpCerEo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Plantagenet",
         "id": 19741,
         "origin_country": ""
      }],
      "release_date": "1949-10-14",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward Dmytryk"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Pietro Di Donato",
         "Ben Barzman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041416/",
      "coverLink": null,
      "actors": [
         "Sam Wanamaker",
         "Lea Padovani",
         "Kathleen Ryan"
      ],
      "reviews": [
         "After many years in political purgatory, the film version of Pietro Di Donato's masterpiece CHRIST IN CONCRETE comes to beautifully restored DVD. The story of a humble bricklayer (Sam Wanamaker) who wants only the best for his family, and is briefly seduced by becoming \"managment\" holds up beautifully. Wanmaker is a wonderful, natural actor (I kept thing Actor's Studio before there was such a thing!) and though I had known him in later years, I never realized how dynamic he was as a leading man. (No surprise then that his daughter Zoe is one our finest actors.) Lea Padovani is magnificent, and the rest of the cast give superb performances as well. (What a kick it is to see William Sylvester, Dr. Heywood Floyd of 2001: A SPACE ODYSSEY as a young man in his first film!) The director, Edward Dmytryk, clearly influenced by Greg Toland as well as the neo-realismo films of the time, uses fascinating camera angles, moody lighting and a steady pacing that makes the nearly two hour running time seem half that time. I had loved the novel and had always wanted to see the film. What a joy it is to finally see it in near pristine condition. Thank you ALLDAY films for finding and restoring this masterpiece. HIGHLY RECOMMENDED................",
         "Have I seen this film?! Only every time I teach an urban sociology class, when I show it to my students! I can only echo the previous commentator--what a great film! The best scene--and there are many--is during the Great Depression, when the five bricklayers decides that it is Julio, who starving mouths to feed, should get half a day's work. Then, through a store window, Geremio catches one of the other bricklayers panhandling. \"Heaven has forgotten us!\" his workfellow says. This film, whose story was written by an Italian socialist (DiDonato) and made by socialists in London (couldn't make it in New York--it was the McCarthy period, may he rest in pieces!) is, besides being dramatically and emotionally rich, is sociologically rich. It's a brilliant portrayal of the conflict between the individualist version of the American Dream among immigrants--and the sordid reality they face. When they face it collectively, they are great men and women, in all their splendor. When they face it individually, they become alienated from themselves and each other. Though the DVD is entitled CHRIST IN CONCRETE, it is actually the prequel to the story in the novel. The last horrific scene is the first chapter of the novel, which detail's the life of Geremio's widow, Annunziata, and their son Paul, after Geremio dies. All the actors are great--but I especially like Lea Padavini--who had to learn the part phonetically, because when they hired her, she didn't speak a word of English! I also highly recommend this film",
         "I saw this film many years ago on television and was quite stunned by it. This very simple drama of the life of an ordinary working man is turned into high tragedy through the wonderful talents of the filmmaker. The film is all the more impressive when one considers that it was made on the cheap in London, though set in New York. The low budget gives rise to one or two false notes, but the story is so well told that you easily forget about those. Perhaps the lack of budget was a blessing, in that it allowed the actors and director to concentrate on the more ineffable qualities of story-telling. I would love to see this film again. It should be revived so that many more people can appreciate the great talent of Edward Dmytrk and the social-realist style, of which it is a wonderful example.",
         "It took me a long while to purchase this one (by which time, most of the output by DVD-producing company All Day Entertainment – with whose president, film historian David Kalat, I had the pleasure of corresponding on a number of occasions – had gone out-of-print) and some more before I actually sat down to check it out. Having finally watched this, I must say that the mainly gushing reviews which I had read on the Internet upon the DVD's first appearance – citing the film as a neglected masterwork (though not quite director Dmytryk's best, in my opinion) were very much accurate; incidentally, the main feature bears the official title given above rather than that attached to the DVD i.e. Christ IN CONCRETE, actually the name of Pietro Di Donato's original source novel. Knowing of its pedigree – Dmytryk having famously been one of The Hollywood Ten, jailed for refusing to appear before HUAC (the House Un-American Activities Committee) in view of his alleged past Communist leanings – and its theme – the domestic and professional troubles of struggling Italian immigrants in the construction business with a 1920s New York setting – I had expected to be somewhat unenthused by it, but the reverse proved to be the case, thanks largely to Dmytryk's unerring eye for detail and a handful of naturalistic performances (an achievement which seems all the more remarkable when considering that it was entirely filmed in England with a mostly British cast!). That said, one of the two leads was a genuine Italian – Lea Padovani – and the other an American, fellow victim of the blacklist Sam Wanamaker: both of them are terrific playing husband and wife, though he remains attached to friendly Kathleen Ryan, and their consistently precarious economic situation (exacerbated by the Wall Street crash of 1929) shatters the wife's dream of owning her own home. Also appearing in the film are Charles Goldner (the old man who actually got the couple together), Bonar Colleano, William Sylvester and George Pastell as Wanamaker's team-mates at work, Sidney James(!) as another construction operative who harbors ambitions to start his own company and wants the hero to get in on the business with him, and Karel Stepanek as the elderly landlord of the protagonists' house. In view of its inherent grittiness, unusual compositions (employed during melodramatic passages) and doomed hero, the film has been rightfully likened to the then-prevalent noir style – in which, as it happens, Dmytryk had already proved himself several times while still employable on his home turf. Despite its generous length (115 minutes) and the occasional Marxist viewpoint (it is clearly stressed that Wanamaker's downfall transpires because he dared to stand out from the crowd, even if all he wanted was to improve his family's conditions), the proceedings compel attention all the way through – culminating in the unforgettably harrowing sequence of the hero's death, engulfed in cement after the weak structure he had been supervising gives out. Regrettably, I did not have time to look into the numerous extras featured on the double-sided \"Special Edition\" DVD – I had actually made a resolution in this regard at the beginning of the year, but which I am now finding myself increasingly unable to accommodate! In closing, I cannot fail to mention Benjamin Frankel's superb music score – no wonder that one is even given the option to listen to it in isolation on the All Day disc.",
         "I read the book about 2 years ago. It's a beautifully written and well told story of a son's love and devotion towards working, supporting his mother, upholding his deceased father's dignity, and surviving through the toughest of times, the great Depression. The book version told a story that I thought was easily adaptable to film, and when I saw that the movie version had been released as a DVD, I ran out and bought a TV, a DVD player and rented the film. Now what astounds me is that, considering the great impact of the original story, and how easy as I say it would have been to simply tell it on the big screen, why did the filmmakers toss the whole thing out and produce a most conventional and predictable typical film of that era? This movie should really not be associated with the original novel- there's really very little comparison. As an original story, average- 5/10. As an adaptation, poor- 2/10.",
         "This rarely seen, hard-hitting film combines Depression-era melodrama with noir and social realist sensibilities. A Brooklyn bricklayer struggles to fulfill the American Dream, but his efforts seem increasingly futile in the face of modern capitalism's socioeconomic indifference. Features impressive acting, cinematography, and writing; unforgettable opening and closing sequences. Christ in Concrete was made in England by the exiled director Edward Dmytryk, one of the blacklisted Hollywood 10.",
         "This film has an interesting pedigree. It was made in England--even though it's a story set in New York's 'Little Italy' (it's next to Chinatown in the southern portion of Manhattan). The reason for filming in the UK was that the director, Edward Dmytryk, was one of the famed Hollywood Ten who refused to testify before Congress and were imprisoned and blacklisted. And I am sure this had a lot to do with the film subsequently being pulled from circulation shortly after it's US release. The film begins with a bit of domestic violence. What led up to this is uncertain, as so the film now goes back a decade to show, very slowly, the events leading up to this. Geremio (Sam Wanamaker) is a bricklayer. He works hard and has friends, but his life is tough--and money is far from abundant. However, he decides one day that he should be married and asks a neighbor (Kathleen Ryan)--and she refuses him. Then, a friend helps him obtain a wife from 'the old country' (Italy) and he marries a woman he's never even met (Lea Padovani). The problem, however, is that he'd written her about his life--and lied about having a little house. Instead, he only had a crummy apartment. But, to hide his lie, he rents a house for their honeymoon--and she only learns at the end that it's NOT her new house. Despite this HUGE surprise, the marriage somehow stays strong and through the next decade they have four kids and life, though tough, is good. However, when the Depression arrives, Geremio is disheartened and during the course of this part of the film, his soul seems crushed and the need to feed his family becomes his all-consuming goal. As a result, he's willing to become foreman on a dangerous and substandard job--one that is just a huge disaster waiting to happen. What happens next, I'll let you find out for yourself---but it's pretty shocking as Geremio vacillates between allowing his soul to fester or overcome this dark period. I guarantee that you WON'T be able to guess what will happen next. There is a lot to admire about this film. Wanamaker, while not exactly a household name and easily recognizable face, was great in this film. And the director did a great job setting the mood. I really must admire this film. However, I also need to point out that it's not exactly a pleasant film. At times, it's rather depressing, in fact. And, it does NOT have a happy Hollywood-style ending. But, I admire how the film was willing not to be clichéd and happy. Well worth seeing, but certainly not a film for everyone.",
         "This film is extremely difficult to find anywhere, and still it's a major milestone in the history of film noir. Both Edward Dmytryk and Sam Wanamaker fled America for the McCarthy persecutions and made this unique film in London about Little Italy in New York. It's brutally expressionistic and realistic about the conditions of Italian building workers in New York and was forbidden in America - today you wonder why. Sam Wanamaker remained in Britain, made many films, was in 'Holocaust' and initiated the process of rebuilding the Globe theatre in London. Another of his major performances was in \"The Voyage of the Damned\" 1976, another great film of documentary character and a true story; but \"Give Us This Day\", also known as \"Christ in Concrete\" is his quest for immortality as a very ordinary Italian worker in Brooklyn with great foibles and weaknesses, and he is well supported by Kathleen Ryan (expert at such roles, like also in \"Odd Man Out\") and Lea Padovani as the sorely tried but heart-renderingly faithful wife. Perhaps the greatest credit of all in this film is due to the music of Benjamin Frankel, booming with beauty sand pathos all the way, while above all the story is without comparison in its very human and overwhelmingly true account of the conditions of Italian house-building workers in Brooklyn around the Great Depression. This film makes an unforgettable impression the first time, and you will always recall it with tears and return to it - a film indeed worth owning.",
         "Both titles (\"give us this day\" ,\"Christ in concrete\" ) refer to religion ,but religion does not really play a prominent part in \"give us this day\" which is close to Italian neo-realism .All the movie revolves around the \"a bricklayer deserves his house for his work is hard and he dirties his hand every day\"subject.One of the rare movies of the era which deals with working-class people ,it ran into problems with MacCartyism .It was the first time that the recurrent feature of the injured arm had appeared in a Dmytryk movie (see also \"the sniper\" \" the Caine mutiny\" and \"the juggler\").As Dmytryk had not yet betrayed,it would tend to destroy the \"Dmytryk feels guilty \" theory. \" Give us this day\" actually reminds one of the movies-before the-code ,the great works of Wellmann(\"Heroes for sale\" \"Wild boys of the road\" ) as well as the precise depictions of Rossellini and De Sica in Italy.",
         "This movie does have some great noirish/neorealist visuals, and it tells a story that is refreshingly free of Hollywood's sugar-coating, which was only possible because it was essentially an independent foreign film. But some of the scenes go on for much too long (the wedding, especially), and I found the exaggerated acting and unrealistic dialog to be more fit for the stage than for the silver screen. The dialog was particularly distracting, and it seemed to get worse as the movie went on. Most of the characters were either Italian-Americans or Italian immigrants living in New York in the twenties and thirties, but their dialog sounded like they were practicing lines for a Shakespeare play while they mixed cement and laid bricks. Toward the end I was laughing, and not because the filmmakers wanted me to. I guess the stilted poetry could be defended by saying that the characters would have been speaking Italian, and the dialog is a literal translation of how they would really talk. But it absolutely did not work for me. Another line of dialog made me laugh for a different reason: the main character's son, born and raised in New York in the 1920's, suddenly picks up a lovely lilting British accent. I'm only guessing this had something to do with the fact that the movie was made in England. I give this movie an 'A' for effort and intention, but a considerably lower grade for execution.",
         "Hounded out of the States as a Commie (fellow DGA member Sam Wood outed him), Edward Dmytryk actually made (in the U.K.) that left-leaning agit-prop proletariat 'noir' HUAC vainly searched Hollywood for. The film never got a proper American release, Dmytryk returned, 'named names,' served time, & found himself upgraded to 'A' projects which never lived up to his promising early 'B' stuff. Pietro Di Donato's once influential novel tells a fatalistic story of an Italian/American brick layer, always on the verge of better times, who loses his soul when he rises to foreman during tough depression times. Dmytryk does some impressive work within the restrictions of an indie U.K. production, but he's ultimately defeated by a twice too earnest script and a lackluster cast that has to work overtime to fake that Brooklyn flavor. Five years on, another HUAC alumni, Elia Kazan, would get this sort of thing right in ON THE WATERFRONT, which you may have heard of."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Plantagenet"],
      "summaries": ["One of the few (if any at the time this film was made) films shot in England with New York City's 'Little Italy\" as the locale. This was Edward Dmytryk's first film after he had refused to tell a Congressional Committee whether or not he was, or had ever been, a member of the Communist Party. This is a 'runaway production' shot in England for political reasons and not for the usual USA tax-break reasons. Geremio, a young Italian immigrant to New York City, works as a bricklayer and is courting an Italian girl, Annunziata, by mail. He lies to her that he owns his own home and, after they are married, has to rent one for their three-day honeymoon. The years pass and they are unable to save enough money to get out of their slum tenement, and the 1929 depression brings even harder times to the family that now includes three children. Geremio, in order to make enough money to care for his family, exploits his \"comrades\" in dangerous construction work. This practice leads to the accidental death of his best friend, and, in grief, Geremio also becomes unfaithful to his wife. The messages of the film -- life is aimless and no man can judge the true worth of another man -- are pounded on for most of the two-hour running time."],
      "budget": 500000
   },
   "movielensId": 145264,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-10-14",
      "dvdReleaseDate": null,
      "directors": ["Edward Dmytryk"],
      "runtime": 120,
      "movieId": 145264,
      "title": "Give Us This Day",
      "mpaa": "",
      "actors": [
         "Sam Wanamaker",
         "Lea Padovani",
         "Kathleen Ryan",
         "Charles Goldner",
         "Bonar Colleano",
         "William Sylvester",
         "George Pastell",
         "Philo Hauser",
         "Sid James"
      ],
      "imdbMovieId": "0041416",
      "originalTitle": "Give Us This Day",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "On the outs in Hollywood due to the blacklist, director Edward Dmytryk briefly operated in England in the late 1940s. Though filmed in its entirety in London, Dmytryk's Give Us This Day is set in New York during the depression. Fellow blacklistee Sam Wanamaker is starred as the head of an Italian immigrant family struggling to survive the economic crisis.",
      "tmdbMovieId": 92819,
      "avgRating": 2.5,
      "releaseYear": "1949",
      "numRatings": 1,
      "posterPath": "/xuziC3ymXKEfoctXhuTqcpCerEo.jpg"
   }
}