{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0058349",
      "video": false,
      "title": "Yearning",
      "recommendations": [185366],
      "backdrop_path": "/75UTa5GTUsAuBsejJqt7ZtthOU2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Reiko Morita",
               "gender": 1,
               "credit_id": "52fe4af7c3a36847f81eaead",
               "name": "Hideko Takamine",
               "profile_path": "/gSxgV6J1I61R5hnVybQMTJj3OqG.jpg",
               "id": 213504,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Koji Morita",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaebd",
               "name": "Yûzô Kayama",
               "profile_path": "/oiyhZCBhvkidUNIiuKBmZmUavRt.jpg",
               "id": 33764,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Hisako Morizono",
               "gender": 1,
               "credit_id": "52fe4af7c3a36847f81eaec1",
               "name": "Mitsuko Kusabue",
               "profile_path": "/kqKbwdoIAEsA0cNFyGX0PNdrWQ.jpg",
               "id": 241839,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Takako Morita",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaec5",
               "name": "Yumi Shirakawa",
               "profile_path": "/3PCFDGFlguaMFe1IeOf9y82RWGB.jpg",
               "id": 128665,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Ruriko, Koji's girlfriend",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaec9",
               "name": "Mie Hama",
               "profile_path": "/ihCZ9ls8bsT7HJWwMp5Q3XrTMjM.jpg",
               "id": 10070,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Shizu Morita",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaecd",
               "name": "Aiko Mimasu",
               "profile_path": null,
               "id": 1068832,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Nomizo, employee at rival supermarket of Morita's",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaed1",
               "name": "Yû Fujiki",
               "profile_path": "/am1RppKjEZV8mw216UtAIRblLwe.jpg",
               "id": 144797,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mr. Morizono, Hisako's husband",
               "gender": 2,
               "credit_id": "52fe4af7c3a36847f81eaed5",
               "name": "Kazuo Kitamura",
               "profile_path": null,
               "id": 63707,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Okamoro, drugstore owner",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaed9",
               "name": "Hisao Toake",
               "profile_path": null,
               "id": 134346,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Bar madam at Ginzan hotspring",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaedd",
               "name": "Kumeko Urabe",
               "profile_path": "/ouqaV2IjEgBoBLgz62S47NEezT.jpg",
               "id": 123858,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mr. Kaga, foodstore owner",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaee1",
               "name": "Kan Yanagiya",
               "profile_path": null,
               "id": 1121628,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mr. Murata, kimono store owner",
               "gender": 2,
               "credit_id": "52fe4af7c3a36847f81eaee5",
               "name": "Yutaka Sada",
               "profile_path": null,
               "id": 134320,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaee9",
               "name": "Yutaka Nakayama",
               "profile_path": null,
               "id": 1185642,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Mrs. Kaga",
               "gender": 1,
               "credit_id": "52fe4af7c3a36847f81eaeed",
               "name": "Chieko Nakakita",
               "profile_path": "/AdvI4nAmDPzrwqvjhQpBNl4jaaR.jpg",
               "id": 125723,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaef1",
               "name": "Gen Shimizu",
               "profile_path": null,
               "id": 552187,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaef5",
               "name": "Yasuhiko Saijô",
               "profile_path": "/cvoSGiryPENHTiD5oHqOV7nONJ6.jpg",
               "id": 1200237,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaef9",
               "name": "Yasuzô Ogawa",
               "profile_path": null,
               "id": 1060036,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaea9",
               "name": "Mikio Naruse",
               "profile_path": "/2fePemn6eI8Wfu1p8GbEPjuSuZa.jpg",
               "id": 125690,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaeb9",
               "name": "Mikio Naruse",
               "profile_path": "/2fePemn6eI8Wfu1p8GbEPjuSuZa.jpg",
               "id": 125690,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4af7c3a36847f81eaf0b",
               "name": "Satoru Chûko",
               "profile_path": null,
               "id": 1125521,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "565f96e6c3a36875e9000ac5",
               "name": "Zenzô Matsuyama",
               "profile_path": "/gfVOroFbTRYR9A1eXmpGDrxjTwT.jpg",
               "id": 1530374,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "563446c3c3a3681b4b015416",
               "name": "Tatsuo Kuroda",
               "profile_path": null,
               "id": 1529566,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "563446cd925141284c01698f",
               "name": "Masazumi Kawanishi",
               "profile_path": null,
               "id": 1529567,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "563446d49251414ad80147e0",
               "name": "Masao Fujiyoshi",
               "profile_path": null,
               "id": 1529559,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "563446ddc3a3681b61017279",
               "name": "Hisashi Shimonaga",
               "profile_path": null,
               "id": 1529560,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "563446e5c3a3681b6101727c",
               "name": "Chôshirô Ishii",
               "profile_path": null,
               "id": 1529561,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5717bfd7c3a3687bc7001404",
               "name": "Ichirô Saitô",
               "profile_path": null,
               "id": 125001,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5717bfdec3a3687fd6001359",
               "name": "Jun Yasumoto",
               "profile_path": null,
               "id": 1063916,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.610084,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 111398,
      "vote_count": 9,
      "budget": 0,
      "overview": "After a bombing raid destroys the family store and her husband, Reiko rebuilds and runs the shop out of love stopped short by destruction.",
      "similar": [],
      "original_title": "乱れる",
      "runtime": 98,
      "poster_path": "/pKVlb9NtEFR1oSeTmAd5LiS3Kek.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
         "name": "Toho Company",
         "id": 882,
         "origin_country": "JP"
      }],
      "release_date": "1964-01-15",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mikio Naruse"],
      "runtime": 98,
      "synopsis": "19yo girl loses husband in war. Bombing destroys his family's shop and the widow stays to rebuild it as the rest of the family flee and runs it for 18 years out of love for her dead husband and his mother. The film starts after 18 years when a new supermarket threatens to put them out of business. The sisters conspire to turn the shop into a supermarket and get rid of their brother's widow. Meanwhile, the surviving younger brother loafs around, losing jobs, getting drunk, laid and gambling. In the crisis, he confesses to his shocked sister-in-law, 11 years older, that he has always loved her and can't deal with it. She cars for him, but in a motherly/ big sister way. She rejects him and decides to return home to her family, threatening suicide if he stops her. This suits the sisters, but he follows her onto the long train ride. On the way, she softens and they disembark for a country inn, where they can talk. He resumes his approaches, but at the last minute, she can't face intimacy. He storms out, gets drunk and falls from a cliff. The film ends with him being carried off on a stretcher, injured or dead.",
      "writers": [
         "Zenzô Matsuyama",
         "Mikio Naruse"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0058349/",
      "coverLink": null,
      "actors": [
         "Hideko Takamine",
         "Yûzô Kayama",
         "Mitsuko Kusabue"
      ],
      "reviews": [
         "A woman, whose husband was taken to the war and was killed shortly after their marriage, lives rest of her life as a widow serving her parents-in-law. In Japanese society after the World War II, such women were not few. Takamine Hideko in \"Midareru\" directed by Mr. Naruse Mikio, and Hara Setsuko in \"Tokyo Monogatari\" directed by Ozu Yasujiro act the women in such situation, in quite different way. Reiko (Takamine Hideko) is a widow of a would-be heir of a small beverage shop in a local city. The shop was destroyed by the air-raids during the war, but she was the one who rebuilt the shop after the war and made it even larger than prewar through 18 years of hard work. She is a woman in her late 30's, still beautiful but never thought of having another life time partner. But when her 11 years younger brother-in-law, Koji (Kayama Yuzo), confessed love to her, her firm mind is swung. Eventually she chooses to disappear from Koji. But when she gets on a train she finds Koji is following her. This long train journey is the most impressive scenes in this movie. At first Koji stands in the isle apart from Reiko. As other passengers get off, he gradually moves nearer to Reiko, and eventually they sit in the same box. At the same time, a change comes in Reiko's mind, who has once determined not to accept his affection. Takamine Hideko acts this slight change only by subtle expressions. The Japanese word \"Midareru\" means to be out of order, have one's heart swung, fall into disorder, or be corrupt. Reiko has lived her life sacrificing herself under traditional concept of wife and widow. For her, Koji is the closest man that is single and loving her. But even her sisters-in-law recommend her to marring to someone, partly to avoid issues in succession of property, marring to 11 years younger brother-in-law is a scandal. Reiko is on the verge of scandal, and what is the outcome? Perhaps, Reiko's expression at the shocking last scene is the best acting of Takamine Hideko in her actress life.",
         "I saw YEARNING (MIDARERU, 1964) at a screening at New York's Asia Society on Dec. 3, 2010. It's only the second film by Mikio Naruse that I've seen, but I'm eager to see more. (The first was WHEN A WOMAN ASCENDS THE STAIRS, 1960, seen on Criterion DVD earlier this year.) YEARNING is a quiet but emotionally honest drama about Reiko, a war widow who has given her best years to her late husband's family, managing their grocery shop while Koji, her younger, handsome brother-in-law, gambles, drinks and loafs. The family plots to tear down the shop and build a supermarket in its place, pushing Reiko out of the top position. Koji protests. When he decides to take a stand, on more than one front, it changes his relationship to Reiko and forces her to make a life-changing decision. Naruse shoots in a spare, classical style with sync-sound recording, both on location and in the studio, and gets strong performances out of the entire cast. Yuzo Kayama, whom I know primarily from period movies like SANJURO, CHUSHINGURA and SWORD OF DOOM, plays Koji as a spoiled son and brother who begins to mature before our eyes. Hideko Takamine plays the still-beautiful 30-something widow whose self-effacing front hides her own submerged desires. She never acts on her own behalf, but just dutifully runs the shop and waits for Koji to grow up. No matter what is happening in her heart, she simply won't ask for anything or accept it when it's offered. Even when she makes her big move midway through the film, it's only because she thinks it will help Koji. Reiko resembles an Ozu heroine, while Keiko, the lead character in WHEN A WOMAN, also played by Takamine, was more like a Mizoguchi heroine. The film was shot in widescreen black-and-white and the action is set mostly in a small rural town far from Tokyo where a new supermarket loudly promotes itself and its cheaper prices, causing hardship for the small shopkeepers like Reiko. (This is why Koji's family wants to expand the store—to compete.) Later, the film stays with Reiko on a train ride for a long stretch, wrapping up in a small, picturesque resort town. YEARNING is not as complex or as layered as WHEN A WOMAN, and Takamine's character was more outspoken and less self-effacing in that film. But it's still a beautiful, moving Japanese drama, with an insistent subtext about the lingering effects of the war on Japanese families some 20 years later. Mie Hama, the petite beauty who played Kissy Suzuki, the Japanese agent who marries James Bond in YOU ONLY LIVE TWICE (1967), appears in two memorable scenes as Koji's cute and fickle young bedmate who chews gum (and spits it out on the floor of the shop) and boasts a beauty shop hairdo like American teenage girls were wearing at the time. She's quite keyed into her own desires in a way that Reiko can only envy. When she was on screen, I kind of wished the movie would stay with her for a while. The abrupt ending may leave some viewers unsatisfied. I would have preferred some kind of epilogue, like the final scene of WHEN A WOMAN. However, I've learned to accept that with certain filmmakers like Naruse, one should take the ending on faith, even if you don't get the reason for it right away.",
         "YEARNING (MIDARERU). Viewed on Streaming. Restoration/preservation = seven (7) stars; cinematography = seven (7) stars; subtitles = five (5) stars; music = two (2) stars. Director Mikio Naruse (credited with writing the story) delivers a photo-play packed with passion/irony (bitterness, suffering, perseverance, and unrequited love to name a few), humor, red herrings (the ending is pretty much a total surprise!), and strong women (Japanese business women are depicted to be as ruthless as their male counterparts) all the while demonstrating mastery of the then-new wide-screen format. It's quite a show! Typically Naruse's stories take place during times of societal change. In this case it examines how war widows deal with their fates and the challenges faced by traditional small family business from emerging large-scale chain stores (in this case food supermarkets). Stunning lead actress Hideko Takamine (a bit on the chubby side?) headlines a strong cast, but easily steals (or is allowed to steal) every scene she is in (she was one of Naruse's favorites). The explicit courtship of Takamine's character by the younger brother of her long deceased (killed in the Pacific War) husband (they have lived in the same household and been secretly in love for quite some time) is cleverly depicted by the Director during a long train ride (towards the film's end). Another classic train-themed movie sequence! Cinematography (2.35:1, black and white) and lighting are understated, but excellent. Subtitles need some grammatical adult supervision, since they often fail to summarize the dialog (and, instead, resort to speed-of-light flash rates!). Text/signage is usually translated. Music is end-to-end terrible. It consists of an impoverished riff on contemporary Italian film scores with a very short theme (maybe 3-4 bars?) repeated ad nausea. And it never fails to distract from every scene in which it is heard! Restoration/preservation is very good (except for a few seconds of noise artifacts as the movie begins). Takamine's character finally lets her hair down (or at least a few strands) in the closing shots. Here her body language and facial expressions seem to summarize the film's plot line in a few seconds. Sagoi Desune! (Amazing!) Highly recommended. WILLIAM FLANIGAN, PhD.",
         "Mikio Naruse's film Yearning reflects the significant social change occurring in Japan in 1964 when supermarkets began to offer cheaper prices in order to drive out the small shops which had dominated the market. This changing structure particularly affects Reiko (Hideko Takamine), a widow since the last war after only being married for six months. She has remained with her husband's family to run the family grocery store along with her mother-in-law Shizu (Aiko Mamasu) while brother-in-law Koji (Yûzô Kayama), and sister-in-laws Hisako (Mitsuko Kusabue) and Takako (Yumi Shirakawa) live their own private lives. Takamine's remarkable performance as the repressed widow conveys a longing for a freedom that has been elusive. The film opens as a van parades the streets advertising the supermarket, driving past Reiko's store in the process. Shot in Naruse's quiet style, the film is a study in contrasts. Reiko is a woman with traditional values who has repressed her own desire for companionship to serve her husband's family, while Koji is a layabout who drinks and gambles and takes no responsibility for the family business. When a group of drunken businessman pressure bar girls to see how many eggs they can stuff into their mouths, Koji intervenes and starts a fight leaving Reiko to bail him out of jail. Koji and his sisters make plans to build their own supermarket, but conspicuously leave Reiko out of their plans, urging her to remarry. Reiko is hurt by the family's seeming lack of appreciation for her service. She is accepting of her role, but emotionally unprepared when Koji surprisingly confesses to her that he loves her. Though Reiko initially rejects his advances, she tells him later: \"when you said you loved me, I felt glad,\" and \"I've been a different woman since that day.\" She is unable, however, to accept Koji's telling her that she has wasted her life for his family. Though she hears the words, she is too bound to the past to be able to acknowledge their truth. She tells Koji, \"I didn't waste my life. I lived it,\" but she is not convincing. The entire mood of the film changes with Koji's declaration and the way their relationship unfolds constitutes the emotional core of the film and provides its most dramatic moments and its shattering conclusion."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Toho Company"],
      "summaries": ["After a bombing raid destroys the family store and her husband, Reiko rebuilds and runs the shop out of love stopped short by destruction."],
      "budget": 0
   },
   "movielensId": 145342,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1964-01-15",
      "dvdReleaseDate": null,
      "directors": ["Mikio Naruse"],
      "runtime": 98,
      "movieId": 145342,
      "title": "Yearning",
      "mpaa": "",
      "actors": [
         "Hideko Takamine",
         "Yûzô Kayama",
         "Mitsuko Kusabue",
         "Yumi Shirakawa",
         "Mie Hama",
         "Aiko Mimasu",
         "Yû Fujiki",
         "Kazuo Kitamura",
         "Hisao Toake",
         "Kumeko Urabe",
         "Kan Yanagiya",
         "Yutaka Sada",
         "Yutaka Nakayama",
         "Chieko Nakakita",
         "Gen Shimizu",
         "Yasuhiko Saijô",
         "Yasuzô Ogawa"
      ],
      "imdbMovieId": "0058349",
      "originalTitle": "乱れる",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "After a bombing raid destroys the family store and her husband, Reiko rebuilds and runs the shop out of love stopped short by destruction.",
      "tmdbMovieId": 111398,
      "avgRating": 3.75,
      "releaseYear": "1964",
      "numRatings": 4,
      "posterPath": "/pKVlb9NtEFR1oSeTmAd5LiS3Kek.jpg"
   }
}