{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "klondike",
            "id": 180808
         }
      ],
      "imdb_id": "tt0019489",
      "video": false,
      "title": "The Trail of '98",
      "recommendations": [],
      "backdrop_path": "/xMNZg4HuODXbxZ9pTMMUsPvV6tZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Berna",
               "gender": 1,
               "credit_id": "52fe4bb5c3a36847f82109ab",
               "name": "Dolores del Río",
               "profile_path": "/4NKK6CfhphqmeCEfzA5j2bne9Hu.jpg",
               "id": 31876,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe4bb5c3a36847f82109af",
               "name": "Ralph Forbes",
               "profile_path": "/iA6a0NmQM7gGIFO75VMayBh09N9.jpg",
               "id": 47178,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lars Petersen",
               "gender": 2,
               "credit_id": "52fe4bb5c3a36847f82109b3",
               "name": "Karl Dane",
               "profile_path": null,
               "id": 29978,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jack Locasto",
               "gender": 2,
               "credit_id": "55e321e6c3a3684191000df3",
               "name": "Harry Carey",
               "profile_path": "/anb733JSA0OPnYEnWRFdztKuncw.jpg",
               "id": 30212,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Salvation Jim",
               "gender": 2,
               "credit_id": "55e321f192514137dd000c5f",
               "name": "Tully Marshall",
               "profile_path": "/zywfVcAvVfinpH4wI7f7wvgdDr9.jpg",
               "id": 13359,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Samuel Foote - The Worm",
               "gender": 2,
               "credit_id": "55e321fbc3a368418e000ba5",
               "name": "George Cooper",
               "profile_path": "/Nk7bE4k2qBmQ8iDjIlzXScrpp6.jpg",
               "id": 194173,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mrs. Bulkey",
               "gender": 1,
               "credit_id": "55e3220a92514137e9000c4a",
               "name": "Emily Fitzroy",
               "profile_path": "/Fro2FTln4zQ7v9cjYtpsOcY8Di.jpg",
               "id": 97988,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Bulkey",
               "gender": 0,
               "credit_id": "55e32212c3a3684188000be2",
               "name": "Tenen Holtz",
               "profile_path": "/xkw24oNHErN8CivKHwfaLmwvow0.jpg",
               "id": 1235622,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Henry Kelland - Berna's Grandfather",
               "gender": 2,
               "credit_id": "55e3221dc3a3684185000c15",
               "name": "Cesare Gravina",
               "profile_path": "/wFQ9D3ILvh6TliXJHuLCXeuImKM.jpg",
               "id": 940168,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Locasto's Procurer",
               "gender": 1,
               "credit_id": "55e3222792514137e9000c4e",
               "name": "Doris Lloyd",
               "profile_path": "/4QJ0iSrOQ9rwfgEaDnqTaXem6c5.jpg",
               "id": 21878,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Train Engineer",
               "gender": 2,
               "credit_id": "55e32230c3a3684185000c18",
               "name": "E. Alyn Warren",
               "profile_path": "/bzeIBytktSELtD1HP7ucOSbzTp2.jpg",
               "id": 120556,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mother's Boy",
               "gender": 2,
               "credit_id": "55e3223ac3a368418b000c4e",
               "name": "Johnny Downs",
               "profile_path": "/shVecyKb99iqayV3dhrQ5FYJnPM.jpg",
               "id": 131442,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Brother Jim",
               "gender": 0,
               "credit_id": "55e32245c3a368418b000c52",
               "name": "Ray Hallor",
               "profile_path": null,
               "id": 1324411,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Brother Joe",
               "gender": 0,
               "credit_id": "55e3224f92514137dd000c6d",
               "name": "Ray Gallagher",
               "profile_path": null,
               "id": 1420073,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Young Girl",
               "gender": 0,
               "credit_id": "55e3225d92514137da000d6b",
               "name": "Josephine Adair",
               "profile_path": null,
               "id": 1278679,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Gold Commissioner's Assistant",
               "gender": 2,
               "credit_id": "55e32267c3a368418b000c57",
               "name": "Francis Ford",
               "profile_path": "/1o50aKPvcpXX6KvO1PCp8NDo3S3.jpg",
               "id": 30496,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "55e3227192514137da000d71",
               "name": "Carmencita Johnson",
               "profile_path": null,
               "id": 150947,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Little Boy",
               "gender": 0,
               "credit_id": "55e3227bc3a3684194000c6b",
               "name": "Cullen Johnson",
               "profile_path": null,
               "id": 1010097,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Man on Ship",
               "gender": 0,
               "credit_id": "55e3228492514137e9000c59",
               "name": "Roscoe Karns",
               "profile_path": "/8K65O6N0qtgus9cdvBIdfmAEKJ2.jpg",
               "id": 30157,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Lars' Nagging Wife",
               "gender": 1,
               "credit_id": "55e3228c92514137ec000c8d",
               "name": "Polly Moran",
               "profile_path": "/9sGgnwEDs7CEqW9RrsJ422lgz1i.jpg",
               "id": 148513,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "Minor Role",
               "gender": 2,
               "credit_id": "55e32298c3a3684191000e12",
               "name": "Scott Seaton",
               "profile_path": "/l3oAuHTCEUghflItpS89sfsz8gL.jpg",
               "id": 1364421,
               "order": 20
            },
            {
               "cast_id": 23,
               "character": "Extra",
               "gender": 2,
               "credit_id": "55e322cbc3a3684185000c30",
               "name": "Jacques Tourneur",
               "profile_path": "/6AZBSqqlsLjMxW7q798n0g19W54.jpg",
               "id": 10146,
               "order": 21
            },
            {
               "cast_id": 24,
               "character": "San Francisco Party Girl",
               "gender": 0,
               "credit_id": "55e322d492514137da000d7c",
               "name": "Benay Venuta",
               "profile_path": "/gcFqkHCVyLlZL70iQcI0zeZyGJh.jpg",
               "id": 102372,
               "order": 22
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4bb5c3a36847f82109a7",
            "name": "Clarence Brown",
            "profile_path": "/3fQb3Hw4lUPqJaFIYDIjXVeGw5E.jpg",
            "id": 84034,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.116523,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117435,
      "vote_count": 1,
      "budget": 0,
      "overview": "Fortune hunters from all over the country rush to the Klondike in 1897 to seek their fortunes in the gold are tested by hardships of the journey.",
      "similar": [
         3090,
         962,
         334524,
         2000,
         12227,
         11310,
         11589,
         9654,
         22,
         682,
         1572,
         6637,
         10530,
         49524,
         818,
         429,
         6415,
         10975,
         10501,
         421044
      ],
      "original_title": "The Trail of '98",
      "runtime": 87,
      "poster_path": "/Avk3lBtfLAo6Nb3ctHAAEWrUZg3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1928-03-20",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Clarence Brown"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Robert W. Service",
         "Benjamin Glazer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019489/",
      "coverLink": null,
      "actors": [
         "Dolores del Rio",
         "Ralph Forbes",
         "Karl Dane"
      ],
      "reviews": [
         "In 1896 gold was discovered on a small creek in the Klondike district of Canada's Yukon region. Despite the extreme remoteness of the location and the tremendous difficulties involved in getting there, over the next four years 30,000 people would travel to the boom town of Dawson City, desperate for wealth. Eventually, $100,000,000 in gold would be discovered by these hardy argonauts. THE TRAIL OF '98 tells their story. One of the last epic silent films, MGM spared no expense and filmed largely on location. Although almost forgotten today, this is a wonderful movie full of romance & adventure. Its most famous scenes involve the hideous climb over Chilkoot Pass, which separated the disembarkation point of Skagway from the Yukon River, where the gold seekers had to build their own boats and run the rapids down to Dawson. The shots of the long line of men & women, toiling like ants up the steep slope of Chilkoot, with the weak dying along the way, isn't soon forgotten. The cast is first rate, although many of them are forgotten now: Dolores Del Rio, Ralph Forbes, Harry Carey, Karl Dane, Emily Fitzroy, Roscoe Karns, Tully Marshall & Doris Lloyd. Playing saints or sinners, they help make this film truly memorable. Tragedy struck during the filming of the short river rapids sequence. A cord was strung across the river, but the safety loops hanging from it were allowed to become knotted & slippery, thus giving the stuntmen nothing to grab and cling to as they swept beneath it. Of the eight stuntmen shown in the film running the rapids, four were to drown; two of the bodies were never recovered.",
         "The visuals are striking in this silent drama set in the 1898 Klondike gold rush. Whereas Chaplin treated the same setting for comedy in The Gold Rush (1925), with a little dramatic relief, this film concentrates on the hardships and thievery such stakes generally produce, with only a little comic relief. The opening shows people from various parts of the country planning to seek their fortune. All have hopes high, and we hear many say to their loved ones, \"I'll bring back a million\" as they board the ship taking them to Skagway, Alaska. The film follows only a few of the hopefuls. Karl Dane and George Cooper go into a partnership with Tully Marshall aboard ship; elderly couple Tenen Holtz and Emily Fitzroy plan to open a restaurant and bring distant relative Dolores Del Rio and her blind grandfather, etc. Del Rio meets Ralph Forbes on ship and they fall in love, but marriage will wait until he makes his fortune. Once in Skagway, each has to make the arduous trek to Dawson City through the Chilkoot pass, carrying their own food for the long journey and battling subfreezing temperatures, avalanches and raging rivers from melting snow in the spring. And because each literally must carry a ton of food, it's slow-going as they take a little at a time and return to repeat the process many times in order to travel a short distance. Del Rio's grandfather and others perish in an avalanche, and many turn back. But the main characters make it only to be told to go back: one in a thousand finds gold and there are a hundred men for every job. Del Rio and Forbes eventually decide to go back, but when news of another strike reaches town, he goes with Marshall, Dane and Cooper to try again, leaving Del Rio with Tenen and Fitzroy. The villain and claim-jumper, Harry Carey, buys return tickets for Tenen and Fitzroy only because he has eyes for Del Rio. (By then the Yukon River had been made navagable and a ship came in once a year.) Once they leave he arranges to take the unwilling Del Rio as a mistress with the aid of procuress Doris Lloyd. The men do find gold, and Forbes returns to an angry Del Rio, who forgives him when he tells her the past doesn't matter. But he still has to contend with Carey.",
         "Recently I had the chance to view this film on TCM and it is truly an epic. The storylines are realistic and the characters believable. Most impressive however is the exterior shots showing the Alaskan winter. I got cold just watching them! There are avalanches, blizzards and everything. It makes one appreciates the suffering those brave, if not foolish, souls endured in 1898.",
         "This is one of my favourite films of the late silent era.It has a mixture of drama, suspense,action and comedy to satisfy most tastes. The comedy is provided by Karl Dane, as a Scandinavian saphead who falls for about every con that comes his way. The hero and heroine suit each other well. The villain is about as bad as you could want and the fight scene with the hero is one of the most realistic I have ever seen.There are some pretty good special effects and some strong supporting characters. The way in which people come to accept the fate of their companions tells us how harsh conditions must have been and how hard those prospectors had to become to survive. Add to this a theme song, background music and sound effects....what more could you ask for?",
         "Knowing that four men died making this movie makes this one a bit creepy to watch. Apparently back in the 'good old days', such losses were regrettable but acceptable. At about the same time people died making \"The Trail of '98\", several more were dying in order to make the infamous \"Noah's Ark\"! When you watch \"The Trail of '98\", you can sure imagine how so many men died--the film was stuffed full of insanely vivid stunts and location shoots that were just awful. The end result is truly amazing--one of the best of the silents-though the cost sure didn't justify this. The film begins with the country becoming hysterical with gold fever after the discovery of the metal in the Klondike region--all told with a series of vignettes. The first third of the film consists of this well as the insanely arduous trek to the gold fields. This is probably the most exciting part of the film--with one over-the-top stunt after another. If stuntmen weren't killed in the avalanche scene, then they probably perished in the hazardous trip down the rapids! I really would have loved to have seen this one on the big screen. The second portion of the film has more to do with life in the Klondike and its impact on the central characters. In particular, it focuses on Delores del Rio and her fiancé, Ralph Forbes. She is miserable and at the end of her ropes (justifiably so). He agrees to take her back home but, at the last minute, there's word of a new strike and he abandons her! She is forced to survive with nothing but her good looks--and it's very strongly implied she sells her body in order to eat. When he returns, rich, it looks like it's too late--she's not the same girl she once was and she's not in a particularly forgiving mood! There's quite a bit more to the film than this--including some harrowing scenes involving starvation and death due to exposure to the elements--and wolves apparently eating one guy! In fact, this brings me to one of the better aspects of the film--unflinching violence. Normally I don't like violent content in films, but in a film like this it IS necessary. A Post-Code film (1934 and later) would have eliminated the blood, softened the film and totally eliminated the insanely dangerous burning to death scene--but the impact would have been far less. Brilliantly done but also a film that might shock you as well! Overall, there's really nothing to dislike about the film other than its stupid waste of four lives due to some poorly done stunt-work--or perhaps stunts that were attempted that simply were too dangerous to even be attempted. Still, the end results are spectacular, there's no denying that. By the way, while VERY different in tone, imagine a double-feature with this and \"The Gold Rush\"! Wow.",
         "Gold is surely what made people most dream of during all civilizations. This is proved again very completely in this film where we discover very different characters who only have one aim : Klondike. We particularly follow the story of a young girl, played by the beautiful Dolores Del Rio. Clarence Brown alternates dramatic scenes and very funny ones which appeal to you the memory of Gold rush by Charlie Chaplin. It's very to rare to watch such a film nowadays, so don't hesitate if you have the occasion.",
         "After gold is discovered in Alaska, some lower 48 United States residents decide to go there, and become millionaires. The journey proves arduous, and several die. Attractive Dolores Del Rio (as Berna) and Ralph Forbes (as Larry) are two who hope for riches - they meet aboard ship (the first leg of the journey), and fall in love. Out to stake a claim, Mr. Forbes teams up with \"dumb Swede\" Karl Dane (as Lars Petersen), grizzled Tully Marshall (as Salvation Jim), and sneaky George Cooper (as Samuel \"The Worm\" Foote). But, while Forbes is out of the picture, wicked Harry Carey (as Jack Locasto) tries to steals Ms. Del Rio's virtue... \"The Trail of '98\" is a top MGM silent, nicely directed by Clarence Brown. The synchronized sound effects are great, especially during the grand fire sequence occurring near the end of the picture. Most of the first hour consists of grueling location scenes (four stuntmen were reportedly killed during the making of the picture). They are definitely worth seeing. The characters are introduced, but left too long with only sketchy story lines - and, what's plotted is woefully ordinary, considering the production values. ****** The Trail of '98 (3/20/28) Clarence Brown ~ Dolores del Rio, Ralph Forbes, Karl Dane, Harry Carey",
         "Trail of '98, The (1928) *** (out of 4) One of the best of the \"last period of silent films\" takes a look at various characters who leave their peaceful homes and go into the dangerous and deadly Klondike in hopes of striking gold. Delores Del Rio and Ralph Forbes play a young couple who have everything ahead of them but the husband's greed gets them into one dangerous situation after another. This MGM production was highly troubled to say the least and a lot of this is due to a dangerous stunt where four stunt men were killed trying to ride boats down some very dangerous rapids. Two of the bodies were never found and if you've seen the documentary Hollywood there's a very haunting story about how badly the stunt went wrong. No film is worth anyone being killed and when you see this scene and the men who were killed you can't help but wonder why anyone would even attempt to ride these rapids and seeing the stuff in the actual film was quite eerie. The film certainly makes you feel the bitter cold of the territory as director Brown has no problem at putting you right into the middle of this gold craze. I really enjoyed the start of the film as we travel a map of the U.S. and hit various states where we see the people hearing about the gold rush and leaving their homes. The next sequence has then in San Francisco where they're about to board a ship and on the ship we see how these characters all plan on making millions yet none of them realize the danger and terror that is ahead. I thought the film did a terrific job at making you feel and understand what was striking the country during 1898 when people thought their futures were in Alaska yet none of them realized the only thing waiting their was death. The \"stories\" of the characters really don't add up to too much as it's pretty much your typical disaster film stuff. What does work is the amazing footage of the wilderness as well as some terrific action scenes. The before mentioned rapid scene look amazing but knowing four people were killed takes away the entertainment. Another scene has hundreds of people being killed during a snow slide and I must say that while the effect is easily seen today, the scene still packs quite a punch and the effect certainly grabs one. The cast do a fine job with their roles but then again the film isn't too worried about the story or their performances. The main thing going for THE TRAIL OF '98 is the amazing stunts and the way that the director really puts you right there just as if this was a documentary on the events.",
         "Metro's Trail of '98 (available on a superb Warner Archive DVD - I repeat, Warner Archive! Don't ask me what an M-G-M movie is doing on a Warner Archive DVD, but presumably Metro sold the movie to Warners for a remake) is a great run for the money. The story and characters are much the same - as are the locations - of many other similar movies. Despite its name cast, including alluring Dolores Del Rio, competent Ralph Forbes as the hero, Karl Dane, Tully Marshall and Harry Carey (a superb villain), the story, the background and the locations were publicized by M-G-M, rather than the cast. In fact, it was Robert W. Service's name alone that the studio featured on many posters. Coming right at the tail end of the silent period (it was issued with a sound track of music and effects), the superbly made, bitingly atmospheric and thrillingly enacted Trail of '98 with its impressive cast, stunning locations and hard-hittingly sardonic story (perhaps its get-rich-at-all-costs theme was too uncomfortably close to home for stock market jittery 1929 audiences) failed to recover its huge production costs. Although director Clarence Brown managed to retrieve his reputation with Anna Christie (1930), he was never again entrusted with a budget of comparable size, although he went half-close with Anna Karenina (1935), The Rains Came (1939) and The Yearling (1946) - although part of the latter's expenses of course were racked up by Victor Fleming in Metro's failed 1941 attempt to film the Marjorie Rawlings' novel.",
         "This silent movie from 1928 is an epic drama centered on the real-life Klondike gold rush of 1897-98, with portions of it real (e.g. the treacherous ascent up the Chilkoot Pass), and others making up the story of the fictional characters. Among the prospectors are a couple who meet and fall in love, played by Dolores del Rio and Ralph Forbes. Their chief nemesis is a schemer played by Harry Carey, who always seems a step ahead of everyone else. There are several other prospectors who provide humor (usually quite dated) as well as the pathos of their situation, enduring one hardship after another. The movie is drawn out and styled as an epic, 'big' film. I found it somewhat tedious in big patches of the first half, but it grew on me. Director Clarence Brown ('A Free Soul' and 'National Velvet' among four other Oscar nominations) includes some decent special effects in scenes such as an avalanche and a man being lit on fire, and heightens emotional tension with slow zooms into the actors' faces. In a scene that made me smile, Carey sits down to a steak dinner and has plates of beans brought in around it, so that he can eat a 'real meal' in front of them, having lived on beans for six months. Despite the cuteness and simple dialog in the film, there are moments of real grit, including betrayal, an implied rape, and scenes on the rapids which actually killed four stuntmen. There are parts which definitely stand up close to 90 years later, and it's worth sticking with.",
         "The Trail of '98 (1928) works best when it is showing the characters' struggle to get through Alaska. It has some memorable characters too, the best of the lot being Tully Marshall's Salvation Jim, a religious but mischievous and kind old fellow. The climax is fabulous, with a lot more violence and bloodshed than one unacquainted with old movies would expect for a film of this vintage. Unfortunately, once our heroes get to the Klondike, we fall into deep melodramatic territory and not even good melodrama. The young lovers played by Ralph Forbes and Dolores Del Rio are the most uninteresting characters in the story, and the last half is almost solely dedicated to them. Fortunately, Del Rio gives it her all playing a woman who has to deal with a lover's broken promise, being raped, and then forced to prostitute herself to survive. On the other hand, Forbes is wooden and unconvincing as the repentant hero. This one's truly a mixed bag. Watch for the Marshall and the visuals."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Western",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "The Klondike gold strike of 1897 inspires fortune-seekers to head for Alaska. Joe and Jim, brothers from South Carolina; Lars, escaping a shrewish wife in Michigan; a poor farmer from Kansas; weathered prospectors from Nevada; and countless others leave San Francisco by ship. The Bulkys head north to open a restaurant, bringing a poor relative, Berna, along to help. On board Berna meets Larry and falls in love. The overland route to Dawson City is hazardous and arduous. Each person must carry their own food, a ton of it. That means traveling 80 miles back and forth to advance one mile, carrying 50 pounds a trip. The Chilkoot Pass is one of the worst sections of the trail. In the spring the trekkers take to the rivers, swollen by melting ice. Whitehorse Rapids proves the last and biggest obstacle to reaching the gold fields. But that's not the end of the hardships. Claim jumping, blizzards, fires, and Berna's honor at stake are to be faced before striking it rich.",
         "Fortune hunters from all over the country rush to the Klondike in 1897 to seek their fortunes in the gold are tested by hardships of the journey."
      ],
      "budget": 2000000
   },
   "movielensId": 145322,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1928-03-20",
      "dvdReleaseDate": null,
      "directors": ["Clarence Brown"],
      "runtime": 87,
      "movieId": 145322,
      "title": "The Trail of '98",
      "mpaa": "",
      "actors": [
         "Dolores del Río",
         "Ralph Forbes",
         "Karl Dane",
         "Harry Carey",
         "Tully Marshall",
         "George Cooper",
         "Emily Fitzroy",
         "Tenen Holtz",
         "Cesare Gravina",
         "Doris Lloyd",
         "E. Alyn Warren",
         "Johnny Downs",
         "Ray Hallor",
         "Ray Gallagher",
         "Josephine Adair",
         "Francis Ford",
         "Carmencita Johnson",
         "Cullen Johnson",
         "Roscoe Karns",
         "Polly Moran",
         "Scott Seaton",
         "Jacques Tourneur",
         "Benay Venuta"
      ],
      "imdbMovieId": "0019489",
      "originalTitle": "The Trail of '98",
      "genres": [
         "Adventure",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Fortune hunters from all over the country rush to the Klondike in 1897 to seek their fortunes in the gold are tested by hardships of the journey.",
      "tmdbMovieId": 117435,
      "avgRating": 3.5,
      "releaseYear": "1928",
      "numRatings": 1,
      "posterPath": "/Avk3lBtfLAo6Nb3ctHAAEWrUZg3.jpg"
   }
}