{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0120238",
      "video": false,
      "title": "SubUrbia",
      "recommendations": [
         14022,
         80046,
         33693,
         182856,
         62488,
         24257,
         42725,
         33639,
         13319,
         86763,
         38295,
         494
      ],
      "backdrop_path": "/dmGt3VOTKCkFUBFsWWxoFnwI5c1.jpg",
      "revenue": 656747,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Pony",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c911",
               "name": "Jayce Bartok",
               "profile_path": "/xDhwbN0QGGZ1YtvcML3EX8d5JJj.jpg",
               "id": 21130,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sooze",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05c915",
               "name": "Amie Carey",
               "profile_path": null,
               "id": 99513,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c919",
               "name": "Nicky Katt",
               "profile_path": "/dbAeUQXzyf2HDFYtifWkHfE3SNW.jpg",
               "id": 18070,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nazeer Choudhury",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c91d",
               "name": "Ajay Naidu",
               "profile_path": "/yIlmjzp1IX1sehbE0xvozEBQbxA.jpg",
               "id": 1982,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Erica",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05c921",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c925",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pakeesa Choudhury",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05c929",
               "name": "Samia Shoaib",
               "profile_path": "/uN5EHxs6mVpNaLx7jeHewVF0VfM.jpg",
               "id": 6439,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Buff",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c92d",
               "name": "Steve Zahn",
               "profile_path": "/tcRHqtdi4wM8hlZ3MjPDWgePp7L.jpg",
               "id": 18324,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Bee-Bee",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05c931",
               "name": "Dina Spybey-Waters",
               "profile_path": "/rA6gMWarWOpxUCFsfYFz4Gcok7o.jpg",
               "id": 56567,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c901",
               "name": "Richard Linklater",
               "profile_path": "/wNijRefhQCp0BkNqM5qhhdazDgx.jpg",
               "id": 564,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c907",
               "name": "Eric Bogosian",
               "profile_path": "/ez5wbZJ1txZ8EroWSRxElcWlsru.jpg",
               "id": 10866,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05c90d",
               "name": "Eric Bogosian",
               "profile_path": "/ez5wbZJ1txZ8EroWSRxElcWlsru.jpg",
               "id": 10866,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.424815,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28059,
      "vote_count": 37,
      "budget": 0,
      "overview": "A group of suburban teenagers try to support each other through the difficult task of becoming adults.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         4638,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241
      ],
      "original_title": "SubUrbia",
      "runtime": 121,
      "poster_path": "/7PdRbG09K9JHYyOwwCSn3OdJb0N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Detour Filmproduction",
            "id": 11510,
            "origin_country": ""
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-07",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Linklater"],
      "runtime": 121,
      "synopsis": null,
      "writers": [
         "Eric Bogosian",
         "Eric Bogosian"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120238/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwNTExODQ1OF5BMl5BanBnXkFtZTcwMTUzNzkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Giovanni Ribisi, Steve Zahn, Jayce Bartok | See full cast and crew »"],
      "reviews": [
         "I first saw subUrbia in probably 1997, and since then I have shared it with countless people and watched it plenty myself. Its not the sort of movie that you can put in, and then not really watch, to me it requires a bit more concentration. At th same time, the events that unfold for the characters in this movie always strike me. Another major bonus with this film is the issues it takes the time and consideration to cover, sexism, racism, classism, urban sprawl, the third world, and more... Its not a movie for people that don't want to see that ugly side of humans, but then all too often in day to day life the suburbs serve to show the ugly side of humans. Not a movie for children, and I wouldn't watch it with my grandma! Its a powerful and real story of life past high school, but not dealing with college. Of life feeling stuck, trapped, sometimes defeated in your current place, here suburbia. Its not a movie that offers a ton of hope, but its a powerful movie nonetheless!",
         "If \"Dazed and Confused\" was the 'high' then \"SubUrbia\" if most definitely the 'down'. It's basically the flipside of \"Dazed and Confused\", where youthful hedonism has been replaced by 20-something boredom. It's a post-college movie where characters have found themselves unfulfilled in every capacity. It's a pack mentality, where you hang-out with the same gang from high school only to find you've out grown each other and resent one another's ambitions because you know you yourself lack the impetus to do anything constructive with your life. These characters are losers in every respect, clinging on to their high school way of life, reluctant to take initiative and move on. They constantly put each other down, bicker and make efforts to humiliate, yet the depressing thing is they have no one but each other. This is a quality film that remains one of Linklater's most under appreciated efforts. No one has the ability to present young characters with the insight, skill and craft Lanklater possesses. He is truly one of America's finest filmmakers working today and \"SubUrbia\" is a great film that still holds up.",
         "If you like 90 minute movies (over the course which each character becomes a better person), characters with whom you can deeply sympathize, complete resolution of all conflicts, and happy endings, don't rent this. subUrbia is too harsh, too honest, and too painful. Ribisi and Katt are amazing. Katt was great as the wisecracking \"Stacy\" in the movie The Limey, a role similar to his in subUrbia (Tim). Overall, the characters are too angry, poisonous, and disillusioned to be likeable. I didn't find this to be a bad thing, however. Adding to the numbing ache of the movie is the fantastic score- Sonic Youth's droning guitars and a nihilistic soundtrack all add to the depression in Linklater/Begosian's Burnfield. Enjoy. Or not.",
         "Linklater is treading in some of his familiar water ... one night in the night of a group of adolescents dealing with that difficult period at the end of high school, when one stops being what one must be and starts being what one chooses to be. This film is not \"Dazed and Confused\", however, except that the two films share a spot-on accurate portrayal of familiar American characters. This movie is darker, preachier, deeper. This time, instead of the rituals of the last night of high school, the film centers around the return of a former crony who has made it really big as a rock star. He's their friend, and the nicest guy in the world - just a former geek who struck it big and realizes how lucky he is - nobody could hate him. And yet some do. Some hate him because he is a winner in the roll of the dice, and several of the gang are on their way toward becoming losers, and they know it. Their life consists of hanging around outside a convenience store. For all its concern with the accuracy of its portrayals, the film has a curiously innocent denouement. The most simple and naive members of the group end up heading off to look for their dreams, and the cynical and jaded can see that their lives will repeat infinitely in their home town. In a sense, the succcess of the gentle stoned guy injects an almost impossible hopefulness in an otherwise despairing ending. As Graham Greene once wrote, baseless optimism is so much more appalling than despair. Still, that was the choice of the filmmaker, and it wasn't an unfair one. Sometimes things do work out like that in real life, and this movie is all too close to real life. So close it can make you feel uncomfortable when you see yourself reflected in one character or another. This and \"Dazed\" establish Linklater as an outstanding filmmaker with an uncanny eye for real situations and characters. One hopes he will soon realize his great potential with something better than The Newton Boys",
         "I consider this one of Giovanni Ribisi's greatest acting roles... because it is so real. The entire cast portrays this in the way that I think many 20-something-year-olds can relate. I know that when I had all of my friends watch it, they could see themselves in many of the characters. It showed us that we are not the only young adults, living in suburbia and our mother's houses... thinking about the things that we'll never do with our lives. Steve Zahn gave his usual comedic act, without taking away from the seriousness of the film. I believe that this is much easier to relate to than the earlier Dazed and Confused, because it shows the American Dream in action... that series of hopes that are easier said than done. What is wrong with us?",
         "I'm not big on comparing movies, so in watching this movie I abolished the fact that some of the same people who worked on Dazed and Confused did this movie. Depending upon what you expect of this movie determines what exactly you will think of it impressionably. Suburbia is a comedy, but more so a strong story delivered by great actors. Its moral is one of those undefined feelings that will never truly be diagramed, and then again that's not its point. Suburbia unleashes characters that are filled with life and dimension beyond the threes' parallel. It's a story about not caring, about doing, and becoming. It leaves you with a decision in your own self. Deep for a comedy, but simply an excellent movie!",
         "After avoiding this film for years (thinking it was for kids) I caught it on cable recently and found it completely engaging. What struck me is that while it is about younger people, that audience might not embrace it. I found it smart, witty in a very dry sort of way, yet also a compassionate look at the contemporary American youngster. Absolutely worth viewing. And the dialogue is, well... snappy.",
         "According to Thoreau, the masses lead lives of quiet desperation. Which in turn leads to a paralyzing self absorption or self pity that most of us don't recognize until it's too late, if at all. And that is the theme of this extraordinary film. The plot revolves around a group of middle class suburban kids a couple of years removed from high school. Jeff (Giovani Ribisi) is a college dropout who lives in his parent's garage. Tim (Nicky Katt) is a former high school football star who did a brief stint in the Air Force before chopping of part of a finger to get a disability discharge. Buff (Steve Zahn) is a stoner who's life revolves around his next buzz and his next sexual conquest. The trio whiles away their aimless lives drinking at their old high school hangout - a convenience store now run by Pakistani immigrants. In addition, there's Jeff's girlfriend Sooze (Aimee Carey), a budding artist; her friend BeeBee (Dina Spibey), a recovering alcoholic; and an old high school buddy named Pony (Jayce Bartok), now a major rock star who drops by the old stomping grounds while in town for a show. Of the group, only Pony and Sooze have any ambition in life - Pony is well on his way to achieving his dream, and Sooze is preparing to move to New York to pursue her career. Except for those two, and the convenience store owner who is studying to become an engineer, every character in the film suffers from a kind of inertia that prevents them from taking charge of their lives and achieving any meaningful success or happiness. Tim has seen the third world, but has no sympathy for its inhabitants or appreciation for how good he has it. Buff is mired in perpetual adolescence. BeeBee lives vicariously through Sooze, and, despite her own sordid history, cares little for the substance abusers she tends to as a nurse's assistant, . Then there's the liquor store clerk whose life revolves around the local high school football team, and Pony's slutty manager (Parker Posey) the rebellious poor little rich girl who went into the music business against daddy's wishes. Jeff is the one character in the film who is truly sensitive to the plight of others, but he is immobilized by his own self-pity. That is, until one night on the town with Pony when he realizes that he indeed controls his own destiny, and decides to strip away his shackles (represented by his clothes) and move to NY with Sooze. But, ironically, it's too late... Sooze hooked up with Pony while he was experiencing his revelation. At the end of the movie, the Pakistani store owner belittles Jeff and his buddies for being so stupid as to throw away all of the opportunities they are afforded by living in the greatest, most prosperous country on earth. But he, like everyone else, is blind to the desperation of those around him. Desperation that can engulf even the lives of those in the land of plenty. Thanks to the mesmerizing script by Eric Bogosian, the outstanding direction by Richard Linklater, and the performances of the stellar cast, the audience gets the message loud and clear.",
         "Always having been a fan of Richard Linklater's work, it confounded me that his film after indie darlings Dazed and Confused and Before Sunrise has never been released on DVD. SubUrbia is the kind of movie you hear that fans of his work love, but never found a place in cinema history. Flipping through the movie channels on TV, I happened across the film and could not stop watching until it was over. Much in the same way as his other work, the movie is dialogue driven and concerning a small group of people talking about life and what comes next for them. He has compiled a very nice cast, all of who take their character and roll with it. It is a scary thing, post high school, deciding what to do with one's life. Having been stuck in the suburbs for so long, one begins to wonder if they can survive outside it. The compelling thing for me in Richard Linklater films is the general waxing philosophic feel they all seem to have. These are kids that are college age who have things to talk about, questions to have answered, and are not afraid to ask them when they are surrounded by those they trust. This group of friends is caught at a crossroads, not knowing if what they are doing is the right way to go. Many have tried their hands at something, but ultimately gave up to continue loitering around their corner convenience store. When one of their friends, who found success in leaving the small town of Burnfield becoming a rockstar, happens to come home for a show, the group's equilibrium goes off-kilter as they face what could be. Some feel that if they had applied themselves they could have been successes as well, while others see the shell of a man their buddy has become after being sucked into the machine. The return home opens everyone's eyes to the situation they are in and for better or worse changes the way they decide to continue living their lives. While a drama, there are many funny scenes. When a few of them begin talking about the reason Pony became a rockstar, to be able to tell the world his thoughts, to have someone listen to him, they say how rough it is to feel like no one can hear what they are saying. Through the entire conversation Giovannu Ribisi's Jeff is trying to be heard chiming in with his own ideas. The irony of the situation may be a bit heavy-handed, but it is also very true to form. Ribisi shines in this role as an intelligent youth who has never applied himself, always being content with hanging around his troubled friends. He soon realizes that the freedom he has is more important than selling out for fame and fortune, it is the people he cares about that keep him going, not the material things in life he could have. Steve Zahn is again brilliant in one of his earlier roles. He plays the idiot comedian to perfection while also evolving into someone who uses his cheery disposition for success. You begin to see that he knows exactly who he is and is in control at every moment. It's a shame he now only gets roles that are one-dimensionally that stupid guy there for laughs. It is also a pleasure to see Office Space alum, Ajay Naidu in a good role, touching on the bigotry of American small town life. The success his character is having, while not being American, prays on the jealousy of those who feel their heritage should entitle them to happiness. The lazy toughs around town would rather pick on the foreigners for working hard instead of doing the time themselves. Rounding out a very good cast is Dina Spybey and Nicky Katt. Spybey is great in a tough role. She is the lackey friend of one of the main group members and tries to fit in. It seems that every time she begins to connect, she is ultimately left alone. The depression her character feels comes through at all times; the despair of someone that troubled around you without knowing how to help is tough. There is so much going on this night that her anguish gets pushed aside until there is no turning back. Then there is Nicky Katt who makes the film. He is an intellectual trapped in the body of a jock who has partied and been king of the town for too long. He sees the world around him for what it is and hates himself for living amongst the grime. Toying with the emotions of his best friends, he seems to have a death wish to just end his suffering. No longer the star football player, the character of Tim can't apply his intellect constructively and instead uses it to help the others while self-destructing himself. Linklater is one of the most consistent directors working in and on the fringe of Hollywood today. His films always seem to have a message coming through them, trying to uncover a truth of life. Every one of his characters is true to themselves and connecting with humanity at every step. SubUrbia is so much like his other smaller films that I was surprised to see it was written by and based from a play from Eric Bogosian. I am a fan of his acting work, but after seeing this I might finally wipe the dust from my copy of Oliver Stone's Talk Radio and check it out. Also, maybe I will turn on the movie that started it all for Linklater, Slacker, and see the true evolution he has taken. Hopefully SubUrbia will find its own way to DVD, maybe even the Criterion Collection will release it to join the other Linklater masterpieces it already has.",
         "Eric Bogosian has written and performed extensively for the theater. I have seen him as a solo performer, as well as his plays \"Talk Radio\" and \"SubUrbia\". Having admired his work on the stage, one wondered what kind of treatment those plays would get. Luckily, he was able to adapt them to the screen, himself. I had seen this movie when it came out, so when it showed on cable recently, I decided to take another look. While it's a work that perhaps was marketed as a comedy, this work is much more than that. This film dares to take a look at one of the most prevalent problems in the American society. Richard Linkletter was perhaps the right choice for directing \"SubUrbia\" since he has a keen eye for the \"slackers\" in our society. These individuals are perhaps puzzling to a lot of other cultures, but it appears there's a trend among young people all over that come from homes where parents and children inhabit different worlds. The phenomenon of the American suburban youth is well presented in this movie where there is no parent authority around to supervise what these kids are doing. The culture of hanging out without any purpose, or meaning, is a problem in that in most cases, leads into drugs, sex, and alienation from what is known as normal society, thus creating people like the ones this movie is portraying. In a way, Hollywood films have added to this anti hero sub culture, so prevalent in the country. When there are no strong figures either at home, school, or government, young people tend to gravitate toward friends who they feel comfortable with, shying away from reality and responsibility. It is the convenience store owner, a Pakistani, who puts things in perspective. While these kids are wasting their time, he is working on his degree and will make something out of himself, which is a theme that has been explored by other great American writers, like Arthur Miller, in \"A Death of a Salesman\". The same American dream, where everything is possible, is wasted in these young people. At the same time, it's the immigrant who wants to make that dream a reality in his life because he has experienced hard times in his own country. Mr. Linkletter's choice of a cast is brilliant. He gathered the talents of Giovanni Ribisi, Parker Posey, Amie Carey, Nicky Katt, Steve Zahn, Jayce Bartok, Dina Spybey to give life to these lost souls in search of identity in the heart of the American counter culture that is generated by the boredom of the suburbs and the erosion of the family in this country."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Detour Filmproduction"
      ],
      "summaries": [
         "Five young losers spend their days and nights wasting their lives away, hanging out in parking lots and occasionally mentioning that they might want to make something of themselves... someday. On this particular night, they are visited by an old high school friend who has escaped their suburban town to become a pop star.",
         "Richard Linklater's \"SubUrbia\" is a film adaptation of Eric Bogosian's play about five teenagers who have nothing to do with their lives, who decide to hang out at \"the corner\" (outside of a convenience store) one night. On the same night, their friend, the only successful one out of the group who is now a rock star, has returned to his hometown to revisit his old surroundings. The friends decide to hang out and talk about inane subjects, while realizing that they've been wasting their lives away doing nothing, and that they actually want to make something of themselves, but ultimately, few of them do.",
         "A group of suburban teenagers try to support each other through the difficult task of becoming adults."
      ],
      "budget": 0
   },
   "movielensId": 1454,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-07",
      "dvdReleaseDate": null,
      "directors": ["Richard Linklater"],
      "runtime": 121,
      "movieId": 1454,
      "title": "SubUrbia",
      "mpaa": "R",
      "actors": [
         "Jayce Bartok",
         "Amie Carey",
         "Nicky Katt",
         "Ajay Naidu",
         "Parker Posey",
         "Giovanni Ribisi",
         "Samia Shoaib",
         "Steve Zahn",
         "Dina Spybey-Waters"
      ],
      "imdbMovieId": "0120238",
      "originalTitle": "SubUrbia",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["sHxxbcI8g6A"],
      "plotSummary": "A group of suburban teenagers try to support each other through the difficult task of becoming adults.",
      "tmdbMovieId": 28059,
      "avgRating": 3.20803,
      "releaseYear": "1996",
      "numRatings": 822,
      "posterPath": "/7PdRbG09K9JHYyOwwCSn3OdJb0N.jpg"
   }
}