{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "exorcism",
            "id": 2626
         },
         {
            "name": "straitjacket ",
            "id": 2882
         }
      ],
      "imdb_id": "tt3420392",
      "video": false,
      "title": "The House of Exorcism",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Leandro",
               "gender": 2,
               "credit_id": "535aab3fc3a36830b0000322",
               "name": "Telly Savalas",
               "profile_path": "/pN5jiLdHKzDXn8GZHPnJHwdax1H.jpg",
               "id": 10169,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Lisa Reiner",
               "gender": 1,
               "credit_id": "535aab55c3a36830b9000339",
               "name": "Elke Sommer",
               "profile_path": "/eVx7RyK6FCBb1HZEdyx5UacL0Df.jpg",
               "id": 17844,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Father Michael",
               "gender": 2,
               "credit_id": "535aab6cc3a368308a000341",
               "name": "Robert Alda",
               "profile_path": "/cPCGFfxFV1dEi8vhwX36Uz9qOR5.jpg",
               "id": 95732,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Sophia Lehar",
               "gender": 1,
               "credit_id": "535aab80c3a3683099000303",
               "name": "Sylva Koscina",
               "profile_path": "/jwkKgsRYHIkHMSNcGAeuYA829i3.jpg",
               "id": 21606,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Countess",
               "gender": 1,
               "credit_id": "535aab9ac3a368308a000347",
               "name": "Alida Valli",
               "profile_path": "/p2aBH2hXwNPjQGRNuMUfycku0Za.jpg",
               "id": 15385,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "George",
               "gender": 2,
               "credit_id": "535aabb0c3a3683099000307",
               "name": "Gabriele Tinti",
               "profile_path": "/gxk5AeoGvkYV1pIXe2Jrk39W4xV.jpg",
               "id": 31991,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Carlo",
               "gender": 2,
               "credit_id": "58813e00c3a3681470003054",
               "name": "Espartaco Santoni",
               "profile_path": "/3eBciU8vicbbdr64UbFUsRJSt65.jpg",
               "id": 33827,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Francis Lehar",
               "gender": 0,
               "credit_id": "5ac4b05dc3a3682d9a04a1a3",
               "name": "Eduardo Fajardo",
               "profile_path": "/tREl0gqM9L2X334p2EDx6ETpBtM.jpg",
               "id": 100409,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Shopkeeper",
               "gender": 0,
               "credit_id": "5ac4b0750e0a260c01047818",
               "name": "Franz Von Trueberg",
               "profile_path": null,
               "id": 2015258,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Max",
               "gender": 0,
               "credit_id": "5ac4b08b9251416018086eaf",
               "name": "Alessio Orano",
               "profile_path": null,
               "id": 44972,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Lisa's friend",
               "gender": 0,
               "credit_id": "5ac4b1b2925141271204ae73",
               "name": "Kathy Leone",
               "profile_path": null,
               "id": 1116336,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Anna",
               "gender": 0,
               "credit_id": "5ac4b1ca92514126be04aaaf",
               "name": "Carmen Silva",
               "profile_path": null,
               "id": 1024344,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "American Tourist (archive footage) (uncredited)",
               "gender": 1,
               "credit_id": "5ac4b1f30e0a260c3904e9ba",
               "name": "Andrea Esterhazy",
               "profile_path": null,
               "id": 39431,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "535aabdfc3a36830910002f3",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "535aabf4c3a36830a0000340",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "535aac15c3a36830b9000340",
               "name": "José Gutiérrez Maesso",
               "profile_path": null,
               "id": 100856,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535aac2dc3a36830a9000339",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535aac5cc3a368308a00034f",
               "name": "Carlo Savina",
               "profile_path": null,
               "id": 29389,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "535aac71c3a3683084000359",
               "name": "Carlo Reali",
               "profile_path": "/fc5LTUaduPG1U24UB7jqQgg12j6.jpg",
               "id": 44967,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "535aac87c3a3683091000307",
               "name": "Nedo Azzini",
               "profile_path": null,
               "id": 1313634,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "535aac9bc3a36830a0000347",
               "name": "Rafael Ferri",
               "profile_path": null,
               "id": 1298627,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "535aacf3c3a36830a000034f",
               "name": "Franco Tocci",
               "profile_path": null,
               "id": 1313635,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "54713033c3a3686375000248",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5471303e92514112e7006411",
               "name": "Alberto Cittini",
               "profile_path": null,
               "id": 44970,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5471304bc3a3681286000382",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55285748c3a3681f500002d0",
               "name": "Cecilio Paniagua",
               "profile_path": null,
               "id": 40896,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.511771,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 262871,
      "vote_count": 2,
      "budget": 0,
      "overview": "A total re-edit of Mario Bava's gothic classic Lisa and the Devil (1973) for US release in 1975. Cheesy exorcism scenes were shot to try to capitalize on the success of The Exorcist (1973).",
      "similar": [
         11586,
         394830,
         289416,
         9552,
         241258,
         486659,
         184346,
         48171,
         293670,
         11026,
         280016,
         334536,
         63727,
         27770,
         16235,
         23827,
         91586,
         561,
         805,
         755
      ],
      "original_title": "The House of Exorcism",
      "runtime": 92,
      "poster_path": "/hlzJrT4nvANENWLDMwBDtcprYS5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Roxy Film",
            "id": 101,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Leone International",
            "id": 1913,
            "origin_country": ""
         }
      ],
      "release_date": "1975-04-02",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Mario Bava",
         "Alfredo Leone"
      ],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Alberto Cittini",
         "Alfredo Leone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3420392/",
      "coverLink": null,
      "actors": [
         "Telly Savalas",
         "Elke Sommer",
         "Sylva Koscina"
      ],
      "reviews": [
         "Lisa and the Devil was a film directed by Mario Bava, it had a limited cinema release in 1973 but was soon withdrawn by producer Alfredo Leone as he did not know how to market this strange, lyrical film. It sat on the shelf for a couple of years with no distributer interested in picking it up, so Leone decided to attempt to make some money back on his investment. Two years later he returned with one of the participants from the first film, Elke Sommer - along with Robert Alda and Carmen Silva, neither of whom appeared in Lisa and the Devil at all – and, with Bava's assistance, directed a batch of new, completely unrelated material. He then merged these new scenes in with parts from the original film. The resultant movie became known as The House of Exorcism. Like some other Italian films from the time like L'anticristo it clearly was designed to cash in on the success of The Exorcist, as it is basically a rip off of this film in many ways. Lisa and the Devil, on the other hand, had nothing to do with demonic possession and its story is completely unrelated. The biggest single problem with The House of Exorcism is that if you are already familiar with Lisa and the Devil it's very difficult disassociating the scenes from that movie from their original intent. It simply just makes you want to see them again in their original context. When I watch The House of Exorcism, it's the new bits that interest me; the stuff from Lisa is just simply distracting. The contrast in tone between the two sections of film is massive, where the stuff from Lisa is beautiful and fairly subtle; House of Exorcism is relentlessly coarse and goes for shock value. It's pretty much an exploitation movie and the sequences from Lisa and the Devil do not fit into its tone and story-line well at all. In fairness, it may work a lot better – maybe even quite well – if you have never seen the original film but I suspect most people going into this already have and that's essentially the problem. The new material is set mainly in a hospital where Lisa (Elke Sommer) is confined after being possessed by the Devil. A priest (Robert Alda) tries to exorcise her. The new scenes are typified by Sommer barking out obscenities at Alda. There's lots of green vomit, a vision of a beautiful naked woman and\u0085frogs. The new stuff's not that bad really and would have no doubt have made an entertaining schlockfest if it had constituted the full movie. But, as it is, the majority of the run-time is made up of re-used material from Lisa and the Devil, which is distracting and useless if you have seen the original already. Nowadays, with the original film readily available, The House of Exorcism has become no more than a curiosity piece. Fun to watch for the added possession material but as a whole it doesn't work anymore.",
         "This is the page for \"House of Exorcism\", but most people have confused this film with the Mario Bava masterpiece, \"Lisa & the Devil\", which explains the ridiculously high rating for this, \"House of exorcism.\" When \"Lisa & the Devil\" was shown at film festivals in the early 70's, it was a critical success. Audiences responded well to that gorgeous, Gothic horror film. Unfortunately it was a bit ahead of it's time, and was considered too unusual, and not commercial enough for mass consumption. No distributor would buy it. So producer Alfredo Leone decided to edit 'Lisa', seemingly with a chainsaw, by removing just about half of the original film, and adding new scenes, which he filmed two years after the original product! It is important to note that Bava had little to do with these new, hideous additions, so technically \"House of Exorcism\" is not a Bava film. The original product is a slow, dreamy, classy production. A few minutes into the film, the viewer is jarred out of this dream world, as suddenly we see Lisa, (two years older, and with a very different haircut), begin to writhe on the ground, making guttural sounds and croaking epitaphs like \"suck my co@k\", etc. Subtle, huh? And the film continues like this, jumping back and forth between a beautiful, visual film, and a grade Z \"Exorcist\" rip-off. Leone was trying to incorporate these shock scenes, while keeping some semblance of a story intact. He failed miserably. When the choice was made to basically destroy \"Lisa and the devil\", Bava himself refused, saying that his film was too beautiful to cut. He was right, and it must have been quite sad for this artist to see all his work destroyed and flushed down the toilet. It was many years before the original \"Lisa and the Devil\" was seen again, re-surfacing on late night television. I had seen \"lisa\" long before i saw this new version, and it was downright disturbing to witness one of my favorite films \"vandalised\" in this way. Worth seeing only for curiosity sake. Otherwise avoid this insidious disaster like the plague.",
         "The House of Exorcism (1973) is an interesting patch work film. After the disappointing attendance figures for LISA AND THE DEVIL, Producer Alfredo Leone re-shot and incorporated new footage into LISA AND THE DEVIL making the movie into an Exorcist knockoff. The ploy worked and Leone made his money back plus a profit. HOUSE OF EXORCISM is about a Bavarian woman named Lisa who's possessed by a restless spirit. The things that the spirit does and says puts Pazul/Linda Blair to shame. The spirit has a very foul mouth and uses creative dialog to motivate the priest into helping her. The movie is nowhere near the classic as LISA AND THE DEVIL but it's quite entertaining. However, the two movies are very different and they don't match together very well. One of the better Exorcist wannabes. Highly recommended for camp value.",
         "Okay, so I saw 'House Of Exorcism' the re-edited version of Mario Bava's 'Lisa And The Devil' with the added cash in footage. I've heard great things about the original version, but I haven't yet had an opportunity to view it so I'm sticking with this, the \"unauthorized\" cut. Bava must have had mixed feelings about it seeing as his name has been removed as director. I can understand why, because I'm a little ambivalent about it myself. This is in many ways a confusing mess of a movie, but overall enjoyable enough and holds the interest until the end. Elke Sommer, who had previously worked with Bava on the uneven 'Baron Blood', plays an American tourist apparently possessed by the Devil. While being exorcised by a priest (Robert Alda), we cut to a series of events involving her being picked up hitch hiking and taken to a mysterious mansion populated by various nuts, not least of which is Leandro, the mysterious lollipop sucking butler (yep, you guessed it, Telly Savalas). This footage (recycled from the original 'Lisa And The Devil') is either hallucination or flashbacks or both, and Leandro may or may not be the Devil. It's all very hard to tell. Frankly, you won't even care. Even so, I enjoyed this movie even if it was incoherent most of the time. It may not be genuine Bava but it's a lot of fun, and I must admit I preferred it to 'Baron Blood'. Take from that what you will.",
         "Blasphemous declaration: I prefer watching this re-edit than the original Lisa and the Devil. Well, I am not going so far as to suggest this is a better made film, just that I have some difficulties with the constant (although very pretty) dreamlike structure of the original. This version clearly comes under the heading of 'exploitation' and can therefore be ignored because of the extremes of language, sexuality and blasphemy on display. I just happen to feel that the editing together is remarkable and adds a little sense to the picture. It may not be a pretty sight but there is real vigorous here and Elke Sommer desires a medal for going back and performing those remarkable scenes. I realise I am upsetting not only fans of the original but at the same time fans of the original Exorcist. So be it, in my opinion, the original is what Bava intended and always hoped to get made but being magnanimous was able to assist in creating an alternative movie, perhaps more able to gain an audience. There again, it seems, maybe not.",
         "\"Lisa and the Devil\" is one of director Mario Bava's best films. It's extremely atmospheric, very scary and has an amazing artistry about it that you just don't expect from a horror film. Sadly, however, some dirt-bags decided to take Bava's excellent film and re-edit it into a new movie! So, they sloppily filmed some new scenes (complete with LOTS of nudity) and pasted it and the original picture together to make it an incoherent mess of a movie. It's terrible in most every way and I am pretty sure Bava must have been ticked about this. Fortunately, while this movie truly is terrible, it IS available on the DVD with \"Lisa and the Devil\" so you can compare the two and appreciate the original film. It's really an interesting experience and one you can do (at least in the USA) by streaming both versions of the movie.",
         "This film just happened to be on one night and I felt like watching a horror film I had never seen before so I decided to give it a try. Granted, I am not overly fond of exorcism films and this movie clearly copies from The Exorcist movie; however, the film is also has a bit of a mystery film to it and the elements of other genres as well. Actually, it almost seems at times as if they were making two different films. One that is basically copying The Exorcist and another is more like one of those ambiguous haunted house tales like Web of the Spider and they met up and decided to slam the two films together and add Telly Savalas to both films to unify them. So, the movie is a bit of a mess as there are many questions left unanswered, but at the same time it does hook one into watching as one is not sure exactly where it is going. They clear up the strange mansion segment, but they really do not offer all that much insight as to why other things were occurring. The story has a tour group roaming the streets and checking out a mural. One of the group hears some music and follows it to a bizarre shop where two men are discussing a mannequin. The woman asks how much the box is playing the music and is told it is not for sale. She then gets a good look at one of the men who bears a striking resemblance to the devil that was in the mural she had seen earlier. She promptly leaves and the \"devil\" does something that cause her to collapse and act in a way that suggests that she is now possessed. A priest and a friend she has just met get her to a hospital where the friend promptly leaves and a character that seemed as if she was going to be important is never seen again. Meanwhile, the lady who is now essentially possessed is still roaming the streets, only the streets are very empty and she gets a ride with a quarreling couple and they end up at a strange house with a strange man and his mother and the butler who is the man at the shop, basically the devil. So we see the film on two fronts as the woman witnesses the strange happenings at the mansion and the priest fights to save her from her possession. The movie is a bit easier to watch thanks to the fact it is done on two fronts, but it also makes the film seem a bit of a mess. The friend looked like she would play an important role simply exits the film making her dialog and appearance in the film seem pointless. A scene with the priest also seems a bit strange and only in the film to show some nudity (granted it was some good nudity). The ending was a bit vague as it is one of those scenes that focus on something random and the camera freezes and you are like \"huh?\" Still, it does make you wonder where it is going with the two story arcs that are occurring, though one may feel disappointed at how they are finally connected. In the end, the movie is basically a combination of the very well known, The Exorcist and the lesser known film, Web of the Spider with Telly Savalas thrown in with his trademark sucker in tow.",
         "\"Lisa and the Devil\" (1972) was dumb. \"The House of Exorcism\" (1975) is even dumber, which is unfortunate because it had the potential to use the \"Lisa and the Devil\" footage to create an interesting story. Instead we merely get Elke Sommer as a woman possessed by . . . well, we don't know, but she sure uses a lot of profanity and vulgarity. Robert Alda is a priest who sees Sommer collapse and realizes that she is possessed. The new footage is intercut with scenes from \"Lisa and the Devil,\" so we assume that the story will somehow intersect with Lisa's present possession. Unfortunately about three-quarters of the way through the film we realize that no such suturing will occur, and we have only Lisa screaming profanities, spitting green vomit and frogs, and Alda looking pained. \"The House of Exorcism\" also features gore and nudity that was cut from \"Lisa and the Devil,\" as well as adding nudity to the Alda sequence, making this version much more explicit than Bava's original 1972 film. In the end, Alda realizes that he shouldn't be trying to exorcise the spirits that possess Lisa but must instead exorcise the house in which all the evil occurred. He does so and the movie ends. As a film cashing in on \"The Exorcist\" devil-cycle, \"The House of Exorcism\" is mildly interesting. For entertainment purposes it's pretty lousy--despite Bava's beautiful cinematography. (By the way, Bava had his name removed from this film and instead used the pseudonym Mickey Lion.)",
         "Okay, I like this film. It's one of my guilty pleasures. In 1984, I saw this in a cinema on Grand Street in NYC on a double bill with Terror in the Aisles. I liked House of Exorcism, but even as I watched it, I realized something was up. It seemed disconnected in some way. I read about Lisa and the Devil, and finally got to see it at the Film Forum in NYC in the 1990s. I liked it. But something was .... missing. Flash forward to 2017, and I watched both Lisa and the Devil and House of Exorcism in the same night. Cha...you know what? House of Exorcism is, in some ways, better. More entertaining. Definitely more commercial. It's got Robert Alda, more naked women, frog spewing, gutter language, and some creepy new footage. Go for it!",
         "Tourist Lisa Reiner (Elke Sommer) is on holiday in Spain when she falls victim to demonic possession. A concerned priest, Father Michael (Robert Alda) attempts to exorcise the evil being. The House of Exorcism is Mario Bava's commercial flop Lisa and The Devil re-edited with new Exorcist-style footage by a producer desperate to recoup some of his investment. Many regard this new version as a travesty, a work of art butchered in the name of money (indeed, The House of Exorcism was a financial success). I, on the other hand, think that both versions stink: Lisa and The Devil is a dull, languorous ghost story that makes very little sense and House of Exorcism is a dull, languorous Exorcist rip-off that also makes very little sense. If pushed to choose, I would actually give the edge to The House of Exorcism for being a couple of minutes shorter, having more gratuitous nudity (including full frontal from Carmen Silva, who tries to tempt the priest), and for getting Elke Sommer to puke up a rubber frog.",
         "The House of Exorcism (1975) ** (out of 4) Mario Bava's dream project was LISA AND THE DEVIL, which many people think is his masterpiece. Unfortuantly, the film couldn't land a distributor so the producer was left with a large cash issue because the film simply wasn't going to make money. After the success of THE EXORCIST the producer, against Bava's wishes, decided to bring back some of the cast members and turn this into a rip-off. I think a lot of people are afraid to say it fearing they're be attacked for not being \"true\" fans but I personally found LISA AND THE DEVIL to be rather slow and boring. Yes, it looked beautiful and had a terrific atmosphere but it's pretty easy to see why no one would want to distribute it. With that said, I can understand the producer doing whatever he had to in order to sell the film and I've read that this re-edited version went on to make millions across the globe so here's the perfect example of mainstream people wanting trash and not art. The new scenes here are all rather silly and especially the dialogue, which tries desperately to match THE EXORCIST's profanity laced rants. I'm not going to lie, I found a lot of this trash talking to be rather funny. As you'd expect, there's also a lot of green puke going around and this here even manages to work in some frogs. Some added nudity was also placed in the film just to top off the exploitation. So, is THE HOUSE OF EXORCISM any good? Of course not but it remains an interesting bit of movie history due to the production history. The film is mildly entertaining due to how silly it is and you at least have to give the producer credit because the new footage mixes in quite well with the old.",
         "Although one might understand producer Alfred Leone's concern at having bankrolled a film nobody wanted to distribute, i.e. Mario Bava's LISA AND THE DEVIL (1973) – one is more likely to empathize with the latter's unenviable plight of having to defile his own \"masterpiece\" by inserting lots of ludicrous (and ludicrously irrelevant) footage in the hopes of turning it into a marketable commodity (albeit shot by Leone himself and Bava's own son Lamberto and credited to one \"Mickey Lion\" on U.S. prints)! Diabolism in cinema had hit a peak with the artistic and commercial success of William Friedkin's THE EXORCIST (1973) and both Hollywood and European film-makers were quick to jump on the bandwagon: from Jesus Franco's EXORCISM and LORNA THE EXORCIST to Ovidio G. Assonitis' BEYOND THE DOOR (1974) to Alberto De Martino's THE ANTICHRIST (all 1974)! Due to the tenuous devilish connection in Bava's original version (but, then, Telly Savalas' inherently comic persona there simply makes no sense vis-a'-vis his would-be unholy influence on Lisa in the reworking!), the chance for Leone to add his own product to the mix must have seemed too good to pass by. Needless to say, this necessitated that additional scenes be shot featuring a demonically-possessed protagonist (which star Elke Sommer reportedly shot for free!), a cleric literally picked off the streets of Toledo who just happens to be adept at exorcism (a visibly distraught Robert Alda) and the resulting gravity-defying shenanigans at the hospital (witnessed by Leone's own daughter Kathy, whose role as Sommer's travelling companion was consequently enlarged). Apart from all this, a few erotic or violent sequences are far more graphically rendered in this version, while even Carlo Savina's previously lyrical music score has been punched up by ominously percussive beats over the opening credits\u0085 Even though I do not quite rank LISA in the top-tier of the director's works myself, the desecration done to it by this travesty is still too great to overlook or forgive: incidentally, I had twice previously watched it in English, but this latest viewing came by way of the Italian-language 'original' culled off \"You Tube\" and, for what it is worth, it does play better this way\u0085meaning that the obligatory profanities spouted by Sommer at the befuddled Alda are even funnier now! To be fair to it, none of the various EXORCIST copycats that I have come across treated the possession theme with the requisite seriousness and spirituality, preferring to indulge in rotating heads, levitations and copious vomit-spewing. While, as already intimated, THE HOUSE OF EXORCISM does include some of these (Sommer even throws up live frogs!), its 'backstory' – that is, the footage pertaining to LISA AND THE DEVIL and which the leading lady insists has already happened and is happening again, whatever that is supposed to mean – has little bearing on Lisa's current condition\u0085and how can she be strapped to a hospital bed while simultaneously living a nightmare at the villa?! For good measure, Alda is lamely shown – like Jason Miller's priest in the Friedkin film – to have issues with the Catholic faith that could jeopardize his 'mission' due to personal tragedy (cueing an entirely gratuitous full-frontal nude seduction by his conveniently much younger dead spouse!). Leone may have removed slow, uneventful passages from LISA (not that the substitutes were any good, and the change in tone between one setting and another is most jarring) but he also ruined a number of judicious edits: most notable are a cut from Alida Valli's face to an eerie fish sculpture that forms part of a fountain, and the dinner sequence in which Telly Savalas' own visage is reflected in the contents of a spilled wine bottle on the floor – now overlapping into a puddle of green vomit beside the hospital bed – only to return to this very point (highlighting Savalas' nervously apologetic reaction to his slip-up) at the next instalment of Lisa's 'recollections'! In the end, it is worth noting that, much as would again prove the case with Enzo G. Castellari's THE LAST SHARK (1981; deemed plagiaristic and refused distribution in the U.S. at the time of release) and JAWS III (1983), the climax of THE HOUSE OF EXORCISM would in return be ripped off by Hollywood for the no-less maligned (and, oddly enough, itself be subject to tinkering in the hope of salvaging it) EXORCIST II – THE HERETIC (1977)!",
         "first of all, let me say that i am reviewing the \"house of exorcism\"/Robert Alida version of this film. secondly, let me clarify my own beliefs. i am not a religious person. in fact, if anything i am Anti-religious. i am an agnostic who has been influenced by a secularized version of Buddhist philosophy. Buddhism is a philosophy for me, not a religion. however, the Buddhist concept of the \"middle way\" has made a great impression on me. (i take the concept of the \"middle way\" seriously, much more seriously than most people take their religions.) the \"middle way\" is neither \"good\" nor \"evil.\" following the middle way might be conceptualized as treading a path BETWEEN good and evil. or, better yet, it could be seen as an ESCHEWAL of both good and evil, as a resolve to seek moderation with aesthetics and pragmatism (but NOT morality) as one's guides. i do not believe in any kind of morality PER SE. there are other ways to look at life apart from the \"moral\" view. one can look at life in aesthetic terms, a la Oscar Wilde. one could also look at life via the (essentially amoral) \"pragmatic\" viewpoint of john Dewey and Richard Rory. we have Oscar Wilde, john Dewey and Richard Rory (not to mention Derrida and Foucault and, of course, shakyamuni). we really don't need Jesus, moses, or Muhammad. third, i have never seen \"the exorcist\" and have no desire to do so. my interest is in films on the periphery, NOT on mainstream bourgeois cinema. \"house of exorcism\" may have been influenced by \"the exorcist,\" but it should be judged as an entirely separate work of art and the elements it contains should not be viewed in relation to anything contained in the earlier film. now that that's out of the way, on to \"house of exorcism.\" HOE could be read as a formulaic horror film, as a story of good against evil in which \"good\" emerges as triumphant. or it could be read against the grain as a story of evil against good in which evil wins out in the end, or in which at the very least the concepts of good and evil are discredited or called into question. the most sympathetic character in the film is Elinor, the young lady whose spirit inhabits the body of Lisa. Elinor is an essentially amoral (yet not unenlightened) woman. when she was alive she satisfied her lust, having sex in order to sate her physical urges instead of for reasons of love. her impotent husband was, shall we say....less than understanding of her needs, and ended up killing her. so Elinor has returned from the dead and is now (understandably) somewhat bitter. the specter of Elinor is a \"truth teller.\" she tells the truth, or at least the truth AS SHE KNOWS IT, and the only truth that any of us know is the truth AS WE KNOW IT. she uses a kind of \"streetlevel postmodern\" speech, employing the \"f bomb\" and other \"swear\" words. (i would call them \"aware\" words, words of awareness and sensitivity meant to express strong emotions.) some people (inhibited prudes) may be offended by this language, but as far as i am concerned the point is that we SHOULDN'T be offended by this kind of speech or by ANY kind of speech. (if we insist upon \"being offended,\" we should reserve that prerogative for ACTIONS, not for mere SPEECH ACTS.) the father asks Elinor where she comes from and she says \"from far way, from incest and adultery.\" (which may be factually correct.) the priest is unsatisfied with this answer and she says that she came \"from a c*nt.\" (brilliant. truer words have never been spoken.) at one point, the father labels Elinor as \"evil.\" Elinor responds by saying that the priest and his church are evil. now i would part company with Elinor at this point. i don't think that the church is evil....just unnecessarily and, as such, counterproductive. as for labeling any person or spirit as \"evil\": the universe is a moral vacuum. \"good\" and \"evil\" are BOTH figments of the bourgeois imagination. but i can see why some people might find the church and its hypocrisy to be so distasteful that they are tempted to label them as \"evil.\" the film ends with the priest performing an exorcism at the mansion where Elinor once lived. one could view this ritual as a \"triumph,\" as an act sending Elinor's \"evil\" spirit back to \"Hell.\" but from a pragmatist/methodologically rational point of view, i would see the exorcism as an empty ritual. Elinor lives on, or at least what she stands for survives. Elinor lives on as the symbol not of evil but rather of an amoral yet enlightened pragmatism........ p.s.--earlier in the film we see telly savalas (the \"devil\") sucking a lollipop. in the last scene, we see Robert Alida wielding an aspergillum (holy water dispenser)....which looks quite a bit like a lollipop. now, as far as i am concerned, the telly savalas character represents not \"evil\" but rather a kind of \"pragmatism\" (whether one views it as \"enlightened\" pragmatism, \"unenlightened,\" or somewhere in between is up to you). in any case, the lollipop of telly savalas is much more powerful than any priest's holy water dispenser. (\"who loves ya, baby?\")",
         "I remember well in 1975 when in High School a bunch of us went to see House of Exorcism-which we all thought was better than the much overrated The Exorcist. Many years later I got a video of what was called Lisa and the Devil, which I thought was the same film under a different title. However this is NOT the case: Lisa and the Devil and House of Exorcism are two different films. When I saw the Lisa and the Devil version it had nothing to do with the film of my youth, and I was quite disappointed as I found that version quite boring-there was no possessed Elke Sommer or the Robert Alda priest character (although Telly Savalas was marvellous in both versions). Luckily a recent DVD had BOTH versions, so I was able to see the original after many years. Unlike many of the reviews, I think House of Exorcism was the better of the two, and I am not alone, even though posted reviews seem to like the \"Lisa\" version better. NOW here comes the truth, which most people don't know. When the original film(Lisa and the Devil)was finished in 1973, it was shown to many distributors-none of whom thought it was any good. Two years later the \"redone\" version, called House of Exorcism, was made-using much of the same footage of the other film but now having Elke Sommer possessed by the devil and in hospital, and having Robert Alda as the priest who not only exorcises the devil from Elke, but also the house where she had stayed. The same distributors who had shown no interest in the other film now decided to go ahead with House of Exorcism-and the result was that it made millions (at a time when it was still only a dollar or two to see a film). The bottom line here is that millions of people went to see House of Exorcism, while nobody went to see Lisa and the Devil. So in conclusion I guess that all the distributors, as well as millions of filmgoers, preferred House of Exorcism!",
         "The original Lisa and the Devil is lush and stylish but oddly pointless and dull story of the people who must to spend the night in the lush and stylish but dangerous Italian villa. Elke Sommer is the heroine, a tourist called Lisa, and Telly Savalas a Devil disguised as a butler. Later the new footage was added and the result is trashy and foul-mouthed La Casa dell'esorcismo (House of the exorcism), one of the many copies of the trashy and foul-mouthed plot less wonder The Exorcist. Lisa and the Devil is a movie worth of decent 6/10, House of the Exorcism (like the original The Exorcist) is garbage and only worth of lousy 2/10.",
         "House of Exorcism (1972) is a film we noticed circulating the underground film circuit lately so we had to snag a copy for ourselves. This 93 minute tape actually bears a lot in common with The Exorcist and has many memorable moments. Telly Savalas plays a lollipop-sucking demon (seriously) who aids in trapping a group of people in a \"house of evil.\" Incest, rape, murder and wax dummies seem to be the main focus of this film and there is actually extra footage added to our particular copy (mostly a house-cleansing nearest the end). All in all, this film was not that exciting. This film was originally released as \"Lisa and the Devil,\" it was re-edited in 1975 and renamed to House of Exorcism with Robert Alda as a priest (and believe us, without those particular scenes, the movie would have sucked)."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Euro America Produzioni Cinematografiche",
         "Leone International",
         "Roxy Film"
      ],
      "summaries": [
         "Tourist Lisa Reiner faints on the street and is taken to hospital. She shows disturbing sings of demonic possession, so a priest, Father Michael, is brought in to perform an exorcism. However, he first tries to investigate how she became possessed by the devil in the first place. Despite the fact that her personality has now completely blended together with the demonic entity within her, she none the less tells him about the horrific experiences she lived through in the mansion of a twisted Spanish aristocratic family with a dark secret and the devil she met there.",
         "A total re-edit of Mario Bava's gothic classic Lisa e il diavolo (1973) for US release in 1975. Cheesy exorcism scenes were shot to try to capitalize on the success of The Exorcist (1973)."
      ],
      "budget": 0
   },
   "movielensId": 145400,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-04-02",
      "dvdReleaseDate": null,
      "directors": [
         "Mario Bava",
         "Alfredo Leone"
      ],
      "runtime": 92,
      "movieId": 145400,
      "title": "The House of Exorcism",
      "mpaa": "",
      "actors": [
         "Telly Savalas",
         "Elke Sommer",
         "Robert Alda",
         "Sylva Koscina",
         "Alida Valli",
         "Gabriele Tinti",
         "Espartaco Santoni"
      ],
      "imdbMovieId": "3420392",
      "originalTitle": "The House of Exorcism",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "f8UHebNYpn0",
         "sAXtzRlZ6KQ"
      ],
      "plotSummary": "A total re-edit of Mario Bava's gothic classic Lisa and the Devil (1973) for US release in 1975. Cheesy exorcism scenes were shot to try to capitalize on the success of The Exorcist (1973).",
      "tmdbMovieId": 262871,
      "avgRating": 2.33333,
      "releaseYear": "1975",
      "numRatings": 3,
      "posterPath": "/hlzJrT4nvANENWLDMwBDtcprYS5.jpg"
   }
}