{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "ambush",
            "id": 502
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "soldier",
            "id": 13065
         }
      ],
      "imdb_id": "tt0058618",
      "video": false,
      "title": "The Road to Fort Alamo",
      "recommendations": [],
      "backdrop_path": "/rHAaMVgvVdB9ePtgIX8dAl0lmew.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Bud Massedy / Lieutenant John Smith",
               "gender": 2,
               "credit_id": "52fe4bb9c3a36847f8211469",
               "name": "Ken Clark",
               "profile_path": "/3juksb2A0jrmN1HaYWXVKAkF3rX.jpg",
               "id": 89162,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Janet",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f821146d",
               "name": "Jany Clair",
               "profile_path": "/lUzA320tRqWjKXNuODK415XZTwy.jpg",
               "id": 223402,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Carson",
               "gender": 2,
               "credit_id": "52fe4bb9c3a36847f8211471",
               "name": "Michel Lemoine",
               "profile_path": "/1PQhPCucetah1i5IyM8wLePmhny.jpg",
               "id": 85985,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Mrs. Collins",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211475",
               "name": "Adreina Paul",
               "profile_path": null,
               "id": 1086883,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Slim / Sgt. Jim Kincaid",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211479",
               "name": "Alberto Cevenini",
               "profile_path": null,
               "id": 98493,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Captain Hull",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f821147d",
               "name": "Antonio Gradoli",
               "profile_path": null,
               "id": 935071,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Sgt. Warwick",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211481",
               "name": "Gustavo De Nardo",
               "profile_path": "/2TUeATCid0ET1TaXPi9e5dai5QD.jpg",
               "id": 98509,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Mr. Silver",
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211491",
               "name": "Gérard Herter",
               "profile_path": "/qapc4tM3zQtrAiKE5DR22S6ZfkH.jpg",
               "id": 80692,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bb9c3a36847f8211435",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f821143b",
               "name": "Livia Contardi",
               "profile_path": null,
               "id": 50783,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211441",
               "name": "Lorenzo Gicca Palli",
               "profile_path": null,
               "id": 237341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211447",
               "name": "Lorenzo Gicca Palli",
               "profile_path": null,
               "id": 237341,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f821145f",
               "name": "Achille Piazzi",
               "profile_path": null,
               "id": 99510,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211465",
               "name": "Pier Luigi Torri",
               "profile_path": null,
               "id": 54562,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f8211487",
               "name": "Demofilo Fidani",
               "profile_path": null,
               "id": 1046507,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb9c3a36847f821148d",
               "name": "Claudio Ragona",
               "profile_path": null,
               "id": 1089647,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "555621a79251412ff900175c",
               "name": "Piero Umiliani",
               "profile_path": null,
               "id": 91546,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58466489c3a368481301d673",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5846648fc3a3684c0d0006fa",
               "name": "Ubaldo Terzano",
               "profile_path": null,
               "id": 98483,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.221486,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 117567,
      "vote_count": 4,
      "budget": 0,
      "overview": "A lone rider comes across a dying soldier, the victim of an Indian attack, who gives him a paper authorizing the payment of $150,000 to the U.S. Army. The rider gathers some colleagues who disguise themselves as soldiers and who take the paper to a bank. They get the money but a shoot-out occurs, an old woman is killed, and the gang acrimoniously splits up. Later some members of the gang meet up with some real U.S. Cavalry soldiers and together they must fight off new Indian attacks.",
      "similar": [
         563,
         949,
         792,
         4421,
         1865,
         3176,
         19995,
         75656,
         374720,
         10590,
         429,
         9667,
         9472,
         12162,
         13809,
         1701,
         120,
         411,
         602,
         810
      ],
      "original_title": "La strada per Forte Alamo",
      "runtime": 90,
      "poster_path": "/pNPQ0e8hW32tvqMiUclQ832VRQL.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Comptoir Français du Film Production (CFFP)",
            "id": 5779,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Achille Piazzi Produzioni Cinematografica",
            "id": 8946,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Protor Film S.r.l.",
            "id": 10449,
            "origin_country": ""
         }
      ],
      "release_date": "1964-10-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 78,
      "synopsis": "The Wild West, 1864. Bud (Ken Clark) is a drifter riding though sparse terrain, only to discover a carriage of murdered Union soldiers. Stopping to survey the damage, he notices that one of the men is still alive. The soldier dies before he can explain what happened, but Bud notices that he is clutching a satchel in his fingers. Upon opening the satchel, Bud finds a requisition form for $150,000. He then rides into a nearby town to report his discovery. Upon his arrival in Wagon City, Bud arrives at the police station where he is told that the sheriff is taking a siesta and cannot be disturbed. While waiting in the nearby saloon, Bud observes a car game being played between a wealthy, well-dressed man named Mr. Silver (Gerard Herter), and a young gunslinger named Slim (Alberto Cevenini). Bud notices that Mr. Silver is cheating, and confronts him. A bar fight ensues between the crooked Mr. Silver and Bud. At this point, the sheriff arrives. But since Bud is a stranger in town who is raising an accusation against a \"well respected citizen\" like Mr. Silver, the pompous and easily fooled sheriff ignores Bud and tries to arrest him. However, Bud manages to escape from the saloon and rides out of town with his new side-kick, Slim. Bud and Slim hide out in the nearby desert, and their friendship strengthens as they reveal more about themselves. Bud explains that he refused to take sides during the war, and when he left his Kentucky ranch for a brief period, he returned to find his family slaughtered and his house burned to the ground by unknown assailants. In compensation for this, the U.S. government gave him a worthless promissory note. Bud now wonders aimlessly, looking for an opportunity to make some money so he can rebuild his ranch. Slim explains that he knows an outlaw named Carson (Michel Lemoine), who might be of some financial help. In a meeting between Bud and Carson, Bud is wisely suspicious of him, but his anxiousness to re-build his ranch causes him to ally himself with the dubious man. Remembering the murdered Union soldiers, Bud tells Carson and his men about his find and together they pilfer the uniforms and pretend to be Union soldiers. Taking the requisition form with them, Bud, Slim, Carson and his men ride into Wagon City where they go to the bank and pressure the teller into handing them the $150,000. The plan nearly works, but Carson's impatience results in him drawing a gun on the teller, and killing him in cold blood, as well as several innocent bystanders at the bank. The men flee back to the cave, which is Carson's hideout, with the stolen money. Now aware that they are all wanted outlaws, Bud suggests that it would be best if they divide the loot and all of them go their separate ways. But instead, the greedy Carson knocks Bud and Slim unconscious, leaving them behind while he and his men ride off with all the ill-gotten cash for themselves. Left for death on a rural country road, But and Slim are discovered by a passing troop of Union soldiers. As they are still dressed in blue Union outfits, they are accepted as soldiers by the autocratic and slow-witted commanding officer Captain Howard (Antonio Gradoli). However, the wily Sergeant Carter (Gustave De Nardo) is not so easily fooled, and immediately senses that Bud and Slim are not who they claim to be. But Howard refuses to let Carter make any background check on the men and keeps him in check. Carters suspicions are confirmed when he slyly forces Bud to admit that he attended military school in Annapolis, Maryland which is actually a Naval academy. But Carter is astute enough to realize that Bud and Slim are decent people, so he treats them with dignity and respect while deciding what to do about them. Bud and Slim plan to escape from their Union companions when they reach Fort Alamo, where their subterfuge will surely be discovered. But, Bud decides to stay for a while when he realizes that the Ozark Indians have targeted the convoy they are in. Bud explains to Slim that innocent women and children are among the Union convoy and he could not live with himself if they were senselessly slaughtered. Slim reluctantly agrees to stay out of loyalty to Bud. A little later, Bud and Slim are joined by Carson, who is the sole survivor of an Indian attack, and who is still in possession of most of the stolen money. Because Carson is still wearing his stolen Union uniform, Bud is able to convince Captain Howard that Carson is a member of his own troop. Soon after, Captain Howard puts the entire convoy in danger when he insists on passing thought an Ozark cemetery. Sergeant Carter does his best to explain that passing though such territory will incite the Indians. But Captain Howard takes offence at being questioned, and blithely kicks aside the religious paraphernalia. True to Carters expectations, the troops soon find themselves in an all-out war with the Indians. Meanwhile, a romance blossoms between Bud and Janet (Jany Clair), a young woman who is being transported to jail at Fort Alamo for killing an officer who assaulted her. She tells Bud that her major crime is that she is desirable in a world dominated by brutally amoral males. This is emphasized when she is attacked and nearly raped by Carson, who is put under arrest by Sergeant Carter. Under guard, Carson makes an appeal to Bud to help him escape so they can split the money between them if they abandon the others. But, Bud is not interested in Carson's ploy knowing the amoral outlaw will kill him out of greed to have all the money for himself. As the soldiers prepare for a massive Indian attack, the Ozarks bait a very clever trap. Having stolen some of the money from Carson's dead men, which is useless to them, the Indians float the notes down a nearby stream. The greedy troops react as expected, running into the open to fish the money out of the water, and many are killed. With dwindling numbers, Bud recognizes that their situation is hopeless as it stands, so he puts his life on the line by leaving the convoy and seeking help. Leaving the stolen money in Carter's care, Bud mounts a horse and leaves into the dark of night. The next morning, the Indians attack. Taking advantage of the ensuing chaos, Carson clubs Sergeant Carter over the head and steals the money. Slim attempts to stop Carson, but gets shot dead. Shortly afterwards, Bud arrives with a fresh detail of Union solders from Fort Alamo. Faced with such strong opposition, the Indians retreat. Bud finds Slim's dead body and learns from Sergeant Carter that Carson was responsible. Bud catches up to Carson and a fistfight ensues. Carson seems to get the upper hand, but gets shot dead by Janet, and is reunited with Bud. Bud hands the stolen money back to Sergeant Carter, who thanks them for helping the US Army retrieve the money, and he lets both of them go. Bud and Janet ride off together to make a fresh start for themselves. But Janet states out that their problems are not necessarily resolved for he is broke once again. Bud optimistically states: \"well get the money. Nice, clean money.\"",
      "writers": [
         "Livia Contardi",
         "Lorenzo Gicca Palli"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0058618/",
      "coverLink": null,
      "actors": [
         "Ken Clark",
         "Jany Clair",
         "Michel Lemoine"
      ],
      "reviews": [
         "I've only seen each of the 3 Bava spaghetti westerns once (neither among his best work or his preferred genre), but I disagree with many people who considered Nebraska Jim to be a better film. Strictly from an entertainment sense, Arizone Bill (La Strada per Fort Alamo) held my interest noticeably better (though admittedly the copy of Nebraska Jim that I saw had severely distraction issues with audio). While Nebraska Jim seemed like a mostly cookie cutter extended western TV show episode you'd expect to see on American TV, Arizona Bill was more like a 2nd rate Good Bad and Ugly wannabe with its stolen civil war funds plot line and a group of criminals that ranges from a couple of more 'decent' people who are criminals to outright despicable violent ones. It was just slightly different enough to make it more interesting to me and it felt more like a Bava film. Maybe if I rewatch these films a few more times I'll notice things I've overlooked which will explain others' preferences, but I'm a bit skeptical that that will happen. It's not the greatest or most original film, but it kept me entertained and my biggest complaint is with regards to the 'romantic' subplot and its cheesy accompanying music (at least on the copy I saw, I'm not sure if it was or wasn't the original music used). Bava isn't always at his best when trying to provide romance/love interests to his films. Black Sunday (La Maschera del demonio) is IMHO the quintessential Italian Gothic horror film and a favorite of mine, but even his admirers have to admit that in that great film, the 'undying love' of the young Dr. Gorobec for Katia -- whom he has just met one day previous -- is a bit silly and one-dimensional and at times almost laughably overly melodramatic. I took off one point for the botched romance portions of Arizona Bill, though I did like it overall more than Nebraska which ended up with the same 5/10 score from me. The copy of the film I saw was an English language widescreen version from an old somewhat glitchy videotape source with a runtime closer to the USA or German cuts. I'm not sure what was excised from the original 90 minute cut listed on IMDb and maybe when TL's big Bava book comes out it will tell us what is or isn't missing from the cut I saw, but I hope one of the cult DVD companies (like Image, Anchor Bay or Blue Underground) pick up both this title and \"Nebraska Jim\" sometime in the near future to provide Bava's fans with a good legitimate uncut DVD release with the best transfer possible considering whatever film elements exist. I'm sure the underrated director's fans would welcome quality releases of all his films, even the lesser known and hard to find ones where Mario took over directorial duties from a previous director leaving a project.",
         "Italian movie director Mario Bava is best known for his horror movies. But during his career he found time to direct other kinds of movies, including spaghetti westerns, \"The Road To Fort Bravo\" being one such example. The movie is pretty unknown, and it's easy to see why. Throughout it has the feeling of a slapdash production. The budget was obviously pretty low, so the production values are pretty tacky, from the costumes to the poor special effects. Bava seems unable to show any visual flair on this project, except for a few scenes that take place in caves. But the main problem with the movie is the script. It feels like a first draft, with many scenes feeling rushed or unfinished. This quickie enterprise is capped with a pretty bad musical score by Piero Umiliani, which consists of 60s style music at its worst. The best that can be said of the movie is that its running time is fairly short.",
         "I think the thing that impressed me the most about Mario Bava's first spaghetti western outing here is how utterly pedestrian most of the proceedings were. Another distinguished commentator here has it right: This is the Italo western boys before the spaghetti idiom was truly established dressing up in their snappy cavalry duds & playing cowboys and Indians just like we used to do out at the sandlot near my cousin's summer house, only we didn't have such nice costumes. Ken Clark is a decent enough he-man leading heroic noble Shatterhand type, apparently roaming the west looking for trouble to straighten out. He finds it when a young novice finds himself taken by a card shark (the priceless Gerard Herter, Max from CALTIKI) and the two have to fight their way out of town & take up with a band of rogues who are targeting a bank to knock over. For reasons that escape me they find themselves mistaken for cavalry officers and join up with a U.S. Army element sent to the region to pacify the local Indian tribes so that the nice Caucasian people can build towns, railroads, brothels, and prosper without having to take the local Natives into consideration. It's pretty much the usual stuff for a low budget early 1960s western and indeed the story is decidedly lacking on the traditional spaghetti western histrionics, which many fans may be disappointed by. I however got a kick out of seeing Mario Bava constrained to a pretty straight forward story, complete with a heroic ride to the rescue at the end with the bugles & everything. If it sounds like a let down, students of Bava's unique visual style will actually be pleased with a series of nighttime scenes obviously filmed on a sound stage with that traditional Bava artsy minimalism emphasizing color and texture over rugged authenticity. This was made in the period before Sergios Leone and Corbucci more or less invented the spaghetti aesthetic, qualifying it more as a Euro western than a proper spaghetti outing. The film is also somewhat unique in that like Joe Lacey's FURY OF THE APACHES it actually involves the Native American peoples -- albeit somewhat clumsily and in a stereotypical fashion -- rather than swarthy Pistoleros shooting at Clint Eastwood's mule. I found it to be a fascinating movie perfect for a snowed in Saturday afternoon, though some may question how convinced Bava was of his own artistic vision for the movie. It's more sort of a compromise between his KILL BABY KILL cinematics and traditionalist Oater mentalities, with some truly stunning shots framed when seen in the proper widescreen ratio. The one thing I kept thinking is that here is a surprisingly ordinary low budget western that's been photographed like a Gothic study in spots, and the rather bloodless nature of the goings on mean that it's a rare example of an Italo western that was meant for all ages rather than a grim cartoon for adults. I kind of like it, and found it a much more rewarding viewing experience than Bava's 1970 final spaghetti ROY COLT & WINCHESTER JACK, though fans of the genre will probably prefer his NEBRASKA JIM. 6/10",
         "\"La strada per Fort Alamo\" was shot in Italy, not in Spain like most Italian westerns. Director \"John Old\" alias Mario Bava was obviously influenced by the John Ford classics such as \"She Wore A Yellow Ribbon\", all just in a much cheaper B-movie style; it has almost nothing in common with the typical \"Django pays for your funeral\" kind of western. This movie has a good script with good dialogs; it's about a bandit who has to pose as an army officer after he got caught wearing a stolen uniform. When Indians attack, he gets opportunity to show he is a brave good guy. One word to the disappointed Bava fans: surely the master had to earn a living, too, and this is what he did for it. You don't shoot masterpieces like \"Danger: Diabolik\" or \"Mask of Satan\" every week. More important than such comparisons is that \"La strada per Fort Alamo\" is a good quality western in a traditional way, and if you don't expect more than that, it's well worth watching.",
         "THE ROAD TO FORT ALAMO is the first spaghetti western directed by Italian genre maestro Mario Bava, but as a film made in 1964 it has more in common with the American westerns of the 1950s than the Sergio Leone-influenced genre films of the late 1960s onwards. The film itself is routinely plotted but turns out to be a lot of fun regardless, with an action-heavy template meaning that there's barely a slow moment to be had throughout. The film's protagonist is played by the strapping Ken Clark, a familiar face from the Eurospy films he made during the mid 1960s. He's massive here, dwarfing his opponents in the various fight scenes, and he acquits himself well with the material, having a natural flair for the genre. He reminded me of Richard Harrison in many ways. His character undergoes quite the journey in this film, with many plot twists, double crosses, and betrayals en route. The film's antagonists are the usual bunch of murderous Native Americans and gold-hungry double-crossers. There's plenty going on throughout and the film, which was shot in Italy rather than Spain, looks very nice. Bava's skill comes in the night-time scenes which have the great use of colour that the director is well noted for. THE ROAD TO FORT ALAMO might not be a classic, but as a serviceable spagwest it works a treat.",
         "Director Mario Bava usually has a visual flair which helps elevate his movies above their \"Grade B\" genres. He doesn't seem to have his heart in this project, however. It plays out in a routine fashion and about the only scene which might linger in the memory has the Indians putting dollar bills adrift in a river in order to lure cavalry soldiers out into the open. Ken Curtis, who always deserved better, makes an attractive hero but the script gives him little to work with.",
         "The Road to Fort Alamo (1964) ** (out of 4) Solo rider Bud Massadey (Ken Clark) comes across a Calvary massacre. A dying man gives him a paper payment of $150,000 that is to be paid to the U.S. Army. Bud teams up with a gang to get the money but he's double crossed by a card cheat. Soon Bud and his partner are rescued by another Calvary and sure enough he eventually catches up with the cheat. Mario Bava's THE ROAD TO FORT ALAMO is a pretty bland and boring Spaghetti Western that really doesn't have too much going for it. The Italian director was hitting a very high mark during this point of his career and it's easy to call this the least entertaining movie he made during this period. It's really too bad that this movie seems to have been a \"director-for-hire\" project as there's just not too much life here. Technically speaking, the film is certainly well-made and it appears that Bava got the job done. That job was getting the film completed without it going over budget. The film was obviously shot with a shoe-string budget and the director at least manages to make it look very professional. I thought the costumes were terrific and Bava at least managed to make the atmosphere seem as if you were back in this era. With that said, the story itself was just rather boring and none of the characters were all that interesting either. Heck, I'd go even further and say that the entire film was just rather bland to the point where you didn't care about anything that was going on. The performances were okay for the most part but none of them really jumped off the screen to grab your attention.",
         "This is my second time watching the first of Bava's infrequent (and most atypical) ventures into Western territory. Coming at the start of the genre's idiosyncratic \"Euro\" (and, in the long run, highly influential) overhaul, it obviously feels the least like your typical \"Spaghetti\" Western – even if, truth be told, MINNESOTA CLAY from the same year (on which Bava is reputed to have worked but which is credited to one of the formula's undisputed masters i.e. Sergio Corbucci) is more successful in this regard! Anyway, the movie under review is considered among Bava's minor efforts – and rightly so; yet, it is nowhere near as bad as some make it out to be and, to my mind, preferable to his comedy-oriented last entry in the field, namely ROY COLT AND WINCHESTER JACK (1970; with which, as it happens, I will be re-acquainting myself presently). As I said, the film mainly looks to the American model – albeit following its more routine examples – for inspiration, but that is not necessarily a bad thing. Interestingly, Bava starts off proceedings with an inconsequential 'prologue' (featuring favourite \"Euro-Cult\" villain Gerard Herter) involving a crooked card game and an amusingly sleepy bartender. Rugged (and immensely hirsute) hero Ken Clark – who would return for the recently rewatched SAVAGE GRINGO (1966), which Bava helmed albeit without credit – is a Southern landowner who lost everything to a Northern onslaught during the Civil War, and whom he now plans to get back at by posing as a Union officer and 'withdraw' a cache of money from the bank destined to the enemy forces! Unluckily for him, the associates he picks up for the job – led by another familiar face, Michel Lemoine – prove greedy and leave him and his closest ally for dead\u0085or, more precisely, at the mercy of the marauding Osage Indians! Eventually, the two men are saved by a Southern Army wagon train bound for the titular outpost so that they are forced to keep up the military disguise; ironically, they are soon joined by Lemoine himself, the sole survivor of the renegade gang who also had a brush with the redskins but is still in possession of half the stolen sum. Clark, whose uniform bears the higher rank, now delights in rubbing his treacherous ex-partner the wrong way – but, in fact, neither has given up on the loot and each intends making off separately with it at some point. However, the Osage come down en masse on the small unit (which includes a by-the-book Colonel, a wily Second-in-Command soon in on Clark's ruse but willing to keep it to himself, the priggish wife of the Colonel at the fort and even a female prisoner – earthy redhead Jany Clair naturally comes to fall for the brawny charms of, and senses a misfit kinship with, our protagonist – being escorted there for trial) and they have to stay on and fight it out! A nice touch has the Indians make flower arrangements via the 'confiscated' paper money (which to them is useless) and send them floating down river in order to lure avaricious soldiers out into the open and slay them; this idea then comes into play again at the inevitable showdown between Clark and Lemoine. While Bava was clearly ill-at-ease within this particular genre (unflatteringly billed in this instance as John Old), here at least he incorporates his recognizable colour palette to effective use; Carlo Savina's score, then, includes the token ballad warbled over the opening credits and, surprisingly, cues which bear an uncanny resemblance to those composed for the soundtrack of the 1957 Mexi-Horror classic THE VAMPIRE!",
         "First of all I am a fan of Italian films but \"the road to Fort Alamo\" is one of the worst Italian western that I've seen. It was shot without means. The interiors have a fictitious background with a blue light and fictitious cactus so as to simulate the desolate and barren moorlands of Texas or Arizona, but any clever viewers can note that the real vegetation is made of oak (Q. pubescens) and other plants typical of European climate. Some shots (cowboys that are riding) are accelerated, Bud, the leading actor, cannot ride, therefore he was always replaced by a double. The Indians are awkward, always shot at a distance. I admit the shots are the only thing which make this movie credible, but the others contemporary films like \"le pistole non discutono\", \"preparati la bara\" are masterpieces compared with this one. I give it 4 out of 10."
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Comptoir Français du Film Production (CFFP)",
         "Piazzi",
         "Protor Film S.r.l."
      ],
      "summaries": ["A lone rider comes across a dying soldier, the victim of an Indian attack, who gives him a paper authorizing the payment of $150,000 to the U.S. Army. The rider gathers some colleagues who disguise themselves as soldiers and who take the paper to a bank. They get the money but a shoot-out occurs, an old woman is killed, and the gang acrimoniously splits up. Later some members of the gang meet up with some real U.S. Cavalry soldiers and together they must fight off new Indian attacks."],
      "budget": 0
   },
   "movielensId": 145406,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1964-10-24",
      "dvdReleaseDate": null,
      "directors": ["Mario Bava"],
      "runtime": 90,
      "movieId": 145406,
      "title": "The Road to Fort Alamo",
      "mpaa": null,
      "actors": [
         "Ken Clark",
         "Jany Clair",
         "Michel Lemoine",
         "Adreina Paul",
         "Alberto Cevenini",
         "Antonio Gradoli",
         "Gustavo De Nardo",
         "Gérard Herter"
      ],
      "imdbMovieId": "0058618",
      "originalTitle": "La strada per Forte Alamo",
      "genres": ["Western"],
      "youtubeTrailerIds": ["zu86eFh5IVQ"],
      "plotSummary": "A lone rider comes across a dying soldier, the victim of an Indian attack, who gives him a paper authorizing the payment of $150,000 to the U.S. Army. The rider gathers some colleagues who disguise themselves as soldiers and who take the paper to a bank. They get the money but a shoot-out occurs, an old woman is killed, and the gang acrimoniously splits up. Later some members of the gang meet up with some real U.S. Cavalry soldiers and together they must fight off new Indian attacks.",
      "tmdbMovieId": 117567,
      "avgRating": 2,
      "releaseYear": "1964",
      "numRatings": 1,
      "posterPath": "/pNPQ0e8hW32tvqMiUclQ832VRQL.jpg"
   }
}