{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "fugitive",
            "id": 10718
         },
         {
            "name": "illegal immigrant",
            "id": 12423
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "love hotel",
            "id": 213809
         }
      ],
      "imdb_id": "tt3876372",
      "video": false,
      "title": "Kabukicho Love Hotel",
      "recommendations": [334557],
      "backdrop_path": "/vCKrC2G9yz0sTW25kOYDI7Cq6Og.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Toru Takahashi",
               "gender": 2,
               "credit_id": "54bfe08392514148f000d621",
               "name": "Shota Sometani",
               "profile_path": "/fOij6t03KcQt3CbLb4y1MQmJyJO.jpg",
               "id": 1018944,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Saya Iijima",
               "gender": 1,
               "credit_id": "54bfe0919251413635009c87",
               "name": "Atsuko Maeda",
               "profile_path": "/uvj7TVxGa16iromcXO8plpZfsgf.jpg",
               "id": 1029275,
               "order": 1
            },
            {
               "cast_id": 27,
               "character": "Satomi Suzuki",
               "gender": 1,
               "credit_id": "5933a4239251417e32018903",
               "name": "Kaho Minami",
               "profile_path": "/880kV8RgyqmCMUfsQ67XBSmSJQO.jpg",
               "id": 87644,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Hena",
               "gender": 1,
               "credit_id": "54bfe0abc3a368404600aa6c",
               "name": "Lee Eun-woo",
               "profile_path": "/p2iB33iGUZYs86bJks72l09UBWo.jpg",
               "id": 1200395,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Yasuo Ikezawa",
               "gender": 2,
               "credit_id": "54bfe0b3c3a3687c40009726",
               "name": "Yutaka Matsushige",
               "profile_path": "/oTV8MFQSTVSroDAImu9WHpp4QA4.jpg",
               "id": 27782,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kazuki Takenaka",
               "gender": 2,
               "credit_id": "54bfe0b8c3a368145e00df57",
               "name": "Nao Omori",
               "profile_path": "/diWmt4sCQSMeBcZg2sQXqb1d7kd.jpg",
               "id": 58604,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Hinako Fukumoto",
               "gender": 0,
               "credit_id": "54bfe0d192514148b000ce23",
               "name": "Miwako Wagatsuma",
               "profile_path": "/8t8eRNoCC3A1IMdTniCO0cNLcrC.jpg",
               "id": 1328340,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Miyu Takahashi",
               "gender": 0,
               "credit_id": "54bfe0e4c3a368389c009780",
               "name": "Asuka Hinoi",
               "profile_path": null,
               "id": 1416593,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Masaya Hayase",
               "gender": 0,
               "credit_id": "54bfe0f492514148f000d628",
               "name": "Shugo Oshinari",
               "profile_path": "/8zms5e9AOTvkhClPaKsINnWc0xR.jpg",
               "id": 96473,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Masashi Kubota",
               "gender": 2,
               "credit_id": "54bfe0fec3a3681da0006a2f",
               "name": "Tomorowo Taguchi",
               "profile_path": "/3Gf8GXzl2ZsvOQnW5DOi65Nsk16.jpg",
               "id": 67091,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Kagehisa Amemiya",
               "gender": 0,
               "credit_id": "54bfe1059251416e60009061",
               "name": "Jun Murakami",
               "profile_path": "/oTs9nRxMxGS9EOXWffj5ain5dmO.jpg",
               "id": 9671,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Rikako Fujita",
               "gender": 1,
               "credit_id": "54bfe10e9251413635009c96",
               "name": "Aoba Kawai",
               "profile_path": "/uwco35JnqlaFLM4nmy5BMsmI8i0.jpg",
               "id": 464228,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Ryuhei Shinjo",
               "gender": 0,
               "credit_id": "54bfe114c3a368389c00978a",
               "name": "Tomu Miyazaki",
               "profile_path": null,
               "id": 1112407,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53f2ca530e0a2675a90078f7",
               "name": "Ryuichi Hiroki",
               "profile_path": "/7XZ5fdUUzPdNuGSZIgkseKUbv0q.jpg",
               "id": 78268,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "554c2e42925141402a0007d6",
               "name": "Haruhiko Arai",
               "profile_path": null,
               "id": 1061130,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "554c2e55c3a3685e5b00344f",
               "name": "Futoshi Nakano",
               "profile_path": null,
               "id": 1167178,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "554c2e7692514140e9000731",
               "name": "Mikihiko Hirata",
               "profile_path": null,
               "id": 1043631,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2e92925141400b000734",
               "name": "Yasushi Minatoya",
               "profile_path": null,
               "id": 1464865,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2ea79251410877000fb9",
               "name": "Kazuya Naito",
               "profile_path": null,
               "id": 1464866,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2eb692514140e9000738",
               "name": "Naoya Narita",
               "profile_path": null,
               "id": 1029723,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2ed0c3a36824cd0006da",
               "name": "Osamu Fujioka",
               "profile_path": null,
               "id": 1464867,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2ee29251413fcf000739",
               "name": "Mikihiko Hirata",
               "profile_path": null,
               "id": 1043631,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2ef5c3a3685e55003a4d",
               "name": "Tadayoshi Kubo",
               "profile_path": null,
               "id": 1028451,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "554c2f0a9251410877000fd3",
               "name": "Ayano Tsuji",
               "profile_path": null,
               "id": 1464868,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "554c2f1dc3a3685e55003a57",
               "name": "Atsuhiro Nabeshima",
               "profile_path": null,
               "id": 1029248,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "554c2f30c3a3685e4c0039ff",
               "name": "Atsuhiro Nabeshima",
               "profile_path": null,
               "id": 1029248,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "554c2f5492514140c3000748",
               "name": "Meichô Tomiyama",
               "profile_path": null,
               "id": 1464869,
               "department": "Lighting",
               "job": "Gaffer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.075635,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 287493,
      "vote_count": 12,
      "budget": 0,
      "overview": "This erotically charged drama from Japanese director Ryuichi Hiroki (Vibrator) traces the intersecting stories of a group of employees and visitors at a notorious \"love hotel\" in Tokyo's red-light district.",
      "similar": [
         50270,
         1904,
         201088,
         5503,
         260346,
         213,
         1724,
         26973,
         4141,
         110415,
         82695,
         2118,
         78,
         86331,
         291805,
         136400,
         241554,
         114,
         345,
         496
      ],
      "original_title": "さよなら歌舞伎町",
      "runtime": 135,
      "poster_path": "/E1YF095i6S5DFsQHSolKhGYTPV.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Fool",
         "id": 52900,
         "origin_country": ""
      }],
      "release_date": "2014-09-07",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.sayonara-kabukicho.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ryuichi Hiroki"],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Haruhiko Arai",
         "Futoshi Nakano"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt3876372/",
      "coverLink": null,
      "actors": [
         "Shôta Sometani",
         "Atsuko Maeda",
         "Roy 5tion"
      ],
      "reviews": [
         "Sayonara Kabukicho was all full during the 2015 Hong Kong International Film Festival so when I knew it was on public release, I rushed to see it. Well, despite the exotic poster and the eye-catching translated title of \"Kabukicho Love Hotel,\" it is a humanistic look at many frustrated but hardworking Japanese who happen to wind up in a Love Hotel in Kabukicho, a red light district in Shinjuku, Tokyo. Throughout the movie, we can see the director and playwright have great empathy and respect for all the characters – who suffer from different frustrations and setbacks in life and end up in transition in Hotel Atlas, where guest can rent a room by the hour or by the night. But it is exactly here that they find their direction and move on with confidence and dignity. The movie basically revolves around five couples whose lives are connected with this Love Hotel: the hotel manager (Shota Sometani) is stuck here although he aspired to work in a five-star hotel. He also owes his girlfriend's parents 1.4 million yen for his tuition fees so he did not tell her he works here. His girlfriend, played by AKB48 singer Atsuko Maeda, is an aspiring sing-song writer trying to secure a record contract but is confused as how to go about it. One of the frequent guests to the hotel is a Korean call girl working for the last day before she returns to Korea to start her own business. She only tells her live-in boyfriend she works as a hostess so as to save up money to marry and return to Korea. Her boyfriend, a chef at a Korean restaurant by night and a student at day, has his own secrets. A middle aged woman working in the hotel as cleaning lady has her own secret and her identify is exposed only when another guest's secret affair is exposed. A runaway girl ends up in the hotel with a yakuza simply for food and rest in exchange for sexual favor. But during the course of their interaction, things changes. It seems every character has some secrets and that's why they are in this hotel. Yet when we know them better, we feel sorry for them. We feel their predicament and want to help in some ways. The movie runs 125 minutes but it does not feel long. Pacing is good and the way the stories are told is quite engaging. In the course of 24 hours, we seem to see the real lives of the characters, all of them some kind of underdogs in our society who either has lots of bad luck or has been abused by other people in power. Yet all of these characters have dreams and pride and deal with adversity with lots of self-respect. Hence the love hotel episode is just a transition in their life before they go on to pursue their dreams. In a way, it is a comforting tribute and encouragement to the tsunami- beaten Japan, as depicted by the hotel manager's sister and her ending up in the hotel. In the end of the movie, all the main characters say goodbye to this love hotel and move on with their lives. The progress is smooth and acting good. Great character development and excellent intercept of witty dialogues, comical scenes and moving moments. Excellent exemplification of the Japanese resilience.",
         "Relationships fall apart, or become stronger, when dalliances and alternate lives are uncovered. This insightful and vibrant film explores the connections, both tenuous and binding, between a variety of couples who enter the Tokyo underworld. A red-light district hotel manager confronts two unexpected and shocking guests, a Korean escort underestimates the strength of love, and fugitives from justice spar with detectives with secrets of their own that they wish to keep under earth. The film delves into the secret lives of the characters with combined humor and seriousness. It is a difficult task, yet the director manages it deftly. The emotional impact is created in part by hand-held camera work. I am not usually a fan of this, yet here it works extremely well. Some touching film themes revolve around how much we are willing to fight for our partners and how far we are willing to go in letting them make their own choices. \"Every one of your little gestures,\" a woman tells her boyfriend at a possible point of no return \"meant so much to me.\" I see much of my life in each of the characters, and that is part of the beauty of this film. I felt like I entered the life of each character and was not simply watching them. Seen at the 2014 Toronto International Film Festival.",
         "'Kabukicho Love Hotel' is another example of how English titles are often designed to draw in Western audiences. 'Sayonara Kabukicho', the original title, is much more befitting, though that wouldn't suggest sex scenes to the ignorant among us. Young Toru is supposedly an ordinary young man trying to make his way in the world, with plans to marry his musician girlfriend. It just so happens he manages a love hotel in Kabukicho, Shinjuku's slightly seedier part of town. Pulling an extended shift, we follow a day in the life of the hotel, with focus on a select few that tread its dirty carpets, all seeking an escape route. Cleaner, Suzuki has just two days to wait before the case dangling over her fugitive lover will be closed, allowing them to come out of hiding. 'Delivery girl' Hena hopes to return to Korea to open a boutique having now saved enough money. And young Toru, with aspirations of fronting a top hotel, spends the day discovering his younger sister is a porn star and that his girlfriend is taking less moral routes to the top. None are there by design, nobody is, and it is now time to break free. This is not a film about sordid sex, therefore, but more about escape, as the Japanese title would suggest. Though Ryuichi Hiroki's early days as a pinku eiga director are put to use, with a couple of rather graphic fruit 'n' veg fondling scenes accompanying some more tame efforts, in the overarching storyline. These scenes are perhaps not necessary, as we all know what goes on behind these closed doors, though thankfully they don't detract from the film's narrative flow. The character's are written to know that their situation isn't a great one, all aware that their place of occupation is below society's moral standards. This self-awareness creates sympathy with the characters that fate has led them here, with the film acknowledging that everyone has their reasons for ending up in a place like this, and they probably don't need to be spoken about. This film, and indeed the Japanese title, are perhaps in response to the 2013 awarding of Tokyo as host city for the 2020 Olympics. Much as London sort to bulldoze most of Stratford and ensure that the Tube actually worked for once for 2012, Tokyo intends to paint a good international image for itself. Therefore, Kabukicho, sitting in the heart of Tokyo's Shinjuku hub, will be taken to the cleaners; the area ridden of all the seedy activities and establishments. By the film's conclusion, escape from the district brings with it a sense of relief and looking to the future. Whether the same will be said for the city at large, is another matter. politic1983.blogspot.co.uk",
         "After watch this movie, these two things came to mind: -Not everything is as it seems. -First world big cities provide you with the facility to change your life in a minute. The script does a couple of \"concessions\" that transform the movie in a lower rated one, but still is worthwhile to watch it; but bear in mind that this is not a straight \"pink movie\"; it s more of a mixed drama-comedy with tints of pink, as Ryouchi Hiroki well know about how to do it. I liked the way that the director shows us kind of ingenuity in the development of the characters. The actors are all well known in the Japanese industry."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Fool, The"],
      "summaries": ["Over one day at this love hotel in Shinjuku, Tokyo - where guests have the choice of staying for a short time or overnight - the dreams and desires of these characters intersect while aspiring for something greater."],
      "budget": 0
   },
   "movielensId": 145596,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2014-09-07",
      "dvdReleaseDate": null,
      "directors": ["Ryuichi Hiroki"],
      "runtime": 135,
      "movieId": 145596,
      "title": "Kabukicho Love Hotel",
      "mpaa": null,
      "actors": [
         "Shota Sometani",
         "Atsuko Maeda",
         "Kaho Minami",
         "Lee Eun-woo",
         "Yutaka Matsushige",
         "Nao Omori",
         "Miwako Wagatsuma",
         "Asuka Hinoi",
         "Shugo Oshinari",
         "Tomorowo Taguchi",
         "Jun Murakami",
         "Aoba Kawai",
         "Tomu Miyazaki"
      ],
      "imdbMovieId": "3876372",
      "originalTitle": "さよなら歌舞伎町",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["cpx8V6wP9dk"],
      "plotSummary": "This erotically charged drama from Japanese director Ryuichi Hiroki (Vibrator) traces the intersecting stories of a group of employees and visitors at a notorious \"love hotel\" in Tokyo's red-light district.",
      "tmdbMovieId": 287493,
      "avgRating": 3.64286,
      "releaseYear": "2014",
      "numRatings": 7,
      "posterPath": "/E1YF095i6S5DFsQHSolKhGYTPV.jpg"
   }
}