{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "dance studio",
            "id": 217879
         }
      ],
      "imdb_id": "tt0087759",
      "video": false,
      "title": "Murder-Rock: Dancing Death",
      "recommendations": [
         29908,
         90590,
         26181,
         71538,
         42786,
         70922,
         48855,
         39889,
         29169,
         40461,
         43915,
         29790,
         28848,
         74325,
         64725,
         5434,
         65588,
         42499,
         98027,
         40474
      ],
      "backdrop_path": "/zeRsDiHuyvZc4T2ehFgJ1D1jeXy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Candice Norman",
               "gender": 1,
               "credit_id": "52fe4583c3a36847f80cb815",
               "name": "Olga Karlatos",
               "profile_path": "/6f9S4wKxnBx4n5HRx8mY7n1a6s3.jpg",
               "id": 50744,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "George Webb",
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb819",
               "name": "Ray Lovelock",
               "profile_path": "/4pJv4V1e7ovrsF4x8jqQ90EbX8q.jpg",
               "id": 105337,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lt. Borges",
               "gender": 0,
               "credit_id": "52fe4583c3a36847f80cb81d",
               "name": "Cosimo Cinieri",
               "profile_path": "/galqxHGNu27XjcrsDs7hcKWHlqq.jpg",
               "id": 78714,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Prof. Davis",
               "gender": 0,
               "credit_id": "52fe4583c3a36847f80cb821",
               "name": "Giuseppe Mannajuolo",
               "profile_path": "/rHWOm8teq8PzCo6SdZ4gOYSfBX6.jpg",
               "id": 239659,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dick Gibson",
               "gender": 2,
               "credit_id": "566a75f092514173fc008574",
               "name": "Claudio Cassinelli",
               "profile_path": "/zDrq4Hq2t9uCqJOJSX3zfBpmD8c.jpg",
               "id": 99194,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Joan",
               "gender": 0,
               "credit_id": "566a76049251415eed003e79",
               "name": "Berna Maria do Carmo",
               "profile_path": null,
               "id": 1547573,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Gloria Weston",
               "gender": 0,
               "credit_id": "566a7611c3a3683699008254",
               "name": "Belinda Busato",
               "profile_path": null,
               "id": 1547574,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jill",
               "gender": 0,
               "credit_id": "566a761ec3a3683f560033e2",
               "name": "Maria Vittoria Tolazzi",
               "profile_path": null,
               "id": 1547575,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Margie",
               "gender": 0,
               "credit_id": "566a762b925141664f003c08",
               "name": "Geretta Geretta",
               "profile_path": "/tVcyYIMCAv7PgvSLCncr3kaWgrC.jpg",
               "id": 1041366,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Willy Stark",
               "gender": 0,
               "credit_id": "566a763cc3a36834c1004315",
               "name": "Christian Borromeo",
               "profile_path": "/5rZJgI0OOzovGXdtfKaWMLyrBq0.jpg",
               "id": 101578,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Voice Analyst",
               "gender": 0,
               "credit_id": "566a7657c3a36826470037d1",
               "name": "Al Cliver",
               "profile_path": "/lQTPaWTC4yjVDzMGvBj9Nl2k73w.jpg",
               "id": 52063,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Phil, the agent",
               "gender": 2,
               "credit_id": "566a7665c3a36834c100431b",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb811",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "566a767ec3a36834c1004321",
               "name": "Gianfranco Clerici",
               "profile_path": null,
               "id": 55647,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "566a7689c3a3683f560033f3",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "566a7697c3a3682e98003665",
               "name": "Roberto Gianviti",
               "profile_path": null,
               "id": 98776,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "566a76a592514173fc008591",
               "name": "Vincenzo Mannino",
               "profile_path": null,
               "id": 56722,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "566a76b9925141664f003c2a",
               "name": "Augusto Caminito",
               "profile_path": null,
               "id": 59622,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "566a76d39251417383003982",
               "name": "Keith Emerson",
               "profile_path": "/jAWk4xHFZ8obJ1f2n0kWLzpkLBM.jpg",
               "id": 548768,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "566a76dec3a3682e9800367b",
               "name": "Giuseppe Pinori",
               "profile_path": null,
               "id": 933326,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "566a76eb9251417411008337",
               "name": "Mauro Passi",
               "profile_path": null,
               "id": 1547576,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "566a76f892514169e2003df8",
               "name": "Vincenzo Tomassi",
               "profile_path": null,
               "id": 53197,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.670948,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 40145,
      "vote_count": 9,
      "budget": 0,
      "overview": "A series of murders rock a dance academy in New York in which the mysterous directress, Candice, sets out to find the kiler, with a little assistance from a shady male model, named George, who has a hidden agenda for her as does she for him.",
      "similar": [
         357096,
         15069,
         984,
         8090,
         75780,
         948,
         807,
         445954,
         21484,
         10651,
         11423,
         10781,
         2749,
         123109,
         18587,
         7007,
         285840,
         26390,
         15762,
         37645
      ],
      "original_title": "Murderock - Uccide a passo di danza",
      "runtime": 93,
      "poster_path": "/sbq6Ur9ASf0KhLTtKMAOndclHbv.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Scena Film",
         "id": 49589,
         "origin_country": ""
      }],
      "release_date": "1984-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Save the last dance... for hell!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucio Fulci"],
      "runtime": 93,
      "synopsis": "At the Arts for the Living Center in New York, Candice Norman (Olga Karlatos) oversees the latest dance routine choreographed by Margie (Geretta Marie Fields). Candice tells Margie that the act needs even more perfection in preparation for a visit from three talent agents. The academy director Dick Gibson (Claudio Cassinelli) meets with TV producers Bob Steiner and John Morris, who watch a video of the dance, and Candice learns that the men will only select three dancers for an upcoming TV show. That evening after the dance class is over, one of the dancers, named Susan, is murdered in the locker room by an unseen person who chloroforms her and then stabs her in the heart with a long hair needle. Lieutenant Borges (Cosimo Cinieri) arrives on the scene to investigate. Also with Lt. Borges is the police profiler and psychotherapy professor Dr. Davis (Giuseppe Mannajuolo). With Candice nowhere to be found, suspicion begins to focus not only on her but on the victim's boyfriend Willy Stark (Christian Borromeo), as well as Dick Gibson. At her apartment, Candice arrives where Dick pays her a visit where they talk about the potential relationships between the students, and that there is nothing going on between him and the other students. Bob the DJ phones Candice and updates her on the murder at the academy. The next day, the group dances while Willy is upset that nobody seems to care about Susan's death. Meanwhile, Lt. Borges talks to Dick about a possible rivalry between the dancers. That evening at a local nightclub, Janice dances alone for an audience and then walks home, where Willy is sitting in her apartment wanting to talk. Janice goes to get a photo of Willy and Susan, but when she calls out to him, he is gone. Janice finds her pet canary dead with a hairpin needle through its body. Janice runs to the front door where she gets attacked and killed by the unseen killer with the hairpin needle to the heart. Candice begins having nightmares of being attacked by a handsome young man (Ray Lovelock) wielding a long, ornamental needle identical to the one in the killings. Candice becomes more obsessed with the dream assailant when she sees an advertising billboard which features him prominently. Unable to shake the feeling that they are in some way determined to meet, Candice tracks down the man in the poster to the seedy Fulton Hotel, and bribes the desk clerk for the key to \"Mr. Robinson's\" room. She explores the room, but is shocked when the handsome model returns suddenly. The man introduces himself as George Webb, and to Candice's repulsion, is his a wreck, drunk, and disheveled. With what seems like disappointment along with terror, Candice flees from the room, leaving her purse and ID behind. Meanwhile, Lt. Borges records a phone call to the police station of a person claiming be the killer. When a voice analyst identifies it as Bart, one of the dancers, Borges arrests him. Bart confesses to the phone calls as well as to killing Susan because she was crazy, and Janice because she was Hispanic. But Borges states his belief to Davis that Bart is not the killer, but a pathological liar. George goes to the academy to return Candice's purse where another dancer, named Gloria, recognizes him from a modeling show they appeared in years earlier. Dick sees George and Candice on a security monitor and calls Borges saying that George must be the killer. At a local Chinese restaurant, Candice and George become more close when she tells him about an incident when a man on a motorcycle ran her over in a hit-and-run which put and end to her dancing career forcing her to teach. Back at Candice's apartment, she gets a phone call from Phil, a local talent agent (Lucio Fulci), who has made a background check for her on George and informs her that he once had an affair with a young girl who later died. Back at the studio, Candice is attacked by Margie, using the killers M.O., but stops short from killing her, and is then subdued by Dick who turns her over to the police. A few days later, Jill, another dancer, baby-sits for the wheelchair bound Molly, who takes pictures of her. When Jill answers a knock on the front door, the killer barges into the apartment and stabs her with the hairpin. Molly frantically snaps away, but does not get a clear view of the killer's face. The police arrest Dick when he's found running away, in which he tells them that he only found Jill dead. The following night, the killer attacks and kills Gloria in the locker room in the same manner. At George's hotel room, Candice lets herself in and finds a hairpin and bottle of chloroform in his drawer. Candice rushes out to her car and drives away. George arrives and seeing what Candice found, tries to call her at her apartment, but she is not home. At the police station, Candice tells Borges of her discovery and that George is the killer and names the hotel where he is staying at. Candice then goes over to the academy which is closed down for the night, and finds Gloria dead in the locker room. She calls Borges and tells her to meet her at the academy. Candice runs to the manager's room and George is there. He turns on the music and a video showing all the dancers who have been killed. George walks in with the hairpin and asks if it is evidence that she planted in his hotel room to connect him to the murders. Candice then reveals that she's known from the very start that it was he who was the hit-and-run motorcycle rider who ran her over, and ruined her career. She tells him that she killed all those dancers out of jealousy of their rising careers, while planning to frame him for the killings as her final act of revenge against him. She pulls on George's pin-holding hand and impales herself on it, and falls to the floor dead. Borges and Davis arrive on the scene where they know that George is not the killer. When they saw the photo slide Molly took of the killer's jacket, they noticed that the buttons on the killer's jacket were on the left side, which implemented to be a woman's jacket. Plus, Candice told them about the lion's head hair pin needled used in the killings, information that was not made public. George leaves the scene with Borges as the cops investigate the scene. Relieved, but guilt-ridden over having destroyed Candice's dancing ambitions, George begins to confess to Borges about the hit-and-run accident years ago which he blames for destroying Candice's dancing career and making her go on this murderous rampage. Quote from John Hudson in 'The Asphalt Jungle': \"Often crime is a distorted form of human endeavor.\"",
      "writers": [
         "Gianfranco Clerici",
         "Gianfranco Clerici"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0087759/",
      "coverLink": null,
      "actors": [
         "Olga Karlatos",
         "Ray Lovelock",
         "Claudio Cassinelli"
      ],
      "reviews": [
         "One of Lucio Fulci's \"gentler\" films, MURDER ROCK is not very popular among gore fans (largely because of the lack of eye gougings and disembowellments), but it has much to recommend. The story deals with a maniac who is killing the girls at a dance school in New York -- together, a cop and a psychiatrist track the maniac down. Keith Emerson contributes a dated, but enjoyable, soundtrack, and cinematographer Giuseppe Pinori makes fine use of half-lighting, a la Mario Bava's SEI DONNE PER L'ASSASSINO. Fulci cameos as an agent. Recommended for Italian horror buffs. *** out of ****",
         "After the death of a highly regarded female dancer at New York's Artistic Dance Centre, the eyes turn to each other, as they learn that they are competing for only three spots that could see them living their dreams. Their dance teacher Candice Norman pushes them to the brink to achieve that goal, due to an accident that crushed her chance. Lt. Borges gets the case, and soon other well-regarded dance students are following the same fate of a hat-pin in the heart. Is joyously, and ambition becoming part of it, but Candice starts believing it's the man in her dreams George Webb, who she eventually meets, that might have something to do with the killings. Oh didn't the flash dance era hit hard! With a clunky, overwrought soundtrack like this you just get that tingling sensation to join in with the dance routines. For some reason I got Blondie's groovy \"Danceaway\" stuck my head, when watching it. Constantly it was playing on a loop! Okay the cheesiness of the times really does shine through, but I thought it was a fair effort. It can drag and labour on from time to time, but director Lucio Fulci visually counter-punches those weak spots with raucous masterstrokes of suspense, mood and a slight touch of malevolence. Around this time his was at his peak of displaying gore and splatter to the extreme, but on this occasion his holding back quite a bit to basic deaths involving the unique, but repetitive hat pin to the heart. However the bare flesh is still evident, and there's a sexually arousing dance number or two. The surprisingly well executed use of the camera, lighting and the setting to the lead up to the deaths were far more effective. Fulci stylishly milks his artistic merit with some inspired images. To bad its brought undone by its second rate script with silly reasoning's and contrived developments. It's a trashy and unusual mix of dance and Giallo, but it could've been more twisted than the monotonous and goofy treatment it got. Other than a diverting grizzled, cynic cop performance by Cosimo Cinieri (with such great lines \"\u0085 school full of S.O.B\"), the rest of the lead acting is quite bland (Olga Karlato and Ray Lovelock) and the hilariously hideous dubbing didn't help. Claudio Cassinelli had his amusing moments. I guess the lovely looking girls are just there to pout at the camera and look good. The eclectically flashy music score by Keith Emerson is true to the era and fashionably stylised. Interestingly watchable novelty that's well-directed, but the material doesn't really rise for the occasion, as it succumbs to unintentional silliness.",
         "Lucio Fulci's Murder Rock is often lambasted by both Fulci and Giallo fans; and although I can certainly see why, I've got to say that this film satisfied me personally and I won't hesitate to label it a successful attempt at blending the tacky eighties styling's of dance phenomenon's the likes of 'Flashdance' with the familiar styling's of the popular Italian Giallo. I'm sure Fulci thought he was on to a definite winner back in 1984 with all these popular elements in one film; and even though I'm not sure how they would have been received at the time, nowadays it stands up as an amusing slice of kitsch nostalgia. I think the director cared more about making a quick buck on this film than providing the mass with a piece of art, and this shines through in the convoluted, but not well put together plot line. As you might expect, the film centres on a dance academy. After one of the girls is found dead, the cops place everyone at the academy under suspicion and when the murders continue; the police are given more leads to eventually track down the perpetrator. The main reason why this film isn't liked by many of my fellow Fulci fanatics is due to the fact that it's relatively bloodless in comparison to his other works. The likes of The New York Ripper and The Beyond show the director at his gritty, blood-dripping best...whereas the kill scenes in this movie hardly feature any of the red stuff. That being said, they are still rather sadistic, as the killer knocks his victim out with chloroform before puncturing their heart with, of all things, a hat pin. Still, it has nothing on the eyeball violence of Zombie Flesh-Eaters. The musical numbers are atrocious in true eighties pop style, while the dance scenes are rather boring and not what I tuned in for. Fulci does find time to implement some gorgeous visuals, and the blue tint that accompanies most scenes gives the film a certain sense of art. Even though many of the film's elements are not brilliant, I still rate this film as an overall success as it's entertaining and fun to watch, and even though there are too many filler scenes; the plot plays out nicely. It's not a major highlight either for the genre or for the director, but Murder Rock is still worth seeing.",
         "Lucio Fulci is one of the best and most underrated directors in history. Though not all of his films were great, at least 7 of this films should be in any horror anthology. This film is hard to find, though it was released here in Argentina. In the beginning I thought this was gonna be Flashdance - The Return, but ends up being a clever thriller. The killer's method is original, and the resolution quite surprising. Not one of Fulci's best, but a very good film indeed. Score: 8.",
         "The flashdancers of a prestigious dance school are winding up dead thanks to a killer in a leather coat and gloves who uses a lion-headed hat pin and chloroform as his/her weapon. The hard-nosed, tough Candice Norman(Olga Karlatos), embittered by being robbed of her own opportunity of achieving a dance career thanks to a motorcyclist running her over, pushes her students to the very brink. Three dancers have a chance to move on to even greater heights, and this might provide extra motivation towards murder. Candace sees a vision of a model/actor named George Webb(Ray Lovelock)coming at her with the murderous hat pin closed in hand ready to stab her. Candace is driven by the dream to pursue George once she spots a billboard add with his face modeling a product. What she doesn't count on is falling for him. The film shows the setting up of certain girls being murdered(such as two who are attempting to take a shower after practice in the dance school)and Candace's pursuit of the truth. As she digs deeper, George might be the major suspect in the murders. Set amongst the backdrop of New York City flash-dance music scene at the time, the soundtrack and look of the film shows this time of life in the early 80's as women connived and killed themselves in order to make it to the top of the dance scene by any means necessary. I'm sure in Fulci's macabre mind, he saw an opportunity to question..Just how far is one willing to go towards achieving that dream? But, when the killer is indeed exposed even deeper truths come out such as losing that dream before having a true opportunity of achieving it thanks to circumstances out of left field. George is presented as a male model struggling to make it in the treacherous business of modeling and acting. He has ambitions and dreams like the flashdancers, but is hitting the brick wall that often comes when wishing to achieve stardom. Certainly gialli fans(..and, most especially those of Fulci fandom)will probably find this slow and talky. It's also anemic, barely showing any real violence at all due to what the killer uses as his/her weapon. The dialogue and dubbing are nothing to write home about, either. But, technically, Fulci's film is polished. I loved the DVD transfer and felt the cinematography(..and how Fulci uses light such as the bathroom/locker rooms in the dance hall at night as the lights blink on and off in increments stating that the electronic doors will be bolted in a specific time frame telling anyone still in the building they need to get out)and lighting were top-notch. Fulci is quite restrained not filling the screen with bloodshed and gore as he does in his zombie flicks. And, yes, the flash-dance music scene backdrop is indeed cheesy but merely a product of what was happening at the time.",
         "\"Murder Rock\" is a more than decent Fulci effort that's not as great as his previous efforts. **SPOILERS** As the students at Arts for Living Center prepare for a big competition, which instructor Candice Norman, (Olga Karlatos) believes isn't at the right time, one of the students is brutally murdered at the school. The police inspector put on the case, Lt. Borges, (Cosimo Cinieri) finds that the clues don't add up, even as more students start to get killed. Candice becomes convinced the model from her dreams, George Webb, (Ray Lovelock) and after meeting him, they decide to solve the crimes themselves. As the killer starts to attack more vigorously, they speed the investigation before they kill the entire staff of dancers. The Good News: There is a couple of nice moments here. The mystery itself isn't bad, and the weird inclusion of the dreamed-of maniac adds something fairly interesting. It's the best part of the film, since it really does show some spark of originality within the film. The whodunit nature of the film is brilliantly played out, and the final reveal is effective. The fact that it's so unexpected and comes out of the clear blue is a great help, giving it a smarter approach. The murders are undoubtedly what makes this one shine, and there are several standout set-ups in here. The several kills in the beginning center are a perfect example, as the killer's point-of-view is mixed with a claustrophobic setting and the ingenious use of a strobe light to give it a little extra. That flashing light in the background does work quite well and builds a really great atmosphere for the kills. The later scene in the apartment is the real suspense highlight, and it plays out really nicely. The fact that songs during the dances aren't that bad is a good thing, and it makes the scenes a little more enjoyable. The Bad News: This is overall a really decent film, which means there's some hard-to-digest moments. The drawn-out pacing is used to maximize the suspense, but the slow-going nature of the proceedings actually has the opposite effect and grinds the momentum to a halt. It hurts the film greatly, as the middle section is a long, overly drawn-out series of investigations that take away from the killing. This is a major gripe against the film, and it harms it the most. Although it's a cheap shot, the lack of gory slayings hurts the film even further. The method of killing is the major reason, as there's hardly a chance for it to happen, and that really neuters the potential for it right at the start. Overall, the slow pace is what kills it more than anything. The Final Verdict: Far from being a traditional Fulci film, this is a rather mediocre effort here. It's nice to see him doing something other than the normal gore set-pieces and try out something else, but the result is a very slow and boring film that will only appeal to the most hardcore Fulci collectors and European fans, while those that don't like them as much are advised to seek caution. Rated R: Nudity, Violence and some Language",
         "For those Lucio Fulci fans who only know him for his films like Zombi 2 or The New York Ripper, I can easily see how Murder Rock could come as something of a shock and disappointment. It has more in common with his film One on Top of the Other than it does the throat-gashing, chest-ripping, eye-gouging films Fulci is famous for. Murder Rock is virtually bloodless. It's odd that during the early to mid-80s, which are arguably Fulci's most violent and lurid period as a filmmaker, he reverted to a relatively tame film like Murder Rock. That's not to say Murder Rock isn't enjoyable. There are enough Giallo elements in the plot involving a series of murders at a New York arts academy that I was reasonably entertained throughout. Murder Rock plays it straight and doesn't bring up some vital piece of information or suspect in the last minute that can sometimes make these films frustrating. However, and I realize that I may sound like I'm trying to have my cake and eat it too, but it's this straightforward approach that is also the film's biggest weakness. It was far too easy for me to spot \"who done it\". There are red herrings, but all of them are easily dismissed. I kept waiting for a plot twist that never materialized. One area where Murder Rock excels is in its look. Fulci created a highly stylized world to set this Giallo. There are some interesting camera angles down corridors and through doorways that add a lot of suspense to the film. I was at first put-off by the lighting Fulci used in much of Murder Rock. I began to wonder if all of New York was lit by a slow pulsing strobe. But then I realized how effective this lighting was to Fulci telling his story. A lot can happen in the total darkness between the blinding flashes of light. Technically, I would rate Murder Rock as one of Fulci's best films. Finally, a lot of the reviews I've read on Murder Rock tend to over-focus on the soundtrack. Sure, it's cheesy, outdated, and, at times, inappropriate. I won't deny that. At one point in the movie, I half expected to see Irene Cara pop up to do a song or two. But you've got to consider the timeframe this movie was made. Fame and Flashdance were very popular and Fulci was trying to cash-in on their success. And in that light, I think he was somewhat successful. Keith Emerson's score is a reasonable representation of the music used in movies of this type in the early 80s. Like it or not, it fits the film. I really wouldn't want to change any of it.",
         "After the blockbuster success of dance movies Fame and Flashdance, Lucio Fulci, Italy's 'King of Gore', decided it would be a good idea to cash-in on the craze, so in 1984 he gave the world Murder Rock, a giallo style thriller packed with energetic dance sequences (performed by bodacious babes in skimpy Lycra leotards and leggings) and several murders (performed by a mysterious unseen killer wearing gloves and a leather jacket). Unfortunately, due to the modus operandi chosen by the movie's murderer\u0097a hat pin in the heart\u0097the film is considerably less gory than Fulci's earlier blood-drenched movies, and, despite it being one of his more competent and visually interesting efforts, many of his loyal fans were disappointed with the result. I found the film no less entertaining than most of Lucio's previous efforts, crammed as it is with wall-to-wall gyrating, sweaty hard-bodied honeys, but a bit more gore would certainly have been welcomed. Starting with a long opening dance sequence in which we get to see our potential victims bopping away to a pounding disco beat, Fulci makes it quite clear that T&A is high on the agenda. The stunning girls enthusiastically writhe and thrust to the music, building up such a sweat that it isn't long before viewers are treated to the first shower scene, which ends with a busty blonde becoming victim number one. In a virtually bloodless murder, the killer pushes a bejewelled hat-pin into the girl's heaving bosom, puncturing her heart. And a legion of Fulci fans scream, 'Where's the gore?'. And so it continues, with more dance sequences (including one erotic routine reminiscent of Jennifer Beal's nightclub act from Flashdance) and a few more splatter-free deaths. Fulci tries hard to emulate the directorial stylistics used by his contemporaries in the genre, and manages to throw together some quite interesting visuals, but the film soon becomes tedious, and with my two favourite girls offed first, I quickly started to lose patience. In typical giallo fashion, the killer is revealed during the film's closing moments, but anyone who has seen this kind of thing before will probably have worked out who was responsible long before the end. And the relevance of the hat-pins? Well that is never explained leaving me wondering why Fulci picked this method of killing when an axe to the head would have been so much juicier. Murder Rock gets 6/10, primarily for the oodles of gratuitous nudity (hey, I'm easily pleased!).",
         "With having watched Dario Argentos astonishing atmospheric supernatural horror film Suspiria,I went looking round online to find out if any other big-name \"Giallo\" director had made a film that was set in a dance school. (in Suspirias case,a ballet school) Having looked round and found nothing,I was about to give up,until I got a recommendation from Amazon Uk,which said that if you enjoyed Suspiria,you may also enjoy this title.Looking at the information about the film,I was thrilled to find out that it was a Giallo set in a dance school,co-written (along with three other writers) and directed by Lucio Fulci.Hoping that this would be Fulcis Suspiria,I waited eagerly for the DVD to arrive. Whilst this film did not sadly reach the level of Suspiria,I still found it to be a very entertaining,oddly light-hearted Giallo. The plot: For the students of a run-down dance school in New York,a light of hope suddenly appears,when a group of businessmen arrive,wanting to cast them as dancers for there next big music video. Feeling that the students will be able to achieve the dream that she always wanted, (which got destroyed,when she got run down by a car,driven by a mysterious stranger)Candice Norman orders all of the dance instructors to train the students,so they will all look perfect for the video,sadly Norman finds out that the businessmen have changed there minds,and that they will instead only be using three students for the music video,instead of the whole group. Just before Candice has to tell the students the awful news,one of her best students is found dead in the changing rooms,having been knocked- out by chloroform, and then stabbed by a hat pin (which has been left in her body)When the police arrive,Norman first hopes that the terrible person that did the killing will be caught right away.But,as more and more of her students start being found murdered,Candice decides that the police are going far too slow in their attempt to solve the murder (s),so she is instead going to investigate the killings on her own. Whilst trying to gather evidence of the murderer's identity,Candice Norman begins to experience a strange,recurring nightmare where,a man who she has seen on billboard adverts kills her with the hat pin.Feeling that this strange dream/nightmare could be the key to finding out who the psychotic killer is,Candice goes searching for the man who is on the billboards and in her nightmares.When she finds him,Candice and the man begin to discover that the killer of the students,is someone that is beyond Candice Newmans nightmares... View on the film: Whilst Dario Argento is well known for telling the cast of Suspiria, that he did not care at all about there dancing skills,Lucio Fulci and choreographer Nadia Chiatti unexpectedly go in the opposite direction,with the opening of the film giving the actors a chance to show some pretty good dance moves. (although the use of mostly a \"street\" dance style,does seem a bit out of place for a ballet school!) The dance scenes are also given a very lively feel,thanks to the fun,pure 80s pop songs by Keith Emerson,and the smooth vocals of Doreen Charter.with the story and the screenplay of the film being written by four people,I was left feeling a bit disappointed when,around the half way mark of the running time,one of the main supporting characters in the film is caught trying to kill one of the students. After realising that they don't have the nerve to kill the student,the wannabe murderer yells at the cops that are rushing to the scene that ,\"I am the one that killed them all!\".The police then get hold of the murder weapon,and put the killer in the car,to be taken to the station.To my surprise,five minutes after that scene,the rest of the film went along as if that scene had not existed,with the ending of the film revelling that actually a completely different person had done the killings. Although, this film is not as aggressively violent as some of Fulcis other works (such as the slightly muddled Italian Crime film Contraband) Lucio Fulci still gives the film an excellent stylish look,with the police evidence gathering sequences having some very clever \"flashing\" effects,and for Candice Newmans recurring nightmare Fulci gives the expanding nightmare a stunning,very surreal hyper-slasher feel. Final view on the film: A very entertaining,\"lively\" Giallo,with some surprisingly good dance numbers from the fun cast,and some fantastic , eye catching hyper- stylised directing from Fulci.",
         "Loved it. Great suspense, disturbing murder scenes. Not too gory, but the suspense makes up for it. Very tense, the closeups, the pre-murder lighting and screams, the sound of the heart stopping. The victims' desperation is well played. Music is great to set you in the era, but you'll find it cheesy if you don't like 80s stuff. Some of the nudity was perhaps unnecessary but still stylishly done. The movie is weird but well executed. It isn't as gruesome as a gore flick, but I think it was more disturbing as it provides greater immersion. The slow killings are a shocker as you can feel them as real. I found myself trembling several times watching this, both by the murder scenes themselves and the suspense going through all the movie. Great camera shots, great scene composition, awesome lighting. The plot is simple but it works. It's interesting to watch the students accusing each other of the murders. There's an unexpected plot twist that I found rather interesting. Don't watch it if '80s cheesiness puts you off. In my case it was a plus. My first venture into giallo cinema and it satisfied me beyond my expectations. If I can find similar movies will definitely watch them. Last recommendation: do yourselves a favor and don't watch it dubbed, watch it in Italian as it's intended to be watched. Dubs for low budget movies aren't precisely good and will make the movie look fake. Get Italian audio with captions for maximum enjoyment.",
         "Lucio Fulci is a usually very remarkable director who moves with the times, that's for sure. Following the huge success of stupid dancing movies, like \"Fame\" and \"Flashdance\", it was an inexplicably popular trend in the early 1980's to insert overlong dancing sequences in horror films as well. Fulci was one of the first foreign filmmakers to cash in on this trend; moreover, he dedicated a FULL movie to the intrigues and competition issues in typical dance academies! The saddening result is a tame and boring movie, very much UN-Fulci and definitely not worth being listed among his other contemporary gore-highlights like \"The Beyond\", \"New York Ripper\" and \"House by the Cemetery\". Someone is killing off the pretty but very competitive girls of one and the same dancing class, only a couple weeks prior to an important recital. Her/his modus operandi is a lot gentler than usual in slashers, since the victims get paralyzed first and then stabbed in the heart with a hatpin. It's truly incomprehensible why Lucio Fulci, commonly known as the Godfather of Gore, decided to make the murders so soft & bloodless, sometimes even happening entirely off-screen! What happened to my horror-idol with his normal passion for nastily cut throats or vile eyeball-stabbings? Perhaps Fulci hoped to reach wider audiences like this or maybe his producers wanted to see a stylish murder-mystery for a change. The hunt for the killer's identity starts off interesting but, due to the repetitive and way too expanded dancing sequences, you stop caring about that pretty soon as well. Italian horror regular Ray Lovelock (\"Autopsy\", \"Let Sleeping Corpses Lie\") gives an adequate performance and most of the academy girls are lovely eye-candy (showing a bit of flesh, too), but it constantly remains a dire film.",
         "Lucio Fulci wanted to make a giallo. But then Flashdance happened and the producers knew Keith Emerson (yes, the Keith Emerson from Emerson Lake and Palmer) and the result was\u0085Murder Rock! Or Murder-Rock: Dancing Death! Or Slashdance! Or The Demon Is Loose! We start at the Arts for the Living Center in New York, where Candice (Olga Karlatos, the only actress to be in both Zombi 2 and Purple Rain) watches Margie (Geretta Giancarlo from Demons) choreograph dancers for an upcoming talent agent visit. Only three girls will be selected, so they all need more perfection. That night, Susan, one of the dancers, is murdered in the locker room. First, she is chloroformed. Then, as if Fulci has simply waited too long for something violent to happen, a giant hatpin is inserted into her breast. I imagine Lucio sitting in his director's chair, saying \"Why do I have to show all these pretty girls in leotards when everyone just wants to see me rip out one of their eyeballs?\" Lieutenant Borges (Cosimo Cinieri, The New York Ripper) and Professor Davis (Giuseppe Mannajuolo). show up to investigate, choosing Candice, the head of the academy Dick Gibson (Claudio Cassinelli, What Have They Done to Your Daughters?) and Susan's boyfriend. We find Candice at her apartment, where Dick shows up to tell her that he isn't sleeping with any of the students. Anyone that tells you this is pretty much telling you that they totally sleeping with the students. The studio DJ also calls her to update her on the murder. Back at the school and everyone is back to their routine, which upsets Dick, who tells the cops of the rivalries between the dancers. Later that night –after we see on stage by herself, showing off for the crowd — he shows up at her place, wanting to talk. She finds a photo of him with Susan, but when she turns to find him, he is gone. Worse, her bird is dead, stabbed by a hairpin. And soon, so is she, as a hairpin is thrust into her heart. But what of Candice? Well, she's having nightmares of the killer, who she sees chasing her with the long hairpin. She sees his photo on a billboard and tracks him down. The man is George Webb (Ray Lovelock, The Living Dead at the Manchester Morgue), who isn't the handsome model in the ads any longer. He's now a mess, so she runs from him, leaving her purse in his room. What would a giallo — or a Fulci movie — be without a red herring? It comes in the form of Bart, a dancer who confesses to the murders because Susan was crazy and Janice was Hispanic (but in a much more racist way). Borges believes that he isn't the killer, but when George comes to the Academy to return Candice's purse, Dick tells the cop that that's their man. At lunch, Candice tells George about how her dancing career ended after a hit and run accident with a motorcyclist. Now, she can only be a teacher. And she's not convinced that George is on the up and up, as she learns from a talent agent that George once had an affair with a younger girl who died. Oh yeah — and Margie attacks Candice just like the killer, but Dick saves her. The killing doesn't stop, though. Jill is killed while Molly, a girl in a wheelchair, takes photos of her. Molly tries to take photos, but the killer escapes. Dick tries to run away, but he's arrested. But again, the killing doesn't stop. Gloria is murdered in the locker room with the trademark hairpin. It all leads to Candice going back to George's hotel room, where she finds the murder weapon. She runs away and George tries to find her, but she's at the police station, telling the Lieutenant, who agrees to meet her at the Academy. Ready for the big reveal? When she gets there, she sees a video of every dancer who has died, leaving her screaming their names. George appears with the murder weapon and asks why she set him up. She responds that she knew he was the hit and run driver who cost her so much and that she killed the girls because of her jealousy of them. They had the life she would never know and had to die\u0085and he has to pay for all he has done to her. She grabs the murder weapon and kills herself with it, pushing the weapon into George's hand. The police arrive, but they already knew she was the killer, thanks to the buttons on the killer's jacket being on the left side and Candice knowing details about the murders that they never made public. That's the plot, but please imagine that there is a leotard-clad dance-off every ten minutes or so. Murder Rock was part of a planned trilogy entitled \"Trilogia della musica\" and would have been followed by Killer Samba and Thrilling Blues, but Fulci became ill for two years and abandoned the project. This film looks gorgeous! It has some stunning shots of the killer coming at the camera and while there is some blood, it isn't at the expense of the story. I literally expected nothing and was rewarded with some great fun. Your ability to enjoy flashdancing and 80's outfits may impact your enjoyment of this film, however! Read more at http://bit.ly/2iwKWcY",
         "Nothing very special about this giallo. A bunch of dancers are trying out for parts, and some get murdered by a hatpin stuck into their left breast (where it looks like it would actually pierce a lung and not the heart as intended). Some of the dancing scenes are pretty sexual. The studio where they do their dancing has a rather odd system at the end of the day whereby a voice comes over an intercom, and the lights flash on and off repeatedly. I guess this is to make for more suspense or to make the killing scenes more exciting? It's more on the annoying side. One of the women has a dream in which she is pursued by a killer with a pin (it changes sizes throughout the dream, sometimes appearing giant). She later sees the man from her dream on a billboard. She tracks him down, finding him to be a bit of a washed up, alcoholic actor, and starts a relationship with him. Much more than that I don't remember.",
         "(That's me cringing at the aftertaste of \"Murder Rock,\" one of my favorite director's worst efforts.) As it started out I had high hopes, with the ethnic kids break dancing, the horrible music and the random shots of the New York City skyline, I thought: wow, is this gonna be as cool as \"Ripper?\" Nah...not even close. The gore is non-existent, the plot is ludicrous, the acting is abysmal and the music is nerve-racking. I love how everyone who gets killed does not defend themselves against what has to be the single scariest weapon in Italian horror movie history: the RAG! Wow, did they forget how to use their hands? Come on guys, let's have a little believability in this next scene...nope. It continues 'til the end. It's like they were paralyzed by the chloroform before it even touched their mouths. When we find out who the 'killer' is, it is ridiculous and implausible, for there were many murder scenes in the film where the killer could not have been two places at once. I'm willing to forgive a little bit of absurdity in a giallo provided there is some gore, good music and awesome cinematography, but \"Murder Rock\" delivers none of the above so I can show no mercy here. I can dig 'bad' Fulci and I think I own every one of his movies but he missed huge with this one. My least favorite Fulci film. 3 out of 10, kids.",
         "Lucio tapped into all his usual stuff. This is just the cleaner version. A dance school with your typical choreography teachers (Come on 1,2,3,4,5,6,7,8....) and your over competitive wannabe stars provides the setting & victims. Olga Karlatos is the said teacher. That was her getting her eyeball pierced in 'Zombie.' She plays the same type here. An exasperated, bossy hellion. The view of the glove attack got old fast. And most of the supposed scares seemed to be cut off too quickly. As a mystery, it was OK. I guess fans of the Maestro won't be to into it, but first timers might like it. And see how many people who have starred in previous Fulci flicks you can spot.",
         "the detective in this film was forever grossing me out stuffing his face with shelled nuts, cracking them open with his teeth then scarfing them down, smacking his lips over espresso then using his finger to wipe the sugar off the bottom of the cup then sucking on it noisily. when he wasn't eating he was picking at his face. disgusting performance! this film was so cookie cutter in terms of how there would be some scene to move the plot/story such as it was. then there would be a scene with weird lighting (who has all this darkness in their apartments for goodnessakes? everyone in NY evidently...) a noise would be heard, the person would caper about cautiously and then the ubiquitous Italian gloved hand of death would finally appear. I resented having to turn the volume up and down cause I couldn't hear the dialog one moment then Keith Emerson's music would be blaring away . . . it wasn't fun to watch this movie. the good part was the lampooning of crappy 80s choreography. the poor dancers had to run in place most of the time, tossing their kinky 80s locks back with a snap of their necks. it was about the crappiest dance performance I've ever seen both in terms of conception and execution. another funny thing is that in counterpoint to the lights flashing on and off when people were about to be killed in the school as described in another review, for some reason when it came time to photograph the corpses, these huge klieg matrices were brought in that over lit everything and burned everyone out in just the same way, only the opposite. if that was supposed to be artistic it wasn't!",
         "I thought Dancing death was an exquisite masterpiece that should go down in the books as the most tangy piece of movie ever.",
         "Murder Rock is one of Lucio Fulci's lesser known films. It was released in the wake of a series of exceptionally violent movies directed by the great man. This one is considerably tamer and not one of his better received critically. It may very well be because it's less intense that it isn't amongst his most popular, I think it's only fair to say that is part of the reason. It's possibly the most blatant attempt by Fulci at making a mainstream movie. He decided to combine the popular horror sub-genre of the time – the slasher – with the 80's fad for fitness. This was the era of Flashdance and Fame, and lycra clad people seemed to be everywhere. I guess it was only a matter of time before a slasher variant on this theme emerged. In keeping with trying to appeal to a wider demographic this one is a relatively bloodless affair as well. It's possible that by trying to appeal to too many people, Murder Rock ended up pleasing fewer. The story is about a series of murders committed around a dance school in New York. It's one of many early 80's efforts that Fulci set in America. In keeping with its Italian giallo roots though, there is a strong emphasis on the whodunit aspect. This ensures that the story retains a bit of interest and the audience is engaged throughout. There are some moments of giallo weirdness too which always helps such as the recurring dream that the female protagonist has about a sinister stranger trying to kill her. While Keith Emerson is on hand too with an appropriately cheesy soundtrack. It isn't exactly of the standard of the score he did for Dario Argento's Inferno but it does the job. Overall, this is an entertaining movie. A little light-weight perhaps but fun all the same.",
         "\"Murder Rock\" is another New York-set thriller made by Lucio Fulci just two years after his infamous \"New York Ripper\"; unlike its predecessor, this one is largely forgotten today, probably because it lacks Fulci's trademark gore (the killing method used here is gruesome but not particularly graphic). And yet, from a mystery perspective, \"Murder Rock\" is easily the superior film (though the motives behind the murders are strikingly similar - the films were written by more or less the same team, after all); there are lots of suspects, some audacious red herrings (including at least two false \"unmaskings\"), and although the killer's identity is reasonably well-hidden, there are enough clues for it to make sense when the truth is revealed. With two solid lead performances from the striking Olga Karlatos and Cosimo Cinieri (as the inspector on the case), an appealing - if mostly inexperienced - supporting cast (with the exception of the guy who plays Willy - he's pretty awful), a \"Flashdance\"-inspired solo dance number that actually surpasses its inspiration in hotness, and some catchy 80's tunes from Keith Emerson, \"Murder Rock\" emerges as one of Fulci's most under-appreciated efforts. **1/2 out of 4.",
         "OK, what we have here is Fulci, one of the wildest directors ever. His Zombie film blows away Dawn of the Dead. Night of the Living Dead is a great film. Dawn is a pile of cartoon, crap acting, cheap zombie piece of crap. Day of the Dead was much better than Dawn. OK, what I think makes Fulci films great are the atmosphere built from the scenes. The stories & acting are usually decent, not great. And usually the cinematography/editing is great and the music is good. Fulci is always entertaining. What we have here is the music is offensive. I enjoy ELP and I think Keith Emerson was a great composer/keyboard player. But this output should be destroyed. It is not even good enough to be called bad. Just plain garbage. I wish I didn't hear it. And I wish I didn't know Emerson produced it. It's like Tony Iommi of Black Sabbath playing with Tom Petty, or Bon Jovi, not good. The story and acting are decent. Nothing horrible. The cinematography and editing is well done. But the music keeps popping up. This may be one of those films that should be watched with the sound off, with subtitles, and turn up your stereo to Pink Floyd or King Crimson. There are some kills here. They aren't great. But they all work. Not the best Fulci. My rating is a D, or 3 stars. Maybe 4 or even 5 with better music. Now, I would rather watch this subpar Fulci film than anything from Argento Dario. I consider Argento an amateur. Suspiria is a pile of garbage, with all the crappy cartoon lighting, hand puppet seeing eye dog, crappy acting, crappy story and dialogue. Suspiria as a film is not the worst film in the world, but since so many people love it, it is the worst for me. Plumage and Four Flies are almost as bad as Suspiria. Argento's secret weapon is that he spent most of the film budget, not on making the film like hiring professional writers, actors, cinematographers and set designers and editors. He spent them on marketing and promotion. So, you the film viewer has been sold a bunch of lies. There's an old saying \"Build it and They'll come\", that is what Argento has done. He built it, told you where to buy it, and you bought it. It's no different than the new crop of garbage superhero movies coming out of Hollywood. They have become progressively worse. Force Awakens, Avengers, Dark Tower. It's all the same. Start with an Action beginning, Introduce the characters, have a few cliché jokes, more action where the hero goes down, some reflection, then the hero wins in the end. I remember seeing some Fulci films, where the hero gets his head cut off in the middle of the movie (Conquest). You don't see that in Hollywood. So, this movie by Fulci I give a 3. But compared to Suspiria, Plumage, Four Flies, or any other garbage by Argento, or Mario Bava, even this subpar movie by Fulci is a 10.",
         "I'm not going to dwell on the usual flaws. Woeful acting, inane story, these come with the territory. And I'm not going to dwell on the Flashdance influence, Fulci was known to ply his trade where ephemeral trends were expected to swing. It's how we got Zombi. Horror set in a dance studio was a natural idea after all, as Argento had already shown. Is it our job anyway as horror viewers to criticize acting or look down on influence? No, the real damning thing here is the absence of atmosphere that envelops. So much fuss is made about a superficial mystery with suspects being paraded, so little energy invested in place, bodies, the swirl of visual madness. Fulci tries here and there, a few tricks with mirrors, a scene of hallucination, all of it trivial spattering. The appearances of the killer show this; each time a black-gloved hand reaches out from below a first-person camera to victims' faces that just stand there and grimace a fake horror for the camera. Contrived. But none of other comments mention what has to be one of the most randomly bizarre things in movies; a girl has been left alone after dance practice in the lockerroom, this is so we can have a first murder, a stern voice then comes in through the PA to announce the place is going to be locked down in a few minutes (a dance studio!), the voice sounds like it's warning NASA employees of some imminent shutdown. For no reason lights begin to flash.",
         "I want to start off by stating this isn't a review of the movie, as I really remember very little of the film. What I want to talk about is the marketing campaign. This film was actually played in my city sometime between 1989-1990 - for about a day. There was a commercial that began running on the local TV stations (I'm in Kentucky BTW) which was, I assume, a still image of the, or, at least, a poster for the movie. It was a drawn image of a girl in torn dress chained to a giant X with the city skyline behind her in shadow, with I believe a pair of eyes staring down at her from the sky..there was prob some skulls, maybe even the murder weapon featured in the art, but I don't remember for sure. Anyway, the commercial started on the girl and slowly zoomed out accompanied by a creepy voice-over. I can't remember anything word for word of what he said, but it basically was a pseudo-warning that 'this film contains such shocking scenes' and 'you will be terrified' 'no other film like this' etc. Really got me and my friends pumped up, and on the Thursday before it started, there was a half page ad in the newspaper for the movie, just that black and white poster art from the commercial, but it was the biggest ad on the page. Friday night finally came and me and I know at least four friends went to see it. Two guys walked out within 15 minutes. Then the whole theater was gone within 25 minutes, leaving me and my two best buds to enjoy the weirdest flick we'd ever seen in the theater. I remember there would be these odd fade to black/fade in effects leading up to the murders, and for some reason I suddenly had this thought: \"This crap movie is using some sort of hypno-vision to turn us into killers! Or something f'ed up!\" I think now that's a cool idea for a movie, but I find it pretty amusing that I was terrified during this film, but not because of the content, but the bad editing. Anyway, the song 'Paranoia is coming your way' or whatever has been a sorta catch-phrase in my circle of friends to this day. What a strange movie, and I just discovered the alternate title of 'Death-Rock' - Whaaaa? I gotta re-watch this now, can't believe this is by Fulci! Wha-wha-whaaaat?! I freakin' love 'The Beyond' and I think he did 'House by the Cemetery' too, which is another great Italian Horror flick. Anyway, those are my memories of 'The Demon Is Loose'",
         "A mysterious killer bumps off various lovely young dancers at an illustrious New York City school who are all vying to get picked for a major stage production. Famed Italian goremeister Lucio Fulci skimps on his trademark in-your-face graphic splatter, but does nonetheless relate the gloriously loopy story at a steady pace, maintains a dark cynical tone throughout, brings a blithely scuzzy sensibility to the threadbare material (leering shots of thrusting crotches and wild pelvic gyrations are in delectable abundance), makes neat use of the Big Apple locations, and delivers a generous sprinkling of tasty female nudity. The solid cast helps a lot: Olga Karlatos as tough and exacting teacher Candice Norman, Ray Lovelock as dashing down on his luck model/actor George Webb, Claudio Cassinelli as the lecherous Dick Gibson, Cosimo Cinieri as the brutish Lt. Burges, Giuseppe Mannajuolo as the nerdy Prof. Davis, and Geretta Geretta as the bitter Margie. The hopelessly dated 80's break dancing, loud fashions, embarrassingly tacky hairstyles, and, especially, the incredible \"Flashdance\"-type grand dance numbers all give this picture an irresistibly gnarly'n'kitschy period charm. Giuseppe Pinori's sumptuous cinematography provides a strikingly vibrant and gaudy vintage MTV video look. Keith Emerson's funky-throbbing score and the thumping rock soundtrack both hit the get-down groovy spot somethin' bitchin'. Not peak Fulci by any means, but an enjoyable enough slice of prime 80's cheesoid schlock just the same."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Scena Film"],
      "summaries": [
         "A series of murders rock a dance academy in New York in which the mysterous directress, Candice, sets out to find the kiler, with a little assistance from a shady male model, named George, who has a hidden agenda for her as does she for him.",
         "The owner of a prestigious New York ballet school teams up with a male model to solve a series of bizarre murders of a few of the students."
      ],
      "budget": 0
   },
   "movielensId": 145576,
   "movielens": {
      "languages": [
         "Français",
         "Italiano"
      ],
      "releaseDate": "1984-01-01",
      "dvdReleaseDate": null,
      "directors": ["Lucio Fulci"],
      "runtime": 93,
      "movieId": 145576,
      "title": "Murder-Rock: Dancing Death",
      "mpaa": "R",
      "actors": [
         "Olga Karlatos",
         "Ray Lovelock",
         "Cosimo Cinieri",
         "Giuseppe Mannajuolo",
         "Claudio Cassinelli",
         "Berna Maria do Carmo",
         "Belinda Busato",
         "Maria Vittoria Tolazzi",
         "Geretta Geretta",
         "Christian Borromeo",
         "Al Cliver",
         "Lucio Fulci"
      ],
      "imdbMovieId": "0087759",
      "originalTitle": "Murderock - Uccide a passo di danza",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A series of murders rock a dance academy in New York in which the mysterous directress, Candice, sets out to find the kiler, with a little assistance from a shady male model, named George, who has a hidden agenda for her as does she for him.",
      "tmdbMovieId": 40145,
      "avgRating": 2.66667,
      "releaseYear": "1984",
      "numRatings": 3,
      "posterPath": "/sbq6Ur9ASf0KhLTtKMAOndclHbv.jpg"
   }
}