{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "spaghetti western",
            "id": 156212
         },
         {
            "name": "child kidnapping",
            "id": 170865
         }
      ],
      "imdb_id": "tt0078224",
      "video": false,
      "title": "They Died with Their Boots On",
      "recommendations": [],
      "backdrop_path": "/b23u2fWfTHppJSaUPm1a3zBjgAP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Roy Blood",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5dc9",
               "name": "Giuliano Gemma",
               "profile_path": "/nPMkfzowWezRWe1mP66pr8rwxnw.jpg",
               "id": 15139,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Thomas Barrett, Jr.",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5dcd",
               "name": "Sven Valsecchi",
               "profile_path": null,
               "id": 127813,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Turner",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5dd1",
               "name": "Gianni De Luigi",
               "profile_path": null,
               "id": 127814,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Miss Sheba",
               "gender": 1,
               "credit_id": "52fe45fcc3a36847f80e5dd5",
               "name": "Licinia Lentini",
               "profile_path": "/w46vhb00cqGDPZUyjPFL9EkrXNH.jpg",
               "id": 127816,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5dd9",
               "name": "Philippe Hersent",
               "profile_path": "/zcbjqHxdTwmIQrncvxdqQwwPURb.jpg",
               "id": 50780,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Peggy",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5ddd",
               "name": "Karine Stampfer",
               "profile_path": null,
               "id": 127819,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "One Of Sheba's Women",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5de1",
               "name": "Agnes Kalpagos",
               "profile_path": null,
               "id": 127820,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Sheba's Woman",
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5de5",
               "name": "Maria Tinelli",
               "profile_path": null,
               "id": 127821,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Butch The Bartender",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5de9",
               "name": "Sergio Leonardi",
               "profile_path": null,
               "id": 119514,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "2 Strike Snake",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5ded",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Margaret Barrett",
               "gender": 1,
               "credit_id": "52fe45fcc3a36847f80e5df1",
               "name": "Cinzia Monreale",
               "profile_path": "/lto3lWYaAvolLyDrHEX0x1nFY6D.jpg",
               "id": 31780,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Flertcher",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5df5",
               "name": "Donald O'Brien",
               "profile_path": "/gyzoMi0Fj3GxCcauQkyxnS0CFx5.jpg",
               "id": 31779,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Garrincha",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5df9",
               "name": "Aldo Sambrell",
               "profile_path": "/doSGQEp3BDSCDmbX8hlaTOoqXST.jpg",
               "id": 49895,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Thomas Barrett",
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5dfd",
               "name": "Ettore Manni",
               "profile_path": "/cWv2SZfLKriA0QzYrqXjbdVkYmv.jpg",
               "id": 563809,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45fcc3a36847f80e5db9",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5dbf",
               "name": "Adriano Bolzoni",
               "profile_path": null,
               "id": 67954,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fcc3a36847f80e5dc5",
               "name": "Adriano Bolzoni",
               "profile_path": null,
               "id": 67954,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "547f913fc3a36829a30000b1",
               "name": "Piero Donati",
               "profile_path": null,
               "id": 99519,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "547f9157c3a36829ae000077",
               "name": "Sergio Salvati",
               "profile_path": "/7L2BcidnkV8LcNvYgpGtivv5r2n.jpg",
               "id": 53196,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "584087589251416f41001e18",
               "name": "Fabio Frizzi",
               "profile_path": "/6MGkjsEpKSxwOasSd5xpc93Gfmw.jpg",
               "id": 59366,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 0.941874,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 42326,
      "vote_count": 3,
      "budget": 0,
      "overview": "Young boy who sees his father gunned down kills the assassin. Years later, he has grown up to be a successful bounty hunter who is feared by many. And then one day he discovers secrets to his past...",
      "similar": [
         16662,
         9394,
         11829,
         335,
         429,
         391,
         938,
         8068,
         353491,
         68718,
         10772,
         4771,
         2539,
         9474,
         20533,
         293768,
         290637,
         288,
         336,
         245703
      ],
      "original_title": "Sella d'argento",
      "runtime": 100,
      "poster_path": "/1olE46at1apYuFU0GLkFvKEnwFL.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rizzoli Film",
         "id": 12778,
         "origin_country": ""
      }],
      "release_date": "1978-04-20",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucio Fulci"],
      "runtime": 98,
      "synopsis": "South Texas Border, the 1850s. A poor man and his young son arrive exhausted at a small outpost. There, the man confronts Luke, a sneering crook in the employ of a rich and powerful landowner called Barret. The man tells Luke that Barret has swindled him and his son out of money for some non-existent land. The bitter altercation ends with the man shot dead right in front of his son. As the killer laughs sadistically, the little boy picks up his father's gun and shoots Luke dead. Impassively, the boy mounts Luke's horse, claiming it along with its ornate silver-trimmed saddle, and rides off. Several years later, the young boy has grown up into a rugged bounty hunter named Roy Blood (Giuliano Gemma) who rides into the Texan town of Cerriotts on his silver-saddled horse, accompanied by Two-Strike Snake (Geoffrey Lewis), an amusing but treacherous man he recently met outside of town. Snake tells Roy that many have heard the story of the Silver Saddle, and its owner, the boy who avenged his father. He also knows that Roy Blood seems to leave a trail of dead men in his wake. This is why he wants to tag along: Snake collects items of value from the frequent corpses encountered at every turn in the Wild West. Roy's arrival is also noted by Turner, a mysterious blonde-haired cowboy (Gianni De Luigi). Roy meets with Shiba (Licinia Lentini), a well-to-do madam of the town's local whorehouse, who is also an old flame who wants more. She tells Roy that a man called Shep is extorting money from her, for a Mexican named Grenache (Aldo Sambrell). Her business will be ruined unless she pays up the following day. Roy obligingly shoots Shep and some of his cronies. Once again Snake turns up, shadowing Roy for spoils. The blond cowboy appears and makes a deal with Snake who offers it to Roy: $2,000 for a hit on one Thomas Barret, to be executed in a graveyard out of town. Roy is suspicious, but accepts the murder contract when he hears the name of Barret. At the graveyard, Roy is crouching with a rifle aiming at carriage that rolls up as arranged. Instead of the old man Roy was hoping to shoot, a young boy (Sven Valsecchi) emerges, carrying a funeral wreath. As the child approaches, several men emerge to shoot him. Roy's impulse is to save the boy's life. Roy shoots the would-be assassins and rides off with the boy. He discovers that he has rescued Thomas Barret Junior, the son of Richard Barret who swindled the young Roy's father years ago. Thomas tells Roy that his father, Richard Barret, has been dead for several years and he is currently being looked by his uncle, Thomas Barret Senior (Ettore Manni) whom he is named after. Angered at being cheated out of his revenge, Roy rides off in disgust, leaving the boy stranded in the hills with just a knife and blanket for protection. At the Barret estate, young Thomas' older sister, the beautiful Margaret (Cinzia Monreale), is distraught over her little brother's disappearance. Thomas Senior discusses the search with Turner his estate manager; the mysterious blond cowboy. Turner announces that he knows the identity of the kidnapper: Roy Blood. Immediately, a $5,000 reward is offered for Roy's head. Meanwhile, Snake offers a proposition for Roy. He has kidnapped young Tom, after Roy left the boy behind. He plans to ask for a huge ransom. Roy hears that it was Turner who had set up the graveyard hit as a device to kill the boy and Roy Blood, and blaming the outlaw for the killing. Roy hides out in Shiba's whorehouse, where she looks after Thomas Jr. Using sexual subterfuge, Shiba helps Roy discover the story of the Barret family. After Richard Barret died, the only ones who remained rich were the children, Thomas and Margaret. Thomas Sr. gambled away his part of the Barret fortune. If anything happened to Tom Jr. Margaret inherits everything. Plus, Turner has his eye on Margaret for whomever marries her stands to inherit the whole fortune. When Tom Jr. is spotted by Turner at the whorehouse, Roy whisks him off to the San Jacinto monastery several miles away. The Padre of the monastery totes a gun and promises to protect the boy for Roy while he goes back out to find Turner and his men. After a tense shootout at an abandoned farm, Roy gets the better of the evil Turner, who dies in a trough of stale water. Just as things seem resolved, Garrincha's bandits attack the monastery and grab the boy, murdering all the monks. The local sheriff (Phillppe Hersent) arrests Roy Blood, thinking that he's an accomplice of Garrincha. A huge ransom of $10,000 is made for the save return of Tom Jr. Thomas Sr. goes against the advice of the law and dispatches a rider, named Fletcher (Donald O'Brien), with the money. But the courier is murdered by Garrincha after handing over the cash at the bandits settlement. Meanwhile, Margaret helps Roy escape from jail, and he teams up with Snake to track down Garrincha. The find the Garrincha hideout thanks to Tom Junior's ingenuity: he flies a kite to alert help. They arrive to find Garrincha flogging the boy after he discovers the signal kite. Roy and Snake shoot it out with Garrincha's men and the rescue is successful, but Snake dies after Garrincha shoots him, before being shot himself by Roy. Back at the Barret ranch, Roy returns with Tom Jr. where he exposes the final betrayal. Thomas Senior has been in league with Turner, planning to dispose of both his nephew and Margaret so he can have the whole estate for himself. The kidnapping stunt with Garrincha was part of the plan to avert suspicion from him. He'd also planned to kill Turner once he married Margaret as the final plan enacted. Roy shoots the treacherous uncle with one of his ornamental guns. As the lone outlaw returns to the plains, he is joined by Thomas Junior, riding alongside him on a pony.",
      "writers": [
         "Adriano Bolzoni",
         "Adriano Bolzoni"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0078224/",
      "coverLink": null,
      "actors": [
         "Giuliano Gemma",
         "Sven Valsecchi",
         "Ettore Manni"
      ],
      "reviews": [
         "Lucio Fulci's \"Sella D'Argento\" aka \"Silver Saddle\" of 1978 is the last, and in my opinion the least interesting out of three Westerns directed by Fulci (not including his co-directing of Julio Buchs' \"A Bullet For Sandoval\" of 1969). \"Silver Saddle\" is definitely not a bad or boring Spaghetti Western, it is actually a fairly good movie, and Giuliano Gemma plays the lead very good, but I personally expected a little more from a Fulci Western, particularly after great \"Tempo Di Massacro\" aka \"Massacre Time\" of 1966 (with the great Franco Nero in the lead), and the moving though sadistic \"Quatro Dell'Apocalisse\" aka. \"Four Of The Apocalypse\", which was maybe no Spaghetti Western masterpiece, but which I personally liked a lot. \"Silver Saddle\" starts out very good, when little Roy Blood witnesses the murder of his father by a henchman of the powerful Barrett Clan, and subsequently subsequently shoots the murderer and takes his saddle, which is adorned with silver. Grown up, Roy Blood (Giuliano Gemma) has become a deadly gunslinger, who still uses the silver saddle. After befriending a crook named Two Strike Snake (Geoffrey Lewis), Roy obtains an opportunity to kill the patriarch of the Barret Clan, and therefore ultimately avenge his father's death. When Roy hides where he suspects his arch enemy, however, a little boy shows up instead. Some thugs try to assassinate the kid and Roy keeps them from doing so by shooting them all... ...and at this point things started to bother me. Cute little kids in bigger roles may work fine in many movies, but they do certainly not belong into a Spaghetti Western directed by Lucio Fulci. The little kid was probably intended to be 'cute' and/or 'funny', but, I'm sorry to say this, I just found the little brat annoying as hell, and although he even admittedly is funny in some points of the film, the whole movie could have been a lot better without him. Nevertheless, \"Silver Saddle\" is entertaining in most of its parts. A Spaghetti Western enthusiast, I have utmost respect for Giuliano Gemma for his performances in such films as \"Day Of Anger\" or \"The Price Of Power\", but I have never numbered Gemma among my favorite Spaghetti Western actors, since he hardly ever embodied the typical antihero, but was more of a typical 'good guy' in most of his films. Nevertheless, Gemma fits perfectly in some roles, and one has to say that his performance in \"Sella D'Argento\" is very good, and I could hardly imagine anybody else playing the role of Roy Blood. Geoffrey Lewis also delivers a very good, funny performance as Gemma's buddy Snake. The supporting cast furthermore contains two truly great Spaghetti Western regulars, Donal O'Brien, who only has a small role, and Aldo Sambrell, who once again plays a thuggish Mexican bandit. The locations are good, the score is OK, I especially liked Snake's theme, the only parts I didn't like about the soundtrack were the parts with the singing. All said, \"Silver Saddle\" has its flaws, they should especially have left the little kid out and there is a lot of other unnecessary and silly cheese throughout the film, but apart from that it is an enertaining if disappoining Spaghetti Western, with a fair amount of action and violence in it. As a Spaghetti Western enthusiast I found it to be an enjoyable time-waster, fans of Giuliano Gemma should give it a try. Don't expect too much though.",
         "Lucio Fulci will probably always be best known for his gory zombie movies; but he also directed some of the best films in the Giallo genre as well as a few other gems elsewhere. Fulci only directed three films in the popular Spaghetti Western genre; and I for one am thankful for that as it was clearly not his strong point. His first attempt at the genre, Massacre Time, was an above average western, if not especially brilliant. Four of the Apocalypse was well made but frankly dull, which brings us on to this film; which is more exciting (slightly) than Fulci's last effort, but too sappy for a western and too lacking in important areas. The plot is very typical for a Spaghetti Western and focuses on a man who, as a child, witnessed his father being killed. He grows up to become a bounty hunter going by the name of Silver Saddle and naturally he wants revenge and starts plotting once he finds the people behind his father's death. However, he ends up coming across the young son instead and after thwarting an assassination on the boy, sets off for his revenge. The music is generally a very important element of the Spaghetti Western; and again it's a place where this one is seriously lacking. The score is, simply, horrible. What we get is a singer droning on about the plot of the movie and it will do nothing but make you cringe! Ennio Morricone, this isn't. The film seems all too keen to shy away from the stuff that usually makes this genre so great - namely, violence and action, and instead decides to put its focus on the relationship between the central bounty hunter character and his enemy's nephew; a young and irritating blonde haired kid. This relationship may be interesting for some; but personally I found it very boring and it wasn't what I went into this film looking for. There are a few action scenes but nothing particularly startling and the way the film moves is rather boring far too often. Prolific Spaghetti Western star Giuliano Gemma takes the lead role and is one of the film's few saving graces as he puts in a believable performance. The ending is rather decent too and wraps things up nicely; but this is not a great western unfortunately.",
         "This 1978 release is generally considered as the last spaghetti western in the cycle commenced in 1964. The occasional entries from the eighties were simply a one off attempts to revive a genre which formally ended in 1978 but which had been in its death throes since the early seventies. This is a western for children directed by of all people Lucio Fulci with his trademark gore nowhere to be seen. Gemma who was always a heroic presence rather than an anti hero was perfectly cast for the film intended by the producers. The story has a young boy seeing his father murdered and murdering the Killer and taking his silver saddle.Growing up as a feared bounty hunter he saves the life and befriends the young nephew of the man he intends to kill for having commissioned his father's murder and from this point on the action and mild violence take a back sear to th relationship between Gemma , the kid his beautiful aunt and his partner a sympathetic crook excellently played by Geoffrey Lewis. A good but not exceptional score is aided by a catchy title theme in the De Angelis mold. Not a great film, maybe not even a great spaghetti western but very enjoyable from start to finish.",
         "The third and last of Fulci's Spaghetti Westerns (coming at the tail-end of the genre) - not up to the vintage MASSACRE TIME (1966) but preferable to the disappointing and unpleasant THE FOUR OF THE APOCALYPSE (1975) - with a distinct kiddie interest, since the violence isn't particularly graphic. In fact, even if star Giuliano Gemma (perhaps best known for two \"Ringo\" Westerns) is given the possibility of a couple of romances, the central relationship involves him and the young nephew of his sworn enemy! As such, it emerges as unremarkable but surprisingly engaging, with a pleasant soundtrack and able support from Geoffrey Lewis (as Gemma's sidekick, a more likable version of the slimy bounty-hunters played by Strother Martin and L.Q. Jones in Sam Peckinpah's THE WILD BUNCH [1969]), Ettore Manni (as the chief villain) and Aldo Sambrell as a Mexican bandit-leader.",
         "...and which adults might enjoy, too. Fulci's best western was the imperfect but striking and alchemical \"Four of the Apocalypse,\" which was alternately shocking and touching, and meandered along at an engaging pace, letting the viewer soak in the detail and peripheral touches. While this is not up to the standard of that film, I find Silver Saddle to be preferable to his conventional, by-the-numbers \"Massacre Time\" (which, for some strange reason, its director insisted on referring to as \"oneiric,\" although there is nothing dreamlike about it). If you enjoy this film, you might want to check out \"White Fang,\" also by Fulci.",
         "Like the same director's \"Four of the Apocalypse,\" whether or not this film ultimately succeeds for you probably depends on your willingness to tolerate its flaws for its strengths. Its flaws include bad acting on the parts of Giulliano Gemma and Sven Valsecchi, who are the two leads, a frustrating tendency to establish promising themes, only to allow them to dissipate after the first thirty minutes, and another frustrating tendency to put all the best action scenes in the first act. Its strengths include the presence of Geoffrey Lewis, Aldo Sambrell, and Donald O'Brien, some excellent classic western action that's filmed with a modern sense of realism (read: BLOOD SQUIBS), and great photography, locations, costumes and sets that give an overall feeling similar to that of Fulci's other 70's western, mentioned above. The musical score, overall, is great and befits the feel and tone, although the hippy-dippy theme song may mar it for some. For fans of Fulci and/or Italian westerns from the 70's, this is more than worth checking out...between this and \"Four...\" it's obvious the guy was up to something interesting and cool with his westerns during this time period, it's just too bad he didn't have a better sense of pacing and focus and evidently wasn't aware that you save your best tricks for the end of the movie, not the beginning.",
         "Surprisingly lousy Western, especially considering that \"Silver Saddle\" comes from the creator of \"Four of the Apocalypse\" and \"Massacre Time,\" which are two of the finest Italian Westerns of them all. This movie is a dud, dragged down by a lead who lacks the hardened charisma needed for a role of a lone cowboy bent on revenge and living off the rough terrain. Giuliano Gemma looks like he should be picking up gals, (or maybe even men) in some Euro disco, circa 1978. The fact that Gemma is wearing more make-up than a saloon hooker, doesn't make matters any better. Maybe in the days of grainy VHS tapes it could pass unnoticed, but that hi-def picture quality is unforgiving, and our hero is plainly wearing eyeliner and blue eye shadow and more foundation than a drag queen. But what really sinks the whole production is the music; there is this \"theme song\" that is so unbelievably sappy, corny and ridiculous, that I thought it must be some kind of joke. And the song is played again, and again...and AGAIN, throughout the movie. This fitfully dire song completely destroys a movie that wasn't any good to begin with. The story concerns a lame revenge plot; he sees his father killed in the beginning of the movie, grows up and seeks revenge. Original, huh? After watching the amazing \"Massacre Time,\" and thoroughly enjoying the intelligently written and realized \"Four of the Apocalypse,\" I felt like I had to search our Lucio Fulci's less-known \"Silver Saddle.\" Now I know why it's so obscure; it sucks..",
         "While Italian movie director Lucio Fulci is best known for his bloody horror movies, he actually did dabble in other genres in his career. He even made a few spaghetti westerns, \"Silver Saddle\" being one of them. Made when the spaghetti western genre was breathing its last breath, it's been all but forgotten today. To a degree I can understand this. It does have more than its share of dull spots, and Giuliano Gemma is only adequate in the lead role. But the movie all the same has enough interest to satisfy spaghetti western fans. Fulci throws in some interesting direction at times, such as with some particular camera movements as well as how he composes what's in front of the camera. Though there isn't enough action, what action there is in the movie does catch your attention, particularly with some very bloody squibs thrown in. Gemma's somewhat underwhelming performance is made up for by the presence of American actor Geoffrey Lewis, who is amusing without being overbearing. And the music is great; you'll be humming the title song for days after watching the movie. It's no classic, but it's a respectable final effort for a genre that was breathing its last.",
         "This fairly late entry to the western genre is fairly typical of its sort, kept lively thanks to some interesting characters and well-staged shoot-outs in the desert. The twisty-turny plot - almost episodic in nature - concerns the trials and tribulations of the bizarrely named Roy Blood, who began his life at 10 years old when he witnessed his father getting shot dead in cold blood by a crook. Picking up his father's fallen gun, he shot the man in the back and thus the legend of the \"Silver Saddle\" was born, a man who brings death and destruction wherever he goes. Director Lucio Fulci (taking a break from his more usual horror fare) keeps the events pacy and invests the many shootings and murders with his trademark penchant for exaggerated violence, with bullets entering faces and chests, although don't expect any of the gory special effects he brought to the crime thriller CONTRABAND. He also keeps the eye close-ups and zooms to a bare minimum, although the film is not totally lacking in them. The fast-paced story concentrates on incident over dialogue, which is a plus, and also which makes it a very easy viewing experience. The film's biggest flaw is probably the overly cheesy theme song which keeps on recurring throughout the movie, although it did make me burst into laughter every time it kept popping up. The shoot-outs are extended and well staged, throwing in imaginative props (like carbide bombs) into play along with lots of explosions and stunt work. Other unusual ingredients include a kite acting as a rescue beacon (!) and a monastery of monks getting slaughtered and hanged (what with this and CODENAME WILDGEESE, I'm beginning to think Italian directors have something against religious pillars of the community). Another problem is with the film's lead, the wooden Giuliano Gemma, who bears an uncanny resemblance in profile to James Woods. Gemma isn't that bad, but he fails to make his leading character likable, so its hard to get enthused about his actions. To make up for this, we have a strong supporting cast including Ettore Manni as a baddie, the surprisingly likable Sven Valsecchi as the kidnapped kid who has a prominent part (despite looking annoyingly cute like the kids in Fulci's horror films, he's actually not a bad actor and sympathetic with it), and Cinzia Monreale as the damsel in distress. On top of this, good ol' Dr Butcher himself, Donald O'Brien appears as a hired hand, while genre favourite Geoffrey Lewis puts in another excellent and charismatic turn as Two Strike Snake, an unlucky thief who enjoys picking the pockets of the dead. Lewis' strong turn is one of the film's highlights. Despite treading much the same ground as many other westerns, SILVER SADDLE is a fresh and entertaining movie with a plot complex enough to stay interesting yet without getting muddled, and one which I thoroughly enjoyed watching.",
         "I bought this movie in the early 1990's, saw it once, and then it had been lying on the shelf more than 10 years (approximately). When I finally brushed off the dust and decided to see it again (remembering absolutely nothing about it), I wasn't as disappointed as I first thought I would be after just looking at the video-cover and reading the words: \"This is a real Gun-man Western!\" and thinking it would be filled with cliches and stupid dialogue. The beginning was actually the best part in the movie, and I thought that it should have ended just when the little boy rode off into the sunset after the shootout. But no, they had to carry on for a whole hour after that!... in that hour, a romantic (meaningless of course) relationship occurs with Roy Blood and some woman (who actually looks quite pretty, I must say). Some bad guys suddenly appear from nowhere and of course feels like shooting it out with our hero Roy Blood (played by Giuliano Gemma). Geoffrey Lewis (who's the father of Juliette Lewis, and who has been in a whole bunch of Clint Eastwood-movies and other minor or major films) appears in a role as a sleazy guy called 'Snake' (I didn't even notice his name on the cast, because they had like 7 or 8 Italian no-names listed ahead of him!!), I thought he should have been at least the third-highest placed person on the cast overview list. The movie made me laugh a couple of times, even though I don't think it was intentionally by the director, except the hilarious ending which blew my mind completely!.. It was a truly amazing scene, one that saved the entire movie in my opinion... I give the first part of the movie 1/3 points (because I thought the daddy-killer looked like Johnny Cash, and he's cool), the middle section 2/4 points (because I was glad to see at least ONE familiar face in the movie [G. Lewis]), and the ending I give 2/3 (Well, you'll have to see it to believe it... even though some might think it is very ridiculous!).. All in all, a pretty average western, with a hokey plot, but okay if you don't have anything better to do with your time. 5/10",
         "I must confess, dear Gemma (presumably) fans, that I have never seen a bad or uninteresting Italian western; never. Many of them have certain noticeable deficiencies in the content's sector\u0097yet, despite this poor content, they are well\u0097made and likable. The one I have chosen here looks very low-budget; it has some qualities that make it very enjoyable, and a must for all Gemma fans. It shares with other similarly themed films the same desolate, barren landscape and notions of a dehumanized society. To describe it in one word, Silver Saddle is a somewhat _cartoonish non\u0097stop adventure western. Very compact and concise , while the content itself is quite average (the kidnapping and ransoming of a boy). (Allow me here a parenthesis, to mention that the western as a genre meant to me:--at first comics, in Romanian and French magazines;--then books, novels\u0097Frânculescu, Reid,May and Cooper \u0085;--in the third place, movies \u0085. So I guess I especially enjoy this comic book look of the westerns.) In a certain sense, I like Gemma more than Nero. He has, if I may say so, a more interesting presence . Sella d'Argento (1978) came one year after California (1977) (another good Gemma western),and two years after The Desert of the Tartars. It marks the end of Gemma's career as a western mythical actor\u0097as well as that of the European westerns as such. These movies are still considered like something of a guilty pleasure\u0097and still don't receive the esteem they deserve. Sella \u0085 is a quite straightforward western, no-nonsense and violent; there is a scene of cruelty, when a kid is whipped by Garrincha. The tone is fortunately deprived of melodrama. Some of the characters are comic, or funny, or do comic things\u0097Serpent (who is comic, but in a grim way) and the kid. The silver saddle in this film is an item belonging to Roy Blood,a gunman played by the cult\u0097actor Gemma. The score that accompanies the suspense moments is very good; the song with English lyrics a la Keoma is less happily chosen. At least six of the characters are noticeable\u0097Roy Blood himself; his partner Serpent; Turner; Sheba; Margaret; and the kid.\"Creatures bizarre and grotesque, yet somehow always familiar\"\u0097as Nathan M. Powers once happily wrote about Lem's world of Ijon Tichy. Like in many other Italian westerns, there is a strange, uncanny atmosphere.It is Lucio Fulci's film."
      ],
      "genres": [
         "Western",
         "Action"
      ],
      "productionCompanies": ["Rizzoli Film"],
      "summaries": ["Young boy who sees his father gunned down kills the assassin. Years later, he has grown up to be a successful bounty hunter who is feared by many. And then one day he discovers secrets to his past..."],
      "budget": 0
   },
   "movielensId": 145586,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1978-04-20",
      "dvdReleaseDate": null,
      "directors": ["Lucio Fulci"],
      "runtime": 100,
      "movieId": 145586,
      "title": "They Died with Their Boots On",
      "mpaa": null,
      "actors": [
         "Giuliano Gemma",
         "Sven Valsecchi",
         "Gianni De Luigi",
         "Licinia Lentini",
         "Philippe Hersent",
         "Karine Stampfer",
         "Agnes Kalpagos",
         "Maria Tinelli",
         "Sergio Leonardi",
         "Geoffrey Lewis",
         "Cinzia Monreale",
         "Donald O'Brien",
         "Aldo Sambrell",
         "Ettore Manni"
      ],
      "imdbMovieId": "0078224",
      "originalTitle": "Sella d'argento",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Young boy who sees his father gunned down kills the assassin. Years later, he has grown up to be a successful bounty hunter who is feared by many. And then one day he discovers secrets to his past...",
      "tmdbMovieId": 42326,
      "avgRating": 4.16667,
      "releaseYear": "1978",
      "numRatings": 3,
      "posterPath": "/1olE46at1apYuFU0GLkFvKEnwFL.jpg"
   }
}