{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0094997",
      "video": false,
      "title": "Demonia",
      "recommendations": [
         100482,
         51523,
         140231,
         18496,
         74807,
         21121,
         194809,
         27827,
         39897,
         61416,
         14162,
         74494,
         134415,
         44124,
         25869,
         20534,
         136228,
         101733,
         70779,
         336666
      ],
      "backdrop_path": "/hkDEcYNVZ7hxqVrauv8yKKIDUkT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Professor Paul Evans",
               "gender": 2,
               "credit_id": "52fe45b6c3a368484e06ab31",
               "name": "Brett Halsey",
               "profile_path": "/hjBkow0XlwQAwnDhV613YaMbK8G.jpg",
               "id": 31896,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Liza Harris",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab35",
               "name": "Meg Register",
               "profile_path": null,
               "id": 102168,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Turi DeSimone",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab39",
               "name": "Lino Salemme",
               "profile_path": null,
               "id": 99545,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Susie",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab3d",
               "name": "Christina Englehardt",
               "profile_path": null,
               "id": 102169,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kevin",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab41",
               "name": "Pascal Druant",
               "profile_path": null,
               "id": 102170,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Lilla",
               "gender": 1,
               "credit_id": "52fe45b6c3a368484e06ab45",
               "name": "Carla Cassola",
               "profile_path": "/gZV6RE9XpLO5NZhJajGhKPAGbTw.jpg",
               "id": 76236,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Lt. Andi",
               "gender": 2,
               "credit_id": "52fe45b6c3a368484e06ab49",
               "name": "Michael Aronin",
               "profile_path": null,
               "id": 102171,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Porter",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab4d",
               "name": "Al Cliver",
               "profile_path": "/lQTPaWTC4yjVDzMGvBj9Nl2k73w.jpg",
               "id": 52063,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Pregnant Nun",
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab51",
               "name": "Paola Cozzo",
               "profile_path": "/jVciWXapFfArObJ2IoN3DYDObsQ.jpg",
               "id": 99549,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Inspector Carter",
               "gender": 2,
               "credit_id": "52fe45b6c3a368484e06ab55",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b6c3a368484e06ab2d",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab5b",
               "name": "Piero Regnoli",
               "profile_path": null,
               "id": 49894,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b6c3a368484e06ab61",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab67",
               "name": "Giovanni Cristiani",
               "profile_path": null,
               "id": 1052143,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab6d",
               "name": "Luigi Ciccarese",
               "profile_path": null,
               "id": 45578,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b6c3a368484e06ab73",
               "name": "Otello Colangeli",
               "profile_path": null,
               "id": 40889,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.43347,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 28847,
      "vote_count": 12,
      "budget": 0,
      "overview": "A Canadian archaeological team in Sicily accidentally unleashes vengeful ghosts of five demonic nuns whom were murdered 500 years earlier and the ghosts now set out to kill the group and townspeople alike.",
      "similar": [],
      "original_title": "Demonia",
      "runtime": 85,
      "poster_path": "/7NA3rSXWr5q6Wf4nmvVMigiXzFe.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1990-10-01",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "No Evil Deed Goes Undone!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucio Fulci"],
      "runtime": 85,
      "synopsis": "Sicily, 1486. A mob of villagers drag five kicking and screaming nuns into a cavern beneath their convent, built atop a steep hillside. They are tortured, nailed to five of the many wooden crosses in the underground chamber. Toronto, Canada, 1990. A séance is in progress. A young woman named Liza (Meg Register), has a vision of the crucified nuns and falls screaming onto the floor. She is taken home where her boyfriend Professor Paul Evans (Brett Halsey), a noted archaeologist and her former college professor, comforts her. Several months later. Liza and Professor Evans are surveying Ancient Greek ruins on a site near the small town of Santa Rosalia, Sicily. With them is a team of assistants who are meant to be helping, but spend most of their time drinking. Liza is distracted by the beautiful, but ominous ruin of a monastery which overlooks the dig. Professor Evans chides her for exhibiting a morbid interest in the rumors surrounding the ruins history. The include tales of unspeakable practices conducted there in medieval times. He reminds her that she is supposed to be avoiding any involvement with the supernatural since her mental breakdown back in Canada months earlier. At the quayside, the professor talks to Porter (Al Cliver), a colleague on his sailboat all about the ruins history in which Porter persuades him to avoid the ruins and concentrate more on the Greek ruins. Also hanging around the dig is Turi De Simone (Lino Salemme), the hot-tempered local butcher, who voices the town's hostility to the strangers. He follows Liza into the ruined building and warns her not to go any further, but she continues after he leaves. In the monastery crypt, Liza becomes convinced that there is another chamber behind a wall and attacks it with a pick-axe. Sure enough, she discovers a cavern containing the charred remains of the five nuns hanging on wooden crosses. Liza runs outside in horror and bumps into Professor Evans. He seems intent on browbeating her into suppressing all mention of what she found. But the opening of the crypt has apparently freed the spirits of the five nuns, putting into motion a series of supernatural events. That evening, Porter is killed on his boat when he is shot with a harpoon gun by a ghostly nun, who then disappears. The next day, the people in the village are feeling so irate against the outsiders near their community that the young butcher, Turi, can openly discuss murdering the visitors. Meanwhile, Liza pursues her investgation into the monastery by checking the local church records at the local library, but discovers a huge sheaf of pages missing. A strange-looking woman (Carla Cassola) appears in the dusty corridors and invites Liza to meet her the following day at her apartment to hear the whole story. That evening, two of the archaeologists, Irishmen Sean (Grady Thomas Clarkson) and Kevin (Pascal Druant), get blind drunk and decide to wander the ruins. They hear giggling female voices and see flittering shadows. Following them, Sean and Kevin are killed when they fall through a weak floorboard and land into a pit of metal spikes. The following morning, Inspector Carter (Lucio Fulci) from Interpol arrives to investigate the deaths, and to question Professor Evans on his knowledge of the area. Liza meets with the old woman as arranged in her apartment. The old woman tells Liza about what happened at the ruins centuries ago. The nuns practiced witchcraft and held orgies there as well. Local youths wound be invited there for sex, then murdered as they reached orgasm. The nuns would drink their blood in a satanic frenzy. If any one of the crazed nuns would become pregnant, they would carry their unwanted babies to full term, then throw them onto a fire after giving birth to them. Meanwhile, the police investigation into the dig becomes more urgent when Inspector Carter arrives at the marina looking for Evans' colleague Porter, whose severed head is found impaled on the anchor of his yacht. In town, the old woman is the next victim when she is attacked by her house full of cats and she is clawed to death, her eyes scratched out. When Professor Evans makes a casual remark to Inspector Carter, he puts suspicion on Turi the butcher. But that evening, Turi is killed as he is closing up his shop when an unseen figured dressed in all white attacks him in his walk-in freezer. The figure stabs him with a meat-hook though his neck, and his tongue is nailed to the chopping board. Inspector Carter arrives later that night with the local police to investigate when Turi's wife has called them to her husband's disappearance. Carter finds Turi's dead body locked in the freezer. Carter also finds a piece of torn clothing clutched in Turi's right hand which apparently belonged to his killer. Suspicion on Turi's murder first falls on Professor Evans who reacts by announcing that the dig will be abandoned, but Liza, acting more and more strangely, refuses to leave. News of the death of Turi has incensed the townspeople who mount an attack on the haunted ruins. Professor Evans tries to get his team clear, but he can't find Liza, who had wondered off during the night. John (Ettore Comi) and Susie (Christina Engelhardt), a married couple on the team, realize their young son Robby has gone missing too. John runs through a nearby woods looking for Robby, while Professor Evans goes off to look for Liza. Meanwhile, Robby is being dragged through the woods by a white-robed, faceless nun (Liza?). The little boy pulls free and runs through the woods back to camp. Then, Robby inexplicably discovers his father tied by the ankles between two bent saplings. Running to help, the boy trips a rope, the trees spring upright, and John is literally ripped in half down the middle. The blood-splattered Robby returns to the archaeology camp, too traumatized to speak to his screaming and hysterical mother when she finds him covered in blood. Professor Evans runs towards the ruins looking for Liza who appears dressed in a white robe, obviously processed by the leader of the evil nuns. With a huge mob of townspeople advancing not far behind him, Professor Evans runs into the ruins after Liza who turns around and stabs him in the stomach with a butcher knife, and then disappears like a ghost. The mob of townspeople charge into the ruins, running past Professor Evans lying severely wounded on the ground. The mob converge on the hidden chamber and Liza reappears, foaming at the mouth on one of the crosses. The mob sets her and all the skeletal remains of the nuns afire. The wounded Professor Evans staggers into the cavern, pushing the mob members out of his way, to see Liza materialize at the foot of the burning crosses, no longer processed but dead.",
      "writers": [
         "Piero Regnoli",
         "Lucio Fulci"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0094997/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg2OTE1MzMxM15BMl5BanBnXkFtZTcwNzEyMzcyMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Brett Halsey",
         "Meg Register",
         "Lino Salemme"
      ],
      "reviews": [
         "Meet Paul Evans, the world's worst archeology professor. He's arrogant, self-centered, disdainful towards other cultures, and dismissive of his students' opinions. And while we never see any direct evidence that he's sleeping with his star pupil, Liza, his condescension, paternalism, and control-freaky behavior pretty much clinches that deal. In the real world, he should've imploded from the weight of his own obnoxious ego long ago, but without him, Demonia would probably be a non-starter, so I guess we have to put up with him. But it's Liza who's got the real problems here. She's got some kinda psychic link to a group of five dead Satanist nuns who are angry that the villagers rose up and crucified them lo these many years ago. (But isn't that what angry villagers do?) So they trick Liza into freeing them so they can wreak their unholy revenge upon . . . the archeology team? What did they do? Or maybe Liza is possessed, and she's the killer? She does spend part of the movie running around in an antique habit that she got from God-knows-where, and one of the killings is kinda set up to frame Paul, so maybe that's it. But then, why is there a ghost-nun running around in so many scenes? Hmmmm . . . Well, it really doesn't make too much sense if you try to think it through - it is an Italian shocker, after all. Once the killings start, plot goes out the window in favor of cool atmospherics and a hefty dose of gore. And there's gore a'plenty here - crucifixions, beheadings, mutilation, animal attacks, impalings; you name it, this movie will step up and drive a nail through it. As usual, you can count on Lucio Fulci to deliver the goods.",
         "It didn't stink, but it was nowhere near the brilliance of \"Zombie.\" It was more like \"Gates Of Hell,\" a so-so plot with some decent scenes to keep us interested. Italian nuns get crucified in medieval Italy for...wait for it...being a secret satanic coven. Years later (aka present day) they rise and attack a Canadian archaeology team digging under the ancient churches. Lucio re-did his zombie films with nuns. There's some good creepy atmosphere here. And the story itself isn't bad, it just doesn't really take off. Al Cliver gets a cameo role and the Maestro himself shows up as a (what else?) high-ranking cop. And Canadian Brett Halsey does a good job in the lead. The drawn and quarter scene, despite the shoddy effects, (DeRossi where were you?) will make a few of you cringe. It seemed to ape Deodato's \"Cut And Run\" scene stealer. It makes a good addition if you're a completist, but Lucio's done better.",
         "Not the worst of Fulci's films (MANHATTAN BABY wins that dubious distinction in my book...) but DEMONIA takes so long to get to any of the classic Fulci \"good-stuff\", that you'll probably be asleep by then. Two archaeologists are digging around Sicily, and the locals don't like it too much. Apparently a group of nuns who were into group sex and Satanism once resided at the site of the dig. The locals don't like the scientists messing around in their backyards, and when some strange deaths occur around the dig-site, all hell breaks loose. Luckily, DEMONIA does come with the \"goods\" towards the end. A good tongue-hammering, and a guy split in half are a couple of the notable scenes - unfortunately, the story isn't interesting enough for you to care by the time you get there. Drawn out and boring storyline isn't saved by a few cool gore scenes. Worth a look to the TRUE Fulci fan - don't expect a gore-fest masterpiece...5/10",
         "In 1486, in Sicily, five nuns are crucified in their nunnery by the superstitious locals that believe they are evil and worship devil. In 1990, in Toronto, the skeptical archaeologist Professor Paul Evans (Brett Halsey) and his superstitious colleague Liza Harris (Meg Register) explore with their team the medieval dig where the nuns were killed. Liza has dreadful nightmares with the nuns while members of the expedition mysteriously die and the locals are against the research in the archaeological site. \"Demonia\" is a deceptive Lucio Fulci's gore movie. The terrible story is never scary or intriguing; actually it is boring, with the low pace of the first half, and ridiculous with an awful conclusion associated to an annoying soundtrack. It is funny to see, for example, the blonde archaeologist that is superstitious, participates in séances and is scared after finding coffins with bones in a crypt. My vote is five. Title (Brazil): Not Available",
         "..But she's no Catriona Macoll. Wow.....I like \"Zombie,\" \"The Beyond,\" even have a special place for \"The Gates of Hell.\" For some idea of this one's rank in the Fulci canon, \"Aenigma\" is better. This one makes no sense, the gore is cheap, and everyone, including Lucio must have been sleepwalking when they made this. Sure it ain't the worst thing ever, but it's pretty bad. Flatly directed with a potentially interesting storyline, Fulci missed the target big time with this.",
         "In XVth century church group of nuns committed a religion blasphemy. All women preformed satanic rituals and wild orgies with strangers, who later vanished in a mysterious circumstances. Of course it had an effect. One of the nuns gave birth to a child, which was immediately burn. People who lived nearby church had enough and decided to crucify wicked nuns. A few centuries later group of archeologists started to do the research nearby ruins of church. This fact made locals very suspicious and unfriendly, because of superstition of murdered nun's revenge. It's question of time when sinner's ghosts came back to get their death toll. Fulci always goes from one extreme to another. Once his movies were full of suspense [\"Murder to the Tune of the Seven Black Notes \"] or gore [\"Zombie Flesh Eaters\"]. Demonia is a try to mix these two. But, it's failed. Fulci tries all of his suspense tricks such as eye close-up, sudden zooms and creating orinirique atmosphere. But it makes this film worse. Close-up looks really poor and zooms are very annoying. Oh, we can't forget about music. Sometimes it honestly can build atmosphere but it's only one scene. In other ones, especially in ruins where we hear drunk organist's symphony it's driving insane. Gore also lets down. There are only two scenes, of which one is typical for Lucio (eyes scratched out by a cat)but second one - tearing man apart - really satisfied me. The biggest flop is main character and strictly speaking acting. Her looks brought me a lot of fun. For example, in scene where Paul (leader of archeologists) says to her that they must leave her look is wonderful! It's similar to kid's look when they are forbidden to eat sweets/play computer games/whatever. But all of these are nothing when we compare it to the ending! I have seen many bad movies, but it's first really PA-THE-TIC ending in my life. There is nothing better than view of burning nun in company of soap opera's music! As for me, it's probably top bottom of Lucio Fulci's movies and it's a little pity, because the plot is quite good.",
         "Italian horror legend Lucio Fulci (1927-1996) did a great amount of atmospheric and wonderful Spaghetti horrors during his prolific career, his masterpieces being Zombie Flesh-Eaters (1979), The Beyond (1981), The House by the Cemetery (1982) and Don't Torture a Duckling (1972) among many other more or less interesting and noteworthy films from the horror or other genres. His masterpieces have wonderful soundtracks by composer Fabio Frizzi, great cinematography by Sergio Salvati and the kind of surreal and infernal ultra gory imagery that will stay inside the mind especially when experience for the first time. But his career has the other side, too, these ultra braindead cheapies that are so painful to watch especially if one appreciates the director at all. Demonia is Fulci's attempt in the nunsploitation genre, at least kind of. It has a historical background as a bunch of Sicilian nuns were brutally killed in the convent as they had practised something the others judged as evil and satanic. This is shown as a flashback, just like in his The Beyond, but so much less effectively and it comes clear in this very beginning that even the gore effects are very bad and stupid in the film. Then we jump to the present day as some group of archeologists search for treasures from the historic times (if I'm correct, the mentioned nun killing took place in the sixteenth century) and naturally neither the villagers nor the raising evil spirits like this too much and soon the bloody killings begin...as well as all the possible errors and negative sides a film can have. There are hardly any positive things to be said about this piece of cinematic garbage. None of the Fulci magic is left. Some of the dream sequences and close-ups of frightened eyes remind me distantly of Lucio Fulci but still, there's nothing in the imagery that would save the film. The ending has some nightmarish scenes and images as the nuns return from the beyond, but The Beyond shows how great that kind of scenes can be. The music is also horrible and probably taken from a commercial or something like that. It doesn't create atmosphere and terror as Frizzi did but is there in order to make the silent scenes not to look so dull, which they still are as well as the whole film. What's there is the graphic gore and very boring 80 minutes. The film almost gives a new meaning to the phrase \"dead boring\" as it has some laughably long dialogue sequences which almost force to stop the viewing. The characters are uninteresting, but fortunately don't over-act too much, the plot is nothing too special (but could have been interesting if made by Fulci ten years earlier) and every single element in the piece screams in tired pain as does the viewer too. The film also looks very amateurish as if done by a bunch of amateurs and it is no wonder this didn't even have a theatrical run in Italy. The gore scenes are also very bad and the effects don't even look real as they did in the classics, created by Gianneto de Rossi. They are quite sadistic and graphic at times, the \"body splitting\" and tongue impaling, being the most memorable examples, but still they are not as haunting as in the earlier films that were also effected by the soundtrack and visuals. Now there's plenty of gore but hardly any impact. They show more than Deodato did in Cut and Run, for example, but as everything around the scenes sucks, it is hard to take the horror shocks too seriously. The butcher house sequence, however, is a pretty nasty as an idea and has some interest in it, too, and that is also easily among the film's \"most interesting\" parts. And the guy really has a tongue that makes Gene Simmons look green in comparison. Demonia is a very, very bad film even as a fan of Lucio Fulci. It has practically nothing to make it worth recommending, only those very few distant things mentioned above and I think it is rather impossible to watch this film again. It is so bad, as unfortunately was the state of Fulci's career when he was forced to make films like these. 2/10 and very barely so.",
         "A team of archaeologists are exploring the ruins of an ancient crypt in Sicily where five heretic nuns had been stoned and crucified by superstitious villagers.One of them Liza starts to suffer terrible nightmares about the nuns and other members of the team start to die in particularly horrible ways.\"Demonia\" is a mediocre Lucio Fulci's nunsploitation flick that offers surprisingly little amount of gore including a tongue nailed to a barrel an,eye-gouging and an \"Inferno in Diretta\"-style decapitation between two springy trees.Still the film is well-shot,picturesque and enjoyable enough to give it a 6 out of 10.However if you are new into Fulci I suggest watching first \"The Beyond\" or \"City of the Living Dead\".",
         "The first impression this film gave me when it first came on was that it was a lot older than its 1990 release date. The picture quality just was off as if I were to pick which Fulci film was the oldest between \"The Beyond\", \"City of the Living Dead\", \"House By the Cemetery\" and \"Zombie\" I would say this one was the oldest. There was also something very weird about the bedroom the one character was in when she was taken there by her professor. The story has said professor with said student going to Sicily to do an archaeological dig to try and uncover some Greek relics. Unfortunately, there is a monastery nearby that the female student is drawn too, and it turns out it is the site of a nun crucifixion. You will follow the woman as she tries to unravel its mysteries as she is very much drawn to the place. Along the way we have some good kills and some rather pointless subplots such as the professor being questioned about the murder of one of the people killed. You will also see a very strange death as a man chases after his son in one scene, boy gets away and dad is somehow staked in the ground his legs in the air and let me just say good death that may have had a bit more impact if said character had been established. I did not even know until then he was the boy's father. The ending makes me wonder what the point the film was trying to get across too. Just not up there with earlier Fulci horrors, it is nice that he did not focus on the eyes every five seconds, but that still does not make up for the general mayhem at the end. He was actually putting forth a good plot, then it kind of falls apart. Better than \"Manhattan Baby\", a film I saw by him a couple of days earlier, but this one too suffers from this need of the man to just shoot random things at times. This one also did not have the atmosphere of earlier films by him. Had its moments, but just not as fun as some of his other work.",
         "\"Demonia\" of 1990 is one of the last films by Italian Horror/Gore deity Lucio Fulci, and while it certainly ranges among the man's lesser achievements it is still a stylish little film that should be enjoyed by his fans. The film's main problem is that it is a bit of a mess, and that it truly pales in comparison to most of Fulci's other achievements, even becoming a bit boring in some parts (which is a very rare fault in a Fulci film). Yet the film is interesting in its Fulci-typical style and atmosphere and features several truly creepy moments as well as some spectacular gore-scenes. What also makes the film worth checking out is the fact that the master himself has a role - Fulci plays a police Inspector. The storyline is actually very promising Horror-material: In 15th century Sicily, a Covent of nuns who are suspected of conspiring with the devil are lynched by angry villagers. Five centuries later, Canadian archaeologists come to the area and are met with hostility by the superstitious locals. The locals fear that the strangers and their archaeological work might raise the demons of the past; and their worries are not entirely unfounded... Overall, the film has a promising premise but the execution is too messy. Yet it is recommendable to Fulci fans, as it does include many moments of pure creepiness. The master does show his talent for haunting atmosphere, and once again proves that his moniker \"The Godfather of Gore\" is justified. While \"Demonia\" should entertain many of my fellow Italian Horror buffs, it might make others roll their eyes. My advice to fellow Fulci-fans: check it out! Others, never mind.",
         "Demonia seems to be a movie by Lucio Fulci that I don't know about... the death scenes in this movie are corny and are not the same to other death scenes in Fulci's earlier films, mainly the ones from the late 70's to middle 80's. I think it was because of the special effects director was changed or something, I'm not sure. But the one I remember was the one scene where the guy is caught upon a trap while trying to get his son from one of the nuns or whatever, and the guy is split apart from his son tripping upon a rope or something. The effects looked terrible, I'm sorry. Otherwise, the movie was weird to me. Not saying that the movie is a piece of crap, though it could be better. The music was... well, I think it could be better. I liked the intro music, plus the music following the intro scene. So, final verdict? Well, Demonia is a mixed bag of good and bad. If you're a true Fulci fan (like me), then this is your movie. If not, then... I guess you should give it a try. Demonia, the 'What the Babuguganosh!?' moment of Fulci's career. Also, Al Cliver (Zombi 2) actually is in this movie, though he is credited as Al Clever... clever, I must say, eh? Ha ha ha... ha???",
         "Dull, lifeless direction... A total lack of atmosphere... Dialogue scenes that stretch on endlessly... A story that fails to rile any tension... Gore that's on par with a home movie... Lucio Fulci is high on my list of favorite directors (check out his early-'80's output to see what I mean), but \"Demonia\" is one of his worst movies, not even worth the trouble to revive on video, in my opinion. Zero/10",
         "Sicily. 1486. A bunch of villages descend on five nuns — suspected of being witches — and drop the witch hammer on them. Each is crucified and then nails are driven into their chests. Blood sprays everywhere. Fulci is pleased. Toronto. 1990. Liza is at a seance where she sees the crucified nuns and collapses, screaming on the floor. Perhaps you may recognize that this is kind of how Fulci began City of the Living Dead. Liza then joins an archaeology team led by Professor Evans (Brett Halsey, The Devil's Honey) as they visit Greek ruins near Sicily. Locals like Turi (Lino Salemme, Ripper from Demons!) and Porter (Al Cliver, 2020 Texas Gladiators, Zombi 2) warn them of the local legends that surround the monastery. And even after Professor Evans warns Liza to stay away from the unknown after the way she reacted to the seance, she enters the crypt within the ruins. Using a pickaxe, she breaks into the wall and finds the remains of the nuns, angering the Professor and setting off a series of murders, like Porter being killed by a nun with a harpoon gun and two members of the team being killed by metal spikes. Ignoring Turi's angry rebuke, Liza enters the monastery crypt. Convinced that there is another chamber behind a wall, she uses a pick-axe to break into the cavern containing the charred remains of the five nuns. But when Liza tells Professor Evans what she has found, he angrily tells her to forget she saw anything. Liza meets with a medium named Lilla, who tells her all about the witches. They'd invite young people to partake in orgies and kill them at the moment of orgasm, drinking their blood and going insane. If they ever got pregnant, they'd have the baby and throw it into a fire. Suffice to say, these are very evil nuns we're dealing with. The kind of evil nuns that make Lille's cats eat her the moment Fulci leaves. If you're wondering, do they eat her eyeballs, then the answer is yes. Obviously, you know Fulci like I know Fulci. Everyone suspects Turi, but he dies, too. A nun comes into the butcher shop and impales him on a hook, then stabs him in the neck, then nails his tongue to a block, then freezes him. Fulci, you scamp! Inspector Carter (Fulci) starts to suspect the Professor, who decides to get out of town. Liza is going crazy and she refuses to leave, even when the townsfolk attack the ruins. Robby, a young boy, gets kidnapped by a white nun with no face, but he escapes just in time to watch his father get torn in half. Fulci strikes again! Liza then stabs the Professor and disappears. The townsfolk charge into her chamber, where she foams at the mouth as she hangs on a cross. They set the crosses on fire again and everyone is destroyed, leaving the Professor to stagger in, bloodied, where he sees Liza's dead body. There are some great shots in the open here, with the camera wildly swinging through the seance and the nuns being executed. And the film looks so much better than Touch of Death. The city feels like Lizard in a Woman's Skin. It starts like City of the Living Dead. And Fulci has done possession before with Manhattan Baby. But this isn't a greatest hits collection — we still need to watch A Cat in the Brain. Read more at http://bit.ly/2kc1d7l",
         "The version I saw was in Italian with Greek subtitles. I don't understand either language, but I got the basic idea. The story is simple, satanic nuns from the 15th century, orgies, blood drinking, burning at the cross, then present day possession and more killings. No big deal. What's great about this is the Cinematography, lighting and the locations. The acting was OK. The female lead was decent but not great. She needed a bit more to make this work. The music was good, audio sounds were good, the dialogue and all audio mixed well. Professionally edited. All this helps move the film along. It was a bit slow paced, but with the camera work, locations and audio mix it's a please to watch. I enjoyed the campfire drunken tune. They also sang it in English. Good tune. Two of the drunks later get killed one after the other in the same exact way, falling down a pit and getting impaled. Fun stuff. Another guy is tied upside down between two trees, and when his little son tries to help him, the kid trips a rope and tears his father apart. A woman is attacked by her cats, ripping her eyes off. In the beginning, 5 nuns are tied and nailed to crosses, nails through the hand and chest. You will not see this in anything other than a Fulci film. My rating is a C, or 5 stars. It's on youtube, so can be seen for the price of your time and internet connection. If I understood what the hell they were talking about, the rating may go up. After watching many movies in the past few years here are a few more comments that elevate this film. I just re-watched the original Alien film. I was disappointed with the film before and again disappointed. Crappy audio, dialogue, characters, actors, direction, killings, gore etc. I think people may be blinded by all the cool props and sets. They love the alien look so much that they dismiss the totally garbage dialogue/characters and actors. Similar crap happening with Star Wars VII, Farce Awakens. Look at all the cool bright lights, forget about the content or art. I have a special hatred for Suspiria and anything produced by Argento. Fulci and Argento have only one thing in common. They are both Italian. Fulci was a professional film maker. The stories were not great, but good, but you can tell while watching a Fulci film, that the guy actually thought about the scene/cinematography, lighting, editing. His editing is great. We do not get long unnecessary fillers in a scene. When the nuns get nailed to the cross. We see the 5 nuns dragged to the crosses. Then they get tied down, nail through the hand, nail through the heart, then the we see all of them dead on the cross. There were 5 nuns, we don't get to see all 5 nuns getting nailed through the hand and heart. We get the point. An amateur filmmaker like Argento would show each and every nun getting nailed. More I watch Fulci films, more I appreciate his work. My favorite of his is Don't Torture a Duckling. I liked Zombie a lot. Zombie is miles ahead of Dawn of the Dead. Dawn of the Dead is a pile of garbage. Dawn has the worst acting, worst zombie makeup and is just a mix bag of bad comedy and killings. It is a failure. Now on the other hand Night of the Living Dead is a masterpiece.",
         "This is such an unimpressive movie from Lucio Fulci. It's one of the more difficult to find, being somewhere after his golden years, but before his TV series flops, but it's not worth hunting down a copy. The plot concerns atrocities that happen in a convent many years ago, in which some seemingly evil nuns are brutally executed and crucified. These past horrors come to light (again) in modern times when a long sealed ancient church vault is opened up by a young researcher. The film has a very slight plot, and doesn't do well with it. The film is shot almost entirely in soft, fuzzy focus, with light leaking all over the place, which is very annoying, even if it is (presumably) intentional. The story seems to vaguely show it's lead heroine, played by Meg Register, being possessed by the long dead evil nuns and taking revenge on various members of the village, but none of this is clear. The sealed chamber of crucified nuns looks good when first glimpsed, but the rotting bodies appear and disappear sporadically, and Meg Register briefly flits between looking like herself, and transforming into one of the evil nuns, all of which is presumably intended to generate fear, but which fails miserably. Various murders take place. Because this is a Fulci film, and people want to know, I am going to tell you what happens - but this obviously means SPOILERS... One guy gets stabbed and his head ends up being pulled out of the water on an anchor (?) Another lady, a sort of psychic, get's attacked by her own cats who pull her eyes out. Looks very fake. Another man is attacked by slabs of meat hanging in a freezer. He only had to leave the freezer, but he doesn't. After some meat bashing, he collapses onto a table and someone pulls out his tongue and nails it to the table. as you do. The final murder is the best, worst and most bizarre at the same time. A young couple lose their son, and the father searches a forest for him. he catches a glimpse of the boy being dragged off by a nun! Then suddenly - the father is strung upside down in a kind of trap! How? The son trips on a wire and the father's whole body is split into two halves! This is REALLY badly done, the fakeness is extremely obvious. It's still rather disgusting though. That's it for the main gore. Eventually the film limps to a close as the villagers invade the sealed up crypt, and in a feeble ending they confront the ancient evil. Boring, boring, boring. Please don't be encouraged to seek this out based on the descriptions of gore I have detailed above. They are all laughable and do not rescue the film from being extremely lame. A sad entry in the late career of Fulci. Not as bad as his TV efforts, but worse than \"Manhattan Baby\", and that's saying something",
         "First of all,everyone knows Lucio Fulci from his blood-soaked films and his hardcore content but this film is one of the worst ever.Lets go to the subject,Liza explores archaeological sites with a group of archeologies,some day Liza found an old mortuary where some nuns have died by the villagers and she unleashed the ghost of nuns to kill for revenge.Not so simply like other movies of fulci but is so boring and hilarious at the first part of 50 minutes.The second part which approximately 30 minutes before the end is atmospheric and gory but the main part is awful. Stay away from this film is boring.",
         "You know how they say that even bad sex is wonderful. Even a bad Fulci is worth the time to watch. The creator of such films as Zombie, The Senator Likes Women, and The Beyond can give us bad sex and we will never complain. Besides, this was set in Sicily, and that also makes it worth watching, even if it is 299 km from my grandfather's home. And, did I mention it is also a nunsploitation film? Liza Harris (Meg Register) had vision of nuns being killed in a séance, and now she is in the basement of a monastery in Sicily searching for ...what? She finds five crucified nuns in a sub-basement. There was a naked spirit using a spear-gun on Porter (Al Cliver). How does a ghost shoot a spear-gun. I rewound just to be sure. Yes, it was a ghost with a nice right tit. No ghost needed to take care of a couple of drunks looking for a party. Liza gets the story in flashback from a medium. Suffice it to say the nuns were naughty, and one (Paola Cozzo) had a baby, which they burned. The naughtiness was under covers, so we only get to see one right tit again. I wonder if it was the same one as the ghost. The medium gets the trademark Fulci treatment in a gruesome manner. But, the local butcher gets it bad, too, but neither gets it as bad as one of the archaeologists on the dig. Yech! The ending wasn't very clear, and probably the weakest part of the film. But, like I said, bad Fulci is still Fulci worth having.",
         "I had never seen this film by Fulci until I got this DVD from Media Blasters - Shriek Show. I must say, it's taken me 3 days to get just 55 minutes through the movie --- that's how involving it is. Not to trash the maestro, but this has to be his most uninteresting film, even mores than \"White Fang\". I'll sit through anything and usually can be entertained somehow one way or another, but on this one so far - Nada. From the reviews I've read here and elsewhere, things pick up in the last half hour and there's supposedly some gore so I'm assuming the movie will at least have a bit of a payoff and I'm sure it won't be a total loss. But still, that first hour is grueling. The WORST part of this DVD, however, is the poor digital mastering --- it is absolutely one of the worst I've ever seen on a DVD with digital artifact going on constantly. Pictures on the wall move around, character's faces morph, hair bleeds (and I'm not talking gore!) and the image just won't stay still. Very poor mastering! It's a shame because the source material looks great --- but the mastering ruins it. You know it's bad when you're paying more attention to the shoddy mosaic artifact than the movie itself. Someone compared this to Anchor Bay quality --- there's absolutely no comparison (unless you mean their early stuff like the atrocious transfer on \"Zombie\"). I sure hope SHRIEK SHOW - MEDIA BLASTERS upgrade their mastering for their upcoming releases because they are acquiring some very cool titles like LIZARD IN A WOMAN'S SKIN. And if they don't, they will be known as the \"Madacy\" for euro-horror titles in my opinion. What a shame!",
         "I've seen most of Fulci's output (that's available in English anyway) and even I found this one in particular to be disappointing. It's dull, seems incredibly long (though isn't)and even the odd gore scene which aren't very frequent or impressive do little to relieve the boredom. This seems to be the work of someone running low on ideas and, I'm sorry to say, motivation. It's a similar situation with a few of his later works. I'd recommend House Of Clocks, Touch Of Death or Cat in the Brain for a taste of Fulci's later works. Go for one of his many other classics, ignore this unless you're a completist like me and have to have it all!",
         "With \"Demonia\", Fulci offers us again a supernatural horror movie. This time, Fulci's vision is not as apocalyptic as in \"The Gates of Hell\" or \"The Beyond\". Instead, Fulci presents a more straightforward horror story about the return of some satanic nuns. The opening is typical Fulci style. It depicts the crucifixion of the satanic nuns in graphic details. What follows is a very uneven film, lacking the pace of Fulci's previous horror movies. In an interview, Fulci stated that he wanted to create a \"dreamlike atmosphere\". He succeeds when he shows us how Liza gets into contact with the satanic nuns. But, on the other hand, the movie is filled with minutes and minutes of completely boring dialogue and other uninteresting scenes, like people dancing around a campfire, just to stretch the movie to the required 80 plus minutes. Finally, the ending is abrupt and completely disappointing. Nevertheless, the movie is still enjoyable, at least for Fulci fans. It is occasionally atmospheric and still has the \"Fulci touch\". Fulci recalls many of his motives from previous work. The movie also contains some reasonably well executed gore scenes, such as a feline attack, a tongue impalement, and a body torn apart. Finally, it is fun to watch Fulci play the part of a police inspector (for budgetary reasons, as Helsey explains in an interview). However, as good as he was as a director as bad he was as an actor. Like in \"Nightmare Concert\", he just wanders around, appearing totally unaffected by what is going on.",
         "No, it's not the name of a disinfectant used by exorcists, but rather the title of Lucio Fulci's 1989 film about demonic possession on the island of Sicily. Brett Halsey and Meg Register star as a pair of archeologists, one sensible and scientific, the other sensitive and superstitious, whose latest dig is plagued by a series of violent, non-Mafia-related deaths. It seems a local Medieval nunnery was once the site of devil worship, flagrant carnality and ritualistic murder - until the locals banded together to exorcise the evil by crucifying the nuns (depicted in the film's prologue). Turning a deaf ear to the warnings of the village leader and the local butcher, the archeologists carry on digging, and ultimately loosing the hounds of Hell, Fulci-style. DEMONIA is a largely uninteresting affair, sluggishly paced and directed with apparent indifference by Fulci. Everything seems a bit tame (artfully placed blankets throw cold water on the orgy scenes) and second hand, from Giovanni Cristiani's corny, tympani-heavy score to the use of such hoary spook-cinema devices as double exposures to suggest ghostly apparitions and echoey dream voices (has anyone in your dreams ever spoken with an echoey voice?). Fulci stumbles further by having his heroine plagued by nightmares that offer no information beyond what we already saw in the prologue. Fulci himself turns up late in the film as an inspector from Scotland Yard, only to turn up clues to a mystery that is no mystery to us; worse yet, Fulci's Inspector Carter's last scene finds him eyeballing a piece of cloth (torn from the habit of one of the murderous ghost-nuns), identifying it as centuries old, and then disappearing from the film entirely). Al Cliver (aka Pier Luigi Conti) appears as Porter, a fellow archeologist who meets an untimely end at the hands of a transparent, headless, speargun-toting haint (Fulci regular Cliver is billed in the credits as Al \"Clever\"). The film perks up a bit halfway through, when the local medium (a character similar to one played by Rada Rassimov in Mario Bava's BARON BLOOD) meets her predetermined demise by dint of half a dozen cat hand puppets, but DEMONIA is still slow going. A third act disemboweling of one of the dig members is gross but unconvincing, and the film climaxes on an ambiguous note that fails to satisfy or justify the investment of an hour and a half.",
         "Fulci was in the twilight of his career at this juncture. As saddening as it is, great talents can hit a wall sometimes. Kinda like Dario Argento these days. Fulci made a few stinkers near the end of his career, and this may be his worst. This movie is endlessly talky, providing no scares or thrills what so ever. Even at 85 minutes or so, this feels unbearable to watch. For an exploitation movie, there is very little nun action or anything that controversial. I'm used to incoherency when it comes to Fulci plots, but he's usually able to overcome it with his style and vision, here he can't. That surrealistic feel is there, but there is nothing interesting going on. Not only is the dialog insipid, but it feels really cheap as well. I wasn't that impressed by the ruins, and I had no idea what was going on in Fulci's head to make such drivel. The typical Fulci obsessions are there! Seances, cats, death involving eyes. There is gore, but it's not a gore fest. Two drunks randomly stumble and impale themselves on spikes (!!) , eyes are clawed and ripped out by cats, a nun is staked, a tongue is staked. We also get a hook in the neck, and a spear in the chest. Not bad, but pretty tame for Fulci's standards. The acting is hard to judge because of the dubbing. Meg Register is gorgeous, but that's about it. We also get a twist at the end I saw coming a mile away. Al Cliver (A Fulci favorite) shows up briefly. Lucio Fulci has a glorified cameo as a detective. If you're looking for nunsploitation and debauchery, expect very little. This is one of Fulci's worst movies, if not his worst! It's a chore to sit through. I'd avoid it like Ebola 2/10",
         "Watch out for those nude killer nuns! Lets face it, Italian horror isn't anymore what it used to be and all of the best movies were made mostly in the '70's and '80's. In the '90's the genre was already pretty much dried up in Italy. The movie has a pretty good genre concept and story but it deserved a way better execution all. The movie its story also most definitely isn't helped with its dialog. You know, it's the kind of dialog that is so bad that it will make you laugh. The actors that have to deliver the lines also obviously aren't among the best in their profession. No matter how hard the movie tries, it just never gets real scary or mysterious. The movie is often more dull and a drag. Besides some of the moments are just too ridicules. For instance, an archaeologist that is being scared by a couple of bones? That really doesn't sound likely. It also doesn't help that the movie doesn't feature an awful lot of gore or monsters/killers in it. At least not some good gore. The gore that is in the movie looks quite amateur like. It makes this a rather disappointing- and below average genre movie. The movie spends more than halve of its time figuring out a mystery, while we as the viewers already knew what happened, because it was showed in the beginning of the movie. The how's and why's of it all is little interesting. The movie could had better focused on the present time within the movie, to make it more of a scary one. The character treatment also isn't among the greatest. The person who seems to be the main character suddenly disappears out of the story halve way through, to appear again much later. Yes, there is a reason for it but it doesn't make it any less bad. Same goes for lot of other characters, that just come and go within the story. There are some way better genre movies than this one and Lucio Fulci also has made way better movies. 5/10 http://bobafett1138.blogspot.com/",
         "This film comes up short in many areas, but it's still not Fulci's worst (it's better than \"Aenigma\", for sure). The script is thin, and the ending makes no sense, but there are enough well-executed gore set-pieces (considering the budget, the scene where a man gets split in two is a real dazzler!) to make the picture worth seeing, if only for horror fans. (**)"
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Lanterna Editrice",
         "A.M. Trading International S.r.l."
      ],
      "summaries": [
         "In southeast Sicily, a team of archaeologists investigate the ruins of a crypt where heretic nuns had been stoned and crucified by the village people in the 16th century. Soon strange things begin to happen, and Liza, one of the team members, starts to have surreal dreams about the nuns. Then the graphic violence begins, starting with a decapitation! The answers lie in the ancient crypt of the nuns.",
         "In 1486, in Sicily, five nuns are crucified in their convent by the superstitious locals that believe they are evil and worship devil. In 1990, in Toronto, the skeptical archaeologist Professor Paul Evans and his superstitious colleague Liza Harris explore with their team the medieval dig where the nuns were killed. Liza has dreadful nightmares with the nuns while members of the expedition mysteriously die and the locals are against the research in the archaeological site.",
         "A Canadian archaeological team in Sicily accidentally unleashes vengeful ghosts of five demonic nuns who were murdered 500 years earlier, and the ghosts now set out to kill the group and townspeople alike."
      ],
      "budget": 0
   },
   "movielensId": 145590,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1990-10-01",
      "dvdReleaseDate": null,
      "directors": ["Lucio Fulci"],
      "runtime": 85,
      "movieId": 145590,
      "title": "Demonia",
      "mpaa": null,
      "actors": [
         "Brett Halsey",
         "Meg Register",
         "Lino Salemme",
         "Christina Englehardt",
         "Pascal Druant",
         "Carla Cassola",
         "Michael Aronin",
         "Al Cliver",
         "Paola Cozzo",
         "Lucio Fulci"
      ],
      "imdbMovieId": "0094997",
      "originalTitle": "Demonia",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["W6BN4hYTPr4"],
      "plotSummary": "A Canadian archaeological team in Sicily accidentally unleashes vengeful ghosts of five demonic nuns whom were murdered 500 years earlier and the ghosts now set out to kill the group and townspeople alike.",
      "tmdbMovieId": 28847,
      "avgRating": 1,
      "releaseYear": "1990",
      "numRatings": 2,
      "posterPath": "/7NA3rSXWr5q6Wf4nmvVMigiXzFe.jpg"
   }
}