{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "africa",
         "id": 409
      }],
      "imdb_id": "tt0098669",
      "video": false,
      "title": "Wodaabe: Herdsmen of the Sun",
      "recommendations": [],
      "backdrop_path": "/vTTiQ92wJsqHFvgNPDE8X7unp8r.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 4,
            "character": "Narrator (voice)",
            "gender": 2,
            "credit_id": "599e1c13925141100800147c",
            "name": "Werner Herzog",
            "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
            "id": 6818,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46139251416c91048533",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "599e1c01c3a36859ed0013a0",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.547412,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 36880,
      "vote_count": 6,
      "budget": 0,
      "overview": "Herzog's documentary of the Wodaabe people of the Sahara/Sahel region. Particular attention is given to the tribe's spectacular courtship rituals and 'beauty pageants', where eligible young men strive to outshine each other and attract mates by means of lavish makeup, posturing and facial movements.",
      "similar": [
         10527,
         11430,
         9732,
         873,
         2454,
         1523,
         8587,
         411,
         630,
         258489,
         9273,
         284054,
         953,
         606,
         339530,
         1372,
         7350,
         313943,
         9904,
         24016
      ],
      "original_title": "Wodaabe - Die Hirten der Sonne. Nomaden am Südrand der Sahara",
      "runtime": 52,
      "poster_path": "/ekdIaPakRDWv4pAEKO0blA7pIVO.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "France 2 (FR2)",
            "id": 11359,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arion Productions",
            "id": 18646,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         }
      ],
      "release_date": "1989-01-01",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Werner Herzog"],
      "runtime": 43,
      "synopsis": null,
      "writers": ["Werner Herzog"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0098669/",
      "coverLink": null,
      "actors": ["Werner Herzog"],
      "reviews": [
         "Herzog with his usual interesting subject that just needs to be filmed and with the uneasy feeling that he is directing everyone's actions--- This is a good one to find if you are a Herzog fan--- stands tall to any of his best documentaries--- I felt that i was seeing something that could vanish in the near future--- one of Herzog's ideas about being 'outside' civilization to where nature is more powerful than man--- in this case i remember watching the film at a friend's place in Queens and felt that the whole movie was an good analogy to the dating scene in N.Y.C--- or in western culture--- where the 'image' of a person was a very important thing and somehow this film was about revealing how that isn't necessarily a superficial thing---",
         "Wodaabe: Herdsmen of the Sun (1989) *** (out of 4) Very interesting documentary that follows the Wodaabe tribe of the Sahara region as they discuss various parts of their lives including a four year drought they had just gone through. The majority of the film focuses on a seven day beauty pageant where the women get to pick men to spend the night with and perhaps marry. I'm not sure how Herzog picks his material when it comes time to do a documentary but he's got a magic touch at finding interesting subjects. This is a very interesting documentary that shows us some people that many probably never even heard of and I have to wonder how many of the people in the film had ever seen a video camera before the German director showed up to film them. The film moves at a very fast pace and there's not a single slow moment even though a lot of the film is pictures only and doesn't feature too much narration. The narration is done by Herzog himself and that incredible voice works well with the film. There are several very cute moments including the morning after a couple has stayed the night together and Herzog is trying to question them but they are blushing so much and can't think of anything to say. It's moments like that that make this documentary worth seeing.",
         "Herdsmen of the Sun is one of Werner Herzog's more under-seen documentary featurettes, which like Lessons of Darkness is shorter than an hour, probably with enough time for a few commercials if need be (both were shot for, or at least meant for, television broadcast on German networks). But it casts a light on a society of outcasts, and through Herzog's unblinking observations on them gets out what is something of a consistency in his catalog of work: the theme of outcasts who've created an insulated world for themselves, thanks (or rather no thanks) to factors of their infrastructure and how they communicate. It probably has some company to share alongside the likes of Even Dwarfs Started Small, or even Stroszek. If this one is any different it's because there's more of an issue with nature itself- because of a long-standing drought, many were put in a position of having to fend for the lowest common denominator (there's the insinuation many died in the interim, or those who couldn't sell their herds in time). If Herdsmen of the Sun stands out in as a Herzog film it's because it showcases the director as anthropologist. His narration details the mating habits as if these were any other species of animal: the ritualistic nature of preparations with make-up of the men and the contortions of the facial expressions (even more fascinating is to hear how they stand seven feet tall, no tippy-toes). Although one might expect the main difference between Herdsmen of the Sun and any given National Geographic TV doc is that the people on camera look right at it, Herzog uses this to an effect that's rather challenging, and even stirring to the mind. Like in Fata Morgana- the opening shot here also a mirage- it's about the faces themselves, expression, and how one looks and has a personality even more-so through having to put on a sort of act for a strange thing like a camera. Equally good are the candid moments when one sees Woodabe talking just like any other guy or woman at a bar, about their latest sexual conquests or crushes. It's actually sort of charming, in Herzog's skewed, sad viewpoint, as is a lot of the film under moments of recognition of the estrangement of the other under somber opera music.",
         "Actually as a documentary of the Wodaabe, this television film leaves much to be desired. There is a brief discussion of the enlarging Sahara and the problem of lack of rain. However this is undercut by actually filming just after one of the rare periods when it did rain. There is also a brief segment on the shanty town next to the uranium mines. Then these are dropped. The major interest is the male beauty competition. The faces of the contestants are scanned as an introduction, and most of the second half of the film is about the competition. This aspect is certainly interesting, and the young men's makeup and clothing is in dramatic contrast to construction of masculinity in the dominant global culture. We think of such makeup and restrictive clothing as feminine. Their appearance is somewhat like drag in Europe/North America, but then yet again is quite different. When the selected young woman walks past the finalists, she does not look them in the face - she appears to be looking mainly at the ground. This aspect of Wodaabe femininity should be explained and contrasted to other male-female interactions. Do they use mirrors to apply their makeup. None are seen, but some of the young men are holding their hands as if they have a mirror, but this is not confirmed by the camera. Amazingly, there are no tourists at the festival. Only the German camera crew. We are not shown how the Wodaabe relate to being filmed by these foreigners. As this film was made for French television, and the opening titles and commentary and the closing credits are in French, should not the French title be the prime one?",
         "The first time i've heard about the WODAABE people was in the NATIONAL GEOGRAPHIC MAGAZINE some years ago and i was fascinated by their marriage ritual.I've asked myself many times what are the origins of such strange and amazing ritual.As a HERZOG'S fan it was a great surprise to discover this documentary not so easy to find and a \"little bit\" forgot in the middle of HERZOG'S MASTERPIECES.The first scenes are absolutely fantastic.I was mesmerised!!!.Educative experience or simply watching for pleasure,this film is not a waste of time at all.It will show you how simple human society could be ,therefore how one could live with basic and traditional principles regardless of the daily challenges who lives in a hard environment would deal with.In my opinion this work is a lesson of life.",
         "\"Wodaabe - Die Hirten der Sonne. Nomaden am Südrand der Sahara\" or \"Wodaabe: Herdsmen of the Sun\" is a documentary movie from 1989, so this one has its 30th anniversary soon. The writer and director is Werner Herzog, which is why this film caught my attention. I am a great fan of the Munich-born man who is originally caught Werner Stipetic. The documentary runs for under 50 minutes, which is not uncommon at all for Herzog. He made many films that easily stayed under the 60-minute mark during his long career, especially many of his documentaries. The title here already tells us what this one is about, namely the Wodaabe. Now I will admit that I don't think I have ever heard that name before, but that is not a problem at all as Herzog patiently depicts us who they are. The Wodaabe are a tribe of African natives who lives in the Sahara/Sahel region. If you have not heard of them before just like me, you can maybe compare them to the Massai, but I am sure there are many many difference between the two tribes, so don't be too focused on them being similar. This is just a very general description, so that you can somewhat imagine what this documentary is about. I will not go any further into detail about how they live or what these beauty contests are about that they hold on a regular basis as you can check out the film for yourself. And should! This is another convincing work by Herzog, even if it is probably not seen by as many as some of his more known projects.. But it definitely is not any worse. I just wish we had a chance to listen to Herzog's great narration on more occasions as his voice is pretty scarce in this one sadly. But that's just a minor subjective criticism. I certainly recommend the watch here.",
         "Herzog's documentary of the Wodaabe people of the Sahara/Sahel region. Particular attention is given to the tribe's spectacular courtship rituals and 'beauty pageants', where eligible young men strive to outshine each other and attract mates by means of lavish makeup, posturing and facial movements. They are traditionally nomadic cattle-herders and traders in the Sahel, with migrations stretching from southern Niger, through northern Nigeria, northeastern Cameroon, southwestern Chad, and the western region of the Central African Republic. Today (2016) they are estimated to number around 100,000. I have to thank Herzog for this document. I am not sure if I had heard of the Wodaabe before, but they are a fascinating people, mixing African traditions with Islamic culture, and certainly a variety of their own practices. The makeup and other modifications almost make them look fake, like china dolls or some such thing. Why they consider themselves such beautiful people is easy to see.",
         "The same people were the subject of the 1981 documentary \"Deep Hearts\" by American anthropologist and filmmaker Robert Gardner. His film focused almost exclusively on their mating ritual and consisted of long segments of men doing their makeup and dancing with extremely sparse commentary. It had no subtitles and no soundtrack except for the natural chanting and dancing of the tribe. In comparison, this documentary by Werner Herzog is more about the overall lifestyle of the people. It subtitles their language and individuals are questioned on screen by the translator. The soundtrack uses opera music in some places. In my opinion, neither film is great. \"Herdsmen of the Sun\" is probably more interesting and better filmed and edited than \"Deep Hearts\", while the latter is probably more authentic.",
         "«The sun has overcome every fence, and no arrow can reach it.» This is a saying, a deeply wise one, from the Wodaabe, a semi-nomad tribe dwelling the Sahara desert this documentary is on. Their way of life is covered and exposed with something that defining abundance of detail and care would still be not satisfactory, as passion is involved and, like always, passion is the sole explanation to itself. Members of the tribe are customarily made marry at an age of around 10; however, there is freedom of choice to the marital matter unknown to our self-defining «advanced» societies: partition from one's spouse is allowed for both genders, and wives frequently exercise it; furthermore, when the love feast comes every woman can pick a young man to couple with for the night. Beauty and making-up (some derived by liquid from exhausted torch batteries), as well as ritual feasts, play a cardinal role, the sole distractions from the fatigue of every day. {mettere dove? Rain, and terrain fertility, are vital for survival.} Such vainness among a population feeling few needs and leading a natural, unsophisticated life, seem to indicate vainness be a constitutive trait of the human kind. Herzog's approach to cultures distant from the West's ones is his methodical, lucid yet fresh interest, the outcome of it being a dynamic, effective report, that catches the spirit, and traces back the very root, of far and away civilizations. So, after a ceremony has been completed, the Wodaabe are inquired on their next destination. the answer is that they don't know yet: they are simply going to follow the route their cattle will take. {I skipped 2 or 3 minutes of the documentary, where an animal is slayed.}",
         "Portrait of a nomadic tribe desperately trying to survive. A drought and changing political situations in the countries they travel change the Wodaabe herdsmen try to hang on to their way of life and to simply continue. Werner Herzog's look at the Wodaabe begins with a scratchy record playing while we watch part of the 10 day fertility festival where the young men attempt to show they are the most beautiful to the women in the hopes of winning a bride. The juxtaposing of sound and image creates a very effect with the music seeming to work against the image. It is a precursor for the rest of the film as the old ways (seen in the festival as well as discussions) are shown cross cut with the reality of life as it is (having to pick through garbage in order to find food and goods for survival). This is a good film that suffers because time has made some of the scenes in this film seem similar to more recent African Crisis like in Darfur and elsewhere. Herzog may have been there early on but others have started to pick up similar stories. Its depressing to think that things may not have gotten better for the people of the region. Thankfully Herzog's skill and unique vision keep this from being a complete exercise of been there and done that. Worth a look if you run across it.",
         "This film leaves so many important details out. There are many questions I had after seeing the film that could have been answered easily. In addition, the somber tone of the film, combined with the classical European songs dubbed over footage of the Wodaabe, gave the film a unique feeling of looking in from a colonialist perspective. Not the type of mood one wants to set when making an essentially anthropological film. As a peek into the lifestyle and culture of a foreign people, the film did not fail completely. But, with so many other statements being made, the focus was really taken away from what would appear to be a really interesting group of people."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Arion Productions",
         "Canal+",
         "France 2 (FR2)"
      ],
      "summaries": ["Herzog's documentary of the Wodaabe people of the Sahara/Sahel region. Particular attention is given to the tribe's spectacular courtship rituals and 'beauty pageants', where eligible young men strive to outshine each other and attract mates by means of lavish makeup, posturing and facial movements."],
      "budget": 0
   },
   "movielensId": 145753,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1989-01-01",
      "dvdReleaseDate": null,
      "directors": ["Werner Herzog"],
      "runtime": 52,
      "movieId": 145753,
      "title": "Wodaabe: Herdsmen of the Sun",
      "mpaa": null,
      "actors": ["Werner Herzog"],
      "imdbMovieId": "0098669",
      "originalTitle": "Wodaabe - Die Hirten der Sonne. Nomaden am Südrand der Sahara",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Herzog's documentary of the Wodaabe people of the Sahara/Sahel region. Particular attention is given to the tribe's spectacular courtship rituals and 'beauty pageants', where eligible young men strive to outshine each other and attract mates by means of lavish makeup, posturing and facial movements.",
      "tmdbMovieId": 36880,
      "avgRating": 4,
      "releaseYear": "1989",
      "numRatings": 4,
      "posterPath": "/ekdIaPakRDWv4pAEKO0blA7pIVO.jpg"
   }
}