{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt3540136",
      "video": false,
      "title": "Wolf Warrior",
      "recommendations": [
         118178,
         367882,
         129070,
         40977,
         338421,
         56251,
         262137,
         437116,
         64998,
         67006,
         331576,
         191646,
         457837,
         382220,
         372782,
         49095,
         459073,
         56578,
         26557,
         479718
      ],
      "backdrop_path": "/61T2MGTgXnb911ZSoYHDTkQ33Sw.jpg",
      "revenue": 80000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Leng Feng",
               "gender": 2,
               "credit_id": "55ca84ce925141220a000baa",
               "name": "Wu Jing",
               "profile_path": "/terFS9M2F8Gc46K4i057JRUK45N.jpg",
               "id": 78871,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Long Xiaoyun",
               "gender": 0,
               "credit_id": "556c2c05c3a368273b003377",
               "name": "Nan Yu",
               "profile_path": "/cgLqY3SygIL6bKiRTPzZmsTWsHl.jpg",
               "id": 27084,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Min Deng",
               "gender": 2,
               "credit_id": "572f47a0c3a3682f5b00066d",
               "name": "Ni Dahong",
               "profile_path": "/28m2VML1UolILxdhHNLHf0m2tIX.jpg",
               "id": 17382,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Tom Cat",
               "gender": 2,
               "credit_id": "553d3301925141125600c144",
               "name": "Scott Adkins",
               "profile_path": "/mX5vlgiyJ8XdvBUMlFe6FVQ9YDh.jpg",
               "id": 78110,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Shi Qingsong",
               "gender": 0,
               "credit_id": "572f475ec3a368496e000fcb",
               "name": "Shi Zhaoqi",
               "profile_path": "/b1tVf904Y5xaZhSkdUqQ5r35oeJ.jpg",
               "id": 1138369,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Wu Ji",
               "gender": 0,
               "credit_id": "572f4790c3a3685b5c001b75",
               "name": "Zhou Xiaoou",
               "profile_path": "/5BCx1oQe3CanIESsLx0pZphD9Z7.jpg",
               "id": 1562578,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Crazy Bull",
               "gender": 0,
               "credit_id": "553d330b9251413f5a008155",
               "name": "Kevin Lee",
               "profile_path": null,
               "id": 17991,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Monkey",
               "gender": 0,
               "credit_id": "553d331592514135c800463b",
               "name": "Kyle Shapiro",
               "profile_path": null,
               "id": 1379942,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55ca84b5925141220e000ba6",
               "name": "Wu Jing",
               "profile_path": "/terFS9M2F8Gc46K4i057JRUK45N.jpg",
               "id": 78871,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55ca84c0c3a3687694000ba7",
               "name": "Wu Jing",
               "profile_path": "/terFS9M2F8Gc46K4i057JRUK45N.jpg",
               "id": 78871,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "561e1bb39251410d8f001830",
               "name": "Lv Jianmin",
               "profile_path": null,
               "id": 1522349,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "561e1bcac3a3686cc1001b2d",
               "name": "Wu Jing",
               "profile_path": "/terFS9M2F8Gc46K4i057JRUK45N.jpg",
               "id": 78871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561e1c32c3a3686cd8001c83",
               "name": "Ji Dadqing",
               "profile_path": null,
               "id": 1522350,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561e1c4fc3a3686cd8001c8c",
               "name": "Kian How Yoa",
               "profile_path": null,
               "id": 1522351,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "561e1c9692514142c9001bc7",
               "name": "Ad Zhjun",
               "profile_path": null,
               "id": 1522352,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "561e1db5c3a3686cc3001ca6",
               "name": "Cheung Kafa",
               "profile_path": null,
               "id": 1522358,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 3.780395,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 335462,
      "vote_count": 41,
      "budget": 12000000,
      "overview": "A Chinese special force soldier with extraordinary marksmanship is confronted by a group of deadly foreign mercenaries who are hired to assassinate him by a vicious drug lord.",
      "similar": [],
      "original_title": "战狼",
      "runtime": 90,
      "poster_path": "/pcC3aWHzO8RcKtTLI37uus92rKv.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nanking Military Area Command Of The TV Art Centre",
            "id": 65444,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Beijing Dengfeng International Culture",
            "id": 65442,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Chunqiu Time Co.",
            "id": 65443,
            "origin_country": ""
         }
      ],
      "release_date": "2015-04-02",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/5OnkBYm7VTFt4jTFB0tMFCQ3zxk.jpg",
         "name": "Wolf Warrior Collection",
         "id": 471435,
         "poster_path": "/sLSsC7ra0PVxPd7oM1WOMZZLWCs.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jing Wu"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Qun Dong",
         "Yan Gao"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt3540136/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZTY1NDk5OTUtYjk5NS00MTdlLWJkMTEtMWUxOTQ4MDI3NGNiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Jing Wu",
         "Nan Yu",
         "Dahong Ni"
      ],
      "reviews": [
         "I personally enjoyed this movie a lot. It's rapid-paced, intense and quite entertaining. I've also read that some of the action sequences are actually coming from real Chinese special force members who invented them and put them in use in reality. It's also a milestone in Chinese movie genres. Chinese movie is famous for action genres but this one is the first hybrid of genres of action and military. And it's not tradition Chinese martial arts which is mainly for the purpose of performance and exercise, not practical combat. The actions in this movie are a reflection of, but a little glorified, modern military combat. However, I'd say the directing is the biggest weakness of the movie. It's understandable, because the main protagonist directed the movie himself. He admitted in an interview that he really didn't want to direct the movie because he was not a professional director. He was just an martial arts actor. But he spent a lot time and efforts trying to find some professional directors to direct this movie and investors to invest but in vain because no one thinks this genre would be popular. He had to do everything by himself and invest in the movie out of his own pocket. So the movie took 7 years to make. It turned out to be great success at the Chinese box office. If there were professional people helping him refine the plot as well as directing the movie from the beginning, this movie could've been a lot better. Given all these reasons, I gave it an 8 out of 10. On a side note, by looking at some of the reviews here, I am amazed by how many people have ridiculous double standards. When it comes to a Chinese military movie, it is just Chinese propaganda so it's lame, untrustworthy and worthless. But when it is Black hawk down or American Sniper or any American patriot movies, it heroic, righteous and meaningful even if the movie is about a western country engaging in a war that causes many civilians to die on other nation's soil. In contrary, China, no matter how bad it is portrayed in western movies, it never incurs any war in other countries. Chinese army is built to protect its people from invaders, not to invade. It's funny that how many westerners are brainwashed by their biased media and \"propaganda\". The world is big and every story has two sides. People should get out of their home and take a look at the outside world. Only by this way can a person form a more objective, mature outlook of things, especially when it comes to political affairs. I believe I am entitled to say this because I myself has 10+ yrs living experiences in both China and USA and I know how media are manipulated and twisted in both countries. Now I don't fully trust either source solely. Rather, they complement each other pretty well to give you a quite clear picture about what is the truth about everything and how media only serve the interest of their own country, even though at the expense of sacrificing objectivity and authenticity.",
         "I have read other reviews on here and found they are fairly unfair but each to there own. This movie is full of action even though a bit over bearing in some of the action scenes where men are on the verge of crying for there comrades which isn't realistic, The story line is good and you have the typical goodies and the baddies. In all I found this movie entertaining even though it had undertones of Chinese propaganda I found it no different to the American propaganda that we generally see at the movies, I had to download the subs from a different site, but I found this movie well worth watching and recommend to others who like action movies to watch it. One area I did not understand was where the wolves come from and why, what was the reason they were there.? this is something to watch for as its all action, it left me rather confused. out of 10 I give this movie a(7/10)",
         "Wolf Warrior is a Chinese military action romp with a dash of nationalistic fervor. This is a mostly very watchable action film. It has a strongly military flavour, with a discernible thread of Chinese nationalism, that reflects that nations emerging role as a military superpower. As such, its enjoyable but also a bit corny at times, as films that mix entertainment with nationalism and patriotism, tend to be. Wolf Warrior is well paced and chocked full of action. Its interesting to see the Chinese take on a military action flick. The cast is a mix of local talent and foreign actors who take on the role of the bad guys threatening China's boarders. All in all quite worthwhile if you can accept this film for what it is. Certainly its no better or worse than the nationalistic films cast in the same frame from other countries such as the US and UK. Seven out of ten from me.",
         "Although I like Scott Adkins, this film is unfortunately an utter nonsense not interesting on any level and looks more like a Chinese military propaganda action film. For those who like Scott Adkins and his martial arts craftsmanship, please stay away. There is like two minutes of fighting in the whole film and the rest is just shooting and even that is so unbelievably ridiculous that there is no point in watching this flick. Most of all, the wolf attack scene is so ludicrously digital like something taken from a Lorenzo Lamas movie. Adkins should play Boyka and not wasting his time and energy on stuff like this. My overall rating is 3 out of 10 and I really think I am being generous here.",
         "It wasn't too long ago I saw Donnie Yen's Kung Fu Jungle, which offered a triumphant display of frenetically paced, vicious fight sequences, that continuously delivered in originality and entertainment. To say China is renowned for delivering outstanding martial arts movies, would be an understatement – sadly though, Wolf Warrior, does not continue the tradition. Though the words 'breathtaking martial arts' appears on the top of the box I purchased, let me assure viewers of this statement's inaccuracy. It is unfortunate the fight sequences failed to convey anything original, however, the addendum that these scenes only comprise less than five minutes of the feature's entirety, only adds to the disappointment. Lead actor Wu Jing, who was involved in writing and directing this production, clearly sets himself up as an action hero, his character surviving a number of confrontations that would surely kill any ordinary human being. However, despite even this, the film seldom enthralls. A particularly entertaining scene sees Jing running from cover to cover, avoiding an enemy sniper's fire, however, even this moment is rather dull in contrast with how outstandingly tense it could have been. Leng Feng (Jing) is a brilliant sniper, whose reckless behavior, in order to save the lives of his fellow soldiers, results in his military career being called into question. Long Xiaoyun (the beautiful Yu Nan) sees Feng's potential, and recruits him into a secret Special Forces group – the War Wolves, a collection of some of China's most accomplished military personnel. During a training exercise however, the lives of all participants are plunged into jeopardy, when drug lord Min Deng (Dahong Ni), in his desperate attempt to avenge the loss of his brother during Feng's last mission, recruits Tom Cat (Scott Adkins), and his band of mercenaries, to kill all involved. Viewers will be quick to notice the antagonistic force, comprised of muscular militia, are all of Caucasian/European origin, while the protagonists are all Chinese. If anything, the film appears to advertise the strength and courage of Chinese forces, and it is here the film excels, much of the dialogue used in these sequences conveying empowering notions of patriotism, and despite the fact I am not Chinese, even I was impressed by how the Asian super power's military was spoken of. At the same time though, the film incidentally contradicts this with the sheer number of Chinese soldiers that fall like flies against the oppositional forces. The occasional heroic dialogue however is usurped by the often uninteresting conversations, a number of which are quips at the expense of Xiaoyun's character. A high-ranking female in the Chinese military who commands the War Wolves, you would imagine that she demands respect. Instead, she is the subject of many sexist lines from Feng, and other men, and rather than punishing their insubordinate behavior, she appears content with their unsatisfactory conduct. Despite the front cover of the film I purchased showing a man with a minigun, please don't be fooled into thinking, like I was, that this weapon will be used in a particularly exciting scene – believe me, it's not. Wolf Warrior has the ingredients of a great action film; however, the recipe goes disastrously wrong, the tension between Feng and Cat being very under-exaggerated, while the villains themselves, despite their bravado, prove to be nowhere near as threatening as an action fan may hope. Furthermore, the lack of depth and attention provided to many of the characters, especially the villains, prohibits the audience from connecting with them, and though the film strives to emotionally involve its viewers, these attempts feel forced and out of place. Jing and Adkins are clearly adept martial artists, and it would have been great to view them in a film where their talents are proficiently captured – sadly, this feature does not serve as the venue for such excitement. In short, Wolf Warrior has all the hype of an action film, but none of the flavor, and though the end hints at a sequel, we can only hope that if China decides to make a franchise here, the sequels prove to be immensely more entertaining.",
         "Must admit it is simply a propaganda, and it's just for Chinese people. Not surprised to see such a low rate for this movie on IMDb while it is generally rated high on Chinese film reviewing websites. I AM disappointed to the poor story and CGI of this movie but I think it's already not only a movie for entertainment to most of the Chinese people. You probably have no idea what Chinese kids are like today in the country. Most of them set their life goal to move aboard, seems like our country is too weak to compare with other developed countries. Their heroes are Hollywood superheroes, and every time they hear something about our own country they only see the weakness and just laugh at it. This movie, I say, is to build up the faith, the self-confidence to our country. It is to show the kids that our country is much stronger than they imagine, and to show them that every time when they're in danger, it is the country that will protect them from it. As a 17-year-old Chinese kid myself I can strongly feel what I get from this movie. It probably is not a good MOVIE, but it has the power to move all the Chinese people. Go watch Wolf Worrior II. Much better than this one as it can at least be called a MOVIE.",
         "Well the reason i tried to watch this movie was only because of Scott Adkins..but i guess you cannot make a movie work only with big names and script and logic also goes hand in hand. And latter was nowhere to be found in this movie. I apologize to any person if my words here offend any one but my review is only related to the movie, it has nothing to do with any one's belief about their country or society. so here it goes, The acting is nowhere to be found; many scenes in movie do not make any sense and it looks like the director had no clue about how to make a scene work when there is no action taking place. So foolish dialogues and weird logics keep coming up. I did not felt the emotion or intensity behind the voice so acting is not the forte of the main lead. so i thought it's fine because in most of the action packed Chinese movies people expect amazing stunts and that compensates the weak acting skills but such is not the case here. This movie does not delivers in terms of action as well..only the opening sniper shootout scene was bit creative but i kept hoping for more and realized this scene was the only attraction of the movie..and even the finale fight was not up to the mark..the fight scene looks plain and lacks innovative camera work that made Hong Kong movie industry famous and a recent example would be The Grandmaster (2013) if you know what i mean by that. The movie is like an instant noodle pack with great packaging but far away from being what it has been advertised as. The movie does not make sense at times and appears like story was written while filming the scenes (Pun Intended). I have seen many Chinese movies over the years and being a non Chinese i still found many flaws with this movie..and recommend to watch it on their own risk as any quality movie fan will not like this. This movie is not a good movie and it can be watched for one time only and would recommend to straight away skip to the climax as only there you will see Scott Adkins in action..rest of it from beginning till end is a pathetic experience. My rating 4.5/10. Some people may not agree with my review but this movie is also not average. so watch it on your risk because you have been warned.",
         "Leng Feng is a harden super-sniper in the Chinese Army. His unit takes down a drug operation. He disobeys orders to kill the gang-leader. He is reprimanded and is assigned to the special unit Wolf. Meanwhile somewhere southeast Asia, police tries to take down ruthless drug-lord Min Deng, the dead gang-leader's older brother. He coldly has his western mercenaries massacre the police and sends them to avenge his brother. This is a Chinese military action thriller. It's a lot of action. Some of it is solid but it's rarely realism. They are literally fighting a pack of wolves at one point. Compared to Hollywood, the effects are slightly inferior. There is an impressive amount of real military hardware. It's better than most B-action movies but not quite at the theatrical level. Way too often, the soldiers are standing too close to each other. I guess it conveys something visually but it looks cheesy bad. Overall, I give the action a good passing grade. The leading guy is hard which could be interpreted as stiff but that's the character. He takes some comedic turns which are quite jarring. The evil plot is questionable at best. It needs to be better written. It should be a simple revenge plot and not that hard to figure out. The good aspect is that the western mercenaries are formidable foes. There is also a cheesy battle over motivations. All of it adds up to a nice fight against tough villains. There is a fine B-movie here but a few stumbles keep it from being good.",
         "I'm all for movies with gunfights and wouldn't be disappointed in an old Clint Eastwood for example to have him just shoot it out and not get involved in some good old martial arts. When you've got actors like Jing Wu and Scott Adkins however I'm watching the movie because I know these guys can bring epic fight scenes if they want. Sure they did a bit of hand to hand but it was almost a drop in the ocean relative to the whole movie. I also know that its a military movie but when has that stopped a good martial arts movie from being made just by throwing in some reason why they need to fight unarmed. Perhaps I'm being harsh I just feel that the martial arts potential of both actors was wasted considering how athletic they are. I wanted to see \"Boyka\" vs the \"Legendary Assassin\" not a generic blink and its over a few stars above a Bruce Willis fight.",
         "soo..im not good at English..but i really hate this movie.. just want to tell others DO NOT WATCH THIS CRAP This Movie is total Chinese Military Propaganda.. not worth it.. The Actor was good tough...but not the script and effect CG Effect really cheap just watched it for like 10 minutes and i cant bear it to watch it any longer the first scene after that factory raid that is worst enough already but that river rescue scene that are really the worst.. i remember watched that kind of scene in Act Of Valor.. total Copy Cat ohh and the first scene there is somekind of iron man \"jarvis\" tech at the desk..of course with lowly cheap CG Effect",
         "Good action + military movie. There is a lot of improvement to make, but this is a breakthrough for non-US made movie in this category. There are a lot of implications to China and other countries, but this is in most movies made by US. I personally love this movie, despite some political part of it. Generally the movie is very real and CG is up to standard of 2015, which is much better than most movies from China or other countries. When US makes it, it is not a propaganda. When other country makes it, it is.",
         "...because those CGI wolves were really lame. Other than that, I've no complaints about this movie. It's a popcorn action flick about a one-man army, similar to many of those mindless Stallone and Schwarzenegger flicks. Not necessarily my type of movie, but it's one of those films you'd want to pop up on a lazy Friday night when you have friends over and are enjoying some pizza and cold beer. Note: Yes, this film has some China-nationalistic overtones, but it's no different from every other action flick that Hollywood likes to churn out. If your \"evil China-propaganda alert!!\" is being triggered by this movie, then you've obviously been brainwashed by one too many anti-China 'news' report and this movie is NOT intended for you.",
         "After learning about the humongous business the 2nd part of the movie is doing in China, I decided to watch the first part. And oh man, how boring was it!! Extremely poor acting, inconsistent story, actions which are neither believable nor fun made it a below average flick. Maybe the nationalistic viewpoint and the positive portrayal of the armed force made it a commercial success in China but the appeal ends there. The worst of all was the sexist tone of the movie. Dialogues like a woman cannot be the commander of elite troop or a soldier asking her out were definitely demeaning.",
         "This movie tells the story of Leng Feng, a man struggling against the system and the corruption... Ah, who I am kidding! This movie is a sad excuse for showing that Chinese men (and in particular its army, and also the hero of the story, actor-director Jing Wu) are strong, capable of taking the lead, and all those things men are supposed to be and do. And it doesn't even do an acceptable job in convincing the viewer of its purpose. The action is lame, third-rate left-from-a-Steven-Seagal- movie scenes, with only a couple of jumps that would cut the mustard in a school play. The fights are risible, with zero tension or show of workmanship. And the dialogue and acting... better not get into that. It also best not to say anything about the kind-of-love-story, or what the bad guys are trying to steal (it being another reminder of the purpose of the movie). \"Wolf Warrior\" is just bad. Plain and simple.",
         "Awful in a good way. Spoiler the main character gets shot in the heart (they never say heart, but the hole is next to his nipple towards the center of his body) Heart? With a 30.06 caliber rifle. Does not even faze him, nor do grenades, mines, knives anything really. This guy is a machine. This film is supposed to show off all Chinas great military hardware. But when everything they use was originally from, the U.S. or Great Britain or S. Africa, it winds up being a big 'up yours world we steal it all.' kind of feel. No military hardware in this film is not a copy. The acting bad, effects o.k.. The dubbing is so bad it is GREAT. The attitude for loss of life and a persons value in China is clear when, the lead asks the love interest if she has a boyfriend and everyone laughs in the C3 room, As dozens of Chinese soldiers are dying. Also women are treated as decoration. All in all, if you want to laugh see some cool stunts and see whites as villains this is for you. If you want a serious military action drama, skip it. If you want see three guys fight off about fifty cg wolves watch. This movie sucked in the good way.",
         "Watching this so-called Chinese Special Force crap is like getting the root canal dental treatment without anesthetic procedure. It's very painful to watch a film spent so many manpower and money for nothing. I often thought why most of all the mega-budget movie productions out of Asia, including China, Hong Kong, India and other Asian countries always turned out so lame and so childish shallow and pathetic. I think mostly it's because their screenplays sucked big time, the dialog sucked, the casting sucked, and worst of all, the directing sucked. Why after having borrowed so heavily from many foreign movies yet still turned out so lame? 1) Just like the stupid \"Strike Back\" TV series, a camera seemed to be always followed every movement of the characters from so many different angles for the control center to monitor so easily. It's just looked so unconvincingly stupid. 2) In order to tone down a fully macho testosterone crappy movie, the stupid production would so stupid put one totally unnecessary, highly impossible female character in it. So in \"Blackhat\", we got a totally useless and purposeless heroine to play a very absurd unnecessary role. This \"Wolf Warriors\" is even worse, they put a woman with bee-stung lips to play as the leader of the so-called toughest of all toughest Chinese military forces. Give me a break, will you? 3) When you in the hot pursuit of the unseen enemy in the jungle, why a) everybody still holding their assault rifles in front of their eyes? How this stupid gun holding gesture would speed up their chasing speed? b) they never spread out but grouped so tightly together, making them such an big easy target and never got a chance to react? 4) Why once all of the Chinese military films would inject so much unconvincing patriotic slogans? 5) Why the stupid production team would be so stupid enough to add computerized wolf pack attack the so-called 'Wolf Warriors\"? Where's the brotherhood, man? 6) Why all the cameo uniforms looked so new? 7) It's very tiresome to watch what we have seen in this movie, like the realistic Chinese military forces, endless trainings, rehearsals, would-be imaginary fighting, small or large scale; or even computerized strategic rehearsals are always and the only stuff that Chinese military forces are doing everyday. It's so formulaic and so painful to watch again and again. 8) The soundtrack was over-the-top annoying and unnecessary most of the time. This is another self-indulgent, self-righteous, self-pompous...a B movie styled film trying so hard to glorify the Chinese Communist 'Liberation' Army.",
         "So let me rewrite that plot for you: A bad guy hires 10 super mercenaries to capture the soldier that killed his brother, during a raid on a drug factory. The mercenaries decided the best way to capture him was during a war exercise, where he is surrounded by 1000+ soldiers. And after writing that, i just realized, the plot is the best part of this movie.",
         "Alright, alright. I understand you guys blaming this movie for plots, effects or something. Let me tell you some about this movie from an aspect of a Chinese. About the plots, effects, even dialog, you're right, they're not satisfactory, even crap, but no one cares! That's the point, no one cares, because it's really hard to see a military movie involved with present armament in China, we don't propaganda our army as much as you do in USA,no need, we're not in any war currently. So this movie is really a good opportunity to see the latest attack helicopters, the latest single soldier equipment and the latest upgraded 59 tanks(it's a pity that no 99 tank in this movie) And the actor Jing Wu, he took the training as a real special forces soldier for 2 years for this movie, so his move is pretty close to what a real special forces soldier does. Remember he loads the pistol with his shoe then blows that sniper's head? That's a real skill. So for people who don't quite know China, they might focus on the fake stuff in this movie, but for Chinese guys, we focus on the real part. By the way, for people who blame the action, Jing Wu has his best fights in some Hong Kong movies, go find them if you want to, they won't let you down.",
         "The PLA is more and more like US Army. But the spirit is different. What are the soldiers fight for? USA: freedom and democracy? CHINA:motherland and the CCP? The USA culture encourage the people to question the government and limit its power. The Chinese culture consider the government as home master who will look after the people and make the people's life better. home and country are connected in Chinese culture. This is why western people can't understand why the Chinese soldier can do crazy things in Korea war and push them back to 38-line. This spirit empower the people and soldier which scares the western. Now the western want to use its own culture to eliminate the eastern culture to soft the eastern people.",
         "I kind of liked it at the beginning. But there were some ridiculous scenes, like the CGI wolf fight and there was always that annoying voice over the Chinese must have learned from the Godzilla movies. Whatever happened, someone would comment and give the movie a news report feeling. In the middle of the movie the American mercenaries clash with the Chinese troops and I was expecting an epic cat and mouse game. Then the Chinese commander ordered his troops to \"regain their honor\" by squashing the enemy before they have time to flee. So, I got sick of the propaganda and I turned it off. It's too bad because this movie had the potential to be a fun action movie.",
         "WOLF WARRIOR is another military-themed slice of Chinese propaganda designed to show off the Chinese special forces at their very best. They're on the trail of a team of international mercenaries operating at the Chinese border, but the plot is merely an excuse for lots of flag-waving propaganda and furious action sequences typically involving expert sniper Wu Jing battling the bad guys. Truth be told, this is a deeply flawed film with some ridiculous moments; the CGI wolf attack is the nadir of the whole thing and the first half, concerned with training, slow and confusing. It's nice to see Jing playing the good guy for a change and very good he is too, although I could have done without the endless romance with Nan Yu's extraneous character. The good news is that the woodland-based action in the second half is very fine indeed, as is the frenetic opening sequence, and it all builds up to an exhilarating fight climax with the one and only Scott Adkins playing the baddie.",
         "This may very well be several army rehearsal footages edited together and guest starring Scott Adkins for about ten minutes. It severely lacks plot and realistic cinematography, instead the movie resorts to outdated macho cliché and military gung-ho basically from start to finish. With Scott Adkins collaboration with Chinese production, one would expect visceral combat, but Wolf Warriors doesn't even deliver on that regard as well. Story is flimsy at best. The usual renegade cop is transferred to a special unit where he must stop a terrorist group. It's highly exaggerated and filled with 80s action movie gimmicks. The leads, both male and female look unrealistic. Not to mention there's a lot of goofy reactions that are meant to be intense but presented over zealously. It often depicts the entire command headquarters cheers like they are NASA from Armageddon or WWE crowd as the lead does something dramatic, or stop entire operation to mourn a soldier, even giving ceremony on the spot. I don't mind some patriotism element, but the approach is too heavy handed to be taken seriously. Screenplay is mostly soldiers marching, it doesn't fit the scene yet they just run around theatrically, brandishing guns and bullets excessively. Martial art fans will be disappointed too as it barely presents any fight scene. The best it can do is five minutes with Scott Adkins, and it's not even as good as his scenes on Undisputed series. Not to mention the movie tries to shoehorn CGI which looks incredibly stiff. There are a lot of shootouts, but they are mostly likely numbing than interesting. Beneath all the fireworks and loud macho gargle, Wolf Warriors is a bland military movie without thrill on action or plot.",
         "Some of what is shown is what we actually do in U.S. Army Special Forces, I am surprised more people (Actors, Extras) did not get Seriously Injured, even doing \"Stunts\" as Stuntmen. During Vietnam, a U.S. Army Special Forces Team if pursued by Vietcong (V.C.) and North Vietnamese Army (N.V.A.), would do some of what was depicted, area denial weapons (anti personnel land mines), claymore mines, two hand grenades with the fuse cut to zero and the pin almost out and pins connected with thin fishing line \"trip wires\". The Vietcong and North Vietnamese Army learned the hard way not to pursue us, because what we normally did was as we were (Creedence Clearwater Revival Song) \"Run Thru the Jungle\" we create an L Shaped ambush for those in pursuit. The effectiveness of the U.S. Army's Semi Automatic Magazine fed M21 or M25 Sniper Rifle (a modified M14) is shown versus a bolt action sniper rifle, as to why we used the M21 or M25 instead of the short range M4 or M16 at both Afghanistan and Iraq (also Syria, Libya, Yemen). Snipers from Training do not stand up, prone or at the most kneeling only, the only time a Sniper stands up, is during urban warfare near but not at the window of a building (being at the window provides counter snipers a silhouette target). What we are trained to do regarding anti personnel \"landmines\" is, dig around the landmine, slide a tourniquet (or belt) under the landmine, loosen boot laces, buckle the tourniquet over the boot and the landmine, tighten the tourniquet, slowly remove foot from boot, tighten the tourniquet more as your toes leave the front of the boot. After you have your whole foot removed, tighten the tourniquet a few inch pounds more, then step away quickly. Just hope you don't step on another landmine close by (as how they are normally used, just feet away from the blast radius of the landmine you just got away from). Sometimes this does not work depending on the type and model of landmine, as many have \"anti tamper\" secondary triggers located underneath the landmine. That landmine that launched from out of the stream is a \"bounding\" landmine, previous versions were called a \"Bouncing Betty\". They had to have lots of cooperation of the Chinese Peoples Liberation Army Navy (P.L.A.N.) to show off their Military Capabilities and New (2015) and future weapons. Most people will automatically classify this movie as Chinese Propaganda, then tune themselves out. Without realizing that this kind of movie gives some insight into how and what Chinese are thinking and doing, as different from the U.S. and U.S. Allies.",
         "There have been many remarks on here about how this is a flag waving, pro-Chinese movie. Yes it is, but there is nothing wrong with that. I throughly enjoyed the movie. It was full of action, the story was engrossing and it did what it was supposed to do . . . entertain me. I see nothing wrong about another country taking pride in their military. Why is it okay for the Hollywood to put out crap like The Hurt Locker (and it won an Oscar???) but doesn't get criticized for being pro-American and bad reviews? Other US movies like Independence Day (a great movie), Captain America and American Sniper (I really enjoyed this one) are also flag waving. Highly recommend giving this movie a try.",
         "Part military action film, part government propaganda, Wolf Warrior shows what blockbuster films from China have become as they expand their film viewing audience. The story is about Leng Feng (Jing Wu), a skilled sharpshooter who uses his sniper skills to take down drug lords. He disobeys orders to kill the brother of a ruthless drug lord Min Deng (Dahong Ni). Despite his disregard for authority, he is invited to join the elite Wolf company. Min Deng swears vengeance on Leng Feng and escapes arrest with the help of his group of mercenaries lead by Tomcat (Scott Adkins). The wolves go on training with a large military activity that includes cyber warfare and advanced weapons showing off the might of the Chinese military as well as their intelligence with computer hacking. Coordinated by Long Xiayun (Nan Yu), the wolves are able to outshine their competitors and win the first practice fight. The drill becomes dangerous when an actual pack of wolves attacks the soldiers at night and they have to fight them off with live bullets and bayonets. On the next day, the drug lord's mercenaries strike and kill one of the wolves leaders who had a daughter. The mercenaries escape but not before showing off their advanced weapons that can take down a helicopter. The wolves get very patriotic as they load up from a weapons drop and head out to fight the mercenaries. They are ambushed and suffer more losses. Check out more of this review and others at swilliky.com"
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller",
         "War"
      ],
      "productionCompanies": ["Spring Era Films Co."],
      "summaries": ["A Chinese special force soldier with extraordinary marksmanship is confronted by a group of deadly foreign mercenaries who are hired to assassinate him by a vicious drug lord."],
      "budget": 12000000
   },
   "movielensId": 145773,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2015-04-02",
      "dvdReleaseDate": null,
      "directors": ["Wu Jing"],
      "runtime": 90,
      "movieId": 145773,
      "title": "Wolf Warrior",
      "mpaa": null,
      "actors": [
         "Wu Jing",
         "Nan Yu",
         "Ni Dahong",
         "Scott Adkins",
         "Shi Zhaoqi",
         "Zhou Xiaoou",
         "Kevin Lee",
         "Kyle Shapiro"
      ],
      "imdbMovieId": "3540136",
      "originalTitle": "戰狼",
      "genres": [
         "Adventure",
         "Action",
         "War"
      ],
      "youtubeTrailerIds": ["ec7LY8dLYSc"],
      "plotSummary": "A Chinese special force soldier with extraordinary marksmanship is confronted by a group of deadly foreign mercenaries who are hired to assassinate him by a vicious drug lord.",
      "tmdbMovieId": 335462,
      "avgRating": 2.8,
      "releaseYear": "2015",
      "numRatings": 5,
      "posterPath": "/pcC3aWHzO8RcKtTLI37uus92rKv.jpg"
   }
}