{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "battleship",
         "id": 160860
      }],
      "imdb_id": "tt2175927",
      "video": false,
      "title": "American Warships",
      "recommendations": [
         107100,
         82756,
         68446,
         76197,
         52615,
         80201,
         74006,
         136568,
         77068,
         66795,
         256284,
         117856,
         293093,
         49877,
         104185,
         78362,
         79582,
         153998,
         120092,
         212986
      ],
      "backdrop_path": "/ghWyPh3GESw294VglnwTgUg5DZQ.jpg",
      "revenue": 1000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Captain Winston",
               "gender": 2,
               "credit_id": "52fe49e89251416c750d74c3",
               "name": "Mario Van Peebles",
               "profile_path": "/ciIe7kUrTA2nL8dPDA4L88DcBZX.jpg",
               "id": 16214,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "General McKraken",
               "gender": 0,
               "credit_id": "52fe49e89251416c750d74c7",
               "name": "Carl Weathers",
               "profile_path": "/xOpDfVa83R1EdiNkWPNITfCH67e.jpg",
               "id": 1101,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lt. Caroline Bradley",
               "gender": 1,
               "credit_id": "52fe49e89251416c750d74cb",
               "name": "Johanna Watts",
               "profile_path": "/mk5hFoGXbTykKEKIBCjRn5qQHRH.jpg",
               "id": 168931,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Julia Flynn",
               "gender": 1,
               "credit_id": "52fe49e89251416c750d74cf",
               "name": "Nikki McCauley",
               "profile_path": "/oik9ej6h1BWLtyupkMxa5FAIb6d.jpg",
               "id": 206756,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lt. Cmdr. Juarez",
               "gender": 2,
               "credit_id": "52fe49e89251416c750d74d3",
               "name": "Devin McGee",
               "profile_path": "/w114aNIUCnWYxodcXLS4yAV6k30.jpg",
               "id": 1021528,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Lookout Dunbar",
               "gender": 2,
               "credit_id": "52fe49e89251416c750d74d7",
               "name": "Mandela Van Peebles",
               "profile_path": null,
               "id": 1001736,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Lt. Anders",
               "gender": 0,
               "credit_id": "52fe49e89251416c750d74db",
               "name": "Chris Hayes",
               "profile_path": null,
               "id": 1021529,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49e89251416c750d74b9",
               "name": "Thunder Levin",
               "profile_path": null,
               "id": 102389,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49e89251416c750d74bf",
               "name": "Thunder Levin",
               "profile_path": null,
               "id": 102389,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.301784,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 97632,
      "vote_count": 34,
      "budget": 0,
      "overview": "When an alien force wages war on Earth, only the crew of the USS Iowa - the last American battleship, stands in their way.",
      "similar": [
         44833,
         52454,
         282631,
         48101,
         47556,
         165683,
         111305,
         28093,
         449736
      ],
      "original_title": "American Warships",
      "runtime": 90,
      "poster_path": "/4qXYV36eXngvHF9UCESPcyBDLT8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ic2bTizdzRLDVzAvN7MXdUg3WQV.png",
         "name": "The Asylum",
         "id": 1311,
         "origin_country": "US"
      }],
      "release_date": "2012-05-15",
      "vote_average": 2.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Thunder Levin"],
      "runtime": 89,
      "synopsis": "When a fleet of mysterious ships wage war against the Earth, only the crew of the USS Iowa, the last American battleship, can prevent global armageddon. This is an excerpt from Dan's movie report, for the full review go to: American Warships represents a technological leap for The Asylum, the CGI in this film is very good, by low budget standards of course, not distracting at all. I am basing this strictly on lower budget standards, as many asylum films and other lower budget films have much poorer often times wrenching 80s technology CGI. The acting is acceptable, not going to win awards, but Mario Van Peebles (Capt. Winston), Carl Weathers (General McKraken), and Johanna Watts (LT Bradley) are solid in their portrayal of their respective characters. Quite frankly, I am a white male, and I like a diverse multi-ethnic cast in films. Nice to see the two underutilized veteran actors kick ass even if they are older now. The basic premise is the same as the big budget version of the film, Aliens and the navy fighting them, the filming took place in Wilmington NC, and the shooting schedule was limited, but for what they came up with the end result is highly watchable. Cast: Mario Van Peebles Captain Winston Carl Weathers General McKraken Johanna Watts Lt. Caroline Bradley Nikki McCauley Dr. Julia Flynn Tony Basile Navy seal #9 Elijah Chester Secretary Of Defense Alter Brandon Clark Chief ONeal Josh Cohen Weapons Officer Clancy April Ezell Wilson Dr. Billman Gregory French Navy Seal James Furey CPO Rawlins Rebecca Goudarzi Jane Aaron Griswold Munitions Team Leader Gray Hawks Wexler Chris Hayes Lt. Anders Robert Jarvis Jr. CWO Watts Sebastian Kelly Ensign Moore Jon Kondelik Pentagon Radio Operator (voice) Jayson McCardell Seal Devin McGee Lt. Cmdr. Juarez David Polinsky Admiral Hollis Robin Dale Robertson Major Steph Robinson Ensign Moore (as Sebastian Kelly) Rodney Roldan 2nd Lookout Jennifer Russoli Situation Room Attendee Robyn Shute Flight Comm Officer Sean Patrick Smith 1st Officer Bryant Charree Swindoll Ship crew member Ted Thayer SEAL #1 Johnson Mandela Van Peebles Lookout Dunbar Eric Scott Wilson Ship Crew Membe",
      "writers": ["Thunder Levin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2175927/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ1NDA1NjE3MF5BMl5BanBnXkFtZTcwNDAwMDA5OQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Mario Van Peebles",
         "Carl Weathers",
         "Johanna Watts"
      ],
      "reviews": [
         "I could write a long review about everything awful that but simply put probably one of the worst films i have ever seen. Some films are so bad they are actually quite good but there is nothing positive about this film. The Navy SEAL's in Act Of Valour acted better than anyone in this film. the special effects are so bad it isn't even funny.This so reminds me of another rip off Battle of Los Angeles. Why bother i feel like i've lost ninety minutes of my life. Remakes are one thing but to blatantly rip off another film so soon after it was released and to put so little effort into it is a waste of time. There are so many films out there worthy of watching this is not one of them.",
         "It's a shame you can't give less than 1/10, because this is the biggest steaming pile of guano I've seen in a long time (and I just watched \"No Body Found). Appalling cliché-ridden script, pathetic acting, woeful special effects, about the only thing that I can guarantee if you watch this is that it will probably make your eyes and ears bleed. As others have, it was obviously knocked together to try and get some business of the back of \"Battleship\", but the budget for that was $200 million. There's actually no budget for this on IMDb, perhaps they're too embarrassed to say just how cheap it was to make, because I've seen film students make better quality material. Avoid at all costs.",
         "We all know that Mario Van Peebles will never be mistaken for DeNiro, but he reaches new lows for acting in this awful mess. A cardboard cutout of a Naval officer would have had the same impact on screen. Of course, he had no script, no plot and no supporting actors either, so his only fault may have been accepting the role in this piece of junk. Director Thunder Levin should never be allowed near a movie set again. In fact, him calling himself a director is like me calling myself the dictator of a small South American country. I am nothing of the sort but, neither is he. I did pick up some interesting info while watching this crapfest, though, such as: When a US Navy ships Captain rescues one of his female officers from under a piece of armor plating, they then roll around on the deck and make out a lot. When in battle, a US Navy ships crew does virtually nothing except stand around on deck, waving their arms and shouting \"YAY!\". There is always a five foot long piece of two-inch iron pipe lying around on the deck of a US Navy battleship, in case you have to stop a rolling 16 inch artillery shell from crushing you. Carl Weathers would be better off spending his time at the horse track, eating sardine sandwiches and betting 50 cent trifectas. There is nothing redeeming about this, uh, \"movie\". The acting is wooden, the CGI is so amateurish it's laughable, and the plot is ridiculous. Next time, I'll paint a wall and just sit watching it dry, my time would be better spent.",
         "I try not to make it a habit of down-grading the SyFy movies, as there are a few out there that are watchable. However, they have done a lot of cheap and badly written and acted movies, and for me American Warships is one of their worst recent examples. It does look cheap for starters, with choppy editing, scenery/settings that doesn't look that authentic(including the ship actually) and very slapdash at best special effects that further suffer from bad texture and heavy over-use. The script is often aimless with cheesy one-liners, the music is often over-bearing and at a sluggish tempo and the characters are little more than underdeveloped clichés(I have yet to see a SyFy movie character that I actually identify with). The story goes at a dull pace and doesn't generate any sort of thrills or fun, everything also feels very predictable in that you anticipate what's happening next constantly. And looking at the logic here, I would genuinely be surprised if SyFy did any kind of research before doing the film whether geographically and scientifically. Apart from a pretty likable Johanna Watts, the acting is poor, either phoned-in or too eager to please. Overall, a waste of time. 1/10 Bethany Cox",
         "when I saw that Mario Peebles was in this film I expected it to be rubbish. And that is exactly what I got. Poor, no, very poor special affects. I have done better making my own special affects on the pc, in fact I would say that most readers could. If you watch this film then you must really have nothing to do.. This is certainly a time waste movie. Cardboard acting. Heed this warning. Do not waste your time watching this..... I am still getting over how bad it all was. even the jet scene looks like it was super imposed. lol I will be amazed if someone gives this film more than a 5/10",
         "In all of my stupidity, I thought this was the big motion picture that was out in the cinema so I bough the DVD. Honestly, I have seen a lot of movies, some better then others, but this is the biggest crap ever. Even the gunshots are fake and the actors move their guns back and forth like they shoot and CGI is added later to make it look like they fire it.... I had a deja vu feeling back when the movie \"The day the earth stood still\" came out and in the same year that awful rip off \"e Day the Earth Stopped\" appeared. Same thing as this, only 4 years later. The pure waste of money that went into this..... An alarm bell should have gone off when I saw the cast line up.....all formerly successful movie stars that are looking to score another buck....regardless the script. Shame on them.",
         "Low budget, low quality and low acting skill! I hope this was shot on digital because it would have been a complete waste of celluloid! Special effects worse than most junior school plays. Pure rubbish. No doubt the creators are trying to bamboozle punter into thinking that this is the movie Battleship. Ships and aliens. Doh! Don't waste you time or money of this one! If this doesn't leave you feeling nauseous with disgust then you need to get out more! What a sad use of a fine warship with a proud history. Shameful! Seriously, if you have a choice of root canal treatment or watching this movie, go and see the dentist. This is like drilling without Novocaine.",
         "I'll keep it simple: the money spent on this should have gone towards a commercial for the Iowa museum, and if any money was left over, donated to the museum. Having served, some things in a military based movie really irritate me: aircraft changing types from one scene to the next...or, as here, from cut to cut. when an actor portraying somebody from an elite unit hasn't been coached on how to clear a room, or even hold a weapon. Even video games get it right these days! speaking of games, the old \"Fleet Commander\" had better VFX than the ones in this film. Other things just irritate: let's have the Iowa (Galactica) be immune to the aliens (Cylons) because it is an old ship that's being turned into a museum and doesn't have modern equipment. Mr. Weathers and Mr. Van Peebles: seriously? You guys were in \"Rocky\" and \"Heartbreak Ridge.\". Are things that bad you stooped to *this*? I just hope this was one big practical joke....and based on the line, \"You don't get to sink my battleship\" it might have been. But still...shame on you for wasting $ when it could have gone towards the museum.",
         "I noticed that there have been two somewhat positive reviews of this movie and both of them have received heavy marks for not being helpful to readers. It makes me wonder if there is an anti-Asylum contingent (or individual) with an axe to grind. Having played golf for years I am used to driver knockoffs that don't measure up to the real thing but that typically are far more worthy than most movie knockoffs created by Asylum. So it is surprising to me that I didn't feel that way at the conclusion of American Warships. Sure there is a certain amount of bad acting and scripted clichés that might make you wince but it is not to the level expected of Asylum. Most end of the world, mega disaster movies seem to eventually leave me thinking that they were fun but I've seen it before. In AW, there is an appearance of creativity that manages to present something that I didn't feel as though I've seen it dozens of times. For free television and original programming, AW manages to at least put forth a plot that might have been really interesting with a big budget. Don't enter this expecting a \"Transformers\" meets \"Pearl Harbor\" and accept it for what it is and I believe you'll be entertained. That's a giant leap forward for Asylum on SyFy.",
         "First of all, the only reason I gave it 2 stars is because it had some very nice aerial shots of the Iowa being transported to her new berth. (Shots that have tugboats pushing her.) The actual filming was not on board the Iowa. That was actually the North Carolina. I really hope the Town of Wilmington received adequate compensation for this piece of garbage. The battleship itself certainly didn't even get a fresh coat of paint in many of the rooms they filmed in. Here come the spoilers. So North Korea seemingly starts attacking both their neighbors to the south, and a US Carrier Battlegroup, and get the drop on everyone by using EMP. Thankfully, USS Iowa is mostly spared, since all of her main systems do not rely on integrated circuits. This appears to have been ripped off some from a book, titled \"Tempered Steel\". When it's revealed that the antagonists are aliens, now we appear to be getting a ripoff of Battleship. OK, I'm done with the spoilers. Horrible cgi. Various stock footage of battleships with their hull number cgi'ed over to 61 (Iowa's hull number), but missing the number painted on top of one of the turrets. Bad acting with even worse lines. Bad, bad, bad. Why did I watch it, you may ask? I was visiting family, and my Dad was a former officer on the Iowa. Naturally, despite my warnings that this looked bad in the commercials, he just HAD to see how the Iowa was portrayed.",
         "This, I laughingly use the term \"film\", is a disgrace to the Iowa class Battleship!!! There is nothing special about the special effects. I have seen cartoons with better story lines. The acting was a joke, and the director....director, couldn't direct a grade school play let alone a movie. The only positive in this fiasco was some shots of the USS Iowa from the air. There were some very nice shots of the historical battle wagon. The only reason this movie was made was to advertise the fact that the \"Big Stick\" is on her way to being turned into a museum. Though i am not sure that making a terrible film was the best way to get that point out to the general public. But what can you do?",
         "This movie reminded me very much of those 1950's science fiction movies I grew up with. Poor acting at time laughable special effects a plot so full of holes you could steer a battleship threw but still enjoyable for what it is a bit of fun science fiction made on a tight budget. Although the plot lines are similar I actually enjoyed this move far more than \"Battleship\" which I felt over relied on CGI. The Alien ships where simple and didn't take 5 minutes just to change it's self into some type of transformer. Look if your looking for a summer block buster with massive CGI your going to hate this movie however if you just look at it as bit of science fluff it's enjoyable and quite frankly a damn site better than many science fiction movies made on the cheap.",
         "American Warships aka American Battleship (thanks Hasbro/Universal) isn't very good and frankly sucks and I'm often surprised how people prefer this Asylum Rip-off over the big budget product. I know Battleship isn't that smart either or hell original. But at least it had a budget and wasn't apparently made to con suckers into picking this up at the store or renting it at red box. That and at least Battleship had some life in it compared to this, I mean this has some of the stiffest acting ever. . And these's movies are shoddy as all hell with literally PC graphic special effects. Some people say they are aware of this and it adds to the charm. Well, I don't it's just shoddy as all crap. Once again Battleship didn't have perfect special effects or anything, but at least it looked like it could afford to show a battleship being attacked. Another thing The Asylum does is apparently hire washed up actors to show up in there movie, for instance in this one both a bored looking Mario Van Peebles is in it as well as Carl \"Apollo Creed\" Weathers. Both looking like they would rather be in anything else. I would just say to watch this when it premieres on Syfy like we all know it will, then decide if you like its z-grade movie quality. And believe me when I say the quality is definitely Z and you will think how in the wide world a movie like this could be made in this year. It's shorter than Battleship, but really, it feels much longer than Battleship. The aliens look even more laughable than the Battleship ones, that looked like some Halo inspired aliens from the planet Who Ville apparently. The special effects are downright groan worthy, like I said at least Battleship had effects. This is Birdemic level, even the muzzle flash from the guns firing is CGI, apparently the cast was too sheepish to fire actual prop guns. Peebles and Weathers are the only two cast members with a level of actual acting skills that they use to the best they can. And marvel at the subsquent triple endings to the movie. Just when you think the movie will end it continues on and on. Plus do we need even lamer clichés than the one we have in Battleship? Bad stock footage of things like the pentagon, the Iowa at several points and the port where it's stationed. And please can the characters stop babbling about it being possible North Korean or Chinese weapons, when anybody with a brain would know that they wouldn't have that type of technology the aliens use. Lame shootouts with the aliens, and a bad climax that is to be in a word just so freaking anti-climatic.",
         "American Warships starts as a huge EMP emission downs some American jet fighter planes over the Pacific somewhere near the North Korean coast, soon after several large missiles destroy the battleship U.S.S. Enterprise. In the US the military & politicians begin to panic, General Hugh McKraken (Carl Weathers) & the Secretasy of Defence (Elijah Chester) keep the President informed but consider the downing of the Enterprise as an act of war on the part of the North Korean's. However there is hope of avoiding World War III as the 1940's battle the U.S.S. Iwoa has set sail for the last time to San Pedro in California where she will be decommissioned & opened to the public as a museum, because the Iwoa is so old none of her core systems contain integrated circuits & therefore was immune to the huge EMP, the Iwoa remains as good as the day she set sail & the crew aboard know this. Captain James Winston (Mario Van Peebles) is in charge & sets out to find the truth & soon discovers an alien threat that wants to wipe the whole of humanity out, he & the Iwoa are our last hope... Written & directed by someone called Thunder Levin which the IMDb reassures us is his real name this is yet another 'Mockbuster' from the very untalented rip-off merchants at The Asylum who specialize in making zero budget rubbish with similar sounding titles & plot's to recent big budget Hollywood films, in this case American Warships was originally called American Battleships before Universal stepped in & sued The Asylum & got them to (slightly) change the name so as to not quite as blatantly rip-off or copyright infringe their mega budget summer hit Battleships (2012). First I will start with the positive aspects of American Warships because usually as far as films from The Asylum are concerned there are no positive aspects so I want to begin on an upbeat note & say that although it's silly it has one or two fun moments, it moves along at a good pace & at just over 80 minutes long it's fairly short. Unfortunately that's where the positives end as everything else about American Warships is just plain crap, the script is so full of holes & plain absurd inaccuracies that it is simply impossible to take American Warships seriously. Apparently all electrical systems on the Iwoa are down yet electrical lights & navigation equipment are shown working as are speakers & medical monitors, the idea that a battleship is steered mechanically from the bridge is just plain hilarious, wrong uniforms are worn, the attitudes & behaviour of the military personnel is highly questionable (Navy Seals walking around with gun with their fingers on the triggers, the Captain of the Iwoa openly flirting with another officer, someone taking clear photograph's with an old camera in the dark without a flash, the idea that they can make hundreds of planes that have been stuck in museums for decades battle ready in mere minutes as well as plenty of other goofs & ridiculous plotting besides. The whole film is inept, from a production point of view it doesn't get much better. The battleships & jet fighters constantly change between shots & the Chinese & American jets amazingly have exactly the same cockpits (what a money saving coincidence!), a bunch of Navy Seals can ride a Zodiac in rough water standing up & not lose their balance or even sway a little bit, it seems with the fate of the whole of mankind at stake only two people discuss the issue in what looks like a hotel room & again the list just goes on. As well as a dumb military film American Warships also has sci-fi aspects with the aliens trying to start World War III so we will wipe each other out but they look ridiculous when finally seen, they are a sort of weird cross between a human & Turkey with two shell things on their back & a few spikes sticking out of them, they are hard to describe but are very goofy & silly in appearance. The so called action scenes are poor, there's not much interaction & no-one seems overly concerned or in much of a hurry, the terrible CGI computer effects don't help either. Probably shot on a budget of about zero American Warships was actually filmed on the museum ship the U.S.S. North Carolina apparently, the only other notable aspect of American Warships is the cast which contains one time big hitters Mario Van Peebles & Carl Weathers (Predator (1987) seems such a long time ago after watching him here) who were only ever needed at one location it seems & probably do the best they can but the material sucks. American Warships is crap, I have never seen the big budget Battleships is mercilessly rips-off so I can't compare the two but I would be amazed if it's worse than this. It's not quite as boring as most films from The Asylum but it is still just as inept & ridiculous.",
         "Warning! Stay clear of this movie! I rented this film at my local video store tonight. I thought I had rented the Peter Berg movie. In Norway this movie is called American BATTLESHIP. American is written in small letters and Battleship in large letters. The DVD cover picture is very similar to the Battleship DVD cover. It is a total rip off! It is clearly done so you shall think that it's the other film. Imagine my surprise when I pressed play and discovered this piece of sh..! Bad acting, lame filming and hopeless special effects. If only it had been done on purpose it would be funny. Watching this movie was a total waste of good chips and time. Too bad I have to give it one star. Should have been zero! :(",
         "First of all, the story is kinda ripoff Battleship (2012) which has just been in the cinemas. Secondly the acting isn't the best, but thats not the problem. The problem are the different quality of the scenes. Some of them, you can see how bad the 3D/CGI rendering is done. It looks less real than a simple PC game. Other scenes where airports and islands are hit by missiles and the camera moves, you can see the overlaying explosions sliding over the buildings (revealing that they are only post-effects). One of the female actors looks like she was sprayed with self-tanning just before shooting the movie. Also rather disturbing, making it all even more fake. There are also some bloopers regarding the ship itself, because this ship is supposed to be a museum etc. but the doorways aren't even painted and look rusty. All in all, I would say 85% of the movie is poorly attempt to copycat on another movie. I wonder if this movie was produced with one intent, that of being rented/sold because of the name alone, so keeping the budget low was part of the deal. Disappointed I was... very!",
         "I kind of got suckered into this one so take this as a word of warning. I thought this was a documentary my room mate downloaded (off Amazon.com btw, just for the record) but I quickly found out it was a B-rate. after watching this I did a little research and discovered that this is a \"Mockbuster\" from the same studio that brought us \"Battle of Los Angeles\" last year [2011] not to be confused with \"Battle: Los Angeles\" the blockbuster that came out at almost (if not) exactly the same time. They get the directory of upcoming summer big budget films and throw together a spoof of the concept on a shoe string budget and release it at the same time. I wasn't around for this one but last year they put the Battle of Los Angeles on TV during the release week so I assume this went the same way when BattleShip came out. First things first, this is a B-rate move. If you are watching this expecting the same experience as the blockbuster then you need to go back and read the Mockbuster paragraph; this movie is poorly made but that's what makes it so fun to watch. The acting sucks, the visuals look like they where made by a class of graphics design students and the audio is balanced for TV. This isn't to say its a bad-bad movie in fact its rolls the odometer back around to good its so cheesy. After I got the obligatory \"Oh God\" out of the way I sat down to watch the whole thing with a smirk once I knew what it was. I'm just glad I didn't pay for it and I wonder what my room mate was thinking when he bought it himself. If you base your decision to buy this movie off my review I hope you don't pay more than $1 for this on Amazon or Itunes because its not really worth it. Wait a year or so and watch it when SyFi streams it for free. At least they changed the name so it wouldn't get confused with the real movie...",
         "Piggybacking off the domestic box office disaster \"Battleship\" as much as they can, The Asylum released their low-budget knock-off entitled \"American Warships.\" Leave it to these mockbuster makers to swoop in on the dead carcass and pick off all the flesh left on the bone after the brutal slaying it suffered. The original title of the film was \"American Battleship\" until Universal Pictures intervened demanding a name-change among other things. The Asylum did what they had to do to get the finished product released and told the studio they \"appreciate the publicity.\" \"American Warships\" begins when a mysterious attack is launched by undetectable ships off the coast of civilization. The U.S.S. Ohio and its crew are brought out of retirement to find out who's responsible for the attacks before the different countries of the world begin World War III. They soon discover that the unknown force is alien. The officers and crew of the ship must find a way to stop them before they can call in intergalactic reinforcements to complete their mission to take over the Earth. This movie once again takes a rather serious direction and doesn't come off as too campy. It took a while to get going, with most of the action in the first 45 minutes or so depending on ships shooting at each other. Things really get interesting when the Navy SEALS board one of the alien ships to see what they're up against. We finally get some of the typical action regular viewers of Asylum movies are used to. The good guys chase the bad guys through some sort of tunnels or hallways while shooting lasers and rifles at each other. The visual effects and CGI are par for the course based on the last few Asylum films. They're just above adequate but light-years ahead of where they used to be. The aliens still suffer a bit visually from blue-screen pasting and CG work, but they look unique. These aliens aren't the garden variety \"War of the Worlds\" or \"Alien\" looking ones we get so many times in these types of low-budget films. One thing that really helps the film is it was shot on an actual Navy battleship. Filmmakers used the decommissioned U.S.S. North Carolina as a stand-in for the Ohio. However, the room supposedly in the Pentagon looked like it was shot in a small rented out hotel conference room with sheets put over the entrances. That kept you grounded in the world of the Asylum enough to where you didn't forget what you were watching. Just like every great Asylum film, we were treated to appearances by actors who have been off the Hollywood radar for a while. Mario Van Peebles stars as Captain James Winston and Carl Weathers stars as General Hugh McKraken. They put their all into the roles they were given and act circles around most of the other cast members in the movie. \"American Warships\" isn't the best Asylum film ever put out. It'll still give fans of these types of movies something to laugh at on a boring Saturday night. I hoped for a bit more cheese, which strangely enough people usually don't want when they watch a movie. However, an Asylum film without the cheese is like a cheeseburger without the cheese. Did I use the word cheese enough in this paragraph?",
         "This is one of worst flick I have ever seen. Even cartoons are way better than this. Is it some kind of joke ? perhaps, Yes. No special effects, utterly boring story line this makes this flick awful. Common guys, even the films from nations who's names are not known are better than this. When I saw the title, I was speculating that, I would see some good sea battle however all in vain. Aliens shown in this flick are too spooky. Don't expect any real acting even if you bother to watch this. Please don't waste your time on this I as did (sadly)",
         "I see a lot of comments of people saying not to watch this movie. I would have to disagree with them. I actually recommend this movie to \"movie buffs\", and people who love movies. Why, you ask? Well, yes it is a horrible, horrible movie. However, movies are designed to entertain for the most part. I will admit, that this movie is surprisingly void of boring scenes that make us wonder, \"When will this movie finally be over?!\". That is the only reason I even gave it 2 stars. Otherwise, this movie is absolute trash, but somehow, it kept me entertained. A lot of the acting is terrible. The wardrobes are especially HORRIBLE.. and I mean HORRIBLE! Aside from the traditional brown military uniforms for ranked officers, the uniforms for the crew are so terrible, that I would liken them to props used in a middle school play. They were wearing plain old blue baseball hats and plain red and blue sweaters and shirts that look like they just came off a Wal-Mart shelf. They still have the wrinkles in them that clothes have when they have been sitting on a shelf for sale before they are washed. They didn't even take the time to attempt to make their clothing look used in the very least. The props are also horrible. Not a single prop looks like military grade at all. The visual effects and audio are some of the worst I have ever seen. The continuity is horrible. The men playing the Navy seamen look about as far away as being a Navy seamen as possible.. and especially the \"SEALS\". They were either little skinny guys or overweight. The hair of some of the male actors was too long and would not even be within military guidelines. This movie looks like it was produced and directed by people that lacked even the basic knowledge of the military. Like I said, this movie is HORRIBLE, but SO HORRIBLE that I believe it would actually entertain a movie buff for that reason!",
         "This is really incredible. The original Battleship movie was not especially highly praised (to say it very mildly). Now imagine this: You have no money. You have no knowledge about the military. You have only one friend from Ukraine who is able to render some crude CGI effects on his trusty 486DX2 from the 90ies. You have zero folks in your team who are actually able to write plausible script. But you have this basement in your grandma's house and some old plastic bags to make an \"interior of alien ship\". You can then find some \"stars\" who are in desperate need to pay their rent and taxes so they submit to this. Also you do have this insane ambitions and zero self-discretion so you go ahead and make... this. This super stupid ripoff of not so bright original who was mostly acceptable for a bunch of kids during a rainy afternoon. It is just insane this was made, it is incredible they managed to find pathetic TV station to broadcast this and even to distribute this abroad. The movie seems to even threaten us with possible sequel. God help us. God help us...",
         "It's general low rating notwithstanding, I actually enjoyed watching \"American Warships.\" Recently I watched the movie \"Battleship.\" It's a big budget blockbuster that has roughly the same storyline - an old American warship forced into battle with aliens. \"American Warships,\" however, is much more exciting and even more \"believable\" - to the extent that any movie of this kind can be believable. Here, the primary warship is the World War II vintage USS Iowa, commanded by Captain Winston (played by Mario Van Peebles.) The Iowa is about to be retired and turned into a museum, and it's on its way to the US from a good will visit to South Korea, when first a South Korean island and then the USS Enterprise aircraft carrier group (also in the area) is mysteriously destroyed. Was it the North Koreans? The Chinese? No one knows, and the Iowa sets off to investigate, while the United States prepares to fight World War III. The attacks continue on various military targets, the tension ramps, a nuclear attack by the US on China (and a return attack by China on the US) is imminent, with only the Iowa (who have now figured out what's happening) standing in the way. The attackers are aliens, trying to goad the world into a nuclear war so that they can take over. The aliens also seemed far more threatening here than in \"Battleship.\" Basically I liked this. It's pretty exciting and tense all the way through. Van Peebles was not too bad as the Captain of the Iowa, and while having a WWII era ship beating powerful aliens in \"Battleship\" made little sense, in this there was a plausible (sort of anyway) explanation as to why that type of warship could succeed in such a battle - the aliens basically knocking out integrated electrical systems to facilitate their attacks (systems that weren't around in World War II) so that the Iowa had the ability to survive the aliens' most powerful advantage. Now, there are some problems I admit. First, by the time this was over I was getting very tired of the \"Star Trek\" type references. We heard about cloaking devices, and ships that had to \"de-cloak\" before they could fire. There were references to phasers and Klingons (not to mention the fact that the aircraft carrier destroyed was the Enterprise, and the main American ship was the Iowa - where Captain Kirk was supposedly born.) All that was a little too much in your face. I liked Van Peebles, but I thought the rest of the performances were perhaps a bit uneven (and I wasn't impressed with David Polinsky as Admiral Hollis.) I also didn't think that there was any reason for having a romance between Winston and Lt. Bradley (Johanna Watts.) I also found it passing strange that the aliens, who supposedly wanted to provoke a nuclear war, would destroy two of the American bomber groups that had been sent off to be prepared to attack China? Isn't that defeating their own purposes? At least I couldn't figure that out. The closing captions of the movie suggest that this is based on a congressional act passed in 2006 retiring the Iowa but making sure that it would remain battle ready, even as it serves as a museum. So the question is: \"why keep an old warship battle ready?\" This is the supposed answer. Overall, though, I thought this was a pretty exciting and enjoyable movie, much better than its reviews would suggest. (6/10)",
         "I myself actually enjoyed this movie, where most people watch science fiction for the special effects i still enjoy a good story.. Although Asylum of course timed there release of this film to come out when Battleship does, it still in itself is a decent movie. What it loses in poor special effects it makes up for with a nice storyline and great acting. That alone is strange as most Asylum movies offer nothing in the line of special effects and usually terrible acting... In closing as I said before the movie was pretty enjoyable to me and seemed to leave you thinking about it in a positive way.. The biggest point of the movie is do not always look to the most high tech methods of defending yourselves Thanks for reading my review",
         "Some individuals have not looked upon this movie very favorably for many reasons. However, I'm retired military and can relate favorably to much of what was depicted in this movie. Having electrical circuits, electronics, and all things run by computer chips can be destroyed by EMP or electronic magnetic pulse unless they are hardened. It is also true that a nuclear air blast will usually do the trick. One reason the USS Iowa was able to still function was it was a WWII ship and did not have a nuclear engine and didn't have to rely on electronic circuitry to fire it's guns, although it initially did have it but didn't need it operate its guns. Some folks got turned off by the science fiction part of it. But it was presented naturally and puzzled the crew, the National Military Control Center and the President. If there was any fault that center was only manned by a Lt Gen, the Secretary of Defense but no one else. You would usually have 4 star generals of the Army, Air Force, Marces and a Fleet Admiral as well the Secretary of Defense, and the National Security Adviser. Regardless the acting was very good, except for the Admiral that was aboard. I felt that actor was a little over the top worrying too much that the Iowa was a museum and a warship. The movie was great and well worth time to watch.",
         "There can be many bad things to say about the film after watching Act of Valor and Battleship over the past few months. To list a few: stereo type navy seals, poor CGI and special effect, inaccurate uniform on non-essential roles, poor research on weapon systems on board...etc. However given the lack of budget for this movie it is an understandably foreseeable outcome. Overall I think it can be worst, especially if you have seen Moby Dick (2010) in the past. At least the movie is shooting on board the real battleship rather than some mock up set inside a studio. For that I'd given the movie an extra star. Rating 2/10. Pretty bad movie, special effect and storyline, however at least you get to see the real Iwoa Class Battleship."
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Asylum, The"],
      "summaries": ["When a US plane is taken down over seas by an unknown assailant, the army is sure it was North Korea and a new war is about to break out. Even worse, the true attacker is an alien armed force and only one old battleship can stop them."],
      "budget": 1000000
   },
   "movielensId": 145759,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-05-15",
      "dvdReleaseDate": null,
      "directors": ["Thunder Levin"],
      "runtime": 90,
      "movieId": 145759,
      "title": "American Warships",
      "mpaa": "R",
      "actors": [
         "Mario Van Peebles",
         "Carl Weathers",
         "Johanna Watts",
         "Nikki McCauley",
         "Devin McGee",
         "Mandela Van Peebles",
         "Chris Hayes"
      ],
      "imdbMovieId": "2175927",
      "originalTitle": "American Warships",
      "genres": [
         "Action",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Yr-Y8IeWymo"],
      "plotSummary": "When an alien force wages war on Earth, only the crew of the USS Iowa - the last American battleship, stands in their way.",
      "tmdbMovieId": 97632,
      "avgRating": 2.0625,
      "releaseYear": "2012",
      "numRatings": 8,
      "posterPath": "/4qXYV36eXngvHF9UCESPcyBDLT8.jpg"
   }
}