{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "werewolf",
         "id": 12564
      }],
      "imdb_id": "tt0055106",
      "video": false,
      "title": "Werewolf in a Girls' Dormitory",
      "recommendations": [
         87736,
         85682,
         22741,
         40954,
         113814,
         221660,
         87110,
         85498,
         35662,
         54875,
         28586,
         23104,
         70702,
         127186,
         28536,
         63088,
         41023,
         27496,
         29071,
         43144
      ],
      "backdrop_path": "/bVNBBK3ePxaJ19xziyWGFbtzkIe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Julian Olcott",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f8104635",
               "name": "Carl Schell",
               "profile_path": "/vfZPBHzJKAU1YdCIPCjj6PuvONv.jpg",
               "id": 591921,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "(as Barbara Lass) Priscilla",
               "gender": 0,
               "credit_id": "5a10e1c9c3a368628c037c53",
               "name": "Barbara Kwiatkowska",
               "profile_path": null,
               "id": 1320920,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Director Swift",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f8104639",
               "name": "Curt Lowens",
               "profile_path": "/3UPPxKXP52sHpDcmPB9FZdA7ayP.jpg",
               "id": 74506,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sir Alfred Whiteman",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f810463d",
               "name": "Maurice Marsac",
               "profile_path": "/pFOrok0fWpi7M1HX8QO7NFURERt.jpg",
               "id": 122008,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "(as Maureen O'Connor) Leonor MacDonald",
               "gender": 0,
               "credit_id": "54f31e8b9251416b3e004151",
               "name": "Michela Roc",
               "profile_path": null,
               "id": 1355618,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Sheena Whitman",
               "gender": 0,
               "credit_id": "5a10e20a92514138f303faa0",
               "name": "Anni Steinart",
               "profile_path": null,
               "id": 1926011,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Walter Geoffrey",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f8104645",
               "name": "Luciano Pigozzi",
               "profile_path": "/iSitmgdtPylwSkX9efVaTJLVfSa.jpg",
               "id": 30900,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mary Smith",
               "gender": 0,
               "credit_id": "5a10e22ac3a368628f03bd4b",
               "name": "Mary McNeeran",
               "profile_path": null,
               "id": 1926012,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Sandy",
               "gender": 0,
               "credit_id": "5a10e239c3a368628c037cf1",
               "name": "Grace Neame",
               "profile_path": null,
               "id": 1926013,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "582e4ecd925141095d00fdcc",
               "name": "John Karlsen",
               "profile_path": "/vKvBi2jGhSSjXke6ZDD4UTDN5hc.jpg",
               "id": 120613,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4689c3a36847f810462d",
               "name": "Paolo Heusch",
               "profile_path": null,
               "id": 239293,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4689c3a36847f810464b",
               "name": "Ernesto Gastaldi",
               "profile_path": null,
               "id": 50818,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.071191,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "AT",
            "name": "Austria"
         }
      ],
      "id": 44444,
      "vote_count": 12,
      "budget": 0,
      "overview": "The new science teacher Dr. Julian Olcott with a mysterious past arrives in an institutional boarding school for troublemaker girls. Along the night, the intern Mary Smith, who is blackmailing another teacher - Sir Alfred Whiteman - with some love letters, is slaughtered by a werewolf. The detective in charge of the investigation attributes the crime to a wolf, while her mate Priscilla believes she was killed by Sir Alfred. On the next days, other deaths happen in the school, reducing the list of suspects.",
      "similar": [
         13666,
         29095,
         28752,
         11797,
         301846,
         2907,
         52520,
         123553,
         346672,
         14219,
         246741,
         7131,
         18239,
         277,
         834,
         24021,
         50619,
         76492,
         12437,
         814
      ],
      "original_title": "Lycanthropus",
      "runtime": 82,
      "poster_path": "/35tgQjabVZIHVUGFSHmwq4KerJA.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1961-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "A new high in horror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Paolo Heusch"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Ernesto Gastaldi"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0055106/",
      "coverLink": null,
      "actors": [
         "Barbara Lass",
         "Carl Schell",
         "Curt Lowens"
      ],
      "reviews": [
         "This is, as you might expect, a movie about a werewolf in a girl's dormitory (although technically the werewolf mostly hangs around in a forest outside the girl's dormitory). The \"girls\" actually look to be about twenty-five on average and resemble European fashion models of the era much more than the \"delinquents\" they're supposed to be. And this was made in 1962 so you're not going to get any nighties or plaid mini-skirts, let alone any nude shower scenes. Still this is an entertaining little movie that serves to show the potential \"beast\" that lurks within the heart of all respectable men when they get around nubile young women. The first murder especially, while tame by today's standards, was no doubt quite a taboo-breaker at the time. The werewolf attacks his victim \"missionary style\" and the screams and cries that she makes as he ravages her off-screen could easily be taken for something else entirely. The other murders and attacks are less lurid, but generally pretty effective. The movie also provides a plethora of great suspects and red herrings including a new professor who left his old job after a mysterious scandal, a benefactor of the school who is paying various girls for sexual favors (and finds himself being blackmailed), the creepy and very bestial-looking groundskeeper, and the very refined headmaster who nevertheless bears a striking resemblance to the werewolf. The movie really keeps you guessing to the end. It's in black-and-white, of course, and it's dubbed (although the European cast does seem to be speaking English most of the time). Not a great movie perhaps, but not a bad way to waste 80 minutes either.",
         "Everything is almost perfect in this underrated horror movie, except the stupid theme song, which was probably added for American distribution only. The scenes in the woods are atmospheric and thrilling due to competent cinematography. The main plot (who is the werewolf stalking a girls reformatory?)might be simple, but it is supplemented with an intriguing subplot of prostitution and blackmail centered around the reformatory. No surprise that the script is by Ernesto Gastaldi who wrote some of the masterpieces of Italian horror cinema in 1960s.",
         "***SPOILERS*** WEREWOLF IN A GIRL'S DORMITORY (aka LYCANTHROPUS, 1961) is a standout in the Italian Gothic horror lineup. This film is part mystery, part giallo, part Gothic horror. Girls in an academy for reforming girls who have gone bad are being killed off sending shockwaves through the school. Enter one goodlooking doctor with a past (Carl Schell, handsome blond brother of Maximilian) who investigates the mysterious deaths and nearly pays with his own life (and his girlfriend-to-be, Barbara Lass (who happened to be the first Mrs. Roman Polanski!) Naturally the head of the academy, Mr. Swift (Curt Lowens) is in fact a werewolf and is responsible for the multiple murders. He is dispatched in the end with a few gunshots courtesy of Dr. Olcott (Schell). The werewolf makeup is quite effective & frightful and the musical score is memorable. \"The Ghoul in School\" signature song is one comedic touch that is a tad out of place, but this isn't a film to take seriously. It's a black and white Sixties chiller and lots of fun for a rainy night. WEREWOLF is not that bad but moves a bit slowly for today's audiences. Good with a few glasses of merlot and good smoke! Luciano Pigozzi, the Peter Lorre of Italy, is fun as the academy caretaker who's a little nuts.",
         "******SPOILERS****** Italian film about a werewolf on the loose in and around a young women reformatory thats much better then it's comical US title \"Werewolf in a girls dormitory\" suggest. Dr. Julian Olcott, Carl Schell, is given a job at the reformatory as a science teacher after six years of not being able to find any work as a doctor. After he was tried and acquitted of the death of a young woman that he was treating. Dr. Olcott soon becomes a prime suspect in the murder of a girl at the school after his first day on the job when Mary, Mary McNeeran, is found savagely murdered outside the grounds of the school. Her gruesome death indicates that Mary was attacked by wolves that have been seen roaming around the woods nearby. With traps set up to catch the killer, or killers, he always avoids them and it becomes obvious that he's not any animal but some kind of insane lunatic who like to tear people apart like a wild beast. With everything being done to kill or capture the person or beast being totally ineffective the staff and inmates of the reformatory as well as the people of the surrounding town are in a state of panic. Thinking that the murderer is living among them and suspecting anyone who's new in the area like Dr.Olcott. There are some deep secrets about the girl who was murdered and who murdered her by the owners of the reformatory Mr & Mrs. Whiteman Maurice Marsac & Anni Steinert and the caretaker Walter Geoffrey, Luciano Pigozzi. Walter who was suspected of the murder of Mary jumped to his death when he was caught trying to suffocate her friend Sandy, Grace Neame. It was Sandy who had a number of incriminating letters between Mary and Alfred Whiteman. Mr. Whiteman killed himself when he was confronted with those letters by Dr. Olcott and Priscilla, Barbara Lass, another girl in the reformatory and also a very good fiend of Mary. And his wife Shenna Whiteman was then herself murdered by the killer for knowing too much about who was involved in Mary's murder by giving her an overdose of drugs. \"Werewolf in a girl's dormitory\" keep it's audience guessing until the last fifteen minutes or so to who the killer or killers are. The movie has very good atmospherics as well as action in the scenes of the attacking werewolf who was much faster and more frighting that you would expect unlike in many other other werewolf movies. Where he's both slow and lumbering with all that makeup on. Luciano Pigozzi steals the movie with his Peter Lorre look-alike portrayal of the creepy caretaker and everyone else's acting in the movie is above average as the staff and inmates of the girls reformatory. Don't let it's title fool you, the movie is much better then it sounds.",
         "Werewolf in a Girls' Dormitory is one of those old drive in type movies which is actually a pretty good film. They acting is good by the cast but it seems like all of them were dubbed. This is a very unusual movie and the werewolf is different looking which he actually resembles the Werewolf of London of the Universal Monsters. Its amazing how some of the characters looked in the film. One actor had a bleach blonde hair style, another actor looked and acted like Walt Disney, the lead actress resembled Kim Cattrall, and the care taker looked like a ghoul without trying to be! Its just something I noticed. This film isn't bad at all. This is part of a double feature which the other on the tape is called Blood Creature which is also a good oldie! For horror and werewolf fans don't miss this one!",
         "Censorship cuts and English dubbing prior to its American release make this movie a bit more odd than it would have been to begin with,but it manages to be a reasonably effective fright flick. One thing that stands out SPOILERS AHEAD: is the gruesomeness and explicit detail shown of the werewolf's young female victims, far more graphic than an American or British film from this period. Some of the renaming and dubbing makes the story seem dislocated, i.e., English writing has been put in on a letter of introduction, stating that the new professor at the girls' reformatory came from Boston, and the reform school is somewhere in Massachusetts. There is a character named Sir somebody, who would be unlikely to be found in the U.S. with a title, and one insert shows blackmail money clearly consisting of English pounds. The overall feel of the picture is European, rather than American, and that's actually part of its interest. One wonders why they didn't leave it intact except for the dubbing part. The German origins of the movie are obvious when a little research proves that the character renamed Priscilla in the Americanized version was originally called Brunnhilde. There's an actor who in both face and manner recalls Peter Lorre, playing the lecherous school handyman. In fact, he seems to be basically doing a Lorre impersonation. The other interesting bit is a very familiar voice dubbed for one of the German actors, the police detective investigating the killings at the school. Close attention will reveal to fans of Euro-horror the gravelly, cynical voice of American actor/director Mel Welles, who can also be heard dubbing the grave robber Lynch in Welles' own Lady Frankenstein. The picture has some fairly suspenseful scenes involving the monster stalking his victims, and the mystery is kept effectively hidden until near the end, but its main interest is as a novelty for horror fans. It's not the worst picture ever made, and worth a peek by horror fans at least once.",
         "There is something bleak and disjointed about this film. First of all, I appreciate the fact that it has an interesting story and a few obstacles thrown in the viewers path. The movie is as much psychological as it is horrific. I don't like slasher movies and am bored with them, especially the ones out of the era where this movie appeared. It turned out to be kind of an atmospheric werewolf movie. It's deliberately misleading at times. Characters are there for no other reason than to confuse us. But it plays by the rules. The main female figure is quite pretty. The rest of the girls seem rather the same and there's a stuffy restraint all around. Nevertheless, there are some attacks, pretty good special effects, and an interesting conclusion.",
         "It has been over 40 yrs. since i first saw this film. There were a few things i had remembered about the film, however, most i had forgotten. This is a black and white film made in 1961. I was about 16 when i first saw it and thought it was pretty neat. That is because i thought that Barbara Lass was cute so naturally, i liked the film. Now, over 40 yrs. later i have it on DVD. Barbara Lass is still cute, but the film lost a lot since i first saw it. The story is easy to follow and figure out. The werewolf doesn't have much hair but passes as OK. The actor, Curt Lowens, did a descent job. The suspense is alright and overall you should find this film mildly enjoyable. Get you're sweetie and you're popcorn ready. Enjoy. John R. Tracy.",
         "The new science teacher Dr. Julian Olcott (Carl Schell) with a mysterious past arrives in an institutional boarding school for troublemaker girls. Along the night, the intern Mary Smith (Mary McNeeran), who is blackmailing another teacher - Sir Alfred Whiteman (Maurice Marsac) - with some love letters, is slaughtered by a werewolf. The detective in charge of the investigation attributes the crime to a wolf, while her mate Priscilla (Barbara Lass) believes she was killed by Sir Alfred. On the next days, other deaths happen in the school, reducing the list of suspects. \"Lycanthropus\" is a surprisingly good werewolf movie in spite of the appealing Brazilian title (\"The Werewolf in the Girl's Dormitory\"). The screenplay constructs the plot with many false leads, and the viewer may suspect of the most different characters, since all of them may be the monster. The acting and the direction are also good and therefore I recommend this flick for fans of the genre. I regret only the low quality of the DVD released by the Brazilian distributor Fantasy, with some minor problems, skipping parts of some scenes. My vote is seven. Title (Brazil): \"O Lobisomem no Dormitório das Garotas\" (\"The Werewolf in the Girl's Dormitory\")",
         "Werewolf in a Girl's Dormitory was scripted by Ernesto Gastaldi, and anyone who knows that name won't be surprised to find out that despite being a werewolf film, this is also a clear precursor to the entire Giallo sub-genre. The film features themes that would go on to become the staple of the Giallo; including a setting full of attractive young girls, and an unknown killer who is picking them off. It has to be said that this film was ahead of it's time, and as the title suggests, the killer in this film is a werewolf, and it would seem that the main inspiration for the scriptwriter was the Universal classic 'The Wolf Man', although themes from more wayward titles such as 'Psycho' definitely shine through. The plot focuses on a dormitory for tearaway girls. When one of them is murdered, apparently by a werewolf, suspicion falls on the new science teacher at the school. Naturally, the crime is attributed to some wolf-like creature, and when the murders continue; the detective on the case ends up getting a surprise! The film is shot in black and white, and looks very cheap throughout. This is certainly a reflection on the budget restraints, although they don't harm it too much as the mystery plot is often enough to pull it through. The scriptwriter would certainly improve as his career went on; with his collaborations with ace director Sergio Martino representing his best work. As you might expect, there isn't a great deal of violence and murder in the film; a reflection on the time the film was made, although this doesn't hurt the film too much as a plot like this doesn't always need blood and guts to succeed. The cast doesn't shine too much, and it's not hard to see why many of them didn't go on to receive cult status, although Carl Schell does stand out; mostly because he looks a bit like Peter Lorre. The conclusion to the story doesn't contain much in the way of surprise, as it's always obvious what the murderer is; although the way that the ending plays out is good in that it inspires some thinking. Overall, while this isn't a particularly good film; it deserves extra plaudits for its influence and frankly bizarre plot, and is definitely worth seeing for Italian horror aficionados!",
         "\"Werewolf in a Girl's Dormitory\" is a pretty enjoyable if slightly flawed entry. **SPOILERS** Arriving at an all-girls boarding school, Dr. Julian Olcott, (Carl Schell) learns that his scandalous past will be forgotten and he is expected to perform like any other teacher on campus. Trying not to interfere with the usual antics of the students on campus, a rash of murders from the students manages to find Sir Alfred Whiteman, (Maurice Marsac) as the prime suspect due to his lecherous ways with the students. When student Priscilla, (Barbara Lass) brings forth evidence of this, it throws more heat towards him, but as the deaths continue, they eventually realize that the killer is a werewolf and could be anyone on the staff, forcing them into a race to stop the killings before more are harmed. The Good News: There was a couple of rather good points to this one. The fact that there's a rather good sense of sleaze generated from the school's dealings is pretty nice. It's quite unusual to be able to see this kind of thing put so prominently in a film from the time-period, as the back-stabbing, cheating, adultery and infidelity are all put on display here, and the fact that so much time is devoted to this is where it gets really nice and dirty, since the film is never made out for certain that what's going on is happening to underage women or not. They look close enough for it to be an issue, the intent of the school would fit in well but the gray area with that manages to be even sleazier. There's also some really nice Gothic atmosphere from the film on display as well, from the darkened woods to the really creepy scenes within the dormitory of the creature stalking the others while they're sleeping, and it leaves a rather nice, creepy feeling during these scenes. This is also on display during the rather fun chase through the woods to open the film, as the action is fast and furious, but the creepy surroundings in the woods makes this one even more of a better scene because it's a thrilling encounter within a creepy location, and that always works. The final confrontation in the laboratory that spills out into the town and through to the bar is a good one as well, making for a satisfying ending that pulls a nice twist out of it as well and makes it a positive ending. The last plus here is the rather nice way it manages to hide the identity of the killer, since there's a couple red herrings strewn about and each one has plenty of evidence, rather than calling one a red herring with a lot of evidence toward it, then naming a few others with circumstantial evidence only, while this one spreads that out amongst most of the red herrings, proving for a healthier mystery and a lot of fun during those scenes trying to figure it out. These here are what work for the film. The Bad News: This one did have a few problems to it to hold it down. One of the biggest ones is that, because it focuses on the sleaze factor, not a whole lot of action is in here. The film takes a while to get to it's good parts that some of the middle section here comes off as downright dull. The endless scenes of everyone running around talking to each other about what's happened to the others or what should be done, and it's a pretty dull move for the most part. These just make the film so dull and really lifeless during these parts. Another flaw to this is that the werewolf, which is another somewhat problematic effort, by keeping the creature off-screen for most of the time, which is a good thing as it's so fake-looking. Keeping the title creature off is a bad thought, but having one that looks this bad is somewhat of a good thing, since beyond a couple of craggily features to give shadows on the face and some fangs, otherwise it's hard to believe that, unless we were told otherwise, this one could be anything else and it wouldn't have mattered as this is one of the few werewolves that looks nothing like what the term implies. These here what really hold the film down. The Final Verdict: This wasn't that bad and actually had some good stuff for it when it had got around to showcasing them. Give this one a shot if you're into the cheesy style or are a fan of European werewolf fare, otherwise this one should be treated with extreme caution. Today's Rating-PG: Violence and mild violence against animals",
         "I think I saw \"Werewolf In A Girl's Dormitory\" in the summer of 1962 when I was thirteen years old on the big screen in the United States. I remember the werewolf chasing the gal in the forest sequence. Now that I have seen it recently on DVD; the more I see it on DVD the more I like it. It is a rather good movie; I like the acting and the music is interesting. I wonder what was the original theme music; I think I read that the United States distributors changed the original European music theme to an American rock and roll music theme; what do American producers know? I say the original music theme is generally better. I recommend renting \"Werewolf In A Girl's Dormitory\" at your neighbourhood video store or buying it at retail video store. Maybe Best Buy might have it in their video section. For people who like werewolf movies, you could add \"Werewolf In A Girl's Dormitory\" to your video library. Will the real werewolf please stand up.",
         "Just last week, I finished reading Guy Endore's classic 1933 novel \"The Werewolf of Paris,\" a highly intelligent, insightful look at this legendary creature of modern-day folklore. Last night I watched the 1961 Italian/Austrian coproduction \"Werewolf in a Girls' Dormitory,\" a film that is hardly classic, overly intelligent or insightful, but that did come as a nice treat for me anyway. To my great surprise, this is not the teenage lycanthrope panty raid that I had been expecting, or the camp fest that the title would lead one to anticipate. The film deals with a series of brutal murders in a young women's reformatory school in what is supposed to be the U.S. but feels distinctly European. To its credit, the movie boasts some pretty creepy atmosphere, effective music, very passable B&W photography, and very decent acting (although it's hard to tell for sure about that last with the terrible dubbing). It feels like a cross between a monster flick and an early Italian \"giallo,\" with a dash of mystery thrown in. Who IS the werewolf? Is it the new, hunky blond professor with a secret in his past? The lecherous old teacher who's being blackmailed by one of the students? Or howzabout the Igor-like, handicapped handyman? Most viewers will never guess; I know I didn't! The Maltin book inexplicably gives this film its lowest \"BOMB\" rating, but I think the editors there are being way too harsh. Although \"Werewolf in a Girls' Dormitory\" is nothing great, it still deserves some respect for the effective and well-put-together thriller that it is.",
         "Mystery ... intrigue ... actresses sounding like they're having an orgasm while being attacked by a monster ... this was what good film-making was all about in the fifties and sixties. Lycanthropus has all of this and more. After murders begin to occur at a reformatory school, the students and indeed some of the teachers begin to suspect (rather randomly) that a werewolf is responsible. It quickly becomes a mystery to discover who the werewolf is, with several red herrings thrown in before the real killer is revealed to the audience. This movie is notable as being probably the first Italian werewolf movie ever made. It was released as \"Werewolf in a Girl's Dormitory\" in the US with the usual crappy dubbing, which is always good. The over-acting on screen coupled with the vocal over-acting will mean plenty of entertainment for fans of those awful old B-movies. However, aside from a couple of key scenes, it's not quite bad enough to be good. The guy who plays the creepy janitor reminded me a lot of Peter Lorre, so his performance was quite enjoyable, but basically there's not enough content here to fill the entire ninety minutes. There are large segments which are just plain dull. It's pretty much an average B-movie, good for collectors and genre fans.",
         "Neither a gothic classic nor a complete waste, Lycanthropus, better known to many as Werewolf in a Girl's Dormitory, has some interesting qualities amidst a backdrop of flaws. The plot is one of the film's biggest problems as it tells of a young doctor coming to teach at a girl's reformatory-type school because of a problem in his past medical practice. When he arrives, girls start dying(okay, actually only one of the girls dies and a couple of old ladies follow suit later in the film). The story, even when the bizarre, impossible resolution is presented, just doesn't wash. I could pose question and ridiculous scenario after another. What is worse than the script is the acting. No one in here is very good. Carl Schell as the romantic lead is bearable at best, and Barbara Lass has the most amazing set of eyes I've seen in some time(that doesn't make her performance much better unfortunately). Luciano Pigozzi, a dead-ringer for Peter Lorre, unfortunately only has Lorre's looks and NONE of his talent. No one acts with any real degree of sincerity and some of the performances bordered on sublime examples of inspired bad acting(Watch the performances of Curt Lowens and Anni Steinert especially to know what I am talking about). Make-up for the \"Werewolf\" also was sub-par. What the film DOES have is some style and sense of mood, looking very European in execution. Although plot transitions are very poor, the film does manage to gel for the most part. Nowhere near a classic in any way, Werewolf in a Girl's Dormitory is an entertaining excursion. Heck, it's worth it just to see it for its title!",
         "Why, in the girl's dormitory of course! My thoughts exactly! The creators of this low-keyed European horror production had one luminous idea and immediately processed it into the title. Unfortunately, they put all their of their ingenuity in the title and the setting and the rest of the film is dreadfully soporific, unexciting and infuriatingly dull. The plot isn't your average werewolf tale but a murder-mystery and, with a slight bit of imagination, you could even call it a predecessor for the later (and much superior) Italian Giallo sub genre. Several of the elements in the story would later grow out to become fundamental key aspects in nearly every Giallo-effort, like a school full of wayward girls, the likable teacher character investigating, blackmail, sex for money and \u0096 of course \u0096 vicious murders in the woods. A new teacher arrives in the secluded boarding school for 'naughty' girls and barely one day later, the police are already investigating the peculiar death of a student, whose body got barbarically ripped to pieces. It looks like the work of a wild animal, like a wolf, but her gorgeous roommate Priscilla discovers the victim was involved in a sex-and-blackmailing game with the school's resident and respected head teacher. Since all suspicion falls on the new guy, he's eager to help Priscilla out with her investigation. All I can conclude is that \"Werewolf in a girl's Dormitory\" was made at least a decade too soon. The subject matter isn't necessarily ahead of its time, mind you, but the film could have been a modest classic if only it could have benefited from gorier make-up art and sleazier undertones. In the 1970's, the setting of a school for wayward girls would be the ideal excuse to show nudity, perverted characters and explicit bloodshed. But because it's an early 60's film, the 'wayward' girls are sweet and obedient and the horror is reduced to showing a couple of bodies with their eyes wide open. Sleaze and gore might not have improved the quality, but at least the film wouldn't have been so boring.",
         "If you get nothing else from this movie - enjoy looking at Barbara. But really, this movie was not that bad. Usually I groan at the lame herrings thrown out to the viewers like we are dead sheep - this movie kept me doubting myself... ( I was actually correct but wasn't sure until it was obvious). In other words this movie was very decently written. Not to say there wasn't any detractions. The voice dubbing was horrid, and any movie that starts with a man holding his crotch is not a good indicator of what is to come. Also all employees at Polish Girl(20-25 y.o.) Dorms cannot... I repeat, can not bend any unnecessary joints and when removing a brain from a wolf (don't ask you won't understand even when you watch this) make sure it is alive while cutting. But even with all that I still liked this movie. I can see this being remade into a movie now (If it hasn't already, I saw a 2006 title eerily similar while searching for this movie.) Unfortunately today they would need gratuitous boobage and much more gore to make it sell. Something this movie did remarkably well without. This is a thinking man's movie - just don't be disappointed with the lack of modern \"Girl's Dorm\" movie expectations.",
         "A new teacher, Dr. Julian Olcott is hired by Mr. Swift and his colleague Leonor MacDonald to teach at their remote reformatory school for girls. After his first day on the job that night a murdered girl is found outside the school grounds, which is thought to be that of a wolf attack. Soon enough, the police get involve with everyone becoming a suspect, especially Dr. Olcott and the shifty caretaker. But one of the girls, Priscilla is on the case to try and figure out what really happened, but she does have some hurdles to pass as the true murderer has managed to allude the authorities. Now this drive-in goodie was a real surprise package! No-way was it what I was expecting, because it's better than what it's campy title and opening (if quite catchy) theme song \"The Ghoul in School\" suggests. That's not to say I think it's brilliant because it's far from faultless, but the captivating Gothic tale was definitely above-average for such a cheaply made Italian production. I found it hard not to be entertained because there was a real mixture in this hybrid's rigidly drawn up plot that raises enough effective turns and thrills. You might think the story will play out like a typical werewolf film, but here it doesn't because the additional sub-plots weaved into the main story provide a large portion of mystery and even an Giallo mark is made. It does keep you guessing on how things are going to work out with a numerous amount of shifty red herrings thrown in for good measure and hints are tipped here and there. I thought it was a well-constructed film that was able keep my full attention, as there isn't much in the way of a boring moment with many things worked into the story, solid pacing and that of some well-executed scenes. But I would be lying if I said it was perfect work all round, because it isn't. There's some foreseeable inconsistencies in the plot that are hard to swallow, mostly static performances and the script was artificially, constrained. While, the performances seem wooden I blame that more towards to the dubious dubbing with its clumsy sounding script, which makes it seem far worse than it actually is. But these shortcomings didn't take away too much for me, as I thought the good aspects outweigh the bad. The stunning Barbara Lass (Roman Polanski's first wife) is innocently cute in appearance with those piercing puppy dog eyes, but she's also capable enough to take the pivotal role as Priscilla. Her co-star Carl Schell performance is rather limited as Dr. Julian Olcott and Curt Lowens is modest as Mr. Swift. Like others have already stated Luciano Pigozz who plays the caretaker has a real striking resemblance to that of Peter Lorre. While, the performances might no blow you away I thought they portrayed their characters suitable enough by adding some likability and interest. Director Paolo Heusch is rather work-man like in his direction by providing the film with his crisply, moody style and some surprisingly intense sequences that are built up rather nicely. The film provides a 'little' in the way of horrid violence and sensual activity, which is really tame by today's standards, though. The atmosphere is highly dense with it creaking of unflinching gloom and the surrounding forest around the school comes to life with the uneasy sounds and that of the wolves howling add good effect. There's such a surreal quality brought out of the atmospheric awe. Half of the film does take place at night and gladly there's good lighting on show. Heusch manages to bring some dark moments and generate such an foreboding mood that sneaks up on out of the shadows with you only catching a brief view of the roaming danger, well that's until it gets to the well conceived climax where all the revelations kinda fit in place. The werewolf's identity might not be a huge surprise but the lead up to it is simply enjoyable. The make-up for the vicious beast is actually quite impressive. Though, it does look kinda like Dr. Jekyll with sharp fangs, a bit of fuzz and claws. The cinematography is fluid in detail and the ripe score has a range of tunes that build up a urgently, striking essence. An engrossing low-budget, Euro-Horror experiment that horror fans shouldn't pass on. Well worth a look.",
         "fun little flick is actually decently acted and stylish it is very cheesy but fun if you don't take it seriously the make up effects are pretty bad and the finale is pretty predictable and there is lots of cheesy dialogue and this is also fairly fast paced and never boring this was made in 1962 now there are lots of flaws for example it is predictable and the ending could have been better but this is still quite the entertaining werewolf movie it is actually pretty gory for a 1962 movie also the characters are pretty enjoyable the script is decent even if it is really cheesy there are lots of unknown actors in this still they did a pretty good job if you see this on cable or for rental pick it up or take the time to watch it you should have a fun time i saw this under the title werewolf in a girls dormitory i give this a **1/2 out of 5",
         "Far-out werewolf flick actually aims a little higher than you'd think, especially after you hear the goofy title song. What really takes place is an early \"giallo\" type murder-mystery with werewolf overtones. Lots of red herrings, although the identity of the \"ghoul in school\" should be pretty obvious by the time the secret is revealed. I liked this one because of the obvious retro stylings, as well as some decent spooky sequences (nighttime chases through the misty woods, etc). Campy fun, and not to be taken seriously, but very stylish for a low-budget thriller.",
         "I just finished this movie for the first time and found it entertaining. I personally enjoy old black and white horror films since I grew up with them. This one keeps you guessing and is certainly worth watching if you get the opportunity.",
         "Not bad black-and-white early 60's English-dubbed Italian-Austrian made horror film. Shows its Germanic roots. The sets, actors, moody atmosphere and spooky music makes it seem like a West German Edgar Wallace mystery film. A werewolf is stalking the grounds of a girls' reformatory. It never goes near the dormitory. There is no lack of suspects among the faculty. The famed \"Ghoul in School\" song was never heard by myself, at least in this release. Highly recommended.",
         "Lycanthropus is worth watching on several counts. It is first of all a relatively early example of what might be called the Italian assault on Hollywood genres, which, despite the evident elements of pastiche, but pastiche that is perfectly assumed and does not pretend to be otherwise, would end up by producing two distinctive genres that have been enormously influential in the history of cinema. The Spaghetti western is far better known and appreciated while the giallo (its \"horror film\" equivalent) has never attained quite the same acceptance except amongst aficionados or those critics sufficiently cinema-literate (Scorsese for example) to appreciate the importance of a tradition that includes such figures such as Mario Bava and Dario Argento. As regards the bad dubbing, this goes to some extent with the terrain. It is noticeable that people will complain of it here but find it quite acceptable in Spaghetti Westerns, where, apart from the swisher films of Leone himself, it is generally understood to be to some extent a trope associated with the genre and might even be regarded as one of its dubious charms.. Now Heusch is no Bava, it is true, although the two men would work together; they effectively co-directed the 1958 science fiction film La morte viene dallo spazio although Bava was only credited as cinematographer (another assault on a Hollywood genre that did not really lead anywhere and later rather merged with the giallo). Perhaps one of the reasons for the giallo's comparative lack of penetration was that, whereas the Spaghetti Western was largely unrivalled (the old Hollywood western was dead and the later US revisionist westerns were often a homage to Spaghetti Western rather then a response), the Italian giallo had to compete with an already well-established British tongue-in-cheek horror tradition (mainly associated with Hammer Films) that had the advantage of English as their first language. British horror and Italian giallo are not however the same, the latter excelling by its cinematography (not too apparent in this early example) and by a greater whimsicality or even reflectiveness (oddly for Italian films, less \"bums and tits\" than their British equivalents). To call that reflectiveness intellectual would sound ridiculous but is does have something of the quality of an intellectual exercise, a quality that becomes more marked as the genre progresses (very apparent in the films of Argento) and is later quite closely related to the growth in importance of what might be called the \"puzzle\" film or even the \"popular pretentious\" film (such as, in reverse order of pretension, Greenaway - at its best - Aronofsky, Nolan, Anderson, or even - at its worst - Ang Lee). While most of this still lay in the future in 1961, there are some playing with the tropes of the horror genre that are interesting here. As several reviewers have pointed out, there is the obvious resemblance of one of the actors (Luciano Pigozzi not Carl Schell)to Peter Lorre but, as interesting is the resemblance of Schell, the German actor who plays the hero, to Karlheinz Böhm who had played the lead in Michael Powell's notorious but remarkable film Peeping Tom just the year before. This British film proved too shocking for the British public of its time and well nigh ruined Powell's career. Now very much a \"cult\" film, it bears little relation to the conventional British horror and is in many ways closer in style to the giallo. Also interesting is the appearance in the film of another German actor, Curt Lowens, who plays the school's director. This was the first major part Lowens had played in a film and he was principally known as a man who had spent the war in hiding, rescuing fellow-Jews deportation and death and who had emigrated to the US immediately after the war (he would subsequently have a long and undistinguished film career mainly playing caricatural Germans, often Nazis). It is interesting because of the way the film is tied in with a genre of great importance throughout the world in the post-war period - delinquency and reformation. Lowens is here playing the typically humanitarian reformer who appears in nearly all such films. The English title which renders the setting of a girl's school purely a matter of titillation (although of course it is that too) seriously misrepresents the film. This \"reform school\" element is allied to the central horror theme by the discussion of lycanthropy as curable illness rather than as simply some kind of crudescence of evil. This relates obviously to the equivalent debate about the treatment of criminals and delinquents, a connection which is made very clear (perhaps even too clear) in the film. This all belongs within the scope of the monster horror genre but is perhaps more associated with the European tradition (going back to Murnau's Nosferatu and, even more clearly, Lang's M. the film in which of course Peter Lorre made his name and a film which the Nazis would attack as typically Jewish and \"soft on criminals\". The US tradition, with its firm belief in the existence of good and bad, was more inclined to emphasise the \"kill the beast\" element. In this context the presence of Lowens in the film assumes a particular importance. To hear from the mouth of a celebrated Holocaust survivor the sentiment that \"judgement lies with God alone\" gives, to say the least, food for thought.....",
         "If a dormitory is some kind of alternative prison and girls are adult women and in means never in,the title makes complete sense. I watched this twice and still don't know what to make of it. The girls seem really slutty at the beginning but we soon learn that they are actually much worse than that. They have no problem frequently climbing the 15 foot high spiky front gate and never even think about just jumping the 3 foot high wall two feet away. The werewolf tries to gently massage people to death and usually fails. Who's the werewolf? I have no clue.The men are that boring and similar. The best thing about this movie is that all the doctors and professors have guns.That seems to be a common thing in these movies and it never gets old. Watch at your own risk."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["Royal Film"],
      "summaries": [
         "The new science teacher Dr. Julian Olcott with a mysterious past arrives in an institutional boarding school for troublemaker girls. Along the night, the intern Mary Smith, who is blackmailing another teacher - Sir Alfred Whiteman - with some love letters, is slaughtered by a werewolf. The detective in charge of the investigation attributes the crime to a wolf, while her mate Priscilla believes she was killed by Sir Alfred. On the next days, other deaths happen in the school, reducing the list of suspects.",
         "At a girls' school, several students are murdered by a snarling, wolf-man-like creature. Suspicion falls upon a newly arrived teacher."
      ],
      "budget": 0
   },
   "movielensId": 145702,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1961-01-01",
      "dvdReleaseDate": null,
      "directors": ["Paolo Heusch"],
      "runtime": 82,
      "movieId": 145702,
      "title": "Werewolf In A Girls' Dormitory",
      "mpaa": "",
      "actors": [
         "Carl Schell",
         "Barbara Kwiatkowska",
         "Curt Lowens",
         "Maurice Marsac",
         "Michela Roc",
         "Anni Steinart",
         "Luciano Pigozzi",
         "Mary McNeeran",
         "Grace Neame",
         "John Karlsen"
      ],
      "imdbMovieId": "0055106",
      "originalTitle": "Lycanthropus",
      "genres": [
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": ["-bZpntzPJkM"],
      "plotSummary": "The new science teacher Dr. Julian Olcott with a mysterious past arrives in an institutional boarding school for troublemaker girls. Along the night, the intern Mary Smith, who is blackmailing another teacher - Sir Alfred Whiteman - with some love letters, is slaughtered by a werewolf. The detective in charge of the investigation attributes the crime to a wolf, while her mate Priscilla believes she was killed by Sir Alfred. On the next days, other deaths happen in the school, reducing the list of suspects.",
      "tmdbMovieId": 44444,
      "avgRating": 2.16667,
      "releaseYear": "1961",
      "numRatings": 3,
      "posterPath": "/35tgQjabVZIHVUGFSHmwq4KerJA.jpg"
   }
}