{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "undead",
            "id": 10327
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "soldier",
            "id": 13065
         }
      ],
      "imdb_id": "tt1043585",
      "video": false,
      "title": "Zombies: The Beginning",
      "recommendations": [],
      "backdrop_path": "/f6Mw3sE4qGCz6BxEyTpAKGiAyRq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Sharon Dimao",
               "gender": 0,
               "credit_id": "56c2cfa49251414b850010c3",
               "name": "Yvette Yzon",
               "profile_path": "/olnkUNY6Ni7CnjeGMRLY9DY9uqn.jpg",
               "id": 231991,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mark Taylor",
               "gender": 0,
               "credit_id": "56c2cfbf9251414b0a00104c",
               "name": "Alvin Anson",
               "profile_path": "/agjhCaBOVocPwsc6orUn9I7FM13.jpg",
               "id": 231981,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Paul Barker (as Paul Holme)",
               "gender": 0,
               "credit_id": "56c2cfce9251414a92001dce",
               "name": "Paul Holmes",
               "profile_path": null,
               "id": 107325,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Captain Jurgens",
               "gender": 2,
               "credit_id": "56c2cfe2c3a36825fb001c44",
               "name": "James Gregory Paolleli",
               "profile_path": "/zGnSBo52Ost1CjCVTiSxIDHZ7VE.jpg",
               "id": 936235,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sgt. Zamora (as Robert B. Johnson)",
               "gender": 0,
               "credit_id": "56c2d09fc3a3682606001fe1",
               "name": "B.B. Johnson",
               "profile_path": null,
               "id": 1578342,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Patricia Kramer (as Diana Croyston)",
               "gender": 0,
               "credit_id": "56c2d16cc3a368455f001225",
               "name": "Dyane Craystan",
               "profile_path": null,
               "id": 1043277,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Thompson",
               "gender": 0,
               "credit_id": "56c2d1939251414b85001112",
               "name": "Gerhard Acao",
               "profile_path": null,
               "id": 1496400,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ludmann",
               "gender": 0,
               "credit_id": "56c2d1a6c3a36825fb001c95",
               "name": "Mike Vergel",
               "profile_path": null,
               "id": 1578343,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself (uncredited)",
               "gender": 0,
               "credit_id": "56c2d1cac3a36845fe0010fe",
               "name": "Bruno Mattei",
               "profile_path": "/4jASte6gc5lPE95cCAxgN55ZtDk.jpg",
               "id": 45672,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Giant Zombie (as James Gaynes)",
               "gender": 2,
               "credit_id": "58bfd4fcc3a3686945004ead",
               "name": "Jim Gaines",
               "profile_path": "/aiIfIrI4wtWQKp3MaTauLIagGdq.jpg",
               "id": 45581,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a5cc3a36847f81c994d",
               "name": "Bruno Mattei",
               "profile_path": "/4jASte6gc5lPE95cCAxgN55ZtDk.jpg",
               "id": 45672,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56c2d1fdc3a36847c5001190",
               "name": "Giovanni Paolucci",
               "profile_path": null,
               "id": 1043280,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56c2d2109251414b4d001030",
               "name": "Antonio Tentori",
               "profile_path": null,
               "id": 31776,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56c2d226c3a36825f9001ca3",
               "name": "Giovanni Paolucci",
               "profile_path": null,
               "id": 1043280,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56c2d23d925141441100118b",
               "name": "Rey de leon",
               "profile_path": null,
               "id": 1185034,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "56c2d259c3a368260600201e",
               "name": "Claudio Cosentino",
               "profile_path": null,
               "id": 566933,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56c2d269c3a3682606002021",
               "name": "Daniele Campelli",
               "profile_path": null,
               "id": 231986,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.368049,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 105989,
      "vote_count": 2,
      "budget": 0,
      "overview": "A woman floating on a raft in the middle of the Pacific. She was found by a rescue team and taken ashore. Once there, she tells a story of how she escaped from an island full of zombies. She was persuaded to lead a commando unit to the island to explore.",
      "similar": [
         11429,
         336843,
         485415,
         19204,
         1694,
         24920,
         1576,
         19908,
         9426,
         1562,
         72190,
         263115,
         667,
         126889,
         82654,
         766,
         16288,
         10925,
         15762,
         8408
      ],
      "original_title": "Zombi: La creazione",
      "runtime": 91,
      "poster_path": "/m5CSnXIRtRAjI6qYtvdDSmzY8Dm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Diamonds International Film",
         "id": 22030,
         "origin_country": ""
      }],
      "release_date": "2007-05-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "When the dead first walked, they had no time for appetizers.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruno Mattei"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Giovanni Paolucci",
         "Antonio Tentori"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1043585/",
      "coverLink": null,
      "actors": [
         "Yvette Yzon",
         "Alvin Anson",
         "Paul Holmes"
      ],
      "reviews": [
         "Zombies:The beginning is not a beginning in any way. In fact is a sequel to Island of the Living Dead and also is the last movie from Italian exploitation director Bruno Mattei. Mattei made a lot of movies, more than 100, and he was famous for using footage from other movies, music from other movies and also plots from other movies, he was a professional rip-off director, but he managed to made some really entertaining movies (zombie movies, WIP movies, erotic, gore, action, nun exploitation,etc) . Zombies The beginning is his last movie and, fortunately, it's a good end for Bruno. The movie delivers the goods, is a blood packed action zombie movie, with the usual stock stolen from other movies and the complete lack of originality, but its very good in his own way. Lots of action, lots of zombies, good fx and good costumes, lots of torched babies and atrocities. The movie is shot on digital video and that's the only reason this one is not as good as mattei 80s zombie movies, the film look. But in action, gore and entertainment this one is as good (in terms of entertainment that is what matters after all more than cinematography) as those ones. Bruno is dead. Long Live Bruno. 7/10",
         "Bruno Mattei's latest and last flick brings more zombie madness to our bloodthirsty mitts. I for one am not the biggest fan of zombie flicks, but I respect a movie with loads of gore and with a high level of cheese. And yep, Zombies: The Beginning delivers just that. The story revolves around some cuteass Asian babe who plays a scientist of sorts. She's the lone survivor of a zombie rampage which left her entire crew/team dead. Events lead her back to the island where the zombies live...unlive. And as you can guess, loads of zombies and gore follow. Some weird turns in the story take place, but really, you're only really expecting the next scene of violence. Which basically, this film is fine for. Z:TB was pretty fun, but ultimately it was a tad too tedious, and just really amateurish. For example, in the first 20 minutes they show a nightmare our lead lady has been suffering from three times. No biggie if it's quick or cool, but nope. It's long and stupid....but understandable. Of course if you love cheesy, foreign zombie flicks, this shouldn't bother you in the slightest and you should feel right at home. If you're a die hard fan of Mattei or zombies, there's no reason not to check it out. It delivers the red stuff, the awful (good thing) dubbing, and a ridiculous story. Just don't expect our leading lady to shed any clothing. Even with those nice boobs....no nudity. Oh well, at least there were some zombie boobs.",
         "Bruno Mattei's final film picks up directly after ISLAND OF THE LIVING DEAD with Sharon (Yvette Yzon), the lone survivor, being rescued at sea. Back on the mainland, Sharon is having nightmares and execs at Tyler, Inc. don't buy her story on how the ship and crew disappeared. Six months later, Sharon is a monk but is contacted by Tyler, Inc. to participate in a rescue mission after contact with a colony on a nearby island is lost. Sound familiar? Yup, ol' Bruno gets his James Cameron on in his pumped up sequel. Actually, I should say Mattei is getting his James Cameron on again as this is his second film to rip off ALIENS nearly scene-for-scene (after 1990's equally amazing SHOCKING DARK). This is truly a high note for Bruno to go out in for his long career of xerox cinema. Why? Is it a technical masterpiece? Does it contain amazing acting? Hell no! It is because Bruno has the gall to lift tons of scenes from CRIMSON TIDE and shamelessly steal the TERMINATOR 2 theme. There is also stolen footage of an oil plant blowing up, but I couldn't place it. I was equally disappointed and impressed that Mattei didn't steal anything in the previous ISLAND, so this was a welcome return. Plus, you have to love a direct sequel titled ZOMBIES: THE BEGINNING. What? The mimicking of the plot of ALIENS, 21 years after the fact, is just hilarious. Every major scene is here, just with 1/50th of the budget. Yzon gets all tough like Sigourney Weaver's Ripley and the film's bloody finale has her in a big breeding chamber where there is a huge talking brain (no, it is never explained). In terms of entertainment, I would rate this one above ISLAND, for the sheer ripoff factor. But they both need to be seen together. I did them back-to-back and that might be the best way as you feel like you are getting a 3-hour zombie mini-series. The flick ends with a short clip of Bruno saying something on the set and the words, \"Ciao Bruno...\" on screen. Indeed, many thanks for all of your fine films. And also many thanks to Cameron, Romero, Stallone, Spielberg and all of the other director's who have given Mattei \"inspiration\" over the years.",
         "Bruno Mattei's death really was a sad loss for lovers of exploitation. In the last few years of his life he churned out loads of shockers, including 'Snuff Trap' (which I really enjoyed) and that one that's a cross between Predator and Cannibal Holocaust...aye, 'Land Of Death', that's the one... This one here, though, is an absolute cracker and easily as 'good' as his 80s classic, 'Hell Of The Living Dead'/'Zombie Creeping Flesh'. It takes half an hour or so before it kicks off, but when it does, you will be incredulous that a film like this could still be made in 2007. Dialogue and dubbing are reliably hilarious, there's shedloads of gore and some very nasty and distasteful set-pieces. Plot is vague and gets mighty confused at the end, but you'd expect nothing less really. Cinematography looks nice and whilst I'm pretty sure this is SOV, it looks a lot better than 'Land Of Death' (which looked really CHEAP, but not in a good way). This movie gives you hope that this sort of thing can still be done - rip-roaring, action- packed brainless un-PC horror with not a shred of irony or post-modernism to be seen. All this needs is a score by Goblin or Fabio Frizzi and it would be pretty much perfect. Some brave director needs to pry the baton from Bruno's cold dead fingers and continue what he started...Highly Recommended!",
         "Wow, I don't know who the fanboy was that wrote the review that made me want to watch this but I feel I must warn everybody else what a stinking pile of poo this \"movie\" is. Let me start by saying I Love zombie movies. I also love the Alien series of movies. If you take the plot and characters and dialog of the Alien series, get a bunch of bad \"actors\" to recite the lines, replace aliens with zombies and great special effects with really crappy ones, that pretty much sums up this effort. I'm not saying they stole ideas from the Alien series, They literally stole entire scenes and dialog and just did it really crappy. There was not even an attempt to disguise the blatant thievery. Oh, they did replace the aliens with zombies. Did I mention that????????? Total crap, total waste of time and the worst effects I have seen since the 60's. If you love zombie movies, stay away from this one.",
         "Mattei's final film is truly amazing. It is bizarre, disgusting, and incredibly cheesy. The plot is basically just the movie Aliens(1986), except with zombies as the enemy instead of the xenomorphs. The zombies have excellent makeup, they look much more like rotting corpses then much of Mattei's earlier work. The acting is hilariously terrible. Even though this was filmed in English, Mattei used the old Italian trick of dubbing all the dialog. This has predicable results, with the actors putting emphasis on the wrong syllables and words, and having far less emotion when delivering their lines. This helps the movie out tremendously ,however, as most dialogue scenes are chocked full of potential quotes for bad movie lovers. The gore is good, it is not as explicit as some of his previous movies but it is still very entertaining. The rest of the special effects are more laughable then anything else. But what do you expect from a Mattei production? All in all, its a great movie, filled with quotes and moments that exploitation fans will love. It is sad ,though, that such an entertaining filmmaker died before he got the respect he deserved. Ciao Bruno.",
         "Sharon, the only survivor of the explosion of the salvage ship Dark Star, is having a hard time with the insurance company in furnishing them with a satisfactory explanation about her accident. She tells the story of her horrible experience, but is considered crazy - no one believes her when she tells about the existence of living dead on an island that can't be found on any nautical map. About one year later... Barker, representative of an important pharmaceutical company, is the only one to believe Sharon, and as there is no news of a scientific crew sent six months earlier to capture some samples of those beings, he convinces her to join the rescue team and take part in the mission. Sharon and the rescue team arrive on the island armed and equipped like marines, and set forth to carry out their task. They reach what seems to be a lab, and discover diverse glass coffins containing horrible genetically-altered mutants, apparently dead. All of a sudden a woman with her belly torn open emerges from the vapours and attacks Barker, who is saved by the swift intervention of Taylor. Their detectors signal another moving presence... they find a baby boy-monster... they are able to destroy it with the help of a flame-thrower. When the members of the scientific crew are located, it is decided to go and recover them in order to leave the island. They come across remains of human fetuses. They battle against horrible creatures - the living-dead children of genetic mutations. Some of them fall prey to those monsters... They must leave the island, but the submarine won't be back for another ten days. An S.O.S. is sent. Truth comes to light: it is Barker who has the task of bringing back one of those creatures to his company... even at the cost of their lives. After escaping from the attack of a myriad of living-dead mutants, Taylor and Sharon discover something hellish: The Nest, where the female members of the scientific crew are used as incubators for those horrendous mutant children - a new generation of zombies. With their flame-thrower they burn all those little zombies. An explosion follows. Sharon manages to escape, but...",
         "You have got to check this film out- it's fekkin' hilarious !! No exaggeration! basically it's a budget version of ALIENS but with Zombies! And when i say 'version' - i mean complete rip off- so blatantly - it will crack you up- entire scenes and dialogue- performed so badly you'll wet yourself- and the dubbing adds an even funnier level to it all. Watch with friends and laugh your socks off!!! It's got the lot- bad dubbing- cheesy gore FX, and the Aliens storyline followed so closely that I'm surprised they weren't sued!! i really enjoyed it- for all the wrong reasons. A must \"Watch with ya friends with some brews\" movie-",
         "Remember, big fan of movies in general and zombie flicks here. I am used to a bit of cheese in a zombie flick. This one stunk like the cheese counter at your local supermarket, or that big bag of especially dank green you just picked up. The first fifteen minutes involve plot set-up (tl;dr: zombies on an island. Yes we should visit it) and the fact that our heroine suffers from nightmares. We couldn't just see her have one nightmare, we had to see three just to really hammer the message home (and to get some zombies in early / use some cool footage they had. Probably). This sets the tone for the rest of the film; dragging things out. Our \"rough and tumble marines\" actually scream and prance like highly strung queens at the first whiff of danger. Particularly embarrassing anyway (stuck in my mind) but then to read that in the strapline, well yeah. The dialogue leaves a taste like tinned ham in your mouth. People repeat things and it is so painfully apparent that these are not trained marines (apparently people with such high training need to be told three times to open fire). But, the worst part of the film is the camera work. The worst part because it is the best part (the film does look good). This means they had some money to make this film with, they just didn't feel the need to spend that money on a compus mentus director, a script that didn't only contain plot holes and cheese, and an editor who doesn't think repetition is the key to success. I'd give the director, the script writer and the editor an honorary Razzie, then send them on a tour of film schools around the world armed with a copy of this film to show the students what not to do when making a film. Oh there's about three plot twists. No one involved in making this had much to say, they figured they'd only get one swing at the ball so they threw everything into the mix. I did manage to clip and file my nails while this was on and miss absolutely nothing, so that's something. M",
         "Rescued at sea from her predicament, the sole survivor of the island massacre reluctantly agrees to return to the island with a group of officers to investigate what happened and find themselves against the same creatures as she was forcing her to lead them out. Overall this one was quite a fun if somewhat problematic effort. One of the best features here is the fact that by being so obvious and unrepentant about its status as a true full-fledged rip-off it allows for the same kind of fun as before. As the whole first half is an abbreviated run-through of the same movie, it gives the same sense of fun here in rolling through the same main scenes which gives this the creepy dreams that brings her along, the transport to the island coming off the same way as before and the group undergoing the same positions and group formations as they advance and overtake the area. Once inside, it gets even more fun with the locator beacons of the facility, the motion detectors and even the fire-fight against the one creature they come across which leads into the all-out fun of the storage locker confrontation. Taking off on it's own delirious tangent as the still- alive body gives birth to another creature which in turns leads to one of the wildest shootouts possible where the entire room is filled with creatures and brings an endless stream of gunfire, blasting limbs and bullet wounds that results in massive carnage along the way and is an extraordinary highlight, especially leading into the gunfights required to escape as it shows the group running into the creatures in every corner of the building picking them off one-by-one. Though the film does go back into the rip-off realm afterwards again, it does so with flair as the numerous encounters with the zombies means there's plenty of action featured here with the big escape from the lab here allowing for the group splitting up as the first ones get knocked off leading to the numerous firefights and confrontations throughout here as the group falls under constant attack in plain rip-off sequences of these scenes only done in excessively graphic, over-the-top carnage fashion. Again, this one changes nicely from the other material when it gets to the finale as the real source for all the rampage creatures is such a bizarre and otherworldly concept while still tying in somewhat to what happened in the original that it becomes all the more mindbogglingly cheesy to see this one as the chosen scenario here which still adds a lot of great action dealing with the new-found creatures responsible as this simply adds to the utterly deranged atmosphere here. Still featuring the same great gore and special effects work for the most part, these here hold this up nicely against the film's flaw. Again, since there's so much here that's ripped off from other movies, especially in how it goes play-by-play at times, it can be seen as unnecessary to watch this one instead of the source movie based on how much it does follow that route. It's cheap-looking at times, but these flaws here are more individual-preference than anything to do with the film itself. Rated Unrated/R: Extreme Graphic Violence, Graphic Language and Nudity.",
         "The influence of ALIENS (which Mattei had already ripped-off years ago with SHOCKING DARK) is still strong in this direct sequel to ISLAND OF THE LIVING DEAD. Survivor Yvette Yzon is rescued at sea, and (after being a monk for a bit) is later called upon to help escort a military team to another remote island (or, an old disused factory somewhere in the Philippines) where zombie samples from the original isalnd were taken to study. They encounter horrible medical experiments, zombie kids, a dwarf dressed as an overgrown mutant foetus zombie and, at the end a big pulsating brain that controls everything (Yzon goes all Sigouney on it with a flamethrower). A zombie baby bursts from it's mother's womb like in ZOMBIE 3. The more expensive submarine footage is from CRIMSON TIDE(!), and the climatic exploding oil refinery is obviously from somewhere else too. It's much more boring than it's predecessor though. Jim Gaines (who appears as a zombie) was Production Co-ordinator. It was the late Mattei's final film, and is dedicated to him. Movie reviews at: spinegrinderweb.com",
         "Unless you live in another planet, people that watch this type of movies have seen Alien II This story line and progression of the movie, it's that other way better movie. I like low, low, low budget movies, and I think this one actually had a few dollars, just to bad they forgot to pay the writer some money to come up with something original. Asian Zombies, I'm cool with that, but please, better dub would not have hurt. The movie in not even worth renting, but it was fun to see this people's version of the space marines.",
         "A group of rough'n'tumble marines led by Captain Jurgens (stiffly essayed with topmost cardboard aplomb by James Gregory Paolleli) are sent by the powerful company Tyler Inc. to investigate reports of a zombie outbreak on a remote pacific island where a series of secret medical experiments are being conducted. Dr. Sharon Dimao (woodenly played by the pretty Yvette Yzon), who's the traumatized lone survivor of a previous zombie rampage, accompanies the team on their desperate rescue mission. Boy, does this hilariously horrendous honey cover all the essential endearingly atrocious bases to rate highly as a real four-star stinkeroonie: Ham-fisted (mis)direction by legendary hack sleazemeister Bruno Mattei (his last film no less -- and no more, either!), laughably lousy dubbing, tacky excessive gore, terrible acting from a lame no-name cast, cheesy nightmare flashbacks, tin-eared dialogue (sample line: \"You mean zombies like George Romero?\"), erratic pacing, and ineptly staged zombie attack set pieces. The derivative script by Antonio Tentori and Giovanni Paolucci not only blatantly (and shamelessly) rips off \"Aliens\" right down to an annoying wisecracking jerk ala Hudson, but also tosses in a zombie midget, topless zombie women, hideous naked zombie kids with creepy big'n'black bug eyes, a giant talking brain, and even a grotesque zombie newborn baby (!) for extra supremely tasteless good measure. Ray de Leon's sharp cinematography offers a few neatly atmospheric compositions and makes occasional clumsy use of strenuous slow motion. The robust marital score does the rousing trick. An absolute schlocky hoot and a half.",
         "Zombies: The Beginning (2007) * 1/2 (out of 4) Italian director Mattei ended his career with this sequel to ISLAND OF THE LIVING DEAD but don't expect a typical zombie flick. This film picks up right where the previous left as the sole survivor is asked by the government to head back to the island where her crew was killed by the zombies. That's pretty much all you need to know in terms of story as you really don't even need that considering this movie completely ignores what happened at the very end of the previous one. Yes, Mattei's final flick has a lot of zombies but it's actually just a direct rip off of ALIENS. This isn't the first time Mattei has ripped ALIENS and even though this movie is extremely bad, you can't help but somewhat admire how much ripping this guy can do. Not only do we get dialogue and scenes ripped from the Cameron flick but we get the typical stock footage stolen from other movies and this time it's CRIMSON TIDE. How Mattei got away with doing this his entire career is beyond me but quite a few of the sub scenes from that movie are lifted and used here. The movie actually looks like it had a fairly decent budget as the set design is actually pretty good and this is especially true at the end when we visit the alien/zombie tombs. Fans of gore will get quite a bit of that here as the red stuff is constantly flowing with various heads being shot off and parts being ripped or eaten. The CGI effects are quite poor but it adds a somewhat campy feel to the film. The performances, like the previous film, are hard to judge considering how bad the dubbing is but most people don't come to movies like this for the acting. The film doesn't mind ripping off other movies including dialogue from DAY OF THE DEAD and Mattei even rips off his own RATS: NIGHT OF TERROR. Fans of exploitation will probably want to check this out just for the cheese but the biggest problem is that it runs way too long and there's just not enough here to warrant the long running time. Mattei certainly went out with his comeback and this film contains all the bad stuff he'll always be remembered for.",
         "They indeed used the script of alien, its like the movie alien 3 but much worse. but for the effort i gave them a 2. so if you expect a good movie full of action packed horror don't watch this one. on the other hand if you like crappy movies this is the one. things i learned form this movie: explosives used to blast a door open, the blast impact works both ways. zombies have teeth which are similar to vampires an eyeball can be attached on the top of your head where your hair is supposed to be. motion detectors make a distinctive sound i really can fall a sleep watching a horror movie",
         "This is stupid. I'm a big fan of zombie flicks, but this one is awful and stupid. Has Bruno lost his mind? I've seen ALIENS already, thank you, but this is total crap. Don't waste your time. Ignore it. I'd better watch Bruno's \"Virus\" aka \"Hell Of The Livind Dead\" - its more interesting and someone could name it \"classic\". Really, don't waste your time. Acting is awful, story is stolen from ALIENS, FX is awful. Even the dubbing can't help. This flick is made to steal your money if you're a horror flicks fan. At least you can laugh watching it. Just comparing the plots and dialogs. Take some beer with mates and try this one... is you have nothing to do else..."
      ],
      "genres": [
         "Action",
         "Horror"
      ],
      "productionCompanies": ["Diamonds International Film"],
      "summaries": ["A group of rough'n'tumble marines led by Captain Jurgens are sent by the powerful company Tyler Inc. to investigate reports of a zombie outbreak on a remote pacific island where a series of secret scientific experiments are being conducted. Dr. Sharon Dimao, who's the traumatized lone survivor of a previous zombie rampage, accompanies the team on their desperate rescue mission."],
      "budget": 0
   },
   "movielensId": 145817,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-05-01",
      "dvdReleaseDate": null,
      "directors": ["Bruno Mattei"],
      "runtime": 91,
      "movieId": 145817,
      "title": "Zombies: The Beginning",
      "mpaa": null,
      "actors": [
         "Yvette Yzon",
         "Alvin Anson",
         "Paul Holmes",
         "James Gregory Paolleli",
         "B.B. Johnson",
         "Dyane Craystan",
         "Gerhard Acao",
         "Mike Vergel",
         "Bruno Mattei",
         "Jim Gaines"
      ],
      "imdbMovieId": "1043585",
      "originalTitle": "Zombi: La creazione",
      "genres": [
         "Action",
         "Horror"
      ],
      "youtubeTrailerIds": ["fUL-TqYLx3s"],
      "plotSummary": "A woman floating on a raft in the middle of the Pacific. She was found by a rescue team and taken ashore. Once there, she tells a story of how she escaped from an island full of zombies. She was persuaded to lead a commando unit to the island to explore.",
      "tmdbMovieId": 105989,
      "avgRating": 1.33333,
      "releaseYear": "2007",
      "numRatings": 3,
      "posterPath": "/m5CSnXIRtRAjI6qYtvdDSmzY8Dm.jpg"
   }
}