{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "erotic movie",
         "id": 190370
      }],
      "imdb_id": "tt0083710",
      "video": false,
      "title": "Caligula and Messalina",
      "recommendations": [],
      "backdrop_path": "/wMxV5QyxB0wgs2V832MwObnzmET.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Caligula",
               "gender": 2,
               "credit_id": "52fe457fc3a36847f80cae25",
               "name": "Gino Turini",
               "profile_path": null,
               "id": 235949,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Messalina",
               "gender": 0,
               "credit_id": "52fe457fc3a36847f80cae29",
               "name": "Betty Roland",
               "profile_path": null,
               "id": 555524,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claudius",
               "gender": 0,
               "credit_id": "52fe457fc3a36847f80cae2d",
               "name": "Vladimir Brajovic",
               "profile_path": null,
               "id": 38009,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Agrippina",
               "gender": 1,
               "credit_id": "52fe457fc3a36847f80cae31",
               "name": "Françoise Blanchard",
               "profile_path": null,
               "id": 102104,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "5542c624c3a3680cd900066d",
               "name": "Raul Cabrera",
               "profile_path": null,
               "id": 101199,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "5542c6a7925141586800061c",
               "name": "Vincent Lo Monaco",
               "profile_path": null,
               "id": 1383017,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "5542c75f9251415876000655",
               "name": "Fanny Magier",
               "profile_path": "/kQ32VJePvjU5IehWT95ulImkLdf.jpg",
               "id": 104256,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "5542c772925141586d0006f1",
               "name": "Laurence Lovall",
               "profile_path": null,
               "id": 1461295,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "5542c7f7c3a3680ce80006bf",
               "name": "Dominique Irissou",
               "profile_path": null,
               "id": 1140183,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5542c80b925141586d000711",
               "name": "Marie-Noëlle Arnoult",
               "profile_path": null,
               "id": 1461297,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "5542c8259251415865000772",
               "name": "Silvie Dezabauneix",
               "profile_path": null,
               "id": 1461298,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Merope",
               "gender": 0,
               "credit_id": "5542c838c3a3680ce30006b4",
               "name": "Kathy Sadik",
               "profile_path": null,
               "id": 1461300,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "5542c848c3a3680ce30006be",
               "name": "Jean-Pierre Lemaire",
               "profile_path": null,
               "id": 1461302,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 1,
               "credit_id": "5542c858925141586500077a",
               "name": "Florence Guérin",
               "profile_path": "/kTL0vRoRd1TToKgEzSVHSplTIVl.jpg",
               "id": 101936,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "5542c86ac3a3680cd90006c0",
               "name": "Nathalie Berreby",
               "profile_path": null,
               "id": 1461303,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "as Anthony Pass",
               "gender": 0,
               "credit_id": "5542c99592514158650007a1",
               "name": "Antonio Passalia",
               "profile_path": "/gcgorUQM3JHzPIlUH2zgDDZ3JgI.jpg",
               "id": 251135,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe457fc3a36847f80cae37",
               "name": "Bruno Mattei",
               "profile_path": "/4jASte6gc5lPE95cCAxgN55ZtDk.jpg",
               "id": 45672,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53090e2bc3a3684201002cb3",
               "name": "Antonio Passalia",
               "profile_path": "/gcgorUQM3JHzPIlUH2zgDDZ3JgI.jpg",
               "id": 251135,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.154328,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 40084,
      "vote_count": 6,
      "budget": 0,
      "overview": "Messalina (played by gorgeous Betty Roland) is a power-hungry nymphomaniac who will stop at nothing to become Empress of Rome. She brings herself to the attention of Caligula by battling in the gladiator arena and it is not long before she achieves her goal, upsetting the Emperor's youngest sister Agrippina, who hopes that her son Nero will eventually become ruler of Rome. Agrippina successfully plots Caligula's downfall, but Messalina rains on her parade by immediately jumping into the sack with his successor, Claudius. But naughty old Messalina can't commit herself to one man, and shags everyone in sight, including a grotesque, but well-endowed, frequenter of brothels, a randy midget, her eunuch(!?!?) and an ex-lover. When she ends up pregnant, and it is obvious that the father is not Claudius (since he has been away fighting in foreign lands), Agrippina finally sees her opportunity to be rid of her nemesis once and for all.",
      "similar": [
         80752,
         28468,
         50124,
         134764,
         27066,
         48650,
         2770,
         86331,
         341174,
         258480,
         370663,
         55580,
         9453,
         81774,
         249397,
         14174,
         24402,
         27,
         88,
         116
      ],
      "original_title": "Caligula et Messaline",
      "runtime": 111,
      "poster_path": "/33VsLKl4t5ZrtUKYi8zNYPiDSA4.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1981-01-01",
      "vote_average": 2.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Bruno Mattei",
         "Antonio Passalia"
      ],
      "runtime": 155,
      "synopsis": null,
      "writers": ["Antonio Passalia"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0083710/",
      "coverLink": null,
      "actors": [
         "Vladimir Brajovic",
         "Betty Roland",
         "Françoise Blanchard"
      ],
      "reviews": [
         "Released in 1982, this is an Italian film which was probably intended to exploit the publicity associated with Tinto Brasso's notorious 1979 release \"Caligola\". It is clearly a low budget production, shot mainly in the studio, with a number of larger scale dramatic sequences borrowed from other films incorporated at points where these fit reasonably well. Several versions have been released, and run for significantly different times (for example, IMDb lists its running time at 111m, but my VHS copy runs only 92m 41s), so be aware that certain of my comments may not be applicable to all versions. The film provides an interesting study of the life of Messalina, the Roman Empress first married to the mad emperor Caligula and then after his assassination (which takes place at about the mid-point of the film) to his successor Claudius; and it would have been better titled Caligula and Claudius, or just Messalina. Historically it is not strictly accurate but probably provides a fairly realistic interpretation of life in Rome during the periods of the two Emperors concerned. The first half provides a beautifully crafted confirmation of the dictum that power corrupts and absolute power corrupts absolutely, but the second shows a very different scene when Claudius takes the throne, introduces careful and incorruptible administrators and rapidly repairs the damage to the fabric of Roman society caused by his predecessor. Presumably the intention is to show that absolute power does no more than give any ruler the freedom to behave in accordance with his natural character, and in this sense it can be regarded as a film with an important message to convey. Historically the reign of Caligula is regarded as exceptionally violent and cruel, and the film has to make this clear to viewers who are not familiar with the history of this period. Whereas other filmmakers have succumbed to the temptation to exploit the violence in a pornographic way, it is greatly to the credit of this film that unnecessary violence has been largely avoided and much of that which is shown remains implicit rather than explicit. Caligula maintained a vast network of spies, and individuals who spoke against him would often disappear - probably to meet an unspeakable end. This is brought out early in this film, not by showing such a sudden disappearance and what followed, but by a restrained warning from one army officer to another who had been a little too loose in his conversation. There is a brief scene in a Roman torture chamber when plotters against the Emperor are being interrogated, but (in my copy at least) this is less explicit than similar scenes in many films depicting events in mediaeval Europe. A legend that Messalina, a very junior lady in Caligula's court, was trained by her mother to come to his attention by mastering such masculine skills as swordplay, and then demanding to demonstrate these, has been incorporated into the film; and the nearest it comes to becoming pornographic is during a fairly graphic swordplay sequence in the Coliseum which unexpectedly ends in not Messalina but the gladiator having to appeal to the Emperor to spare his life. This sequence clearly shows the violence and cruelty which was associated with the Roman Circus. However it forms an important part of the story, and in my opinion it is treated with enough restraint to be more acceptable than many of the violent scenes incorporated (with less reason) in certain films intended exclusively for children today. Later, even the assassination of Caligula is shown without a rather meaningless bloodbath involving all and sundry; and in the second half of the film after Claudius has taken the throne, the trust shown by the Emperor in his chosen advisers (both military and civil) is clearly brought out. Nudity?, yes there is nudity in many of the scenes showing the decadence of Caligula's Imperial Court, but it is never obtrusive - it always seems a natural part of any scene where it occurs. Afterwards, when looking back on the film, it is very hard to remember which scenes these were. There are none of the visual excesses to be found in films such as Tinto Brasso's \"Caligola\". Another sequence displays the continuing decadent life at Court after Caligula's death during a period when Claudius and his legions were campaigning in Britain, this very effectively shows decadence as an ongoing characteristic of life among the Roman ruling class of the period, not something which was introduced at the whim of a mad Emperor. This film is definitely not just softcore pornography, and it provides two very important lessons for us today. The first is that absolute power will only corrupt those rulers who are corruptible, whilst the second, even more important but maybe a little less obvious, is that mankind has changed very little during the past two millennia; and that many rulers, such as Hitler, Idi Amin, Pinochet or Sadaam Hussein who have been given absolute power during the past century, have shown a behaviour pattern very little different from that of Caligula. Overall this film, together with Fellini's Satyricon, have both significantly contributed to my limited understanding of what life may have been like in classical Rome. No one today can really appreciate how it would have felt if they had been a part of Roman society, but we must recognise that, for most Roman citizens, family life continued under Roman law in what was probably a remarkably stable pattern for the period. This film is enjoyable to watch and, despite having been rated by many jurisdictions for 18+ viewing only, I believe that watching it would make a positive contribution to the history education of most high school children.",
         "Made to cash in on the notoriety of Tinto Brass's 1979 movie 'Caligula', Italian trashmeister Bruno Mattei's 'Caligula and Messalina' is packed to the gills with depravity. Despite lacking the hardcore action and graphic gore to be found in Brass's movie, Mattei's production (available on German DVD in an uncut 108 minute version) is still fairly entertaining stuff. John Turner stars as nutty Roman Emperor Caligula, who commits incest with his sisters, makes his horse a member of the Senate, and executes the innocent on a whim. Messalina (played by gorgeous Betty Roland) is a power-hungry nymphomaniac who will stop at nothing to become Empress of Rome. She brings herself to the attention of Caligula by battling in the gladiator arena and it is not long before she achieves her goal, upsetting the Emperor's youngest sister Agrippina, who hopes that her son Nero will eventually become ruler of Rome. Agrippina successfully plots Caligula's downfall, but Messalina rains on her parade by immediately jumping into the sack with his successor, Claudius. But naughty old Messalina can't commit herself to one man, and shags everyone in sight, including a grotesque, but well-endowed, frequenter of brothels, a randy midget, her eunuch(!?!?) and an ex-lover. When she ends up pregnant, and it is obvious that the father is not Claudius (since he has been away fighting in foreign lands), Agrippina finally sees her opportunity to be rid of her nemesis once and for all. Chock full of graphic sleaze (nudity, simulated sex, Bacchanalian orgies, rape and buggery), this movie is definitely not one for the easily offended. And if none of that bothers you, then the graphic scenes of horses and donkeys getting jiggy will probably do the trick. Surprisingly, in contrast, the violence is pretty low-key, with most of it happening off screen. Mattei, obviously working with a low budget, resorts to padding his movie with footage from other films, particularly for crowd scenes requiring many extras, but to be fair it all works pretty well. 'Caligula and Messalina' is fun slice of schlock entertainment and is worth a viewing for fans of historical exploitation, but those hoping for the polished look and excesses of its more famous predecessor may be disappointed.",
         "Movies is all about messalina how she gets into power by her body.Movie has lots and lots of nudity..It has many disturbing kinds of sex incest between mom and daughter,animal sex,interracial sex,Midget sex,Group sex...But it never shows penetration or male nudity... And actress has played very brilliant portrayal of messalina empress..her mother teaches how to make men fall in our prey and she fights as first female gladiator and she cuts male penis nothing shown explicit,and she goes on by sex and makes everyone to fall If you really looking for medieval sex without violence or gore this is the right movie Go for it.......",
         "I just saw this movie, and I cannot believe how poor it was even for an exploitation film. I am not familiar with the accurate history of the real Caligula but it could not have been anything like in this movie. Of course, that's not necessary in an exploitation film but in this case it is just too stupid. Their seems to have been absolutely no research into the actual life in Rome at that time. Moreover, the sex scenes are really poor. Maybe with one or two erotic moments, and with one or two attractive females. The torture scenes are just terrible and depressing. At least a movie like \"Hostel\" portrays torture in a more interesting fashion - there is something about the early exploitation films that make you want to scream out in boredom at the stupid torture scenes. All things considered, this is a horrible movie which should never have been made. I feel the same about movies about torture in the Holocaust. Movies like that are simply dangerous to the mind, and a complete waste of time and life. It is difficult to prove that movies like that are actually damaging to the mind, and I don't mean it in any moral sense, but we all know that movies like that are absolute trash, and that we would be better off watching something interesting. I bought Caligula because I thought it might be good but it wasn't. I think, the Druuna comic book series is excellent. But this Caligula film doesn't deliver anything other than negative and stupid stuff.",
         "One of the small slew of Roman histories which followed in the wake of Tinto Brass' critically reviled but commercially successful Caligula, Bruno Mattei's Caligula and Messalina doesn't have a great deal to add but what it does have is pretty eye-popping. Unlike Brass' monumental work, Mattei's atrocity has Caligula die about halfway through, continuing the story into the reign of Claudius until he tires of his disgraceful wife Messalina and has her put to the sword. The film is, then, more the story of Messalina than of Caligula, although you wouldn't know it from the set-up, which simply retreads the familiar Caligula story, beginning with some appallingly clunking exposition speeches, the best that can be said about which is that what they expose is then shown on screen, making them not only poor scriptwriting but staggeringly redundant. The story is enlivened by Mattei's trademark use of stock footage, which means that intermixed with the cheap and cheerless original film are crowd scenes, senate scenes and gladiatorial scenes from early 1960s peplum, including Pontius Pilate and Leone's The Colossus of Rhodes. As usual with Mattei, the stock footage stands out like a sore thumb, or in this case is like a perfect hand on which his own sore thumb has been stuck. Not content with chivvying things up in this fashion, Mattei provides us with not one but two scenes of equine congress in quick succession \u0096 the ass's milk for Messalina's bath is helped along by bringing in a long-donged mule to tup the ass, and Caligula's famous senator horse is shown in congress with a mare at the stables,; both scenes include explicit footages of the animal's sexual organs, the latter sequence intercutting footage from Borowczyk's The Beast. Both sequences are about as unnecessary as can be imagined, but they do perk the jaded interest after what has been a fairly dull first 45 minutes. After this, things get better as Caligula is killed and the story is a little bit less familiar. Messalina, now Claudius' Empress, craves nothing more than huge dick, and is serviced by her well-hung eunuch before skipping down the brothel to try the legendarily huge member of an out-of-towner client (played by the ugliest man to ever hit the screen, Salvatore Baccaro from The Beast in Heat). There's an amusing episode where the Empress feeds a lover to the lions, but the film is for the most part pretty flat, poorly acted and unimaginatively directed, so apart from the outré elements, there's little to engage, and most viewers I should think will be pretty relieved when Messalina meets her end, allowing the film to.",
         "If there was a possible scientific way i could travel to the past it would be in the roman times. This is because the life expectancy was trivial and usually 25-30. The women still had big bushes of hair on their vagina and men could walk around being rich doing what they wished watching gladiators fight and being a political snide bastard using words and power to corrupt and felicitate your enemy's while being able to get away with anything because of the lack of government control in the peoples way. I Love USA, But i want to live in 420 B.C ^_^ Also i see this move about Caligula factually correct which means more to me then any of my dreams."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Biography",
         "Drama",
         "History"
      ],
      "productionCompanies": ["Italfrance Films"],
      "summaries": [
         "The seductive Messalina (Betty Roland) will stop at nothing to become the most powerful woman in Rome. Gaining the attention of the Emperor Caligula (Gino Turini), she soon finds herself at loggerheads with Agrippina (Francoise Blanchard) who has successfully plotted Caligula's downfall and is maneuvering her son Nero to become next Emperor of Rome. However Messalina is one step ahead and jumps into bed with Claudius (Vladimir Brajovic). But when Messalina becomes pregnant and it's clear that Claudius isn't the father, Agrippina seizes this as her opportunity to finally see Messalina treated as a mere slut of Rome.",
         "Messalina is a power-hungry nymphomaniac who will stop at nothing to become Empress of Rome. She brings herself to the attention of Caligula by battling in the gladiator arena and it is not long before she achieves her goal, upsetting the Emperor's youngest sister Agrippina, who hopes that her son Nero will eventually become ruler of Rome."
      ],
      "budget": 0
   },
   "movielensId": 145837,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1981-01-01",
      "dvdReleaseDate": null,
      "directors": ["Bruno Mattei"],
      "runtime": 111,
      "movieId": 145837,
      "title": "Caligula and Messalina",
      "mpaa": "",
      "actors": [
         "Gino Turini",
         "Betty Roland",
         "Vladimir Brajovic",
         "Françoise Blanchard",
         "Raul Cabrera",
         "Vincent Lo Monaco",
         "Fanny Magier",
         "Laurence Lovall",
         "Dominique Irissou",
         "Marie-Noëlle Arnoult",
         "Silvie Dezabauneix",
         "Kathy Sadik",
         "Jean-Pierre Lemaire",
         "Florence Guérin",
         "Nathalie Berreby",
         "Antonio Passalia"
      ],
      "imdbMovieId": "0083710",
      "originalTitle": "Caligula et Messaline",
      "genres": [
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Messalina (played by gorgeous Betty Roland) is a power-hungry nymphomaniac who will stop at nothing to become Empress of Rome. She brings herself to the attention of Caligula by battling in the gladiator arena and it is not long before she achieves her goal, upsetting the Emperor's youngest sister Agrippina, who hopes that her son Nero will eventually become ruler of Rome. Agrippina successfully plots Caligula's downfall, but Messalina rains on her parade by immediately jumping into the sack with his successor, Claudius. But naughty old Messalina can't commit herself to one man, and shags everyone in sight, including a grotesque, but well-endowed, frequenter of brothels, a randy midget, her eunuch(!?!?) and an ex-lover. When she ends up pregnant, and it is obvious that the father is not Claudius (since he has been away fighting in foreign lands), Agrippina finally sees her opportunity to be rid of her nemesis once and for all.",
      "tmdbMovieId": 40084,
      "avgRating": 2.25,
      "releaseYear": "1981",
      "numRatings": 6,
      "posterPath": "/gsbOSNNUzLDGMkHDoA8QNMA1BxY.jpg"
   }
}