{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "possession",
            "id": 9712
         }
      ],
      "imdb_id": "tt0080362",
      "video": false,
      "title": "The Other Hell",
      "recommendations": [
         104287,
         29856
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Mother Vincenza",
               "gender": 0,
               "credit_id": "52fe4aabc3a368484e160bb3",
               "name": "Franca Stoppi",
               "profile_path": "/a8dWp9X8UlZ1IKxfqO9zsBM1Vvz.jpg",
               "id": 43235,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Father Valerio",
               "gender": 2,
               "credit_id": "52fe4aabc3a368484e160bb7",
               "name": "Carlo De Mejo",
               "profile_path": "/jOEO4oEBLiteYiuG5PDjoWHgJTa.jpg",
               "id": 101331,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Father Inardo (as Andrew Ray)",
               "gender": 0,
               "credit_id": "52fe4aabc3a368484e160bbb",
               "name": "Andrea Aureli",
               "profile_path": "/rixD8ta8NHNizffika568l1jWFg.jpg",
               "id": 142134,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Sister Rosaria",
               "gender": 1,
               "credit_id": "52fe4aabc3a368484e160bbf",
               "name": "Susan Forget",
               "profile_path": null,
               "id": 1162493,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Boris (as Frank Garfeeld)",
               "gender": 2,
               "credit_id": "5805f158c3a3684d4e0039cd",
               "name": "Franco Garofalo",
               "profile_path": "/hyZdA5DoTIS7BGoDp36rdqjY8DN.jpg",
               "id": 99195,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Sister Assunta",
               "gender": 1,
               "credit_id": "5805f16792514170b700b25a",
               "name": "Paola Montenero",
               "profile_path": null,
               "id": 1162494,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Elisa",
               "gender": 0,
               "credit_id": "5805f147c3a3684ee500403f",
               "name": "Francesca Carmeno",
               "profile_path": null,
               "id": 1696214,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aabc3a368484e160b9d",
               "name": "Bruno Mattei",
               "profile_path": "/4jASte6gc5lPE95cCAxgN55ZtDk.jpg",
               "id": 45672,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aabc3a368484e160ba3",
               "name": "Bruno Mattei",
               "profile_path": "/4jASte6gc5lPE95cCAxgN55ZtDk.jpg",
               "id": 45672,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aabc3a368484e160ba9",
               "name": "Claudio Fragasso",
               "profile_path": "/rnppeu2Jv0xf70MH0keN3dKg4hW.jpg",
               "id": 45577,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aabc3a368484e160baf",
               "name": "Claudio Fragasso",
               "profile_path": "/rnppeu2Jv0xf70MH0keN3dKg4hW.jpg",
               "id": 45577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "556c0c6ac3a3685489005438",
               "name": "Goblin",
               "profile_path": "/41VfYhqiBXw8fSOONqZ3s6XzDgR.jpg",
               "id": 1177363,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.364507,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 124393,
      "vote_count": 6,
      "budget": 0,
      "overview": "A modern priest investigates nuns' claims that the Devil is present in their nunnery.",
      "similar": [
         9552,
         293670,
         11586,
         394830,
         289416,
         184346,
         27770,
         91586,
         561,
         396422,
         259693,
         9946,
         16235,
         109414,
         241258,
         11026,
         334536,
         250546,
         23827,
         1250
      ],
      "original_title": "L'altro inferno",
      "runtime": 88,
      "poster_path": "/k2BlvLCeI0mzs4KP10Ehm8oUNzg.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinemec Produzione",
         "id": 12724,
         "origin_country": ""
      }],
      "release_date": "1981-01-22",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Say Your Prayers",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruno Mattei"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Bruno Mattei",
         "Claudio Fragasso"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0080362/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMmZjMTVjMzEtODNiYy00YWMzLWExNDgtMzJjZTUxYjMzNDc4L2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Franca Stoppi",
         "Carlo De Mejo",
         "Francesca Carmeno"
      ],
      "reviews": [
         "This Italian nunsploitation epic has been referred to be a plethora of adjectives, including sleazy, low-grade, and stupid. Perhaps these descriptions fit, but there is definitely some fun to be had for the initiated. Weird, seemingly supernatural events plague a convent, and priest Carlo De Mejo tries to figure it all out. The perverse proceedings start off interestingly, with a nutty nun carving out the uterus of one of her sisters, ranting maniacally about how \"the genitals are the doorway to EVIL!\" (The first, but thankfully not last, instance of hilarious \"shock\" dialogue.) This is a Big Moment; the movie contains a number of Big Moments strung together by indifferent, uneventful stretches in which people argue, a creepy gardener lurks about, etc. Often possessing little regard for style or visual creativity, the film ping-pongs between effectiveness and boredom; the high points are memorably bizarre and demented, while the lows will make you seriously consider a nap. The makeup effects range from good (a nun breaking out with stigmata) to atrocious (burn scars resembling plastic vomit). The photography is overly dark and burdened even further with bad color (everything is given a sickly yellow cast, as if they forgot to clean the camera lens). De Mejo isn't very interesting, but Franca Stoppi is marvelously over the top as bitchy Mother Vincenzia. Along the course of the story, elements from a number of more successful films--Carrie, The Exorcist, Rosemary's Baby, Suspiria--are lifted and tossed into the cauldron. On the subject of Suspiria, the one truly high-quality aspect of The Other Hell is Goblin's pounding electronic score. Indeed, this movie is not going to win any prizes, but trashfiends will probably get a kick out of it despite the flaws. If you find naughty nun sinema to be your garbage of choice, this may be the dumpster for you.",
         "(aka: THE OTHER HELL) Nowhere near as good as Gianfranco Mingozzi's FLAVIA THE HERETEC (1974) or Mariano Baino's DARK WATERS (1994), this one ranks at the bottom of the barrel as far as 'nuns from hell' films is concerned. Even director Bruno Mattei in the DVD extra admits as much. We start with a nun who is embalming a dead nun, suddenly going berserk and cutting out the dead nun's uterus. She then stabs to death another nun who is assisting her with the embalming. A little later, she starts to bleed from her hands, mouth and feet as if she is being crucified. She basically winds up bleeding to death on her bed. It's a couple of so-so scenes. Believe me, this whole thing sounds more dramatic than it really looks. A priest is called in to investigate this and suddenly his bible catches fire. Then a younger priest (Carlo DeMejo) is called in to assist the older priest in his investigation. As the older priest is alone in his study tending his fireplace with a poker, he suddenly catches on fire and burns to death. The devil takes the form of a distorted mask with red-glowing eyes (looks cheap) or a faceless nun who looks like she has white linen pulled over her face. What the distinction is between the two, is never explained. Then the mother superior, who earlier in life had an aborted baby by the devil(?) stabs the younger priest. Just as she's ready to finish him off, the devil now appears as a young girl with the lower half of her face horribly burned. The Mother superior stabs the young girl from behind, but then suddenly, the corpse of the gardener (who was killed earlier by the dogs) chokes her to death. There's even more to it than that but I'm not gonna bother... You'll have to find it out for yourself. If this whole thing sounds pretty messed up, it is. This convoluted mess looks like it was done on the fly very quickly with little coherence to the script. Plus the Goblin soundtrack sounds ridiculous and out of place for a convent setting. Why not use an old recording of a Gothic choir instead? The Shriek DVD has an interview with director Mattei where he explains that the film flopped in Italy (not surprising) and that the ex-convent where it was filed at is now home to the Italian secret service. (laughs). It was shot in 16mm, blown up to 35mm but the widescreen transfer looks OK. Still, I really think this whole thing should have stayed in the can where it belonged. It's pretty sloppy. 3 out of 10",
         "THE OTHER HELL (1980) *** Franca Stoppi, Carlo De Mejo. In this Bruno Mattei film, a young priest (De Mejo), is sent to a convent to investigate a series of bizarre and brutal murders. The nuns think Satan is to blame; the priest thinks the murders are the work of a psychopath. The truth turns out to be something in between. Stylish direction by Mattei, a stunning performance by Stoppi (who was even more brilliant in Joe D'Amato's Beyond the Darkness), and a pulse-pounding score by Goblin combine to make this a solid offering. Recommended.",
         "A priest is sent to investigate an outbreak of apparent demonic possession at convent.There is certainly something dark and sinister at work there,but is it really Satan or maybe has it something to do with the Mother Superior's gloomy secrets?\"The Other Hell\" by Bruno Mattei is an atypical Italian nunsploitation flick.There is absolutely no sex or nudity,still there is a little bit of gore.The film offers some rather tasteless moments like genital mutilation or blood-vomiting nuns.The acting is terrible and the dialogue is stupid,but the film is fast-paced and surprisingly entertaining.So if you like Italian horror films give this one a look.My rating:7 out of 10 and that's being very generous.",
         "THE OTHER HELL is a mess of a nunsploit/horror film that starts off strong and then fizzles out throughout the rest of the run-time. Seemingly pieced together from ideas gathered from BUIO OMEGA, SUSPIRIA, and ROSEMARY'S BABY - but never really comes close to matching any of those films. The plot focuses around a nunnery where mysterious murders are taking place. A young priest is brought in to investigate the assertions that it is the work of the Devil. The priest believes that the murders are not supernaturally related and intends to prove his theory... THE OTHER HELL started off VERY strong with a really cool opening scene that I was hoping would set the tone for the rest of the film. Unfortunately, it didn't. The film quickly became dull and derivative, with some scenes appearing to be almost directly lifted from other films. The strong Goblin soundtrack itself was ripped straight from BUIO OMEGA as is the lead actress. THE OTHER HELL had a good bit of potential but just never acted on it. I'd still recommend a look to Italian horror fans - but don't get your hopes up too high...6.5/10",
         "Well I would start by saying that this is a bizarre movie, but the sub genre of nunsploitation is entirely bizarre, so that doesn't help you any further. Fact is, however, that Bruno Mattei's \"The Other Hell\" starts being strange from the very first minute, as a nun randomly dwells through the grisly catacombs of her convent and meets up with a second nun who's in the middle of mutilating a third (and dead) nun's genitalia! We ought to assume that this dead sister was a severe sinner, as the second nun refers to her vagina as \"the doorway to hell\". Oh, and then suddenly a red-eyed monster appears briefly! Apparently, there are more sinister events going on in this particular convent, as the Vatican appointed young priest Valerio to investigate the strange murders there. Are these nuns possessed by the devil himself or has simply one nun gone on a violent killing spree? This is probably Bruno Mattei's best movie (alongside \"Women's Prison Massacre\"), but still not on the same quality-level as other contemporary Italian horror. The script is incredibly incoherent, the acting performances are pretty damn lousy and - as usual - Mattei shamelessly copies cool ideas from other movies. That bloody dog-attack, for instance, is obviously inspired by Dario Argento's \"Suspiria\". Nonetheless, there are a handful of exciting gore-sequences, some twisted dialogues and a remotely suspenseful climax. Luckily Mattei could also rely on another dazzling electrical score by Goblin and some genuinely uncanny set pieces. The prototype nunsploitation-movie (like Joe D'Amato and Jess Franco make them) usually contains a lot of sleaze, brutal whippings and lesbian sex, but (sadly?) you won't find any of that in \"The Other Hell\". This is an overall entertaining exploitation flick, yet only avid cult-collectors should spend money on the fancy Shriek Show DVD edition. If you like the concept of convent-horror without all the unnecessary sleaze and nudity, I also highly recommend Mariano's Baino's \"Dark Waters\".",
         "A priest is sent to a convent to investigate the sheer lunacy of a bunch of nun's gone nuts performing acts of lust and depravity. But the closer he looks into the situation the more supernatural it becomes. Does the devil roam the halls terrorizing the nuns or is it something a bit more sinister. I'll get Mattei credit; he tries to inject a little something more in your average, ordinary (nunsploitation storyline (if there is such a thing). It's not entirely successful in that regard but never-the-less he manages to pull off this entertaining but a little slow and the bit of a Stephen King twist to the ending helps it out.",
         "A Nun named Sister Christina becomes lost in the skull and bone strewn catacombs under her Convent. Eventually she finds Sister Assunta who is currently embalming a dead Nun in what looks like a cross between a dungeon and Victorian laboratory with lots of bubbling test tubes and strange looking scientific equipment, hey this is Bruno Mattei and that's all you need to know! After some insane rambling about \"the genitals are the doorway to evil!\" Assunta mutilates the dead Nun's vagina, kills Sister Christina and dies herself soon after. Father Inardo (Andrea Aureli as Andrew Ray) tries to question the other Nun's in the convent but all his attempts are meet with silence apart from Sister Rosaria (Paolo Montenero) who tries to talk with Father Inardo and warn him, but starts to cough up blood and is taken away to be treated. Later that night, as Father Inardo performs an exorcism to rid the convent of evil, Sister Rosaria develops the stigmata (wounds on the feet and hands that resembles Christ's) and dies. Father Inardo reports back to the Bishop (Tom Felleghy) and says he feels the convent is rife with evil satanic forces. The Bishop thinks Father Inardo's conclusions are about as useful as a used tea bag so he appoints a 'special investigator' called Father Valerio (Carlo De Mejo) to take over and complete the rest of Father Inardo's work. Father Valerio thinks that the Nun's deaths are committed by someone who has a secret and will kill to hide it, and not by Satan. He begins to question the Nun's but finds them very hostile towards him which he thinks is because of Mother Superior Vincenza (Franca Stoppi) who is very dictatorial. Soon Father Inardo has an 'accident' and is killed. Father Valerio decides to take drastic action to solve the mystery, which after some detective work he does. The convents shocking truth is revealed but will Father Valerio live long enough to tell anyone about it? Better known to English speaking audiences as The Other Hell this Italian production was co-written and directed by the notorious Bruno Mattei under the pseudonym Stefan Oblowsky. I personally thought that this film is more competent than most of Mattei's output that I've seen, but that isn't saying much. The script by Mattei again as Oblowsky and Claudio Fragasso is a bit of a mess and it's all rather stupid, we even get a zombie Nun at the end. And the way Valerio discovers the truth is totally ridiculous, a spirit possesses his projector and shows him the truth like it was a film! You have to see it to believe it. The revelation at the end is OK and ended things quite nicely, just don't think about it too much. There's surprisingly no nudity apart from a naked dead body and not much gore, someone is attacked by dogs and their throat is bitten out and a burnt corpse is about as nasty as it gets. There is also a sequence of the grounds-keeper Boris (Franco Garofalo as Frank Garfeeld) chopping the head off a live chicken with an axe, so animal lovers beware! The special effect that depicts Satan is poor, it has glowing red eyes that are obviously just lights that flash on and off. The exploitation elements we expect from a film such as this are sadly lacking. The acting is OK for this type of thing but they aren't helped but the predictably poor dubbing. My favourite part was the attic full of large dolls and mannequin's hanging from the ceiling which looked quite creepy and different, but why would a convent have an attic full of dolls and mannequin's hanging from the ceiling? Like many things in this film it's never explained. I also liked the catacomb scenes too, the walls are strewn with skulls and bones but again why this is part of a Nun's convent I don't know. The general atmosphere is pretty good as is the production design and photography by Giuseppe Bernardini is professional enough. The music mostly by Goblin appears to have been stolen from another film, which doesn't surprise me as it's not really suited to the on-screen action. It's OK overall but it isn't anything particularly special, just about worth watching if you like this type of Euro/exploitation film.",
         "Mad, seemingly possessed nuns are butchering other nuns in a convent, leading to a wave of panic and hysteria. Seeking some help, Father Inardo (Andrea Aureli) is called in to try to cleanse the convent and rid it of demonic forces, but his efforts prove futile and he is engulfed in flames before he can complete his task. Feeling drastic measures are needed, an unorthodox young priest/investigator named Father Valerio (Carlo De Mejo) is drafted to get to the bottom of things. A self proclaimed \"ecclesiastic detective,\" Fr. Valerio begins investigating the murders, scouring the convent for clues and going through the nun's personal belongings looking for some reasoning behind the senseless slayings. Initially doubtful that demons are actually involved, he senses something is a little off with stern, overprotective Mother Superior, Sister Vicenza (Franca Stoppi), who tries to keep her fellow sisters from talking, seems to be hiding something and refuses to let anyone get near the attic. Is it indeed a case of possession or are the nuns just finding therapeutic new ways to deal with their repression? Even though it drags from time to time, L'ALTRO INFERNO still has many things going for it. First off, the performances are actually pretty good. Stoppi, who has a very expressive, somewhat sinister looking face, gives the standout performance as the secretive head nun. De Mejo is also tolerable as the hero and all of the smaller roles seem to be done with some skill. Secondly, there's some imaginative set design inside the convent. One corridor is lined with hundreds of skulls, leading up to a secret alchemist's lab (?!) complete with a fiery cauldron, bubbling test tubes, beakers and coffins. Upstairs is another strange Bava-esquire room full of cobwebs and angelic-looking mannequins hanging from the ceiling. Another memorable thing about this one are some truly tasteless touches, notably when a crazed nun cuts the vagina (!) out of a corpse and a flashback sequence where a newborn baby is tossed in a pot of boiling water. The movie seems a little overloaded when it comes to the plot, incorporating most of the religion-themed horror bases; possession, stigmata, voodoo, the birth of the antiChrist... Surprisingly, there's almost no nudity. The score by Goblin I believe is mostly lifted from BUIO OMEGA (BEYOND THE DARKNESS).",
         "In the oppressive rooms of a run down convent, nuns are starting to be murdered in gruesome fashion. A progressive-thinking young priest, Father Valerio (Carlo De Mejo, \"The House by the Cemetery\"), is called in to investigate the matter, and he's often incensed by what he sees. He ends up butting heads with the forbidding nun in charge, Mother Vincenza (Franca Stoppi, \"Beyond the Darkness\"). \"The Other Hell\" is a decent combination of Italian \"Nunsploitation\" and horror, but it is admittedly not that eventful, as others have pointed out. This viewer could see how some people would be bored, but he found it basically agreeable, if not as out-and-out trashy as it could have been. It does have some effectively grim and gritty atmosphere, as well as some scenes of gore. Assorted viewers may well bemoan the dearth of female nudity. The blasphemy on display, courtesy co- writers / co-directors Bruno Mattei (\"Rats: Night of Terror\") and Claudio Fragasso (\"Troll 2\"), is good for some entertainment. The music is liberally \"borrowed\" from top Italian rock band Goblin, and it does help to keep things watchable. The performances are quite theatrical, which does suit the material. De Mejo and Stoppi are amusing adversaries. Franco Garofalo (\"Hell of the Living Dead\") is a highlight as he mugs his way through the role of Boris the groundskeeper. Andrea Aureli is good as a priest who also attempts to lend some assistance. \"The Other Hell\" is not a must-see, but newcomers to this variety of trash may still want to give it a look. Six out of 10.",
         "Nunxploitation is often called the bottom of the barrel of exploitation genres because they're the cheapest to make and the most devoid of imagination and entertainment. Rent some nun costumes, use a church as your set, use classical public domain music, have some orgies of both blood and sex, cut print done in one take. The first thing to know about nunxploitation is that they ALL follow the same theme. The secret lives of nuns reveal that nuns aren't really nuns, or even Christians, they're really Satanists. They're also all lesbians, rapists, and murderesses. Yup, ALL of them in EVERY movie! Hence their lives aren't really secret since we all know what's coming. That's pretty much what 'The Other Hell' is. It offers nothing new as far as nunxploitation other than being directed by Bruno Matti. Let me guess, he's going to title the film 'Terminator 2' and claim it was based on a Peter Benchley novel. The plot: set in... whenever, it's never explained. Present day? The Spanish Inquisition? We never know. It opens with a young nun discovering that one of her sisters (not literally) has murdered their sister (not literally) because she became pregnant. The crazed killer nun has ripped the woman open starting with her vagina which she says is the \"gateway to the devil.\" The most amusing element of the opening scene is the vast array of boiling chemistry beakers. Seriously! Dr. Frankenstein never had a chemistry set this elaborate. So is this a lab, has the killer nun been doing unholy chemistry? Never explained! It's clearly just more nightmare fuel to add to the set to make it look scary. The satanic imagery is understandable as the character is a Satanist but why the elaborate chemistry set? All she's missing is the Tesla coils. So anyway, after confessing to her crime she kills the young nun as well. The convent conspires to lie to the investigating priests that the deaths were accidents. Accidents? She's cut in half! This reminds me of the scene in 'End of Days' when a character is crucified and it's ruled a suicide! Even if someone did try and kill themselves via crucifixion it wouldn't work! They'd run out of hands! The killer nun is ruled to be possessed by Satan and must undergo an exorcism while a younger priest disagrees arguing the woman is just mentally ill. Either way, shouldn't she be in a padded room somewhere? Not remaining in the convent? Basically Bruno Matti spends the entire film throwing as much nightmare fuel on the set as possible without explanation. Bedrooms have life size dolls hanging from the ceiling from chains without explanation. Tons of satanic images. There are even pitbulls and Dobermans in cages. All that's missing are the Tesla coils or posters of Chairman Mao to make things scarier. Even the nuns acknowledge their convent is creepy. When a priest tries to bless it they prevent him from fully exploring it. No wonder their sisters are turning homicidal living in a place like this! In conclusion I've never been a fan of nunxploitation and this film only reinforces my feelings. It's a genre built on cheap scares and no imagination. This is one to skip even if you're a fan of nunxploitation. Several reviewers have stated that is isn't bad for a Bruno Matti film. Given the true pain of Matti's other films this is hardly an endorsement.",
         "When I think of Bruno Mattei, great horror films don't usually spring to mind; and The Other Hell does nothing to change that opinion of him. Much like his Video Nasty zombie flick, Hell of the Living Dead, The Other Hell is highly derivative of other, and better, genre films and came along some time after it's genre hit it's 'golden period'. Nunsploitation is most famous for sexually repressed nuns and tons of nudity, but this one adheres more closely to the Anita Ekberg vehicle 'The Killer Nun', as it features a Giallo style plot that puts most of its focus on murder and more or less completely ignores sex and nudity. This definitely does harm the film, and it's made no better by the fact that the mystery presented is hardly fascinating. The film follows a couple of murders in a convent. The Mother Superior believes that the nuns have become possessed by the devil, and a priest is dispatched to try and get to the bottom of the mystery (they'd have been better off with a detective...). Are the nuns really under the power of Satan, or is that what the Mother Superior wants everyone to believe? Not only is Bruno Mattei one of the less talented Italian filmmakers, he also has a rather annoying penchant for ripping off the better ones. The film features a score from Goblin, which the director has ripped off from Joe D'Amato's masterpiece 'Beyond the Darkness' (he also ripped off Goblin scores for Hell of the Living Dead), and he took D'Amato's lead actress from Beyond the Darkness, Franca Stoppi. Some of the sequences in the film are very well shot, however, and although it's obvious that Mattei was taking influence from masters such as Dario Argento and Mario Bava, it's only fair to give credit where credit is due. The cinematography is crisp and clear, although the locations often leave a lot to be desired as unlike other films in the nunsploitation tradition; the convent is pretty bare. The plot gets lost sometimes, and it has to be said that a fair proportion of this movie is rather boring; but it just about comes together at the end, and while the reasons for the murders are obvious all the way through; the ending itself isn't bad. Overall, I would recommend this to die-hard nunsploitation fans, but everyone else can feel free to skip it.",
         "An excellent Bruno Mattei flick! It is a fairly straight-forward account of an evil force plauging a convent. Is it the devil's influence, or something other? A determined preist sets to find out the truth. As is the case with most films that are imported from Italy (or any other country for that matter), the dubbing isn't the greatest, but if you are looking up this film, you should have some experience with this anyways. If you are a fan of \"nunsplotation\" genre, this MAY or MAY NOT be your cup of tea, being that there is no sex in the film at all, which may cause some fans of Mattei's work to scratch their heads. There is, however, lots of suspense, along with gory deaths, much in the Fulci/Agrento vein. Great cinematography and atmosphere, excellent use of location (look at the beginning sequence!), and it doesn't stint on the red stuff either. It ain't Deep Red or The Beyond, but, trust me, it's MUCH better than most of the stuff that is called \"Horror films\" nowadays.",
         "This film has a much higher score here than I would have thought. I did not really enjoy this movie much at all as it comes from Bruno Mattei maker of such fine films as \"Rats: Nights of Terror\" and \"Hell of the Living Dead\". Well not such fine films, but they were much funner to watch than this rather boring and very poorly done nuns with a secret movie. This one was just something both of those films were not and that is rather boring. It is also one of the more disjointed films I have ever seen as once Crow said of a film \"It is economical to not have a story, because then you can just film people doing stuff\", this line could easily apply to this film as well. Most of it is people walking here and there. The story, nuns are getting killed, a priest is sent in and he believes it to all be the work of the devil. Well another priest is sent in as he believes there is a logical reason behind everything. People die occasionally and you see people going up the stairs and down the stairs, man who is a gardener who at first appears mute and is not feeds his dogs. People say random things trying to convince the viewers and probably themselves that there is a plot at work here, but can not fool me. There is gore here and there in the film, but not exactly your usual Italian horror film. You also get the typical Goblin soundtrack which is one of the pluses of this film as I prefer their music to the crap they put in most horror movies these days. Some interesting stuff within this one, but overall out of the nun films I have seen it is the weakest. Not that I have seen all that many, only \"Demonia\" and \"Dark Waters\", both of which are more gory and grisly than this film and have a better flow that makes each have a semblance of a plot going on.",
         "Those looking for the typical sex and nudity expected in a nunsploitation film need to look elsewhere. This one is pure horror, with a genital removal starting the blood-fest. The evil Mother Vincenza (Franca Stoppi) provides the best performance despite the outrageous lines given to her. Father Valerio (Carlo De Mejo) is called in to investigate several murders that are reportedly the work of Satan. One suspects, along with the good father, that there is a psychopath lose in the convent. The answer may lie in the middle of both explanations. Exciting pieces with long periods of nothing in between. For serious fans of Italian horror, it will be a treat, but for others, it may not be so good. Great music throughout.",
         "Another pointless and mostly boring film from Italian schlock director Bruno Mattei. The movie itself is a mess. The plot isn't very coherent and it is often hard to discern exactly what is going on most of the time (or what the whole point of the movie is). It also lacks any real tension or scares throughout most of the movie and just falls into a boring monotony of nonsense. The Goblin soundtrack just sounds very strange and out of place here. Maybe because it isn't really an action film and the setting just isn't right for the synthesized music. The only thing I can say about the movie that isn't at least somewhat negative is that I was entertained by the movie's ending. The acting (albeit very over the top) wasn't the worst I've encountered in an Italian horror film either. Bruno Mattei himself seems to almost disown this film in an interview on my DVD copy so you know that this has got to be pretty bad.",
         "The mysterious deaths of nuns is investigated by the Catholic Church sending a new breed of priest in Father Valerio(Carlo De Mejo), hoping to find a killer in the convent. Valerio believes that the idea of a supernatural evil force lurking in the convent ran by Mother Vincenza(Franca Stoppi)is pure rubbish, instead seeking a demented psychopath amongst them, committing murders. What Valerio doesn't realize is that Vincenza is in league with Satan, having cavorted with the lord of darkness, hiding their female spawn in the attic of the convent. The nuns under Vincenza's watch have been driven to fear, with many of them overcome by demonic possession..any opposing threats, such as the elder Father Inardo(Andrea Aureli)who tries to use the rites of exorcism in cleansing the nunnery of it's evil, are destroyed. Vincenza will do whatever it takes to keep anyone from taking her daughter away. In other words, Valerio has a spiritual and physical battle on his hands. Bruno Mattei mentioned in an interview for the DVD release of \"The Other Hell\" that this flick was remastered from an obscure 16 mm print, having been a flop during it's initial release and abandoned. I guess, even though it's such a bizarre demonic horror nunsploit that often lacks in coherency opting to blindside the viewer with unhinged behavior and gory violence, that we should be somewhat thankful that this film can be seen at all. I can sure say it wasn't boring. Franca Stoppi sure lets it all hang out as the evil Mother Superior, wielding a knife at the end ready to viciously stab anyone that got in her way. There's this witches' den with a burning cauldron, coffins containing murdered nuns, a slab for \"wicked nuns who committed sinful atrocities\" where we actually see one dead corpse get her innards plucked, laboratory tubes and flasks bubbling with liquid, etc. There's this cool tunnel leading to the den containing rows of skulls, kind of a \"cryptic\" form of art. We actually see a possessed nun tormented by blood-oozing stigmatic attack. The priest, Father Inardo is set on fire in his attempts to exorcise the nunnery. We see Franco Garofalo's grounds-keeper/animal wrangler/cook Boris' hand covered in maggots and bitten by a dog..he's later attacked in the throat by an unleashed dog. We see an actual rooster beheaded for later din-din. Vincenza and Satan's spawn lives in a small room where dolls and mannequins hang from the neck. We see a previous Mother Superior actually attempting to boil Vincenza's infant daughter in a pot on a stove(..and for goofy effect, which might have many chuckling with glee, Vincenza's infant, clearly a doll, telepathically murders the Mother Superior). Plenty of audacious moments on display certainly to entertain those craving the twisted delights Mattei and writer Claudio Fragasso churn out in doses. I guess this is probably Mattei's best film..quite an outrageous concoction of surreal and horrific images. I think it, if anything, will entertain those that are not offended by the blasphemous material. The Goblin score, used from Buio Omega, somehow actually works in this film.",
         "A series of brutal murders occur in a convent. Stalwart, no-nonsense priest Father Valerio (well played by Carlo De Mejo) investigates the killings and discovers that the devil himself might be responsible for all the mayhem. Director/co-writer Bruno Mattei does an expert job of creating and sustaining a potently brooding gloom-doom atmosphere. Moreover, Mattei delivers several effectively nasty moments, starting with an incredibly tasteless sequence in which a deranged nun stabs the crotch of a dead woman and subsequently mutilates her vagina (!) before totally flipping out and bumping off a fellow sister. Other grisly highlights are a priest getting turned into a human torch, weird gardener Boris (a memorably creepy Franco Garofalo) having his throat torn out by a German shepherd, and a newborn baby being dunked into a pot of boiling water. This film further benefits from the dusty, cobwebby set design (the basement full of human skulls is especially unnerving), Giuseppe Bernardi's slick, shadowy cinematography, a splendidly severe and sinister performance by Franca Stoppi as the formidable Mother Vincenza, and, best of all, a throbbing, groovy-rockin' score by Goblin. A hugely enjoyable chunk of perfectly offensive celluloid blasphemy.",
         "Other Hell, The (1980) 1/2 (out of 4) Nunsploitation flick from Italy is one of the worst I've seen and it's pretty hard not to make killing nuns entertaining. Hack master Bruno Mattai directed this film about a priest who comes to a convent to investigate some strange deaths to nuns. Is it the work of a serial killer or Satan himself? Who gives a damn, really? This film is incredibly dull and lifeless without a single thing going for it. Mattai seemed to forget that films like this, if they're going to be dull, need some nudity to keep it going but we get none. There's not really any gore or violence outside an opening scene where a nun has her vagina removed because it's the doorway to Hell."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Cinemec Produzione"],
      "summaries": [
         "A priest investagates paranormal activity at a nuns' convent where a deep, dark secret is about to resurface in the guise of murder! Could the devil be behind this, or is that just what Mother Superior wants everyone to believe?",
         "Nuns become possessed by the Devil and lust after the abbot!"
      ],
      "budget": 0
   },
   "movielensId": 145831,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1981-01-22",
      "dvdReleaseDate": null,
      "directors": ["Bruno Mattei"],
      "runtime": 88,
      "movieId": 145831,
      "title": "The Other Hell",
      "mpaa": null,
      "actors": [
         "Franca Stoppi",
         "Carlo De Mejo",
         "Andrea Aureli",
         "Susan Forget",
         "Franco Garofalo",
         "Paola Montenero",
         "Francesca Carmeno"
      ],
      "imdbMovieId": "0080362",
      "originalTitle": "L'altro inferno",
      "genres": [
         "Mystery",
         "Horror"
      ],
      "youtubeTrailerIds": ["Z0Ks29jGxCg"],
      "plotSummary": "A modern priest investigates nuns' claims that the Devil is present in their nunnery.",
      "tmdbMovieId": 124393,
      "avgRating": 2.5,
      "releaseYear": "1981",
      "numRatings": 2,
      "posterPath": "/k2BlvLCeI0mzs4KP10Ehm8oUNzg.jpg"
   }
}