{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "found footage",
         "id": 163053
      }],
      "imdb_id": "tt2881698",
      "video": false,
      "title": "Skinwalker Ranch",
      "recommendations": [
         92395,
         274899,
         258193,
         46221,
         34288,
         174678,
         74008,
         54511,
         158967,
         185460,
         202244,
         201426,
         92398,
         55723,
         47763,
         169865,
         69326,
         49341,
         60086,
         126757
      ],
      "backdrop_path": "/iSz1Qn0bUOk6Vq1LMOxLUVbN7SD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4e489251416c75151483",
               "name": "Steve Berg",
               "profile_path": "/hIJBRInOM37mn24IPXRYay4wPWw.jpg",
               "id": 206311,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ray Reed",
               "gender": 2,
               "credit_id": "52fe4e489251416c7515148b",
               "name": "Kyle Davis",
               "profile_path": "/yQaKWfWQJUSKPv4tCsgvkrtBS2U.jpg",
               "id": 54850,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe4e489251416c75151487",
               "name": "Erin Cahill",
               "profile_path": "/9KvfqPJIJmHTT4PpduxlYOrpF2S.jpg",
               "id": 78044,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Hoyt",
               "gender": 2,
               "credit_id": "557cf15392514104140010fb",
               "name": "Jon Gries",
               "profile_path": "/yNhP4IZCMN10duIYKdHUFt8mJCU.jpg",
               "id": 9629,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Cameron Murphy",
               "gender": 2,
               "credit_id": "52fe4e489251416c7515148f",
               "name": "Devin McGinn",
               "profile_path": null,
               "id": 98389,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Rebecca",
               "gender": 0,
               "credit_id": "52fe4e489251416c7515149f",
               "name": "Taylor Bateman",
               "profile_path": null,
               "id": 1265931,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lissie Miller",
               "gender": 0,
               "credit_id": "52fe4e489251416c751514a3",
               "name": "Carol Call",
               "profile_path": null,
               "id": 1265932,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Interviewee",
               "gender": 0,
               "credit_id": "52fe4e489251416c751514a7",
               "name": "Mike Flynn",
               "profile_path": null,
               "id": 463890,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4e489251416c75151495",
               "name": "Devin McGinn",
               "profile_path": null,
               "id": 98389,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e489251416c7515149b",
               "name": "Adam Ohler",
               "profile_path": null,
               "id": 1264844,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "530f0a90925141733e000756",
               "name": "Devin McGinn",
               "profile_path": null,
               "id": 98389,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "530f0ab2925141739b00075d",
               "name": "Murphy Michaels",
               "profile_path": null,
               "id": 1296982,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "530f0ad1925141733e000759",
               "name": "Tobijah Tyler",
               "profile_path": null,
               "id": 1296983,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "530f0aeb92514173320007d5",
               "name": "Catrine McGregor",
               "profile_path": null,
               "id": 1001746,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "530f0b4592514173550006d8",
               "name": "Michael Black",
               "profile_path": null,
               "id": 1296985,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "530f0b7192514173320007db",
               "name": "Kishmere Carter",
               "profile_path": null,
               "id": 1296986,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.325677,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 224815,
      "vote_count": 53,
      "budget": 0,
      "overview": "In  2010 “Skinwalker Ranch” gained media attention after experiencing a wide range of unexplained phenomena. Reports ranged from UFO sightings to livestock mutilation, but maybe most notable was the disappearance of ranch owner Hoyt Miller’s eight-year-old son Cody on November 11, 2010. Close to a year later, Modern Defense Enterprises has sent a team of experts to document and investigate the mysterious occurrences, which only escalate upon their arrival. Tensions rise as the team must decide how far they will go to unlock the mysteries of “Skinwalker Ranch.” The group debates whether the answers are worth risking their lives for, or if they should just call off the investigation and leave the ranch—that is, if leaving is actually an option…",
      "similar": [
         23827,
         46146,
         41436,
         50698,
         50357,
         72571,
         376453,
         134366,
         38358,
         38410,
         153738,
         7191,
         8329,
         2667,
         17654,
         298312,
         452507,
         256274,
         242606,
         76726
      ],
      "original_title": "Skinwalker Ranch",
      "runtime": 86,
      "poster_path": "/79Wl9SHO2ePyPhhDS3tWeCtYPrG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "DeepStudios",
         "id": 13194,
         "origin_country": ""
      }],
      "release_date": "2013-10-30",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "There is a place The Unexplained calls home",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Devin McGinn",
         "Steve Berg"
      ],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Steve Berg",
         "Ken Bretschneider"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2881698/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjA1OTIyMjU5Nl5BMl5BanBnXkFtZTgwMDc3MTYyMDE@._V1_UY268_CR13,0,182,268_AL_.jpg",
      "actors": [
         "Britani Bateman Underwood",
         "Taylor Bateman",
         "Steve Berg"
      ],
      "reviews": [
         "I sincerely pray to god that this will NOT influence anyone in watching this movie. The only true event this movie is inspired of is the unexplained disappearance of a young kid. Everything else is pure fantasy in a \"Blair Witch Project\" ambiance but much worse: The pseudo-documentary style mixed with cameramen who are not actors playing in the movie just does not work. You get \"Carrie\" style scenes, conspiracy, ghosts, UFO, a werewolf, a zombie-vampire-alien (which should totally have the ability to walk straight considering all the damage he does) but most of all, lots of big bright lights coming from nowhere. It's just way to much unrealistic disconnected stuff happening way too fast so it kills any potential suspense or intrigue by being ridiculous. The worst is that you do not get a hint of a conclusion(unless, like me, you concluded that the alien is possessed by \"Chucky\"). Everybody gets killed, even the dog and ... something is sucking blood from cows which ... when you see it you think \"why not\"!",
         "First, I must say that i'm fan of this \"fake documentary\" genre, and I didn't know what to expect of this film. It starts like a rip off of The Dark Skies movie, but after that, everything goes south. Every minute it becomes more and more naive. It feels like there was no scenario, everything happens chaotically. Evidences are coming one by one and in large quantities, explaining that what is happening, can be just anything. You will try to came up with assumption of what is going on, trough entire movie. And then it ends, leaving you there siting without any question answered. Camera that flicks before something odd is going to happen just spoils everything. The acting is not the good, but it is bearable, and I liked that X-files tribute cameo.",
         "Okay I went into this film with high expectations, from the freaking awesome trailer and poster etc. Then has I starting watching the film, it actually was pretty good for most part, characters was likable, setting up the camera around the house and outside, having guns ready and some creepy stuff going on in the behind like \"The Lost Coast Tapes\" style. Then after 20mins it all went south, with just random paranormal stuff then huge dog like creature, a hidden cave, it only brief connections all this random stuff and it gets more confusing later on, with idea government is watching for one scene then never to seen again, a character gets thrown across the field and actually smart enough to leave, while another character become dicks for no real reason\u0085for tension!? The film is house of cards then just falls down at the end, leave you with no answers and only annoying disappointed. The only positive I can say is that the camera set up was great, C.G.I was very good and I liked the hidden tape within film but saying that it should be used within \"VHS 3\" not this film. 5/10",
         "There seems to be mixed opinions on this film but I have no such troubles. What an absolute dogs dinner. Is it a werewolf film, an alien film, ghost film, who knows. I feel like I lost an hour and half of my life I can't get back. Still no idea what this was about. The random arguments, the random characters and the random paranormal \"beings\", oh and don't forget the tunnel. There's more story and depth in a Kinder Surprise advert. Definitely one to miss. I was expecting something along the lines of Fire in the Sky, I think I need to go and watch it three times in a row and restore my faith before I turn into a alien, werewolf, tunnely, child ghost thingy. I thought the Border Collie gave a sterling performance though!",
         "I'm not really a big fan of Documentary style films, unless of course they are done well and the subject is interesting. Another similarly themed film that I liked was 'LAKE MUNGO' (2008). That one leaned a bit more toward the Paranormal, so it was more spooky. Whereas this one is more of a Sci Fi / Horror film, and has more of a Thriller / Suspense feel to it. I am most definitely NOT a fan of Found Footage films, but this one doesn't quite fall into that category (regardless of what some other clueless numbnuts have said here...) This is a DOCUMENTARY style film, not a Found Footage film... As a Documentary style film covering the activities of an investigative team who are looking into the disappearance of a boy at a ranch, it is fairly decent for the most part. I personally feel that what REALLY makes the film is most definitely the soundtrack; that is by FAR the strongest element of the movie. Very nice use of ambient sound, nighttime sounds, crickets, etc. There always seems to be some kind of ambient sound in the background which adds a great deal to the atmosphere; very similar to how David Lynch does in some of his films, particularly 'ERASERHEAD'. Also, what I like about this film as opposed to others that are similar, is the way the cameras are place around the ranch and the way those shots are nicely worked into the videographer's footage. So, you almost have the feeling of traditional establishment shots around the ranch, which especially at night, are quite effective. So, in other words, you don't have to suffer through shaky, hand-held camera shots throughout the ENTIRE film. The net effect is a bit more cohesive than usual for this type of movie. However... with that said... Unfortunately, what really detracts from the film is the acting. It is not ALWAYS bad; for the most part it is tolerable, considering the Documentary style. BUT... there are a few REALLY atrocious moments, particularly when people are getting upset (isn't that ALWAYS so hard to do...?) where the 'acting', such as it is, is pretty painful and amateurish, to say the least. IF the director(s) had been either a little more talented or experienced, they NEVER would have used the shots that they did in these scenes. They would have definitely gone back and used different takes. But... still... IF you can overlook those few moments, you are left with a pretty suspenseful and tense film that does indeed keep your interest all the way through. Now, one thing I really must add though... without giving anything important away, there ARE some rather imaginative elements that come into the film that may have SOME people rolling their eyes in disbelief. Thus the many blatantly negative Review Summaries here (such as 'Utter, utter, utter, utter, utter crap', etc... :) HOWEVER... IF you are the kind of person who likes a little 'Otherworldliness' in their films, and if you enjoy a nice X-Files-like vibe, then you should find this movie fairly entertaining. I REALLY wanted to give this film a '7', grading it on sort of a curve because it honestly is made quite well compared to a lot of other similar films, but the awful acting in a few places kind of brought it down to a strong '6'... But, there ARE indeed still plenty of good scares and some genuinely creepy moments to be enjoyed here...",
         "What I like most about this movie is that it cares little about movie-making and more about alerting viewers about the danger of chasing alien wolf-hyenas in the dark. It all starts with a statement about time slips that occur every day at 11:11 PM; that's really 23:11 but I think neither 23:11 nor 23:23 are as scary as 11:11. Thank God it all starts when the scientists first arrive at the ranch. Not that it's a first for the enterprise they are working for. But it's for them. So hell starts breaking loose as soon as they arrive with their cameras; hell loves an audience! One lesson I learned from this movie is that VHS tapes from the 60's are prone to electromagnetic interference pretty much like today's digital cameras. And the frames tend to slip too. Maybe that explain the 90's clothing and hairdo on the people filmed on the 60's tape. And, if you find boxes your bosses have buried in a closed barn 50 years previously, without telling you anything about it, stop digging after the second one, because the third is prone to have one of those dreadful 60's VHS tapes with electromagnetic interference and people dressing like it's the 90's. In the end, we all know what really happened in the Skywalker Ranch, and that if it ever happens at our house, all we have to do is to stand in the kitchen at 11:11PM to watch our loved ones running through. Mind the alien wolf-hyenas, though! I lived my entire life waiting to see a movie like this. KUdos to it's director, Ed Wood...",
         "This movie is supposedly inspired by actual events - in the same way that Robin Hood Men in Tights is inspired by the life of Robin of Locksley! In actual fact, it's a turgid piece of dross that plagiarises every bad camcorder-perspective movie out there. It can't decide if it wants to be The Ring, Blair Witch, Cloverfield or Paranormal Activity - it has elements of all, but manages to be so much worse than the sum of its underwhelming parts. MANY SPOILERS INCLUDING THE IMMENSELY YAWNSOME ENDING BELOW!!!! Skinwalker ranch is a real place, steeped with the silly superstitions of many a plains region, but the movie makers have taken the basic idea and thrown literally every stupid cliché possible at it; ghosts, alien abduction, giant monsters, possession, black ops, and more. To make things worse, almost every time anything happens, it's from the security monitor view, which shows interference to show that \"an event\" is occurring, and of course, making it hard to see what is actually happening. All other paranormal events either happen in the dark, or with super fast action so that it's impossible to get your teeth into anything substantive. Random \"clues\" are thrown at you throughout, but as the little boy literally vanishes in a flash of light in the opening scene, the alien connection is established from the start, so the disjointed and utterly arbitrary clues are all but pointless. The basic concept is reminiscent of the infinitely superior Gibson flick Signs, but unlike that movie which reached a satisfying, if nauseatingly treacly Christian conclusion, this one heavy-handedly rushes to a frantic but unsatisfying crescendo, culminating in a Cloverfield-type reveal of an alien space craft without bothering to offer even the vaguest hint of an explanation. It's like the director just shouted \"nasty aliens\" then yawned out of the studio in disinterest. Ignore marais-Alexander's review - this person is a clear plant, and I'm suspicious about erraticchevy's review too. I scare easily, but this was pathetic. Expect to see the current 5.3 score plummet as more genuine viewers dilute the high scores given by the people connected to this movie.",
         "Looking at my ratings for the last 8 years or so, I came to realize that this is the 6th movie that I have rated a 1. Skinwalker Ranch is probably the one film that I could single out that really, really deserves it. More so than Batman & Robin, more so than the remake of The Fog. Even more so than Barely Legal Lesbian Vampires. Where do one start to describe the utter, brilliant mess of nothingness that makes Skinwalker Ranch? First of all, the concept of this being a true, eerie place really is unsettling. After watching this, I couldn't care less about the whole place though. People often take a dislike to the lost- footage genre in general, but I don't really have any problems with that. I loved movies like Chronicle and Europa Report. But then again, movies like this really gives the genre a bad name, if not filmmaking in general. Using half-ways familiar actors like Michael Horse (Twin Peaks) really destroys much of that docu-aspect from the very beginning. The whole movie is a mishmash of a wide variety of paranormal concepts, that all has in common that they end nowhere. There are unbelievable amounts of easy scares, absurdly plastic-felt acting/directing throughout the entire movie, and the most horrifying aspect of the entire movie is the laughably bad script. I easily find forgiving aspects in the most hated of productions, and I just as easily get jumpy, even from the most ridiculous horrors. But this gave me absolutely nothing but series of yawns, some laughs at the stupidest/most \"scary\" scenes, and a great deal of sighs. Not even \"so bad that it is good\" like Trolls 2. Just stay miles and miles away from this garbage.",
         "if you are reading this now, you probably read these often. i feel that's an indicator of a person with a high interest in watching movies and appreciating them in general more than others. this leads me to point out that you may by iffy about what goes on in Skinwalker Ranch because the description sounds like a million movies you've seen before. especially with common(aka: lazy) buzzwords such as: \"scientific research, supernatural phenomena, disappearance of, Inspired by true events...\" throw in the generic 'found footage' motif, and you have a carbon copy of another unoriginal bubblegum flick. but there's something about these types of films that keep you coming back. because you KNOW they have potential to be a great movie. maybe you saw a movie with similar buzzwords ten years ago that totally ignited your interest for this type of thing. since then you've endured countless disappointing movies hoping to just find that one that will make your hours of disappointments worth it. if that's the case, you are not alone. Skinwalker Ranch is THAT MOVIE you've been waiting for. it is definitely worth your time, and you deserve this rare story you've been wanting for.",
         "Incredibly bad in almost every possible way. If the director had been jumping up and down waving his hands in front of the camera for 84 minutes it would undoubtedly have made more captivating cinema. Try to imagine the worst movie ever, times a 1000 and you are not yet even close to understanding just how horribly shitty this pile of crap is. The recipe for this bucket of vomit is as follows: Copy all the scariest parts of every found footage horror movie made since 2004, then copy all the most annoying parts of every budget-UFO movies made since 2004, throw in a werewolf, an wise old Indian, some \"scary\" kids, and a handful of people who have a dream of becoming actors. Sprinkle with a few tons of hand-held-camera disturbance/glitch effects. Mix it all up, do not worry about plot, coherency or acting skills, as long as you got all the other ingredients. Compared to this garbage Sharknado should be getting Oscars and Palme d'Ors.",
         "I just finished the movie and thought it was excellent. I am a big fan of alien abduction movies and frankly there aren't that many at all. I read some review on here that said it was a rip off of dark skies. Are you kidding? Maybe it seems that way because there are only a handful of these types of movies with alien abduction, Compared to the volume of ghost movies. That's like saying \"The Conjuring is a rip- off of \"Paranormal Activity\". Or saying Dark Skies is a rip off of Signs. Alien abduction films: Signs, The Fourth Kind, Communion, Fire in the sky, Close Encounters. Not a vast selection, I hope I got my point across. Another thing I don't agree with, saying this is \"Amalgam\" (Mixture) of paranormal, stuck in one movie. Yes, it might have more than just aliens. If you knew the accounts of the real \"Skinwalker Ranch\" you would know this is exactly the type of paranormal activity that goes on there, and that's what it is based on. Yes, the \"Skinwalker Ranch\" is a real Place with witnesses of U.F.O.'s, light orbs and yes other furry creatures. That's exactly why the movie was made because of the extraordinary events that have been documented at the ranch. The ranch is basically a breeding ground of paranormal activity. Also to comment on user: Miroslav Kostic's quote as saying \"It feels like there was no scenario, everything happens chaotically.\" To this I say, it's a paranormal documentary style horror story. It's supposed to mimic reality. Of course it's going to be chaotic. That reference is bogus. It's not meant to feel like a story but an event that was captured on film. This isn't \"Harry Potter and the Skinwalker Ranch. It's a \"Found Footage\" Docu-Fiction Horror. I was very surprised by the actors in the film. Usually these low budget movies have bad acting and horrible Computer Graphics. I was surprised with both. The acting was believable and the CGI was very good! I was expecting the syfy channel CGI but this looks as though they didn't lack on funds for the CGI. It makes the film that much more creepy! Loved the movie! It scared the crap out of me in certain scenes. Make sure to pay attention. You might notice something in the background scenes!!! FREAKY. LOL ENJOY GUYS!! I Give It a 6.5",
         "I watched the film and I would say the big problem with the movie is i never get to know the characters so I don't care about them. I don't feel sad when one dies or feel scared because one is in danger. The Found footage movies all seem to have this problem. You don't get to know the characters the only exception to this was maybe Cloverfield. Lacking this key factor the movie ends up being like so many of the found footage movies a series of things jumping out of the dark at you which is not bad if that is what you are looking for. If you thought Blair Witch was scary then you will love this movie it is pretty much the same premise.",
         "NO, the \"actors\" did not play well at all. None of them. Any B-movie still has some guy that has charisma, or a guy that at least remembers his lines. This movie has nobody. Anger, fear, trivial discussions - it all feels like hesitantly chewing on plastic. NO, the script was not good. I know, the place exists and it had some of the occurrences portraited here allegedly going on. To line up all those strange events, and throw in some of your own strange ideas, would take up some skill to be glued together in a coherent story. There was no glue. It felt like parody paranormal youtube movies mashed together. Dialogues? Neah! Just a farmer that \"wants his kid back\" and long, useless selfie monologues. NO, the \"paranormal\" part was not right. It was not suspenseful and classy, it was not blockbuster glitter, and had nothing to do with \"classic\" paranormal encounters. NO, do not watch this movie, unless you want to agree with me, and up this review afterwards. NO, you did not count right. :)",
         "Skinwalker Ranch (2013) Here we go with yet another found footage movie, I seen some very bad ones this year like Unaware and others, I don't even what to mention, however I am clad to say this movie does not fit into the same place. This turns out to be one of better Found footage movies that I have seen in a while. I thought it was really good. I loved the open scenes of the movie as a 10 year old s boy, who seem to disappear in the farm on his Birthday after a blue flash of light and then something else appears is in the same places where the boy was standing. (This scenes it's self was better then the whole movie of Unaware) A scientific research team investigates and documents the supernatural phenomena surrounding the disappearance of a cattle rancher's 10 year old son. Normal this kinds of movies take a while to get going, we get to know people in 5-10 minutes. I did not find this movie boring at all, as it didn't not take for strange thing to happen and there are a lot of strange stuff happens and it's not just one thing. A lot various strange things happen in this movie, the only problem is that, there far too many different things happen, there no real memorable scenes in this movie, not enough time on them, Acting was great from the whole cast, movie flowed really well and I loved it, as I said before the movie dose suffer as it's try to add too much into in short amount off time. Really good and I had fun watching it, also the movie did make me Jump once 7 out of 10",
         "Finally, a found footage flick worth watching. I'll keep this review short and to the point. This film is so much better than any of the other found footage films that have been released recently. It doesn't spend an hour building up to 15 minutes of action, it gets going right of the bat and keeps you on the edge of your seat tile the end. Great acting and CGI considering their budget. The story is interesting as well, they throw in a few twists to keep in interesting. There were a few plot holes but nothing to ruin the film. Really enjoyed this one a lot and would recommend it to any horror fan. The end may be near guys, because we finally have a good found footage film 8/10",
         "The low rating on here for this film is astounding. Then again, this -is- IMDb. Skinwalker Ranch is a great independent found-footage film. One of the best I've ever seen, actually. The acting was phenomenal, the characters believable, the story was interesting, lots of suspense and freakiness, and the special effects were pretty great too. Unlike some people, I don't mind found-footage elements and effects, as long as they're done right. This is just another very underrated film. I hope it - and the ranch itself - gain more attention.",
         "I was very pleasantly surprised by this film. If you are after supernatural or UFO phenomenon this film is for you. Plot is very good, acting is almost very good, visual effects are excellent! With lower budget this turned to be a very good film. I wish they could somehow explain to us what really happened and what is fiction, but in a film like this is really difficult. What is it with this ranch now? Is it still there, is someone still living there or is it abandoned? Are those UFO*s finally come and present themselves to us. We would love to know what is it they want.",
         "Being someone who was in a wilderness program in the Uinta mountains of Utah, a film based on true events set in this area isn't comforting. Nor is it comforting that I myself saw something on my last day there I couldn't explain. But getting back to the film - wow! What a trip! Devin whatever his name is is really good as an actor, and I was surprised to learn he was the creative force behind it as well. The special effects are chilling and truly, simply put, indiscernible from the actual footage. You feel as if you are witnessing something real - and something terrifying beyond all reasoning. Granted, the film has a few laughs. No horror film is perfect - but this one really hits the mark. The ending, and I'm not going to spoil it, has probably the most terrifying alien abduction scene in recent years. While the FX when it appears is grandiose, a lot is left to your imagination. No one here is a known, established actor which helps because anyone known would have spoiled the realism. No cheap scares or overkill on gore, just terrifying images. Definitely will make you go to sleep with the lights on at night! 10/10 - this is old school horror in the vein of Fire In The Sky, Alien, and Close Encounters of the Third Kind...minus the friendly aliens.",
         "What the heck was this? Okay people just admit that there won't be another Close Encounters With the Third Kind. Like Europa Report, this movie promises to give us chills but except that we only got boredom. The formula is quite basic. Mean that there was a nasty thing around here and there, set all your high tech equipment all around place and after that open the gates of tension. I don't think so. I'm really embarrassed to mention this one here but it's like 10k of the same movie, over and over again and they still got this scene: All powerful, all mysterious, all strong and maybe omnipotent compared to us aliens, can -literally- twist a huge pick cup like a beer can but can't handle a wooden door. please stop doing this s h i t. so like Europa Report - i got bored twice as this one bored me while watching it - there is a reward waiting for you if you are stubborn enough to reach the end: a cripple alien for 10 seconds. beware!",
         "This film has absolutely no right what so ever to be sold in stores all over the UK. Perhaps the biggest let down I have ever witnessed. Having watched many horror films in my life I would put this at the bottom of the pile. It's plot had potential to grow into a great film and yet it couldn't be anything further from it. It's plot makes minimal sense, it opens up many avenues to explore and yet doesn't tie up any of them up and so anyone who has watched this is left thinking 'what happened to him' or 'how did that happen'. One example being, why and what was the significance of the car that persistently drove up and down the driveway. Another, why was there a werewolf? What happened to sam? Why was the woman targeted? Where did the dad go? Who was the girl that was on the video tape? I have not been given enough words to express how **** this film is. It's ending makes no sense, frankly along with the rest of the film. Don't WATCH THIS FILM! Shambles from start to finish.",
         "I've seen quite a lot of movies that revolve around found footage, and this one is at least considered a good one. There is a plot, the actors act very well and the special effects are great to my taste. Of course, considering i gave a 7 and not a 10, there are some flaws in this movie. There is not really any background to these characters, and at some point there is to much of everything thrown into the mix. I didn't really get it anymore at the end. And the ending could have been made a lot better. That said, there are ups and downs with this movie, but i liked it a lot anyway.",
         "Let me begin by saying that I love horror movies, even the cheap ones. I seriously admire low budget films as long as their ambitious and well written. This film on the other hand is none of that. The screenwriters had no clear sense of direction for this film. Its painfully obvious that whatever direction they initially had became tangled with too many ideas from other successful films similar to its genre. This film is basically a hodgepodge of the found footage genre mixed with aliens and the supernatural. Imagine trying to mix Paranormal Activity, the Blair Witch Project, and Signs to form a coherent narrative but failing in every aspect. The characters in this film were poorly written and completely one dimensional. You feel nothing for these characters when trouble started to brew. The suspenseful monuments were weak and the ending was extremely unsatisfying. Let me stress EXTREMELY UNSATISFYING. I truly feel as though I've wasted my life watching this movie. I would really love to know the story behind this film. How could a director mess up a found footage flick this bad. Please do yourself the favor and avoid this film like the plague.",
         "After a child disappears from an isolated ranch, a group of paranormal investigators show up with cameras, motion detectors, etc. The film seemed to lack direction as we discover: 1) The land has an ancient curse 2)There is an apparition 3) Lights appear from nowhere. Aliens are suspected. 4) There is a 500 pound warg running around at night. 5) Bats commit suicide on the ranch roof 6) And oh Yes, they discover an old government tape. This is a low budget film put together by a small group of experienced people who did all aspects of the film. The bulk of the film was done well, considering how bad this genre has gone. There is a suicide in one scene where a person shoots themselves in the head. The blood splatter appears behind him slightly ahead of the gun fire. The end suffers from the same question in other films, who is holding the camera while the guy is being chased by \"space ghost\" or whatever that was. Character dialogue could have been better. Worth a rental for hand held horror fans for those who would like to see aliens mixed with LOTR animals. Parental Guide: F-bomb. No sex or nudity.",
         "Out of all the lost footage movies, where the vast majority of them sucks, this Isn't half bad. The movie have a good start, a fair mix between creepy atmosphere and jump scares to keep you interested. It also had plenty of stuff that is open to interpretation. There aren't that many decent UFO movies out there, but this one deserves a watch if you are hungry for creepy aliens related movies. If you are looking for a more down to earth sci-fi, then this wont cut it. Its simply not that genre. I gave the movie 5/10 only because well, its lost footage, and that stuff is overdone. It it were shot with a mix of surveillance cameras and regular footage, it would have gotten a higher score. But still, an average movie that might get the hair on your neck to stand.",
         "Man I couldn't even watch half of this the first time, I had to look away from the screen. I could feel the the shocker moments coming, and it was way too intense. Looking through the night cameras was too much, I was just waiting for the scary alien face to show up. Lol. Plus, there is like a bear type creature, a kid ghost running around, and light orbs, this is totally insane bro. This is one of the scariest movies I've ever seen. Plus, the crew keeps chasing after the monsters, they find a cave that the bear creature was crawling into, so of course they have to get ropes and jump in hahahahah. There's just too much horror for a single sitting...my advice is if you watch it...don't do it alone or in the dark in the basement."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": ["DeepStudios"],
      "summaries": ["A scientific research team investigates and documents the supernatural phenomena surrounding the disappearance of a cattle ranchers 10 year old son. Inspired by true events that shocked the paranormal community around the world."],
      "budget": 0
   },
   "movielensId": 145960,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-10-30",
      "dvdReleaseDate": null,
      "directors": ["Devin McGinn"],
      "runtime": 86,
      "movieId": 145960,
      "title": "Skinwalker Ranch",
      "mpaa": "R",
      "actors": [
         "Steve Berg",
         "Kyle Davis",
         "Erin Cahill",
         "Jon Gries",
         "Devin McGinn",
         "Taylor Bateman",
         "Carol Call",
         "Mike Flynn"
      ],
      "imdbMovieId": "2881698",
      "originalTitle": "Skinwalker Ranch",
      "genres": [
         "Thriller",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["o-dgQwP-miQ"],
      "plotSummary": "In  2010 “Skinwalker Ranch” gained media attention after experiencing a wide range of unexplained phenomena. Reports ranged from UFO sightings to livestock mutilation, but maybe most notable was the disappearance of ranch owner Hoyt Miller’s eight-year-old son Cody on November 11, 2010. Close to a year later, Modern Defense Enterprises has sent a team of experts to document and investigate the mysterious occurrences, which only escalate upon their arrival. Tensions rise as the team must decide how far they will go to unlock the mysteries of “Skinwalker Ranch.” The group debates whether the answers are worth risking their lives for, or if they should just call off the investigation and leave the ranch—that is, if leaving is actually an option…",
      "tmdbMovieId": 224815,
      "avgRating": 2.14286,
      "releaseYear": "2013",
      "numRatings": 7,
      "posterPath": "/79Wl9SHO2ePyPhhDS3tWeCtYPrG.jpg"
   }
}