{
   "tmdb": {
      "original_language": "ko",
      "keywords": [{
         "name": "south korea",
         "id": 158540
      }],
      "imdb_id": "tt1861982",
      "video": false,
      "title": "Children...",
      "recommendations": [
         134768,
         81242,
         39021,
         73659,
         133601,
         389972,
         230883,
         65337,
         108972,
         82951,
         27516,
         112283,
         18791,
         55758,
         204702,
         31850,
         75006,
         70530,
         32213,
         59450
      ],
      "backdrop_path": "/4lMewkJo6PriiQj5c7HrfIUYnRD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 19,
               "character": "Kang Ji-Seung",
               "gender": 0,
               "credit_id": "52fe4856c3a368484e0f3add",
               "name": "Park Yong-woo",
               "profile_path": "/8QuKL766lbrZJBh5K0uud53zcgj.jpg",
               "id": 17124,
               "order": 0
            },
            {
               "cast_id": 20,
               "character": "Hwang Woo-Hyuk",
               "gender": 2,
               "credit_id": "52fe4856c3a368484e0f3ae1",
               "name": "Ryu Seung-ryong",
               "profile_path": "/A9GPyMsr9JUTAzo9YXkOZSd3lt7.jpg",
               "id": 227638,
               "order": 1
            },
            {
               "cast_id": 22,
               "character": "Jung-Ho's father",
               "gender": 2,
               "credit_id": "52fe4856c3a368484e0f3ae9",
               "name": "Sung Ji-ru",
               "profile_path": "/v0rreLKyJLi7H0Rbss6ONO0x7Tl.jpg",
               "id": 552572,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "Jung-Ho's mother",
               "gender": 1,
               "credit_id": "52fe4856c3a368484e0f3aed",
               "name": "Kim Yeo-jin",
               "profile_path": "/3FwuoCXCZnzWj7JhQVMpcbViecD.jpg",
               "id": 87553,
               "order": 3
            },
            {
               "cast_id": 37,
               "character": "Director Ahn",
               "gender": 2,
               "credit_id": "5820ba5d925141103d00010b",
               "name": "Ju Jin-mo",
               "profile_path": "/t8HjnWInVR8M6uhixdg9dJ7Nz8s.jpg",
               "id": 945428,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "Kim Joo-Hwan",
               "gender": 2,
               "credit_id": "52fe4856c3a368484e0f3af5",
               "name": "Park Byung-eun",
               "profile_path": "/wIHxqfHxH1DSQ4u5hQBYdQne6p1.jpg",
               "id": 564844,
               "order": 5
            },
            {
               "cast_id": 38,
               "character": "Won-Kil's father",
               "gender": 2,
               "credit_id": "5a7cb641c3a3680fa501572c",
               "name": "Kim Gu-taek",
               "profile_path": null,
               "id": 564845,
               "order": 6
            },
            {
               "cast_id": 27,
               "character": "Won-Kil's mother",
               "gender": 1,
               "credit_id": "52fe4856c3a368484e0f3afd",
               "name": "Park Mi-Hyeon",
               "profile_path": "/Zs6mFO5I8j1gC05tlO1SX2Aw7d.jpg",
               "id": 564846,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "Yong-Duk's father",
               "gender": 0,
               "credit_id": "52fe4856c3a368484e0f3b01",
               "name": "Lee Sang-Hee",
               "profile_path": "/vRYq6DfsSSje0UVaWinGEdfW6i7.jpg",
               "id": 564847,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "Yong-Duk's mother",
               "gender": 1,
               "credit_id": "52fe4856c3a368484e0f3b05",
               "name": "Seo Ju-hee",
               "profile_path": "/xvCOVhj3MjZe6mA2ZYfWX9HYXzz.jpg",
               "id": 1192622,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Dong-Pil's father",
               "gender": 2,
               "credit_id": "52fe4856c3a368484e0f3b09",
               "name": "Jo Deok-jae",
               "profile_path": "/xaHZjxAl5I7xHNtgqOfuOs78Cwt.jpg",
               "id": 564848,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "Dong-Pil's mother",
               "gender": 1,
               "credit_id": "52fe4856c3a368484e0f3b0d",
               "name": "Seo Young-hwa",
               "profile_path": "/1qEkibJe1ul1H3BvSogijX97Vqj.jpg",
               "id": 564849,
               "order": 11
            },
            {
               "cast_id": 32,
               "character": "Chul-Woo's father",
               "gender": 0,
               "credit_id": "52fe4856c3a368484e0f3b11",
               "name": "Nam Sang-Baek",
               "profile_path": "/kY6m2REKc9a2KXIOAMyjdbCnZNl.jpg",
               "id": 564850,
               "order": 12
            },
            {
               "cast_id": 35,
               "character": "Park Kyung-Sik",
               "gender": 2,
               "credit_id": "53299a589251413d7c0013c0",
               "name": "Sung Dong-il",
               "profile_path": "/xvWE7MfTuPP1jPv29aHde8wNxBn.jpg",
               "id": 1020859,
               "order": 13
            },
            {
               "cast_id": 36,
               "character": "Professor Cha",
               "gender": 0,
               "credit_id": "55deb4b3c3a3686e8c00156c",
               "name": "Jeon Kuk-hwan",
               "profile_path": "/hIDrEv3wmmYF9zddva0MfxIzaSW.jpg",
               "id": 20264,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4855c3a368484e0f3acd",
               "name": "Lee Kyoo-Man",
               "profile_path": null,
               "id": 145376,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4855c3a368484e0f3ad3",
               "name": "Lee Kyoo-Man",
               "profile_path": null,
               "id": 145376,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4855c3a368484e0f3ad9",
               "name": "Lee Hyeon-Jin",
               "profile_path": null,
               "id": 145377,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4856c3a368484e0f3b1b",
               "name": "Choi Seung-hyun",
               "profile_path": null,
               "id": 37929,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.617844,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 72066,
      "vote_count": 22,
      "budget": 0,
      "overview": "The film is based on a true yet unsolved murder case from the early 1990s that is known among Koreans as the \"disappearance of the frog children.\" In 1991, five elementary school students told their parents that they were going to hang out on a nearby mountain to catch frogs, and then they go missing.",
      "similar": [
         396535,
         59421,
         10253,
         160704,
         388757,
         252067,
         491329,
         72190,
         11423,
         113,
         11658,
         200085,
         437068,
         165213,
         89501,
         2440,
         242452,
         13855,
         1963,
         363579
      ],
      "original_title": "A-i-deul...",
      "runtime": 132,
      "poster_path": "/y8ZFtoUPBObYn1v117SAprYeYov.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [],
      "release_date": "2011-02-17",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.children2011.co.kr/",
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kyu-maan Lee"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Hyeon-jin Lee",
         "Kyu-maan Lee"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt1861982/",
      "coverLink": null,
      "actors": [
         "Yong-woo Park",
         "Seung-ryong Ryu",
         "Dong-il Sung"
      ],
      "reviews": [
         "The movie tells the story of what happened early 1990's in Korea, as 5 elementary school students never returned from their walk to a nearby mountain. Based on true events and dedicated to the family who lost their children, this movie definitely succeeds at its goal. To make people be a witness of what happened 20 years ago and to be part of what emotional horror the family and everyone involved went through and still have to go through. You will stay focused from the start to the end thanks to great directing and acting. Just when you think the movie will wrap up, it will make a sudden twist and turn everything upside down. Korea once again shows how to make a great movie that is based on true events. Although this movie feels a lot like Memories of Murder (that also is based on true events in Korea), it is yet totally different and not as perfect, but still a great watch. A must watch for anyone who enjoys a great crime movie. My score: 9/10",
         "This is a true story about the murder of five children in Daegu region, South Korea. The evolution of the case throughout the movie is what you could expect of korean cinema: the solving of the murder is hugely important, but what matters the most are the characters that surround the case. their families, a TV producer, a cop and a psychology professor(i assume). Obviously they are well developed, they show truthful and devastating emotions, they change their own behaviors and actions during the film. Koreans know very well how to built intense atmospheres, and how to drive their characters inside them. They have density, they sound like real people, we can relate to them very easily. We can almost feel their grief, we can understand how an ambitious producer fallen from grace start as a selfish guy who just wants a good story, evolves into a guy who almost take this personal. We can see truth in the professor's theories, we can cope with the (sometimes questionable) efforts of the families, in order to oblige the police looking for their children. This is a well built movie, which is not a huge breath of fresh air in korean cinema, but it's one of those films who prove that south Korea has one of the best cinemas in the world. you really should check this one out.",
         "I have seen a lot of crime movies. This one with The Chaser and Memories of Murder is the best ever made. Novelty in this suspenseful movie is the treatment of the relations with the media. It's a good idea from director to introduce some questions of ethics. What a pleasure to be drawn into a story by such intelligent writing and outstanding acting. The story is told with impressive direction, plenty of details and realism to hook in most people. There's a real sense of place and time. Can the movie be as beautiful, but at the same time be ugly. Like any dark mystery, the film simply raises questions, and gets the viewer to care about what happened to the kids. Characters of parents, TV producer, professor, children, detectives, wives and many others, each and every one is so well casted it's hard to find anything to criticize. The biggest pro for this feature is that they keep all the characters human by giving them a soft side. Nobody is either extremely good or bad, they just are humans making stupid choices and having to pay the price for it. You have to see it to believe how perfect it is.",
         "I am a big admirer of Korean cinema. It has its distinct style of screenplay, characterization, storytelling and a definitive panache of humor. Movies like Memories of Murder, The Chaser, Mother, Voice of Murderer and Oldboy etc. There are several movies which has the cinematic tenets at its best. Based on the true events, 'Children' depicts a case of 5 missing children in 1991. There begins a series investigations to search the children through many clues and clicks. The revelations are well timed and keep you at the edge of your seat. The screenplay is water-tight which never loses the focus. Characterization is the key feature and it allows the viewers to connect with the characters, every character is so believable that you will feel their agony. The story has many folds and all the serendipitous discoveries are top notch. The direction is perfect, it explores every occurrence immaculately. The desperation of media and incompetency of the police are portrayed flawlessly. Acting is at its peak, every actor has played the part with utmost honesty and tangibility. The emotions, distress and panic of the characters are just believable. A thriller like this is a benchmark for this genre. Recommended",
         "What a movie! What an environment! Acting of every, even the small and limited characters act like lively. It seems I am seeing the real story not the movie. Direction, back-ground score, cinematography are excellent. Yet I am sorry about them whoever are the real victims and their families. Five children, age 8 to 12 like that, disappeared, at once, together. Story 1991, South Korea. I have seen this kind of movie, Memories of Murders, which is almost similar. Memories of Murders is one of my favorites. Children... 2001 is also now my favorites one. This movie will grip you till the last moment. You feel the same as the victims' families. You feel the same as the detectives, as the other people of the movie.",
         "When is the last time you cried after watching a thriller, especially if you talk about Korean thrillers? I can't remember that much. Korean thrillers have their reputations for being extremely violent, gruesome, weird and incredibly natural at the same time. But a thriller without all these? Then watch Children, you'll find the answer. I watched it 2 years back for the first time and now again; and again that empty feelings!! The story is based on the true events of disappearance of five children in year 1991 in South Korea, mystery of which has never been solved. The cinema started right from the disappearance of the children. Then it becomes convoluted and intense as the story progress with some incredibly well direction and superb acting. What'll you do if your kids are missing? That, you'll start believing everyone's words; doesn't matter it's a hoax or not, you just want your kids back at any costs. Throughout the whole movie, you'll feel the pain of the parents and you'll wait eagerly to know what really happened to the children. The storytelling is exceptionally well throughout the whole movie. The acting is equally superb, especially the Psycho professor; but every single person depicted their role incredibly well which looks fairly natural. You'll always feel that you're witnessing an events, not a movie. This one is highly recommended for the Korean thriller lovers, especially if you like other awesome thrillers like Memories of a Murder, The Chaser, Mother, Oldboy etc. There's not so much graphic violence or bloods in this movie like the others have, but that can't prevent you from the thrill. And at the end, you'll definitely feel something in your eyes!!",
         "Another example of fine filmmaking from Korea, Children begins with elementary school boys playing together, like kids everywhere, running and laughing, without a care in the world. The mood changes quickly when they are reported missing, and a search involving thousands of volunteers is undertaken with no results. The parents quit their jobs to look for their sons full time. A television producer who has won a prize for his nature documentary gets into trouble when his boss finds out that he faked some of the scenes in his film, and he is demoted and transferred. He wants to regain his reputation, so he teams up with a college professor to solve the case of the missing boys. They come up with a theory that one boys parents were involved and they get the police to help dig up the fathers property to find the buried bodies. Nothing is found and the TV man and the prof are disgraced. Ten years after the original disappearances, a monsoon and flooding reveals some bones, which after forensic exams, turn out to be the five boys. The police quickly try to rule the cause of death as hypothermia because of embarrassment in not solving the case, but the coroner concludes that they were murdered. The TV producer returns to follow up and becomes tied up with a possible suspect. The ending is somewhat ambiguous and I was left wondering about the real story that the movie is based on. The acting is superb, but at over two hours, Children could have been edited by fifteen minutes, as it is too slowly paced. Even with the small criticisms, it is a shattering drama."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Noori Pictures"],
      "summaries": ["The film is based on a true case from the early 1990s that is known among Koreans as the \"disappearance of the frog children.\" In 1991, five elementary school students told their parents that they were going to hang out on a nearby mountain to catch frogs. They went missing."],
      "budget": 0
   },
   "movielensId": 146056,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2011-02-17",
      "dvdReleaseDate": null,
      "directors": ["Lee Kyoo-Man"],
      "runtime": 132,
      "movieId": 146056,
      "title": "Children...",
      "mpaa": null,
      "actors": [
         "Park Yong-woo",
         "Ryu Seung-ryong",
         "Sung Ji-Ru",
         "Kim Yeo-jin",
         "Ju Jin-mo",
         "Park Byung-eun",
         "Kim Gu-taek",
         "Park Mi-Hyeon",
         "Lee Sang-Hee",
         "Seo Ju-hee",
         "Jo Deok-jae",
         "Seo Young-hwa",
         "Nam Sang-Baek",
         "Sung Dong-il",
         "Jeon Kuk-hwan"
      ],
      "imdbMovieId": "1861982",
      "originalTitle": "A-i-deul...",
      "genres": [
         "Crime",
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": ["vt98R1JLx5g"],
      "plotSummary": "The film is based on a true yet unsolved murder case from the early 1990s that is known among Koreans as the \"disappearance of the frog children.\" In 1991, five elementary school students told their parents that they were going to hang out on a nearby mountain to catch frogs, and then they go missing.",
      "tmdbMovieId": 72066,
      "avgRating": 3.41667,
      "releaseYear": "2011",
      "numRatings": 6,
      "posterPath": "/y8ZFtoUPBObYn1v117SAprYeYov.jpg"
   }
}