{
   "tmdb": {
      "original_language": "mr",
      "keywords": [],
      "imdb_id": "tt1213838",
      "video": false,
      "title": "The Wild Bull",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Swanand Gaddamwar",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000dab",
               "name": "Atul Kulkarni",
               "profile_path": "/7803mIoKGUlew9K8rwkdOmZLVBt.jpg",
               "id": 53676,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Sarapanch's Wife",
               "gender": 1,
               "credit_id": "52fe43f99251416c91000daf",
               "name": "Bharati Achrekar",
               "profile_path": null,
               "id": 587092,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Sarapanch",
               "gender": 2,
               "credit_id": "52fe43f99251416c91000db3",
               "name": "Mohan Agashe",
               "profile_path": "/aHMxu81AlwUOVsg70hXaaQ4D6KB.jpg",
               "id": 150012,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Shivai's Father",
               "gender": 0,
               "credit_id": "52fe43f99251416c91000db7",
               "name": "Dipak Alegaokar",
               "profile_path": null,
               "id": 587093,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f99251416c91000d9b",
               "name": "Umesh Vinayak Kulkarni",
               "profile_path": null,
               "id": 587089,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f99251416c91000da1",
               "name": "Girish Kulkarni",
               "profile_path": "/rHqOxILkbnnrnhkmjRW6BzK1HBL.jpg",
               "id": 587090,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f99251416c91000da7",
               "name": "Umesh Vinayak Kulkarni",
               "profile_path": null,
               "id": 587091,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.221393,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 30065,
      "vote_count": 2,
      "budget": 0,
      "overview": "A Forest officer send in a small village to catch a wild bull. He met different people and with help of them he tries to catch the Bull.",
      "similar": [],
      "original_title": "Valu",
      "runtime": 123,
      "poster_path": "/zcDDJRddBdsEgZ5JzdQGxJMRQPq.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "mr"
      }],
      "production_companies": [],
      "release_date": "2008-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Umesh Vinayak Kulkarni"],
      "runtime": 123,
      "synopsis": "A Forest officer send in a small village to catch a wild bull. He met different people and with help of them he tries to catch the Bull.",
      "writers": [
         "Girish Kulkarni",
         "Umesh Vinayak Kulkarni"
      ],
      "originalLanguage": "Marathi",
      "imdbLink": "http://www.imdb.com/title/tt1213838/",
      "coverLink": null,
      "actors": [
         "Atul Kulkarni",
         "Bharti Achrekar",
         "Mohan Agashe"
      ],
      "reviews": [
         "This is a light hearted film with a simple subject. The treatment and pace of the movie keeps it alive and you're gradually introduced to the bull and stories/rumors about him, making you wonder, if its really dangerous etc. The officer's brother volunteers to shoot a documentary of the entire mission which makes the film esp interesting. A well made film where you start knowing and getting involved with the characters, especially the simple minded villagers. The language has an authentic flavor and so do the actors. Good thing, they didn't use much make up or deliberately colorful clothes. Not an art film and not a big budget movie, but if you like simplistic entertainment, this one's not to be missed. Atul Kulkarni is pleasant to watch and other actors are also nice. The bull has done a good job too. Editing could be better, as sometimes you feel a bit lost; or the story lessens grip at times. But that's critically speaking only. The duration of the film is just right and no songs and dances makes it particularly more realistic and engrossing. Unlike a village theme, there's no strong politics, rivalry, bitterness etc. The sound track is catchy and sounds quite acoustic.The music sounds distinctly local. No loud surrounds, or sound fx etc. Thankyou so so much. The music and visuals, the overall treatment all are well balanced. Is the bull captured? Is the mission easy? Go watch the movie to find out. If you go with an open mind; and if you like easy viewing, you will definitely appreciate the film. It will make you smile and feel good for sure. A sweet film. Looking for similar from the same team. Give us more good cinema.",
         "***Warning:This review may contain spoilers.*** The movie released in 2008 back then i was in college, me and my group of friends just landed at the cinema theater wondering what movie can we grab to kill some time. We never knew what this movie was. The only introduction to me was a big poster outside the theater. Since we had no other choice we opted for \"Valu\". Little did i know that this was going to be one the best decisions we made. The movie was great in its own way. The cinematography was good. Every frame looked beautiful. The locations i suppose sahyadri ranges are all mesmerizing and add to the character of the people. I cannot find one single shot in the movie which felt less scenic. All the characters in the movie are unique and the quirkiness just goes up with the introduction of villagers in the movie. I would like to call the wild bull as the main hero of the story because his presence is what drives the story to its conclusion. By the time the film comes to its probable end we all have our curiosity stretched to our peaks, and sort of start thinking that we are one amongst the villagers(credits to the director). The best part of the movie is the presence of valu (the wild bull). I would especially appreciate the team for this quality of effort. Every shot or scene around the bull is just breathtaking. Kudos to the background music that was used for Valu's scene,it perfectly conveyed the magnificence and fearfulness of the beast. I would especially applaud one scene in a movie where Valu appears at the temple. It's the same spot where the villagers gathered to shoot the documentary. Valu is seen standing at the gates of the temple. The conclusion of the scene which i inferred was every one was given a chance to put forward their woes w.r.t. to the ongoing issue, but what about the one accused. This is why i think the shots with the bull were simply great. The mere close up the beast for about 2 mins conveyed a very powerful message. I would recommend the movie to everyone who can appreciate quality cinema",
         "The movie mainly focuses on the life of the people in a small village in Maharashtra. Every aspect of the movie apparently concerns the fact that there is a wild bull roaming around in the village and everyone feels that the wild bull has messed up their lives. Actually, its just a coincidence that in some cases the bull is present at the place where something bad has happened. Although this point is not made clear in the movie, the director is successful in hiding this fact in one of the scenes. Some parallel stories keep proceeding along with the main story. Every story has its own meaning and has some (direct or indirect) connection with other stories and the main story. Towards the end, three of the stories take part in the climax. At first, these three stories seem to be independent but the director successfully shows the connection between these stories without explicitly telling anything. The interpretation of the movie can be stated in only one phrase : The problem with the bull is metaphor for issues in the lives of villagers. The way of conveying the story is awesome. This is the first Marathi movie in which I have seen such elegant and 'full of art' direction. Screenplay, locations, background score and acting by Atul Kulkarni is also good. In all its one of the nicest piece of art in Marathi film industry."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": [
         "Swanand Gaddamwar a forest officer is appointed by the government to get hold of Valu a wild bull in the small village of Kusavde, \"Valu\", is actually a holy, consecrated bull which is the responsibility of the village. It is allowed to roam free and is the responsibility of the entire village. But lately, Valu becomes very aggressive and is blamed for every single act of chaos and destruction that happens in and around the village, Swanand feels ashamed that he is assigned this task by the government as he was always known to catch wild animals like Tigers and Leopards,Swanand reaches the village with his brother Sameer who wants to shoot a documentary and finds this subject interesting,Jeevan is a asked by Sarpanch to guide Swanand in what ever help he requires to catch Valu ,Jeevan and Swanand become good friends start meeting people and know the full history of Valu.Sarpanch and Abha are two village leaders who prefer to be one above the other and everyone wants to have the credits of catching Valu.",
         "Swanand Gaddamwa comes to a small village Kusavde to get hold of a bull who was once considered holy by the villagers."
      ],
      "budget": 0
   },
   "movielensId": 146096,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-01-01",
      "dvdReleaseDate": null,
      "directors": ["Umesh Vinayak Kulkarni"],
      "runtime": 123,
      "movieId": 146096,
      "title": "The Wild Bull",
      "mpaa": "",
      "actors": [
         "Atul Kulkarni",
         "Bharati Achrekar",
         "Mohan Agashe",
         "Dipak Alegaokar"
      ],
      "imdbMovieId": "1213838",
      "originalTitle": "Valu",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A Forest officer send in a small village to catch a wild bull. He met different people and with help of them he tries to catch the Bull.",
      "tmdbMovieId": 30065,
      "avgRating": 1,
      "releaseYear": "2008",
      "numRatings": 1,
      "posterPath": "/zcDDJRddBdsEgZ5JzdQGxJMRQPq.jpg"
   }
}