{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "murder",
            "id": 9826
         }
      ],
      "imdb_id": "tt0089413",
      "video": false,
      "title": "Khamosh",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [{
         "author": "anshumanoz",
         "id": "517a6f0419c295506232830b",
         "content": "Khamosh (silent) is a murder mystery which tells the story of a film-unit shooting in Pahalgaam (Kashmir). The movie that the film-unit is shooting is titled as Aakhri Khoon (the last murder).\r\n\r\nThe treatment of the murder-based plot is impressive and at place, quite spine-chilling for the viewer. The movie is slow in the beginning but once the first murder takes place, it picks up speed and proves to be thoroughly engrossing for the spectator.\r\n\r\nTechnically, the movie is not superior. The film and the colours used in shooting and developing the shot stuff seem to be of not-so-good quality because the colours have faded in the print available now. Production value is not high. Editing is OK.\r\n\r\nPerformances are good. Almost all the artistes have done well. Seasoned actors like Shabana Aazmi, Amol Palekar, Nasiruddin Shah etc. have rocked the screen with their admirable performances. Supporting ones viz. Soni Raazdaan, Sushma Seth, Ajit Vachchhani, Sadashiv Amrapurkar, Nony Ganguly,Virendra Saxena, Deepak Qazir, Avtar Gill, Sudhir Mishra (who later became film director) etc. are all perfectly fit in their respective roles. I personally liked the performance of Pankaj Kapoor the most.",
         "url": "https://www.themoviedb.org/review/517a6f0419c295506232830b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d409251416c75134faf",
               "name": "Amol Palekar",
               "profile_path": "/p1Esp5Hcy9mIIDSI6vaq2R1efVP.jpg",
               "id": 105650,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d409251416c75134fb3",
               "name": "Naseeruddin Shah",
               "profile_path": "/7jCtyEHl8fvETUyxmzi04AeVZPk.jpg",
               "id": 6497,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d409251416c75134fb7",
               "name": "Shabana Azmi",
               "profile_path": "/vAoYSYP4DFUMv7fZk9u8Bps9by.jpg",
               "id": 85672,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4d409251416c75134fbf",
               "name": "Soni Razdan",
               "profile_path": null,
               "id": 6520,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d409251416c75134fc3",
               "name": "Sushma Seth",
               "profile_path": "/1UqCt8kfYWfkrWNfcWp4nO8XWcz.jpg",
               "id": 35749,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "55dad31a9251417d7c00038f",
               "name": "Pankaj Kapur",
               "profile_path": "/p082jvI2rLjaDJXnVHKJeuezBjh.jpg",
               "id": 87549,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "566d76b99251412dbc00653e",
               "name": "Vidhu Vinod Chopra",
               "profile_path": "/yKzOp1u7rzgLd0q0tL5lvtOGMcT.jpg",
               "id": 99710,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "566d76c0c3a36833b600b143",
               "name": "Vidhu Vinod Chopra",
               "profile_path": "/yKzOp1u7rzgLd0q0tL5lvtOGMcT.jpg",
               "id": 99710,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "566d76cec3a368264700b20a",
               "name": "Vidhu Vinod Chopra",
               "profile_path": "/yKzOp1u7rzgLd0q0tL5lvtOGMcT.jpg",
               "id": 99710,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.085376,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 188719,
      "vote_count": 2,
      "budget": 0,
      "overview": "Khamosh is 1985 Indian thriller directed and produced by Vidhu Vinod Chopra. The film starred Bollywood actors such as Naseerudin Shah, Shabana Azmi, Amol Palekar, Soni Razdan and Pankaj Kapoor. It, however, did not do well at the box office. The film became notable for actors Amol Palekar, Soni Razdan and Shabana Azmi portraying fictional versions of themselves. It is a suspense movie, wherein the murderer is among the group of people living together in a hotel, and the actual murderer is well hidden in the plot until the very end.",
      "similar": [
         357096,
         15069,
         984,
         11423,
         8090,
         74997,
         979,
         948,
         807,
         4771,
         75780,
         281,
         281957,
         395834,
         445954,
         25376,
         21484,
         3134,
         45569,
         10651
      ],
      "original_title": "Khamosh",
      "runtime": 102,
      "poster_path": "/3IcV8Mg3Zusk1em7nvcFF1xbfQ9.jpg",
      "spoken_languages": [
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1985-01-01",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "Classic whodunit",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vidhu Vinod Chopra"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Vidhu Vinod Chopra",
         "Vidhu Vinod Chopra"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0089413/",
      "coverLink": null,
      "actors": [
         "Shabana Azmi",
         "Amol Palekar",
         "Sudhir Mishra"
      ],
      "reviews": [
         "Vidhu Vinod Chopra wrote and directed a great suspenseful mystery worth seeing. The movie moves along well, with great acting. The cinematography was superb, especially during the chase scene. The characters were well developed and this movie had me on the edge of the seat trying to figure out who was behind all the murders. I found this movie happily after watching \"Munnabhai M.B.B.S.\", another great movie based on Chopra's writing. Although this movie is far different, the plot is superb. The shower scenario was a surprise treat. Again, with finding another treat coming out of Bollywood, I am so glad for the internet and this site for allowing me to find and buy movies from other parts of the world. This is one that should definitely be seen by those who love suspense and film noir movies. It is a story worth having been done by Hitchcock, but Chopra did a worthy job of not only penning this plot but bringing it to life for all to see. Don't pass up wonderful movies from other countries. There are gems like this to be found out there.",
         "The plot had potential and could have been made into a better movie, had it been directed properly without apparent loopholes, and absurd scenes. In a way the movie is justified (sort-of)- given that it was made in the 80s and 'reality check' or 'logic' was as absurd concept. What really baffles me is the rating of 7.3. I think it needs to be mentioned someplace that movie is given a rating of 7.3 compared to all other movies of the decade. That would make sense. Overall an average 'whodunit' with a couple of twists,that can be watched one-time. Do not, I repeat, do not go by the rating of the movie. It only raises ones expectations, and one is to be thoroughly disillusioned while watching the movie.",
         "Having heard comments from a few friends and users that this movie is the best thriller from Hindi movies, I was curious to watch it. Other reason was the plethora of star cast which had names like Pankaj Kapoor, Naseeruddin Shah, Shabana Azmi and Amol Palekar. But when I watched, sadly the thriller part was missing. Many of the suspects ham so much and have very clear objectives that you get a feeling that they are not the actual murderers and most likely the one not amongst them is the culprit. Mystery was not that good and I am saying that despite of not watching any other language movie from which this movie could have been inspired. What stands apart and as an appreciation is the performance of the investigating CBI officer by Naseeruddin Shah. Right from his entry the eyes, facial expressions and body language depict that he is not taking this murder just as any CBI officer's routine investigation. The way he tries to investigate the murder is shown very well and seems realistic. No wonder that Sir Naseer is the best actor ever to come from India. Rest of the cast(names I mentioned in my first para) do play their part with full honesty especially Pankaj Kapoor. Direction wise the movie is OK but some elements like the shooting of the rape scene really does not fit in the actual plot. At some places the comedy seems to be forced and puts a dilemma as whether viewers should chuckle or see the tragedy which goes on in a movie shooting. Overall, watch it once and get engrossed at the first time. Need not have a repeat view to enjoy the mystery part.",
         "I opted to put a serious review on this film as I felt it deserved a better review than the casual ones I found in the internet. First of all it is film ahead of its times. In the 1980's making a suspense thriller with such a well knit plot, without any typical Hindi film song & dance and a great climax was a magnum opus by itself. Directed by one of the best Indian Commercial film directors of recent times- Vidhu Vinod Chopra the story is build around a Hindi film shooting scenario. There is inter personal rivalry and tension between the crew members. During shooting of the film, members of the unit gets murdered one after another. Suspicion falls on all and sundry and ultimately the CBI Inspector (Nasiruddin Shah)solves the crime in a superb climax. Amol Palekar & Shabana Azmi does justice to their talents alongswith other cast. Pankaj Kapoor is brilliant in his small role as Kuku. Nasiruddin Shah is brilliant as usual. Overall It is the best suspense thriller ever made in the Hindi Film Industry.",
         "Vidhu Vinod Chopra has created a very Hitchcockian thriller. I liked the idea that the whodunnit story takes place among a films cast and crew as they are shooting on location. Chopra's reference to films like 'The Godfather' and 'Psycho' were quite funny. 'Khamosh' isn't as much a thriller as there's a lot of humour. While a few of it is unintentional, there's also plenty of satire. I especially enjoyed the humour that took place in the shooting scenes. For instance, the sequence where Shabana delivers her dialogue to Amol while lifeless hand keeps bumping on her foot and she's completely unaware of it. Some sequences were out of place and it appears as though Chopra just put them in for the sake of thrills. One such example is the scene where Shabana finds a drenched in blood dead chicken in her bed. It's also very easy to figure out that the lead suspects were not the actual murderers and after some time one can easily figure out who it is. Plot holes are also apparent. For example, why would Shabana go to the houseboat all by herself at night when there's a murderer on the loose? At the same time, it's great to watch such an excellent group of actors work together and I was interested in how the director would choose to conclude the film. Pankaj Kapoor, Naseeruddin Shah, Shabana Azmi and Amol Palekar are first rate. Azmi plays the Hitchcockian heroine with class and poise. Shah does a fine job as the fiery detective determined to solve the case. Palekar is cast against type and he is superb even though he has limited screen time. Soni Razdan does a decent job while the rest of the cast range from average to bad. Overall, 'Khamosh' may not be an out and about thriller it tries to be but it's entertaining nonetheless and I think it even has good repeat value.",
         "I have watched this movie yesterday after reading comments on internet about this movie. Many people on different websites called this movie all time best suspense thriller of Hindi cinema. So I start watching it with lots of expectation and I must say It live up to my expectation to some extend. It has star cast and looks like VVC's first real effort in bollywood. All actors acted well specially Nasiruddin Shah and Shabana Azmi. Really liked Amol Palekar's style of dilevering dialougs in soft and sweet voice and in humble style. Location was perfect for this film. Cold and cloudy atmosphere added some extra effect to theme of this movie. I am sure anyone can enjoy this movie even in 2012. It positively has suspense and trill because I read some comment here that this movie has less suspense and more humor. If you like this movie then must watch \"Death on river Nile (1978 film)\", you will surely like it as well.",
         "The problem with most Bollywood films is tone. \"Khamosh,\" Vidhu Vinod Chopra's daring attempt to adapt the Hollywood whodunit in an Indian setting is, unfortunately, no exception. The lame dialogue and overwhelming hokiness (every character basically shouts his dialogue; they all act stark raving mad!) almost undoes the film's greatest accomplishment: mood. Chopra busts out the noir rulebook: sharp angles, hand-held cinematography, color filters and dark rainy nights are just some of the aesthetic choices on prominent display. It does work lending \"Khamosh\" a gritty feel. Let's now consider the plot which, although done before, is a bit clever. A film crew is shooting a murder mystery in a sleepy town; the story of their film involves the mystery surrounding a murdered woman. The story of our film \"Khamosh\" kicks off when the actress playing the character supposed to be murdered in the movie within this movie (get it?) is actually murdered herself! Since this is supposed to be noir, a shrewd Marlowe-type detective (Naseerudin Shah) quickly arrives on the scene to dig deeper. Shah plays his character with quiet intensity; it's an understated performance, and a welcome change from all the barking dialogue flying about from the other characters. Before the actress' murder, Chopra had immediately set up the suspects by implicating everyone in the crew: every one of them had a beef with the dead girl. (That's Motive multiplied by 1000.) Chopra who wrote and directed \"Khamosh\" keeps the big secret a secret till the very end. No clues are given, making the fun one-sided \u0097 it's irritating when all the doors of logic are slammed shut on the audience's face. As Shah's character connects the dots in his investigation, the film slowly starts to eliminate each suspect until the real killer is finally unmasked. By that time, we're barely interested anymore. \"Khamosh\" is well-made. It's also supposed to be unconventional, by Bollywood standards: there are no songs; it is an ensemble film set in and around one hotel. There are even some successful attempts at satire when Chopra pokes fun at the Indian movie industry \u0097 the film crew in the story comprises a producer who is a depraved money-pinching scrooge while the director is, himself, hardly moral; all he wants is to finish his movie (in one hilarious scene he goads the bald movie villain to really go after the underage actress playing the rape victim, then rolls the camera conveniently forgetting to say CUT!). Plus, almost all the actors in \"Khamosh\" use their real names which amps the glib irony. \"Khamosh\" is a pastiche of Western film-making and genre conventions, and may be that's really the problem. Hitchcock's \"Psycho\" plays prominently on a TV screen in one scene\u0085the film also has clear influences of Lynch's \"Twin Peaks\" and some obvious borrowing of Godard's stylistic graces from \"Alphaville.\" The mere fact that \"Khamosh\" is different from standard Bollywood fare may be enough for staunch supporters of this industry. But for the rest of us, it's all been done (much better) before.",
         "Khamosh being a murder mystery it had a bit too many people in the movie, at least known B-grade actors. Naseeruddin Shah's hype as a good actor fell flat for the umpteenth time in his career. He can be rated as a poor actor, his role could have been played better by Om Puri who looks more strict. Amol Palekar as usual towers among the the other cast of the movie, he delivers sensible dialogues & is an integral part of the storyline. His expressions were of a shaken man is what a movie goer can carry with himself when a person gets fixed in an incident like in the movie. Realistic expressions make an actor worth taking note of and the movie worth watching. Khamosh is a must watch for suspense thriller fans.",
         "Vidhu Vinod Chopra is known today as a respected and high-profile filmmaker who has not only directed movies like Parinda (1989), 1942 - A Love Story (1994), Mission Kashmir (2000), Eklavya (2007) etc. but also made good quality movies giving chance to the other directors for their direction viz. Munnabhai MBBS (2003), Parineeta (2005), Lage Raho Munnabhai (2006), 3 Idiots (2009) etc. Recently I came across a movie directed by him much before his other high profile and better known movies. It's a murder mystery and belong to his initial years in Bollywood when he used to write his name as Vidhu Vinod only (without suffixing his surname - 'Chopra'). This movie is Khamosh (1985). Khamosh (silent) is a murder mystery which tells the story of a film-unit shooting in Pahalgaam (Kashmir). The movie is titled as Aakhri Khoon (the last murder). Amol Palekar who is also a politician (besides being an actor) is the hero, Shabana Aazmi is the heroine, Sadashiv Amrapurkar is the director, Ajit Vachchhani is the producer and several supporting actors alongwith the writers and technicians are also there on the shooting location. They are all staying in a hotel named as Hotel Pahalgaam. There is a fall and a lake nearby alongwith a boat-house. A supporting actress of the movie - Soni Raazdan goes to the boat-house at night to cram her dialogues for the scene which is scheduled to take place the next day. However her dead body is found as hanging from a tree the next morning. Now starts the suspense. A so-called CBI officer - Nasiruddin Shah arrives there and starts interrogating the crew members of the movie as well as examining their hotel rooms and investigating the other relevant things. Soon it is known that he is an imposter. He is actually the brother of the murder-victim and trying to unmask the murderer of his sister. Before the efforts of himself as well as the local cops made in this direction bear any fruit, another murder takes place which is of another character artist - Sushma Seth. Nasiruddin Shah feels that many crew members know something in this regard but they are silent (Khamosh) due to one reason or another. When a waiter of the hotel is first found missing and thereafter his dead body is also found from the flowing water of the fall, the mystery deepens like anything. And then the producer - Ajit Vachchhani and his abnormal younger brother - Pankaj Kapoor also lose their lives. The culprit is finally unmasked in the climax. Khamosh deals with the issue of casting couch prevalent in the film industry (of India) whereas the young girls who are aspiring to become film heroines are subjected to sexual exploitation by those (directors, producers, writers, heroes etc.) who claim to boost their career. It's a vice widespread in the show business and Vidhu Vinod Chopra being a part of this field, could portray it properly. How many people in this line satisfy their perverted desires under the subterfuge of filmmaking has also been shown realistically. It is an old-fashioned mystery though. The treatment of the murder-based plot is impressive and at place, quite spine-chilling for the viewer. I watched it on computer but those who might have watched it in theatre must have felt a chill running down their spine during a couple of scenes. The movie is slow in the beginning but once the first murder takes place, it picks up speed and proves to be thoroughly engrossing for the spectator. There are certain Bollywoodish potholes in the script but they cannot be easily noticed or felt upon first viewing of the movie because the viewer is hooked by the mystery. The climax is dragging and should have been shortened. The characters are mostly natural but at certain places over the top also, may be because of the director's will to show the theatrical impact emerging from involvement in a film-shooting, upon the actual behaviour of the people concerned. There was no need of any song in the movie and Vidhu Vinod Chopra has shown his better sense by not keeping any songs. The flow of the narrative, therefore, is nowhere blocked by songs. Though Mann Bhanwara is a song of this movie but I did not find it in the movie. The background score is perfect and add to the impact of the mysterious environment prevailing in the movie. Vanraj Bhatia is the music director. Technically, the movie is not superior. The film and the colours used in shooting and developing the shot stuff seem to be of not-so-good quality because the colours have faded in the print available now (used in the CDs as well as uploaded on the internet). Despite the complete shooting being shown in Pahalgaam, the eye-soothing scenes are quite less. Production value is not high. Editing is OK. Performances are good. Almost all the artistes have done well. Seasoned actors like Shabana Aazmi, Amol Palekar, Nasiruddin Shah etc. have rocked the screen with their admirable performances. Supporting ones viz. Soni Raazdaan, Sushma Seth, Ajit Vachchhani, Sadashiv Amrapurkar, Nony Ganguly,Virendra Saxena, Deepak Qazir, Avtar Gill, Sudhir Mishra (who later became film director) etc. are all perfectly fit in their respective roles. I personally liked the performance of Pankaj Kapoor the most. Vidhu Vinod Chopra has taken the credit of writing the movie himself. He has christened Amol, Shabana and Soni by their real life names, perhaps to infuse a flare of reality in their imaginary characters involved in the fictional work shown on the screen. He has mocked his own profession (and the attitude of the people in this profession) at many places. This old-fashioned mystery is, in many ways, similar to Agatha Christie novels. I recommend this long-forgotten and underrated murder mystery to all the mystery fans.",
         "Must have watched this movie at least 7-8 times. An extremely well made movie. Especially considering it was made in India in the 80s on a low budget. Amol Palekar shines as the villain . **************Spoiler ************************************ Especially the last scene where he talks to Shabana about how killing her. **************Spoiler ************************************ There was another movie in Marathi - Akriet wherein too he was the villain. Good actor and director. Nasser is as usual very good. Chopra is a good director but seems like he did not turn out as many movies as he should have.",
         "**SPOILERS**KHAMOSH is totally unrealistic, lacks a plot, and was basically only made to see stars portray themselves. The most suspenseful scene in the movie was when Shabana Azmi is in the shower and then we see her TV playing the shower scene from PSYCHO. This movie actually expected users to believe that Naseeruddin Shah's character has a good enough memory to remember where certain shots were fired and how many! ***SPOILER BEGINS*** At the end, the killer spills his guts to Shabana Azmi long enough to allow Naseeruddin Shah's character to run up and shoot him! ***SPOILER ENDS*** It is a little humorous (only a little) in the beginning to hear the director and cast members throwing insults at each other and hearing Shabana Azmi exclaim, \"Oh sh-t!\" Overall, a baaaaaaaaaaad movie! Rating: ** out of ********** (2 out of 10)"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["When a starlet is murdered on a film location, her detective brother arrives there to solve the mystery."],
      "budget": 0
   },
   "movielensId": 146144,
   "movielens": {
      "languages": [
         "हिन्दी",
         "English"
      ],
      "releaseDate": "1985-01-01",
      "dvdReleaseDate": null,
      "directors": ["Vidhu Vinod Chopra"],
      "runtime": 102,
      "movieId": 146144,
      "title": "Khamosh",
      "mpaa": null,
      "actors": [
         "Amol Palekar",
         "Naseeruddin Shah",
         "Shabana Azmi",
         "Soni Razdan",
         "Sushma Seth",
         "Pankaj Kapur"
      ],
      "imdbMovieId": "0089413",
      "originalTitle": "Khamosh",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["1HsyYXpcyKY"],
      "plotSummary": "Khamosh is 1985 Indian thriller directed and produced by Vidhu Vinod Chopra. The film starred Bollywood actors such as Naseerudin Shah, Shabana Azmi, Amol Palekar, Soni Razdan and Pankaj Kapoor. It, however, did not do well at the box office. The film became notable for actors Amol Palekar, Soni Razdan and Shabana Azmi portraying fictional versions of themselves. It is a suspense movie, wherein the murderer is among the group of people living together in a hotel, and the actual murderer is well hidden in the plot until the very end.",
      "tmdbMovieId": 188719,
      "avgRating": 1,
      "releaseYear": "1985",
      "numRatings": 1,
      "posterPath": "/3IcV8Mg3Zusk1em7nvcFF1xbfQ9.jpg"
   }
}