{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "bollywood",
            "id": 10540
         },
         {
            "name": "india",
            "id": 14636
         }
      ],
      "imdb_id": "tt0085743",
      "video": false,
      "title": "Just Let It Go, Friends",
      "recommendations": [
         35695,
         13123,
         15412,
         33202,
         43410,
         146270,
         19672,
         118032,
         33124,
         20494,
         21461,
         30066,
         15975,
         168489,
         16987,
         31524,
         16344,
         45002,
         353464,
         20929
      ],
      "backdrop_path": "/nKHpCUuZrnEyJRmHaQoAmA5yLRX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Vinod Chopra",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374a3",
               "name": "Naseeruddin Shah",
               "profile_path": "/7jCtyEHl8fvETUyxmzi04AeVZPk.jpg",
               "id": 6497,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "D'Mello",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374a7",
               "name": "Satish Shah",
               "profile_path": "/rJpld5ViYmACQUGvYAYEggnHi2O.jpg",
               "id": 35759,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tarneja",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374ab",
               "name": "Om Puri",
               "profile_path": "/xjkp1S0XxDBJrjHL8Kq0JD2uvz5.jpg",
               "id": 11851,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Ashok Nambudaripad",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374cd",
               "name": "Satish Kaushik",
               "profile_path": "/7FhKqtVpxxDbEtVdHYxtHxZZLtf.jpg",
               "id": 93290,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Tarneja",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374c1",
               "name": "Pankaj Kapur",
               "profile_path": "/p082jvI2rLjaDJXnVHKJeuezBjh.jpg",
               "id": 87549,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Shobha",
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374b5",
               "name": "Bhakti Barve",
               "profile_path": null,
               "id": 593020,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Sudhir Mishra",
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374b9",
               "name": "Ravi Baswani",
               "profile_path": null,
               "id": 230977,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Commissioner Shrivastav",
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374bd",
               "name": "Deepak Qazir",
               "profile_path": null,
               "id": 593021,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Kamdar",
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374c5",
               "name": "Rajesh Puri",
               "profile_path": null,
               "id": 593022,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Priya",
               "gender": 1,
               "credit_id": "52fe44cbc3a368484e0374c9",
               "name": "Neena Gupta",
               "profile_path": "/782xRdSqkmrFnK0UnUu1JoJcckq.jpg",
               "id": 583509,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "57a476d4c3a368671f0021ae",
               "name": "Zafar Sanjari",
               "profile_path": null,
               "id": 1661877,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 2,
               "credit_id": "57a476e392514132cd002210",
               "name": "Vidhu Vinod Chopra",
               "profile_path": "/yKzOp1u7rzgLd0q0tL5lvtOGMcT.jpg",
               "id": 99710,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374b1",
               "name": "Kundan Shah",
               "profile_path": null,
               "id": 593019,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374d3",
               "name": "Sudhir Mishra",
               "profile_path": "/tX9RX7ubgP8w1PZPnBSHKFeMu8E.jpg",
               "id": 225149,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374d9",
               "name": "Kundan Shah",
               "profile_path": null,
               "id": 593019,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374df",
               "name": "Kundan Shah",
               "profile_path": null,
               "id": 593019,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374e5",
               "name": "Sudhir Mishra",
               "profile_path": "/tX9RX7ubgP8w1PZPnBSHKFeMu8E.jpg",
               "id": 225149,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374eb",
               "name": "Ranjit Kapoor",
               "profile_path": null,
               "id": 593023,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cbc3a368484e0374f1",
               "name": "Satish Kaushik",
               "profile_path": "/7FhKqtVpxxDbEtVdHYxtHxZZLtf.jpg",
               "id": 93290,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374f7",
               "name": "Renu Saluja",
               "profile_path": null,
               "id": 593024,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e0374fd",
               "name": "Binod Pradhan",
               "profile_path": "/2N7kwwMEyfjaM2HHXthcA9L3YaA.jpg",
               "id": 53679,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e037503",
               "name": "Robin Das",
               "profile_path": null,
               "id": 593025,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cbc3a368484e037509",
               "name": "Vanraj Bhatia",
               "profile_path": null,
               "id": 593026,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.103348,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 25499,
      "vote_count": 17,
      "budget": 14000,
      "overview": "Two zanies open a photography studio. They score a partnership with a gossip magazine that suddenly thrusts them into a world of corruption, murder, and hijinks.",
      "similar": [
         87827,
         12177,
         20453,
         4538,
         783,
         87,
         334543,
         244267,
         97630,
         700,
         38167,
         205022,
         11236,
         8079,
         49009,
         7508,
         10631,
         268238,
         19666,
         10303
      ],
      "original_title": "जाने भी दो यारों",
      "runtime": 132,
      "poster_path": "/vEJK9jwJhOSAuHvDyPXNcrxerEv.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "National Film Development Corporation of India",
         "id": 503,
         "origin_country": ""
      }],
      "release_date": "1983-08-12",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kundan Shah"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Ranjit Kapoor",
         "Satish Kaushik"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0085743/",
      "coverLink": null,
      "actors": [
         "Naseeruddin Shah",
         "Ravi Baswani",
         "Bhakti Barve"
      ],
      "reviews": [
         "A lot of comments about this movie have centered on the apparently slapstick comedy, ignoring its usage to lend a sense of the grotesque in what is a essentially a masterful farce, and beneath the surface, more of a tragedy. This movie centers around the two young protagonists, full of ideals and the will to win against the powers of endemic and ubiquitous corruption, a corruption that is so manifestly present that the others do not seem to question its existence, but implicitly assume it and use it to serve their own ends. However, our heroes find the going quite tough. Although partly inspired by Michelangelo Antonioni's \"Blow-up\", this movie is in a class by itself, with dark humor reminiscent of Kafka and Gogol. The star cast includes some of the finest actors to ever grace the screens of Bollywood (or for that matter, anywhere else). Om Puri, Naseeruddin Shah, Pankaj Kapoor and many others deliver stellar performances in this tragi-comedy which is one of finest pearls produced by the New Wave movement in Indian cinema. Regretabbly, comprehension of the movie requires intimate knowledge of the background, something which you would only have if you have lived in India, where corruption is as natural as breathing, and if you are familiar with the turbulent times when New Wave Cinema was taking off, a time of discontent and idealism among youth, a time of unemployment and the times of the angry young man (as typified by Amitabh Bachchan in many commercial films from this era). However one can still enjoy it for it is a comedy worth watching. Hopefully, the viewer will see the tragedy beneath the humor. I rate this movie among the finest movies of all time, and in the class of farces, it stands alongside Kubrick's \"Dr. Strangelove\".",
         "This was a wonderful comedy, no cheap humor, no poor jokes, just a simple inexpensive movie made with a great script, good jokes and wonderful actors. The scene at the theater where the mahabharat is being enacted is by far the funniest 15 minutes in the history of Indian Cinema. A must see for everyone.",
         "Rib-tickling, side-splitting .. but also cynical, intelligent, and very, very dark. Comedy as it should be and so very rarely is. Corrupt politicians in cahoots with thieving contractors, their scheming rivals and their inept secretaries ... add two bumbling, idealistic, naive young photographers in the 'right' place at the 'right' time ..... throw 'em all together and all hell breaks loose, and boy is it hilarious!! I've seen this several times and never failed to collapse in helpless fits of laughter. Wonder why they don't make them like this anymore, and wish they did!",
         "Quite apart from its social satire, unimaginably ahead of its time for the dour early '80's Delhi, JBDY managed to bring together a slew of talent, Shah(s), Baswani, Kapoor, and of course the inimitable Puri 'Ahuja'. Folks over at NFDC still take the movie apart frame by frame, deconstructing its topical references and attempt to interpolate a social conscience to it. More than its concluding 'Draupadi vastraharan' scene, symbolic of the wretched disrobing of the Indian polity however, the film managed to make me cry out loud with laughter even as an impressionable twelve year old, merely for its slapstick content. This is a movie which gets better with every viewing, and reveals slick, symbolic and subversive undertones worthy of Kundan Shah's maverick vision.",
         "I remember when this movie came out it faired poorly at the box office and was off the theatres within a week. But I think it generated an underground sort of movement amongst youth who wanted to watch a different kind of cinema and soon it had a cult of its own. You ask any Indian cine fan between 30s and 40s his/her top 10 favorite movies and I think this movie will figure in the list somewhere. The plot is simple; two struggling photographers accidentally get involved in the filth that Indian 'system' is and which includes everybody from the police to media to politicians to builders etc. etc. etc. Once involved they try to expose everyone involved but the question is 'will they survive?' Performance wise, everyone from Naseer to Ravi Baswani to Pankaj Kapoor to Satish Shah to Satish Kaushik to Om Puri have given brilliant performances, probably amongst their best. It's almost like magic that you know that it happened but you never know how. The film is bustling with synergy of all these performers (actors, writers, director and the whole crew) who are just happy to work with each other and in such a creative environment and are out to make a difference. And difference they made. It is and will remain a cult classic with people from our generation.",
         "Two simple photographers, trying to eke out an honest living, caught in a web of scandal and deceit. Fantastic direction, outstanding plot, brilliant script, phenomenal casting and amazing acting. This movie has you laughing till the last scene, which is when the laughter is wrenched from your throat! The movie has great attention to detail. For example, the scene when monkey is being photographed, look into the mirror in his hand. You actually see Tarneja in a checked jacket and gun in hand. Which leads to the single biggest flaw: no gunshot heard? But that may be forgiven. The comedy is unending!!! For example, the Dhritrashtra, still blind, saying \"This is too much! Yeh Akbar kahaan se aa gaya?\"... Or Tarneja and Ahuja entering the Mahabharat in complete costumes, but still wearing their specs and sunglasses respectively! That, to my mind, is the single longest comic scene in Hindi cinema! The laughs do not stop!!! It stays, to date, the best tragi-comedy ever!",
         "Practically speaking.. I don't have words to express how you feel watching this movie. I guess this is the only Hindi movie which is end to end comedy. Lung puncture is guaranteed. Look at the star cast.. Nasiruddin Shah, Om Puri, Pankaj Kapur, Bhakti Barve, Satish Kaushik, Neena Gupta and above all, Satish Shah playing his unarguably best roll of his life.. Roll of a dead body. Who can forget dialog like \"Thoda khaao Thoda pheko\" And scenes like Drunkard Om puri talking to Satish Shah who is in Coffin and Om puri thinks that He is in some sports car. And above all The climax scene of Mahabharata Play.. Just mesmerizing performances... Technically correct and so real to real life talking about corruption, and bribe in such a lucid and comic way. Must say this is a Must Watch movie not once not twice but its like old wine, Every time you watch you are bound to get a different flavor all together. So if you have not watched it.. go and watch it.. you don't know what you are missing...",
         "This is one of India's best comedy movies. Well made, well directed, very well acted, the movies picks up more laughs as it develops and the climax is certainly the most hilarious. The theme is corruption in business, government and the media. Everybody is on the take, the Police Commissioner, the big bucks businessman, newspaper editor, etc. Two hungry-for-work photo studio owners accidentally take the picture of a murder and then \"all hell breaks loose\". The climax at a small theater where \"The Mahabharata\" is being staged will have you in splits. Crime has never been so much fun. Yet the film never loses its edge, its cynicism of what happens in the real world. The good guys always win in the end, right? Yeah, right... See the movie. I have no doubt this is one of India's classic comedy films.",
         "Vinod and Sudhir are struggling photographers. Shoba, editor of a political daily newspaper 'Khabardar' hires them for an assignment. what they thought was just a photography assignment turns out be a journalistic venture. Real life losers ends up hatching a 'big story'. A film about the modern ruling class and ruled class with a humorous backdrop. The very first time I watched this film I mistook it for a comedy. After 20 years I watch this film again and again and I get something new every time. This is a satire, farce, comedy, tragedy, drama or whatever you call it and its brilliant. There are just so many things in this film to admire. Acting, script, pace, camera, dialogs, humor. It's a masterpiece. This film has an unparalleled legend. The best thing I like about this film is its unique narration i.e. to find out the dead body Sudhir and Vinod enact the whole scene. They don't just look around. One actually shoots another guy who acts dropping dead and then look around for the body. Every character is stretched to its maximum. Ashok is a spy so he spies with binoculars, Sudhir and Vinod uses the same script to woo their customers, Demello is a corrupt mayor so he himself gives the plan and not just take bribes. They are simple things which brings out the characters. Ashok greets Tarneja every time he sees him. Even when he enters on the stage during Mahabharat he says \"Good morning Sir\" and then gets into his character. Ahuja drinks so much that he takes a coffin for a sports car. Priya is a bait Tarneja uses so she has a romantic angle with everyone she meets (including Ashok). Commissioner falsely crying on a mike and talking about 'Gutter'. Demello giving an interview to Times magazine. Ashok walks in with a loud sycophant (\"Lattu Ho Jayegee Lattu\") to threaten Shobha by mistake kicks her on the back and she actually twists his nose with a wrench. Every scene and every character is stretched. Its like a mythology. A Pandu gives a 'Hul' to the camera person before realizing he is on TV. Tarneja shamelessly talking about his success. Shobha changes her color unabashedly.A time bomb in a dinner party. A dead body on stage (how can someone think of this one??). I have no idea if one can write this kind of a script on a paper. This movie is unparalleled as far as great actors in one film is concerned. Pankaj Kapoor is the most underrated actor of our times. Imagine Tarneja and Kallu Mal Koyle Wala is played by one man. Brilliant actor.My favorite line is \"Ashok Ye Press Confrenece Kyun Bulayee Gayee Thee\". Satish Kaushik has given a genius performance. I love it when he say \"Time bomb Main Time Bahut Kam Hai\". By the way he has also written dialogs for this film. Naseer is too good. His best line is \"Tum Commissioner Ka Bawarchee Hai?\". Satish Shah has done a genius work as a dead body. He has maintained a wacky smiley expression throughout. Ravi Vasvani is too good. I love him when he sing \"Ek Duje Ke Liye\". Om Puri is a genius. His best line are \"paalan To Hamnin Apne Baap Kee Agya Ka Nahin Kiya. Tu Cheej Kya Hai\" and \"Pul To Tutegaaee\". If you have not watched this film you have no idea what Indian films are. 10 on 10.",
         "They've never quite managed to make a movie like this one. Naseeruddin Shah and Ravi Vaswani play photographers caught in a messy affair involving corrupt politicians, wicked businessmen, canny journalists (and some hammy actors). Giving director Kundan Shah (who has, surprising, gone on to the make some of the most awful films of the last decade) the chance to unleash his brilliant satire. He hits all his targets. Satish Shah is hilarious as a dead body on roller skates, and the 'Disrobing of Draupadi' scene in the theatre is one of the funniest ever shot. Like the rest of the film, it could have been cringe-inducingly-awful. If it weren't so funny, that is.",
         "Many people don't know that this film is based on real story yet it is so humorous and very much interesting. Story is similar to political storm of 1980s regarding Bridge collapse. The characters name also matches. Tarneja = Raheja (Builder) shobha = shobha de (Reporter) D'mello = rebello (Commisioner) Kundan Shah has to be acknowledged for writing this beautiful story with current affairs. Every details of film is outstanding and also dialog's. This is not best comedy film but also best film. Every actor has to be credited for his work. Naseerudin shah, pankaj kapur, om puri and satish kaushk specially.",
         "Hum Honge Kamyaab....and they did with Jaane Bhi Do Yaaro! JBDY is one of those rare Indian comedies where you don't have to wait for a funny situation to crop up from under the weight of suspense, action, romance, and tragedy. The most recognizable genres of the film world, practically all of them, have been realized, exploited and stretched to such an extent in this film that they almost border on the edge of not just satire but surrealism and you are left wondering – How in the world did they ever find humor in this one? Who could ever come up with the idea of a male corpse dressed as a woman, on roller skates, \"standing\" as a prop in a stage production of Mahabharata? It's bizarre but it works because of the stellar performances of the lead cast and some bitingly clever writing by Kundan Shah. The film takes its central idea from Antonioni's Blow Up and explores the investigation of two struggling photographers Vinod (Naseeruddin Shah) and Sudhir (Vinod Baswani) who in their desperation accept the offer of a local self-serving tabloid editor Shobha Sen (Bhakti Barve) to photograph a clandestine meeting between the corrupt Municipal Commissioner D'Mello (Satish Shah) and the real estate developers who intend on bribing him to get the best deal in town. As the rivalry between the builders, the smooth and vile Tarneja (Pankaj Kapur) and the alcoholic Ahuja (Om Puri) escalates, the threat of murder looms large. The two knuckle-headed photographers, caught in a web of deceit and double crosses, to their horror, inadvertently capture murder on camera that further leads them into the dark recesses of corruption that plagues news media, business, politicians, bureaucracy, and police. We along with our heroes later learn about the extent to which the guilty parties will go to preserve their survival. It is this very struggle for survival of each character fueled by greed that not just exudes cynicism while adding weight to the story but also acts as a source of non-stop side-splitting fun. Case in point: the scene in which the entire entourage of Tarneja and Ahuja, including the city commissioner, unabashedly usurp the play of Mahabharata because Vinod and Sudhir have hidden the dead body that could serve as the proof of the builder's wrongdoing and our heroes' innocence somewhere in that production. This has to be the most original idea ever to come out of Bollywood. The film clearly hints at the deterioration of the social structure of a society where the entire machinery is immoral and corrupt; breaking allegiances is commonplace, and all we have left to fight for us are two dunderheads who drew inspiration from a monkey and the only weapon that they have is a dead body. And this is where the blackness in this comedy works so wonderfully. Despite a more somber theme, Kundan Shah and team have done a great job in keeping the tone of the movie light. Even the most intense scenes are so multi-layered and laced with such farce and symbolism that it would be unfair and impossible to reveal all of them here. This movie is an experience and if you want to know why the lines \"Thoda Khao, Thoda Phenko\" (Eat a little, throw a little) and \"Tum commissioner ka bawarchi hai?\" (Are you the chef of the commissioner?) still induce a belly laugh among the loyalists, you have to OWN this movie and watch it again and again till your belly hurts.",
         "One monkey, two photographers and a murder-mystery form the backdrop to portray the quintessential nexus between the corrupt Indian politico-administrative class and the honest, trying-to-make-ends-meet class. Naseer shows his class as a comedian with excellent timing along with Ravi Baswani who is his usual squeaky-voiced, slapstick self. Satish Shah displays his firang-accented comical side while Pankaj Kapoor is the hair-trigger-temper top builder of Mumbai, with a sexy Nina Gupta as his secretary and Satish Kaushik his henchman-cum-competitor-for-Nina. But Om Puri takes the piece of cake with his booze tinged punjabi-accent with a mania for sports cars. This movie was a pathbreaker in the field of Indian mainstream-comedy, which usually stuck to the safe, tried-and-tested Chaplin-style \"comedy\". Unfortunately, innovative scenes, unforgettable dialogues, tickling backdrops and excellent acting were not enough to save this movie from bombing at the box-office. Although I've seen this movie more than seven times, it has never failed to amuse me. A must-see for a comedy-freak, this movie is a collectors-edition sorts. If it were to be re-released today, there's a distinct possibility of it faring much better at the hands of the XY-generation than the baby-boomers.",
         "I had hard a lot about 'Jaane Bhi Do Yaaro' and Kundan Shah happens to be one of my favourite Indian directors. Moreover the cast included first rate actors. Thus, I was quite excited. Now the film does look quite dated at times and some of the jokes feel a little old but things get funnier as the story moves along. Many seem to have been impressed by the in-your-face slapstick humour which is abundant in 'Jaane Bhi Do Yaaro' but what made this a better comedy for me was the underlying satire regarding the cynicism of corruption in India. Corruption has become just as frequent as the summer sun shining over the equator. It's a regular occurrence in the workplace and this movie captures that effectively with a dose of humour. Naseeruddin Shah, Om Puri, Ravi Baswani, Pankaj Kapur, Bhakti Barve and Satish Shah deliver hilarious performances. Kundan Shah's direction is fluid and, along with Sudhir Mishra, he's done a very good job in writing. Loosely based on Antonioni's 'Blow Up', ''Jaane Bhi Do Yaaro' has achieved the cult classic status over the years. Even though, in my opinion, it has dated a little, it's still hell of a lot funnier than most Indian comedies of the last ten years.",
         "I don't know if this movie is best Indian movie but I also don't know if there is any Indian movie better than this. (1)This movie has the best casting in Indian movie history including Naseeruddin, Om puri, pankaj kapoor, Ravi Baswani(a surprise and great performance from him), Satish shah, Satish Kaushik, Deepak Qazir(another surprising performer), Bhakti Barve, Rajesh Puri - All at their best. (2)Very few people must have noted the background music. So simple but yet so effective for the movie. Great music!!! . A great usage of song \"Hum honge kamyab\" also. (3)Arguably the best comedy movie I have ever seen(may be Andaz apna apna is a close contender in Hindi cinema). But this movie is full of memorable scenes that you can even remember the whole movie. Not just comedy it has murder, mystery and some horror also. Apart from all this the subject of the movie is very very important. It just tells that our legal(law) system itself has the biggest corruption(back then in 1980s & even now) so it is very hard for common men to get justice or to fight against corruption. In fact it may be the case in any country. This is by far the best black comedy movie I have ever seen. Truly an Indian Masterpiece!",
         "worth watching again n again n again .i never got tired n guaranteed neither will any1 who watches.this is a legendary one.this one puts todays comic era to shame no doubt about it.the cinematography the live wired performances.the background score ditto to story the darkness behind the comic lines,friendship,betrayal,business debacle,corrupt law and order,stupidity to its tenth category,dead talking stageplay turns into firing dialogue shadowing the mythological and todays generation,workshop menace,forging documents,spying on the bad,revealing you are the spy and getting chased with a dead man on skates!!!man this is truly awesome to ears what a treat to your senses imagine.go now and grab a copy if you totally want to brainwash your ribs ha ha ha...!",
         "I had watched the movie years ago and thought it was funniest film I had ever seen. So I sat down one afternoon to enjoy a few laughs all over again. Let me say right off the bat that a comedy this ain't. Is it a good film? You betcha - it is a great film! Naseeruddin Shah and Ravi Baswani are two photographers who want to get their photo studio off the ground. Instead they get caught up in a lot of hanky-panky involving corrupt politicians, government officials, and construction magnates. They run from pillar to post trying to get a scoop of a life time, but end up \"seeing\" a murder in a photograph they took. A Blowup (David Hemmings) type scenario ensues with a lot of bumbling around at night. A corpse is found that does not stay in place and the whole thing is very reminiscent of Weekend at Bernie's that came years later, and was perhaps inspired by this Kundan Shah gem! The comedic moments start with the wandering corpse and end in the most rollicking 15 minutes in cinema when a staging of the Mahabharata goes seriously bad. The Pandavs are desperate for the play to proceed on with Draupadi's Cheerharan (removal of clothes) while the Kauravas are equally desperate to see that Draupadi remains clothed (and I am not confused about the Mahabharata)! Somehow the grand Moghul also makes an entrance - these 15 minutes are worth the price of the DVD and will have you in stitches. But in the end this is a real commentary on corruption that is rampant in the country, and is actually a rather sad tale. Naseeruddin Shah is great as the serious photographer, has reasonably comedic moments, but it is Ravi Baswani as the petrified sidekick that steals the show. Om Puri is great at the drunk contractor type and Satish Shah is brilliant as the \"corpse\". Early parts of the film are a bit slapstick but this is rewarding fare indeed, so go watch it.",
         "This is really a gem of a movie, for all those who appreciate satire and good acting. This may be one of Kundan Shah's earliest movies but is without doubt amongst his very best. This one has to be seen to be believed. Go for it !!!",
         "I feel a real spoilsport, when so many have thoroughly enjoyed this Indian farce, that I couldn't go beyond the first hour. The film looked promising (I'm a photographer, for starts) but the broad, base humour jarred after a while and whilst I could see that it might be neatly meshing social comment, satire and slapstick, I could take no more! Maybe it's because I'm non-Indian, in an older age group or just wasn't in the mood. I can't help thinking that if this was a Hollywood affair, with the genre's usual crass, boorish and sweary 'stars', this wouldn't have worked for anybody and it would be less popular. Sorry if I can't add much more to this, but feel I should add my, less than praising comments, too.",
         "Words escape my mind as try to write a synopsis on this movie. Path breaker, revolutionary, creative, Out of the Box etc are the kind of the words that come to the mind when one thinks of Jaane bhi do yaaron. This first movie as a director for Kundan Shah was made on shoestring budget.It was more of an experimental effort. And what an effort it turned out to be. The story revolves around two photographers(Naseeruddin Shah and Ravi Baswani)who are starting their career by opening a photo studio. Their initial struggle to find work, their chance discovery of a murder and the body, the ensuing struggle between various people to get hold of the body and the climax where the murderers are caught(or not) is what the movie is all about. Though the script itself is not too great, it is situations and acts created that are simply awesome. The situations created are extremely hilarious to say the least. Add to that some amazing and memorable performances by Naseer, Ravi, Om Puri, Satish Kaushik, Satish Shah and Pankaj Kapur. Its a total laugh riot from the start till the end. A special mention must be made of the penultimate 'Ram Lila' scene which is so well shot and executed that it is difficult to find a better comic sequence in the entire Hindi movie database. That one could make such a brilliant movie in the first attempt speaks volumes for Kundan's ability. What started of as a first time attempt involving fresh graduates (the movie included in various roles some of Kundan's peers at the Film and Television Institute of India, Pune; Vidhu Vinod Chopra, Sudhir Misra who later became top directors in the Mumbai film Industry), actually turned out to be cult movie, an attempt that was never before experimented in the Indian film circuit. I have seen the movie more than a dozen times and it still makes me laugh like a kid. Definitely 10 on 10.",
         "This movie is a classic among avid film goers. All for a good reason. It is made by a phenomenal team: Kundan Shah, Sudhir Mishra, Nasrudeen Shah, Pankaj Kapoor, Satish Shah ... The story packs in a good deal of 'social message' laced through this otherwise funny movie. Some thing like dark comedy. The stupidity of the two photographers does not however stick well with their investigative talents. The photographers are caught in the double dealings and double double dealings and so on of the mafia between the press, the government officials, and the big contractors in Mumbai. The song 'Hum Honge Kamiyaab' after the revelation of the press editor's dealings with the constructors is one of the most famous ones. It is sad to see that 'conventional wisdom' does not enter their heads even in the last scene. The ending of the movie is possibly not very pleasing but is also a keen aspect of the movie. The movie is a must watch. But the audience must brace themselves for a not-so-pleasant ending.",
         "The entire movie is very good and tickle you continuously. But the last Mahabharat scene is a real diamond in the entire Hindi cinema. Never again such scene could be produced. The movie revolves around some set of characters and after the interval it centers around the dead body of the Dmelo. Dmelo is the municipal governor and is murdered by Tarneja (Pankaj Kapur). Unfortunate for Tarneja two young photographers (who think that they are professional), Vinod (Naseeruddin Shan) and Sudhir (Ravi Baswani) succeed to collect evidence against him. Ahuja (Om Puri) the builder and Shobha (Bhakti Barve-Inamdar) the reporter are two enemies of Tarneja and want to have hands on the proofs that Ahuja kills Dmelo. The main achievement of the movie is the pasteurization of the scenes. Starting from the opening ceremony to the end Mahabharat scene, all the scenes make you laugh like a child. Actors too are well fitted in their roles. All the actors are art film actors and certainly knows their work very well. Will not comment any more on the end scene of Mahabharat. Hardly there will be any who have not seen this scene. Any time you watch this scene, it has ability to make you fall on ground. The movie not only makes you laugh, but from inside makes you think about the corrupted society that we are living in. The movie has sad ending, which makes it more close to reality. The overall moral of the story will still be true for at least coming 50 years for India.",
         "I think this movie is like a treasure that not many people know about. But the people who do know about it never get sick of watching it over and over again. It is a cult classic and the one of the funniest movies Indian cinema has produced. Most of the cast has done a wonderful job. From the start to finish, it can cause you a stomach ache from laughing too hard. The Mahabharat climax scene takes the cake. Naseer,Ravi Baswani ,Pankaj Kapoor Satish Shah ,Satish Kaushik and Om Puri have given brilliant performances. Although the plot is simple where two aspiring photographers got caught up in the dirty world of politics ,builders etc,somehow everything clicked and worked for this movies storyline.I wish they had produced some more movies like this during the hay days. Absolutely must see.",
         "It is one of best movie i have ever seen in my life. Movies like this are made once in decade. Every filmy buff in India must have watched this film. I personally watched this movie at least more than 30 times and still watch whenever i get time. It has some classic scenes, dialogs and acting. I really enjoy some scenes like Mahabharat Scene(The shooting of this scene is done in Sahitya Sangha Mandir at Charni Road Station, Mumbai), Dual Conversation on telephone, Chase of Nasaruddin and Ravi with Satish shah's dead body, all scenes of Om Puri. So far best comedy movie ever made in India !!!!!!!",
         "This one has to stand out as one of the best comedies/satires ever made. Let me illustrate with the following...A dead man in a sitting position in his casket holding his wreath having an intense(admittedly one-sided) conversation with a drunk about cars....Soon,this dead man roller skating leisurely through the city...and this very same dead man starring in a play...now add to this the dry satire about essential goodness of people with the background of a corrupt India in the 80s and you can begin to understand what a magnificent movie this is.For those not into too much of hidden metaphors and social consciouswatever..fear not..This movie is hilarious and can hold its own as just a comedy...The best scene in the movie naah one of the best in movie history is the super tight drunk om puri and his conversation with satish shah that....Satish shah to me is the show stealer to me from his ultimate poses for naseers camera too his main role as a dead man.Naseer,vasvani and the rest of the cast are brilliant too....A must watch..get the DVD now..The English subtitles are pretty good in case you need 'em.."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["National Film Development Corporation of India (NFDC)"],
      "summaries": [
         "Vinod (Naseeruddin Shah) and Sudhir (Ravi Baswani) are two professional photographers trying to start a photo studio. The first real assignment that they get, from the activist magazine Khabardar (literally meaning beware), draws them into the shady world of Bombay real estate. They discover that one of the biggest builders in Bombay, Tarneja, is trying to bribe Municipal Commissioner D'Mello (Satish Shah) into giving him a bridge contract. Meanwhile D'Mello is negotiating with Tarneja's arch rival Ahuja (Om Puri). The contract is finally awarded to a third person. By chance Vinod and Sudhir find out that Tarneja has murdered D'Mello...",
         "Professional photographers Sudhir Mishra and Vinod Chopra open a studio in the prestigious Haji Ali area, and hope to make enough money to keep it running. After a disastrous start, they are given some work by the editor of \"Khabardar\", a publication that exposes the scandalous lives of the rich and the famous. They accept it and start working with the editor herself, Shobha Singh. They also decide to enter their name in a contest to win Rs.5000/- and take a number of photographs all over the city. In one of the photographs they see a man with a gun. Upon enlarging it, they find out that the killer is none other than builder Tarneja. Upon further investigation they find out that he has killed Municipal Commissioner D'Mello and left his body behind some bushes. Before the duo could get to the body, it disappears. Disappointed the hapless duo continue working with Shobha. Then they find out where the body is with Tarneja's rival builder, Ahuja. They locate it and take a number of photographs of the corpse, and wheel it with them with the hopes of exposing Tarneja. They provide this information to Shobha, who in turn starts to blackmail Tarneja, who in turn plants a bomb to kill her and her two associates - but unfortunately the bomb explodes right in the face of Tarneja and his employees' faces. Then the duo take the corpse, and wheel it with them, but not before Tarneja, Ahuja, the new Mun. Comm. Srivastava, Shobha and others also get involved - resulting in a comic mix-up with burkha-clad woman. The climax is set upon a stage dramatization of Mahabharat, which hilariously turns into the ill-fated romance of Salim and Anarkali - with the corpse taking the part of Draupadi and Anarkali, and the vile Duryodan pledging to save Drupadi;s honor at any cost!! What will be the fate of the corpse and our hapless heroes is only seen to be believed!!!",
         "This is the story of two friends, (Vinod - Naseeruddin Shah and Sudhir - Ravi Baswani) attempting to start-up their own photo studio. Business is very slow, but prospects look good when they are approached by Shobha (Barve) editor of \"Khabardaar\" newspaper. Shobha, feeding the simple-minded duo a spiel about righteousness and honesty, assigns them the job of spying/photographing the shady dealings between Police commissioner D'Mello (Satish Shah) and property builder Tarneja (Pankaj Kapoor). The two, on assignment come across corruption and bribery to win the tender for building a flyover. The main players in this are D'Mello, Tarneja and his rival Ahuja (Om Puri). While spying on the nefarious three, Sudhir and Vinod get a whiff of a murder, but do not know who the killer is. They manage to retrieve the corpse as proof, but subsequently lose it. What follows, and is pretty much the rest of the movie, is a long, extended chase (and what a chase - meanders into the oddest of places) with the bad guys (Tarneja, and Co.) and the good guys (Vinod and Sudhir) chasing the corpse.",
         "Two friends, attempting to start-up their own photo studio, come across shady dealings, corruption and murder, and must fight to bring the guilty to light."
      ],
      "budget": 0
   },
   "movielensId": 146134,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1983-08-12",
      "dvdReleaseDate": null,
      "directors": ["Kundan Shah"],
      "runtime": 132,
      "movieId": 146134,
      "title": "Just Let It Go, Friends",
      "mpaa": null,
      "actors": [
         "Naseeruddin Shah",
         "Satish Shah",
         "Om Puri",
         "Satish Kaushik",
         "Pankaj Kapur",
         "Bhakti Barve",
         "Ravi Baswani",
         "Deepak Qazir",
         "Rajesh Puri",
         "Neena Gupta",
         "Zafar Sanjari",
         "Vidhu Vinod Chopra"
      ],
      "imdbMovieId": "0085743",
      "originalTitle": "जाने भी दो यारों",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two zanies open a photography studio. They score a partnership with a gossip magazine that suddenly thrusts them into a world of corruption, murder, and hijinks.",
      "tmdbMovieId": 25499,
      "avgRating": 3.41667,
      "releaseYear": "1983",
      "numRatings": 6,
      "posterPath": "/vEJK9jwJhOSAuHvDyPXNcrxerEv.jpg"
   }
}