{
   "tmdb": {
      "original_language": "hi",
      "keywords": [{
         "name": "bollywood",
         "id": 10540
      }],
      "imdb_id": "tt0260411",
      "video": false,
      "title": "Tahkhana",
      "recommendations": [],
      "backdrop_path": "/63P3Oz7NJBcqhCK0jRbqzM6gGdP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Panna",
               "gender": 0,
               "credit_id": "52fe4ed39251416c75163b51",
               "name": "Hemant Birje",
               "profile_path": null,
               "id": 1041358,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Vijay",
               "gender": 2,
               "credit_id": "53bfd7060e0a2615760069e1",
               "name": "Puneet Issar",
               "profile_path": "/80VUcevQFcU1pu0kq2QTjywRCMn.jpg",
               "id": 110144,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Aarti Singh",
               "gender": 0,
               "credit_id": "52fe4ed39251416c75163b5d",
               "name": "Arti Gupta",
               "profile_path": null,
               "id": 1125378,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Raghuvir Singh",
               "gender": 0,
               "credit_id": "52fe4ed39251416c75163b65",
               "name": "Trilok Kapoor",
               "profile_path": null,
               "id": 1263212,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Rana",
               "gender": 0,
               "credit_id": "52fe4ed39251416c75163b4d",
               "name": "Rana Jung Bahadur",
               "profile_path": null,
               "id": 1263208,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Reena",
               "gender": 0,
               "credit_id": "59d5e7249251417f5c00ba29",
               "name": "Huma Khan",
               "profile_path": null,
               "id": 119271,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "597d37749251415d9800c03a",
               "name": "Shyam Ramsay",
               "profile_path": "/urz4vNw3R6RAix5q4bDHPviQgAP.jpg",
               "id": 1019955,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "597d3780c3a368539700c5ec",
               "name": "Tulsi Ramsay",
               "profile_path": null,
               "id": 1019956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "597d378bc3a368544000b5ff",
               "name": "Arjun Ramsay",
               "profile_path": null,
               "id": 1860119,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "597d379dc3a36853f600bb5f",
               "name": "Gangu Ramsay",
               "profile_path": null,
               "id": 1526608,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.238619,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 228650,
      "vote_count": 0,
      "budget": 0,
      "overview": "A dying Thakur Surjeet Singh bequeaths the entire estate to his son, Raghuvir, disowning the other, Dhurjan, the family's black sheep, who also indulges in black magic. The latter swears to use magical powers to usurp the estate, and even arranges the abduction of Raghuvir's daughters, Sapna and Aarti. Mangal and his men manage to apprehend Dhurjan, imprison him in a dungeon, and rescue Aarti. However, they are unable to locate Sapna, and Raghuvir gets killed. Before dying, he informs Mangal that Sapna has one of two pieces of a locket around her neck, while the other is on Aarti's, and when joined together will reveal the location of a treasure buried in a dungeon. 20 years later, Aarti and her boyfriend, Vijay, along with several others, will attempt to unearth this treasure - not realizing that they not only face betrayal from one of their own, but will also release and fall prey to an ageless and indestructible entity.",
      "similar": [
         44425,
         20453,
         87,
         87827,
         244267,
         4538,
         334543,
         700,
         7508,
         38167,
         12177,
         11236,
         49009,
         205022,
         204435,
         19666,
         268238,
         27621,
         364116,
         2897
      ],
      "original_title": "तहखाना",
      "runtime": 125,
      "poster_path": "/krkdLom6WIz1BZirVC3bcJ9Ty8A.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ramsay Productions",
         "id": 9259,
         "origin_country": ""
      }],
      "release_date": "1986-12-11",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Shyam Ramsay",
         "Tulsi Ramsay"
      ],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "J.K. Ahuja",
         "Kafil Azar"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0260411/",
      "coverLink": null,
      "actors": [
         "Rana Jung Bahadur",
         "Hemant Birje",
         "Deepak"
      ],
      "reviews": [
         "After his father's death, a young man finds that the long-lost sister of his girlfriend has resurfaced with the needed part to a map to a great treasure only to find a strange creature raised and targeting the group forcing them to deal with it while finding the treasure. This here was quite the fun and enjoyable offering. What really makes this one work is the fact that it displays quite a lot of impressive elements familiar with more traditional offerings. The opening here, where the creature is seen roaming the underground catacombs gives this a solid start while leading nicely into the need to capture the evil magician, as well as the rescue of the kidnapping daughters, sets this off on a rather fun action-packed note with a bit more of a truly international flair. The search for the treasure out in the wilderness comes off rather fun with the multitude of fist-fights against the henchmen and their initial struggles in getting to the mansion for safety require them to run into the creature in the underground catacombs while the whole affair taking place during a raging thunderstorm gives it a chilling atmosphere that's incredibly impressive. That carries on into the first exploration of the caves where they come into contact with the creature for the first time who launches several great strikes against the two groups which make the scenes rather fun as well as getting the atmosphere from the creepy location. There's also the great fun of fighting the creature inside the temple, where it leads several really chilling encounters against the villagers trying to stop it as there's plenty to enjoy in the extended one-on-one fight with the friend or the numerous tactics of the villagers to stop it which make for a thrilling finale as they utilize quite an inventive technique to finally stop it. As well, the fact that this one doesn't indulge in as many other fabled elements from the genre here where it doesn't really indulge in useless tangents to add on to the running time, only has two musical numbers and really tones down the silly, slapstick comedy really give this a boost. That makes for a universal feeling here where it still has plenty of local flavor but isn't strictly trapped in with so many elements as to make it strictly identifiable as belonging to that region. Along with the great atmosphere here while at the hotel or underground in the caves, these here really make this one feel quite international in approach which gives this a fun and appealing style. While these here make it work, there are a few minor flaws here. The main issue is the fact that there's little need for the lecherous companion here as his storyline doesn't amount to anything other than the repetition of the same thing over and over and even manages to cause the film to run in circles which causes the film to run a little too long as it has to deal with his storyline that really didn't need to be there. The other small factor here is the confusion over the creatures' origins, which is given two distinct possible origins and very little of the film makes it clear what he's supposed to be. Otherwise, this one was quite the impressive effort. Rated Unrated/PG: Violence.",
         "Recently I watched 'Tahkhana' and would like pass my opinion about the same. 'Tahkhana' means 'dungeon' and that's the resting place of a pale-eyed, swollen-n-rotten-faced monster. The storyline is weak, with several unwanted characters that torment the viewers brutally. Then their are hopeless stars like Rajindernath and Huma Khan, who fail to create an oasis in this far stretched desert. The movie could have been better if it were lessened by an hour. Unfortunately, during 80's it was a custom to make long movies and all the movie-makers were concerned more about time than viewer's patience. Kamran Rizvi has failed as a hero as most of the times he relies on his sidekick Hemant Birje to face the enemies. Since many sub-plots are interlaced, they all tend to kill the real spirit of movie. For example, the plot of Kamran Rizvi and Aarti Gupta, Hemant Birje and Priti Sapru, Imtiaz Khan and his confederates, The story of two sisters who separated during childhood, Imtiaz Khan's rape story, and Punit Issar and his plot. So where are we heading? There is virtually no space left for horror and the monster seems to be the most wanted character all the times. When the movie started I began giggling but as the movie progressed my giggles turned into loud hysterical laughter. Believe me, if you haven't watched it yet, you're lucky. There is nothing in the movie that has the ability to impress the viewers. Some dialog deliveries seem very foolish and comedic spell by Rajindernath is torturous to its best. The star cast is mostly borrowed from other Ramsay hits but they weren't any better than puppets performing at the stale and awkward story line. I would give this flick 4/10, and those 4 points totally go to the monster.",
         "We all know what dommsday did to the superman but monster of this movie is unforgiving creditor than doomsday,This huge devastating looking horror man monster is unforgiving and no compromise whatsoever,he destroys everything in its path.You get to breath for a while when he is not around but when he comes back,there is approach with inexorable certainly.Ramsay brothers makes sure we don't stand up from our seats because every 3 minutes something bad bound to happen.so people of all ages,watch this at your risk.Those with weak heart and health issues,sorry lads,I urge you forget this movie ever existed.insane at its best,the voice of this man monster is so terrifying that you wont even plan to go for trekking with your friends any more,why bother to visit Bhangarh Fort when you have tehkhana back of your house and Andrea Bianchi thanks for your noble support",
         "I remember my elder brother rented this movie out when i was about 7 years old and i saw it the first time. At first i thought wow what a great movie and that Bollywood can do horror movies. After watching it yesterday at a friends house who happens to own this, i thought wow. Wow, as in how could i ever like this film. Too be fair, for a 1985 movie it is quite good with a few entertaining scenes. The storyline is too long and unnecessary at times. The monster of the film is a black magic expert 25 years ago which was alright. But then the storyline goes all wrong when the two sisters who were separated at birth try to re unite. But it goes all wrong when one of them gets raped and murdered. The rapist some how finds the sister who is looking for her sister because of their fathers treasure. Anyway the point being, is that this film is boring. Its only fun when the monster appears. The actors are terrible."
      ],
      "genres": [
         "Action",
         "Drama",
         "Horror"
      ],
      "productionCompanies": ["Ramsay Productions"],
      "summaries": ["A dying Thakur Surjeet Singh bequeaths the entire estate to his son, Raghuvir, disowning the other, Dhurjan, the family's black sheep, who also indulges in black magic. The latter swears to use magical powers to usurp the estate, and even arranges the abduction of Raghuvir's daughters, Sapna and Aarti. Mangal and his men manage to apprehend Dhurjan, imprison him in a dungeon, and rescue Aarti. However, they are unable to locate Sapna, and Raghuvir gets killed. Before dying, he informs Mangal that Sapna has one of two pieces of a locket around her neck, while the other is on Aarti's, and when joined together will reveal the location of a treasure buried in a dungeon. 20 years later, Aarti and her boyfriend, Vijay, along with several others, will attempt to unearth this treasure - not realizing that they not only face betrayal from one of their own, but will also release and fall prey to an ageless and indestructible entity."],
      "budget": 0
   },
   "movielensId": 146154,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1986-12-11",
      "dvdReleaseDate": null,
      "directors": [
         "Shyam Ramsay",
         "Tulsi Ramsay"
      ],
      "runtime": 125,
      "movieId": 146154,
      "title": "Tahkhana",
      "mpaa": null,
      "actors": [
         "Hemant Birje",
         "Puneet Issar",
         "Arti Gupta",
         "Trilok Kapoor",
         "Rana Jung Bahadur",
         "Huma Khan"
      ],
      "imdbMovieId": "0260411",
      "originalTitle": "तहखाना",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "A dying Thakur Surjeet Singh bequeaths the entire estate to his son, Raghuvir, disowning the other, Dhurjan, the family's black sheep, who also indulges in black magic. The latter swears to use magical powers to usurp the estate, and even arranges the abduction of Raghuvir's daughters, Sapna and Aarti. Mangal and his men manage to apprehend Dhurjan, imprison him in a dungeon, and rescue Aarti. However, they are unable to locate Sapna, and Raghuvir gets killed. Before dying, he informs Mangal that Sapna has one of two pieces of a locket around her neck, while the other is on Aarti's, and when joined together will reveal the location of a treasure buried in a dungeon. 20 years later, Aarti and her boyfriend, Vijay, along with several others, will attempt to unearth this treasure - not realizing that they not only face betrayal from one of their own, but will also release and fall prey to an ageless and indestructible entity.",
      "tmdbMovieId": 228650,
      "avgRating": 2.5,
      "releaseYear": "1986",
      "numRatings": 1,
      "posterPath": "/krkdLom6WIz1BZirVC3bcJ9Ty8A.jpg"
   }
}