{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt3741316",
      "video": false,
      "title": "Bare",
      "recommendations": [
         18514,
         308077,
         96534,
         196967,
         245169,
         381108,
         397242,
         326434,
         378263,
         70214,
         218670,
         172824,
         423878,
         330220,
         289723,
         182349,
         172469,
         241071,
         261823,
         348955
      ],
      "backdrop_path": "/arzPIqbYut1nTWTBiWRVsn9TDVy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sarah Barton",
               "gender": 1,
               "credit_id": "55cc4e14c3a368055e000b2e",
               "name": "Dianna Agron",
               "profile_path": "/pX5VmcuyLai3XZvaJJgk1x5X9Sr.jpg",
               "id": 141687,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Pepper",
               "gender": 1,
               "credit_id": "55cc4e49925141763e0022ba",
               "name": "Paz de la Huerta",
               "profile_path": "/cNdcFnL9stZowOTrzMendAWehP3.jpg",
               "id": 59882,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Lucille Jacobs",
               "gender": 1,
               "credit_id": "55cc4f20c3a3685a88001dc9",
               "name": "Louisa Krause",
               "profile_path": "/nae3zfkGZvr56xaP8k2QBfQArxm.jpg",
               "id": 131871,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Haden",
               "gender": 2,
               "credit_id": "55cc4f34c3a36856f900249f",
               "name": "Chris Zylka",
               "profile_path": "/wxV6WMIdsvwXkMaCqe7WpRE0EM7.jpg",
               "id": 231547,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Linda Barton",
               "gender": 1,
               "credit_id": "55cc5093c3a368570100242a",
               "name": "Mary Price Moore",
               "profile_path": "/t6oQviCOqMTiwic6zafwosURwsI.jpg",
               "id": 1496395,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Trucker",
               "gender": 2,
               "credit_id": "56c04954925141398a002cba",
               "name": "Dave Colon",
               "profile_path": "/yuF9n01G3xJG4dk245n2kryblfy.jpg",
               "id": 79236,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jaz",
               "gender": 1,
               "credit_id": "56c049e59251414ba90028b0",
               "name": "Lora Martinez-Cunningham",
               "profile_path": "/zRiTvCDFR8i5OyxYDFmRPuDNbSF.jpg",
               "id": 1151637,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ginger",
               "gender": 1,
               "credit_id": "56c049f7c3a368180a00c416",
               "name": "Alexandra Roxo",
               "profile_path": "/k3r5XsZuatbyLxfJnLjtVCrUWj1.jpg",
               "id": 1194765,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Billy",
               "gender": 2,
               "credit_id": "56c04ae692514170aa0051d7",
               "name": "Travis Hammer",
               "profile_path": "/uU9j4nHsR5nZUILa35QlJIB2WwS.jpg",
               "id": 128560,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "56c04b2ec3a36817fd00aec3",
               "name": "Kelley Lewallen",
               "profile_path": "/dnc4nc9DsYczSJXBSyTqu0wEuuz.jpg",
               "id": 1577151,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Dairy Dream Manager",
               "gender": 1,
               "credit_id": "56c0559ec3a36817f200b9d5",
               "name": "Robyn Reede",
               "profile_path": "/duKkFAK12SxdnlHyGPcV3UvNAuw.jpg",
               "id": 1086573,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5516bdc89251413ec40014a8",
               "name": "Natalia Leite",
               "profile_path": "/gcz5P9NDNKOwH00YOlX1gt9uawg.jpg",
               "id": 1446636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55cc512a925141764800227b",
               "name": "Joe Murphy",
               "profile_path": null,
               "id": 1496396,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55cc50e7925141763e002319",
               "name": "Tobias Datum",
               "profile_path": null,
               "id": 986472,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "5604665a92514122c3005931",
               "name": "Natalia Leite",
               "profile_path": "/gcz5P9NDNKOwH00YOlX1gt9uawg.jpg",
               "id": 1446636,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.988353,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 333091,
      "vote_count": 22,
      "budget": 0,
      "overview": "A young woman's friendship with a drug-dealing drifter evolves into a lesbian romance.",
      "similar": [
         376867,
         376660,
         24684,
         11421,
         112160,
         85350,
         449176,
         43923,
         27586,
         8272,
         378064,
         598,
         858,
         10229,
         14,
         11216,
         141,
         634,
         391713,
         84892
      ],
      "original_title": "Bare",
      "runtime": 91,
      "poster_path": "/zF5B84Jjdc9WiCfNkdKCz7CtS6z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Indion Entertainment Group",
            "id": 3572,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Purple Milk Production",
            "id": 51788,
            "origin_country": ""
         }
      ],
      "release_date": "2015-10-30",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.ifcfilms.com/films/bare/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Natalia Leite"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Natalia Leite"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3741316/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BN2RjMWIxNjAtYzczNC00M2JmLWE2MjQtYmVkMjllMjA0M2YwXkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Dianna Agron",
         "Paz de la Huerta",
         "Chris Zylka"
      ],
      "reviews": [
         "I caught this on NetFlix last night. I thought it was good, a good movie that tells the story very well and with excellent acting. I had never seen any of the actors before and was pleasantly surprised. This is a character drama without much action besides the interpersonal drama which I enjoy but maybe isn't for everyone. The story will resonate with anyone who grew up in a small town and was bored and frustrated by that limited existence. Sarah Barton works at the grocery store, is bored with her job and her life, and looks around at all of the people still in the town and can't imagine growing up and living here her whole life. Her mother and boyfriend are in town but they don't do much to help her tolerate it. She wants something to happen in her life but doesn't know how to go about it. In drifts Pepper, a classic charismatic drifter with a dark side, who befriends Sarah and leads her into a sordid world of striptease, sex and drugs. I thought the interplay between the two leads was excellent and they clearly had chemistry and played their parts so well it didn't seem like acting at all. A scene near the end (no spoilers) where they both know they're lying to each other but are both pretending that they're not was played extremely well. The scenes, supporting actors, and even costumes were so perfect for rural small town America that it was possible to believe every detail of the story. The ending, while not completely \"uncompromising\" was satisfying and I thought both hopeful and realistic. Overall a good movie.",
         "This is not exactly a glowing review, but I do want to address something before I get down to any critique. Giving a film one star even though you think it deserves more is just a crass and cynical thing to do, and the guy who admits he did so should be ashamed of himself for doing it. There are people who absolutely loved this movie. Fans of the actors in particular, which is to be expected. I myself absolutely loved it when I first saw it at its world premiere, and even rescheduled my flight to go back and watch it again a few days later. The cinematography is brilliant, and the role that Dianna Agron plays is far removed from anything else she's done. Her character is very passive and quiet, and thus it falls on her to act as much with her body language and expressions as her spoken words. She pulls it off brilliantly. If you're like me, you may very well come away with an 8-star feeling on your first viewing. Having said that, after watching it a few more times I've started to see some of the shortcomings, though I do still think it's a good film. First of all, I think it helps to be able to relate to or imagine growing up not just in a small town, but in a town with literally nothing to offer besides mind-numbing lack of social life and completely menial nowhere jobs. If you can't put yourself in those shoes, you likely will not get a lot of the film's impact. If you've ever had a time in your life where drinking beer by the dump and then shooting at the cans was the highlight of your week, you'll definitely see where this comes from. That's not really a shortcoming, but it does limit what a lot of people can really get out of the story. As I said above, the cinematography was generally brilliant. The cameras and the way this movie was shot do a great deal to set the scenes, often as much or more than the actors. There are, however, times when this attempt at making art with the cameras actually resulted in scenes that were difficult to understand simply because they were too subtle. Too artistic rather than advancing the narrative. There are also a few times when the narrative is just plain interrupted with awkward dialogue that really could have been either done away with or done better in a perfect world. More on that below. The main actors, including Sarah's family and friends, were all brilliant with the exception (in my mind) of Paz de la Huerta. She was almost right for the role, but in the end her mannerisms just became too much; too distracting. There were a few scenes where her portrayal was almost like a record skipping in the middle of a song, and honestly she could have toned things down a bit and been better. One last issue is simply because of what the film is. An indie by a first-time director shot on a very tight budget and a very limited time frame. When you consider that, this really is an amazing end product. Having talked to the producers, I know there were scenes they wish they could have re-shot, dialogue they wish they could have smoothed out, things they wish they'd done differently. But unlike with major studio productions, you often only have one real shot at it. There's not room in the schedule to scrap a day of shooting and try it over again. There's not room in the budget to pay for the use of a location or the crew salaries to go back and do it over. You have to get it right the first time. They mostly did, and if you look at it like that this is definitely an achievement. It's a story that's overall well told and beautiful to look at. Of course it's not a brand new story nobody's ever told before, but it is overall well done and I think this one has enough going for it (and enough different about it) to be more than worth watching. Give it a try and see for yourself. It won't be some cinematic epiphany or holy experience, but you may just be glad you did.",
         "The movie don't speak about lesbian love, drugs or prostitution but about the perspective of life when you live in a middle of nowhere in America and your only future is working as a saleswoman with 3 kids. They made a documentary about this situation before the movie and it was very interesting to see it before because what they show in the movie is totally true. For a first movie, Nathalia Leite do it very well and the feminine vision do a beautiful rendering. You understand totally why Sarah can fall in love with this girl who is showing her a different life. Pepper is exotic. Maybe the vision and the movie is too feminist for some people. Dianna agron do the best acting in this movie. Maybe she needs to do an intimate production and not a big Hollywood production for acting true and Paz de la huerta was perfect for this role.",
         "Female writer-director Leite has an interesting future. In \"Bare\" she stuck to the rules and never showed the girls fully nude or exposing their genitals. The heroine (Donna Agron) sniffed a powder, but apparently never sold her body to one of the revolting clients of her den-of-sin club. She preferred to romp in the desert with her bad-girl friend Pepper (La Huaz) who shares a small amount of peyote with her and ravishes her young body afterwards. We've seen Donna shagging in the car with her boyfriend, with no back-arching of the sort Pepper instigates. But eventually the two separate, and Donna goes home and hugs her mother and makes up with her boy-friend. Showing off her assets in a sex club and sniffing powders has caused her to grow up. A nice film, worth seeing.",
         "Came across this one by chance and decided to give it a try. This is a nicely made coming of age story that takes place in a small dead- end town in Nevada. We have seen stories like that many times before but this one still stood out for me for its feel. The pace is just right so the film never gets dull despite the fact that it's a slowburner. The camera work is absolutely wonderful and definitely elevates certain scenes. Another thing worth mentioning is the soundtrack. If you love indie/alternative type of music (Chromatics, Part Time) you will be very pleased. The songs perfectly match the scenes. The one that especially stands out in my opinion is the desert scene with the snake, everything comes together nicely there making it almost hypnotic. The acting is solid. Dianna Agron (The Family, I Am Number Four) and Paz de la Huerta (Enter the Void, A Walk to Remember, Boardwalk Empire) work well together and it's nice to see Dianna Agron doing something different and daring from her previous roles. The stand- out performance would have to be Chris Zylka though (Kaboom, The Leftovers), an obvious scene stealer in this one. If you are a fan of indie films then I would recommend Bare. Just let yourself slowly be immersed in it and it will take you away a little for those 90 minutes.",
         "This is the worst movie I've ever been forced to sit through. Not sure how this even got made, luckily the general public will be spared as it won't ever be in a real movie theater. Diana Agron and Paz De la Huerta are good actors but not in this film. It is pretty to look at, yet has absolutely no real direction or vision. There is no story, just fragments and half ideas thrown together. And despite being made by a woman director, it is full of the male gaze and old stereotypes. It's also extremely white and lacks diversity. Plot synopsis: Poor young white woman in a small town who thinks her only way to escape is to become a stripper. This is a very narrow-minded and contrived film with a formula we've seen a million times in bad 80s films. It's like the director just replaced the stereotypical bad-ass guy in a leather jacket with Paz De la Huerta.",
         "I should have taken notice of the \"real\" reviews! I didn't really feel in the mood for an action movie or something which would need my deep attention, so I thought I'd give this a go. This movie was just bad. I can't see the point of making it except that whoever wrote the story, whoever directed it, whoever it appeals to must have had, or know a couple of women in that situation! I doubt it would appeal to a wider audience. The only people, women, it may appeal to are those who either lead such a life, want such a relationship, have been in that business, use drugs, are Bi or Lesbian... Guys, don't even think of wasting time with this!",
         "I thought the movie was good. I thought the acting was amazing, in my opinion. I hope this review helps some because the others are pretty harsh, but everyone is entitled to their opinion. I'm not saying anyone is wrong, just that this movie may not be for everyone. Sorry this is long. Acting: Paz and Dianna play the part well, they are so convincing that, I would have thought that, this is how they act in everyday life. Paz is perfect for the part of pepper, her mannerisms how she speaks all her idiosyncrasies. Dianna's character Sarah is the sweet, somewhat naive townie whom is non-confrontational. Her scenes are captivating, because you feel and see how her character Sarah transforms/develops and really comes into her own when she dances on the pole later in the movie. You see how Sarah feels by looking into her eyes you can see the emotion Dianna is trying to evoke and bring to life for her character. Story: The story itself was interesting. Yes there is the stereotypical storyline; mystery person somewhat causes good girl becomes stripper, which leads to doing drugs, drugs cause her to get in trouble, leading her to an epiphany. However, its not like the character Sarah magically has it all figured out and lives happily ever after. She realizes there is more than the town she's from. She was a no one working at a store, to a stripper/dancer making a lot of money and had potential to do something so daunting/outside of her norm. So, it's sort of in a way her breaking the cycle and going her own way in life, by whatever means necessary. She is more confident by the end of the movie, and see's if she try's she can make it happen, she is willing to work to see the world or do whatever she wants. She is into \"random stuff\" like abstract type art, Africa documentaries and non-domesticated animals. She is a bit of a dreamer and with pepper, she feels she can achieve or do anything. Pepper makes her feel free, special and adventurous. Overall: I truly did enjoy and like the movie, was it stereotypical in some ways, yes, to a degree. This story touches on someone's life. A lot of stereotypes are based on groups that experience the \"same thing\" in the most simplistic way to phrase it. I would say if your up for a different kind of movie that wants you to sort of think about life and realize we are in control of it. Go for it. The movie gives you the hope that things can change and can become better but how you get there is your decision, maybe its not legal, maybe you learn your lesson's in life the hard way. But if your willing to work, try and live. The possibilities are endless, but you gotta try and take risks, otherwise the world will make your decisions for you. At least thats what I got out of the film.",
         "I think I know what the film-makers were aiming to create here and while I enjoyed some of the cinematography, the capture of the familiar industrial urban complex highwayed out in the middle of nowhere-in-particular and a pleasantly interesting, dreamlike sequence involving sunbathing and a snake, this film fails to make real impact. I'm sorry, but Paz de la Huerta cannot act, for starters. Yes, she does have a somewhat exotic screen presence and I can appreciate why Paz was chosen for the role she plays, but the woman is just so unconvincing, passionless and dull; she merely opens her pouty lips to allow words to fall out and it's all very wooden in what appears to be a permanently coked-out zone. Diane Agron, conversely, seems to be a good actress but unfortunately Paz made her look she was overdoing it, or taking it all too seriously. For instance, I could not believe her when her character, Sarah, tells 'Pepper' (Paz), 'when I'm with you, I feel like anything is possible, anything could happen'. Really? That's pretty generous when Diane is the one who seems the far livelier and more interesting and passionate of the two! Since when does pushing drugs on vulnerable women, living in squats and being chased by angry thugs make someone edgy and exciting where 'anything could happen' as opposed to making them a real freaking headache to have around and someone who might get themselves or you killed at any given minute? There's not much of a story arc, and no tension to speak of so the film's resolution falls flat. Character development is poor thus stereotypes must suffice for a boyfriend, friend, work-place 'bitch', a bunch of strippers and a proverbial bad guy who wants his money. That's all folks.",
         "This movie is amazing! It is a unique story told beautifully with a very talented cast.. Diana Agron and Paz De la Huerta are amazing in it! I already can't to see it again. It's beautifully shot and well put together. Always glad to see female directors shine! Impatiently waiting for it to be released in theaters... Plot synopsis: Sarah Barton, played by the lovely Diana Agron, is a young girl from a Nevada desert town. After she is fired from her job, she meets Pepper, played by the amazing Paz De la Huerta, a female drifter. Pepper brings Sarah into her dangerous world of drugs and strip clubs led down a dangerous path of illicit drugs and seedy strip clubs. When they become romantically involved, Sarah begins to question the old boring girl she once was.",
         "Greetings again from the darkness. The debut feature of writer/director Natalia Leite takes on the all-too-familiar territory of a disenchanted teenager being smothered by a claustrophobic small town, and twists it into a nocturnal awakening that changes some lives, while leaving others forever jogging in place. Sarah (Dianna Agron, \"Glee\") is a bored, young local in a small Nevada town. She gets fired from her job as a supermarket checker and spends her time hanging out with her boyfriend (Chris Zylka) and their group of equally unambitious friends. One day she stumbles upon Pepper (Paz de la Huerta, \"Boardwalk Empire\") who is sleeping in an abandoned store owned by Sarah's father. Intrigued by the drifter, Sarah allows herself to be drawn into Pepper's world of drugs and strippers. A quick trip to Las Vegas really opens up Sarah's eyes to the great big world, and also leads to some amorous feelings toward Pepper. Clichés abound here as the mysterious stranger awakens the spirit of the small town dreamer; the taboo love story; the judgmental family and friends; and the \"one last shift\" to earn enough money to flee this small town and discover one's true purpose while living a carefree life. Pepper tosses out some philosophical musings and Sarah falls hook, line and sinker. We fully expect this to end badly for both. Filmmaker Leite does a nice job of creating the feel of the night without judging its participants too harshly. Dianna Agron has the screen presence to pull off the innocent girl's self-discovery, while Paz de la Huerta has the mysterious quality of one to whom someone like the Sarah character would be drawn. It's interesting how Sarah is allowed to choose her own path, and explore the possibilities of what might be. At best, the film is one for a sleepless night, and it does provide two disparate female leads and a director who has earned more opportunities.",
         "Loved this movie! It is so awesome to see a female director making a movie with such strong, complex female characters. Dianna Agron and Paz de la Huerta played off each other beautifully and it was great to see Agron play a role so different from her typical \"good girl\" role and do it so well. I love the way Natalia Leite, in both \"Bare\" and \"Be Here Nowish,\" doesn't make sweeping statements about queerness or feminism, but just portrays them as they are. This movie will make you question all of your preconceived notions about drugs, promiscuity and strip clubs. I loved the whole thing from start to finish! Can't wait to see it again.",
         "You can feel how the story portrays something real, unlike the superficial world we all pretend to play in. Although the people around her seem to be in control of their lives, thus knowing best; no one there is even close to noticing what is really going on right in front of them; yet the main character breaks these bounds. Judging anything, to include this movie one should be careful not to fall into the same trap as the majority of the people in script, because everything is valid, and we must look deep inside where we are not comfortable and see the real beauty in front of us. Dianna Argon played her role in this movie wonderfully, always in tune with what I believe the director had intended. A promising career no doubt.",
         "I wanted to like Bare, Diana Agron and Paz De la Huerta are amazing actors, but this type of story has been done to death. Spoilers ahead. Young inexperienced girl meets worldly girl, and tries new exciting things, only to find the new things are not all that she thought they were. We've seen that story many times, I can think of two others, one also with Paz De la Huerta, but there are many more of course. The best thing about it was Diana Agron and Paz De la Huerta kissing. However, the film in its entirety didn't have anything new to offer the film world, and was pretty boring, even for a \"serious drama.\" It was a waste of their talent, but was good for them to get some experience acting in a drama I suppose.",
         "3 of the stars are for the boobs. 1 for a obviously nice piece of camera-work etc. Some of it was quite beautiful to watch, even the boob-free scenes. Movies that are painfully slow like this one need to have a interesting story to make it work or some mystery, we need some tension or passion. Sadly this one has none. Part of the reason has to do with the cast that is far from Oscarworthy. It's more of a romcom/Abcfamily cast. This little town of mine-movies grow like weed, not unlike most genres, but to some extent they are much harder to make good, in my opinion."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Purple Milk",
         "Indion Entertainment Group"
      ],
      "summaries": ["A young girl in Nevada becomes romantically involved with a female drifter who introduces her to a life of stripping, drugs, and metaphysical experiences that teach her what happens when real life catches up with dark fantasy."],
      "budget": 0
   },
   "movielensId": 146212,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-10-30",
      "dvdReleaseDate": null,
      "directors": ["Natalia Leite"],
      "runtime": 91,
      "movieId": 146212,
      "title": "Bare",
      "mpaa": "",
      "actors": [
         "Dianna Agron",
         "Paz de la Huerta",
         "Louisa Krause",
         "Chris Zylka",
         "Mary Price Moore",
         "Dave Colon",
         "Lora Martinez-Cunningham",
         "Alexandra Roxo",
         "Travis Hammer",
         "Kelley Lewallen",
         "Robyn Reede"
      ],
      "imdbMovieId": "3741316",
      "originalTitle": "Bare",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "VSqadj05bJE",
         "x8p5RhFZTm0"
      ],
      "plotSummary": "A young woman's friendship with a drug-dealing drifter evolves into a lesbian romance.",
      "tmdbMovieId": 333091,
      "avgRating": 2.5,
      "releaseYear": "2015",
      "numRatings": 13,
      "posterPath": "/zF5B84Jjdc9WiCfNkdKCz7CtS6z.jpg"
   }
}