{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "homosexuality",
         "id": 10180
      }],
      "imdb_id": "tt3997238",
      "video": false,
      "title": "Do I Sound Gay?",
      "recommendations": [
         365447,
         85642,
         85637,
         212843,
         51486,
         116167,
         384573,
         295799
      ],
      "backdrop_path": "/cJXz6RGErZMhGQhCWLPbOsgNJQ9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5640d35ec3a36814fa0000a1",
               "name": "Michael Airington",
               "profile_path": null,
               "id": 1533603,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5640d367c3a36814ee00008d",
               "name": "Margaret Cho",
               "profile_path": "/3DUdtidVGm8FFfknl6HfBMBf366.jpg",
               "id": 11152,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5640d37092514176b5000097",
               "name": "Tim Gunn",
               "profile_path": "/tmOpRUujJQB7SbWsLz4fPKjcPU3.jpg",
               "id": 1218645,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5640d37b92514176ba0000b9",
               "name": "Jeff Hiller",
               "profile_path": "/xqQjqDiiJwzgLnvNJLyRPyKYrod.jpg",
               "id": 143236,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5640d387c3a36814ee000093",
               "name": "Dan Savage",
               "profile_path": "/bbaL3tNO4LOPnkZhVJRoObXb6iU.jpg",
               "id": 307695,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5640d393c3a36815020000b0",
               "name": "David Sedaris",
               "profile_path": "/6UEaIjdYEM0zYwTYuXvzzHBxWwJ.jpg",
               "id": 1006016,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5640d39d92514176c70000b7",
               "name": "George Takei",
               "profile_path": "/5eBSvAPy6DnWsMX61IlJyjUzCRJ.jpg",
               "id": 1752,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5640d3a7c3a36814e70000af",
               "name": "David Thorpe",
               "profile_path": null,
               "id": 1421897,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54cea1c89251415fb3004e02",
               "name": "David Thorpe",
               "profile_path": null,
               "id": 1421897,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5aa5ed1e9251415e3c001568",
               "name": "Matt Bockelman",
               "profile_path": null,
               "id": 1533604,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.963301,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 288301,
      "vote_count": 23,
      "budget": 0,
      "overview": "Is there such a thing as a \"gay voice\"? Why do some people sound gay but not others? Why is sounding gay beloved in pop culture, from Liberace to Modern Family, but also a trigger for bullying and harassment? The feature documentary  Do I Sound Gay?",
      "similar": [
         184352,
         126331,
         380874,
         26933,
         47643,
         258034,
         160165,
         449176,
         340684,
         383526,
         52799,
         413666,
         376867,
         258480,
         31225,
         26280,
         338189,
         1966,
         9800,
         1213
      ],
      "original_title": "Do I Sound Gay?",
      "runtime": 77,
      "poster_path": "/iSAWIvdBvpDz6Txy470sweCVIj4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-07-10",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.doisoundgay.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Thorpe"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "David Thorpe",
         "Maeve O'Boyle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3997238/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNDQ2MzAzNzYzMV5BMl5BanBnXkFtZTgwODc3OTU5NTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "David Thorpe",
         "George Takei",
         "Tim Gunn"
      ],
      "reviews": [
         "In order to get it out of the way I should first begin with a declaration. David Thorpe is a distant relative which is how I got directed to Do I Sound Gay? The film, by the first-time director, premiered yesterday at the Toronto International Film Festival as part of its Mavericks program. It was scheduled for the coveted first weekend which is indicative of TIFF's high opinion of the feature. The film was funded via a Kickstarter campaign as recently as this spring. Following a break-up with his boyfriend, David Thorpe loses some self-confidence, which translates into worrying more about sounding gay. Was this one of the causes of the breakup? We do not know. In the course of some ninety minutes he recruits voice coaches, linguists, class-mates, celebrities, family and even gay passers-by to both explore the topic and perhaps find assurance and solace in the experience of others. The film is half autobiography half documentary. It explores the gay vocal sound in the context of society in general and the entertainment industry in particular. Incidentally, as far as documentaries go Do I Sound Gay? is more Roger & Me and less The Grace Lee Project. The director is on camera for most of the film as opposed to behind it. The subject matter is clearly more upsetting to the writer-director than he cares to explicitly admit. This is inferred amidst the abundant comedy, jovial remarks and celebrity interviews. Nevertheless, there are quite a few moments of hilarity and laugh-out-loud scenes peppered throughout the film. One sees Thorpe's cats, Bruno (oh, come on!) and Rocket, Hello Kitty merchandise in his apartment and stereotyped gay humour displayed. Then there are classic Hollywood vignettes depicted as not so subtle gay scenes. Family members and old friends recall a young David and their impressions before we find out that Thorpe had a liberating coming out during his first year of college. There are many funny or heartwarming bits; alas by necessity serious instances are also present as with the teenager who was bullied and beaten up at school for sounding and being gay. As mentioned the subject matter was prompted following a breakup with a boyfriend, but does the film provide for a seamless or convincing segue from this point unto the theme's exploration? Not really, as the subject takes a valid and independent life of its own. The breakup and the boyfriend may be personally relevant to the film maker, but not so content or audience-wise. How it translates to attention to the gay voice is personal to the man. Being single and alone in his 40s manifests as piling onto an existing feeling of inferiority. With the opening assumption being the notion that a \"gay voice\" is negative and contributes to the existing self-conscious nature of the man, Thorpe begins meeting with and practicing with coaches and recordings to become less gay sounding identified as accentuated s's, higher pitches, elongated enunciations, et cetra. At some point one coach offers that leaders go high with the first syllable of a word before dropping lower. Thorpe is seen exercising his voice throughout the film all the while discussing the same with the aforementioned. Speaking of which, celebrities such as comedienne Margaret Cho, CNN reporter and anchor Don Lemon, columnist Dan Savage and actor-cum-activist George Takei are several of the names on camera. In the subsequent Q&A at the premiere someone wondered if there were gay celebrities who were contacted and did not respond. CNN's Anderson Cooper was brought up as an enquiry before Dan Savage light-heartedly interjected with a \"Tom Cruise never called you back,\" which had the audience laughing. For the record, Thorpe was polite/adamant that he does not remember anyone being non-responsive, but assumes anyone who might not have called him back was probably too busy or likely had not received his message. So, per Do I Sound Gay?, is there a gay voice? Yes and no. It is not an absolute indicator and exceptions and extremes exist. The film does not deny its existence. However, as Thorpe and the film progress in their exploration they conclude that the voice, sound and enunciation should not be matters for anxiety. With the increased self-confidence comes the message that the sound comes from within. One is who he is and one's body is he as well. Why be uncomfortable with it? The point was emphasized at the panel as well. In fact, Thorpe plainly called the title a political slogan. The gay voice is not a negative! The hunt and the laughter in the film made for an entertaining and simultaneously informative viewing. Several personal points may be of interest. First, it is good to live in a world where homophobia (this word or the words 'homosexual' and 'heterosexual' are curiously shut out from the film) has been pushed back to some extent and film makers can move on to more nuanced topics and considerations. The world (here anyway) has somewhat moved forward from closeted difficulty. Secondly, and personally, it is hoped that gay voices rise to defend and support other oppressed or suppressed minorities. We are all devalued when we only care inwardly. Gay voices for Palestine, Aboriginals supporting Ukraine, Muslims for LGBT, ALS spouses for cancer patients, et cetra et cetra et cetra are mere examples of how we would build a beautiful world. These may require teaming up with members of the affected communities to give them voices and leverage their intimate knowledge of the subject, but it is even more precious when communities with no personal stake stand up for others.",
         "The film explores the whole issue of identity although it focuses on how someone speaks. The way we speak, whether with southern or British or Boston or bland newscaster accent or gay intonations, does have practical implications. Should it matter? Probably not, but we don't live in an idealistic world. Obviously it will matter in a negative way a whole lot if you're a high school student in Beaver Dump Idaho, whereas if you live in the Village in NY and work in a gallery it may be both acceptable and an asset to sound gay-ly intellectual. Should a Black man from the south be ashamed of sounding like a Black man from the south? Of course not. But if he wants to get a job as an announcer on CNN and stand a realistic chance of rising in the ranks, he'll probably have to modify the way he sounds. We each have to decide what matter most to us and whether changing something about ourselves really matters. But this website isn't really about the validity of the supposed issue being addressed, but about how it's been presented. In this case, I think it was handled superbly. The issue is addressed honestly in terms of influences in childhood, celebrities who we've regarded as exemplifying all the stereotypical behaviors of gay men or situational experiences that we've lived through ... not solely in terms of speech, but in the whole constellation of behaviors that define us and those that will likely elicit certain reactions from those around us. By the end of the film we can see that the issue of how we sound is simply one aspect of our identity, both as we think of ourselves and how others may think of us. Is our reasoning behind wanting to change idealistic, realistic or symptomatic of something deeper? Some people are certain that plastic surgery or a hair piece will transform them into something they are not. Maybe cosmetic changes will increase our sense of self-esteem. Maybe we'll realize that superficialities are meaningless and that we're grasping at straws. I think this film explored the whole issue of self-identity very well in terms of the influences, both internal and external, and the need for each of us to come to terms with who we are and what really matters. Well worth watching to better understand ourselves and what things we focus on that are irrelevant to who we really are.",
         "When we hear someone speak, instantly biases start to form. This person sounds old/young, educated/uneducated, local/foreign, male/female, urban/rural, etc. While this documentary is not the best material for discussing the topic, it does focus on one mostly untouched topics in the gay community. How a specific nasal speech pattern has become coding for gay in the U.S. We start the documentary with David, a man in his forties who recently ended a relationship with his boyfriend. One thing that has been bugging him is the way he sounds. The elongation of vowels, nasality, and crispness of diction that make up a gay stereotype that has endured for decades. The film covers some interesting topics like discrimination against men perceived as effeminate, a possible origin of the gay accent, and the deconstruction and progression of David's voice as he continues speech therapy. However, this would be much better at half it's length. This film has a fair bit of star power behind it, but most of the celebrity cameos drag the pacing and should have been cut. The film loses focus at times. If the topic of the film doesn't sound interesting to you, give it a pass. Otherwise, rent it/stream it. As of this review being posted, it's on Netflix."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Impact Partners",
         "Little Punk",
         "ThinkThorpe"
      ],
      "summaries": [
         "Approaching middle age, David Thorpe, South Carolina born and bred but who has lived most of his adult life in New York City, laments his single gay status at this stage in his life. In his self-critical view, he blames that single status partly on what he considers his stereotypical gay sounding voice, something that he himself does not like and believes that most gay men do not like in others in wanting partners who are more masculine sounding. David goes to vocal coaches/speech therapists to help him transform his voice into what he considers that more standard sounding nondescript male voice. Concurrently, he speaks to gay celebrities about their voice and what if anything they did to it, and to historians and other experts about how the gay voice came into being, its history and if there is any thought to it being biologically inherent to gay men, or if it truly is a product of environment. He also talks to long time friends and family members about his own gay voice, which may have emerged on a more conscious level than he would have initially thought. Through the entire process, David comes to some conclusions about that voice which may also surprise him.",
         "A documentary about the stereotype of the gay voice."
      ],
      "budget": 0
   },
   "movielensId": 146279,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-07-10",
      "dvdReleaseDate": null,
      "directors": ["David Thorpe"],
      "runtime": 77,
      "movieId": 146279,
      "title": "Do I Sound Gay?",
      "mpaa": "",
      "actors": [
         "Michael Airington",
         "Margaret Cho",
         "Tim Gunn",
         "Jeff Hiller",
         "Dan Savage",
         "David Sedaris",
         "George Takei",
         "David Thorpe"
      ],
      "imdbMovieId": "3997238",
      "originalTitle": "Do I Sound Gay?",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["qAcgicU_upo"],
      "plotSummary": "Is there such a thing as a \"gay voice\"? Why do some people sound gay but not others? Why is sounding gay beloved in pop culture, from Liberace to Modern Family, but also a trigger for bullying and harassment? The feature documentary  Do I Sound Gay?",
      "tmdbMovieId": 288301,
      "avgRating": 2.9697,
      "releaseYear": "2014",
      "numRatings": 33,
      "posterPath": "/iSAWIvdBvpDz6Txy470sweCVIj4.jpg"
   }
}