{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0252277",
      "video": false,
      "title": "Bicchoo",
      "recommendations": [
         276846,
         46418,
         166253,
         46430,
         115124,
         49518,
         165979,
         252521,
         317781,
         297213,
         277751,
         51728,
         400267,
         170838,
         81782,
         166260,
         25511,
         161442,
         361154,
         157800
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [],
      "popularity": 0.400298,
      "production_countries": [],
      "id": 232496,
      "vote_count": 7,
      "budget": 0,
      "overview": "Jeeva is a small-time criminal leading the life of a nonentity. ...",
      "similar": [],
      "original_title": "Bicchoo",
      "runtime": null,
      "poster_path": "/lYT1mGghQNu3MWsLFyyXVQ8sOPl.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-07-06",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Guddu Dhanoa"],
      "runtime": 160,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0252277/",
      "coverLink": null,
      "actors": [
         "Bobby Deol",
         "Rani Mukerji",
         "Ashish Vidyarthi"
      ],
      "reviews": [
         "Professional assassin Jeeva (Bobbby Deol)relunctantly \"babysits\" Kiran (Rani Mukherji) who is a witness to her entire family's murder by a druglord (Ashish Vidyarthi). Unsurprisingly,he falls in love with her while under his wing. Story-line is copied from Leon (the professional).Songs have been juxtaposed together without any relevance to the film.RM tries very hard thereby being irritating in a tomboy(tapori)role.Ashish brings a certain menance to his role. BD is at his best in the action scenes which along with the camerawork are the only saving grace for this film which lacks a sting!",
         "In my view this is one of Bobby Deol's best. This is different from regular Indian movies, which are usually long, dull, and predictable. Bichhoo is different, and even though it is a copy of Leon the Professional, it is great for an Indian movie. The story doesn't go soft and dry, the songs are not much of a disturbance to the pace, and Bobby Deol is believable as a tough-as-nails, battle-hardened, cold-blooded hero for hire! I didn't like his anti-cursing and anti-smoking attitude though, that was not realistic, not to mention his drinking milk like a good little boy, while he kills people for a living, was a bit out of place, oh well, this is an Indian movie after-all. The opening song with Hansraj Hans was a nice touch. It was a remake of Luc Besson's movie called Leon:the professional acted by jean reno & Natalie Portman.",
         "This Bollywood remake of Luc Bessons Leon was surprisingly good. I'm quite new to Bollywood films and didn't know what to expect. I chose a remake first so I could test the water a bit. I was quite surprised. Its no where near as good as the original but still its a really enjoyable action movie. I had a bit of culture shock at first due to the amount of singing, but soon I began to enjoy that too. Its quite a stylish film as well and is not just a straight remake, although for the most part its sticks closely to the original. The performances are great and the action scenes all work quite well as well. We are also given more background on the Leon characters past. Something the original didn't have. If you've never seen a Bollywood film before you could do a lot worse than see this...",
         "Thats all requested to actors/actresses, entire thing is copied.. Do appreciate others hard work,, this is reason WORLD blames GREEDY/MONEY BEGGARS like you.. thanks.",
         "Guddu Dhanoa has rarely given great work but yet he made some good action films with cousin Sunny Deol, then he moved to Bobby. Bichhoo is a remake of Leon The Professional only the small child's part is replaced by the grown up Rani who acts like a kid(LOL) The film starts off well though Bobby's flashback is okay The shootout scene is well shot, but the revenge angle is soon sidelined and focus shifts to romance between Bobby,Rani which hardly works The revenge angle is shown much later in the film, the climax(mostly copied) is decent Direction is okay Music is decent, Jeevan Main is superb, other songs too are good Bobby Deol goes through his work well though at times he does get monotonous, Rani Mukherjee however irritates like in those days, surprisingly she paired with Bobby in 2 films that year, BADAL and Bichoo and both worked reasonably Ashish Vidhyarthi is good in his role, Sachin Khedekar has a brief role and is okay, Dolly Bindra is loud, Ishrat Ali too is loud Malaika Arora has a brief role and she doesn't impress, rest are okay",
         "In my view this is one of Bobby Deol's best. This is different from regular Indian movies, which are usually long, dull, and predictable. Bichhoo is different, and even though it is a copy of Leon the Professional, it is great for an Indian movie. The story doesn't go soft and dry, the songs are not much of a disturbance to the pace, and Bobby Deol is believable as a tough-as-nails, battle-hardened, cold-blooded hero for hire! I didn't like his anti-cursing and anti-smoking attitude though, that was not realistic, not to mention his drinking milk like a good little boy, while he kills people for a living, was a bit out of place, oh well, this is an Indian movie afterall. The opening song with Hansraj Hans was a nice touch. Overall 9/10.",
         "If you didn't know this is a Bollywood version of Luc Besson's groundbreaking action film 'The Professional' AKA 'Leon The Professional.' Second, I don't speak a word of Hindu and I saw this film WITHOUT SUBTITLES. But still I was able to figure out what was going on. This proves that the powerful story transcends language. Plot wise many scenes are literally identical to the original. Even the angles of the cameras and the mannerisms of the actors. They even keep some of the same lines, in English! If you think Leon looked weird walking around New York carrying a potted plant and two cartons of milk, wait until you see Jeeva walking around India like that. What's different? We for one thing, Leon/Jeeva is given a back story as to how he became a killer. Jeeva worked at a (presumably bootleg) CD store until his girlfriend's overly protective father had Jeeva's mother evicted and disgraced in her community causing her to be stoned and buried to death by her neighbors. (What was that about good fences making good neighbors?) Horrified by her father's actions Jeeva's girlfriend drives off a cliff. (or maybe she was just a typical Indian driver.) Hence a vengeful Jeeva murders him and turns to a life of crime. The other key difference is that Gary Oldman's character is a politician of some type running with the campaign slogan in English, \"No do drugs!\" Seriously I'm not joking. Of course 'Bichhoo' must follow the Bollywood rules of being 3:00 hours long! And being a musical. That's right. About every 20 minutes the characters all break out in very very elaborate song and dance scenes where hundreds of people are dancing in the streets. These dance scenes aren't cheesy. Seriously, Jeeva really can sing and dance. Take that Jean Reno. What these songs are about is pretty obvious. They're mostly about Matilda/Kiran's crush on Leon/Jeeva. Another song features Jeeva's girlfriend singing, \"I love you.\" to him in English. The opening song features a billboard which reads in English, \"No Drugs, No War.\" Fair enough but I never really thought of 'The Professional' as an anti drug pacifist film. Why doesn't Leon save the ozone while he's at it? Hands down this is must see!!! Seriously, I enjoyed every second of it!",
         "Bichhoo,which stars Bobby Deol,and Rani Mukerjee is a great action film,and is very easy to follow: Kiran:(Rani),is a smoking,tatooed problem child that loses her family from narcotics,or druglord Devarag,and is alone by herself. Jeeva:(Bobby),is a quiet man that lost his mom,and sisters,as well as his girlfriend (Malaika Arora Kahn). He takes care of her,and makes sure that they both get revenge,but learn to fall in love again after major losses. The songs in this movie stay into your head,like the best song of the movie \"Jeevan Mein Jaane Jaana\",or the other two standouts \"Pyaar Tu\",and \"Ekeware Takale\". This movie is re-windable,and fun for others that have no idea about India,to make them sit down and watch. Songs ------- 1.Dil Dote Dote 2.Ekeware Takale 3.Jeevan Mein Jaane Jaana 4.Pyar Din No Jaaye 5.Pyaar Tu,Dil Tu 6.Action beat instrumental 7.Slow instrumental",
         "Bichhoo is the story of Jeeva (Bobby Deol) a smalltime criminal leading the life of a nonentity. His per chant for solitude is an outcome of his troubled past. The fresh breath of life is the bubbly girl next door. Kiran Bali (Rani Mukherjee). While Kiran overtly tries to befriend Jeeva, the latter does not pay much heed to her advances. Till a gang of baddies (Ashish Vidyarthi and company) kills Kiran's family. Kiran wants the criminals punished, but she looses the legal battle and the criminals are set free. Jeeva feels sorry for Kiran and before you know, he's fallen in love with her. From here on it is operation revenge for the two. Jeeva trains Kiran in handling weapons and warfare. In the final showdown, Jeeva will sacrifice his life to save Kiran's life."
      ],
      "genres": [
         "Thriller",
         "Action",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": [
         "Bollywood musical remake of Luc Besson's groundbreaking 'The Professional.' Jeeva is India's deadliest assassin. He never had a reason to care until now. Kiran is a troubled teenage girl orphaned by corrupt killer cops. Jeeva must protect Kiran and avenge the murder of her family even if it means going to war with the entire city.",
         "Jeeva's mysterious past, which results in the death of his family members, leads him to take up life as a cold-blooded criminal. Jeeva usually receives contracts and kills for the right amount. He moves into an apartment and gets acquainted with the girl next door named Kiran Bali. One day both of them witness the brutal murder of the entire Bali family. Kiran is the sole survivor. Upon telephoning the police to register FIR for the murders, she comes to realize that the police are also involved in the murder of her family. With no one to turn to, Kiran takes up residence with Jeeva. Watch what transpires when the people who assassinated Kiran's family offer Jeeva a contract to kill Kiran and Jeeva himself begins to fall in love with her.",
         "A contract killer with a tragic past trains a teenage girl to avenge the murder of her family and falls for her in the process."
      ],
      "budget": 0
   },
   "movielensId": 146398,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-07-06",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 146398,
      "title": "Bicchoo",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0252277",
      "originalTitle": "Bicchoo",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Jeeva is a small-time criminal leading the life of a nonentity. ...",
      "tmdbMovieId": 232496,
      "avgRating": 1.75,
      "releaseYear": "2000",
      "numRatings": 2,
      "posterPath": "/lYT1mGghQNu3MWsLFyyXVQ8sOPl.jpg"
   }
}