{
   "tmdb": {
      "original_language": "el",
      "keywords": [{
         "name": "jail",
         "id": 9890
      }],
      "imdb_id": "tt1332125",
      "video": false,
      "title": "Strella",
      "recommendations": [
         47097,
         288526,
         163791,
         47118,
         301494,
         288870,
         297560,
         47017,
         234961,
         35396,
         24223,
         173421,
         164827,
         47778,
         45715,
         16513,
         267993,
         47247,
         47713,
         147330
      ],
      "backdrop_path": "/dc6ipopBvQetqXgVJbbfgHCQWdQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1007,
               "character": "Strella",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814865f",
               "name": "Mina Orfanou",
               "profile_path": null,
               "id": 1092429,
               "order": 0
            },
            {
               "cast_id": 1008,
               "character": "Yiorgos",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148663",
               "name": "Yannis Kokiasmenos",
               "profile_path": null,
               "id": 1092405,
               "order": 1
            },
            {
               "cast_id": 1009,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148667",
               "name": "Minos Theoharis",
               "profile_path": null,
               "id": 1092406,
               "order": 2
            },
            {
               "cast_id": 1010,
               "character": "Curious resident",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814866b",
               "name": "Tasos Antoniou",
               "profile_path": null,
               "id": 1092430,
               "order": 3
            },
            {
               "cast_id": 1011,
               "character": "Wilma",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814866f",
               "name": "Akis Ioannou",
               "profile_path": null,
               "id": 1092431,
               "order": 4
            },
            {
               "cast_id": 1012,
               "character": "Nikos",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148673",
               "name": "Argyris Kavvidas",
               "profile_path": null,
               "id": 1092437,
               "order": 5
            },
            {
               "cast_id": 1013,
               "character": "Kolokousis",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148677",
               "name": "Christos Mazis",
               "profile_path": null,
               "id": 1092438,
               "order": 6
            },
            {
               "cast_id": 1014,
               "character": "Antonis",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814867b",
               "name": "Konstadinos Siradakis",
               "profile_path": null,
               "id": 1092439,
               "order": 7
            },
            {
               "cast_id": 1015,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814867f",
               "name": "Betty Vakalidou",
               "profile_path": null,
               "id": 1092440,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148637",
               "name": "Panos H. Koutras",
               "profile_path": null,
               "id": 563700,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814863d",
               "name": "Panajotis Evangelidis",
               "profile_path": null,
               "id": 1092421,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148643",
               "name": "Panos H. Koutras",
               "profile_path": null,
               "id": 563700,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148649",
               "name": "Panos H. Koutras",
               "profile_path": null,
               "id": 563700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814864f",
               "name": "Michalis Delta",
               "profile_path": null,
               "id": 1092426,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f8148655",
               "name": "Olympia Mytilinaiou",
               "profile_path": null,
               "id": 1092427,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cac3a36847f814865b",
               "name": "Giannis Halkiadakis",
               "profile_path": null,
               "id": 1092428,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.278739,
      "production_countries": [{
         "iso_3166_1": "GR",
         "name": "Greece"
      }],
      "id": 50535,
      "vote_count": 14,
      "budget": 0,
      "overview": "George is released from prison after 14 years of incarceration for a murder he committed in his small Greek village. He spends his first night out in a cheap downtown hotel in Athens. There he meets Strella, a young transsexual prostitute. They spend the night together and soon they fall in love. But the past is catching up with George. With Strella on his side he will have to find a new way out.",
      "similar": [
         1574,
         73,
         497,
         596,
         8952,
         68812,
         33273,
         9702,
         47931,
         21355,
         13199,
         20771,
         14615,
         28110,
         15697,
         206324,
         43600,
         38234,
         15255,
         43002
      ],
      "original_title": "Στρέλλα",
      "runtime": 111,
      "poster_path": "/ryHZvEad9K3WecWe4E0s7LZajZC.jpg",
      "spoken_languages": [{
         "name": "ελληνικά",
         "iso_639_1": "el"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Greek Film Center",
         "id": 7254,
         "origin_country": ""
      }],
      "release_date": "2009-02-10",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Greece",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Panos H. Koutras"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Panagiotis Evangelidis",
         "Panos H. Koutras"
      ],
      "originalLanguage": "Greek",
      "imdbLink": "http://www.imdb.com/title/tt1332125/",
      "coverLink": null,
      "actors": [
         "Mina Orfanou",
         "Yannis Kokiasmenos",
         "Minos Theoharis"
      ],
      "reviews": [
         "I never expected to see a movie in Greece about a transsexual, let alone one that was played by a real transsexual woman. That alone would have been a big deal for me. Thankfully though, there is definitely more to it. This is not a movie about being trans-gendered (or about being an ex convict for that matter), this is a movie about people seeking love in any form, about people trying to make a new start, re-defining themselves and their lives and living not according to stereotypes or social rules and notions as to what \"is\" right and wrong, but according to their own morality and their sense of what \"feels\" right and wrong. I loved the direct manner in which the \"trans\" issue was tackled with, I was taken with the tenderness of the love story - and of course there is that one nude scene that was really moving, honest, courageous, and magical at once. Granted, the plot twist did make me cringe a little bit, it felt somewhat \"out there\" and at this one instance I was like \"this is at the verge of soapiness\" but fortunately, it did not cross that line and the ending really did it for me after all. It is not a masterpiece, but it is a good movie, one that stands out from the bunch. Plus, Mina Orfanou is really good, especially considering she is an amateur, she captures the whole essence of the character with her performance, being charming, loving, rough and frustrated all at once.",
         "I had the honour to see that movie at it's world premiere at the Berlin International Film Festival. This surprising story of a man coming out of jail and falling in love with a transsexual is excellently written and surprisingly well played. Nearly all the actors are amateurs, but who needs trained actor with a cast like that: Especially Mina Orfanou in the role of 'Strella' is a revelation. Panos Koutras finds a way to tell a complicated story and to keep the audience interested in the main characters without following paths of Pedro Almodovar, though both have the wicked humor in common and both obviously love a good melodramatic story line every now and then. And he knows how to end a story, something that isn't often seen in queer movies nowadays. I sincerely hope 'Strella' will find a broader audience as it is clever and entertaining.",
         "despite the fact that the film caused a huge commotion in it's native country shocking the puritans, right wing bigots into a fury, Strella is not at all a shocking film. It's not a \"film by an oppressed director trying to glorify his sexuality\" but rather, a bold statement about love, family and about \"normal\" not existing anymore (if it ever was). The only shocking thing about it is how low key it is, creating a loving picture out of characters and a social milieu that has often been the subject of cinematic exploitation, or ridicule. Coutras makes magic out of the simplest materials and his two main actors perform with astounding truth a story that can only be shocking or insulting to narrow minded, hateful people. Nevertheless, the film does get a strong social, sexual, political point through, but it's not one of anger, or hate, but one of love and acceptance. and that unfortunately, is still too much for some to take...",
         "This is the first Greek film I've had the privilege of watching. It is also the best film I've watched this year. For me the film is about families, and how we cope when we find ourselves outside of traditional structures (of course there probably never was such a thing as a traditional family). Although many of the films characters are LGBT I would not describe this as being an LGBT film. The characters may be gay or trans, but it is simply a facet of them, mentioned in passing, and not their core identity. There is a big twist in the middle, and my initial reaction on seeing it was that it really spoilt the film. However, 10 minutes later to my surprise there was another twist which pulled everything back perfectly. Not many screenwriters can manage to pull off something as complex as that. Mina Orfanu is wonderfully cast as Strella. This is not an easy part to play and she carries it off with great alacrity, despite not being a professional actress. It is a great achievement that, despite the sometimes extremely dark subject matter I left this film with a big grin. If only Hollywood would make films like this!",
         "This is the story of Giorgos, an ex-convict who has spent more than fifteen years in prison, sentenced for a crime of honor, and Strella, a transsexual call girl. The opening scene, as Giorgos kisses good-bye his cellmate, is when the viewer is prepared for macho-looking Giorgos' sexual orientations or –if you want- his upcoming \"tolerance\" to the fact that Strella is not a common girl. Giorgos wouldn't possibly react the way Fergus reacted in Neil Jordan's \"Crying Game\". As Giorgos is set free to \"live his myth\" in the dirty city, walking among the human and the urban garbage, one can smell the urine in the narrow mean streets, downtown Athens. Soon, as Giorgos attempts to find more about the whereabouts of his long lost son, one suspects that the film is intended to be a modern version of a Greek tragedy, except it will not be, because Strella knows better! Fortunately, \"deus ex machina\" will not be required. Humans ought to deal with their issues by themselves, this time. The supporting characters are never becoming grotesque despite the fact that they are queer and that Death is flirting with them throughout the film. Even Strella's impersonation of Maria Callas in its falseness has a bizarre dignity and proves to be a successful tightrope walking mainly –in my opinion- because it has nothing in common and at any time with any of the Almodόvar's transvestite characters. All in all, \"Strella\" is a worth seeing film and one of those every so often moments the Greek cinematography surprises pleasantly.",
         "I think it is a great movie and a very important piece in Greek cinematography and not only Greek, in the global context as well. The way the movie ends is also very important towards creating a better climate and alternative solutions for trans gender people. It breaks the usual pattern of ends that are common to the movies related with LGBTQI people, and I think it's very healthy. A lot of familiar faces, the stars of Koukles, Yannis Kokiasmenos' and Mina Orfanou's acting was a blast! Good luck to the director, the crew and actors, hope to see more great movies made by them. Big thanks! And p.s. to the puritan who says he is not one:)there is something more important than the so called hubris, and that is what they wanted to portray, I guess.",
         "Strella was one of the two Greek films people would propose me to see this winter (the other being \"Kynodontas\"). Unfortunately I missed the second, but I had the opportunity to see this one and I have to say that, unlike my rather low expectations, it finally came out to be a very interesting film, actually more than other very highly discussed and budgeted Greek films. The good things about it?.. I guess it's because you never get bored through the film and there is always something in the plot to make it interesting. Then, it's the fact that it's very human. No one is characterized by what he / she does or who he / she is. A prison convict is just a person and so is a transsexual. I am happy with the fact that the film emphasizes on feelings and not on stereotypes. This makes it present a difficult subject in an easy way for the viewer,without being melodramatic or superficial either. My highlights are the squirrel scenes (fantastic idea!) plus the performance of Mina Orphanou - she is unbelievably good let alone for a non trained actor! So, I would highly suggest people to see this even if they have hesitations...",
         "First of all i would like to say that i had heard about this movie since it came out . It was a movie that made noise and didn't pass unnoticed. I didn't have the opportunity to watch this movie back then, but never is too late. Recently i was discussing with a friend about movies we didn't like and he mentioned that he didn't enjoy this movie because of the plot twist. I found interesting though and out of the usual. So i gave it a shot and i have to say that i liked this movie. I have watched too many movies and i thought i had seen everything. I was wrong. This movie is not perfect but it's closed to be called perfect. It's not boring but it's also not a drama. I would characterized it as a social movie with a social impact. All in all, 9/10.",
         "I'm not conservative, I'm not a puritan, I'm tolerant and liberal, but I do have some limits and this film surpassed them. I want to emphasize I do not mean the transsexual theme, which is absolutely fine, after all I did enjoy The Crying Game. I mean the twist in the plot, which I do not want to reveal for those who haven't seen the movie but it did make a very bad impression to me. This was WAY too much and spoiled my movie experience. This was bordering sickness. I can't believe such a sick twist was airbrushed in all the reviews I happened to read about this movie. And for what is worth, I also enjoyed Oldboy. Anyway, art is art, but be prepared. For me only redeeming aspects if you manage to take the scenario out of the picture is Mina Orfanou's performance and the competent direction."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "100% Synthetic Films",
         "Greek Film Center"
      ],
      "summaries": ["George is released from prison after 14 years of incarceration for a murder he committed in his small Greek village. He spends his first night out in a cheap downtown hotel in Athens. There he meets Strella, a young transsexual prostitute. They spend the night together and soon they fall in love. But the past is catching up with George. With Strella on his side he will have to find a new way out."],
      "budget": 0
   },
   "movielensId": 146317,
   "movielens": {
      "languages": ["ελληνικά"],
      "releaseDate": "2009-02-10",
      "dvdReleaseDate": null,
      "directors": ["Panos H. Koutras"],
      "runtime": 111,
      "movieId": 146317,
      "title": "Strella",
      "mpaa": null,
      "actors": [
         "Mina Orfanou",
         "Yannis Kokiasmenos",
         "Minos Theoharis",
         "Tasos Antoniou",
         "Akis Ioannou",
         "Argyris Kavvidas",
         "Christos Mazis",
         "Konstadinos Siradakis",
         "Betty Vakalidou"
      ],
      "imdbMovieId": "1332125",
      "originalTitle": "Στρέλλα",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["bNP6IeO8cDw"],
      "plotSummary": "George is released from prison after 14 years of incarceration for a murder he committed in his small Greek village. He spends his first night out in a cheap downtown hotel in Athens. There he meets Strella, a young transsexual prostitute. They spend the night together and soon they fall in love. But the past is catching up with George. With Strella on his side he will have to find a new way out.",
      "tmdbMovieId": 50535,
      "avgRating": 3.2,
      "releaseYear": "2009",
      "numRatings": 15,
      "posterPath": "/ryHZvEad9K3WecWe4E0s7LZajZC.jpg"
   }
}