{
   "tmdb": {
      "original_language": "hi",
      "keywords": [],
      "imdb_id": "tt0250690",
      "video": false,
      "title": "Refugee",
      "recommendations": [
         210068,
         69632,
         309074,
         166027,
         60397,
         46403,
         109028,
         83902,
         84321,
         165402,
         25100,
         115124,
         348762,
         232817,
         232795,
         155973,
         159666,
         35687,
         165573,
         71257
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Refugee",
               "gender": 0,
               "credit_id": "52fe4c99c3a36847f82360bf",
               "name": "Abhishek Bachchan",
               "profile_path": "/1zKoM8rIRqs3vmO8bRIWhBeiurb.jpg",
               "id": 35793,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nazneen Ahmed",
               "gender": 1,
               "credit_id": "52fe4c99c3a36847f82360c3",
               "name": "Kareena Kapoor",
               "profile_path": "/kSDkGSPWTxvOYmnnNphB2eQcuv1.jpg",
               "id": 37233,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "BSF Officer Raghuvir Singh",
               "gender": 2,
               "credit_id": "530b22fac3a368420100575f",
               "name": "Jackie Shroff",
               "profile_path": "/nbKG1vfnWdSauxBtzzoctuJEpHe.jpg",
               "id": 86014,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ranger Mohammad Ashraf",
               "gender": 2,
               "credit_id": "530b230fc3a36841f000565e",
               "name": "Sunil Shetty",
               "profile_path": "/so2Xw9lVoyTo9HZr7NNpwyWm0M.jpg",
               "id": 85730,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Amina Mohammad",
               "gender": 1,
               "credit_id": "530b231ec3a36842080054f3",
               "name": "Reena Roy",
               "profile_path": "/rymLa28VHRxVYLwzA2TqnXQ4ME3.jpg",
               "id": 548827,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "530b2326c3a368421b0053c4",
               "name": "Sudesh Berry",
               "profile_path": "/AaJlSFAmFJpvMG2EDDzfoi6EYir.jpg",
               "id": 85459,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "530b232dc3a36841f6005600",
               "name": "Avtar Gill",
               "profile_path": "/roz3UqgIYaIFQJfISO9onZUovY4.jpg",
               "id": 140683,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "530b2334c3a3687b5700350f",
               "name": "Vrajesh Hirjee",
               "profile_path": "/qlM6UReIfWA46nGZymRw0vPhjVC.jpg",
               "id": 55070,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "530b233ec3a36841f0005661",
               "name": "Puneet Issar",
               "profile_path": "/80VUcevQFcU1pu0kq2QTjywRCMn.jpg",
               "id": 110144,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "530b234bc3a3687b57003513",
               "name": "Kulbhushan Kharbanda",
               "profile_path": "/1ECYLNlTHjgFzfGxbrzVSFZGDbN.jpg",
               "id": 53377,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "530b2354c3a36841f0005664",
               "name": "Anupam Kher",
               "profile_path": "/kgU5Ap1Kf9RnicB5DMcXEZqed2f.jpg",
               "id": 6217,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "530b2392c3a36848f3000ce4",
               "name": "Mukesh Tiwari",
               "profile_path": "/pmkOlgQzIwMy91yC2LRb9lVd9YV.jpg",
               "id": 86064,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "53454feb0e0a267bcd001b67",
               "name": "Ashish Vidhyarthi",
               "profile_path": "/iBUUpfHZIfpC5afHrHwcyGTHKQF.jpg",
               "id": 85684,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "530b22c8c3a368421b0053b6",
               "name": "J.P. Dutta",
               "profile_path": null,
               "id": 110148,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "530b22e1c3a368421b0053ba",
               "name": "J.P. Dutta",
               "profile_path": null,
               "id": 110148,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.501001,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 166231,
      "vote_count": 7,
      "budget": 0,
      "overview": "The films tells the story of an un-named Indian Muslim, who helps illegal refugees from both India and Pakistan to cross the border through the Great Rann of Kutch. The film is attributed to have been inspired by the short story \"Love Across the Salt Desert\" by Keki N. Daruwalla.",
      "similar": [],
      "original_title": "Refugee",
      "runtime": 207,
      "poster_path": "/m5N6HF9UpX4bRLzLtz03tWjBAFf.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "2000-06-30",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A human story",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["J.P. Dutta"],
      "runtime": 207,
      "synopsis": null,
      "writers": [
         "J.P. Dutta",
         "J.P. Dutta"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0250690/",
      "coverLink": null,
      "actors": [
         "Jackie Shroff",
         "Sunil Shetty",
         "Abhishek Bachchan"
      ],
      "reviews": [
         "REFUGEE is \"A Human Story\", according to the tag-line. More specifically, it's about a guy called \"Refugee\" who lives in a village on the Indo-Pakistan border, and helps Muslim refugees from Bangladesh to cross over to Pakistan where they hope they will have a better chance of a life free from oppression. The first such group that we see him transport across the desert consists of two families, one of whom is eventually revealed to be Kareena Kapoor under her veil. He takes a bit of a shine to her, and she to him. Love blossoms, and it is will do in these circumstances. The family settle in a village on the Pakistan side of the border, and they meet up with Refugee whenever he makes the trip across. But crossing the border is not a terribly safe activity, especially with Jackie Shroff guarding the Indian side and Sunil Shetty guarding the Pakistan side. One might expect that Refugee would encounter trouble with the law making these trips on a regular basis, and indeed the guards are soon on his case. But the law turns out to be amongst the least of his worries in the harsh and extreme desert living conditions where war and hardship are a way of life. REFUGEE is a movie of two halves, or possibly three thirds. We open up with an hour or so of character development as the romance between Refugee and Naaz grows, and we learn more of the families and others in the village. In the second hour or so the complications that have been hinted at before start to develop and grow, personal conflicts with others rise to the surface, and life for our heroes starts to get tough. In the next hour the tension that has built erupts and the situation becomes desperate as politics and social turmoil overwhelm the lovers personal lives entirely, all of which builds to an insanely incendiary conclusion. At 3 minutes short of the 3.5 hour mark, REFUGEE requires a little bit of stamina, but it uses its time well to flesh out the situation and the characters. The overall theme of personal happiness being stomped on by political issues is one that comes across a lot in Indian films. REFUGEE tries hard to be fair and to present the message that people are people and killing each other over the concept of 'nation' is a terrible waste of the potential of life. In the end there does seem to be something of an \"India good, Pakistan bad\" sentiment in the film regardless of its efforts otherwise. The film closes with a speech dreaming about a world with no borders, \"No passport, no visa\"... but one can't help suspect that J.P.Dutta imagines such a world would be established on India's terms rather than Pakistan's.",
         "Refugee (Abhishek Bachchan) is a orphaned young man who lives in a border village and is the adopted son of the village head man Jaan Muhammad (Anupam Kher). He routinely ferries people across the Rann of Kutch into Pakistan and from there brings people into India. In one trip he takes Manzur Ahmad, his wife and daughter Nazneen (Kareena Kapoor) into Pakistan. The young folks bond and eventually fall in love. But the path of love is thorny with a Pakistan Army ranger (Sunil Shetty) and his soldiers, an Indian Army man (Jackie Shroff) and his soldiers, several terrorists and other sundry bad folks getting in the way of their union. There is the usual patriotism, separatism, idealism, villainy etc. that runs through the film. But it is not an out and out Pakistan bash and tries to preach a message of friendship with a clichéd ending when a child is born in the no-man's land area. The story is somewhat unusual and the movie is visually stunning. The Rann and the desert surrounds frame the most beautiful scenery, and spots of color in clothing from that region. The sets are very authentic. The direction is okay, and dialogs uneven. But the film still manages to engage for two reasons - the lead pair that are introduced in this film actually do show some sparks of good acting. Abhishek is somewhat wooden and pouty, but he still manages to be convincing as the Refugee. Why is he called that? Kareena looks beautiful - young, earthy, and has moments of really good acting. It is inexplicable where she gets money to be in such beautiful clothes, but maybe not fair to question such stuff in a Hindi film! The rest of the cast is mediocre - Anupam, Sunil, Jackie, Kulbhushan etc. The music is very nice, the last song at the Dargah is amazing until it turns into a filmy fest with Jackie and Sunil dancing - cringe worthy! All in all it is certainly good for a one time watch - and one wonders where Abhishek squandered the potential he showed in this film.",
         "After the success of Border (1997), J.P. Dutta came before the Indian audience with Refugee (2000) whose lead pair at that time was known as AB's baby (the offspring of Amitabh Bachchan) and Lolo's sis (the sister of Karisma Kapoor). J.P. Dutta had planned to launch Amitabh Bachchan's son, Abhishek through a movie - Aakhiri Mughal but due to certain reasons, he had to shelve that project for good and instead he introduced him alongwith Kareena Kapoor, the high-profile daughter of Randhir Kapoor and Babita and the younger sister of the top heroine (those days), Karisma Kapoor. All things said and done, Refugee starts quite promisingly with the first encounter of the debutant hero and the debutant heroine with the illegal crossing of the Indo-Pak border at Bhuj (Rann of Kutch). The heroine belongs to a Muslim family coming from Bangladesh and can be categorized as the Bihari Muslims who had to migrate to the East Pakistan (later turned into Bangladesh) at the time of partition of India. The problems and woes of the Bihari Muslims are very pertinent because partition did not help them and to be frank, affected them quite adversely. Still the attitude of the Pakistanis towards them is negative and they look upon them in a derogatory way. Had the well-recognized director concentrated on this relevant issue, he would have made a much better and admirable movie. However he got confused between making a serious movie and a romantic movie. And it's this confused storyline of the movie which has made Mr. J.P. Dutta to fall flat on his face. The hero who calls himself a refugee because he does not have any name except this identity and carry the job of helping the willing people cross the border illegally to earn money, falls in love with the teenager girl of the family whose marriage is the burning issue before the elders. The romantic track is definitely fascinating and the soul-soothing songs have made it all the more attractive and memorable. The dialogues of the movie (penned by J.P. Dutta's father, O.P. Dutta) are also praiseworthy in this regard. However the rest of the movie is studded with utterly illogical sequences and incidents. The action sequence seems to have been inserted in the movie quite superfluously. The narrative and the treatment of the plot has a clear imprint of the movie-making style of J.P. Dutta. However it renders a lesson also to the prospective filmmakers that the narrator should be clear in his mind as to what he has to narrate and what should be the logical conclusion of his story. If he, himself , is not clear about what he wants to convey, how can his product become a good one ? The actors have done their parts quite well. Jackie Shroff and Sunil Shetty, being the BSF officials of India and Pakistan have done justice to their defectively crafted roles alongwith Sudesh Berry, Anupam Kher and Reena Roy. An actor of the calibre of Punit Issar has been wasted in an insignificant role. However the best performance is definitely of Kulbhushan Kharbanda, the head of the illegally migrated Bihari Muslim family. His dialogue - 'Bangladeshi Hona Koi Gunaah Hai Kya ?' (Is it a sin to be a Bangladeshi ?) underscores the path which the movie should have followed to be a meaningful and purposeful one. Now for the young and fresh lead pair who was better known for its family background at that time - Abhishek Bachchan has done well in some scenes and is quite pathetic in some others, i.e., he has delivered a mixed bag of good and bad performances. On the other hand Kareena Kapoor is so natural as if she were born before a movie-camera. I rate her performance in this very first movie of her as her best till date (even better than that of her in Jab We Met). Cinematography and technical aspects are up-to-the mark. However the unnecessarily intruded action scenes are not that impressive as in the other movies of J.P. Dutta. The length of the movie is also on the higher side. The climax is quite indigestible (Kareena giving birth to a child on the border) and looks ridiculous. Music is the biggest asset of this movie. The team of Anu Malik and Javed Akhtar has done a memorable job and Anu Malik quite deservingly won the national award for the best music director for his work done for this movie. The song Panchhi Nadiya Pawan Ke Jhonke is, in my opinion, one of the best twenty Hindi movie songs of all times. The other songs - Aisa Lagta Hai, Taal Pe Jab Ye Zindgaani Chali, Raat Ki Hatheli Par Chaand Jagmagaata Hai, Mere Humsafar Mere Humsafar and Jise Tu Na Mila are also worth listening to again and again. I recommend this movie to all the fans of Kareena Kapoor and others too who are interested in watching a lovely love story blossomed on two different sides of the Indo-Pak border, alongwith memorable songs.",
         "With big film like Anil Sharma's Gadar J.P dutta's LOC and Border other film like Qayamat Zameen Hero BBV and many more all was agaisnt PAkistan and had them as enemies. out of all Refugee was the only film to bring together India and PAkistan Both shake hands together. and Refugee have it. The performance by every one was great from Jackie to suniel and from Abhiehsk to Kareena. all did a great job"
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": ["Bihar-based Manzur Ahmed, his wife, his mother, and his daughter, decide to re-locate to East Pakistan after the partitioning of Hindustan during 1948, following the tussle between Sheikh Mujib Rehman and Pakistan's General Bhutto, which led to the formation of Bangladesh, where Manzur and several other Muslims were forced to re-locate to Pakistan. In order to do this, they cross two borders, one with India and Bangladesh, and the second with India and Pakistan. The route from Bangladesh leads from Dhaka then to Guwahati then to Delhi then to Ajmer then to Bhuj, and then on to Pakistan's Haji Peer. They get as far as Bhuj, but afterward they are assisted by Jaan Mohammad's son, known only as Refugee, who helps them trek their way across the Rann desert to Atta Mohammad's house in Pakistan. Refugee considers his clients as mere items of luggage and refuses to be emotionally involved with them. Then he meets Nazneen and he forgets this rule, and they soon both fall in love with each other. Police on both sides of the border are aware of the refugee traffic and question Refugee and Jaan several times because of this. Then, one day, Refugee assists four men to enter the Indian side of the border. These men then enlist the help of Jaan's other son to get to Delhi. Shortly thereafter, explosions take place in trains, buses, and buildings. And to complicate matters even more, BSF Officer Raghuvir Singh apprehends Refugee with a load of RDX plastic explosives. While Naaz is making preparations for her marriage with Refugee, her parents have arranged her marriage with a Pakistani Ranger named Ashraf Mohammad. The question remains what will be Refugee's fate when Ashraf finds out that he is the truth of his wife-to-be, that is if he ever gets out of the clutches of the Border Security Force."],
      "budget": 0
   },
   "movielensId": 146392,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2000-06-30",
      "dvdReleaseDate": null,
      "directors": ["J.P. Dutta"],
      "runtime": 207,
      "movieId": 146392,
      "title": "Refugee",
      "mpaa": null,
      "actors": [
         "Abhishek Bachchan",
         "Kareena Kapoor",
         "Jackie Shroff",
         "Sunil Shetty",
         "Reena Roy",
         "Sudesh Berry",
         "Avtar Gill",
         "Vrajesh Hirjee",
         "Puneet Issar",
         "Kulbhushan Kharbanda",
         "Anupam Kher",
         "Mukesh Tiwari",
         "Ashish Vidhyarthi"
      ],
      "imdbMovieId": "0250690",
      "originalTitle": "Refugee",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["qP_7F3gWhqg"],
      "plotSummary": "The films tells the story of an un-named Indian Muslim, who helps illegal refugees from both India and Pakistan to cross the border through the Great Rann of Kutch. The film is attributed to have been inspired by the short story \"Love Across the Salt Desert\" by Keki N. Daruwalla.",
      "tmdbMovieId": 166231,
      "avgRating": 3.1,
      "releaseYear": "2000",
      "numRatings": 5,
      "posterPath": "/m5N6HF9UpX4bRLzLtz03tWjBAFf.jpg"
   }
}