{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "growing up",
            "id": 9825
         },
         {
            "name": "grief",
            "id": 9872
         },
         {
            "name": "feelings",
            "id": 207776
         }
      ],
      "imdb_id": "tt0060538",
      "video": false,
      "title": "Misunderstood",
      "recommendations": [
         42590,
         63214,
         12513,
         4702,
         169780,
         43101,
         67385,
         67556,
         156231,
         43000,
         88395,
         40522,
         134184,
         88309,
         42225,
         46817,
         8286,
         42236,
         51228,
         153820
      ],
      "backdrop_path": "/6itaUfnc5mDE6Z9TMMv5HRQ3hDa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sir John Edward Duncombe",
               "gender": 2,
               "credit_id": "52fe491ec3a36847f8189e2f",
               "name": "Anthony Quayle",
               "profile_path": "/au2nJAa5detncsuS7il5z7StaUh.jpg",
               "id": 14371,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Andrea",
               "gender": 0,
               "credit_id": "52fe491ec3a36847f8189e33",
               "name": "Stefano Colagrande",
               "profile_path": null,
               "id": 225308,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Milo",
               "gender": 0,
               "credit_id": "52fe491ec3a36847f8189e37",
               "name": "Simone Giannozzi",
               "profile_path": null,
               "id": 225309,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Uncle William 'Will'",
               "gender": 2,
               "credit_id": "52fe491ec3a36847f8189e3b",
               "name": "John Sharp",
               "profile_path": "/tesKy6VNj8tUTpl1qqGvqaRJKGR.jpg",
               "id": 26261,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Luisa",
               "gender": 0,
               "credit_id": "52fe491ec3a36847f8189e3f",
               "name": "Adriana Facchetti",
               "profile_path": "/tR3zYTIw7bnxFcdkuZEpmVGLzxy.jpg",
               "id": 592632,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Casimirio",
               "gender": 0,
               "credit_id": "52fe491ec3a36847f8189e43",
               "name": "Rino Benini",
               "profile_path": null,
               "id": 1003160,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe491ec3a36847f8189e47",
               "name": "Giorgia Moll",
               "profile_path": "/qSL8iXqDzquKxEzewhLK207L9yQ.jpg",
               "id": 3786,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dora",
               "gender": 1,
               "credit_id": "52fe491ec3a36847f8189e4b",
               "name": "Graziella Granata",
               "profile_path": "/rUDMz2N2Yfgz5iIlL3ttyzABMho.jpg",
               "id": 73623,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe491ec3a36847f8189e2b",
            "name": "Luigi Comencini",
            "profile_path": "/tEeFmTQslI0TcFgULqtqYegsttt.jpg",
            "id": 119430,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.124448,
      "production_countries": [],
      "id": 56978,
      "vote_count": 19,
      "budget": 0,
      "overview": "Andrew's brave front convinces his father that he is unaffected by his mother's death. Playmate and protector of his little brother Miles, he is often blamed when mischief goes wrong. Only when tragedy strikes does his father recognize Andrew's true qualities.",
      "similar": [
         473168,
         210957,
         334541,
         85350,
         345920,
         10795,
         428449,
         2103,
         25643,
         314385,
         27585,
         303991,
         11931,
         46853,
         468207,
         10145,
         390051,
         192134,
         9777,
         15705
      ],
      "original_title": "Incompreso - Vita col figlio",
      "runtime": 105,
      "poster_path": "/prJdDVjsx5aZGz2vAdT6oGQQhwW.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1966-01-01",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Luigi Comencini"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Florence Montgomery",
         "Leonardo Benvenuti"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0060538/",
      "coverLink": null,
      "actors": [
         "Anthony Quayle",
         "Stefano Colagrande",
         "Simone Giannozzi"
      ],
      "reviews": [
         "Childhood is in the center of Comencini's work.\"Incompreso\"sees him going at a peak of true emotion and aesthetic refinement.Comencini is one of the greatest directors Italy has ever known even if he remains in the shadow for so many cine buffs.If you have the chance to see \"incompreso\" do not miss his other works \"lo scopone scientifico\" \"Pinocchio\" ,the best version of the Collodi classic and his mammoth series \"Cuore\" ,these two works dealing with childhood too,not to mention such achievements as \"Casanova veneziano\" (which beat Fellini at his own game)and \"l'ingorgo\" \"Incompreso\" is one of the saddest movies in the world and however,it's not a melodrama:it's pure emotion,realism,quivering sensitivity . A man's -a consul- wife dies and he 's left on his own with his two children.He's a good father,but he wants his older son to become adult ,to act like a man .Anthony Quayle's portrayal is not that of a tough man; it's only little by little,in spite of his good will,that he leads his son whom he loves to despair.Some people say that you become a man when you lose one of your parents,after all!In many a melodrama,we have heard the mother say after the father's death \"now you're the man\".Comencini's work is the contrary:for him ,even if a child shows more perceptiveness than the grown-ups (see \"lo scopone scientifico\" or \"cuore\"),he still remains a child who should be allowed to suffer ,to cry and to love.Because the father thinks that a big boy does not need tenderness anymore and he takes only the little brother in his arms. The mother is still here even if the boy does not see her anymore:there's a painting in the house ,a tape which the father recorded before her death and mainly a big garden where the two brothers speak of intimate things like death .All the nannies (are you like Mary Poppins? asks the younger boy) in the world that the wealthy dad can pay cannot help:that's why they stay out of the game (and out of the games):never the boys will communicate with them. The first part of the film tends to show that Milo,the little kid ,is the frail one;an admirable sequence,taking place during a storm at night,shows the father taking his little boy to his room...but closing his door to the other. SPOILERS:Because his father does not seem to understand him,to love him,to treat him like a ...child,the only way for him is to go where his mother is.Then begins a harrowing finale,during which the father understands (but too late) that his son wanted to die ,even if the accident had not happened.The essay which the boy wrote \"my best friend,my father\", climaxes the movie .the last picture is an extraordinary fade -in(the mother's picture) fade-out (the dead boy in his bed).These final pictures alone would make the movie a masterpiece. Superb cinematography ,remarkable cast and credits over paintings of another century,first-class score which enhances the emotions but never drowns them out. Absurd remake by Jerry Schatzberg in 1984 (\"misunderstood\") with Gene Hackman taking on the part of the father and colossal mistakes (flashback where the mother appears ,hollywoodian happy end).These remakes are really a curse.",
         "In terms of status, Italian director Luigi Comencini reminds me of his American contemporary Sydney Lumet : as a director, he would embark in equal proportion into projects that were his very personal and others which were more like a studio contract thing. Yet (and that too is true of both directors), all along his fifty-year career, he has shown a remarkable ability to make personal, ambitious projects highly entertaining for millions of spectators, while on the other hand imprinting his unmistakable touch on projects that were meant by producers to be for the standard production. In other terms - and that again is true of both Lumet and Comencini - he's been, for more than fifty years, walking the tightrope between art and entertainment with outstanding virtuosity. Incompreso, now... Well, Incompreso is not only an excellent movie. It is not only one of the many, many proofs that popular entertainment made in Cinecittà during the Golden Age (1950-1980) is exactly as outstanding, and perhaps even more, than all the \"great-author\" films that critics (including American critics, when it comes to Europe) automatically favor, while ignoring completely - back then, at least - the marvels of popular movie entertainment. Incompreso is not only one of the best movies ever made about childhood. It is not only one of Luigi Comencini's greatest achievements outside of \"commedia all'italiana\", the tragicomic new genre of which he was one of the three Grand Masters (the two others being Risi and Monicelli). Incompreso is more than all this because all this - all that I have said so far - is about classification, status, polemics with those darned intellectuals, etc, the will to save a dream-come-true cinematography that was tragically underestimated not only abroad but in Italy as well - the country that for decades showed the greatest gap of all between the tastes of the critics and those of the public. All these are my personal axes to grind. But now, you must forget about this, and concentrate on watching Incompreso. When you will watch Incompreso, and I know you will, something will happen to your heart : at some point, you will feel it cracking and you won't be able to help it. And then it will crack some more. Near the unforgettable conclusion, it will fall on the ground in thousands of little pieces. But unlike so many other melodramas, this one refrains from using one single cheap trick. I mean it. It never tricks the spectator into crying. The crying comes only too naturally, with no strings attached or pulled. Luigi Comencini's Incompreso is the most intense, the most powerful, the most poignant melodrama ever put to screen. And ever means ever. Straight from the heart, straight to the heart, without one single cheap trick. Why use artificial tricks that treat spectators like puppets, while simple reality is enough to reach to their heart? Childhood is the best of times, childhood is the worse of times : both are equally true at the same time and there is nothing we can do to change this. As a movie-goer, I feel deeply indebted to Mr. Comencini. But the children in me loves him even more. Thanks to the many french-speaking TV channels of my country (Canada), I grew up with the best movie ever made FOR kids, in six perfect episodes of 52 minutes each : Luigi Comencini's Le Avventure di Pinocchio, which made me laugh so much. Then I saw the best movie ever made ABOUT kids : Luigi Comencini's Incompreso - and I cried a river. Luigi Comencini is 90 years old.",
         "i have just seen this movie on a dvd, and i am astonished by the way childhood crisis is evoke in this masterpiece. there must be something invisible in every frame that is captured to reveal every pieces of the relationship between a father and his son. In fact this movie is about the loss. The loss of a mother, the loss of a kid who turns into a man, the loss of a father who refuse to assume his son as a child, and also the pain of a man who is so sad of the loss of his wife that he can't see and feel the pain of a son who looses his mother. Even if it sounds like a tragedy, this movies has to be seen by anyone, because we were all the son or the daughter of our parents, and we suffered too of this relationship, and we might be parents some day, so let's enjoy again the beauty and sadness of life in this movie that looks deep inside us : our childhood. Incompreso is among the movie that make you feel as a human being, able to feel and react, this movie shows us how a movie can touch you and change your life.",
         "Since 1966, when I watched for the first time the beautiful \"Incompreso - Misunderstood\" of Luigi Comencini, I was moved to tears. I was 9 yo, had already red the book of Florence Montgomery and I was a little bit disappointed that Comencini had turned the story in Italy, in Florence, and adapted all the situations. During next years I grew up and I understood that the choice of Comencini was correct. I was always fascinated by the performance of Andrea (Humphrey), \"actor\" Stefano Colagrande... we are nearly the same age and I really felt in myself the same children's anxieties and passions that he shows so well, and acts perfectly, in this movie. I'm very glad that, thanks to internet, I found where Stefano Colagrande, who didn't act anymore, is today, and which is his job: he's a great Physician, and he's a Professor at the University of Florence. Sometimes life is grateful with sensitive persons! Thanks a lot for what you gave me, Doctor Stefano! GP",
         "It is a bit slow moving at first, but well worth the wait! The acting is GREAT! The story is realistic (which accounts for it being a bit slow). Stefano Colagrande (Andrew) does such a good job, it makes me wonder why his acting career was so short. The movie is about how Andrew's father misunderstands him, because Andrew seems to have no emotion when sad events take place, the main one being his mothers death. Andrew also misunderstands his fathers feelings toward him, as dad only seems to care about Miles (Andrew's little brother). The ending is very quick but very precious! A wake up call for parents of a cold nature!",
         "This is a movie filmed with great quality and heart. It feels special, it feels almost poetic, it feels human, it feels warm, it feels dramatic and moving, it feels artistic and even refined. On the other hand it feels original and unique for its distinguish story but also for the Italian way of film-making (obviously different from the American standard). Not only this is an Italian film, it also takes place in Italy and has fine settings and backgrounds, without forgetting that it does a good work in showing the places in Italy where the action takes place. The Duncombe's house is gorgeous and its garden is no less gorgeous. That is definitely a house for high society people. The actors's portrayals are wonderful: Anthony Quayle as Sir John Edward Duncombe, Stefano Colagrande as Andrea, Simone Giannozzi as Milo, John Sharp as Uncle Will and Giorgia Moll as Miss Judy. Even though the Duncombes are a British family, we hardly even think of them as British. They only speak Italian, plus they have no British accent. The two kids are Italian in real life. Anthony Quayle and John Sharp were actually British in real life but they speak Italian so well (without any signs of British accent) that you don't even think of them as British. Other than the lead characters speaking perfect Italian, the Italian in this movie is calmly spoken and relatively simple to understand. 'Incompreso' is simply one of the finest dramas I know. The story is emotional and there is always the beautiful classical music to put more emotion into a story that is already so sentimental. The crazy Uncle Will is the comic relief of this emotional film. Who wouldn't like to have an extravagant uncle like him? Miss Judy (the nanny), while not that relevant as a character, is nevertheless an enjoyable character, certainly much nicer than the first nanny. Not to mention that Miss Judy is hot... More than an Italian masterpiece, it's a take on youngsters's feelings. In fact, \"Incompreso\" means \"Misunderstood\", which is how our friend Andrea (a handsome and sensitive boy) feels: heavily misunderstood by his father (who is loving but severe and distant). Add to it the fact that he faces the loss of his mother and the challenge of taking care of his infant brother Milo (who is adorable and cute as a button but also very demanding). Yet, as dramatic as the movie is, it has many funny moments too - and not just because of the eccentric uncle. If there ever was a movie that didn't need to be remade, this is it. Still, this film had a decent American remake in 1984 under the title 'Misunderstood' (an exact translation of the original Italian title). Each with their differences and similarities, but make no mistake: the Italian is much better. I don't know the title of this in Portugal.",
         "\"It's not easy being a son\" These are the words Michael had to Fredo in \"The Godfather Part II\" and if there ever is a movie, fittingly an Italian one, that expressed to the fullest how tragically misunderstood a son can be by his father, it's Luigi Comencini's 1966 \"Il Incompresso\" or \"Misunderstood\". I'm recollecting the two movies because I discovered them at the same time, 23 years ago during an Italian-themed month on TV during which Italian as much as Italian-American classics were aired, and while I wasn't mature enough to get into the \"Godfather\" films, I remember discovering \"Cinema Paradisio\" and \"Misunderstood\". And ever since that day I saw it with my father and my grandmother, I never forgot how upsetting it was. I hate situations of misunderstandings, so I really got my share during the film, not that it prepared me well for the ending. Like another Italian masterpiece, \"Bicycle Thief\", a father-and-son relationships is the inspiration of an extraordinary tearjerker, this time set in a rich and wealthy background as if the theme transcended any cultural and social barriers. And now that I saw the film again and that my tears dried, I'm realizing one thing, I was sad at the age of 11 because I constantly rooted for little Andrew, especially since I had a little brother too, but now, I sympathized with the father, maybe because I became one. Or because there might be something more tragic than being misunderstood by someone you love: it is misunderstanding the one you love. In fact, it's not easy to be a father either. And the tragedy of the father, Sir John Duncombe, an English diplomat in Florence, is that he didn't understand his son at the worst possible time, when he announces him that his mother is dead and takes his silence and absence of tears as toughness while the kid is devastated inside and only let it go in his father's absence. But Cinema is a tricky medium, because you never see any real interaction between John and Andrew, John can only observe the troubles Andrew causes, and Andrew, no matter how hard he tries to please John, puts himself in worse situations. The judo scene is a brilliant and quite realistic example: resigned not to see his father, Andrew actually wins the match until his father's last-minute arrival distracts him and he's immediately defeated. This is Andrew's story in microcosm, because he can't communicate properly with his father, even the positive moments end with incidents. \"Misunderstood\" is the chronicle of this failure of communication and as viewers, we're put in an extremely uncomfortable position because we know the problem, and we wish they knew how easily they could be closer to each other. Andrew is played by one-hit actor Stefano Colagrande and is absolutely heartbreaking in that role, trying to cope with the loss of his mother, the quest for understanding from his father, and a bratty little brother, Miles, played by Simone Giannozi. Miles obviously idolizes his big brother but is too young to 'understand', being in a constant need of a playmate so when he doesn't get what he wants, pull some capricious tantrums and puts his brother in difficult situations. Anthony Quayle displays some remarkable dignity as a quiet, decent fatherly figure trying to instill some adult maturity and responsibility to his older son, like any father. He's certainly not an antagonist, and perhaps as much a victim as Andrew, blinded by his judgment, overestimating the toughness of Andrew's heart while it's his most vulnerable spot. And the mother is a memory that haunts the three of them, maybe the sole force to unify them. From this woman, only a recorded voice and a picture are left but the voice is erased when Andrew accidentally types on the wrong button\u0085 causing his father to be more estranged to him. But the film relieves us from all this sadness and takes an interesting path when Uncle Will (John Sharp) comes. This is a pivotal character because he can see the father and the son separately, and the vulnerability of Andrew strikes him like a flash of light. He then gives a cynical yet wise advice to his brother: kids are like dogs, they need authority, don't tell your son you love him, have something to do with him. I mentioned Fredo Corleone, didn't he complain that he had nothing special to do? The Uncle visit pays off and things go well until the little brother's jealousy starts the tragic chain of event. Resigned about his status as the ugly duckling, alienating himself for his father's love and endangering his life more and more, Andrew's self-challenging habit to hang on a dead tree above a river ends in tragedy, forever wasting the opportunity of a magnificent reconciliation. It's not totally wasted as John, as if God wanted to give him and Andrew a break, gave them one last moment of complicity, and the object of this final intimate interaction is just so painful I can't even write it without feeling a pain in the chest. I just have that face of Anthony Quayle in mind, a poor man who realized his mistake when it was too late. There is no bad guy in the film, only misguided people. And if there is one thing to learn from Luigi Comencini's film is that 'understanding' is perhaps more important than loving and respecting, both depend on understanding and without it, they're just empty shells. And how sad that a film delivering such a poignant and powerful message is not more known... 50 years after it was released, there is only one thread on IMDb, eleven reviews (well, twelve now) and zero critic on Rotten Tomatoes, I want to say this is as tragic as the story itself.",
         "Duncombe, cold and distant father, besides UK Consul General in Florence, carelessly applies his stark communicative methods with his first son Andrew after his wife's death, which Andrew had sensed well before his father's disclosure of the sad news. Duncombe's several duties, which constantly keep him away from the family, force Andrew to look after Miles, his little brother. Andrew valiantly carries on, humoring his spoiled sibling, putting on the apparent front of a strong man, getting himself into a lot of trouble due to Miles' continuous mischiefs. Unbeknownst to his father, Andrew silently suffers his loss; blame is all Duncombe lays on young Andrew, probably due to his incapacity to deal with such pain himself. It will be at the end, as often seen in life, that the diplomat will experience his second loss, probably the ultimate one, the one he negligently couldn't prevent. His coldness will eventually hit him during the last moments of Andrew's early, shattered adulthood. Comencini gives this young man the power to annihilate the lavish and colorful home and surrounding environment, reminding us that once it's too late there's no return. There's perfect synchronicity between the colors/tones/score and the setting of the picture, a rather clear representation of life in Florence during the late 60's where roles, both social and professional were well defined. Using a term I have commented with for a different movie, we are seeing a positive-negative image of Comencini's Pinocchio, where the father is constantly running after his son, both for loneliness and to keep him out of trouble. I think some of us will agree with the fact that Miles' role somewhat reminds us of the fictional character. The comment's title has, for the record, its ambivalence.",
         "In the history of professional film-making,death of a charming family member is a serious yet innocent theme.It is a common knowledge that an amateur director will butcher the look and shape of the film by turning it into a shameless tear jerker.But things would surely be different if the same matter is passed on to a veteran cinéaste.In the hands of versatile Italian director Luigi Comencini death of a family member theme has become a film almost close to a masterpiece.He has shown that his film has no place for melodrama as he depicts human side of people who cope up with the death of a family member.This sad event has been portrayed in the character of a diplomat who has to look after his two young sons after the demise of his wife.Incompreso is an Italian film about the intellectual growth of people both young and old alike who have to face their daily lives in the wake of a death in their midst.Comencini must be felicitated for the manner in which he portrays how life goes on as people must become strong even if there is a somber event of death around.This is because there is nothing in this world for weak people. Everybody must find own ways of dealing with the loss of family members.This is the only sensible message of this film.",
         "In 1966 Ferruccio Lamborghini marveled the world with the beautiful Lamborghini Miura, a dream under wheels, probably Lamborghini's true masterpiece. In the same year, Italy also marveled the world with this movie named 'Incompreso' (which means 'Misunderstood' in Italian). There are thousands and thousands of movies out there. All over the world. But once in a while there comes a movie that is special. This is one of them. Pure and poetic, it's worthy of any movie collection of true lovers of cinema. It's an excellent foreign movie, worthy of many Academy Oscars. The story takes place in Florence, Tuscany, Italy. Gorgeous settings are one of this movie's strengths, with aesthetic refinement, visuals in a classical style, beautiful photography and a typically Italian scenario which only accents the movie's charm. Being an Italian movie, as you would (and should) expect, people talk very loud. Italians are known for being noisy. But let's face it, the actors do very well in their roles: Anthony Quayle as Sir John Edward Duncombe (the father), Stefano Colagrande as Andrea (the older son) and Simone Giannozzi as Milo (the younger son). The movie is brilliantly directed by Luigi Comencini and it has beautiful music, very appropriate for the movie's dramatic nature, such as \"Piano concerto #23 in A\" by Wolfgang Amadeus Mozart and \"Rigoletto\" by Giuseppe Verdi. The story is about a man of high position (Sir John Edward Duncombe) who recently lost his wife and now's gotta raise his 2 children by himself. Although a good parent, he tends to be harsh and unfair towards Andrea, often blaming him for anything that goes wrong (especially when it comes to look after his brother). He often doesn't believe Andrea, which takes Andrea to despair. In fact, the movie's title can't be anything else than about Andrea, the misunderstood son. The ending is emotional. Andrea is victim of a tragedy and that's when the father finally understands that even his older son needs to be loved, but unfortunately he realizes that too late. This movie was remade in 1984 under the title 'Misunderstood'. It was directed by Jerry Schatzberg and stars Gene Hackman, Henry Thomas and Huckleberry Fox. It's a nice remake. Of course, has its differences comparing to the original, but it's very loyal to the Italian movie. I like both movies very much but the Italian version is unquestionably superior. This should definitely be on Top 250.",
         "Excellent movie about a dumb father... After the lost of his beloved mother a child has to bear that his father didn't die, too: \"Everybody can't be an orphan.\" (Jules Renard) Better have wise enemies than stupid friends. Among Comencini's movies how much more enjoyable is Bette Davis' sadism in \" The Scientific Cardplayer\" than Anthony Quayle's helplessness here. Quayle's renowned ability to (dis)play an everlasting blubbering face was most important to directors, like: J. Lee Thompson for \"The Guns of Navarone\" Cyril Frankel for \"No Time for Tears\""
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Rizzoli Film",
         "Istituto Luce"
      ],
      "summaries": ["Andrew's brave front convinces his father that he is unaffected by his mother's death. Playmate and protector of his little brother Miles, he is often blamed when mischief goes wrong. Only when tragedy strikes does his father recognize Andrew's true qualities."],
      "budget": 0
   },
   "movielensId": 146772,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1966-01-01",
      "dvdReleaseDate": null,
      "directors": ["Luigi Comencini"],
      "runtime": 105,
      "movieId": 146772,
      "title": "Misunderstood",
      "mpaa": null,
      "actors": [
         "Anthony Quayle",
         "Stefano Colagrande",
         "Simone Giannozzi",
         "John Sharp",
         "Adriana Facchetti",
         "Rino Benini",
         "Giorgia Moll",
         "Graziella Granata"
      ],
      "imdbMovieId": "0060538",
      "originalTitle": "Incompreso - Vita col figlio",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Andrew's brave front convinces his father that he is unaffected by his mother's death. Playmate and protector of his little brother Miles, he is often blamed when mischief goes wrong. Only when tragedy strikes does his father recognize Andrew's true qualities.",
      "tmdbMovieId": 56978,
      "avgRating": 3.5,
      "releaseYear": "1966",
      "numRatings": 2,
      "posterPath": "/prJdDVjsx5aZGz2vAdT6oGQQhwW.jpg"
   }
}