{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "italian",
            "id": 924
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "sorcery",
            "id": 5147
         },
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "sorcerer",
            "id": 10821
         },
         {
            "name": "gothic",
            "id": 33505
         }
      ],
      "imdb_id": "tt0115564",
      "video": false,
      "title": "Arcane Sorcerer",
      "recommendations": [
         149715,
         38074
      ],
      "backdrop_path": "/fY43DkijIC6teXCqn4Ns9votrkT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Achille Ropa Sanuti",
               "gender": 2,
               "credit_id": "52fe499dc3a36847f81a39a3",
               "name": "Carlo Cecchi",
               "profile_path": "/oIOFKqLJVpE6FFlcYyDOur1HxGl.jpg",
               "id": 96974,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Giacomo",
               "gender": 0,
               "credit_id": "52fe499dc3a36847f81a39a7",
               "name": "Stefano Dionisi",
               "profile_path": "/qV9KyDhb0AuxHYMUr1UqhbBPhb.jpg",
               "id": 16240,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Aoledo",
               "gender": 0,
               "credit_id": "52fe499dc3a36847f81a39ab",
               "name": "Arnaldo Ninchi",
               "profile_path": "/4CmS3EqtUUjsRHStekAB1Ux8gBE.jpg",
               "id": 73871,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Don Zanini",
               "gender": 0,
               "credit_id": "57b60a1b9251411bce000148",
               "name": "Andrea Scorzoni",
               "profile_path": null,
               "id": 1667648,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Severina",
               "gender": 0,
               "credit_id": "57b60a3b9251411bce000156",
               "name": "Consuelo Ferrara",
               "profile_path": "/f83nHq7PS9QnlaAwpTSyYZFPEEi.jpg",
               "id": 236751,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499dc3a36847f81a399f",
               "name": "Pupi Avati",
               "profile_path": "/qgbskeZ6D6AIn8L8WGVVlb10fdI.jpg",
               "id": 72191,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57b60a99c3a36820390001a9",
               "name": "Amedeo Salfa",
               "profile_path": null,
               "id": 23363,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57b60ad09251411c380002d4",
               "name": "Pino Donaggio",
               "profile_path": null,
               "id": 14138,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57b60adec3a368509e003dcd",
               "name": "Cesare Bastelli",
               "profile_path": null,
               "id": 228912,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57b60af392514120210038e4",
               "name": "Giuseppe Pirrotta",
               "profile_path": null,
               "id": 1667650,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57b60b08c3a3687da5003f4f",
               "name": "Vittoria Guaita",
               "profile_path": null,
               "id": 1650521,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57b60b1dc3a36820f4000194",
               "name": "Francesco Paolocci",
               "profile_path": null,
               "id": 1667652,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "57b60b289251411bce0001b5",
               "name": "Gaetano Paolocci",
               "profile_path": null,
               "id": 1667653,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "57b60b4992514119a1003a67",
               "name": "Antonio Avati",
               "profile_path": null,
               "id": 105346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57b60b59c3a36820bf0001e5",
               "name": "Aurelio De Laurentiis",
               "profile_path": null,
               "id": 41383,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57b60b72c3a368209100019c",
               "name": "Pupi Avati",
               "profile_path": "/qgbskeZ6D6AIn8L8WGVVlb10fdI.jpg",
               "id": 72191,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.154582,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 59857,
      "vote_count": 9,
      "budget": 0,
      "overview": "Shunned by his church, a seminary student (Stefano Dionisi) takes refuge with an excommunicated priest (Carlo Cecchi) who teaches him wizardry and black magic.",
      "similar": [
         2667,
         9100,
         767,
         27022,
         37430,
         284052,
         12445,
         675,
         68735,
         68728,
         11906,
         76492,
         290595,
         159824,
         129,
         671,
         672,
         674,
         62213,
         259316
      ],
      "original_title": "L'arcano incantatore",
      "runtime": 96,
      "poster_path": "/pFJ3BdDxE9O4WfB8vl5VSEMzUxz.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Filmauro",
            "id": 4753,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Duea Film",
            "id": 8988,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pupi Avati"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Pupi Avati"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0115564/",
      "coverLink": null,
      "actors": [
         "Carlo Cecchi",
         "Stefano Dionisi",
         "Arnaldo Ninchi"
      ],
      "reviews": [
         "Settled in Italy during the 16th century. This a very good movie. If it has one defect, it's the end, that left me unsatisfied, even if as we all know most of the mysteries unveiled lose their power. But there is one thing that is worth: the atmosphere, that is really Gothic. The characters are isolated in a forgotten manor, they move slowly, talk slowly, and web you in an enticement of stillness. The only rumors are the constant blowing of the wind and the screech of dust under their feet. (Audio is of the essence for this movie.) In conclusion, this is worth renting the tape, provided you see it in silent and darkness.",
         "An excellent horror movie, in my opinion, thanks to a lesson that appears to have been forgotten by Hollywood. There's no blood, no gore, and preciously few special effects. There's just a tight plot and three people in front of that deep mystery which is death. Obscure forces are at work around the main characters, but are they real or just in the characters' minds? Even in the final climax the viewer is left with this unanswered question for the viewer to ponder - as a good movie should do.",
         "The Arcane Sorcerer is the third Pupi Avati film which I have seen. While it may not be my favorite (though it's at least as good as the other two), it is the best made. The film has a disgraced seminary student agreeing to serve as secretary for a defrocked priest. So odious is this former priest's reputation that villagers have been forbidden to look on him or speak to him directly. Appartently, it was an unhealthy interest in forbidden books about conquering death that forced the isolation of this former priest now known as the arcane sorcerer. The catch for the seminary student is that he must never reveal what goes on at the arcane sorcerer's villa. There will be severe consequences in this world and the next should he break his oath. The film has much to recommend it, good acting, cinematography, and set designs. I especially liked the library, candle lit hallways crammed floor to ceiling with ancient tomes. The plot also holds together better than in some of Avati's other films. The only problem is that pace is extremely slow. Most of the running time serves as build-up. The climax is intense! Then, the film ends. I did like The Arcane Sorcerer more than I did Avati's much loved (by others) The House with the Windows that Laughed.",
         "This fairy-tale terrifying in the extreme is Avati's ;it is an Italian Rococo fairy-tale,and Avati calls it an esoteric fairy-tale.A strength of The Mysterious Enchanter is that it is entirely humorless. And Avati is of such a mastership that he feels no need to stress the fact that he is constructing a beautiful thing. Other directors offer such tips from time to time,so that the viewer may see they are up to something;but Avati is way too master on his prodigious showmanship.So, The Mysterious Enchanter is an amazingly straightforward movie. Some elements suggest a comparison with one of Kubrick's films;must I add that Avati's daring and suspenseful film is ten times superior? Let us enumerate some of the most notable elements:the score (Donaggio's music);the atmosphere; one of the few witchcraft stories well narrated on screen \u0085;the eerie Monsignor.The touch is,as always in Avati's films,firm and powerful.One registers also Avati's Gargantuan taste for this kind of things,the fact that he is obviously enjoying this colorful piece. The tale is set in the Rococo epoch,when a young seminarian is punished for a misdeed and appointed as the right-hand of an excommunicated Monsignor (excommunicated,indeed,but still a Monsignor) that lives in seclusion on his family's domain,at a creepy location.The Monsignor,a strong and fascinating person,is suspected of witchcraft and spied by a priest who tries to bring him before the ecclesiastical court. The movie is visually stunning,a thing that does not characterizes the sober Avati.The colors are rich and amazing;there are a few studies in the Goyesque taste of the locations. And for the last,let's say,last third,Avati finds a palette that is so suited,and that makes the movie so intensely striking,that we witness some of the best several tens of minutes of the horror genre.Being given Christmas Present,made ten years before The Mysterious Enchanter,one understands that Avati was prepared for this kind of chills,and able and ready to produce them.The final\u0097I will not spoil it\u0097is like a gentle move,a gentle impulse.He lets his character\u0097this seminarian\u0097whirl or slide as if down a spiral\u0097this is what some claim Lovecraftianism is:-- cosmic-ism and all that.But let us not draw too off. Before we move on,let us state only that this film's final is a very Lovecraftian piece of cinema \u0085.Like in every Avati movie,in this one too the paths of the protagonist are connected to the whole,a whole that Avati only alludes to.These things are shown without words,there are no lines in the script for these thoughts of Avati.In this sense, The Mysterious Enchanter is more metaphysical than Christmas Present (which is too spectacular and simplified and almost didactic in parts),and more explicitly metaphysical than Graduation Party.It is interesting that Avati achieves this without betraying his movie's genre: The Mysterious Enchanter does not cease to be a magical horror.A very subtle art,to be sure.It is not about over-imposing meanings,but about letting them bear fruit.The cinema is also the art of these correlations. The choice of the subject was followed by a diligent comprehension.Sometimes I would almost want that Avati would of directed every script that I do enjoy;but it is not like that,Avati is especially careful with the choice of his subjects,he would not work on anything.The director is not a machine\u0097his movies are the products of an individual's mind. The Italians\u0097well,some of them\u0097possess the secret of this decadent craft of skillfully combining an uncanny tale,full of horror and astounding chills,with lavishly beautiful landscapes in autumnal colors.It is a thrilling tale of witchcraft and \"demonolatry\",very precisely drawn. Carlo Cecchi,as the ambiguous and eerie Monsignor, concomitantly chills and delights us.The film is scored by Donaggio,a great composer for the \"giallo\" genre;his music amplifies the feelings of terror.The first part of the movie is graphically uncanny,and the atmosphere is remarkably well created. Avati is one of the directors whose existence has something wonderful,and who keep working in spite of the movie industry and of the popular trends,and who honor an uncompromising and original conception of art.Other such directors are Goretta,Sokurov, Liliana Cavani, people skilled enough to turn the cinema into a highly differentiated form of art;Tarkovski,Antonioni and Fellini,Truffaut, Bergman are,of course,among the greatest sheiks in these oasis,and the most important exponents as well ;and their immeasurable popularity is but a misunderstanding.These people justify cinema as an art-form.It is wonderful that they exist and that they manage to keep working,against the mainstreams,against the common conventions,against the routine.Their cinema is, implicitly, highly critical of the movies establishment. One of their main tasks is keeping themselves at least unsullied and proving practically,by their own deeds,that it is possible not to compromise,not to concede.The typical churl calls their cinema \"art-house flicks\",etc.; but this is a Neanderthalian's powerless revenge.Directors that do not flirt with popular appeal,that do not court the large festivals\u0097and who,on the other hand,have something to say,and do it in a highly original,interesting,coherent, harmonious,mature,intelligent and enchanting way. (The fair reader must not be remembered of the countless Nullities that populate and flower in the art-house high-brow circles and are acclaimed as Copernican revolutionaries when they are nothing but pathetic charlatans who trade nothing because have nothing to trade and make the greatest damages and disservices, they and their even more inept followers and prophets, to the art-house oasis.)",
         "A splendid pledge about the ambiguity of sin. Lesson about fundamental values and the nimbus of books. About illusions and chimeric truth, about search and secrets like means of life. And, very important, about the price of dreams. A beautiful film like result light and subtle acting. A horror or thriller, a exploration of mystery and magical story, another Jacob wrestling with same Angel. Story of a student out of law who discovers a special world with master and servants, a impressive library and restless whispers, an intangible corpse and a malefic shadow. Blak magic and subtle art of Dionisi. And slices of seductive Utopian time with powerful flavor.",
         "A slow-building horror in the Joseph Sheridan Le Fanu fashion, L'Arcano Incantatore is set in 16th century Italy and follows a disgraced seminary student (Stefano Dionisi) as he becomes assistant to an excommunicated priest (Carlo Cecchi) who lives in an isolated country mansion, owns a library of forbidden tomes and is rumored to practice black magic. Premise is compelling, but the script gets fairly silly and lazy in the last act; secondary characters are either dispatched abruptly or never seen again. Cecchi is fine, but most of the picture is at the mercy of a slack performance by Dionisi. With his gaunt face and pale complexion he does *look* the part, but never emotes beyond a level of mild concern. Veteran director Avati makes an effective use of light and shadows, sound and silence. Avati has an interesting career; known for his bittersweet comedies (like the excellent Una Gita Scolastica), he ventures into the horror genre from time to time, most famously with La Casa Dalle Finestre Che Ridono. 6/10",
         "The only film I'd seen from Pupi Avati prior to seeing this one was his excellent Giallo 'The House With the Windows that Laugh' and naturally, I had hoped that The Arcane Enchanter may be similar in quality to the earlier Giallo masterpiece. While by no means a bad film, The Arcane Enchanter doesn't portray the mystery and imagination nearly as well as the earlier film did. However, based on the strength of the two films I've seen from him; it's clear that Pupi Avati is a more than capable director, and The Arcane Enchanter is another (in terms of production values) high quality Italian horror film. The plot focuses on religion and black magic and the central character is Giacomo Vigetti. Giacomo is convicted of apparently trying to rape a young girl by the Papal State and is forced to flee. He takes refuge at the home of Arcano Incantatore; an ex-communicated priest. During his stay with the former priest, Giacomo soon realises the reason why he as thrown out of the church; the priest was practicing black magic... The film exudes a scintillatingly Gothic atmosphere that carries the film even when the plot takes a turn for the less interesting. The Arcane Enchanter is very much a slow burn film, and while sometimes there is enough mystery created to make the audience want to see what is going to happen next; sometimes there isn't, and the film unfortunately falls flat at those points. The themes of horror shown in the movie largely revolve around death and the mystery springs from the ambiguous way that the plot is presented to the viewer. There isn't much in the way of character building on show, and this can sometimes make it hard to really care about the mystery at hand, however. The way that Pupi Avati presents the scares without special effects is well done, although sometimes it feels like a little more was needed. The ending pretty much flows with the rest of the film in that it doesn't end with a bang, and neither does it really tie everything up. Overall, this is certainly a decent film; but unfortunately, unlike The House with the Windows that Laugh, it's not a great one."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Duea Film",
         "Filmauro"
      ],
      "summaries": ["A seminary student, Giacomo Vigetti, is convicted by the Papal State of seducing a young girl. He is forced to flee and takes refuge with an excommunicated priest. Unfortunately, the priest was excommunicated for experimenting with the black arts. And soon Giacomo wishes they'd never met."],
      "budget": 0
   },
   "movielensId": 146820,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": null,
      "directors": ["Pupi Avati"],
      "runtime": 96,
      "movieId": 146820,
      "title": "Arcane Sorcerer",
      "mpaa": null,
      "actors": [
         "Carlo Cecchi",
         "Stefano Dionisi",
         "Arnaldo Ninchi",
         "Andrea Scorzoni",
         "Consuelo Ferrara"
      ],
      "imdbMovieId": "0115564",
      "originalTitle": "L'arcano incantatore",
      "genres": [
         "Foreign",
         "Horror"
      ],
      "youtubeTrailerIds": ["tyjGw0mH2Cg"],
      "plotSummary": "Shunned by his church, a seminary student (Stefano Dionisi) takes refuge with an excommunicated priest (Carlo Cecchi) who teaches him wizardry and black magic.",
      "tmdbMovieId": 59857,
      "avgRating": 3,
      "releaseYear": "1996",
      "numRatings": 1,
      "posterPath": "/pFJ3BdDxE9O4WfB8vl5VSEMzUxz.jpg"
   }
}