{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0046313",
      "video": false,
      "title": "The Lady Without Camelias",
      "recommendations": [
         32928,
         114336
      ],
      "backdrop_path": "/yvQDBRtm1DqlenzCx4daIQ5vZim.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Clara Manni",
               "gender": 1,
               "credit_id": "52fe49429251416c750c2487",
               "name": "Lucia Bosé",
               "profile_path": "/7AwUquOMzV6NCaDUr2hsWjE5Awb.jpg",
               "id": 39274,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gianni Franchi",
               "gender": 0,
               "credit_id": "52fe49429251416c750c248b",
               "name": "Andrea Checchi",
               "profile_path": "/3iErNlZjlyRgyMLnBOyoWBkumMP.jpg",
               "id": 45036,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ercolino",
               "gender": 2,
               "credit_id": "52fe49429251416c750c248f",
               "name": "Gino Cervi",
               "profile_path": "/dnArJe5KJvtHrEIc6Mtwgmic4tE.jpg",
               "id": 37191,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nardo Rusconi",
               "gender": 2,
               "credit_id": "52fe49429251416c750c2493",
               "name": "Ivan Desny",
               "profile_path": "/s1UPN4N3CiIsfyiPU2VV3ynpInS.jpg",
               "id": 9928,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lodi",
               "gender": 2,
               "credit_id": "52fe49429251416c750c2497",
               "name": "Alain Cuny",
               "profile_path": "/p7fQXfufcazjnA8jVqwWBYal8dO.jpg",
               "id": 5964,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Simonetta",
               "gender": 0,
               "credit_id": "52fe49429251416c750c249b",
               "name": "Monica Clay",
               "profile_path": null,
               "id": 999820,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "la mère de Clara",
               "gender": 0,
               "credit_id": "52fe49429251416c750c249f",
               "name": "Anna Carena",
               "profile_path": null,
               "id": 19586,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "le détective",
               "gender": 0,
               "credit_id": "52fe49429251416c750c24a3",
               "name": "Enrico Glori",
               "profile_path": "/epLTxwnA8GmWPyaPOrmNMRRRsXj.jpg",
               "id": 557945,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49429251416c750c2483",
               "name": "Michelangelo Antonioni",
               "profile_path": "/hidC1Wcy0uM9yOy0sHEvvl2vRB6.jpg",
               "id": 15189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49429251416c750c24a9",
               "name": "Michelangelo Antonioni",
               "profile_path": "/hidC1Wcy0uM9yOy0sHEvvl2vRB6.jpg",
               "id": 15189,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49429251416c750c24af",
               "name": "Francesco Maselli",
               "profile_path": null,
               "id": 129074,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54f977f2c3a36878e6001229",
               "name": "Giovanni Fusco",
               "profile_path": null,
               "id": 39161,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "54f97801c3a3683c55000f5f",
               "name": "Enzo Serafin",
               "profile_path": null,
               "id": 27849,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "59a585de9251412f1600d62b",
               "name": "Suso Cecchi d'Amico",
               "profile_path": "/2it2PNMhCxKY2Q2VrX98fnrtJt8.jpg",
               "id": 24658,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59a585eac3a368405600da90",
               "name": "Pier Maria Pasinetti",
               "profile_path": null,
               "id": 1334927,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59a585f89251412f1600d64a",
               "name": "Domenico Forges Davanzati",
               "profile_path": null,
               "id": 1331896,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a58610c3a368403700cecd",
               "name": "Eraldo Da Roma",
               "profile_path": null,
               "id": 4418,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59a5861bc3a368403700ced7",
               "name": "Gianni Polidori",
               "profile_path": null,
               "id": 1174725,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59a586249251412f1600d670",
               "name": "Gianni Polidori",
               "profile_path": null,
               "id": 1174725,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "59a58634c3a368402500cbcc",
               "name": "Kurt Doubrowsky",
               "profile_path": null,
               "id": 1509725,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.349479,
      "production_countries": [],
      "id": 93863,
      "vote_count": 5,
      "budget": 0,
      "overview": "A new starlet is discovered and has ups and downs in Italian films.",
      "similar": [],
      "original_title": "La signora senza camelie",
      "runtime": 105,
      "poster_path": "/uMwSbJ0h2zlHheYAxtFS7qzpRy0.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1953-02-27",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michelangelo Antonioni"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Michelangelo Antonioni",
         "Michelangelo Antonioni"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0046313/",
      "coverLink": null,
      "actors": [
         "Lucia Bosé",
         "Gino Cervi",
         "Andrea Checchi"
      ],
      "reviews": [
         "If this was a Hollywood film, starring a Rita Hayworth, it would be one of the famous ones. I don't like to use this line of thought but I find it apt here. The story is classic tragedy and the payoff in the end, the parting shot especially, overpowers like Sunset Blvd. It's only a footnote in the scheme of things then because we find it in the filmography of this particular director, a titan of cinema equaled only by a select few. In an early scene here we get a marvellous sketch of how movies create their icons. The producer and director fuss over the young movie starlet in a rehearsal, telling her what to wear, how to move and kiss, how to exude sex appeal. The girl allows herself to be swept up in this, ostensibly because the promise of being a face in the crowd is alluring. A few instances after rehearsing a scene where she makes out in a bed, we see her getting kissed by the man who pressingly courts her. Antonioni gives us a masterstroke here, framing the couple against a blank canvas, projected upon it we see the shadows of movie lights and a grip setting them up. Like the rehearsal scene that preceedes it, this too is a fabrication, orchestrated for a camera and audience. A lot of the rest is melodrama, competent if sometimes iffy. It may seem outrageous by our standards that a girl will concede to marriage the way Carla does here, but perhaps it reflects the times. The marriage is overbearingly hopeless though, a picture of sadness. When the film assumes power again for me, is when we see this young girl, shaped as a person by the movies, be broken by them. The scene builds up to a harrowing climax, with faceless crowds of extras waiting their roll call in a Cinecitta backlot, garish movie sets of sword-and-sandal flicks, the hubbub of movie people. Carla loses herself in this furore, once again allowing herself to be swept up. The overwhelming sadness of the finale is not simply that she acquiesces to too much because, though weak-willed, she's not a ditz. She's quietly spirited but unsure, a fragile, delicate thing thrown in with the lions, having been torn by two men who used her for their desires. It's that Antonioni leaves her there, to a cruel, loveless fate, and she deserves better.",
         "A usually neglected Michelangelo Antonioni early film, \"The Lady without Camelias\" is a caustic story about a beautiful Milanese shop clerk (Lucia Bosé) who briefly becomes a movie star. She soon discovers than she is fenced in and humiliated, with a new and rich husband who can't tolerate her romantic scenes -- he prefers her to play Joan of Arc, with disastrous consequences. It is actually one of the cruelest and most accurate portraits of studio film-making and the Italian movie world. As the film develops, it only gets better, the last scene being a little masterpiece of its own. Michelangelo Antonioni, who had already worked with Bosé on \"Chronicle of a Love Affair\", offered her the part of Clara after Lollobrigida (and, it is said, Loren) had turned it down, and she does wonders in one of her best parts on the silver screen. I have never been really touched by Antonioni's (much more famous, much more serious) Trilogy, but I have enjoyed this \"minor\" work. Compared to later Antonioni, the film feels crowded, yet some of the director's favorite themes are already there (most notably, misunderstanding between men and women, and masculine weakness). For those (like me) who always found Antonioni quite hard to follow in his later films, try this bitter tale in post-war Italy, I think it gives a different and lighter approach to this director's work.",
         "I gave this movie a Ten...does this mean it's a masterpiece? Because it's not - or let's say it a different way: it is a masterpiece because it isn't a masterpiece. Antonioni's Trilogy - these are great films, known to all serious cinephiles. They have a consistent take on the Human Condition. They have lots to say about failure. But here, Antonioni was still developing his language, and so the \"philosophy\", if you want to call it that, was not so omnipresent and all encompassing. In some ways, this is just a melodrama - and I love that! It's the beautiful suffering that women, particularly, do in Antonioni's films that led Andrew Sarris to speak of \"Antoniennui\". But did Monica ever suffer more beautifully than Lucia Bose does here? Let me say it again...Lucia Bose! The film - so relevant to our time - has to do with the capricious nature of stardom. A little Milanese shop-girl has the good fortune to be a world-class babe and gets the Schwab's Drugstore Italian Style treatment...but by the age of 22, she sees that it's all illusion and jive. In her teary- eyed words, she spends Three Months trying to become a Real Actress and no one takes her seriously! And, well, Bose can act - but who remembers her? In some ways, her fate is like that of the character. She was the Euro \"it\" girl of a particular moment, but that moment has not loomed large in the history - she was later than Garbo and Dietrich, earlier than Loren or Ekberg. Antonioni, on the other hand, would develop further, taking many of the patterns and tropes already found in this film and building on them. A couple of examples: Bose and her would-be lover discover that they cannot connect in the shadow of Mussolini's soulless modern suburb EUR (L'Eclisse); Bose's lover (Ivan Desny) is revealed as a weak individual, lacking in conviction, but in desperation Bose clings to him (L'Avventura). And speaking of L'Avventura (where Sandro is a failed architect), you have to love how architecture is destiny in this film. The house that Clara (Bose)'s husband builds for her is a nouveau - riche monstrosity, with all of its anachronisms and longueurs shoved in our face. A Rococco little dressing table is placed up against a Danish modern staircase...Hieronymous Bosch wallpaper competes with Fragonard curtains. All the emptiness and pretentiousness of Clara's husband Gianni (Andrea Checchi) can be seen in the house. This leads to the hilarious yet tragic set piece where the film he has directed, with Bose starring as Joan of Arc (!) is presented (\"a failure, but a noble failure\") at the Venice Film Festival. Oh, I could go on all day - all the uses of the Pathetic Fallacy (Antonioni waits for rain and miserable weather the way other directors wait for the Golden Hour). And Bose statuesque and miserable in her furs framed in the spooky shadows of old movie theaters - pure cinema magic! That Antonioni - has any director been able to critique and revel so much at the same time?",
         "While this is the third feature film of Michelangelo Antonioni, it would mark the second time that Lucia Bose had starred in his film, the first being Antonioni's debut feature Story of a Love Affair. As Lorenzo Cordelli pointed out, Antonioni's The Vanquished had made its debut at the Venice International Film Festival, and in this movie, it contains scenes from the Festival, thereby giving it a somewhat documentary feel as it serves as a backdrop. It tells the story of a fictional star, charting the meteoric rise and fall of her career, and made quite a statement on the Italian film industry of the time, which was producing more than 300 features annually. Again, the female of the species turn out to be quite strong in character, while the male counterparts continue the trend of being rather meek, and lacking some alpha-male qualities befitting of a leading character status. Here, we have Lucia Bose's Clara Manni, a shopgirl from Milan who was talent spotted and brought to prominence on celluloid by film producer Dr Gianni Franchi, who together with the film world, fell in love with the dazzling beauty (Bose herself was crowed Miss Italia once before). In today's context, this would be akin to continued casting calls for any scream queen/sex siren/teenage starlet to be typecast in a role in their respective blockbusters, with nary an opportunity for them to venture out of the tried and tested, all in the name of profit. Being rushed into marriage in the middle of a film production, we see how Gianni turns into a green-eyed monster, possessive of his trophy wife and chiding her for wanting to go along with the norm in getting herself casted in roles that require the revelation of some flesh, be it in steamy love scenes or in seductive poses in glossy magazine spreads. Granted, his idea of marriage is to have her become a homemaker given his wealth to provide her a more than comfortable life, but to Clara, it's akin to being imprisoned. So one will come to expect the usual marital woes that befall couples as fools who rush in, and find themselves smashing head on toward a rocky time. In today's blockbuster world, I guess it's obvious that sex and violence sells. In those days, as explained by the producer character Ercole (Gino Cervi), sex, religion and politics in movies put bums on seats, which accounts for why scantily clad women could have been considered a de-facto \"must-have\" in order to appeal to the lowest denominator amongst audiences. To Gianni, in his good intent to want to elevate his wife's status to drama-mama, decided to make an art-house Joan of Arc (which we are spared the torture of watching, only provided glimpses of it), much against the common grain of film-making, and with Clara being bored to tears, decided to go along with the project. With her Joan of Arc being both a critical and commercial failure, Clara becomes vulnerable. But here's where her character got interesting. Like Eve, she's fully aware of the forbidden apple, but yet found herself weak to resist the advances from a fan. She conscientiously knows of the destructive path she'll be walking down, both in reputation and personal life should she embark on an affair, but I guess the appeal that Mr Nardo (Ivan Desny) had, was being the wedge at the right point in time when she was emotionally at her weakest. Again, Nardo is a slimy male character that one would love to hate, given his motive of personal satisfaction in having to conquer a famous actress. However, you must salute his thick- skinned persistence and his great pretension, well hidden behind a suave demeanour. The saddest character here remains Gianni Franchi. You'll realize that while he has the best of intentions for his wife, life would have it that her reaction to his concern would go unappreciated most of the time. And pride would come in the way when someone who had broken your heart once, come knocking on your door for an opportunity. As Clara's character develops, she slowly learns about her naiveness, and becomes more aware of the business side of the industry. Here's where the film becomes a critical mouthpiece of the state of Italian cinema at the time, which led to potential Claras dropping their willingness to star in the film lest they offend industry folks. It makes comparisons and draws parallels between the exploitation of an actress's good looks, versus grooming them into serious thespians, and through Clara's bold reinvention of herself, one would have thought she would have learnt a valuable lesson to apply, given an about turn with her new found understanding and strength. But as it turns out, there's this invisible glass ceiling in place. I thought the ending was one of the most powerful ones, and a definite heart-wencher, seen thus far. It has a resignation to Fate, that no matter how hard one tried, the outcome has already been pre-determined by the stars, and try as you might, you just cannot effect any change. The streaming of tears down the eye, while masking it as tears of joy and forcing a smile, probably reflects Clara's greatest acting moment to date, smiling to mask some extreme unhappiness toward her life and career choices, that she became nothing more than a train on a railroad, following the tracks laid out in front of her. The absolute last frame that lingers, is well worth a ticketed admission, for the fact that Clara finally got to act.",
         "Clara Manni (Lucia Bosé), a shop clerk, came to Rome in order to become an actress. She was discovered by Gianni (Andrea Checchi), a film producer. Now it seems that she's hit the big time. The film she's making now is bound to be a success. She's a star on the rise. Gianni, the producer, is in love with her, and rushes Clara into marriage with the complicity of her parents. She's not really in love with him but marries him all the same. Marriage at the time was a kind of moral (if not financial) safety certificate. This, by the time (1953), was almost mandatory for women. The marriage is not successful and new roads, provided by chance, offer themselves to her. Clara is a sensitive woman, capable of deep emotions - she gives all of herself in whatever she does. But appearances seem to be more important than feelings in this world. In the end of the film, the tears she sheds while she's smiling, represent her surrender. Lucia Bosé is superb in her role. Clara's need for love, her hesitations and hopes, are subtly shown - her acting is at the same time minimalistic and full of passion. More than the world of cinema, Antonioni portrays the world in which women had to live at that time. His look is deep and compassionate. See a very beautiful and sad film about a \"lady without camelias\" - she lived, loved, suffered, and learned - in the end the flowers were gone and nothing remained but a smile among tears.",
         "\"La Signora senza Camelie\" is arguably Antonioni's first masterpiece. It's about a shop-girl 'discovered' by an ambitious producer who doesn't just want to make her a star but his wife as well and who then proceeds to make her miserable. It's not a great film about the cinema but then that's hardly the point; rather you can see in it the seeds of his later films about unhappy women and mentally abusive men. As the unfortunate Clara, rich and bored like so many Antonioni heroines, the little known Lucia Bose is excellent and visually it is often extraordinary. It doesn't quite fit into the broader and deeper contextualization of the trilogy that began with \"L'Avventura\" but in its treatment of its heroine it is unmistakably the work of its director and it's a much more intellectually rigorous picture than anything his contemporaries was doing at the time, For anyone remotely interested in following the trajectory of Antonioni's career this is essential viewing."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Produzioni Domenico Forges Davanzati",
         "Ente Nazionale Industrie Cinematografiche (ENIC)"
      ],
      "summaries": ["A new starlet is discovered and has ups and downs in Italian films."],
      "budget": 0
   },
   "movielensId": 146996,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1953-02-27",
      "dvdReleaseDate": null,
      "directors": ["Michelangelo Antonioni"],
      "runtime": 105,
      "movieId": 146996,
      "title": "The Lady Without Camelias",
      "mpaa": null,
      "actors": [
         "Lucia Bosé",
         "Andrea Checchi",
         "Gino Cervi",
         "Ivan Desny",
         "Alain Cuny",
         "Monica Clay",
         "Anna Carena",
         "Enrico Glori"
      ],
      "imdbMovieId": "0046313",
      "originalTitle": "La signora senza camelie",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["j2XA4flU8wA"],
      "plotSummary": "A new starlet is discovered and has ups and downs in Italian films.",
      "tmdbMovieId": 93863,
      "avgRating": 4,
      "releaseYear": "1953",
      "numRatings": 1,
      "posterPath": "/uMwSbJ0h2zlHheYAxtFS7qzpRy0.jpg"
   }
}