{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1494191",
      "video": false,
      "title": "The Untold History of the United States",
      "recommendations": [
         47922,
         79823,
         82259,
         295099,
         65501,
         20784,
         47689,
         32087,
         45664,
         47874,
         84177,
         78220,
         9977,
         55401,
         27817,
         51795,
         90214,
         129175,
         280276,
         15260
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 5,
            "character": "Narrator",
            "gender": 2,
            "credit_id": "5961ca919251410b860d1aaf",
            "name": "Oliver Stone",
            "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
            "id": 1152,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d539251416c751376a7",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5961ca6ac3a36828a10e4ece",
               "name": "Matt Graham",
               "profile_path": null,
               "id": 1193665,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5961ca70c3a36828fc0bc6e4",
               "name": "Peter Kuznick",
               "profile_path": null,
               "id": 1666507,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5961ca779251410a590ce199",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.482335,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 189215,
      "vote_count": 22,
      "budget": 0,
      "overview": "Oliver Stone documentary charted the post-WW2 history of the United States.",
      "similar": [],
      "original_title": "The Untold History of the United States",
      "runtime": 585,
      "poster_path": "/2nYjAjtBVEU6mMgCwwu75dkG7Gl.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Showtime Networks",
            "id": 4343,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ixtlan Productions",
            "id": 525,
            "origin_country": ""
         }
      ],
      "release_date": "2012-11-12",
      "vote_average": 8.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": null,
      "directors": [],
      "runtime": 58,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1494191/",
      "coverLink": null,
      "actors": [
         "Oliver Stone",
         "Alan Shearman",
         "Jim Ward"
      ],
      "reviews": [
         "If you want to know the real truth about WWII and not the \"US is the greatest country in the world who saved the universe\" propaganda, then see this film. I'm a Veteran, so I don't get the blind patriotism or the refusal to accept the truth. As I served, just like my father, grandfather, etc and yet, I don't feel a need to excuse the lies we've been fed. So I'm amazed at how people refuse the truth and just accept whatever the 1% running this country has always fed us. Despite the fact that these people aren't a part of the 1%. They still defend their actions. Wake up! The footage is there. The audio, the video, how anyone can deny the US global domination agenda is beyond me. I knew the truth before this film as I have been researching history from more reliable sources and non-biased sources long before I saw this film. It just shocks me to see people fully accepting our version and not verifying anything.",
         "There is a lot of things Americans don't know, but when it comes to history, we look even worse. Oliver Stone has teamed up with Kuznick to tell us the history of the United States, the UNTOLD history. By which Stone means the history that was once known and reported but isn't taught in schools today. I have seen 5 Parts, or Chapters, as Stone calls them, and I must say Im very impressed. Sometimes it sounds a little too Soviet-friendly, but all in all pretty fair. And the acts that are presented can NOT be disputed. Thats the most important thing. So that people who don't agree with Stone can make up their own mind, like I did in some cases. I must say though, its not easy entertainment. Its pure informations for 60 Minutes. I had to pause the show once in a while so I could focus again. I just saw Chapter 5 (Eisenhowers time) and there were a lot of things that I didn't know. I knew the CIA had overthrown a few Gouvernments and installed some puppets, but I didn't know that there were so many.",
         "I cannot express how impressed I was with this work of televisual majesty. Unbiased, well narrated, clearly presented and explained information, just the right amount. Focusing on the real key points to give a brief but in depth understanding, not just of the events, but of their repercussions. Mainstream history is truly written by the those in a position of dominance, and to find out what really happened you have to dig deep and have an open mind, and that is what Oliver Stone has pulled off in abundance! World war two has been an interest of mine for some 16 years now, and even my eyes were opened as to the geopolitical framework that built the world we're in today. Some huge political scandals were missed from most commonly known (and taught) history, I don't know if I agree with all of the opinions, but the facts, the evidence, that speaks for itself! A huge amount of it is quoted, referenced and some from actual recordings from the politicians at the time. And for the sceptics, Yes it does check out, although some is hard to find. After watching this, I've decided to store the recordings to use to help teach my son the real story of what built the world he's entered into. And to give you some perspective of how ground breaking this program is, my son is currently 3 months old! And it will be saved for prosperity until he's old enough to comfortably assimilate such information. That's how important and rare this type of clarity and open minded viewpoint is. Every human being on the planet should turn off X factor and watch this, If they did the human race would stand a much better chance. Oliver, if you ever read this, I hope to meet you one day and shake your hand! Many Thanks.",
         "Here we go again. An excellent documentary that shows the world from the perspective of the whole world instead of just the view \"The United States of God bless America\". Queue the 1 star ratings from the \"true patriots\" that say that anything that says USA isn't perfect must be propaganda. This sort of brainwashing is exactly what is described in episode five. So please don't be fooled by this. This is actual history, if you look this up you will find the events actually took place. Even though sometimes it may seem Stone is trying to make the soviets less horrible it does not mean they weren't horrible, that just means that they weren't the monsters that the American public was let think they were and that the US escalated the cold war just as much as the Soviets. I am actually astonished that the people in the so called \"greatest country in the world\" can't take a look at it self and realize that they might of done some wrong in the past. Please ignore ignorant rantings about anti-U.S. propaganda.",
         "Interesting how most of the negative reviews come from America or countries that do not suffer this \"intervention.\" Cause here in Latin America, no need to tell us. We saw it. We saw an arrogant policy that for years it was believed that he had the right to overthrow democratically elected presidents and replacing them with dictators. Today we know that the tortures were applied during the dictatorship methods taught by the CIA. This is not a theory, documents prove it. And just as I know that the vast majority of Americans politicized are / were against it, I'd like others to at least open their eyes so that it never happens again. Your freedom should not mean the enslavement of others. I leave a loving hug to all Americans who know that. Cause you were as much victims as we went.",
         "For the history buffs and those interested in a less partisan view of U.S. History, that's not always completely told in our school history books, I highly recommend Oliver Stone's Untold History of the United States. History itself, and memories in general, inherit the bias of the observer. Further retelling, teaching, and writing of the event also serve to inject patriotism, nationalism, bias and opinion into the mix. This documentary series does well to attempt to strip out all of that, and to see the gray beyond just the black and white. The show looks and sounds like the history shows we all grew up on in school. This should be known going into it, it is not an enthralling Oliver Stone dramatic movie, but it is well produced. For those interested in the subject matter it will easily keep your attention. In fact it's often difficult to break away momentarily because the pacing of the imagery and information rarely has a lull.",
         "What strikes me the most is that the negative reviews of the series actually confirm everything Stone wants to say. The series is actually brilliant. The book might be even more brilliant. Yes, it is subjective. And yes, it focuses on certain issues more than other issues. And that's because human beings are subjective; history is written and examined by human beings. On the other hand, the series -- and the book-- say right out from the start that this is not the complete history, it's only the part that people don't hear about. That's why it doesn't concentrate on 'other views' or the 'other side' of what it says. Add to that, film is a form of art. And this is the difference art can make when it deals with history. The series does, in 99% of the cases, state facts very clearly and don't see events and people in black and white. And I have come to believe that people who accuse material of being propaganda are the very victims of propaganda. They are those who want to paint the whole world in one brush and put label on people, things, countries, races, ideas, etc. as 'good' and 'bad.' Personally, I think that is the definition of intellectual terrorism.",
         "\"History is a lie agreed upon...History is written by the elite and the winners of War\". These often quoted phrases or variations thereof (as just stated) is what is at the heart of this riveting and deep dissension piece. The \"facts\" or the \"truth\" can often times be opinions or guesses, as pointed out by the series, there is much we aren't readily aware of because of the, willful or not, misconstrued presentation of events. What is routinely accepted as the \"way things were\" is forever tainted, misinformation, disinformation, myth-information, slanted, withheld, covered-up, politically correct, unknown, and simply much of it is ethnocentric to say the least. What's refreshing in this 10 hour mini-series is that it can inspire inquiry and rebooted thought. Not revisionism, but a re-visitation and educational path toward illumination and possibly in some cases enlightenment. There never is one side to any story and reflection, curiosity, and interest in events that shaped our world can never be a bad thing. Except, maybe, for those who benefit from the status quo.",
         "First off, I had not learned in my most recent 10 years of formal education even half of what I've learned after watching this series. If you have many times got confused, felt something missing, frustrated by concealed fallacies after reading numerous texts on recent history, then you'll be relieved by Oliver Stone and Peter Kuznick's Untold History of the US. Some say there's nothing untold here, which may be true, but it's never been told in such compact, coherent, true way and void of propaganda. It helps you connect many dots, backed by real archives of footage, articles, papers, interviews, etc. This is not just about the US, it's about the world. Don't miss it.",
         "The next episode: Bush and Obama, the Age of Terror. This shows that Stone rises above petty partisans left and right. The series is well done and everything is the verifiable truth. It shows that the last war the US fought that had any merit, honor, or valor was WWII. Even as powerful corporations propped up Hitler. Stone during this series, is breaking down how all the way to today we have been saddled with war criminals from the Nixon administration. Murders and tortures we still coddle. They write books, go on speaking engagements, and even obtain cabinet positions in democratic administrations. Stone is showing, that after PNAC got it'd \"new Pearl Harbor\", they were more than ready to roll out an already printed 400+ page PATRIOT ACT that our treasonous congresspeople did not even read, because they were terrorized with US government anthrax. That terrorist remains at large. The USA is now full speed ahead towards fascism. Oliver Stone is doing us all a public service. Our enemies are at home, enemies of freedom, children, life, liberty and the pursuit of happiness. Every president the last 40yrs has been a war criminal. This inauguration, the war criminal for the next 4 years will swear in on two bibles. Bibles of men who he dishonor with his export of drones over foreign sovereignty land. Creating more people who justifiably hate murders of children and women. Right-wing rush-bots are slamming this series with 1 star reviews. They can't even be anonymously honest. Hey cretins, how does it feel to see Stone call it so right. You cold war nuts still have it out against the \"commies\". The Great United States of America now: Tortures-sodomy of kids,rape, Culture of rape,suicide,murder, No Habeus Corpus ,No Posse Commatus ,No Due Process, No Right Privacy, Free Speech Zones -(bush the lesser) Domestic drones, TSA-fondling children rapists,coaches,priest-authority figures, rabid, racism,homophobia, and more fear. A whole network for propaganda,lies and race baiting. right- wing hate radio, talk of right-wing states seceding, corporate owned media,beholden to, the corporations not the people. science deniers. I have seen the enemy....he is \"us\". I could I forget Camp X-ray aka Gitmo, gulag. Abu-Ghraib, Mai-Lai, shock and awe. I'm getting sick typing all these atrocities. Yet you right wingers have the gall to call this series propaganda. You would not know propaganda if it bit you in the rear. Sounds like all the crap the bad commies did to others. Even then, only Hitler decreed he'd take his terror global. Now, we are the global killers. I'm surprised Stone did not mention \"Operation Northwoods\" the blueprint for 9/11. Shootings, airliners,and terror to usher in, as poppy bush called it, the New World Order. He at least covered the right-wing coup of 2000. We are all surveillance now. Obama had his chance, to prosecute the criminals for a war based on lies(All US wars). He did not, because he grew up idolizing these monsters. This series is long overdue. Too bad it is on a premium channel, most people will miss it.",
         "Based on a friend's recommendation, I just started this original Showtime documentary series, and it's an amazing show so far. I've only gotten through the first two or three episodes so far, but I'm hooked! Veteran legendary filmmaker Oliver Stone narrates and directs this series- which attempts to cover American history, beginning with WWII, from more of an international perspective. Now I'm not terribly far into the series as of yet, but so far I'm not seeing the evil America some other users have mentioned this show depicts. While not perfect, it seems Stone's series is portraying America's loss of innocence more so after the atomic bombs were dropped on Japan- as a way of expressing U.S. military might more for the Soviets' sake. A lot of this stuff in this show I was already aware of, but yes there are a few things here and there that I didn't know about- like this guy Wallace, FDR's original running mate/VP- he was awesome! What would this country- and the ultimate state of the world- have been like had HE continued as Roosevelt's backup instead of the amateur-ish Truman-?? Well, I would definitely recommend this show. I can't wait to continue my viewing of the rest of the series!",
         "The Untold History of the United States is a 10-episode (12 episodes for the newly released Blu-ray and DVD)documentary series that re- examines and investigates important events in American history during the 20th century and the first decade of the 21st century. It was narrated,produced and directed by controversial director,Oliver Stone.American University historian Peter J. Kuznick,editor Alex Marquez and British screenwriter Matt Graham collaborated with Stone in the production of this documentary series. The documentary series features events from the time of the late President Franklin Delano Roosevelt up to the events during the first term of President Barack Obama. The episode format consists mainly of archival materials like stock film, photographs, video and audio recordings, computer generated maps and diagrams.Interestingly,clips from several movies that features the historical events that were being discussed were included such as Mr. Smith Goes to Washington,Nixon,W,Zero Dark Thirty and many others. Oliver Stone and his collaborators did a wonderful job of presenting the documentary series.It was evident that a lot of effort was exerted in it. Added to that,the viewer was definitely given an opportunity to closely examine the under-reported events that have happened especially during the middle part of the 20th century when World War II happened.Aside from that,we also witnesses a close investigation on how former US Presidents from Roosevelt up to George W.Bush have affected the nation with both the good and the bad things they did during their terms as President to the country.What is also interesting is the fact that also closely examined what the country experienced during the tough economic times like The Great Depression during the 1930's and The Great Recession during the 2000's.Added to that,we also get to see how Stone tried to investigate the bad things that the United States did during World War II,The Vietnam War,The Cold War,the War On Terror and the wars in both Afghanistan and Iraq and effects that it brought into the country such as the dropping of the Atomic Bomb at both Hiroshima and Nagasaki in 1945,the production of nuclear weapons and many others.Finally, with Stone,you definitely have to expect discussions of dark conspiracies that the U.S. was involved throughout in history. I have to say that it was definitely well-made.But if there is one thing that made me uncomfortable about it,it is the fact that it has strong feelings against the country's involvement in the affairs of other countries.The documentary has strong feelings about the country policing the world and trying to prevent the spread of communism especially during the Cold War and with the country's participation in the Korean War,Vietnam War and wars in the Middle East.Aside from that,I felt that the documentary tried to show everyone that the U.S. did it for selfish reasons alone when in fact,the country has its own good reasons in doing so.One has to watch this part with an open mind especially with respect to the country's global role.But overall,it was definitely a worthwhile documentary and there is a lot to learn from our complex and shared American history.",
         "I am on episode 4. This is an excellent narrative. Although hardly an eye opener to anybody not brainwashed by American propaganda machine. Stone's premise is that by sabotaging Henry Wallace's VP ticket America left the progressive trajectory and turned itself into a British empire substitute with its citizenry subjugated to the wills of the military industrial complex (MIC). This rings quite true, especially given the warning that Eisenhower himself made in his farewell address, which is ironic since MIC flourished during his presidency. So far I noticed only one incorrect fact - USSR never captured Finland. Now, I would like to address some of the issues others brought up. Statement that Stalin's atrocities were not mentioned - not true. All the important bits are mentioned : Katyn massacre is mentioned. - Decimation of officer elite of the Red Army prior to the war is mentioned. - Gulag is mentioned. - Firing squad behind front lines that would execute anybody retreating. - Allowing Germans to drown Warsaw uprising in blood by stalling the attack on the city. - Mass rape of German women is mentioned. - Invasions into Hungary and Czechoslovakia were mentioned mentioned. These are well known facts, all are mentioned. As for the general theme of the narrative, this is exactly how Soviets perceived the US (and UK) during WWII and after the war. Soviet point of view is : UK and US were stalling opening second front in Europe for as long as possible to the point that it became irrelevant. By all means it looked like the second front was opened with the purpose of not allowing the USSR to march all over the Europe, that is to contain \"red invasion\". Granted the war would have lasted longer, but for USSR it did not make much difference anyways given already staggering amount of war losses (5 more or 5 less lost millions did not matter anymore). To those who say that American actions in Africa diverted German attention from Eastern front - less than 20% of German casualties came on African front. Even if Rommel was in charge in the battle of Kursk it would not have changed the outcome. Dropping of the A-bombs on Hiroshima and Nagasaki was done not to get Japan to surrender (which they did not immediately after bombings anyway) but to show Stalin who is the boss now. A grave mistake by narrow minded hawks in Washington. This is when they created the Cold War. Of course MIC needed this like fish needs water. Warmongering would just get the contracts coming. To those idiots that write about leaflets being dropped on Hiroshima and Nagasaki prior to bombing. Here is the article on leaflets: https: //en.wikipedia.org/ wiki / Atomic_bombings_of_Hiroshima_and_Nagasaki#Leaflets Particularly: \"In preparation for dropping an atomic bomb on Hiroshima, U.S. military leaders decided against a demonstration bomb, and against a special leaflet warning, in both cases because of the uncertainty of a successful detonation, and the wish to maximize psychological shock.\" Even with leaflets dropped elsewhere. Like it absolves of the war crimes somehow. Reminds me of this lawyer speak idiocy like \"this cup contains hot liquid\" on coffee cups in McDonald's. So it is theirs Japanese own fault they got fried, we told them to leave. So the fact is that US was the first and the only country so far that has used Nuclear weapons in the war. Not the evil Soviets. The bombs were dropped on the cities that had little military value. Even if justification was to cause Japan to surrender, frying 200K civilians to achieve this goal is a textbook act of terrorism.",
         "To clarify one thing: I am not a big fan of documentaries at all! They often get boring, because they often take way too long to say somethings. Not to mention the irritation I feel from the often wrong or skewed information they present. They try to make you believe eating meat is worse for CO2 production than gasoline usage or tell you pyramids are made by aliens and take 2 hours to do so. However, this documentary is by far the best I have ever seen! The density of information is super high, I actually was able to watch it 4 times and still pick up something new every time. Everything is fact checked by them and by Showtime (not a USA critic organization). And I haven't found a mistake in the whole series. And once I finished I felt disappointment there wasn't more! What a series! You (almost) never see the narrator talking, there are constant video fragments, edited extremely well. And what a clarifying view on history! The stories focus on where the USA went wrong AND where USA almost went right but unfortunately didn't; in stark contrast to the bulk of the stuff we have been fed. An important theme of the series linked to the period discussed is the threat of nuclear war. Everything they say is still extremely relevant with the cold war regaining strength. Go enjoy this documentary, you won't be disappointed!",
         "I haven't found a documentary series so riveting and eye opening in a very long time I am not even much of a history buff at all but even so I started watching it expecting to be bored and move on to something else before the first episode had ended but instead binge watched all of them in a single day The amount of times it showed me a bit of modern history that I was sure I fully understood at a basic level only to reveal that what was actually happening was drastically different and in some instances quite disturbing Possibly the main example of that for me is the stuff pertaining to the dropping of the atomic bombs on japan and the way the fleet admiral viewed the Japanese people Then in a very close second is the fact that it was really Russia who won world war 2, not us and the Americans by killing almost 80% of the German soldiers that died as well as putting the \"horror\" of the genocide and allied casualties into a new perspective with the fact that the Russians lost 30 million men women and children whilst pushing the Germans back An absolute must watch series in my opinion Enjoy",
         "Honestly, I learned a little something during training at school and academy, because the volume was high and the absorption of small ... I fear the credibility of the textbooks should be no more than this film, who for us these historians that they wrote who Oliver Stone for us? Can we completely trust only ourselves. I'm sure that Oliver wanted to tell the truth, the more he shows that it is well-intentioned and exposes the story within sight from the third position. Thanks to him I learned more aggressive US light, if it is true, and in fact he had no reason to lie about this, it means that the country has for a long time loses the confidence of its citizens, a fact! For me at all surprising that even he acknowledges the majority of peacekeeping operations on the part of my country. Information from the pressure of America suffered even me. For my country, I began to be treated worse after studying the history of the academy. After watching this show my attitude toward his own country is much improved! Thanks to Oliver Stone!",
         "It is possible that this history is new to many people, especially they gave up with history in elementary school. In school simple stories are taught and quite a few myths too. While this series aims to be new there is nothing in that is not known but Stone gives some undue emphasis to certain items. He and the team that made this commit several unforgivable sins of historical methodology and analysis which mean that the series fails convince. The approach is to retell all the events we know – that if we read a few books besides the school texts. Fine. Good background but what this method does is lull the audience with the indisputable and then mix in debatable, which becomes acceptable. That is a subterfuge. The method is clearly signaled and makes the 'essay' of this series like a very good high school essay but which has many, many flaws. A good starting point is the perspective. Stone's tacit premise is that government does good things and when it doesn't or acts in terms of real-politik, he is upset. But there is no reason for government to act with high moral purpose. It is a matter of degrees. Looking after self-interest is expected; genocide and war are not acceptable. It is not either/or but not to Stone who has the view of a naïf, one that he carries in his films, that somehow having discovered the world is not nice, it must be morally purged. Well that is great for 7 year olds but real adults and governments have other things to manage. This last point is expressed in his fairness doctrine toward the Soviet Union. He treats US Soviet relations as one of deceit by the US on the basis of political philosophy alone. That is a falsehood but what his left out is that the fear and loathing toward communism in the 1920s and beyond was triggered more by its atheism. Fear of atheism triggered fascist responses and the disparate coalition against the Soviets. This is forgotten now but something more elemental to a person than political allegiance is their religion and to politicians in the US and UK and elsewhere this made it necessary to destroy communism. One may not agree, but nowhere in history has it been doctrine that alternative views must be given a good chance or a fair turn as if this was the school play yard. Finally, Stone makes the laughable error of believing every quote as rendered. If historians did that they would be taken apart by their peers in review. More analysis is required not just using the juicy quote like a cub reporter and believing that you've nailed the case for the negative. That is school stuff. The more serious side of that is that in using quotes in such a simplistic manner he believes he has established a case when dissent is a normal part of political life. So, some people didn't believe carpet bombing was right or some other thing, that is normal, hardly new unless you hold a child's simple notion of good government, always ethical. Time to grow up! Ultimately this may be good for those viewers who have no idea of the last 70 years. For anyone else this is not worthwhile at all.",
         "Interesting documentary with Director Oliver Stone narrating. I found the information regarding the Eisenhower Administration most interesting. By the end of the documentary, Eisenhower didn't exactly come off looking too well. When he left office in 1961, Eisenhower was ranting about the military industrial complex-yet the documentary showed that his administration contributed to such a belief. With Stalin's death in March of 1953, the Soviets were making overtures to the American government for more peaceful relations. Not only did America ignore these signs, our country according to this documentary, took a very hard line regarding the Soviets. Much of this was blamed on Secretary of State John Foster Dulles.",
         "I am a huge history buff and know that history \"Is written by the winner\". This does contain a large amount of the untold stories of U.S. history that many of us did not learn in school. And just like the \"told\" stories of U.S. History it runs into it's own bias. I don't think that anyone would call Oliver Stone as unbiased in the stories he tells. As a true believer that you look at as many sides of history as possible and then the truth will lie someone inside of all. As you can probably tell I am not a big fan of this series as our \"true\" history of the U.S.. I do consider it a \"must watch\" because it does bring different points of view to a large audience. I hope this will do what it does for me and that is to get everyone to \"think\". I don't see this series converting people into everything Oliver Stone will have you think this was really how it was. But I think it will get most people to think \"well I did not know that also happened\" and incorporate it into things that they also have learned. Again no matter what side you fall on it will make you think, so is worth watching.",
         "On technological level it is not worse that some BBC documentary series. On historical level it is hopeless. Oliver Stone quite often seems think, that he knows what was inside heads of mass murderers from past, what is questionable, and itself is enough to remove \"History\" from the title. Why Stone's work is harmful you may ask? This is what he says about Stalin: \"Stalin recognized the truth. His country was facing its most deadly enemy alone. He needed to buy time and fearing a German-Polish alliance to attack the USSR he shocked the West when he signed a nonaggression pact with Hitler dividing Eastern Europe between them. Stalin's primary concern was the security of his own nation. In fact the Soviet dictator had proposed the same alliance with Britain and France but neither would accept Stalin's demand to place Soviet troops on Polish soil as a way of blocking the Germans.\" Sounds acceptable? So lets do small transformation: \"Hitler recognized the truth. His country was facing its most deadly enemy alone. He needed to buy time and fearing a Juish-Polish alliance to attack the Germany he shocked the West when he signed a nonaggression pact with Stalin dividing Eastern Europe between them. Hitlers primary concern was the security of his own nation. In fact the Germans dictator had proposed the same alliance with Britain and France but neither would accept Hitlers's demand to place Germans troops on Polish soil as a way of blocking the Russinas.\" Do you still accept it? Both quotes are worth the same.",
         "Oliver Stone starts the series criticizing the standard of history education in the US, then in just the first episode he uses England and Britain as if they were interchangeable terms, and the on screen graphic for the Soviet invasion of Finland shows absolute victory and occupation, as with the Baltic states. Even the remotest checking of history will tell you that the Soviets invaded Finland in 1939, and had a torrid time of claiming a marsh or two. This series has clearly not had the slightest bit of editorial proof reading by a qualified historian. These obvious and blatant errors must call into question the content of the whole series.Lamentable!",
         "This is an interesting production: some will call it a documentary, some will call it propaganda, some will call it an educational work and some will call it fiction. It is all of these things at the same time. First of all, it is clear that Stone has his on view on the past history and his view is often opposite to the official narrative. A possible key in understanding this work is to see it as very USA-centric: the role, and errors, of the other players is often downplayed. Often this work highlights the errors of the USA government, while downplaying the importance of the actions of other governments. As for the historical accuracy, there are some problems, mostly due to omitted explanations. An example: both the first and second gulf war are heavily criticized and a casual watcher may not see a difference between them. But the first intervention in the gulf was UN- sanctioned and waged by 34 nations, while the second was an aggression based on lies (presence of WMD). The show intermixes historical footage, charts and fiction. The fiction parts are TV shows or movies of the past, used to illustrate the view of the popular culture on a topic (e.g. communism, nuclear war, ...). Sometimes, during historical footage, a narrator voice pronounces quotes allegedly from an historical figure. Often this narrator has a phony accent, trying to imitate the historical figure's voice. Some of these dubs are really irritating, since it is not made clear that this is not the voice of the historical character. From a technical point of view, the pace is spot-on and the narration is fluid and it follows a coherent flow: i.e. the whole thing never gets boring. The montage also contributes to the pace: there is a cut every few seconds. In any case: do not let your political viewpoint affect your judgment on this show. I think it is worth watching, even more so if it stimulates you to read some additional material on the topics presented.",
         "These episodes are a good addition to the mental library of a serious history buff. For a big-picture treatment, this series does make quite a few boo-boos at the big-picture level. Examples: 1) We hear several times a thesis that \"Stalin always kept his word, so why didn't we make better friends with him?\" Back at home, Stalin wasn't keeping his word very well. Should we have ignored what was occurring in the Soviet Union? Sure, there's occasional mention of Stalin's brutality. It seems thrown in, to avoid omitting it altogether. 2) We hear that Japan was ready to surrender and Truman wanted to use the bomb as leverage at Potsdam. That's a reasonable thesis. But that was only part of the picture. It cannot stand alone. If we examine everyone's motives at the time, as this film partly did, what emerges is not the simple feeling we get from the film: \"America bad, Japan not as bad.\" Still, it's fine to have these details offered up. They even mention the 45,000 Korean slaves who were in Hiroshima on that tragic day. In hindsight, Oliver Stone's ideas are okay as learning opportunities. It's not fair to assume that Americans living in the mid-20th Century should have known then what we know now. But it's fair to second-guess them now as a meditation for future use. That will happen to our times too. I've watched the first five episodes and plan to watch the rest.",
         "As I watched the \"documentary\" on the dropping of the Atomic Bomb I was struck by how partisan the theme was. It was no until it was over did I see that it was an Oliver Stone production. That explained all of the Truman bashing. This thing was so far from unbiased that it was almost funny. These \"documentaries\" remind me of Ollie's films \"JFK\" and \"W\". Both were absolute hatchet jobs. I am now watching the Cold War comedy...er documentary now. So far it's a joke. Oliver takes himself far too seriously as a historian. What amazes me is that Showtime actually paid him to produce this garbage. He absolutely hates Truman and all Republicans.",
         "Watching this now and I'm amazed that Stone is casting Stalin as a good guy without mentioning the fact that under his regime his govt was up to its eyeballs in atrocities. Stone is trying to paint his series as a history that is complex and nuanced. But without alluding to the distrust that the US, France, Britain and Poland had towards the Soviet Union which was committed to exporting bloody revolution to every nation - and the difficulties they had in forging an alliance with a communist dictatorship that had slaughtered 20 million of its own people - and embarked on a war against a smaller democracy, Finland, Stone is just giving us a 1950s Soviet propaganda view of history."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": [
         "Ixtlan Productions",
         "Showtime Networks"
      ],
      "summaries": ["Oliver Stone's re-examination of under-reported events in American history."],
      "budget": 0
   },
   "movielensId": 147252,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2012-11-12",
      "dvdReleaseDate": null,
      "directors": ["Oliver Stone"],
      "runtime": 585,
      "movieId": 147252,
      "title": "The Untold History of the United States",
      "mpaa": "G",
      "actors": ["Oliver Stone"],
      "imdbMovieId": "1494191",
      "originalTitle": "The Untold History of the United States",
      "genres": [
         "Documentary",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Oliver Stone documentary charted the post-WW2 history of the United States.",
      "tmdbMovieId": 189215,
      "avgRating": 3.5625,
      "releaseYear": "2012",
      "numRatings": 16,
      "posterPath": "/2nYjAjtBVEU6mMgCwwu75dkG7Gl.jpg"
   }
}