{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0079902",
      "video": false,
      "title": "Sherlock Holmes and Dr. Watson: Acquaintance",
      "recommendations": [
         72093,
         84254,
         126846,
         127608,
         126850,
         63304,
         126854,
         270393,
         85035,
         57778,
         78132,
         79216,
         129229,
         63899,
         160046,
         36162,
         65142,
         213321,
         36163,
         72204
      ],
      "backdrop_path": "/yVRVxBQmNFX2f55bPUnDYIuxsdT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Шерлок Холмс",
               "gender": 2,
               "credit_id": "52fe4857c3a368484e0f4083",
               "name": "Vasiliy Livanov",
               "profile_path": "/eo4MRCTUcvq0IWfab64d7jw0V8H.jpg",
               "id": 1082610,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mrs. Hudson",
               "gender": 1,
               "credit_id": "5986f124c3a3681df00055fd",
               "name": "Rina Zelyonaya",
               "profile_path": "/vrJ6KM85H96W8SezKyBa7vaqGWE.jpg",
               "id": 86762,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. Watson",
               "gender": 2,
               "credit_id": "5986f17e92514152840062d6",
               "name": "Vitali Solomin",
               "profile_path": "/x3XY8ZA9hvhNij3nJiBFxqKbnqD.jpg",
               "id": 235983,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "58c3d074925141341f002135",
            "name": "Igor Maslennikov",
            "profile_path": "/bDYVHimE6jZBiz6rAoCekn4zJ5r.jpg",
            "id": 240351,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 1.780423,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 72095,
      "vote_count": 20,
      "budget": 0,
      "overview": "Doctor Watson moves in with the eccentric Sherlock Holmes and they get a case to solve. A young heiress seeks Holmes' help when she feels threatened by her brutish stepfather after her sister dies under mysterious circumstances.",
      "similar": [],
      "original_title": "Шерлок Холмс и доктор Ватсон: Знакомство",
      "runtime": 67,
      "poster_path": "/iemijsiI3xMa7iThMRdf9jLIN2k.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/b8N0K4dvM6CNG9OE5v1lLh5bSb3.png",
         "name": "Lenfilm",
         "id": 10845,
         "origin_country": ""
      }],
      "release_date": "1979-01-01",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 67,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0079902/",
      "coverLink": null,
      "actors": [
         "Vasiliy Livanov",
         "Vitali Solomin",
         "Rina Zelyonaya"
      ],
      "reviews": [
         "When you visit museum of Sherlock Holmes in London, Baker St., first thing that you see on the second floor is a number of pictures of all actors who ever played Holmes in the movies, and in the middle of that compilation you can see the biggest photo - the photo of Vasiliy Livanov. All world cinematographers (including British ones) have admitted that Vasiliy Livanov is the best Sherlock Holmes that ever appeared on screen. And it is true. There were made several movies about the adventures of Sherlock Holmes and Dr.Watson for Russian TV in the late 70-ies and early 80-ies, including such films as The Meeting, The Hound of the Baskervilles, Bloody Script and many more (about 10 total number). Livanov as Sherlock, Vitaliy Solomin as Watson, Rina Zelenaya as Mrs.Hudson, Borislav Brondukov as Inspector Lestrade all make these series directed by Igor Maslennikov an all-time masterpiece. Almost all of actors started their careers in theaters (Livanov, Solomin and Zelenaya continued giving performances even after their success on the big screen) which gave films amazing atmosphere of reality. The images of old London were carefully reconstructed in Baltic cities almost untouched by time which gave movies a lot of similarities with real XIX century London. All movies (it wouldn't be right to call them episodes) are set on very high level, and from the opening unforgettable music score they charm every viewer. It's very hard to distinguish the best film of the series, every of them has something unique. The Hound of the Baskervilles for example has the greatest number of participating celebrities, including Nikita Mikhalkov (internationally known for directing and playing in such movies like An Unfinished Piece for Mechanical Piano, The Barber of Siberia, Oscar-winning Burnt by the Sun etc.), Oleg Yankovskiy (Nostalgia by Tarkovskiy), Evgeniy Steblov and many more. This set of movies is a must-see for everyone whether you've read the book or not. It's rather difficult to find these movies with English subtitles but they exist and trust me, they worth searching for them. 10 out of 10 for all films.",
         "This TV production from the Soviet Lenfilm studio is a superb screen translation of the Sherlock Holmes story to the screen. The producers found ways to remain very faithful to the original stories by Sir Arthur Conan Doyle while modifying things slightly to make them work well as films. Here they embellish the first parts of \"A Study in Scarlet\" before moving into a pared-down \"Speckled Band,\" and it works very well as a film on its own. It's an unanswerable question to me who the best screen Holmes (or the best Watson for that matter) was. Some have certainly been better than others but each has brought unique and interesting qualities to the role. It is enough for me that here Vasili Livanov and Vitali Solomin are extraordinarily good. Their performances are magnetic viewing and full of subtlety. Every scene between the is memorable. In the first half of \"Acquaintance,\" the real mystery doesn't revolve around a crime but around Sherlock Holmes' character -- and Watson, whose character -- a romantic, artistic, intelligent doctor who would like to think he minds his own business but really does not -- is wonderfully fleshed out -- is the detective. This makes perfect sense as a way of introducing the two characters, but still seems like an innovation here. It also looks wonderfully lavish and the filming is contrastingly expansive and suspensefully claustrophobic. It's clear a lot of care was well spent on these adaptation, and it is only right that they should have received notoriety decades after they were filmed and far from the former USSR.",
         "Vasili Livanov dons the deerskin cap for the first time in the Russian series \"The Adventures of Sherlock Holmes and Dr. Watson\" and does an excellent job at it. The movie begins with the titular acquaintance between Holmes and Dr. Watson as Watson, fresh from the East Indies, moves in with Holmes and in the 221 Baker Street apartment. Shenanigans of a mysterious, often baffling nature, lead Watson quite humorously to suspect Holmes as a criminal mastermind of some kind before he reveals himself as a private detective. The ensuing murder mystery involving two sisters, their stepfather and a heritage is not all that good but for an introductory film it's nevertheless solid material. What really stands out is the baroque atmosphere and sets, the cinematic feel for a movie that was practically made for TV and the cinematography that uses heavy blacks and lush colours.",
         "A lot of people make a big deal about the fact that in the Sherlock Holmes museum, Vasiliy Livanov's picture is the largest. The only thing this proves is the British found a great way to soften relations between the U.K. and the Soviets. I see it as a political maneuver, and little else. There is no doubt that these films are of excellent quality, but they suffer from an overemphasis on the farcical. In particular, Vitali Solomin's portray of Watson borders on camp at times, with little subtlety. The relationship between Holmes and Watson, something that is near and dear to many a fan's heart, is too kitschy. Missing is the deep, abiding friendship that Jeremy Brett and David Burke (and later, Edward Hardwicke) portrayed so eloquently in the Granada productions. The Baltic locations are clearly Eastern Europe and at times that is a bit distracting. The biggest problem is of course, the language. First of all, the subtitles have been poorly done. I have spoken to a couple of people who speak Russian and English who have bemoaned the quality of the subtitles. They assert that English-speaking audiences would appreciate the films more if they could experience them as intended rather than through the poor subtitles. Some characters are meant to be heard in their native language and Holmes is certainly one of those characters. Hearing Doyle's detective speaking Russian is very distracting as are the poorly translated subtitles. Perhaps in the future someone could redo the subtitles and the films would benefit from this. The most interesting thing about these films are the little jokes and ironic elements that are littered throughout. Little jabs at the Soviet government and the British are present and done very slyly. In one instance, Doctor Watson is speaking to Holmes about his lack of understanding of things outside his profession, but it is clear he is speaking of the oppression of the Communist government in the Soviet Union. Watson says, \"How awful it would be to live in a world, where you couldn't talk to anyone about poetry, about art, or politics.\" The irony is, the actors in this film — at the time this production was made — did live in a place where you couldn't talk about many things without fear of reprisals. There are quite a few of these moments and it is very interesting to listen for them. Surely the producers of these films had to be very careful not to glorify a society of the West, albeit a hundred years in the past. Perhaps it was at the behest of the Communist party that Holmes gets the following line: \"The British are conservative, and we don't like changes. Anyone who is not like us in the ways of mind, is easily taken for a rogue\". Great fun. These films do deserve their place in the cinematic Holmes canon, but more for what they reveal about the Soviet Union at the time and their relations with the British. An interesting interpretation that demands viewing, but ultimately pales in comparison to the Granada productions with Jeremy Brett."
      ],
      "genres": ["Crime"],
      "productionCompanies": ["Lenfilm Studio"],
      "summaries": ["Doctor Watson moves in with the eccentric Sherlock Holmes and they get a case to solve. A young heiress seeks Holmes' help when she feels threatened by her brutish stepfather after her sister dies under mysterious circumstances."],
      "budget": 0
   },
   "movielensId": 147330,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1979-01-01",
      "dvdReleaseDate": null,
      "directors": ["Igor Maslennikov"],
      "runtime": 67,
      "movieId": 147330,
      "title": "Sherlock Holmes and Dr. Watson: Acquaintance",
      "mpaa": null,
      "actors": [
         "Vasiliy Livanov",
         "Rina Zelyonaya",
         "Vitali Solomin"
      ],
      "imdbMovieId": "0079902",
      "originalTitle": "Шерлок Холмс и доктор Ватсон: Знакомство",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Doctor Watson moves in with the eccentric Sherlock Holmes and they get a case to solve. A young heiress seeks Holmes' help when she feels threatened by her brutish stepfather after her sister dies under mysterious circumstances.",
      "tmdbMovieId": 72095,
      "avgRating": 4.09292,
      "releaseYear": "1979",
      "numRatings": 113,
      "posterPath": "/iemijsiI3xMa7iThMRdf9jLIN2k.jpg"
   }
}