{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114783",
      "video": false,
      "title": "Under the Gun",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frank Torrence",
               "gender": 2,
               "credit_id": "52fe490c9251416c750bbdd3",
               "name": "Richard Norton",
               "profile_path": "/yrNyqJ9vhTdtgKhlGhPMtEOySLy.jpg",
               "id": 66055,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "57265bc5c3a368180a0048f3",
               "name": "Kathy Long",
               "profile_path": null,
               "id": 159663,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "57265bd392514132b8003326",
               "name": "Jane Badler",
               "profile_path": "/lSZN0DD4OJE4mdtgr7TlzMCpzdv.jpg",
               "id": 70827,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "57265badc3a36851e50008f0",
            "name": "Matthew George",
            "profile_path": null,
            "id": 935798,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.036478,
      "production_countries": [],
      "id": 92737,
      "vote_count": 1,
      "budget": 0,
      "overview": "A debt-ridden night club owner has to take on Italian and Asian mobsters, corrupt police, and an angry pimp that he threw out of the club to try to keep his club in business.",
      "similar": [],
      "original_title": "Under the Gun",
      "runtime": null,
      "poster_path": "/evVyHLXLZwyyS4CHR2KxTgtJBcr.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-12-26",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "You can't outrun a bullet.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matthew George"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Matthew George"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114783/",
      "coverLink": null,
      "actors": [
         "Richard Norton",
         "Kathy Long",
         "Jane Badler"
      ],
      "reviews": [
         "'Under the Gun' is one of those movies which can be hit or miss. It's not really martial arts movie, It's actually much more than that. Norton's character is running the night club which he wants to sell and get away with his wife but obviously one last night in the club turns out to be the worst night of his life. I have to say that I was impressed with Richard Norton's performance. This is the first time I have seen him doing real and I mean REAL acting. Usually his movies are packed with top notch martial arts but not acting. Aside from Norton, we have Kathy Long who's top billed but appears on screen for a few minutes only but she does have a two very nice fights. All other actors are pretty much unknown and rather weak(especially one eyed policeman) but it doesn't affect the movie. There are not many fights but those we have look very good, especially Kathy Long ones( 'cause they are very dynamic). Besides the fact It's much more of a thriller than an action film, It's very fast paced. Definitely worth to see, just to realize that Richard Norton is pretty good actor.",
         "Comeuppance Reviews fan favorite Richard Norton stars as Frank Torrance, a man under so much pressure, he makes \"Stressed Eric\" look like a pot-smoking sloth. A former star hockey player, Torrance now owns his own nightclub, named Boilermakers after his old team. The problem is, he is deeply in debt, and the Italian mob as well as the Triads have him in their sights. He is also involved in a war with an army of corrupt cops and DEA, led by the evil, eyepatchioed Det. Dexter (Robert Bruce). Add to that, every slimeball in the underbelly of society has a beef with Torrance. He's trying to escape it all and fly far away somewhere with his wife Sandy (Badler), but even his flight plans are going wrong. He must use his wits, and of course his formidable martial arts skills to solve his many stressful problems all in one night. Can he do it, or will Frank Torrance be \"Under the Gun\" his whole life? As Co-Producer and fight choreographer on the film, as well as starring, Norton wore many hats. Was he as stressed as Frank Torrance during the shooting of the film? The back of the DVD box says \"likable action star Richard Norton stars...\", and it is true, Norton does turn on the charm for this role. He had a lot of creativity with the many, many fight scenes in the film, even sporting some of the first \"mop-fighting\" scenes since The Toxic Avenger (1984). He even does some MMA-style takedowns, which was pretty awesome for 1995. It's a joy to watch Norton fight, as well as act, it truly is puzzling why he isn't really known outside of action movie circles. He's supported well by Peter Lindsay as his old buddy Harry, and Kathy Long as Lisa, who is not too shabby in the action department either. You may remember her from Albert Pyun's Knights (1993) or the Cynthia Rothrock vehicle Rage and Honor (1992). Her career should have been bigger as well. We did have some issues with the film, however. The fact that it takes place all in one location, the nightclub, shows its rock-bottom budget, as does the fact that some scenes are lit too darkly to see. It would have been nice to see Norton and Long fighting the baddies in different scenarios and places. Also the movie feels unfocused and unclear at times, with not a lot established. With a more streamlined, linear drive, Under the Gun could have been an all-time classic.What they were able to achieve with the budget they had IS impressive, so let's not forget that. As it stands now, Under the Gun is a solid Norton vehicle that displays the man's range of talents. While not perfect (but what is?), fans of the Awesome Australian Action man should seek out Under the Gun. For more insanity, please visit: comeuppancereviews.com",
         "In comparison to many other stars of low-budget martial arts movies - say, Steven Seagal, Don \"The Dragon\" Wilson or Dolph Lundgren - Richard Norton has at least one quality that puts him ahead: his sense of humor. And this quality comes through clearly in \"Under The Gun\": there are a few humorous bits that made me laugh out loud. Besides, the whole movie at times begins to resemble a surreal black comedy. Norton's character simply wants to get through a few hours peacefully before he can escape to a better life, but almost everything that can go wrong, does go wrong, and he becomes the target of corrupt cops, impatient mobsters, big goons, suspicious accountants, humiliated pimps, etc. Even the airplane ticket lady on the phone is rude to him! The entire movie takes place during these few hours, which is a quite unusual concept for this kind of movie. The fight scenes (choreographed by Norton himself) are above-average, both violent and technical. Norton is supported by Kathy Long, the kind of woman who will melt your heart with her cute smile one moment, then on the next she'll take on three guys in a fight and come (convincingly) on top. In other words, she's great. But her role is briefer than it should have been, and that was my only serious disappointment with this film. **1/2 out of 4.",
         "I still can't believe this an Australian film. From looking at the box and the surroundings it looked like another low-budget american actioner, until I checked the credits where I was informed that this was filmed in Melbourne, Australia. Considering the above, I'd say this movie is watchable and certainly entertaining. The plot flows along smoothly from one situation to the next. All the while we watch as the night unfolds through the main character, Frank Torrance, played excellently by Richard Norton. The other side of this movie are the martial arts action sequences, which are excellentely choreographed and filmed in all their brutal bloody glory. There are no fancy jumps or flips in this movie, just plain, raw, martial arts combat. Very entertaining and sometimes funny. 9/10",
         "The scene is the night former hockey star Frank Torrence plans to sell his bar and redeem the promise of a better life for his wife and him. Rogue cops, weak friends, and an unreliable accountant get in his way! As Frank, Richard Norton delivers a knock-out performance in \"Under the Gun\", an unorthodox action picture that limits the plot to the course of one unpredictable night. The twists and the humor never slow down, as Frank has to make the sale and avoid the kind of downfall that took him out of hockey. He's being framed (again) for drugs and only one friend on the force is willing to help him out of the jam. \"Under the Gun\" is stylish, smart action that does not eliminate plot or character in favor of the fights. In fact, the fights are incorporated into the film to supplement and develop the characters, primarily Frank. Clearly Richard Norton invested his considerable talents into making an action movie with a difference, and the audience wins!",
         "UNDER THE GUN is an extremely low budget martial arts thriller from Australia and a vehicle for acclaimed (at least by me) martial artist Richard Norton, who gets a ton of screen time here. The limited budget is revealed in the way that the entire film takes place in a dark nightclub over the course of one night. Norton plays the desperate owner who has to contend with mafia members, Triads, pimps, and various gangster-style goons and rivals who are determined to rob him and see him dead. What follows is a forgettable story packed with solid fight scenes that show off Norton at his athletic and creative best. Even better, there's plenty of humour here too, allowing Norton to turn on his trademark charm. It's a nice little film overall, and a lot of fun.",
         "Richard Norton is entertaining in anything, and in this he's funny as well. The scene where he bites a telephone in frustration (ad-libbed!) had my husband and me nearly rolling on the floor. Of course, it's a very serious movie, with some very tense and some tragic moments in addition to the many funny ones, but it has a happy ending.",
         "I rented this movie mostly for Richard Norton, and several other of the better-known Australian martial artists with whom I am familiar appear alongside him in the movie. It's shockingly acted - let's face it, Richard Norton may be a good martial artist, but a great actor he is not. The plot was secondary to the fight scenes, as it really should be in a movie that's really just a vehicle for some spectacular action sequences. Kathy Long redeems what would otherwise just be another film packed with guys beating the crap out of each other for 90 minutes. The fight scene with Norton vs Sam Greco is worth a look, but this film will probably only appeal to die hard MA fans and even then, will really only appeal to Australians for novelty value.",
         "THIS FILM IS ABSOLUTELY BRILLIANT. Richard Norton must the greatest actor ever to come out of Australia. His acting, fighting and screen presence are all fantastic and he holds the film together with his abundantly magnetic charisma and martial arts skills. It is a mystery why the great Richard Norton has not had more lead roles in his career because he easily has the charisma and acting skills, not to mention his incredible level of fighting skills, to match the Van Dammes and Seagals of this world. It's also worth mentioning the amount of times he bottles people in this film, he is truly prolific. in my humble opinion he should be crowned KING OF THE WORLD.",
         "I must admit, though I saw a small number of Norton's films, but I heard that most of them are the same, but this one... well It's something different. First of all, Norton is a great martial artist, but here he does some good acting as well. The story is very interesting. Norton is a former football player that holds a nightclub (and, of course he happens to know martial arts), the key story of the plot that Norton's character Frank Torrence must endure through one night against the mobsters, the police, a few hit mans, street thugs and the most dangerous thing on the end - his wife. The fights and the action is quite solid, acting is funny, though OK, and everything is shown through a fine comedy and fun. It's a mixture of action and comedy. Watch it."
      ],
      "genres": ["Action"],
      "productionCompanies": [
         "Norton Currie Productions",
         "Villaroja Pictures"
      ],
      "summaries": ["A debt-ridden night club owner has to take on Italian and Asian mobsters, corrupt police, and an angry pimp that he threw out of the club to try to keep his club in business."],
      "budget": 0
   },
   "movielensId": 147310,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-12-26",
      "dvdReleaseDate": null,
      "directors": ["Matthew George"],
      "runtime": 0,
      "movieId": 147310,
      "title": "Under the Gun",
      "mpaa": null,
      "actors": [
         "Richard Norton",
         "Kathy Long",
         "Jane Badler"
      ],
      "imdbMovieId": "0114783",
      "originalTitle": "Under the Gun",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "A debt-ridden night club owner has to take on Italian and Asian mobsters, corrupt police, and an angry pimp that he threw out of the club to try to keep his club in business.",
      "tmdbMovieId": 92737,
      "avgRating": 3,
      "releaseYear": "1995",
      "numRatings": 1,
      "posterPath": "/evVyHLXLZwyyS4CHR2KxTgtJBcr.jpg"
   }
}