{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0120413",
      "video": false,
      "title": "The Undertaker's Wedding",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mario Bellini",
               "gender": 2,
               "credit_id": "53453d9dc3a36825a00015c1",
               "name": "Adrien Brody",
               "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
               "id": 3490,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maria",
               "gender": 1,
               "credit_id": "53453daac3a36825a00015c3",
               "name": "Kari Wuhrer",
               "profile_path": "/2WmKU8E0lMmdBcC7F9iLLz7S2Qc.jpg",
               "id": 56152,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Alberto",
               "gender": 2,
               "credit_id": "53453db8c3a368259100159e",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rocco",
               "gender": 2,
               "credit_id": "53453dc3c3a36825a00015c7",
               "name": "Jeff Wincott",
               "profile_path": "/oA1AVImV3w3761o5zWRhnUWuRjH.jpg",
               "id": 104509,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Louise",
               "gender": 0,
               "credit_id": "53453dccc3a36825a800155c",
               "name": "Holly Gagnier",
               "profile_path": "/40zPrVkdaoJhFskGBwXqXelh21z.jpg",
               "id": 124786,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Michael Caprelli",
               "gender": 2,
               "credit_id": "53453dd6c3a36825910015a1",
               "name": "Nicholas Pasco",
               "profile_path": null,
               "id": 979954,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Giuseppe",
               "gender": 0,
               "credit_id": "53453de8c3a36825a800155f",
               "name": "Ralph George",
               "profile_path": null,
               "id": 1308332,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Agnes",
               "gender": 0,
               "credit_id": "53453df3c3a368258900166f",
               "name": "Lisa Drew",
               "profile_path": null,
               "id": 1308333,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mrs. Bellini",
               "gender": 0,
               "credit_id": "53453dfec3a36825b10015d1",
               "name": "Anna-Maria Giannotti",
               "profile_path": null,
               "id": 1308334,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Frederico Caprelli",
               "gender": 0,
               "credit_id": "53453e08c3a36825b10015db",
               "name": "Louie Jannetta",
               "profile_path": null,
               "id": 1308335,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "543bce8a0e0a2649a1005970",
               "name": "John Bradshaw",
               "profile_path": null,
               "id": 224214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "543bce910e0a26499e0059dd",
               "name": "John Bradshaw",
               "profile_path": null,
               "id": 224214,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.440479,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 263873,
      "vote_count": 0,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "The Undertaker's Wedding",
      "runtime": 89,
      "poster_path": "/fnZQpaIeq3b0yQW5k1VT8NnrMZ5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Bradshaw"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["John Bradshaw"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120413/",
      "coverLink": null,
      "actors": [
         "Adrien Brody",
         "Jeff Wincott",
         "Kari Wuhrer"
      ],
      "reviews": [
         "This okay comedy is more watchable than funny, and although the cast does a solid job and kept me interested, the movie just didn't deliver enough laughs. It's a pleasant way to kill some time, but it's by no means anything memorable or special. On a side note, it was weird to see a Kari Wuhrer film where she actually keeps her clothes on, but I highly doubt that this fact will attract more people to this movie. Bottom line: This film is decent, but nothing more.",
         "I enjoy black humor, and my all-time favorite flicks include \"The Wrong Box\" and \"The Loved One\". TUW attempts to be that sort of film--a black comedy centering around the trapping of death and funerals. But in this case, a nice premise and some excellent opportunities for comedy were squandered in order to bring the viewers a made-for-TV caliber romance and Italian-American/mob stereotypes. And that's a bit of a pity, considering some of the acting talent assembled. However, this movie is NOT going to be the worst hour and a half you ever spent camped out on the couch. It's very pleasant, and looks quite good. The central premise is that if you are the scion to a long and distinguished line of undertakers to the Mob and live in apartments adjoining your funeral home, you will probably have a difficult time finding a nice girl to marry you due to having dead bodies in various stages of preservation camped out on gurneys down the hall. So, despite having an assortment of nice ties, and apparently a thriving business, Our Hero in this one is lovelorn in the extreme. Where do they find these idiot women? I mean, what are a few dead bodies down the hall and a seriously bad haircut compared to getting hooked up with Adrien Brody? The Lovelorn Undertaker is played by Adrien Brody, and I spent the whole first half of the movie wondering which comedian of Jewish extraction his hairstylist was trying to get him to look like. At first, I thought...Moe Howard. But the bangs weren't long enough. Then, I thought \"Adam Sandler\", but his hair was just a bit too long and brushed forward over the temples for him to be aping Happy Gilmour. Then, it hit me. JERRY LEWIS! Yeah! In the Dean Martin era! Once I'd figured it out, I felt much happier, and was able to settle back and enjoy the flick. It's easy to see that Adrien Brody would flat-out tear it up if he were given a better written, romantic comedic role, and one can only hope that happens, so that he does not get forever typecast as a broody, moody, artistic or tormented sort. Here, the big, sad, puppydog eyes and trembling lips are outta control, and despite the too-large suits, he manages to make his rather hangdog character sympathetic, amusing, and attractive. So, for Brody fans--a rewarding view. For everyone else, a pleasant, unchallenging hour and a half of fluff.",
         "I only gave this movie a 6 out of ten but it is worth a watch if you like adrian brody.He is in almost every scene.I really enjoy his work and thought he stood out here,and in Bullet.If you can locate this movie,give it a chance.Burt Young gets to be a mobster again!",
         "Mario Bellini (Adrien Brody) is an undertaker to the mob. If the dead bodies come in riddled with bullet holes, Mario still makes them look good. Having inherited the business from his folks, it is all he knows. But, the job causes problems with Mario's love life. He aspires to get married but when he brings the lady in question back to the funeral home, she sees a corpse and runs away quickly. Poor Mario. As it happens, a turf war breaks out between two factions of the mob, with several gangsters ending up in caskets. One mob member, however, fakes his death and hides out at the Bellini funeral home. When his gorgeous wife, Maria (Kari Wuhrer) comes to the funeral, Mario likes what he sees. Oh, what a tangled web indeed. Will Mario get what he desires most, a wife? This is a mildly amusing movie, with some originality. Most of the violence is of the cartoonish nature and there are some funny moments, indeed. Watch a rolling, runaway casket careen down the main drag and you will be smiling. Also, there is a moment when a jealous wife catches her husband in a tryst and he shouts out that the other woman was \"only teaching him to floss\"! Brody is really quite nice as the funeral home operator, not withstanding his awful haircut. The rest of the cast, including Burt Young, is also good. The costumes, sets, and production values are adequate, indicating the film was probably made on a strict budget. Nevertheless, if you like such films as Married to the Mob, you might try this one for an evening. Although it is not destined to be an indie classic, it has its moments of fun, definitely.",
         "Tremendous surprise! Amazingly good! An extremely clever script launches \"The Undertaker's Wedding\" into the upper reaches of \"black comedy land\". Definitely in the same class as \"Eating Raoul\", which also has a wonderful script. Adrien Brody is perfect as the meek undertaker to the mob, caught in the middle of a mob war. His efforts to remain neutral are hilarious, and business has never been better. The stunningly beautiful Kari Wuhuer is well cast as a mob wife. Jeff Wincott and Burt Young add to the fun. This is a must see movie for anyone who admires darkly comic films. Without question \"The Undertaker's Wedding\" is worthy of \"cult status\" - MERK",
         "Its a really funny movie. I laugh almost the hole time. Adrien is really funny in it. The movie is really worth watching it. So if you get the chance to see it, do it. This movie is one of Adrien's earliest. But if your a fan of him its a must seeing it! His character in this movie is a really overact goofy, unlucky fellow. Really funny. And he is as always really good in that kind of role. That's what i like about Adrien, he always picks out this really good an hard to act characters. And he's even playing in a low budged movie and is not ashame of it. Thats what i like. So i have nothing more to say, see it for yourself. I now I'm repeating myself, but it's really worth to watch!",
         "There are some interesting (original?) ideas in the plot, but I found the acting and the general effect just so-so. The movie did not really make me laugh. Also, French readers please note that the dubbing is poor."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [],
      "summaries": [
         "Mario Bellini's life as an undertaker may not be filled with romance, but his funeral parlor certainly sees some action: Business is booming because of a local mob war. While wise guys are being bumped off left and right, Mario is asked by crime boss Alberto to hide his hit man brother Rocco. A love quadrangle forms among Mario and Rocco's long-suffering wife Maria, Rocco and Mario's girlfriend Louise, and the body count suddenly rises.",
         "A hapless undertaker becomes embroiled in a mafia war when he's forced to protect the brutal brother of a mob kingpin while be becomes romantically involved with the mob brother's wife."
      ],
      "budget": 0
   },
   "movielensId": 147316,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": null,
      "directors": ["John Bradshaw"],
      "runtime": 89,
      "movieId": 147316,
      "title": "The Undertaker's Wedding",
      "mpaa": null,
      "actors": [
         "Adrien Brody",
         "Kari Wuhrer",
         "Burt Young",
         "Jeff Wincott",
         "Holly Gagnier",
         "Nicholas Pasco",
         "Ralph George",
         "Lisa Drew",
         "Anna-Maria Giannotti",
         "Louie Jannetta"
      ],
      "imdbMovieId": "0120413",
      "originalTitle": "The Undertaker's Wedding",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 263873,
      "avgRating": 3,
      "releaseYear": "1997",
      "numRatings": 3,
      "posterPath": "/fnZQpaIeq3b0yQW5k1VT8NnrMZ5.jpg"
   }
}