{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "paternity",
            "id": 4954
         }
      ],
      "imdb_id": "tt0119432",
      "video": false,
      "title": "Jungle 2 Jungle",
      "recommendations": [
         26441,
         11359,
         13962,
         21845,
         24795,
         20726,
         11395,
         45325,
         10406,
         11158,
         12139,
         14819,
         9449,
         13203,
         11164,
         8989,
         6878,
         10414,
         12475,
         9021
      ],
      "backdrop_path": "/nO0sVYWaQdLQTAF1GUO7CPBC8Qr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Michael Cromwell",
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f77",
               "name": "Tim Allen",
               "profile_path": "/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg",
               "id": 12898,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Richard Kempster",
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f7b",
               "name": "Martin Short",
               "profile_path": "/oZQorXBjTxrdkTJFpoDwOcQ91ji.jpg",
               "id": 519,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Dr. Patricia Cromwell",
               "gender": 1,
               "credit_id": "52fe44f8c3a36847f80b4f7f",
               "name": "JoBeth Williams",
               "profile_path": "/9kmPUDqZIZw7aYeKYm3gy1xr94s.jpg",
               "id": 10080,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "52fe44f8c3a36847f80b4f83",
               "name": "Lolita Davidovich",
               "profile_path": "/vQlk518qlef94XXJqtrkIqS3izo.jpg",
               "id": 12139,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Mimi-Siku",
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f87",
               "name": "Sam Huntington",
               "profile_path": "/nq7pwic6Xe6XTRzOfXjMCuUqbjt.jpg",
               "id": 53492,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Karen Kempster",
               "gender": 1,
               "credit_id": "5676c2c1c3a368167a0062f6",
               "name": "Leelee Sobieski",
               "profile_path": "/fAJ4H6Hi0SZPt6I82TfnfCl9i43.jpg",
               "id": 22290,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Alexei Jovanovic",
               "gender": 2,
               "credit_id": "5676c2d392514179dd005b35",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f3d",
               "name": "John Pasquin",
               "profile_path": null,
               "id": 58072,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f43",
               "name": "Bruce A. Evans",
               "profile_path": "/h1NsYkWwIbJ6VBfoR32bBESdn8K.jpg",
               "id": 3028,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f49",
               "name": "Raynold Gideon",
               "profile_path": null,
               "id": 3029,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f4f",
               "name": "Brian Reilly",
               "profile_path": null,
               "id": 56644,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f55",
               "name": "Richard Baker",
               "profile_path": null,
               "id": 56645,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f5b",
               "name": "Rick Messina",
               "profile_path": null,
               "id": 56646,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f61",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f67",
               "name": "Michael Convertino",
               "profile_path": null,
               "id": 4055,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f6d",
               "name": "Tony Pierce-Roberts",
               "profile_path": null,
               "id": 3960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f8c3a36847f80b4f73",
               "name": "Michael A. Stevenson",
               "profile_path": null,
               "id": 45862,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.58118,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9446,
      "vote_count": 148,
      "budget": 0,
      "overview": "Uptight New York City executive, Michael Cromwell, pursues his soon-to-be ex-wife to South America and returns home with the son he never knew he had -- a boy raised in a tribal village in Brazil. Armed with only his blowgun, the 13-year-old Mimi-Siku discovers that the world outside his jungle home is indeed a strange place.",
      "similar": [
         772,
         1771,
         594,
         59108,
         57431,
         769,
         1572,
         51876,
         4964,
         2642,
         10096,
         10661,
         496,
         40807,
         164,
         9029,
         10204,
         8835,
         284,
         2064
      ],
      "original_title": "Jungle 2 Jungle",
      "runtime": 97,
      "poster_path": "/kxFdQiyqMHbtDbGkPlKcwqsnRaW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1997-03-07",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "The big city is about to get a little savage.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Pasquin"],
      "runtime": 105,
      "synopsis": "Michael Cromwell(Tim Allen),is a self-absorbed,successful commodities broker,living in New York City. Wanting to marry his new fiance,Charlotte(Lolita Davidovich), he needs to obtain a final divorce from his first wife,Patricia(JoBeth Williams),who left him years earlier. Patricia now lives with a semi-westernised tribe in Venezuela. Michael travels there to get her signature on divorce papers,but,upon arriving,discovers he has a 13 year old son,Mimi-Siku(Sam Huntington). Michael attempts to bond with Mimi-Siku in his brief stay with the tribe,and promises to take him to New York'when he is a man'. That night,Mimi-Siku undergoes the tradition rite of passage,of his tribe,who then consider him to be a man. The tribal elder gives Mimi a special task,to allow him to become a tribal leader one day. Mimi must bring fire from the Statue Of Liberty,and looks forward to traveling with his father. Michael brings Mimi-Siku to New York. Michael's fiancee,Charlotte,is less than pleased about the unexpected visitor,particulary when he suggests eating her cat and releases his pet tarantula in her apartment. Michael attempts to adapt Mimi-Siku to city life. On climbing the Statue Of Liberty,to reach the flame,Mimi-Siku is disappointed when he sees that the fire is not real; While Mimi-Siku is staying at the home of Richard Kempster(Martin Short),Mimi falls in love with Richard's daughter,Karen(Leelee Sobieski). Richard is unhappy about Mimi's presence in his home,because of his influence over Karen. Mimi-Siku returns to the Amazon jungle,but before he leaves,his father gives him a cell phone,so they can keep in touch. Michael also gives Mimi a Statue Of Liberty cigarette lighter,that produces fire from the tourch. In return, Mimi gives his father a blowpipe and poisoned darts,telling Michael to practice and come to see him when he can hit flies. Michael finds himself disheartened by the rat race and realizes his relationship with Charlotte isn't working for him anymore. Michael returns to Lipo-Lipo to see his son and ex-wife,bringing the Kempster family with him for a vacation. Karen and Mimi are reunited,and Michael and Patricia decide to get back together.",
      "writers": [
         "Hervé Palud",
         "Thierry Lhermitte"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119432/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NDk2ODUzMl5BMl5BanBnXkFtZTcwMTc1NjkyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tim Allen, Martin Short, JoBeth Williams | See full cast and crew »"],
      "reviews": [
         "I first watched this live action Disney flick shortly after it came out in video in 1997. It was around the time of my eleventh birthday, and I was very pleased with the film, enough to watch it more than once. I don't know exactly how many times I watched it, but definitely several times. Years later, after seeing that the IMDb rating for \"Jungle 2 Jungle\" was low, I finally watched it again, for the first time in I don't know how long, and like I expected, it no longer meant much to me. Michael Cromwell is a commodities broker in New York. It has been years since his wife, Patricia left him, and he now has a new fiancé, but before they can marry, he must go down to the Amazon (where his first wife now lives), to make the divorce official. While there, Michael learns that he has a son, who is part of the primitive tribe that Patricia now lives with! His name is Mimi-Siku, and while Michael is stuck on the island, the boy turns thirteen, the age which he is considered a man in this tribe. Mimi is assigned by the tribe's chief to go to New York and get the fire from the Statue of Liberty, so Michael reluctantly takes his son home with him. Mimi-Siku has always lived very primitively, and has never experienced city life, so while in New York, he is bound to unintentionally cause trouble! Watching \"Jungle 2 Jungle\" after my adolescent years had come and gone, I didn't find it very funny at all. I smiled a few times (mostly the parts where Richard Kempster, Michael Cromwell's co-worker, played by comedian Martin Short, throws fits) but if I ever actually laughed, it was very slight, and if I saw the gag again, I probably wouldn't laugh at all. For the most part, I kept a straight face, and found most of the movie quite simply boring. There are also some jokes that are a tad embarrassing, such as Michael Cromwell lying awake in his hammock on the island while others around him are constantly farting in their sleep, and quite a few embarrassing quotes that are supposed to be funny. It appears that Tim Allen has starred in a lot of movies that haven't been too well received. \"Jungle 2 Jungle\" is one of those movies, and right now, I can understand why. Overall, this is a mediocre Disney feature in my opinion, though many consider it lower than that. After enjoying this movie when I was eleven years old, then watching it again after growing up and not thinking much of it, I would say that it's definitely for the younger folk, and for adults, there are definitely comedies of this kind (ones about someone living a primitive lifestyle somewhere in the world and coming to a city for the first time in their lives) that are much more likely to impress you.",
         "It would be a natural assumption that since Tim Allen is the main character in this movie, and that since this movie IS supposed to be a comedy, that some of Tim Allen's lines would have at least some humorous content to them. About 90% of his lines were flat and were spoken like they were SUPPOSED to be funny, but just weren't. As for the rest of the movie, why is it that since someone is raised in the jungle, they are complete idiots? His son could speak two languages, seemed rather intelligent, and yet, he'd kill someone elses fish and eat them, steal catfood from the cat and eat it, and do other stupid things that someone with common sense wouldn't do. The things he did were more embarrasingly stupid then funny and just didn't create all that many laughs. Now if we want to look at the point of view of the movie being meaningful as far as a father/son relationship...well...ok, a big time, job oriented guy with a hot new girlfriend finds out he has a son (with his devorced wife, who is of course, really cool) and the two don't get along until then end, when they suddenly do. Like we haven't seen that story before. All in all, just not all that well done. I think the idea could have worked but it was just a poor choice of a final script. Rent if you're bored, it'll entertain you, just don't expect anything all that good.",
         "Michael Cromwell is a successful New York stockbroker looking forward to his marriage to a successful fashion model. However before he can do this he must finalise the divorce from his wife, who left him about 12 years ago. Unfortunately she lives on a tropical island off the coast of Brazil and he finds himself stuck on the island with her. If that wasn't bad enough he learns that the pale, 12 year old member of her tribe (Mimi-Siku) is actually his son. In order to avoid looking at the morality of her not telling him about this life, the story then requires Mimi-Siku to go to New York for reasons too boring to explain and \"laughter\" ensues and Michael learns some lessons that we all saw coming from a mile off. It is rare for me not even to have the energy to type a decent plot summary for a film but for this one I make an exception. Part of the problem is the fact that the plot manages to be embarrassingly predictable from start to finish and provides nothing of value along the way. This is only made worse by the lack of laughs and the regular scenes of Mimi-Siku failing to fit in, one of the most embarrassing of which sees him dancing with his father on the street. It is a string of obvious scenarios all run together just as you'd expect and there is nothing of any interest developed along the way. There are plenty of \"wild fish out of water in big city\" films already kicking around and this offers no reason to add this to the list of the ones you've seen. The cast are equally lost in the midst of all this stuff and resort to mugging and overplaying at every opportunity. Obviously Allen was going to do this anyway since this is what most of his films tend to be like. Martin Short does the same here and at least gets one, maybe two laughs as a result \u0096 which is more than Allen. The clearly well-off and white Huntington is hilariously poor as the boy of the film, he doesn't convince in any part of the film and is a big part of it being embarrassing. The rest of the cast have little to do and even a turn from Stiers adds no value. Overall a roundly poor film that takes the \"wild fish out of water in city\" genre, ticks as many boxes as it can, writes lots of predictable and weak scenarios and places them all within a story that is so poorly developed that you pretty much know where it is going from the very start. No laughs and no interest \u0096 it might work as noisy nonsense to distract children but it has no value past that.",
         "My opinion on Jungle 2 Jungle is not as harsh, the movie was cute. The fact that it was a remake isn't my complaint because it is really hard to find movies that haven't been remade from other foreign or alternative films. I give movies at least one chance. Tim Allen is, as usual, comedic while being a bit on the crazy side, but still funny in all the ways you would want him to be, if you like him. You are also introduced to Leelee Sobieski in her feature film debut (she had been in TV movies, but not really big movies till Jungle 2 Jungle came out). The movie in general is a great family flick, one that everyone can enjoy. I believe that is should be given at least one chance, so go out and rent this fun movie.",
         "This movie is solid fun. It's typical Tim Allen, which means that if you like him you should enjoy the movie. He employs lots of quick wit, sarcasm, and slapstick self-deprivation. The son does a mostly believable job with the typical fish out of water story. He climbs out on the ledge of a Manhattan skyscraper and also climbs to the top of the statue of liberty to see the \"fire up the sky's butt\". The supporting cast puts in workman quality acting as well. The real mom (JoBeth Williams) is believable as a post 60's Peace Corp leftover and villain played by David Ogden Stiers (M*A*S*H) is terrific as a scary and quirky Russian mafia boss. It is a down the middle Disney pre-teen movie and fun.",
         "Tim Allen plays an uptight New York stockbroker who ends up having to look after the teenage son he never knew he had, and who has grown up in the South American jungle. The convoluted set up leads to a straightforward family movie full of simple knockabout humour. The fish out of water antics of the boy are the main substance of the film, but there are additional threads: the gradual father-son bonding, a young love story, a Russian criminal, the realisation that different values may not necessarily be worse, for instance... This is not a sophisticated movie, but it is enjoyable for family viewing. Tim Allen anchors it well, Martin Short, Jobeth Williams and David Ogden Stiers offer sterling support, and it is good to see Sam Huntington and Leelee Sobieski in young roles.",
         "Michael Cromwell (Tim Allen) is a wealthy commodity broker in New york City. But after wanting to marry his girlfriend, he must divorce his old wife living in Brazil. After traveling to Brazil he finds out that he has a son who has been raised in an Indian tribe. Deciding to bond with the boy, he brings back Mimi-Siku (Sam Huntington) to New York and that's were the fun begins. Nimi-Siku learns to adapt to the city, finds fun in climbing on the buildings, and living with his father calling him 'Bamboo'. it is a good family bonding film with some fine acting by Tim Allen in his one of his earliest comedy roles. Sam Huntington is very funny and mostly on accident in seeing a fish out of water story. You'll laugh and you'll really enjoy the fun presented in this family bonding story. Jungle 2 Jungle. Starring: Tim Allen, Sam Huntington, Leelee Sobieski, and Martin Short. 3 1/2 out of 5 Stars.",
         "One of the worst movies I have ever seen. I bought the tape for my 11 year old son but he asked me to stop watching less than half way through the tape. All the actors' performances look rather plastic except for the tarantula.",
         "The first time I saw this movie was in the cinnima theatre. I found this film to be surprisingly enjoyable and entertaining. It was funny and stupid sometimes. The best quality this film has is its replay value. You can watch it several times and not get bored with it. Also, this movie really makes New York city look a lot friendlier than it really is (We all know New York is a hell hole). This movie is great to watch on a rainy day when you have nothing to do. My Rating: 9 out of 10 or A-",
         "There are two surprising things about \"Jungle 2 Jungle\". The first is that amazingly, this is not a sequel, but actually a remake of a French film (unlike \"Journey 2: the Mysterious Island\" or \"2 Fast, 2 Furious\" which are sequels). The second surprise is that this is nothing more than a lame family comedy. Even if you had lived your entire life in a jungle and had never seen a film before, '\"Jungle 2 Jungle\" would be recognized as a predictable pile of lizard guts. This family film is not funny, believable or touching and the characters will make you cringe. I heard the original isn't very good and unsurprisingly, neither is this movie. (On VHS, January 2012)"
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "TF1 Films Production"
      ],
      "summaries": [
         "A New York commodities broker who was married several years ago has been separated from his wife. Now he wants to marry his new girlfriend, so he has to divorce her first. So he goes to Venezuela, and is brought deep into the jungle and told that when they separated she was pregnant and chose not to tell him since he stated he was not really interested in becoming a father. Today, the boy has reached the age where he has to go on a quest, in New York, so his father reluctantly brings him along, and a culture clash follows. The boy has spent all of his life with the tribe he grew up with, and his father has a bit of problem so he can't spent as much as time with his son as his son likes.",
         "A New Yorker suddenly learns he has a thirteen-year-old son who's been raised in the jungle. He brings the boy to New York city, and that's where the fun starts."
      ],
      "budget": 0
   },
   "movielensId": 1474,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-03-07",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["John Pasquin"],
      "runtime": 97,
      "movieId": 1474,
      "title": "Jungle 2 Jungle",
      "mpaa": "PG",
      "actors": [
         "Tim Allen",
         "Martin Short",
         "JoBeth Williams",
         "Lolita Davidovich",
         "Sam Huntington",
         "Leelee Sobieski",
         "David Ogden Stiers"
      ],
      "imdbMovieId": "0119432",
      "originalTitle": "Jungle 2 Jungle",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["7uQm7SOJymg"],
      "plotSummary": "Uptight New York City executive, Michael Cromwell, pursues his soon-to-be ex-wife to South America and returns home with the son he never knew he had -- a boy raised in a tribal village in Brazil. Armed with only his blowgun, the 13-year-old Mimi-Siku discovers that the world outside his jungle home is indeed a strange place.",
      "tmdbMovieId": 9446,
      "avgRating": 2.54286,
      "releaseYear": "1997",
      "numRatings": 2193,
      "posterPath": "/kxFdQiyqMHbtDbGkPlKcwqsnRaW.jpg"
   }
}