{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "erotic movie",
         "id": 190370
      }],
      "imdb_id": "tt0124464",
      "video": false,
      "title": "Emmanuelle in Soho",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Emmanuelle",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075c95",
               "name": "Angie Quick",
               "profile_path": null,
               "id": 104121,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kate Benson",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075c99",
               "name": "Julie Lee",
               "profile_path": null,
               "id": 104122,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bill Anderson",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075c9d",
               "name": "John M. East",
               "profile_path": null,
               "id": 104123,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Paul Benson",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075ca1",
               "name": "Kevin Fraser",
               "profile_path": null,
               "id": 104124,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Adie",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075ca5",
               "name": "Gavin Clare",
               "profile_path": null,
               "id": 104125,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Derek",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075ca9",
               "name": "Timothy Blackstone",
               "profile_path": null,
               "id": 104126,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jill",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075cad",
               "name": "Geraldine Hooper",
               "profile_path": "/quv3loGGVGtUyhK5HZNMhYshZbm.jpg",
               "id": 104127,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sheila",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075cb1",
               "name": "Anita Desmarais",
               "profile_path": null,
               "id": 104128,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Showgirl / Pink-Haired Party Guest",
               "gender": 1,
               "credit_id": "52fe45e8c3a368484e075cb5",
               "name": "Linzi Drew",
               "profile_path": "/5j9VL7ygzuC7SNRCw8ZbxY6sy4u.jpg",
               "id": 104129,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Showgirl",
               "gender": 0,
               "credit_id": "52fe45e8c3a368484e075cb9",
               "name": "Maria Harper",
               "profile_path": null,
               "id": 104117,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45e8c3a368484e075c91",
            "name": "David Hughes",
            "profile_path": null,
            "id": 104120,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.5E-5,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 29539,
      "vote_count": 0,
      "budget": 0,
      "overview": "The first portion of this film is a documentary on the adults-only entertainment industry prevelent in London's Soho District. The second details the trials and tribulations of a struggling photographer, his unsatisfied wife, and their friend Emmanuelle, as they try to make it big in Soho. They decide their ticket to success will come by blackmailing a wealthy adult film tycoon.",
      "similar": [
         80752,
         28468,
         134764,
         27066,
         14174,
         48650,
         249397,
         81774,
         86331,
         341174,
         250225,
         50124,
         258480,
         370663,
         55580,
         9453,
         2770,
         50270,
         24402,
         4995
      ],
      "original_title": "Emmanuelle in Soho",
      "runtime": 72,
      "poster_path": "/rYUULFRj8wsL7fwbc2YyQ5aTShW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1981-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "David Hughes",
         "Ray Selfe"
      ],
      "runtime": 68,
      "synopsis": null,
      "writers": ["John M. East"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0124464/",
      "coverLink": null,
      "actors": [
         "Angie Quick",
         "Julie Lee",
         "John M. East"
      ],
      "reviews": [
         "Emmanuelle in Soho was one of the last theatrically released movies of the British sexploitation era. A big hit when it was first released in UK cinemas in 1981, it is now largely forgotten. The film has never been shown on TV and has only recently been widely available on video cassette. Today it's definitely worth another look. It's a camp classic for fans of low budget British movies. Neither particularly sexy and certainly only unintentionally funny it still proves to be a revelation for anyone watching! Whilst Mandy Miller enjoys the title role of Emmanuelle, it is half-Oriental actress Julie Lee who proves to be most watchable in the supporting role as Kate. This was Lee's only big starring role (she died after a horrific car crash in 1983) and you can see why. Frankly, she was a really terrible actress. It's obvious Lee was hired primarily for her stunning looks, but her lacklustre acting skills only make her more endearing to watch. The plot isn't really worth mentioning, Julie Lee auditions for a part in a tacky nude revue at a seedy theatre and her weedy bisexual husband gets mixed up with the insatiable Emmanuelle and an unscrupulous agent (played by the desperately unfunny John M. East). However, this movie is a MUST SEE! It harks back to a more innocent era of film-making when naughty little films got a big screen release and punters queued around the block to see them. Emmanuelle in Soho is wonderfully awful and very addictive. Go see it!",
         "SPOILERS This alongside \u0091Carry On Emmannuelle' provides ample proof that Emmanuelle Arsan's jet-setting, continental floosie of no fixed sexuality, was not best served by the British film industry. Although Emmanuelle in Soho's direction is credited to David Hughes, the film is essentially the brainchild of stroke magazine publisher turned film producer David Sullivan and John M East, who wrote, produced and starred. East's storyline reduces the Emmanuelle character to but a footnote in a cardboard drama evolving around the world of smut-peddler Bill Anderson (East). The titular location is generally depicted in bland, brief exterior shots- although the spirit of Soho runs in the blood of pornographer Anderson. \u0091The only place in the world where it's shady on both sides of the street'-is how Bill sums up his natural surroundings. One of Bill's regular suckers is Paul-a porn photographer with an 80's poser haircut who's trying to \u0091make it'. Fat chance-Anderson complains Paul's photos are dire, pays him a pittance,then sells the pictures on for a hefty profit. A true 80's man, Paul is out to get all the money he can no matter how ruthless he has to be, the two women in his life, wife Kate (Julie Lee) and lodger/lover Emmanuelle (\u0091Randy' Mandy Miller)-share similar sentiments. Living way beyond their means the threesome pay their way via jobs in the sex industry,Emmanuelle masquerades as \u0091Peggy the Pushover' in an attempt to get a piece of Bill's empire. While Kate auditions for a part in a cheeky play called \u0091Hang about Sebastian' and impresses the theatre director, a campy old queen. \u0091We all undress and touch each other, so the fellas get use to feeling and touching naked ladies' is how she summarises auditions for Sebastian. The films own depiction of Hang about Sebastian offers a line of strippers dancing naked save for yellow raincoats, and a frumpy woman attempting to get out of her clothes in a manner that's more escape artist than strip-tease. All of this is wedded to \u0091Don't Let Go' a cheesy disco-track, that also pops up in several cheapo horror films. Paul discovers the extent of Bill's con games, and decides to blackmail him. Bill lays his own trap, suggesting Paul throws a kinky party and films his friends' exploits for sex tapes. At the party the cast of Hang about Sebastian provide most of the action. Emmanuelle does a striptease set to a reprise of \u0091Don't Let Go', and Paul secretly turns his camera on swinger Bill whose secretly been shagging his secretary. Miffed to find he's the star of his own sex film, Bill scowls but eventually gives into Paul's blackmail demands and cuts him in on the business. The finale juxtaposes Kate driving around London with her having sex with Hang About Sebastian lead Derek played by hardcore actor Timothy Blackstone. Kate's voiceover claims Paul turned out to be a closet case and transvestite, Derek is bisexual but what the heck a girl can't have everything. Though ostensibly a comedy, EIS's characters are a fairly mercenary bunch who make careers out of screwing each other over-all in pursuit of the Rolls-Royce lifestyle. You could describe Emmanuelle in Soho as a mean flip side to Eskimo Nell. It's also a far from flattering self-portrait of Soho sex industry hangers-on made by people who were their real life equivalent. Incredibly threadbare, large parts of the film are structured like a minimalist one set play with Bill's den, a cramped flat full of sex film posters, as the main locale. Naturally the film boasts many side splitting moments of unintentional hilarity,although is slightly more fun to read about than actually sit through. At its heart the film is an outrageous showcase for the personas of its two stars- John M East and Julie Lee. EIS is pretty much East's tour-de-force he laughs at his own jokes, talks to himself, tells mother-in-law gags and gropes female cast members. East is manic and hyper throughout, never shutting-up even when having sex with his trousers on. Less animated cast members just look at him bewildered. And Julie Lee?- at the risk of speaking ill of the dead- its unlikely she would ever be mistaken for an actress. The big shock is Lee's oriental looks and strong Yorkshire accent, a real yin and yang combination. The publicity for EIS promoted bland Randy Mandy as the next big star, no doubt to Lee's annoyance. Only briefly on the scene Lee much like her EIS character relentlessly pursued fame but unlike her EIS character, real life offered Julie Lee no happy ending. East proved himself worthy of his Bill Anderson character, by creating the infamous featurette \u0091Mary Millington's True Blue Confessions' (80's video-title;The Naked Truth)- which recreates the suicide and sex parties of a dead woman in the most tasteless way imaginable. Selling sex to the masses in one form or the other has made David Sullivan a very rich man over the years. Although he's been known to complain that some of his past exploits have now caused him to be excluded from certain well-to-do social circles. The final East/Sullivan production to show up on the big screen was \u0091Hellcat-Mud Wrestlers' which did the rounds alongside Campsite Massacre-a mediocre US slasher film. Hellcat's advertising was geared around its star \u0091the fantastic Queen Kong (world champion)'- depicted on the poster amidst a bunch of scantily-clad girlies forcing each others heads into the slop. The East/Sullivan collaborations were distributed by Tigon, an age-old exploitation outfit who in their heyday ran a third behind Hammer and Amicus as purveyors of Brit horror. Tigon's legacy has garnered a great deal of critical interest in recent years, company founder Tony Tenser is even the subject of an upcoming biography. Although horror pundits generally omit or downplay Tigon's later incarnation as a sex film distributor, Emmanuelle in Soho and Hellcat-Mud Wrestlers probably earned them more mazuma than Bloodbeast Terror and Curse of the Crimson Altar-and for better or worse represent the company's twilight years.",
         "The only really worthwhile part of this movie is the beginning which is kind of mini-documentary on London's Soho district in the late 70's and early 80's (which was kind of a slightly tamer version of New York City's 42nd Street during that same era). It has one of those ridiculous moralistic-sounding narrators whose prattle about the \"vice\" in Soho is pretty ironic considering that the makers of this film were as responsible for the \"vice\" in the Soho of that time as anyone. After the documentary opening, however, the film settles down into a very boring fictional story about a nudie photographer, his wife (Julie Lee), and their close friend \"Emanuelle\" (Mandy Miller). While the husband and \"Emanuelle\" plot to take a revenge on a pornographer who has been ripping them off, the wife participates in some kind of all-nude theatrical revue, and the \"plot\" goes absolutely nowhere from there. Obviously, this has nothing to do with either the pretentious French \"Emmanuelle\" series featuring Sylvia Kristel or the sleazy Italian rip-off \"Black Emanuelle\" series made famous by Laura Gemser and Joe D'Amato. This is instead a strictly British film by English porn magnates David Sullivan and John N. East. Unfortunately, this was made after Mary Millington had committed suicide, Suzy Mandel had gone on to small parts in Hollywood movies (\"The Private Eyes\") and starring roles in American hardcore features (\"Blonde Ambition\"), and Anna Bergman had gone back to Sweden to work with her famous father on films like \"Fanny and Alexander\". So Sullivan and East were reduced to some real \"scrubbers\" here and/or \"actresses\" who generally couldn't act their way out of an 8 mm porn loop. Mandy Miller is very bad, and Julie Lee is even worse, but, to be fair, the male actors (including producer East himself) don't fare much better. The continental films of this era tended to be softcore with hardcore \"inserts\" featuring none of the original talent. In typical, more puritanical British fashion this is basically just a \"nudie\" film as far as Miller and Lee are concerned but with softcore sex \"inserts\" of other anonymous actresses to spice it up (at least by British standards). The problem with a lot of these sex films though, however graphic they are, is that there is literally NOTHING of interest in them beyond the strictly prurient. This is a pretty weak effort compared to both the continental \"Emmanuelle\"/\"Emanuelle\" films and also compared to Sullivan and East's earlier modest efforts like \"Come Play with Me\" and \"The Playbirds\". Not really recommended. PS--If you are considering buying the \"remastered\" DVD of this, keep in mind that the \"master\" it was re-mastered from is apparently a crappy old VHS tape with tracking problems.",
         "There's a strange incongruity in seeing the two words Emmanuelle and Soho together in the same title: the former elicits dreams of silk sheets, exotic locations and dusky beauty; the latter visions of slapped-up two-penny tarts, sleazy deals and dirty macs. There's much more of the latter in this poorly scripted, cheaply filmed and execrably acted late entry into the British sexploitation genre, originally conceived as a vehicle for Mary Millington and finally shovelled onto the screen a couple of years after her death. Emmanuelle in this offering is a London cockney nude model living in a house-share with an Asian bird (with thick Yorkshire accent) and a weedy bisexual photographer. The main body of the plot involves the photographer being cheated out of the due proceeds of the softcore porn shoots he's doing with Emmanuelle and then getting his revenge against the seedy agent who is ripping him off. The lame plotting has the Asian girl getting a job as a nude dancer in a naff musical, the cast of which are invited to a party at which the agent is filmed bonking his secretary, leaving him able to be blackmailed into making our photographer his partner. There's a strange voice-over monologue at the end from the Asian girl, pouring scorn on the masculinity of the photographer and outing him as a gay rent boy, a revelation which comes so far out of nowhere that one suspects it was put in as a deliberate insult to the actor playing the role! Most of the men in the cast are, strangely, as camp as knickers. But really, who cares about the plot - the makers obviously didn't. The nude musical and the swinging party leave a lot of scope to include scenes of naked birds walking around with their knockers and bums showing; the party is the film's set-piece, with a number of cut-aways to action in side-rooms: an ugly hairy herbert having a threesome with a couple of old trollops and two girls getting Sapphic in a hot tub (and there's a deleted scene of another threesome at the party, involving two girls and a cute French guy, which is miraculously for a British film actually pretty hot, but of course that's the one that ended up out of the final cut). The agent is played by the film's co-writer, the egregious bit part spiv John M East, a true Archie Rice of the British sexploitation genre, who litters the dialogue with pathetic quips, awful puns, poor double entendres and unfunny \"jokes\". There's a bit more pizazz to the film-making than in producer David Sullivan's previous film Queen of the Blues, and the whole thing is so cheap and nasty that it's quite a gripping short watch (it moves along at a decent enough lick). At the very least, you can't say that the pornographers who made it were after aggrandising themselves - Soho is portrayed as a sordid little world full of two-bit chancers, back-stabbing cheats and low business chicanery. As such, it reveals a pretty horrible corner of Capitalism and the sleaze-balls who inhabit it which has perhaps more genuine honesty than a more respectable film or TV programme of the era might dare show.",
         "EMMANUELLE IN SOHO sounds like one of the sleaziest films ever; just the combination of that character and the setting says it all. But this extremely low budget movie has nothing to do with the official Emmanuelle series or indeed the Black Emmanuelle series either. Instead it's a laughably inept slice of British softcore nonsense, in which Emmanuelle is a supporting character in a hugely uninteresting storyline. The tale sees erotic photographer Paul Benson (Kevin Fraser, with the worst haircut in the world) being ripped off by his sleazy boss (writer John M. East, a truly repugnant character) while his wife tries to make ends meet on the stage in a dodgy striptease production. It's all very silly, padded out with endless softcore sex sequences that are anything but titillating. The actress playing Emmanuelle, Angie Quick, looks and acts no different to your typical Page 3 model. Julie Lee, a half British/half Oriental beauty, looks better, but ruins the illusion whenever she speaks; her Sheffield accent puts paid to that exotic appeal. Lee was to die in a horrific car accident soon after this production, leaving EMMANUELLE IN SOHO an odd epitaph to her non-existent career.",
         "After being pleasantly surprised by Norman J.Warren's delightful British Sex Comedy Spaced Out,I decided to take a look at a British Sex Comedy that a friend had recently picked up,which had been credited as the \"last ever\" title from the British Sex Comedy movie era. The plot: With having practised for a good while by taking a number of \"Adult\" photographs,amateur photography Paul Benson decides to visit leading 'Adult\" magazine owner Bill Anderson in the hope that Anderson will be happy with what he is shown,and offer Benson a good amount of cash for the photos.Taking a half-bored look at Benson's portfolio,Anderson announces that he will only pay in pennies,due to the photo's looking like nothing special at all. Accepting the cash offer due to being desperate for money,Benson soon finds out that Anderson is secretly selling the pictures on for an insane amount of money,which leads to Benson deciding that the next thing he films/shoots will be will be something that Anderson will never forget. View on the film: Before getting to the movie,I first have to praise the great work that Odeon Entertainment have done for the DVD,with the disc featuring an unexpectedly clear picture and soundtrack,and also having some pretty interesting extras about the alt US cut of the film. Keeping the film, (which was delayed from filming for a year,due to the originally chosen actress,Mary Millington sadly dying from a suicide) limited to a swift 65 minute running time,the screenplay by Willy Roe and John M.East makes sure that the film never becomes dull,thanks to making the movie having a strong dash of sleaze,whilst also including a nicely tough ending. Backed by a smooth jazz score from Barry Kirsch,director's David Hughes and Ray Selfe give the rather dull performances from the entire cast a much needed sense of fun,thanks to the directors using sharp editing to give a number of scenes in the film a real snap,which help to make this visit to Soho be one that is likable,but not at all exciting."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Roldvale"],
      "summaries": [
         "The first portion of this film is a documentary on the adults-only entertainment industry prevelent in London's Soho District. The second details the trials and tribulations of a struggling photographer, his unsatisfied wife, and their friend Emmanuelle, as they try to make it big in Soho. They decide their ticket to success will come by blackmailing a wealthy adult film tycoon.",
         "Emanuelle lives in London where almost everything in the realm of erotic is available. Her friend Kate becomes a nude revue show to help her husband pay the bills."
      ],
      "budget": 0
   },
   "movielensId": 148084,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-01-01",
      "dvdReleaseDate": null,
      "directors": ["David Hughes"],
      "runtime": 72,
      "movieId": 148084,
      "title": "Emmanuelle in Soho",
      "mpaa": "",
      "actors": [
         "Angie Quick",
         "Julie Lee",
         "John M. East",
         "Kevin Fraser",
         "Gavin Clare",
         "Timothy Blackstone",
         "Geraldine Hooper",
         "Anita Desmarais",
         "Linzi Drew",
         "Maria Harper"
      ],
      "imdbMovieId": "0124464",
      "originalTitle": "Emmanuelle in Soho",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["dtlpzFTgdpo"],
      "plotSummary": "The first portion of this film is a documentary on the adults-only entertainment industry prevelent in London's Soho District. The second details the trials and tribulations of a struggling photographer, his unsatisfied wife, and their friend Emmanuelle, as they try to make it big in Soho. They decide their ticket to success will come by blackmailing a wealthy adult film tycoon.",
      "tmdbMovieId": 29539,
      "avgRating": 5,
      "releaseYear": "1981",
      "numRatings": 1,
      "posterPath": "/rYUULFRj8wsL7fwbc2YyQ5aTShW.jpg"
   }
}