{
   "tmdb": {
      "original_language": "xx",
      "keywords": [
         {
            "name": "experimental",
            "id": 14629
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0241763",
      "video": false,
      "title": "Newark Athlete",
      "recommendations": [
         32571,
         33229,
         96882,
         129865,
         16624,
         147397,
         105352,
         129863,
         127792,
         162853,
         94570,
         33315,
         100247,
         194039,
         127764,
         33318,
         143770,
         114145,
         49271,
         144421
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a3ec3a36847f81c32af",
            "name": "William K.L. Dickson ",
            "profile_path": "/gqyFBW6i07NodR9wTrGG13hjoZm.jpg",
            "id": 110347,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.995552,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 104852,
      "vote_count": 20,
      "budget": 0,
      "overview": "Experimental film fragment made with the Edison-Dickson-Heise experimental horizontal-feed kinetograph camera and viewer, using 3/4-inch wide film.",
      "similar": [
         19,
         81003,
         460793,
         74643,
         82023,
         458663,
         455661,
         251516,
         9662,
         14813,
         36208,
         326359,
         43641,
         28966,
         293299,
         234,
         961,
         13932,
         992,
         50393
      ],
      "original_title": "Newark Athlete",
      "runtime": 1,
      "poster_path": "/hKPQ2IVTbZZdmc5UBDw0lYsVMSQ.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Edison Manufacturing Company",
         "id": 18758,
         "origin_country": ""
      }],
      "release_date": "1891-05-01",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William K.L. Dickson"],
      "runtime": 1,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0241763/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "This ultra-short feature is one of a small number of surviving experiments made by the Edison Company in the same year as the well-known \"Dickson Greeting\" film. As such, it is simple but successful, accomplishing its goal of capturing the motions of its subject while also providing a clear image of him. The footage simply shows one athlete or gymnast who makes a movement with a pair of clubs. The movie succeeds in photographing the subject in some detail, and in capturing the motion smoothly. The motion is equally clear at each of the speeds in the preserved footage. These are simple goals, to be sure, but they are basic foundations of cinema, and they had to be met before the new invention could be used for more complex and interesting movies. In 1894, when the Edison Company was expanding its film production for commercial use in their Kinetoscopes, a similar camera test was done with the newer equipment then in use. That film, \"Athlete With Wand\", served a similar purpose, and it is of interest in comparison with this one.",
         "according to the edison motion pictures site this was an experimental picture to test new equipment and new techniques more than anything else. the film is a small fragment of a boy swinging his clubs. part 1 is the original and part 2 is the looped version. all this will make a bit more sense when you see fragment 2 where all the material was composed together by gordon hendricks. the film looks scary like eraserhead, only missing the noise typical for lynch :) not as interesting as some of the other early heise/dickson works, but worth seeing.",
         "This movie is a very short and simple experimental film fragment made with the Edison-Dickson-Heise experimental horizontal-feed kinetograph camera and viewer, using 3/4-inch wide film. Guess it sounds more complex than it really was. Basically all it shows is an 'athelete', who to me just seemed to be a random young boy, swinging a couple of Indian Clubs. The movie doesn't have the best visual quality and it seems to end perhaps just a second before it was really supposed to. It doesn't even have a halve swing now but more of a quarter swing. Also judging by the quality I'm not sure of it if this was a good successful experiment from Edison and workers but then again at that time of course all experiments were useful and contributed to the development of future movie making, this one included. 6/10 http://bobafett1138.blogspot.com/",
         "Between the years of 1888 and 1889, American inventor Thomas Alva Edison became very interested in developing a device able to show \"motion pictures\". It was known that a french inventor named Louis Le Prince had made a movie in Leeds, England, in 1888; and Edison wanted to know how to make his own. Soon the idea came to him and he began working on his devise, however, he lost interest in it as he couldn't see any potential in the invention. Fortunately, one of his collaborators, Scottish inventor William K.L. Dickson decided to take the project and in 1890 he developed what would later be known as the Kinetoscope, a devise that showed short movies through the window of a cabinet. However, the movies Dickson made wasn't of a good quality, so he spent the following years trying to make something as good (or better) than what Le Prince had achieved. Many experiments were done, and by 1891, Dickson and his team were almost there. After the moderate success of his \"Monkeyshines\" experiments, Dickson knew he was able to capture images and reproduce them in his Kinetoscope, now all he had to do was to improve the quality of his movies. 1891 would be a year of constant experimenting, in hopes of showing the invention at the Chicago's World Fair. And among the films that Dickson was able to make during those years was this experimental movie codenamed \"Newark Athlete\". This movie depicted a man, apparently an athlete (although he could had been one of Edison's workers) as does some exercises swinging the clubs he has in each of his hands. The man raises the heads of clubs and keeps moving them for as long as the movie lasts, obviously hoping that his movements were being captured by the camera. Like most of Dickson's experiments, there was no plot or theme in the film, as this movies weren't meant to be shown to the public. The main purpose of the film is to check if the camera was able to capture the movements of the athlete, and to measure elements such as lighting, the quality of the lenses, the film and the recording speed. When compared to the \"Monkeyshines\" films, this movie shows a notorious improvement in the quality of the film, as the image not only moves at a fluid speed, it's almost as clear as Dickson intended. It wouldn't take him too long before he was able to make short films the way he wanted, and soon in that year he would make the first Kinetoscope movie shown to an audience: \"Dickson Greeting\", where he was welcoming us to the era of Kinetoscope. 6/10",
         "Beginning his new film Company, Edison, in searching for material audiences would find entertaining, decided to film a young Newark Athlete displaying his talent of swinging Indian clubs. This film was then probably one of the first movies by the Edison company that featured a display of skill, something that many of Edison's early films would show. In fact, considering it's 1891, this was probably the first one that falls in that genre. I'm not sure who the athlete was but while his skill isn't all that impressive, it is still extremely interesting in terms of historical interest which makes this a must-see. Yes, all we see is the Athlete of the title swinging some clubs but try to remember this was one of Edison's first film experiments. While the footage is indeed quite interesting, the fact that it is sadly damaged is unfortunate. I'm guessing this was a time defect not that it was taken that way. For all of you who are fans of Hollywood remember that while this footage is extremely crude and beat up looking it was the beginning and you must respect it. Sure, there are much more prolific films from Edison out there but while there's nothing too special about the athlete's talent in terms of what we see today it is definitely more interesting than seeing a train arriving in a station. I'll give this an eight of ten for the simple fact it is an important historical artifact. And also it's pretty interesting in its own way. (Note: Two different 'fragments' of this survive. One is very brief and is damaged by a black shutter effect at the end. In the other, we actually see the guy make a full swing with the clubs. I'm not sure why there are two available clips, but in the quick one, the lighting is better; in the other, the lighting is darker).",
         "In compare with other Edison (Dickson) installaments, this footage for me is poorest (eventually better than Monkeyshines). Quality is bad and in comparison with Men's Boxing it doesn't show any progress, quite to the contrary. Good things that film brings to me is increasing of my general knowledge. Until now I have no idea what Indian clubs are and what is their purpose. Second thing about that movie is that this movie was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". It is currently the oldest film chosen to be in this Registry.",
         "An athlete swings Indian clubs. There is not much to say about this because it is very brief, very damaged and not much happens -- a pair of clubs spin a couple times. I suspect this was an important early film test, but it is in such awful shape today that it pretty much negates whatever value it has as historic. I have to wonder how Edison and Dickson went about choosing their earliest subjects. Why a man with clubs? For how brief the film is, he could have been jumping rope or swinging a bat. It really makes no difference because he is not given enough time to really exhibit any skill.",
         "This is a particularly interesting document of movie history looking at the fact that it was recorded even before the first Olympic Games of the modern era 1896 in Athens. He wasn't there most likely, but here he gets the chance to show everybody 122 years later what he can do with the clubs. This is Dickson's first work after the Monkeyshines trilogy and while he was experimenting right in front of our eyes in that one, he's certainly done a lot of testing that we didn't witness in-between the projects as well. Newark Athlete is clearly improved and quality-wise several leagues above his previous work.",
         ". . . one giant leap toward ESPN. What is truly amazing is not the fact that one of the world's first dozen movies is a sports feature, but the fact that this \"NEWARK ATHLETE\" has his less than scintillating routine with two wooden exercise clubs (think mini bowling pins) shown FOUR TIMES IN RAPID SUCCESSION. Exhibited with a total running time of just 5.11 seconds, close examination proves that the initial slow-motion view of 1.97 seconds is followed up BY THE SAME THING being shown over and over and over again at successively faster speeds. No wonder guys can sit through endless replays of the least little fumble or failed catch on a Sunday afternoon--they've had long enough since this 1891 flick to BECOME GENETICALLY MUTATED against boredom, reversing what evolution took tens of thousands of years to accomplish! Who knew subliminal messaging conducted FROM THE START of motion pictures would have such a powerful AND RAPID effect in transforming the male brain! For countless centuries the world depended on men. Thanks to Edison Manufacturing Company, about all we have left nowadays is game boys!!",
         "Newark Athlete (1891) Men Boxing (1891) Newark Athlete is just a brief fragment from the Edison studio, which was apparently just a set up test to check the conditions on the camera. The thing only lasts a few seconds so needless to say the studio wasn't trying to make anything special out of it but thankfully the thing survives so film buffs such as myself can view the early history of film. Men Boxing on the other hand seems to be the studio actually trying to put something fun on film. Two men, both wearing boxing gloves, throw a few punches at one another while smiling for the camera. Some think this once again was just testing the camera but since it contains a tad bit more I'm going to guess the men making it thought this could be something real.",
         "An athlete (from Newark I presume) waves two clubs in a quick routine. This was filmed by W.K.L. Dickson and William Heise for the Edison Manufacturing Company. It was made using the horizontal-feed Kinetograph that was developed by Thomas Edison and Dickson. A big step forward, this film is much clearer than the previous three Monkeyshine films from the same group of people the in 1890. The movement of the boy is able to been see easily. Heise and Dickson' films would continue to improve in quality. Again not much to see here but maintains interest as a relic of a time long ago. I gave it a 2 out of 10."
      ],
      "genres": [
         "Documentary",
         "Short"
      ],
      "productionCompanies": ["Edison Manufacturing Company"],
      "summaries": [
         "A young man stands before the camera holding a club in each hand, horizontal to the ground. He raises the heads of the two clubs in unison, by rotating the clubs without lifting his arms. The film then shows the same footage over again, at different speeds.",
         "An athlete swings Indian clubs."
      ],
      "budget": 0
   },
   "movielensId": 148064,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1891-05-01",
      "dvdReleaseDate": null,
      "directors": ["William K.L. Dickson "],
      "runtime": 1,
      "movieId": 148064,
      "title": "Newark Athlete",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0241763",
      "originalTitle": "Newark Athlete",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Experimental film fragment made with the Edison-Dickson-Heise experimental horizontal-feed kinetograph camera and viewer, using 3/4-inch wide film.",
      "tmdbMovieId": 104852,
      "avgRating": 1.4375,
      "releaseYear": "1891",
      "numRatings": 8,
      "posterPath": "/hKPQ2IVTbZZdmc5UBDw0lYsVMSQ.jpg"
   }
}