{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "equestria girls",
            "id": 206995
         }
      ],
      "imdb_id": "tt3529198",
      "video": false,
      "title": "My Little Pony: Equestria Girls - Rainbow Rocks",
      "recommendations": [
         201676,
         405314,
         25396,
         257192,
         276306,
         58375,
         327953,
         257063,
         303026,
         297600,
         57505,
         210914,
         250539,
         349158,
         19789,
         331474,
         256439,
         292125,
         80170,
         85944
      ],
      "backdrop_path": "/kuU4q6kkdvGZfm8zwv5CRUSqkGN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 21,
               "character": "Twilight Sparkle",
               "gender": 1,
               "credit_id": "55526cccc3a36834e1005800",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Rarity / Vice Principal Luna",
               "gender": 1,
               "credit_id": "5412ef80c3a3682f6800134e",
               "name": "Tabitha St. Germain",
               "profile_path": "/qu5bdk5POJHAne8XR6G0F4RrG5l.jpg",
               "id": 74360,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Pinkie Pie / Fluttershy",
               "gender": 1,
               "credit_id": "5412ef910e0a2673220012f8",
               "name": "Andrea Libman",
               "profile_path": "/8tPjtsYr8NQpdX64hctM6UOOlJQ.jpg",
               "id": 74368,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Applejack / Rainbow Dash",
               "gender": 1,
               "credit_id": "5412efa2c3a3682f68001352",
               "name": "Ashleigh Ball",
               "profile_path": "/oLomk8cQv2xPBQyRhYJRotQdgBs.jpg",
               "id": 94481,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Principal Celestia",
               "gender": 1,
               "credit_id": "5412efcd0e0a26731b0013d2",
               "name": "Nicole Oliver",
               "profile_path": "/czbvdAWjjsmN90Y5eZU0KGtZjv3.jpg",
               "id": 74370,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Adagio Dazzle / Rarity's singing voice",
               "gender": 0,
               "credit_id": "5412efff0e0a26731b0013d7",
               "name": "Kazumi Evans",
               "profile_path": null,
               "id": 569211,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Spike",
               "gender": 1,
               "credit_id": "546b0cd1c3a3680d6f00105f",
               "name": "Cathy Weseluck",
               "profile_path": "/4t6ud3KC5FF9ugAYRgHxi8x5Nuo.jpg",
               "id": 94479,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sunset Shimmer / Twilight Sparkle's singing voice",
               "gender": 0,
               "credit_id": "546b0d1cc3a3680d6c001133",
               "name": "Rebecca Shoichet",
               "profile_path": null,
               "id": 1240646,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sonata Dusk",
               "gender": 1,
               "credit_id": "546b0d9bc3a3680d7d0010a1",
               "name": "Maryke Hendrikse",
               "profile_path": "/9iMFnpg5VmZvNWJ7Lo9AlvemoMb.jpg",
               "id": 85432,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Aria Blaze",
               "gender": 1,
               "credit_id": "546b0dab92514101f200123f",
               "name": "Diana Kaarina",
               "profile_path": null,
               "id": 526306,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Flash Sentry",
               "gender": 0,
               "credit_id": "546b0dbb92514101e9001005",
               "name": "Vincent Tong",
               "profile_path": null,
               "id": 1240645,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Trixie Lulamoon",
               "gender": 1,
               "credit_id": "546b0ddcc3a3680d7f0011c6",
               "name": "Kathleen Barr",
               "profile_path": "/5eHupAvT4hsj15MABJCKjGMKKZ5.jpg",
               "id": 45923,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Snips",
               "gender": 2,
               "credit_id": "546b0de9c3a3680d75001139",
               "name": "Lee Tockar",
               "profile_path": "/8Kqr4n8BXp2xN3taamXbbnh9jBV.jpg",
               "id": 74359,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Snails",
               "gender": 2,
               "credit_id": "546b0e01c3a3680d7f0011cb",
               "name": "Richard Ian Cox",
               "profile_path": "/zhpxBK7Bsrts28ZWlBZOn5KkhbX.jpg",
               "id": 153783,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Apple Bloom",
               "gender": 1,
               "credit_id": "546b0e45c3a3680d69001312",
               "name": "Michelle Creber",
               "profile_path": "/aosvfBTVknDwEROuQfZgFyrtVLE.jpg",
               "id": 1027643,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Pinkie Pie's singing voice",
               "gender": 0,
               "credit_id": "546b1f1392514101e90011ff",
               "name": "Shannon Chan-Kent",
               "profile_path": "/8IlXko1VTY1C7IX5U38tweXJQjJ.jpg",
               "id": 221843,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5412f086c3a3682f5500138a",
               "name": "Ishi Rudell",
               "profile_path": null,
               "id": 1363227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5412f06fc3a3682f6200134f",
               "name": "Jayson Thiessen",
               "profile_path": "/fFFQZe05sIshBqVIb9DwtD1YfvT.jpg",
               "id": 1363226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5412f093c3a3682f5e0012fc",
               "name": "Meghan McCarthy",
               "profile_path": null,
               "id": 1183757,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5412f0a80e0a26731400125b",
               "name": "Daniel Ingram",
               "profile_path": null,
               "id": 1183756,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5412f0d3c3a3682f5e001303",
               "name": "William Anderson",
               "profile_path": null,
               "id": 1183755,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 5.885837,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 292177,
      "vote_count": 27,
      "budget": 0,
      "overview": "Music rules and rainbows rock as Twilight Sparkle and pals compete for the top spot in the Canterlot High \"Mane Event\" talent show. The girls must rock their way to the top, and outshine rival Adagio Dazzle and her band The Dazzlings, to restore harmony back to Canterlot High.",
      "similar": [
         89185,
         272693,
         10625,
         376660,
         9880,
         21705,
         449176,
         13342,
         308369,
         13523,
         11887,
         378064,
         20771,
         2105,
         76726,
         85350,
         8363,
         10229,
         3597,
         286987
      ],
      "original_title": "My Little Pony: Equestria Girls - Rainbow Rocks",
      "runtime": 75,
      "poster_path": "/xcSrR4HXHsFXqjAg8nY7y6JMAG4.jpg",
      "spoken_languages": [
         {
            "name": "Polski",
            "iso_639_1": "pl"
         },
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "DHX Media",
            "id": 7225,
            "origin_country": ""
         },
         {
            "logo_path": "/37ZxE1qShQ44VdsRPkO1zOtnMKi.png",
            "name": "Hasbro Studios",
            "id": 22826,
            "origin_country": "US"
         }
      ],
      "release_date": "2014-09-27",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/xZQpaBH9UOhTx5WWV9ND5mudi1Q.jpg",
         "name": "My Little Pony: Equestria Girls Collection",
         "id": 343297,
         "poster_path": "/4M2ILVXIbwMRWdAlqRRdVLHua4T.jpg"
      },
      "tagline": "To Restore Harmony, The Bands Must Battle!",
      "adult": false,
      "homepage": "http://www.mlpeg.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jayson Thiessen",
         "Ishi Rudell"
      ],
      "runtime": 75,
      "synopsis": "The film starts in a small cafe,where a number of teenagers are seen arguing. It is soon apparent that their bad moods are being created by the siren song of three teenage girls in a corner booth. The three girls bicker that the negative energy they've absorbed isn't enough to properly 'feed' them, when a bright flash outside attracts their attention (the magical epilogue of the first Equestria Girls film!). The leader of the girls, Adagio Dazzle, recognizes the effects as \"Equestrian Magic,\" and decides along with her cohorts (Sonata Dusk and Aria Blaze), to find its source, and regain their former powers. The scene then cuts to some time afterwards, with Canterlot High School preparing for a school-wide Musical Showcase. Since the events of the first film, Sunset Shimmer has been guided by Applejack, Fluttershy, Pinkie Pie, Rainbow Dash, and Rarity in helping to reform herself from her old ways. However, much of the school has not so easily forgiven her past transgressions. As the girls prepare for the Showcase (with Sunset watching), their pony tail and ears manifest while playing, a side-effect that is unexplained. Soon after, Sunset goes to welcome three new students to the school and show them around. The three girls happen to be Adagio, Sonata, and Aria. Sunset is a little surprised by their demeanor, as well as the red pendants around their necks. After the tour, Sunset tells her friends that she fees there was something 'off' about the girls. As they talk, the three strut into the cafeteria, singing a song about having a 'Battle of the Bands,' that soon has almost everyone in the cafeteria determined to be the best musical act at the school. However, the song doesn't affect Sunset or the 'Mane 5.' The girls are sure there is something evil about the girls, but going to Principal Celestia and Vice-Principal Luna proves ineffective, as the three girls have already gotten to them. Celestia tells how the girls have convinced them to turn the Musical Showcase into a Battle of the Bands, and the three have already signed up (under the name, The Dazzlings). With noone else to turn to, the girls first thought is to try and contact Twilight Sparkle, but the portal between their worlds is still closed. It is then that Sunset Shimmer remembers a journal she used to keep when she was Princess Celestia's pupil. When she would write in the book, what she wrote would appear in a book in the Canterlot Library. The message gets through to the other book, which happens to be arriving in a delivery to Twilight's new castle. Twilight reads through the book, and determines that the girls her Canterlot High friends are talking about, are a trio of creatures known as \"The Sirens.\" According to a book in her new library, Twilight finds that the Sirens were 3 creatures that fed on the negative energy of other ponies, but were banished from Equestria by Starswirl the Bearded. Twilight wants to help her other-world friends, but it soon becomes apparent that the main portal is still closed. However, realizing that the book that Sunset Shimmer has written in has cross-dimensional properties, Twilight rigs a special portal, that uses the magic in the journal, to create a temporary portal that she and Spike can enter through. Twilight's friends are of course happy to see her, with Spike helping to fill them in on what has happened since Twilight was last there (such as her title as a \"Princess of Friendship,\" and her new castle). Hoping to stop the Dazzlings, the girls go to a party that evening where all the acts (and the Dazzlings) will appear. However, the three girls' powers have everyone at odds with each other, and noone is willing to mingle outside of their performing group. Twilight and her friends (minus Sunset Shimmer) then confront the Dazzlings. Holding hands and chanting \"Friendship is Magic!,\" leads to an embarrassing situation, when nothing happens! Adagio Dazzle takes the opportunity to psyche up the rest of the groups, claiming that 'these girls' seem eager to win.' However, as Twilight and her friends leave, Adagio makes note that 'these girls' are special, in that they are not under the Dazzling's negative magic effects. Outside, Twilight wonders just why her plan didn't work. Sunset Shimmer helps surmise that the Dazzlings' power comes from their music, and the girls decide that the best way to counter it, would be to make a musical counter-spell. Twilight reluctantly volunteers to create one, but after a full day of work, hasn't come up with anything in time for the auditions for the Battle of the Bands. Since they don't have a counter-spell ready, the girls plan to just keep active in the auditions, figuring if they make it to the finals, that should give Twilight enough time. At the auditions, the girls' song attempts go awry due to some sabotaging by several of the students, as well as each of the girls having their own wants and issues. Hoping to calm the girls down, Sunset Shimmer requests they go practice elsewhere, while she goes to keep an eye on the Dazzlings. However, the Dazzlings find her, and dig into Sunset's ego, claiming they know of her past, and that she'll be even more forgotten very soon. As the auditions continue, numerous groups are eliminated, until it's down to the Dazzlings, the Rainbooms, and (The Great and Powerful) Trixie. To try and push them into the finals, Rainbow Dash recommends they do her song, \"Awesome As I Want To Be.\" However, getting too into her song, Rainbow begins to materialize her pony ears, causing Sunset to panic and tackle her, throwing the group into chaos, and the school to laugh at her 'bad girl' efforts. The girls are sure they're done, but they (and Trixie) are shocked when they are confirmed to go up against the Dazzlings in the finals. The girls next are seen on the stage rehearsing, when Trixie shows up, and still upset at losing to the girls, sets off a trap door, trapping the Rainbooms under the stage. With the girls no-shows, Trixie performs on stage, before the Dazzlings go on. However, in their trapped quarters, the Rainbooms begin to argue amongst themselves, over all the little things that have been problems during their time as a band. Sunset sees this, and pleads with them to stop, and that the negative energy they are giving off, has got to be what the Dazzlings hoped for all along! The girls stop their arguing, and manage to escape with the help of Spike and DJ PonE.",
      "writers": [
         "Lauren Faust",
         "Meghan McCarthy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3529198/",
      "coverLink": null,
      "actors": [
         "Tara Strong",
         "Ashleigh Ball",
         "Andrea Libman"
      ],
      "reviews": [
         "I'll gladly state that I liked the first film in spite of its flaws; and I'm happy to say that this sequel is better than the first in practically every aspect! The animation is a lot better this time around and the songs have more variety. The characters remain likable and the humor is really good. The references and cameos are still aplenty and, as a fan, I thoroughly enjoyed spotting each one. The villains weren't the best MLP has given us but they were still passable and served their purpose well. But the best part about this movie by far was Sunset Shimmer. Her development, characterization, and arc in this movie were outstanding! This movie made me love Sunset (who I originally felt meh about after the first film) and I really want to see more of her in the future. Also, just a tip, make sure to stay after the credits because there's a nice surprise at the end that opens up a world of possibilities for the future of \"Equestria Girls\". Overall, \"My Little Pony: Equestria Girls: Rainbow Rocks\" was a great movie and a huge improvement over its predecessor. I can't wait to see how this spin-off series develops from here!",
         "A lot more musical, an amazing storyline. The Dazzlings feel like amazing brand new villains in the movie and feel much darker for the Bronies, and the story feels a lot more swell in many ways. Being back in the human world of Equestria feels more fun and more adventurous, plus the score and the songs of this are feeling like they have more potential and really gives us positive views. My Little Pony Equestria Girls Rainbow Rocks is way more better than the first one with a brand new story, more songs, new characters and villains, and a brand new musical adventure becoming an amazing movie that Hasbro Studios and DHX media have made.",
         "What an addition to the \"My Little Pony Friendship Is Magic\" franchise! This film has references to the first movie, a bit of story from the last season of the show and even all the little extra characters that My Little Pony fans love! It is definitely a combination of adventure with a crème of comedy and a sprinkle of excitement all rapped up in a friendship sandwich. The adventure starts when a band performance is planned at Canterlot High where the kids can make bands and raise funds and three very unusual girls turn it into a super competitive battle of the bands. When they run out of things to do, Twilight's friends from that world call to another world where Twilight is. Will they be able to come there and save them or will evil prevail? This film is just fantastic! Hasbro was smart to include a lot of little fun things from the shows that fans adore including the beloved Derby Hooves pony who is really never part of the story, just in the background for fun. The songs are great as well. We hear not just the classic My Little Pony songs from the TV show. Instead, the music is very pop like which suits the story well. I imagine that sing-along coming to the fans shortly and being a smash hit. The show's creators also connected to the first Equestria Girls movie which I thought was perfect. My favorite scene is when girls are having a sleep-over at Pinkie Pie's house. When Twilight gets out of bed and walks to the kitchen she finds Pinkie's older sister feeding her pet boulder. I love this scene because, in the show, there is an episode where we meet this sister. So, I thought having her in the movie is a great idea and so unexpected. This film does not have anything parents should be worried about and for extremely little kids who do not understand the ponies, they will enjoy the bright colors. I give this film 5 out of 5 stars for its original story, fantastic songs and those little characters that fans and Bronies love so much! If you want to see \"My Little Pony Friendship Is Magic, Equestria Girls: Rainbow Rocks,\" check it out at your nearest theater. Reviewed by Gerry O, KIDS FIRST! Film Critic.",
         "Last year when Equestria Girls was announced, there was some outcry among the fans of My Little Pony: Friendship is Magic that they were turning our beloved ponies into human teenage girls in high school. When it was released, it got mixed reviews. I personally thought it was simply good, but flawed in that it put a little too much focus on Twilight and Spike. Normally, that would be a good thing because Twilight is my favorite character, but the film was simply too much exposition and not enough story. Rainbow Rocks, however, is a completely different animal altogether. This film is definitely a thousand times better than the first. One part of the genius of this film is the emphasis on the music, which has been part of FiM since the beginning thanks to songwriter Daniel Ingram and score composer William Anderson. Another improvement over the first was having the villains keep with the music theme by making them sirens. Also, Sunset Shimmer works so much better as a protagonist than as an antagonist. Another benefit of this film is there is an equal amount of emphasis between each one of the mane six, as well as giving some background favorites the spotlight. All in all, if you excuse the cliché, this film ROCKS!",
         "The music is toe-tapping, catchy and fun to listen to, the animation is an improvement over the last film and as is usual with MLP, the voice acting is superb. It does feel like something is missing, though. It's not a bad movie by any means. I've watched it a couple times and found it to be entertaining both times. Be that is it may, I feel like \"Friendship is Magic\" has this certain charm and Rainbow Rocks just isn't able to emulate that charm.... maybe it's not trying to, though. Maybe it's trying to be its own thing. I enjoyed it more than the first movie but there's still a lot of room for improvement if they continue this film series. I'd give it watch.",
         "When I heard about this sequel being made, I was looking forward to a movie that learns from the first movie's mistakes and fixes them. And I was not disappointing. It improves over the first in every way, and manages to be entertaining and engaging throughout the run-time. The villains are more interesting and threatening, sunset shimmer actually gets some development, the references feel less forced and very funny, and there is very little of flash sentry. I was hoping he would either get a character in this or have minimal screen-time, but I guess the latter is fine.The animation is much better, and feels like it is on par with season 4, and the artists also paid much more attention to detail in the character designs. The story is also much better. The three sirens want to harness the magic of the entire school to take over the world, But they need to sing in order to do it, and the rainbooms (The humane 6) call on twilight from equestria to perform a counter spell to stop them.The villains, Adagio dazzle and her two cronies (aria blaze and sonata dusk, the latter of which makes me laugh every second shes on screen), are very effective villains in being able to manipulate other characters to do their dirty work, all thanks to their hypnotic music. Speaking of which, the pacing is also much better, whereas the original had a very rushed climax (IMO) and very slow first act. This movie feels very natural, and the music helps the story in better ways to move the plot along. The music has to be the highlight of this movie. every song is absolutely amazing, and Daniel Ingram has really outdone himself here. While the first movie had two catchy songs out of I believe 6, every song here was terrific, as are the incidental tracks,And are all played with very memorable and creative visuals. All in all, I loved this movie and am totally hyped for Equestria girls 3!",
         "Rainbow Rocks is the sequel that fixed everything wrong with the first one and made it better. Those who think humanized ponies is a bad concept need to watch this immediately. Probably one of the biggest improvements was the pacing. The editing doesn't feel frantic and many scenes are deliberate and slow. I especially loved how many of the shots focused on Sunset Shimmer. The entire movie feels more tightly-knit even though it does suffer from rushing in a few moments. The villains also felt more dynamic and had personalities that emphasized the theme of the movie. Songs were also good. But the best part of the movie was Sunset Shimmer, hands down. Sunset takes on a new persona that the show really needs to focus on. In fact, this movie is better than the season 4 finale in that regard since Twilight actually teaches Sunset the value of friendship--Twilight's element of harmony. The key scene in the film was Sunset and Twilight just talking to each other and noting their ironically parallel relationship. Sunset was the spotlight of the movie and really played up the role of the misunderstood friend. Her facial expressions and tentative movements vividly depict her reformation in a way that outshines Discord's by a long shot. I really hope the new spin-off focuses more on Sunset than Twilight. Other things of note. Unicorn horse was random. Lyra x Bon Bon canon. Drinking game: drink if you want to give Sunset a hug. Villains were somewhat sexy. Octavia has a voice! Rebecca Shoichet sang with herself in \"Welcome to the Show\" (Sunset with Twilight). Pandas were definitely thrown. Flash Sentry is useless, again. Overall, 10/10. Excited for spin-off, even more so than season 5.",
         "This movie is awesome and do you know why it's awesome, I'll tell you. 1)Plot: The story is about a group called The Dazzlings, who uses their magic to feed on the hatred of the people around them, One day they went to Canterlot High and turns the school's scheduled musical showcase with a Battle of the Bands competition, so the rest of the Humane 6 and Sunset Shimmer needs the help of Twilight Sparkle, she gets the message, makes a portal and goes to the Human world, during her time there, she needs to make a counter spell, so that they can beat the Dazzlings, stuff happens and they win! 2)Characters: The characters in this movie is are more entertaining and memorable than Equestria Girls, especially the story arc for former antagonist Sunset Shimmer, she is currently my favourite character in Human Equestria, with Sonata Dusk at a close second. 3)Songs: If you guys already forgotten, this movie has a lot more songs than in Equestria Girls, but the song that shocked all of us was that this movie has the only time when Rainbow Dash has her own song, that song is \"Awesome as I wanna be\", other songs include\"Rainbow Rocks\", \"Battle of the Bands\" and \"Shake your tail\". This movie is so awesome, you could forget the flaws and that the concept of the Humane 6 being in a band and have to battle other bands is kind of unoriginal, but it's still a good 73 minutes.",
         "The show itself is great! So why do we need a movie? Or better yet a sequel to a horrible movie? I like My little Pony Friendship is Magic. I hated the first movie and this one is almost as bad. 1. The characters are dull, unfunny and obnoxious. The jokes they try to make aren't funny the first time and they keep hitting you over the head with them. Sunset Shimmer is the only likable character in this movie. I wanted to see her become good and to let everyone else know how much she has changed. I felt a connection with her and I want to see her succeed. 2. The songs are honestly forgettable. This is pop song mess. If you want to listen to annoying pop songs than go to a popular radio station. They play those songs all the time. 3. The plot is a mess and thankfully not as bad as the first movie. However it is uncreative plus none of this affects the show. It's not like Twilight Sparkle learned anything like in the last movie except she can't always do everything. However we had that message already before. Plus she is starting to become very whiny and acts more of a drama queen. 4. The villains are pretty dull. All they want to do is make everyone adore them. Okay....then what? they never really explain their motivations clearly and they're terribly underdeveloped. 5. The ending is the same as before. Deus ex machina is starting to really get old. Plus how do their 'powers' work? They asked why does it work but they shrug it off by making Rainbow Dash say 'who cares?' Umm, I care. I'm a fan and audience member. I should know how your powers work. Just like the first movie it takes an interesting idea from the TV show and make it dull. Why couldn't they go on a journey like Homeward Bound did? That would've been incredible for them to see different sights of our world and admire it. Sadly all we get is another clique high school movie like the last one except this one has singing. I'm sorry that I had to see this movie and I'm sorry that it couldn't have been better. I know I said it's better than the first movie but that's like saying 'Well at least I didn't get hit in the head by a mallet but a hammer' I can't wait for Season 5 to come so I can forget about this movie. Even if you do like this movie you have to admit that you would rather watch the TV show than this.",
         "This film really did surprise me. I was a fan of the first movie for a while but it left me feeling underwhelmed. I was expecting a bit more for the first film in the series to be made. But this was the fun action adventure film I was waiting for! To start off, the villains of the film are great! Adagio Dazzle (Voice by Kazumi Evans is a great main villain and a very hypnotic presence, Aria Blaze (Voiced by Diana Kaarina) is a very moody and downbeat, yet still likable and fun character. Sonata Dusk (Voiced by the legendary Maryke Hendrikse) is a tonne of fun to watch! She gets great lines and the dizty-ness is just too cute! Sunset Shimmer is given much more of a character and an arc in this one and is sooooo likable! The songs are great! It's just a great film! Watch it and you won't be disappointed.",
         "Music was always a part of My Little Pony: Friendship Is Magic, and the spin-off movie 'Equestria Girls' also rocked a couple of memorable songs. The sequel 'Rainbow Rocks' takes things a bit further. This time the story itself is focused on music. Canterlot Hich School organizes a Battle of the Bands, and the 'Mane Six' get to be in a rock band. The songs are okay. One of the things I always liked best about this franchise are Daniel Ingram's songs. They're cheerful and playful and sometimes reminiscent of musical movie songs. All in all, they represent the tone of the show well. But the lyrics were never that good, there's a lot of repetitiveness and cliché. 'Rainbow Rocks' offers more of the same. Storywise I think it's better than the first 'Equestria Girls' because the story has more to it than just introducing the human world.",
         "Rainbow Rocks is the sequel to the first Equestria Girls movie. The first film was pretty bad that had a predictable story, a mixed bunch of songs, a generic setting and premise, and was nothing more than a cheap attempt by Hasbro to compete with Mattel's Monster High series and sell toys of the MLP characters as humans. Despite the mixed reception and all, a sequel was made, but this time it would have Sunset, the villain of the last movie, take center stage. Taking place after the events of the first movie, Sunset Shimmer has been struggling to fit in and make friends with everybody; especially since the school is still angry at Sunset for the years of torment she put them through. As Sunset struggles with fitting in, three mysterious girls come into the school and use some magic to twist the school and \"feed\" upon their hate and bickering. Now faced with a new threat from Equestria, Sunset must get Twilight to come back and team up to take down this threat. The first thing I'll say to the movie's credit, is the story is much better than the first movie's. While still predictable and by the numbers, this one actually works out a bit more and does have some better elements in it. The story overall is nothing amazing, but at least it's a step up from the previous movie at least. What's not so good though are some of the forced plot elements. When Sunset needs help from Equestria, she writes in a magic diary that can communicate with Princess Celestia. Yet as we see in Equestria, Twilight ends up with it for no reason at all other than because movie said so. There's no explanation as to why Twilight has something so dear to Celestia in her possession other than because the plot demands it. The other major forced thing is the romance between Flash and Twilight again. If you thought the first movie was bad, this is even worse. Not only is the dialogue between them still terrible and awkward and we still know nothing about Flash, but it also makes Twilight seemingly stupid. For example, Twilight meets with her human friends after being told about the new threat. The first thing she talks about? How Flash has been talking about her. Yes, this is the first thing she brings up in regards to a threat to the human world. And don't even get me started on that near kiss. Speaking of Twilight, while the movie seems to focus on Sunset initially and her dealing with her past demons, the movie ultimately focuses on Twilight. Sunset's story about her wanting to show she's changed doesn't get a lot of focus as a result. It's rather irritating since she was supposed to be the main character, but instead gets pushed aside by Twilight. To be fair though, like the last movie, the interactions with Sunset and Twilight are good again. They have some good character development and the scenes are pretty sweet overall. It's just a shame that it feels more like Sunset gets kind of pushed aside. The villains end up being three sirens disguised as humans. Sonata Dusk, Adagio Dazzle, and Aria Blaze, AKA the Dazzlings. They're much better villains than Sunset was in the first movie. While Sunset relied on intimidation alone to rule the school, these girls use magic and systematically take over. They also get a few good laughs, especially Sonata, and are enjoyable villains overall. With the theme of the movie being about a battle of the bands competition, there are a lot of songs in this movie. Unlike the first movie with how mixed the songs were, all the songs in this movie are really enjoyable. From the Rainbooms, to the Dazzlings, and even Trixie gets a song in. They're all enjoyable and different in their own ways. Even if you don't like the movie, I'd definitely buy the music for this movie and listen to it. The climax is better as well. Ignoring the really weird inclusion of Vinyl's car (Another toy Hasbro wanted to sell), it was kind of over the top and kind of exciting to see the sirens in their true forms and it was kind of awesome to see Sunset step up to the plate and help save the day. It's nothing amazing, but at least it's a step up. While not perfect and not something I'd watch constantly, Rainbow Rocks does end up being much better than the first movie. It does improve on many things such as the story, villains, characters, and songs. However, it still has some issues that hurt it as a whole. Twilight taking over ended up being the thing that hurt the most here. Sunset barely gets to do anything and gets pushed aside. Combine that with some issues with forced plot points and the terrible romance subplot, and it brings the movie down. However, those things won't ruin what is a pretty rocking movie overall, and is worth checking out.",
         "Rainbow Rocks, when I hear that I know that My little pony Equestria Girls is going to be part of the conversation or someone loves Rainbows . The whole movie is about Twilight Sparkle the Princess of friendship herself heading back to high school to battle another evil that is on a power trip, will she win in the end or will this be the end of the world as she knows it. I for one as of this writing know what to say but for the site guidelines I will not be spoiling the movie for you. Rarity and friends seem to have it in for one another, what is going on and can a fellow friend find out why it's happening and put a stop to it plus how is the princess of friendship a part of it, watch My little pony Equestria Girls: Rainbow Rocks to find out.",
         "When my nieces wanted to watch a movie with me I of course gave them the option to pick any movie they wanted. Little did I know they would pick My Little Pony:Equestria Girls- Rainbow Rocks. Without knowing much story-line and character wise I had nothing to lose I was just being the good uncle. Anyway the movie turn out to be quite interesting. What makes the movie works is the story and the soundtrack is the strongest point of the film The Animation is original and actually has some well done art work to it with cool effects. The Voice acting is very good along.There is a good percent of humor to be found in this movie but they focus the story on more important details such as character development What drives the movie home is the music, the movie features original songs each one have their own special magic to them my nieces and I favorite songs feature in the movie were \"Under our spell\" \"Welcome to the show\" and \"Let's have a battle of the bands\" Overall the film has good entertainment and the fans of My little Pony will enjoy it very much plus its good for the kids I give My Little Pony: Equestria Girls-Rainbow Rocks an 8 out of 10",
         "There were two things I did not like about the previous \"EQUESTRIA GIRLS\" movie. First was the shallow theme that fantastic musical talent wins you friends. In the last movie, instead of showing Twilight winning over the hearts and minds of her school mates through her honesty, sincerity and helpfulness, she wins them over through the magic of song and dance. Next is the tons of wasted potential to tell a much deeper or more mature story that one couldn't show in the regular MY LITTLE PONY FRIENDSHIP IS MAGIC series. Instead of that we get unnecessary musical numbers. RAINBOW ROCKS takes a dive off the deep end and make the music the central driving force behind the whole plot. Surprisingly, it works. And what we have is a decent musical movie that works around music to deliver the morals and themes that the franchise should have from the get go. As Canterlot High prepares for its annual talent showcase, three mysterious girls with mind controlling voices turn the showcase into a \"Battle of the Bands\". Their sinister songs bring out bitter rivalries between the bands, negative emotions which the girls seem to feed on and grow more powerful. Only the 5 main characters, Pinkie Pie, Rarity, Rainbow Dash, Fluttershy and AppleJack are unaffected by the spell due to their contact with Equestrian magic. Also unaffected is a reformed Sunset Shimmer, the antagonist from the previous movie. In an interesting reflection of the original 1986 MY LITTLE PONY cartoon, Twilight Sparkle takes on the \"friend from another world\" role that Megan had in that series. Only this time, it is a magical pony who travels to the human world to help solve her human counterparts problems. So in comes Twilight who soon realises that trouble is brewing from within. The gang ain't getting along due to conflicts of interest, egos and generally familiar problems that tend to crop up in any group of pals. Thankfully, the day is not saved once again through a song and dance routine but through some actual character development and harsh lessons. Generally the writing is an improvement over the lackluster first entry of EQUESTRIA GIRLS. There are good lessons to be learned from the way the group dynamics of our main characters grow and mature. The bottom line is that RAINBOW ROCKS keeps the conflicts real. The characters go through real problems that real people face everyday, solving them like real people and in doing so makes those characters all the more relatable. Most intriguing is Sunset Shimmer and her journey towards redemption in the eyes of her peers. Now the black sheep of the school, Sunset's character arc of regaining the respect and trust of her friends can get quite heart wrenching when you see how hard she tries and still people remember only her bad deeds of the past. This is a very real problem that youngsters face. Just as real is Twilight Sparkle's dilemma of being the designated \"hero\" and cracking under the pressure to live up to everyone's sky high expectations. \"Sky High\" also describes the production quality on this. RAINBOW ROCKS earns its status as a \"movie\" by showcasing a tremendous leap in terms of animation quality from anything seen in the TV series. The production team experiments with bolder shot set ups and action scenes and more detail in the art. Just look at the way the shadows from the refrigerator plays off Twilight and Sunset during a night scene in the kitchen! It is beautiful!. Designs have been tweaked slightly, making the humans look less uncanny. The characters facial expressions are the definite highlight here; dynamic, perfectly drawn, and covering a wide range of emotions that are complimented with some of the finest voice acting in modern animation. Of course, we have the songs. Expertly written and composed by Daniel Ingram, the songs are catchy and fun. As usual, one could compare them to the best of Disney musicals but with a more modern spin. Think of it as a fantasy styled retelling of Glee with a bit more depth. Moving into more mature storytelling seems to be the way to go, and a way that works well for the Equestria Girls franchise.",
         "I watched the first EqG movie somewhat reluctantly, but came away thinking it was quite cute. I believe my review of that one noted that I didn't mind it, but I didn't want a sequel. Of course, we got a sequel, and I very nearly passed on it, until the fandom started talking about how good it was. Yes, it really is better than the first - it's good enough, IMO, that it could have stood alone without the My Little Pony universe. (Although there is no doubt that helps get people in to see it.) Right from the opening scene it had my interest, tying directly into the climax of the first film. I love consistent universes, so tying in like that worked for me. The new villains are interesting characters with fantastic singing voices, and as the story revolves around their songs, this is an important thing. There is a LOT of fan service in this movie - viewers who are not a part of the Brony fandom probably won't get some (very short) scenes, but it is certainly trying to cater to the adult fan base whilst still servicing the younger market that it's actually aimed at. I don't know whether the kids are liking it, but the catering worked! The basic story involves exiled sirens from Equestria, sent to the human world by Starswirl the Bearded, and surviving on the little energy they could draw from causing conflict. Drawn to Canterlot high by the massive surge of Equestrian Magic during Sunset Shimmer's defeat, they convince the administration to convert an evening of music into a battle of the bands. The plan is to use their ability to cause people to fight to unlock the lingering magic, absorb it, and basically power up. Our little group is immune to their weakened powers, and seeing everyone else having trouble, call for Twilight to come help. There are some nice call-backs, including Sunset Shimmer briefly recalling her time as Celestia's student, and callbacks to the television series. The actual conflict and resolution is a little thin, and some of the running gags (Trixie being spotted every time she 'poofs' away, and Sunset Shimmer being called out for being a demon over and over), they wear a little. (In the case of SS, at least, she acknowledges her part, which I appreciated ;) ). As with the first Equestria Girls movie, the actual pony world feels out of place to me, although we get a lot more time with them this time. Besides the villains, the main conflicts are the people getting tired of Dash's ego in the band, and Twilight's inability to write a counter-spell song. As a plus, they don't keep throwing things at Fluttershy this time. ;) All that said, when the climax you're expecting finally comes together, it feels pretty good! It wraps up nicely! One more problem has nothing to do with the movie itself - the digital distribution system used in theaters may have some problems (but, with a short run this may not matter). A friend of mine had problems when he went, and my own viewing stuttered and dropped audio five times. Can't blame the movie for theater problems, but there's no other way I have to feed that back than here. ;) The last part that needs to be mentioned is the soundtrack. This movie is all about the music, and that's a good thing because it's fantastic. Daniel Ingram and William Anderson got a lot of mentions already, but the fact is that they deserve it. Their work in the series and the movies is always memorable, and this movie is really no exception. Between the hard beats of the Rainbooms and the hypnotizing rhythms of the Sirens, it's another fantastic soundtrack. For what it's worth, though, Trixie's song \"Tricks up my Sleeve\" is better than Dash's \"Awesome as I Want to Be\". Sorry Dash, in a fair contest you would have lost anyway. ;)",
         "Second opus of the well-known Hasbro pony franchise, Rainbow Rocks follow the road of bricks from its predecessor, introducing in a good musical way the destiny of previous Celestia's student, Sunset Shimmer, in a humanized \"pony-world\", during her rehabilitation of evil intentions. OK, if you are a parent which \"need\" to watch this with your kids, don't worry, it will be fine; DHX writers, dialog writers and songwriter don't want to fry your brains with beans with butter and a fine chianti. It's really watchable and entertaining for all audiences. The rock-pop songs are fun, cool and catchy, and the classical villain's story is well driven. And few surprises and story development drives you like a classical 50's Cadillac to the end without traumatic post-stress. The animation is amazing, considering the flash animation with humans, more difficult than ponies ones; few sequences in opening credits deserve a Fantasia reward for their quality. There's a true Pony sequence in Ponyville, like an easter egg. I don't spoil much about the villains, the Sirens, Hasbro already showed this. They found their power by increasing the teenagers hate by a biased musical competition, in a catchy \"Hair\"-esque spellbound song. And don't miss the end credits too, the song is really a rewarding song, with nice cinematographic effects, like a Rolling Stone's concert movie. It's highly recommended for me. 8/10, without fear.",
         "This movie is horrible! It's not as bad a the first movie but it's so close. The heroes are obnoxious to watch,the villains are horrible, the plot is too predictable, the songs are just pop garbage, there are so many plot holes and the worst problem is the pacing of this movie! I admit that these are all issues I had in the first movie but the only reason this movie improved is because of Sunset Shimmer. She was an enjoyable character to watch because I wanted to see her succeed and get better. Frankly she would make a better character than Twilight Sparkle any day. Sunset Shimmer is the only reason to I give this movie 1 of 10. Aside from that though there is no reason what so ever to go see this movie. It will waste your time and make the audience leave in disappointment. (No joke. The audience of bronies I had despised this movie) This is just like with the first movie in that it's only purpose is left over table scraps from the show. The show is amazing and creative and in order to keep the fans patient for the next season they send us this mess! If that's true than I would feel insulted about this series! Don't watch it because you're time is more valuable than anything this movie can offer you.",
         "I want to rewrite the review I originally made for this movie. I am doing this because I initially gave this movie a 10 out of 10. I was a pretty young and dumb kid back when I made that review and I want to give a more objective review of this movie. And the first thing I want to say is that it is correct that this movie doesn't really do anything new at all. It's pretty straight forward with the story it is telling and doesn't really do anything different compared to other films in the genre. However, the movie fixes pretty much every single aspect that the first movie struggled with and turns it into not only an objectively better film but also an incredibly fun film. The movie did a great job at giving previous characters more of a personality and likability (especially the villains). It also put way more care into the storytelling and script writing than the last film did, and it makes for some good jokes, more realistic dialogue between characters and a very impressive soundtrack (in my opinion). Overall I would recommend Rainbow Rocks, it's not only a good film for kids, but also for adults thanks to the good writing, a benefit that comes from the show this movie is based on.",
         "(please check out my other reviews please)Heavy Spoilers)) So this is the sequel to MLP Equestria Girls film.. but does it stand up to the praise it has lets find out also was to nice on the first movie so i will review this one better so MLP Rainbow Rocks lets review!!Story & Setting- So we start of this movie with the main villains The Dazzlings in a café causing chaos and feeding of the negative emotions as they see a rainbow light destroy Sunset Shimmer in her demon form and claim this to be Equestrian Magic.. we begin the story as the mane 5 are preparing for the for the Musical Showcase and Sunset Shimmer is now a reformed person as this is going on Sunset has to heal her past mistakes until strange new students arrive (The Dazzlings) and the showcase becomes a Battle of the Bands... and so it beings... also 6 moons have past since the last film. Characters- So the main character is Sunset Shimmer as i said before she is on the path to healing her past mistakes. In the second film, Sunset Shimmer appears to have completely changed from her old self and started believing in friendship, becoming friends with her former enemies, even Twilight Sparkle, and friendly toward others. She also appears deeply repentant for her actions made at the end of the first film, referring to her transformed into \"raging she-demon.\" However, she suffers from a lack of confidence, keeping silent in situations she feels it isn't her place to speak up and falling prey to The Dazzlings taunting. During the final battle, she finally overcomes her insecurities and joins the Rainbooms in defeating the Dazzlings, gaining a half pony form in the process. At the end of Rainbow Rocks, Sunset starts writing friendship reports to Princess Twilight using the book she once used to communicate with Princess Celestia. To me anyway she is a very relatable character and although this she has a lingering side story that she sat through out the sidelines of the story until at the very end play an active role. The Mane 6- As Twilight returned to the human world to help her friends defeat the Dazzlings which is later found out that they are power hungry sirens. The Mane 5 greet Twilight and admire her efforts helping them as they expect so much form her meanwhile its the opposite for Sunset. Also has lots arguments bout priorities in the band like clothing,music etc which causes a brief rift between them. Animation & Sound- So the animation is light-years better than the first movie as colours are brighter and stand out more with in contrast with background this is seen when Sunset and Twilight have a conversation during the night were they have a reconciliation. this break form the action slows down the tempo and is very relaxing scene with a cameo of Maud Pie of course. The Soundtrack is amazing hands down brilliant, Daniel Ingrams's work is amazing, songs like Rainbow Rocks, Better Than Ever, Under Our Spell, Shine Like Rainbows just to name a few. in other words these songs are amazing and didn't feel forced like the first movie excluding the Cafetria Song of course. The Villains- The villains are known as the Dazzlings a singing group of sirens with there goal of making humanity there slave. Adagio Dazzle is shown to be scheming, manipulative, and only concerned with being adored by others also she is the leader. Sonata Dusk is shown to be somewhat air-headed and carefree, similar to Pinkie Pie. Aria Blaze is portrayed as being more level-headed than her companion Sonata Dusk and often speaks in a rather bored disposition and she is the other one. Conclusion/Final Thoughts- i love this film its better paced and generally better also Brad (Flash Sentry) is this movie and he has less of a part int this film. all in all the movie is awesome and holds ground because of Sunset Shimmer, the Songs etc.. so better and more awesome. i cant wait for the 3rd film and the future if this series. i give this a rating of 7.9/10.. lets hope that the 3rd film wont disappoint",
         "The first Equestria Girls was basically writing on the gimmick of, \"Ha ha, they're all humans now! Isn't it wacky! This is what you wanted Bronies, right! Yeah, we totally did this for you, and not as another toy variation! Or six.\" It wasn't awful, but it wasn't very good either. What it had in character designs and certain songs, it lost in an incredibly boring villain and her incredibly stupid scheme. And sure the new one is still a blatant toy commercial, but Rainbow Rocks is a VAST improvement in nearly every way. For starters, there is a stark upgrade to the animation, particularly in their graphics and effects. Seriously, the battle montage was AMAZING! Not to mention the cameo ante has been jacked WAY up, and pays off EXTREMELY well. I also have to note that I really loved all the shorts Hasbro released, leading up to the movie. They were really cute, and more importantly didn't waste any of the movie's time. And while they seem to have replaced a generic popularity contest plot line, with a generic Battle of the Bands plot line, two things make this story much more effective and entertaining: 1 is the villains. The Dazzlings are pretty much the PERFECT filler villains. Namely that they're not over emphasized. Because they aren't so much characters, as they are conflict catalysts. They don't try to contrive a personal vendetta against Twilight or Celestia; All you need is an origin that makes sense, a skill that's believably threatening, and some mildly quip lines every time we cut back to them to remind us that they exist. They're just necessary and entertaining enough, and nothing more. And that kind of makes them brilliant. It's perfect that the villains in a supernatural battle of the bands story would be SIRENS. And fittingly, they have all the best songs. I also think it helps that they aren't the only source of conflict. As we saw from the beginning, that friction was ALREADY developing between the Mane 6. We brings us to reason.. 2. More focus on our girls. The first movie was very much Twilight's story, or at least Twilight's awkward and wacky adjustments in the human world story. But thankfully this one gives EVERYONE a turn in the spotlight and especially a certain one. Which brings us to this movie's greatest accomplishment: Making Sunset Shimmer likable; A feat so insurmountable, it could only be done at the cost of continuity, logic, and likability of the new mane 6. And you know what? IT WAS WORTH IT. Sunset really was NOT just one of the worst people, but also one of the worst villains out of ANYTHING. She was just so generic and boring in motivation, and execution. Ending with the most abrupt, unconvincing character turnarounds ever. But somehow, Rainbow Rocks takes that unconvincing character shift, and OWNS it, and makes it work. Mostly because she's currently juxtaposed against the rest of the main 6, which are being TERRIBLE. It's not always fun to see our girls being this transparently cruel. And yes, all of the \"no offence,\" lines do feel very forced. I was more or less okay with it, because it made sense that they still wouldn't completely trust her. Everyone was still in character and in a way, it humanized them. It showed them that they aren't completely perfect. Again, by all logic, Sunset Shimmer would have gone full demon, and killed them all off at several points. But ultimately, I am glad that she didn't relapse; She stuck to her convictions, she seemed honestly remorseful, and I think it all paid off well. The biggest downside aside from just having to watch the main six be terrible, and the authority figures are utterly useless, was TWILIGHT being useless! But I think that was the point. The Rainboom songs were okay, but yes, they should NOT have beaten The Dazzlings. And it has a couple of \"happens because the plot wills it\" moments. And then of course, the ongoing party-killer that is Flash Sentry. Although he was, if possible, even LESS prevalent in this movie, which is at least, something. I know a lot of people don't like the excessive flash hate, a character with SO little impact on the film as a whole, that any lasting thought about him is hardly worth it. And the fact is people's response to him is just a matter of, it either bothers you that Twilight has a meaningless love interest, or it doesn't. But I just can't hide the fact that I can't think of a single relevant, or positive element of his existence brings to this movie. And that bothers me! I REALLY dislike obligatory useless love interest characters on principle, regardless of what gender they are. But that's all still pretty minor, and overall, I REALLY did enjoy this! And I really am looking forward to a third one because, BEST cliff hanger EVER!",
         "Rainbow Rocks is better than it has any right to be. Yes, it is a film for little girls and isn't Shakespeare, but it sets it self apart from other girls films by trying harder. The film contains strong lines and characterization. A good choice from the writers was to have the focus on the reformed villain from the last film Sunset Shimmer helping the others and dealing with her own past and self-doubt. You care a little more about her and the main cast than you think you would. Nice animation for a made-for-video budget. I was especially taken away the by the opening and end credits. Seriously, they're really eye-catching. The songs are stronger than the last film but still nothing to write home to mom about. They're decent but not memorable.",
         "the movie takes place when sunset got defeated the mane 6 want sunset to teach the learning of friendship the plot is good the characters are good the animation is good everything is good expect for adgaio dazzle her design is awful she looks like a pinkie pie oc so thats it about this movie it's a good movie i'm saying it's bad i'm saying it's a good movie"
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "DHX Media",
         "Hasbro Studios"
      ],
      "summaries": [
         "Music rules and rainbows rock as Twilight Sparkle and pals compete for the top spot in the Canterlot High \"Mane Event\" talent show. The girls must rock their way to the top, and outshine rival Adagio Dazzle and her band The Dazzlings, to restore harmony back to Canterlot High.",
         "Three mysterious girls wearing gem necklaces show up to Canterlot High School intent on controlling everyone in that world. The girls in the band, The Rainbooms, need Twilight Sparkle to return from Equestria in order to overcome this new threat.",
         "Three mysterious girls show up at canterlot high and cause trouble. With the magic of friendship, they want to defeat the mysterious girls."
      ],
      "budget": 0
   },
   "movielensId": 148108,
   "movielens": {
      "languages": [
         "Polski",
         "Nederlands",
         "English"
      ],
      "releaseDate": "2014-09-27",
      "dvdReleaseDate": null,
      "directors": [
         "Ishi Rudell",
         "Jayson Thiessen"
      ],
      "runtime": 75,
      "movieId": 148108,
      "title": "My Little Pony: Equestria Girls - Rainbow Rocks",
      "mpaa": "G",
      "actors": [
         "Tara Strong",
         "Tabitha St. Germain",
         "Andrea Libman",
         "Ashleigh Ball",
         "Nicole Oliver",
         "Kazumi Evans",
         "Cathy Weseluck",
         "Rebecca Shoichet",
         "Maryke Hendrikse",
         "Diana Kaarina",
         "Vincent Tong",
         "Kathleen Barr",
         "Lee Tockar",
         "Richard Ian Cox",
         "Michelle Creber",
         "Shannon Chan-Kent"
      ],
      "imdbMovieId": "3529198",
      "originalTitle": "My Little Pony: Equestria Girls - Rainbow Rocks",
      "genres": [
         "Family",
         "Animation",
         "Music"
      ],
      "youtubeTrailerIds": ["M-N2Fn1tP3Q"],
      "plotSummary": "Music rules and rainbows rock as Twilight Sparkle and pals compete for the top spot in the Canterlot High \"Mane Event\" talent show. The girls must rock their way to the top, and outshine rival Adagio Dazzle and her band The Dazzlings, to restore harmony back to Canterlot High.",
      "tmdbMovieId": 292177,
      "avgRating": 2.43333,
      "releaseYear": "2014",
      "numRatings": 15,
      "posterPath": "/xcSrR4HXHsFXqjAg8nY7y6JMAG4.jpg"
   }
}