{
   "tmdb": {
      "original_language": "tr",
      "keywords": [
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "turkey",
            "id": 5733
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "thriller",
            "id": 9950
         },
         {
            "name": "accident",
            "id": 207819
         },
         {
            "name": "turkish movie",
            "id": 217451
         }
      ],
      "imdb_id": "tt3142872",
      "video": false,
      "title": "A Small September Affair",
      "recommendations": [
         271954,
         236317,
         341288,
         27953,
         64335,
         34529,
         141901,
         56919,
         52147,
         375784,
         39424,
         50737
      ],
      "backdrop_path": "/yAExK03plRPYISlFShEF2eLJm4n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Tekin",
               "gender": 2,
               "credit_id": "53a60a4a0e0a2614320020fe",
               "name": "Engin Akyurek",
               "profile_path": "/ouGUVzDkRtFXn1mjj74gCE5q4xl.jpg",
               "id": 1004806,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Eylül",
               "gender": 1,
               "credit_id": "53a60a530e0a2614490020a0",
               "name": "Farah Zeynep Abdullah",
               "profile_path": "/vH7W5ltmvpoUfDtwZ3FpupIxUuM.jpg",
               "id": 1153569,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Berrak",
               "gender": 1,
               "credit_id": "53a60a5b0e0a2614390021bd",
               "name": "Ceren Moray Brun",
               "profile_path": "/Aic7xcw5K0NASE5bwWWItQOrgux.jpg",
               "id": 1254603,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Eylül's Mother",
               "gender": 1,
               "credit_id": "53a60a950e0a2614420021d0",
               "name": "Ebru Aykaç",
               "profile_path": null,
               "id": 1141843,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Eylül's Father",
               "gender": 2,
               "credit_id": "53a60aa00e0a2614390021c8",
               "name": "Ege Aydan",
               "profile_path": "/qRLYZnUPRvOWPzQYTIxVBKMseM2.jpg",
               "id": 145401,
               "order": 6
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.619294,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 256546,
      "vote_count": 25,
      "budget": 0,
      "overview": "A beautiful girl who has everything. Charming, playful, in her own words: 'too joyful to fall in love.' A sudden car crash, and her heart stops for a few minutes. When she wakes up, everyone assures 'every-thing's alright.' But she knows it isn't. Because she cant remember her final month; a September of her life is missing. Leading a trail of hastily covered clues she finds herself in a remote Aegean island. A weird looking, grubby recluse, comes up-to him and proclaims: 'Don't you remember me? I'm the man you fell in love with.' Everything sensible about her screams 'get out of there' but she follows her memories right onto the tragic end of a miraculous affair.",
      "similar": [
         421044,
         435126,
         179826,
         410895,
         276922,
         4024,
         37178,
         37181,
         3309,
         168055,
         227961,
         20677,
         171248,
         52345,
         435603,
         286071,
         18377,
         44125,
         175193,
         67099
      ],
      "original_title": "Bi Küçük Eylül Meselesi",
      "runtime": 102,
      "poster_path": "/tA2BEbVMcbgGIqMaGOC421XBAsw.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [],
      "release_date": "2014-02-14",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kerem Deren"],
      "runtime": 106,
      "synopsis": "Everything is going well In the life of a city girl called Eylul, but after an unfortunate accident she forgets the last month of her life she spent on an Island 'Bozcaada'. Incidents take place where flashbacks from the past month haunt her until she decides to visit the place to remember. Everyone around her, all her friends and family tell her not to and, despite their discouragement Eylul suspecting something is wrong. Simply by listening to her instincts Eylul goes back to Island 'Bozcaada' never knowing what to expect until a chance encounter with a strange dowdy man Tekin who call out to her 'Eylul dont you remember me? you fell in love with me on this Island\". The story takes place where the mysterious stranger 'Tekin' tries to make Eylul remember their 'summer love' and relive the passion filled moments they spent together. Does Eylul remember? will she give her forgotten love another chance ? Is there more to beauty than physical appearance are the themes that run the plot of the film. Produced by 'Ay Yapim', a romantic,mysteroius and dramatic love story starring Engin Akyurek and Farah Zeynep Abdullah, director and screenwritten by Kerem Deren. -------------------------------------------- ---------------------- ---------------------------------------------- Eylül hayatta istedigi her seye sahiptir. Güzel, neseli, eglenceli. Ta ki bir gün basina bir sey gelene ve yasaminin son bir ayini unutana dek... Eylül´ün ailesi, arkadaslari her seyin yolunda oldugunu söyleyip dururken, Eylül bir seylerin ters gittigini anlamaya baslar. Ve hatirlamadigi bir olayin pesinden Bozcaada´ya gider. Orada, daha önce hiç görmedigi derbeder, garip bir adam, ona seslenir: \"Eylül. Beni hatirlamiyor musun? Sen burada, bu adada bana asik oldun.\" Eylül hayatta istedigi her seye sahiptir. Güzel, neseli, eglenceli. Ta ki bir gün basina bir sey gelene ve yasaminin son bir ayini unutana dek...",
      "writers": [
         "Kerem Deren",
         "Kerem Deren"
      ],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt3142872/",
      "coverLink": null,
      "actors": [
         "Engin Akyürek",
         "Farah Zeynep Abdullah",
         "Ceren Moray"
      ],
      "reviews": [
         "Basically a variation on the Beauty and the Beast story, Kerem Deren's film focuses on the experiences of young İstanbullu Eylül (Farah Zeynep Abdullah), who has a near-fatal accident resulting in the loss of her short-term memory. To help recover it, her friend Berrak (Ceren Moray) takes her back to the island of Bozcaada, where she went for a location-trip, and encountered Tekin (or Tek) (Engin Akürek), an artist with acute agoraphobia. He has forsaken the sophisticated world of İstanbul for an edenic existence in a seaside home, with no one but match-making child Gülşen (Serra Keskin) for company. Eylül finds his existence rather rustic but strangely attractive, a welcome alternative to the hurlyburly of contemporary İstanbul The film juxtaposes Eylül's currently confused state of mind with an analysis of what happened to her in the past; she had a love-affair with Tekin, which became passionate on both sides. Despite the ordinariness of his life, she fell for him; but left him in the belief that she had to return to her metropolitan İstanbul life. Her accident - and subsequent memory-loss - was caused by reading something in the paper about Tekin's fate. The film creates an idyllic world on Bozcaada full of sunshine, quaint buildings and unpopulated cafés; the place where any harassed city-dweller might like to escape to. It is Eylül's misfortune that she does not understand the advantages of this life, or Tekin's true feelings for her. There are a few clichéd moments, especially involving the two lovers on the beach; and Abdullah is at times extremely unconvincing in her role, especially when it comes to communicating her disordered state of mind. Nonetheless BI KÜÇÜK EYLÜL MESELESİ is entertaining to watch.",
         "There's a lot going on in A Small September Affair. But first, the name in English... Well, it is not a great translation, because it gives something away which it should not. The word in Turkish \"mesele\" is best translated as \"issue\" or \"problem\" as in \"there's the issue of what happened in September.\" Ordinarily, this is a good translation, but when, at the beginning, we are not supposed to have any idea about an affair, the title gives away that there is an affair, it is not such a great choice. In Turkish, the title does not imply an affair and one starts watching the film with the intended ignorance about any affair. The name of the leading female character is Eylul, which means September, so the title plays on the word successfully in Turkish. The acting is done well, the music is perhaps overdone a bit in places, and the usual Turkish melodramatic tendencies are there, but all realistic enough (for after all, we are dealing with Turks here, so lack of sentimentality would be like asking Almodovar not to have anything campy in his films!) The plot is mysterious and successfully unraveled at a good pace. I was aware what the big reveal would be in the end half way into the film, but the film was engaging enough to keep me interested and wait to see how things would happen. Perhaps my biggest complaint is the overwhelmingly stupid narration about ugly people and beautiful people. Ugly people are just dying for a look from beautiful people, and when they get that glance, they just fall in love right away, because ugly people have nothing else they value in their lives and so on. To add to this, the \"ugly\" male lead is not at all ugly, and the beautiful woman is a fake blond who is OK looking, but nothing special (I am aware she would still be considered special In Turkey...) It is NOT that difficult to find someone who is not traditionally \"handsome\" by many people's standards, yet the film has failed to do this. Together, the couple looks pretty good, if you ask me. He was horribly dressed in fisherman- looking beach wear most of the time, in an attempt, I am assuming, at making him look \"ugly.\" In the end, big points for a twisty plot that is well-paced. The whole sentimental ugly vs. beautiful people narration should have dealt with the real issues at hand: that the male lead was shy, antisocial, withdrawn, while the female character was fake, shallow, and unable to engage with other people in an emotionally fulfilling way. To attribute these fundamental characteristics to their ugliness or beauty makes one wonder how the writer can have such a shallow point of view.",
         "I am not a big fan of romance movies but to me it was all I needed. Plot is maybe slow but not boring. It touched me, and any movie that can do that is special. If you are looking for something that will live a mark on your soul just go ahead and watch it. It's not epic but it seems to be a little piece of life. Don't let this one miss you. Everything imperfect has a chance to become perfect. This is the first time I see these actors and they have done their job very well. Music is following the plot. The place where the movie had been taken is beautiful. Now I have found one more destination to visit. I will be coming back to this movie just because of the feeling.",
         "On one movie site part of the plot summary reads.. \"A weird looking, grubby recluse, comes up-to him and proclaims: \"Don't you remember me? I'm the man you fell in love with.\" This description is as convoluted and confusing as watching this movie. You can call Engin Aky a bunch of things, but in this movie, not many would be agreeing with 'weird and/ or grubby.. and Farah Zeynep Abdullah is most definitely a 'her.' The film has some charm.. but the storyline is way too muddled, it's near impossible to kept track what's going on at any one moment from the next. And really the story is so simple, when you come right down to it, it could have presented in an hour TV show..and with commercials the 45 minutes would've been more than enough.",
         "It is controversial how to achieve balance between talent and life. Being devoted and excel in one field happens mostly on the account of life and family. But it's all about perspective, of which lens we see the world. For the talent, the world becomes so beautiful in their mind despite all life challenges. The only thing that makes their life complete is acceptance and appreciation by people, rather than being judged by shallow-minded personalities who cannot see other than themselves. It is undeniable that I was touched by the story. For those who watched \"Bi Küçük Eylül Meselesi'\", I recommend to spare some time and watch Enid (2009), a very successful story writer and teller to children. It's a pity that family and friends in both movies had to suffer rather than live blessed with talent."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Ay Yapim",
         "Beng'S Production"
      ],
      "summaries": ["A beautiful girl who has everything. Charming, playful, in her own words: 'too joyful to fall in love.' A sudden car crash, and her heart stops for a few minutes. When she wakes up, everyone assures 'every-thing's alright.' But she knows it isn't. Because she cant remember her final month; a September of her life is missing. Leading a trail of hastily covered clues she finds herself in a remote Aegean island. A weird looking, grubby recluse, comes up-to him and proclaims: 'Don't you remember me? I'm the man you fell in love with.' Everything sensible about her screams 'get out of there' but she follows her memories right onto the tragic end of a miraculous affair."],
      "budget": 0
   },
   "movielensId": 148376,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2014-02-14",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 102,
      "movieId": 148376,
      "title": "A Small September Affair",
      "mpaa": null,
      "actors": [
         "Engin Akyurek",
         "Farah Zeynep Abdullah",
         "Ceren Moray",
         "Ebru Aykaç",
         "Ege Aydan"
      ],
      "imdbMovieId": "3142872",
      "originalTitle": "Bi Küçük Eylül Meselesi",
      "genres": [
         "Mystery",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A beautiful girl who has everything. Charming, playful, in her own words: 'too joyful to fall in love.' A sudden car crash, and her heart stops for a few minutes. When she wakes up, everyone assures 'every-thing's alright.' But she knows it isn't. Because she cant remember her final month; a September of her life is missing. Leading a trail of hastily covered clues she finds herself in a remote Aegean island. A weird looking, grubby recluse, comes up-to him and proclaims: 'Don't you remember me? I'm the man you fell in love with.' Everything sensible about her screams 'get out of there' but she follows her memories right onto the tragic end of a miraculous affair.",
      "tmdbMovieId": 256546,
      "avgRating": 4,
      "releaseYear": "2014",
      "numRatings": 7,
      "posterPath": "/tA2BEbVMcbgGIqMaGOC421XBAsw.jpg"
   }
}