{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0187579",
      "video": false,
      "title": "Night Wind",
      "recommendations": [
         46150,
         66447,
         41936,
         64527,
         42156
      ],
      "backdrop_path": "/5oCEwg1rRSfXFUgp6UMp4UkPpaP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hélène",
               "gender": 1,
               "credit_id": "52fe49d2c3a368484e141cf5",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Serge",
               "gender": 2,
               "credit_id": "52fe49d2c3a368484e141cf9",
               "name": "Daniel Duval",
               "profile_path": "/vGJSb10cnsF4e218IW43YkuiyYN.jpg",
               "id": 6018,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe49d2c3a368484e141cfd",
               "name": "Xavier Beauvois",
               "profile_path": "/dce2PuZxeDr9rkoVqZxfNeskxpi.jpg",
               "id": 72320,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "le mari d'Hélène",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d01",
               "name": "Jacques Lassalle",
               "profile_path": null,
               "id": 587178,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jean le sculpteur",
               "gender": 2,
               "credit_id": "52fe49d2c3a368484e141d05",
               "name": "Daniel Pommereulle",
               "profile_path": "/gA9bvpiWOb8qLOKmTc0Rfp8HSwo.jpg",
               "id": 39673,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "le médecin",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d09",
               "name": "Marc Faure",
               "profile_path": "/spPJGtUNZBZFSUqqjaCVINWoIg.jpg",
               "id": 554596,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "la jeune femme dans l'escalier",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d0d",
               "name": "Marie Vialle",
               "profile_path": null,
               "id": 587179,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "la prostituée",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d11",
               "name": "Anita Blond",
               "profile_path": "/74pEqhwGmP6g4H7dkQ9T2Bfekh6.jpg",
               "id": 88578,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "le dragueur",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d15",
               "name": "Stuart Seide",
               "profile_path": null,
               "id": 587180,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "le réceptionniste",
               "gender": 0,
               "credit_id": "52fe49d2c3a368484e141d19",
               "name": "Pierre Forest",
               "profile_path": "/xkvvFCnNE4MQ97Hennfa7cGdhz0.jpg",
               "id": 587181,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49d2c3a368484e141cf1",
               "name": "Philippe Garrel",
               "profile_path": "/sPNYmUHACjxWS8sRwkVDrPglKrz.jpg",
               "id": 56207,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59d39550c3a3685287012768",
               "name": "Caroline Champetier",
               "profile_path": "/tkHJncN5hO0RXkWGKDSoek67fng.jpg",
               "id": 50539,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59d3957b9251414078010dd2",
               "name": "Françoise Collin",
               "profile_path": null,
               "id": 28097,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59d3959e925141405f0109bf",
               "name": "John Cale",
               "profile_path": "/jtzO8cnQhseN7Ww0f60D1X4hv0j.jpg",
               "id": 7491,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.682038,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 79435,
      "vote_count": 6,
      "budget": 0,
      "overview": "A housewife's (Catherine Deneuve) affair with a younger man (Xavier Beauvois) goes nowhere.",
      "similar": [],
      "original_title": "Le Vent de la nuit",
      "runtime": 95,
      "poster_path": "/2Oo9okyEaCW9vwZEEoNAv1KjpQa.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "1999-03-03",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philippe Garrel"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Xavier Beauvois",
         "Marc Cholodenko"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0187579/",
      "coverLink": null,
      "actors": [
         "Catherine Deneuve",
         "Daniel Duval",
         "Xavier Beauvois"
      ],
      "reviews": [
         "This is one of those films that sorts the pseuds from the cynics. I am firmly on the former side. After initial groans at ANOTHER French movie about logorrheic sexual relationships (and yet another May-December coupling, although, happily, the elder in this case is the woman), one finds oneself wholly compelled without ever really knowing why. Because the content is frequently less than exciting - two men talking (or not) on a lengthy road trip; endless snakes of pristine Euro-motorway; interminable shots of a woman silently climbing floors of stairs, entering an apartment, getting it methodically ready for afternoon coitus (feminised Melville?). Even when the content is beautiful - an overhead vista of a sun-parched Neapolitan town; an overgrown cemetery - the manner of filming remains detached. The camera often stops on a road or a wall, long after the human drama has passed by, or waits for a character to come into view, rather th an following her. There is very little of the editing that would draw us into the characters and their situations. Camera movements that break with the generally static style become heavy with their uniqueness - see the remarkable scene where Catherine Deneuve stares out the window; the camera follows her gaze, making it solid, pregnant, until it stops being a gaze, and we return to Deneuve, who is no longer looking out. These two uglinesses, or rather excessive plainnesses, manage to create something very beautiful. I was reminded very much of the films of Manoel d'Oliveira - not just because Deneuve's ex-lover and daughter starred in his last two films. There is the same deceptively air-brushed, non-commital style that steadily accretes to become emotionally powerful. The image, in its unnatural cleanness, seems to be weighed down with nothing, to exist entirely in the present tense - and yet this is a film obsessed with history, the past, creating echoes and gaps in the present tense, through which seeps the emotion and subjectivity the distant style and performances initially forbid, like the traces of light that linger after a scene dissolves into darkness. The film is a mystery story with the viewer as detective - we are given clues about each character, fragments of motivation and backstory; we have to sift the possible disparity between actions, what people think, what people say, and what people say about them. The film's mathematical structuring and patterning (especially doubling) does not prevent the ending being profoundly moving. In many ways, the film is one of the stranger buddy-buddy road movies; we are never allowed get very close to characters who only offer of themselves piecemeal, yet the relationship between Xavier Beuvois and Daniel Duval is wholly engaging, so much so that you hope there are more roads for them to drive down so the film doesn't have to end. Deneuve is the nominal star, but this is a very different Deneuve to the majestic grande-dame projected in the last two decades - frumpy, plump, lined, prepared to be humiliated to keep her young lover, knowing it will only drive him away. Whenever she appears, you just want the road movie to start, and she is conscious of this marginalising - when she brings her lover to her husband, she is even ignored as the hoped-for fall-out becomes a discussion about an obscure right-wing anarchist. A suicidal cry for help (a jolting, bloody, physical scene is such a refined film) serves to marginalise her from the film further, failing to break its masculine grip.",
         "The Editor on this must have thought it was his birthday. All he had to do was cut off the slate at the beginning of each shot and then cut off the last few frames of the shot and join them together. Time and time again we open on a static frame, ten, twelve, fifteen seconds go by then someone walks in and/or there is some kind of movement; after a few minutes one or more persons walk out of frame but the camera lingers again for ten, twelve, fifteen seconds. Time was I used to think that Jean-Luc Godard was the last word in anti-film making but now he needs to look to his laurels as people like Christophe Honore', Gaspar Noe, Matthieu Kassevitch, Abdel Kechiche and Phillipe Garrel. Catherine Deneuve is nominally top-billed but clearly this was little more than a ploy to persuade potential viewers they were going to see a REAL film rather than two guys talking meaninglessly on a couple of road trips. You have been warned.",
         "By the time Philippe Garrel made \"Night Wind\" he was no longer the young Turk who made \"The Virgin's Bed\", (or unmade it as some wags might say). Here he shot in colour and in widescreen and had a mature but still gorgeous Catherine Deneuve as his leading lady. Otherwise, it was mostly business as usual. What begins as a typically Garellian study of adultery, concentrating on the mundane rather than the erotic, (sex is conspicuously absent in this movie), soon shifts gear, literally as well as figuratively, and becomes a road-movie and Garrel's brilliant use of colour gives his film a much richer texture than we have come to expect. Of course, the film must also be viewed as having large elements of autobiography in the mix. The central character Paul, (Xavier Beauvois), is, for most of the time, a passenger in the Porsche driven by Serge, (Daniel Duval), through Italy, France and Germany. Serge is an old revolutionary from the Paris of '68, and from the conversations they have about the good old bad old days you can easily discern the young Garrel. The older Serge may be the Garrel of the present as the younger Paul is the Garrel of the past and Garrel the filmmaker does not make Paul an easy character to like. As the older woman both men come to share Denueve is, of course, extraordinary and both Beauvois and Duval are also very fine. If the film appears on the surface more conventional than we have come to expect from Garrel, don't be fooled; those touristy views of Italy are only part of the picture. As before, what interests Garrel is the existential angst bubbling beneath the surface. Garrel certainly likes to suffer and have his characters suffer so despite the luscious tone this is not always an easy watch. At times it veers close to self-parody but that's a risk I think Garrel was aware of and was prepared to take in a film that overflows with talk, all of it intelligent and some of it profound. This is the work of a truly major artist.",
         "There are films that personify the principle that movies are so called because they move, and it follows that what moves is what is shown. The image moves. Films are about showing. They then get words added and once words come along the moving about bits seem to demand that sense is made of them. Night Wind is essentially a movie in the full sense. We watch people and also listen to them. But since they never say anything interesting we never really get beyond knowing their names. A red Porsche is just as much a star as the actors. A character walks out of shot. We linger. No rush. The car speeds into the night. It goes. We stay. Life is only important at a whim. All movements are either as important or not important at all. Audiences who like conventional films might not like this. Those who understand the maxim, showing, not telling will love it. I marvelled at it.",
         "Philippe Garrel makes difficult films that don't offer much to the spectator in the way of narrative or explanation of the character's actions. They stay in the mind (if at all) by virtue of lovely moments (I think of the street riot in Les Amants reguliers, with that superb camera-work). Le vent de la nuit has very little going for it, apart from the loveliness of Catherine Deneuve. Daniel Duval is squarely in the second rank of French actors, sort of a poor man's Gérard Lanvin, but at least he is an actor, unlike Xavier Beauvois who mumbles and whines his way through the picture. The road scenes seem to go on forever, with Paul asking Serge all sorts of dumb questions about the older man's participation in May 1968 events. At one point, he asks if there is a difference between driving and piloting a sports car. I would have pulled over and ordered him out right away. Shame Serge didn't."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Classic",
         "Les Films Alain Sarde",
         "Vega Film"
      ],
      "summaries": ["Hélène is unhappy with her marriage but finds some comfort and relief with Paul, a young art student. They reflect on their differences of age, backgrounds and also what truly connects them. The third character in the story is Serge, a famous artist admired by Paul, with a great historical past but also a very conflicted man who has been through many life obstacles, stories he shares with his new friend on a road trip. There, Paul will find new perspectives to his current situation with Hélène, and learn more about what life and love truly means."],
      "budget": 0
   },
   "movielensId": 148386,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1999-03-03",
      "dvdReleaseDate": null,
      "directors": ["Philippe Garrel"],
      "runtime": 95,
      "movieId": 148386,
      "title": "Night Wind",
      "mpaa": null,
      "actors": [
         "Catherine Deneuve",
         "Daniel Duval",
         "Xavier Beauvois",
         "Jacques Lassalle",
         "Daniel Pommereulle",
         "Marc Faure",
         "Marie Vialle",
         "Anita Blond",
         "Stuart Seide",
         "Pierre Forest"
      ],
      "imdbMovieId": "0187579",
      "originalTitle": "Le Vent de la nuit",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A housewife's (Catherine Deneuve) affair with a younger man (Xavier Beauvois) goes nowhere.",
      "tmdbMovieId": 79435,
      "avgRating": 3.25,
      "releaseYear": "1999",
      "numRatings": 2,
      "posterPath": "/2Oo9okyEaCW9vwZEEoNAv1KjpQa.jpg"
   }
}