{
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 0,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0112326/",
      "coverLink": null,
      "actors": [
         "Dominique Blanc",
         "Didier Sandre",
         "Valentine Varela"
      ],
      "reviews": [
         "I recommand \"L'allée du roi\" to all those who wish to discover for the first time the royal court life in XVIIth century France, for those who enjoy intrigues, and for those who simply wish to contemplate sensual and art-like pictures. Good suspense, genuine, NOT overloaded emotions, breezzy and warm atmosphere, delicacy in speech, in light, in figures - a delight ;-)",
         "A lavish production depicting the rags to riches story of Francoise d'Aubigne, born of noble but poor parents, raised by relatives, and who married the poet, wit and cripple, Scarron. Left a widow, she is introduced through aristocratic friends to Louis XIV's mistress, the Marquise de Montespan, and becomes the governess of their children. For her loyal and discreet service the King made her Marquise de Maintenon. Ultimately she became the monarch's intimate companion (or wife, as shown here) for 32 years and died in 1719 at the school for poor noble girls she founded at Saint-Cyr. The film richly recreates the look and feel of life at the Sun King's court, and features magnificent interiors, as well as parks and gardens, of the time (including Versailles). The dialog is a model of classic French, combining formality, elegance and style. The quality of the language cannot be translated into English; and if it were, it would not sound \"natural\" to an English-speaking audience. Highly recommended; but best enjoyed by French speakers!",
         "L'allée du Roi based on Francoise Chandernagor magistral best seller, is probably one of the best productions ever made by the french television. This is not on my behalf some kind of nationalistic point of view at all. The fact is that nearly 20 years after its first presentation, this movie has kept all its freshness; it is also a very interesting way for those who are not familiar with the reign of Louis XIV and the slow access of the future Marquise of Maintenont, to the highest level of all in the french court by being the second wife of the king and then be part of major decisions of the king in foreign politics during the last years of his reign. I highly recommend this movie and please see it in french using English subtitles if you're not familiar with the language; any dubbed version would totally betray and spoil the efforts of the producers and the director to achieve that masterpiece.Also do read the book which has the same title and which a big event in the french literary circles at the time of its publication."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Ciné Mag Bodard",
         "France 2 (FR2)",
         "La Sept-Arte"
      ],
      "summaries": ["Drama centering around the life at the court of Louis XIV and the role of the Marquise de Maintenon."],
      "budget": 0
   },
   "movielensId": 148390,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": null,
      "directors": ["Nina Companéez"],
      "runtime": 240,
      "movieId": 148390,
      "title": "L'Allée du Roi",
      "mpaa": null,
      "actors": [
         "Agathe de La Boulaye",
         "Claude Aufaure",
         "Dominique Blanc",
         "Didier Sandre"
      ],
      "imdbMovieId": "0112326",
      "originalTitle": "L'Allée du Roi",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 152539,
      "avgRating": 3.5,
      "releaseYear": "1995",
      "numRatings": 1,
      "posterPath": "/4lco8Hp7RZ8RJq8siVe5KO3XKaH.jpg"
   }
}