{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "u.s. marine",
            "id": 188114
         }
      ],
      "imdb_id": "tt2073661",
      "video": false,
      "title": "Stranded",
      "recommendations": [
         323599,
         433018,
         423628,
         459427,
         403665,
         490846,
         395235,
         469922,
         268824,
         454349,
         470616,
         257064,
         412189,
         347956,
         435473,
         447818,
         423246,
         274165,
         437783,
         283563
      ],
      "backdrop_path": "/mjy2MaU7e9I9BNfxYGfYmyXHMBa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "John",
               "gender": 2,
               "credit_id": "553adc4ac3a368203400008a",
               "name": "Scott Eastwood",
               "profile_path": "/w8yZtoTB2XGJWYJxZBLWp1Smqrk.jpg",
               "id": 928572,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sheila",
               "gender": 1,
               "credit_id": "553adc54925141125600879a",
               "name": "Rita Wilson",
               "profile_path": "/jsIeIIzvirqMMCua4fA0ziRsRIs.jpg",
               "id": 12931,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Trick",
               "gender": 2,
               "credit_id": "553adc629251413f5a0049ea",
               "name": "Jeff Fahey",
               "profile_path": "/6l44xDPdJE4dQAEDN9eShnJOSo8.jpg",
               "id": 20495,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jim",
               "gender": 2,
               "credit_id": "553adc71c3a36831dd00abd8",
               "name": "David James Elliott",
               "profile_path": "/lhURUaxfhpPdqKmIKiwsUsfMwd7.jpg",
               "id": 84522,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Donna",
               "gender": 1,
               "credit_id": "57565d6dc3a3680cc7001afb",
               "name": "Kim Matula",
               "profile_path": "/tQDrR3W1RHVdvXomKogjGtFIRNM.jpg",
               "id": 1040469,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "544d0455c3a36872d80025b0",
               "name": "Daniel Petrie, Jr.",
               "profile_path": "/xXNS8tDWvDxJqcSt3DbCf7QexZY.jpg",
               "id": 774,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "553adbff92514135c8000e20",
               "name": "Rachel Long",
               "profile_path": null,
               "id": 1308361,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "553adc0e9251413f5a0049da",
               "name": "Brian Pittman",
               "profile_path": null,
               "id": 1308362,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56d7851e92514111eb006362",
               "name": "Scott Eastwood",
               "profile_path": "/w8yZtoTB2XGJWYJxZBLWp1Smqrk.jpg",
               "id": 928572,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.642104,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 299145,
      "vote_count": 14,
      "budget": 0,
      "overview": "After the brutal murder of his beloved brother, a small-town surfer seeks revenge against the gang of merciless thugs he holds responsible. However, when another tragedy brings him face to face with the consequences of his actions, he must seek forgiveness from the very people he despises most.",
      "similar": [
         15069,
         11423,
         357096,
         979,
         4771,
         75780,
         281,
         395834,
         281957,
         445954,
         25376,
         21484,
         3134,
         12143,
         984,
         18587,
         26390,
         12150,
         8456,
         65754
      ],
      "original_title": "Dawn Patrol",
      "runtime": 86,
      "poster_path": "/om6IzfsiuLWaiK8PXilVd0Bs6gV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Enderby Entertainment",
         "id": 21608,
         "origin_country": ""
      }],
      "release_date": "2015-06-05",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Revenge comes at a price.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Daniel Petrie Jr."],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Rachel Long",
         "Brian Pittman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2073661/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM2MjAyMDc0OV5BMl5BanBnXkFtZTgwMzc5MTQxNTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Scott Eastwood",
         "Rita Wilson",
         "Kim Matula"
      ],
      "reviews": [
         "I was skeptical at the beginning but this movie kept me hooked. The story is simple but engaging and the actors are really good, starting from Scott Eastwood (really like the father !) and Kim Matula, convincing small timer cutie. What was more interesting was the overall evolution of the story and the analysis of the characters...normal people with weaknesses and an average interesting life. Overall is worth watching : do not expect fireworks or much action. Is a simple and fair movie, well written and directed and it's a good proof of most of the actors.",
         "The movie actually had a decent plot to it. It starts with Scott Eastwood as a marine about to be executed and then it tells his story of how he got into this mess through a flashback, as a surfer who gets into trouble. Dawn Patrol had good twist and turns to it and great potential for drama, but the dialog in the film was horrible, and i'm really surprise by how bad the acting was to this dialog. The whole thing reminds me of movies like the Crying Game and the Sixth Sense, were the movie has a surprise twist at the end, and this one was cut together well enough to get an eyebrow raised, but the biggest difference between those movies and Dawn Patrol, is that those movies are worth sitting through. Well cheer up, Scott Eastwood, I don't think your daddy did anything worth seeing until his, thirties anyway. This movie is just too dull and uninteresting to put anytime into it.",
         "The movie was really bad, the acting was horrible and the story, well , it sucked. I wouldn't recommend anyone to see this movie.I'm honestly surprised it has a 6,4 rating, saying that, it's 19 users that have rated it. Nothing felt real between the actors, the lines where at times useless, as in I think the writers needed to fill in something so they just wrote whatever into the script. After the first 10 minutes I knew it was not going to be a good movie. It's a bit of a shame because it could have been a good movie, IF it had been written with better dialogs and a better cast. So, no I would recommend that you choose another movie to see. There are better movies to spend time watching then this one.",
         "The entire story rests on the fact that the younger brother was killed and he revenges his killing... problem is they wrote the younger brother as a complete pieces jerk that I for one was happy to see killed. They made the whole family come across as a bunch of pathetic, obnoxious losers. I got the impression that the writers had absolutely NO IDEA how to connect with an audience. Out of curiosity, I'm going to have to look up the writers to see if they've actually done anything of merit. End result, about 10 minutes into the movie I lost ALL interest in the story. Paid for the movie and didn't even bother to watch rest of it. Last time I did this was years ago.",
         "John (Scott Eastwood) is from a poor surfer family. His parents, Shelia (Rita Wilson) and Trick (Jeff Fahey), run a struggling surfing shop. His brother Ben (Chris Brochu) catches his girlfriend Donna (Kim Matula) with Miguel. Later, John finds Ben shot dead in the head on the beach. At a later time, John is a Marine in a foreign desert held prisoner by an Arab woman. The flashbacks reveal a tale of revenge, deceit, betrayal, guilt, and dread. The story is a grinding muddle. Scott Eastwood may be more photogenic than his father but lacks his inner intensity. He doesn't have the charisma to take over a movie. It could still work as a harden family crime drama but the future story takes away whatever tension is left. Once the reveal is done, the movie struggles for another half hour. Then there is a final twist which only leaves the story feeling silly.",
         "I wanted to see this, because I wondered if Scott Eastwood was half as good as he's dad.Sadly No.OR at least not yet. The movie centers around a white-trash pot smoking surfing family,and some pothead surfers. The two guys the movie is suppose to center around comes off as uninteresting,one dimensional and boring. They act like two immature douche bags who never grew up. (They remind me of the kids from high school, who you just knew would never really grow out of the whole life's a party phase.) You can't really be bothered caring about them,cause there's no everyday life,there's nothing there to identify with. They surf and smoke pot,that's it! That's all they do What was suppose to be the main plot, seem to be that this really great surfer kid,is getting killed because he mess around with an ex girlfriend,who now is dating a gang banger. So he's older brother get into a fight for him with said gang- banger,so he's little brother can hook up with he's ex again. Than he go ahead dumps her a few days later on a party,he's mother even helps him. By this part of the movie I'd all ready stopped caring about any of them. Jeff Fahey is suppose to be some guru, I think.You never see him surf though,only carrying a surf board The problem is there's no forward momentum in the story.You feel its just some random stuff put together.",
         "I love surfer movies, so I was excited about this one, having gone on dawn patrol myself quite a bit. While the waves and surfing scenes were great, and they captured elements of surfing culture well (I should hope so, since the Eastwood's live in Monterey/Carmel, CA), there was a lot of racist vitriol towards Mexicans in this film that just made it unbearable. Ummm, Mexicans surf too and aren't all in cartels. Stop using lame rival premise so that you have an excuse to spew racist names. Beyond that, the sound was terrible, like the editors didn't adjust the back sound properly. It was slow moving, crappy dialogue, and made the all the women seem slutty and without depth. So yeah, I would like the hour of my life back, and thought it was so shitty I had to sign up for IMDb to share with the world that it isn't worth their time. The one redeeming quality? Scott Eastwood is easy on the eyes.",
         "Scott Eastwood plays John who lives in California where the sun always shines and they all just live to catch a wave because surfing is all that matters. Then there is his brother Ben who is so good that everyone wants a photo of him pushing the boundaries of mans understanding by seeing him splash about a bit in the ocean. Enter a femme fatale who Ben is having some sort of emotionally unstable relationship with. But oh dear she has also caught the eye of the local Latino cartels' son and heir and, as in a bad film string Daniel Day Lewis, 'There will be blood'. We also have side issues of anger management, drugs and some trite story from the Iraq war. Now this is not a bad production and there are a couple of performances of note; indeed Scott Eastwood can act – see 'The Longest Ride' but this just lacks all the essential ingredients that make a good filmatic experience. The actual script is the main failing but overly one dimensional, stereo typical characters do not help and despite the well realised plot twist I found myself just not really caring. It is not a surf film either or a thriller of really a revenge tale just a bit of a not all the believable drama. If you are still interested then go for a rental as I can guarantee you will never even consider seeing this twice.",
         "I have long been a fan of Jeff Fahey so initially sat down to watch it just because Mr Fahey was in it., The story and the characters did hook me though and I am very pleased I watched it. Without giving too much of the plot away, the characters are mostly flawed but also mostly likable as they do what they feel they have to in order to keep their families together......and I can mostly sympathise with them all to a certain extent. Particularly loved the ending too. The bio is all wrong though. Yes John is held at gunpoint and he tells his story in a series of flashbacks......but it is not set in a distant desert......it's set in California and the sand they are trudging through is a beach near Malibu in California, not a \"distant desert\" at all.",
         "I just saw this movie at the Austin Film Festival this evening. The script was a finalist in the screenplay contest several years ago. I got to meet the writers last year at the festival so I understand what inspired them to write this story. Aside from a well written script are the actors that made this story come to life. The dialog and the acting built a lot of tension between characters in this story. The main character is a young man played who carries this story. His character is very captivating. He wants to do right by his parents, but then his conscience won't leave him alone. He finally comes to terms with his conscience and is willing to do something about it, but what he and his father thinks will happen doesn't.",
         "If you've seen the film, this review is for you. While Dawn Patol is a flawed film, it's an ambitious attempt to explore serious and universal themes, set against a backdrop of the wars in Iraq and Afghanistan and the economic meltdown of 2008. The themes include racism, sexism, parenting, what it means to be loyal to friends and family, the search for purpose and the sense of alienation, connection with others and the search for self-identity. Most of the action revolves around Scott Eastwood's John, who has a problem connecting with his parents and who doesn't have a girlfriend (while his brother Ben has sex with every female within his eyesight). He lives with his parents and makes a meager living repairing surfboards, although he's doing arguably better than his father and his father's friends, who have lost their jobs in the recession. The problem with the movie is a script with situations and dialog that veer into territory that is unintentionally campy. The editing is less less than stellar. As a result, there are some facets to the story that are probably going to be overlooked: The film title has a triple meaning. It refers to a military patrol, to surfers who hang out with each other in the morning while waiting for waves, and to the early morning discovery of the dead brother Ben, the budding surfing star and golden child to his parents, on the beach. The location of the movie takes place in the water, on the beach and in beach towns, except for one out-of-joint scene when John, is supposed to be in Afghanistan. The scenery, though set within sand dunes, is obviously the same scenery used earlier in the film for the beach, particularly late in the film. While this may look like an expedient way to portray a desert-like setting it's also a metaphor linking cultural warfare to physical war: John is a fighting the same battle, whether at home with his parents or in a far away war at the behest of the government, a battle that pits the desire to find self-identity with the need to connect with with someone or something larger than himself. The underrated actress Julie Carmen plays a pivotal role as the mother of the slain Miguel. Eventually she's revealed as a wealthy, enigmatic, potentially criminal Hispanic living the good life. It's a life in a house behind gates that are the bars that lock her into a prison of her own making. She also serves as a counterpoint to the stereotypical low-life Mexicans we see at the start of the film, where John is hanging out with his father and Ben. She puts on clothing meant to disguise her identity (presumeably in case she decides to kill John). She morphs into someone else: a Middle Eastern woman, who, like an aggrieved Muslim, insults John by striking him with her shoe. And where do Mrs. Rivera and John find themselves when he reveals he killed Miguel? On the same sand dunes at the beach that also served as the stand-in for Afghanistan. By the film's end, John's search for his own identity, for acceptance by his parents and for a deep connection with someone else has led him, sadder and wiser, to the place where that search began, a state of alienation.",
         "When you think of Hawaii you think of resorts, surfing, TV shows, etc. but this movie shows you the seedy underbelly that everyone knows is there but nobody talks about. Washed up blue collar families, dead ends, petty rivalries, gangs, desperate people on the dole, too much pot and booze, and a chance to escape that never materializes. It'd hard to watch people make bad choices but the self-destructiveness is all too understandable and while you want them to make better decisions you can see why they don't. I thought the characters, families, and plots really resonated, and were rendered with intense realism even while being far from uplifting. I thought the Hawaiian background was very true to life and not what you normally see. While the acting was raw and amateurish I thought it was very powerful in that it depicted how real people would probably behave under the circumstances. The plot twist mentioned in the summary was a little awkward but served to give the story more meaning from a racial and equality perspective. Overall I feel like I found a hidden gem on Netflix and am glad to have watched it.",
         "I was so impressed with this effort that I finally signed up for an IMDb account just to write this review. Bravo for all except some military mistakes with the wardrobe. In the scenes where he is wearing the dress alpha, the green coat has hash marks on the sleeve. Hash marks are worn only after 4 years of service. Hash marks are added every four years of service thereafter. Later dialog reveals that the son had been missing just over a year when the funeral took place. Also, I wasn't clear how his hand got bloodied. But these are minor details to an otherwise high quality production. I am looking forward to more products like this. Thank you for sharing your art.",
         "I loved this movie! Great acting the storyline was awesome. I love the fact that it was filmed in sunny California at the beaches. Has a great twist that you don't see coming at all. Scott Eastwood performance speechless unbelievable. I now own this movie and watch it whenever I want which is normally on my days off. Everyone in this movie did a wonderful performance. Scott plays John a gorgeous surfer along with his younger brother pretty boy Ben. Their parents Shelia and Tick are an interesting pair. It's fun to watch them. Then there is Vicki and Donna. Vicki and Sheila have been friends well since forever. She is also Donna's mother. Donna is everyone's girlfriend especially Ben's. One night a clear night at the beach something happens...well you have to watch it to find out don't you? I Highly recommended it.",
         "I like the idea of blue collar surfers trying to figure out their lives. Surfing is often associated with beautiful tropical places or the more glamorous parts of Southern California. But this time our setting is the semi-depressed Ventura. It's a town with a mixture of working class whites and Latinos. Many reviewers have mentioned that the characters were mostly hideous people, so why would we care about them? Well, I don't think you have to like any characters in order to appreciate a film. However, I do think you need to understand why other characters would like a particular character. I didn't get that part at all with this one. You have this so-called \"Golden Boy\" younger brother who is supposedly a heroic gutsy surfer and womanizer, but there is every indication that he is a self-absorbed low-life otherwise. I guess you are supposed to assume that since his family and friends are all white trash, that they liked him for his guts and glory, and for his loyalty to his community. Having said all that, I think our true main character, Clint Eastwood's son is supposed to be a fairly decent guy. Even when he punches a lesser skilled fighter, he doesn't beat him up. Later, he tries to do the right thing amidst various people's conception of what that means. But you can root for him. The best performance is by a young blonde who plays the neighborhood slut. She was convincing. Perhaps that is partially because she was an unknown actress. So instead of picturing her in some other roles, you just believe her as this girl. Our main guy makes very little money repairing surfboards, but he rides around on a tiny dirt bicycle that seems fit for a 14 year old. This guy is supposed to be at least in his mid-20's and pushing six feet tall. Perhaps they were milking his poverty a bit. No one ever explains why our Mexican gangster is living there and doing that life, if he comes from wealth. There is a good moral conflict, some gritty realism, a unique setting, some sexy scenes set up well, and a few minor stars involved. The beginning however will lose many viewers, because there is no indication of some of the good stuff coming. I originally gave up after 15 minutes. Also, instead of someone telling our main guy to get some guts regarding revenge or surfing, they should tell him to go to school or get a real job. At one point his dad does say, \"You are better than all this.\" That was a good line. I would have liked to hear more dialogue like that. Also, give us a little more back story on the parents, the girls, and the Golden Boy. Nice try, but missing a bit more depth and context.",
         "Sometimes something tragic like death can be so meaningless and stupid it can hollow someone out from the stupidity of it all. There are different kinds of deaths and in them can be meaningless and preventable ones. I feel that this story explores that concept well. Well acted and all with faces I had never seen, and a story that was moving and unsettling. This story is relatable in an unusual way. My vet accidentally killed my cat after the office told me they would not do the surgery that day because I explained she had food. Well my vet did not know and did the surgery anyway and it killed her. This movie reminds me of that a lot. Made me cry, felt cathartic and relieving. Sometimes death really is meaningless, and sad, and happens because someone did something stupid. I am glad a movie can capture what I have been feeling. Thank you for making it."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Enderby Entertainment"],
      "summaries": [
         "When a blue-collar surfer avenges his brother's murder, he discovers he killed the wrong man by mistake and joins the Marines to escape his past, only to face it at gunpoint in a distant desert, where he must survive a captor bent on revenge.",
         "A surfer-turned-Marine held at gunpoint in a distant desert tells his tragic story of revenge gone wrong to stall his execution."
      ],
      "budget": 3500000
   },
   "movielensId": 148814,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-06-05",
      "dvdReleaseDate": null,
      "directors": [
         "Daniel Petrie",
         " Jr."
      ],
      "runtime": 86,
      "movieId": 148814,
      "title": "Stranded",
      "mpaa": "",
      "actors": [
         "Scott Eastwood",
         "Rita Wilson",
         "Jeff Fahey",
         "David James Elliott",
         "Kim Matula"
      ],
      "imdbMovieId": "2073661",
      "originalTitle": "Dawn Patrol",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["u_M8TFULQRA"],
      "plotSummary": "After the brutal murder of his beloved brother, a small-town surfer seeks revenge against the gang of merciless thugs he holds responsible. However, when another tragedy brings him face to face with the consequences of his actions, he must seek forgiveness from the very people he despises most.",
      "tmdbMovieId": 299145,
      "avgRating": 3.75,
      "releaseYear": "2015",
      "numRatings": 2,
      "posterPath": "/om6IzfsiuLWaiK8PXilVd0Bs6gV.jpg"
   }
}