{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "tarzan",
         "id": 7347
      }],
      "imdb_id": "tt0098444",
      "video": false,
      "title": "Tarzan in Manhattan",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tarzan",
               "gender": 2,
               "credit_id": "52fe4d1a9251416c9110aae5",
               "name": "Joe Lara",
               "profile_path": "/rJddbfdT3eUGJzF1AUvEp0F2lbI.jpg",
               "id": 158014,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jane Porter",
               "gender": 0,
               "credit_id": "52fe4d1a9251416c9110aae9",
               "name": "Kim Crosby",
               "profile_path": null,
               "id": 90040,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "5447d4550e0a2672ee002a3b",
               "name": "James Medina",
               "profile_path": null,
               "id": 170202,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Brightmore",
               "gender": 2,
               "credit_id": "5447d4630e0a2672ee002a3e",
               "name": "Jan-Michael Vincent",
               "profile_path": "/dZcM4xaywRFo4HC9vG23epx7kox.jpg",
               "id": 83037,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Archimedes Porter",
               "gender": 2,
               "credit_id": "5447d471c3a36817e4002242",
               "name": "Tony Curtis",
               "profile_path": "/4aSmN9M4BbFJbNaMSnjGJHffehQ.jpg",
               "id": 3150,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d1a9251416c9110aae1",
               "name": "Michael Schultz",
               "profile_path": "/vOeqakUoDdAKECGmiSwx8yq2AV0.jpg",
               "id": 77300,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5447d42bc3a3686d96002975",
               "name": "Anna Sandor",
               "profile_path": null,
               "id": 189621,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5447d435c3a3686da6002907",
               "name": "William Gough",
               "profile_path": null,
               "id": 1376554,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5447d440c3a3686d89002931",
               "name": "Edgar Rice Burroughs",
               "profile_path": "/8JlB8S3XSwRAyampS0nI4cqoa8q.jpg",
               "id": 15776,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 0.323606,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 195752,
      "vote_count": 2,
      "budget": 0,
      "overview": "Tarzan goes to New York to rescue the chimp Cheetah, who has been captured by an evil animal experimenter. There, he teams up with Jane, a cab driver and daughter of an ex-cop private eye, who help Tarzan free Cheetah and his friends.",
      "similar": [
         258489,
         26845,
         18994,
         40044,
         10603,
         34851,
         7446,
         9732,
         9273,
         46195,
         37135,
         172385,
         314095,
         278927,
         8355,
         9325,
         792,
         353486,
         390062,
         284054
      ],
      "original_title": "Tarzan in Manhattan",
      "runtime": 94,
      "poster_path": "/p5gUCO2OHo9dbxZL0qZT3lrZ1NZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American First Run Studios",
         "id": 35989,
         "origin_country": ""
      }],
      "release_date": "1989-04-15",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Schultz"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Edgar Rice Burroughs",
         "Anna Sandor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098444/",
      "coverLink": null,
      "actors": [
         "Joe Lara",
         "Kim Crosby",
         "James Medina"
      ],
      "reviews": [
         "This film is hilarious. It takes the tarzan character and moves him to New York in search of his missing monkey friend, to do a whole fish out of water plot line, as well as the usual good vs evil thing that seems to be present in most films these days, and obviously the obligatory love story. Tony Curtis, though it should go without saying, is absolutely superb in it. The overacting involved in his part really just makes his role so funny. He plays the ex cop father of the love interest who occasionally masquerades as a main part, and adds a touch of (intended) humour to the film. Everyone should watch it at least once just for the experience, and as it is the perfect TV movie it should be on somewhere soon!",
         "Enjoyed watching Tarzan in Manhattan and I think Joe Lara is so gorgeous I could watch him forever! I loved the moment with Tarzan and Cheetah together...hilarious... Action, Adventure, Romance, Animals, lots of humor, this TV movie has it all!! Great locations and Tarzan on the bus on top of Times Square is wonderful. The photography is terrific and the sets are super and I loved the fancy house they used for the Brightmore mansion. A definite thumbs up to this family film once again proving that Tarzan is Evergreen and Everlasting!!",
         "Tarzan in Manhattan transplants Tarzan (Joe Lara) to New York in search of Cheetah after his chimpanzee friend has been kidnapped for use in illegal animal experiments. The character of Tarzan most famously visited New York in the classic Johnny Weissmuller-Maureen O'Sullivan film Tarzan's New York Adventure (1942). In that film scenes of Tarzan walking around the ledge of a Manhattan skyscraper looks more like an episode of TV's Superman than a jungle film so any time a Tarzan-goes-to-town plot device is used one must be prepared for the intended high camp value. Hard core Tarzan fans don't really like Tarzan out of the jungle but considering the amount of films and TV shows made about Tarzan a trip to the city every now and then is a nice diversion. Joe Lara plays Tarzan a bit like David Hasslehoff doing an impression of Keanu Reeves, and though Lara's acting is not stellar, let's face it, this is a role made famous by Johnny Weismuller's \"Me Tarzan, You Jane\" delivery which was due to more to lack of acting ability than character development. Joe Lara was a pretty good choice physically since there are certain shots early in the film atop an elephant that mimic the chiseled look of early Tarzan book cover artwork. Joe Lara does look like the book version, and comic book version, of Tarzan. Kim Crosby plays the Jane character, in this case, a Brooklyn cabbie. Jane has been trained as a private investigator and will join her father in business as soon as they work out some issues. Kim Crosby looks and acts a lot (a whole lot) like a young Debra Winger. The down side is that her character has a bad Brooklyn accent (okay there's no such thing as a good Brooklyn accent) and even worse dialogue. Tony Curtis plays Jane's father and being Tony Curtis he realizes he's in a campy film and delivers a funny performance to match. The first half of the film plays a lot like Crocodile Dundee with a little background of Tarzan in his home element. Since Tarzan is very well known to movie audiences not much was required of background except to show the evil-doers killing and kidnapping Tarzan's ape family. Once in New York Tarzan learns how to hail a cab, stops runaway horse carriages and turns street punks into Welcome-Back-Kotter-sweathogs. The almost-naked Tarzan meets Jane and introduces himself as Tarzan, King of the Apes. Jane is instantly smitten by his combination of innocence and muscles and takes him home like a stray puppy. At this point Jane is more interested to see under his loin cloth than help him find Cheetah but that is soon to change and the sexual attraction angle is dropped. Minutes after bringing Tarzan home, Jane's father arrives and though a bit taken back of Tarzan swinging from the ceiling soon bonds with Tarzan after they share an interest in bringing down the bad guys who kidnapped Cheetah. The head bad guy is your typical wealthy movie bad guy complete with a mansion built for charity balls, machine gun toting guards, a helicopter with more machine gun toting guards on board, and an underground animal experiment lab under his trophy room. His back yard comes complete with an African jungle so when it comes time for Tarzan and company to storm the palace, and you knew they would, Tarzan could swing through the trees as the bad guys try to hunt him down. One fun element of Tarzan films is that producers love putting former Tarzans into the film, sometimes as a bad guy, and this film in all it's campiness uses Jan-Michael Vincent who played a campy Tarzan character in the Disney Tarzan spoof World's Greatest Athlete (1973). Tarzan films can be great (Tarzan and His Mate) or bad (Bo Derek's Tarzan the Ape Man) but for the most part are entertaining. The story of Tarzan coming to New York in search of those that came to Africa and destroyed his family makes sense and doesn't seem as awkward as the plot devices in hit films like Crocodile Dundee or Three Men and a Baby that have our protagonists get involved with bad guys by mere coincidence. Like many Tarzan films, this is a low-budget affair so we hear bad dialogue and see bad special effects, most notably a support wire holding up Jan-Michael Vincent when Tarzan is suppose to be holding him up above his head. This scene made Vincent look like a human yo-yo. There are also curious continuity problems. In one early scene we see Tarzan wearing boots (he apparently wears boots when he travels abroad) as he escape-dives into the water. We then see Tarzan swimming around without boots. When he arrives on shore he's wearing boots again. Now to be fair, we don't see his hands while he's in the water so he might have removed them after he hit the water and held onto them until he hit shore. I'm guessing the boots (which look like the type Daniel Boone would wear) cost too much and the budget of the film prohibited the boots getting wet. For Tarzan buffs, this curious boots-no-boots occurred in some post-Weismuller Tarzan films where old tree-swinging footage from previous Tarzans were spliced into low-budget films featuring new Tarzans. Sometime Tarzan wore Robin Hood style slippers, sometimes not, depending on the footage. Perhaps this Tarzan is merely a traditionalist film-wise. This was also a TV movie and we are treated with the type of explosions that look like fireworks going off and were the staple of such shows like The A-Team. We see one with the camera angle from the sidewalk looking up at a fourth story window as the window explodes and one exploding from the bad guys jeep with the bad guys running in all directions just before igniting. And of course, if no TV adventure would be complete without, Tarzan and Jane slow motion running toward camera, an explosion in the back ground, and the two jumping in the air with a neat tuck and roll. Charley's Angels would be proud. By the end of the film Tarzan and Jane join Tony Curtis in the detective business and a pilot has been shot. Somehow the idea didn't catch on and never developed as a series. I guess the idea of Tarzan, Private Eye was just too much of a good thing though I can't help think that David Hasslehoff used it as inspiration for Baywatch Nights (which I fondly regarded as Lifeguard, Private Eye). The producer of this film would bring Joe Lara back as Tarzan in a pilot film and series called Tarzan: The Epic Adventures, a more traditional look at Tarzan which used the science fiction elements of the original Edgar Rice Burroughs books. Tarzan comes and goes, but always returns.",
         "It really boggles my mind when i think that someone wasted a month or so of their lives writing this script. And then to think that he/she handed this script out to probably a dozen people and they all gave this project the go ahead, thinking that it might be a good idea to invest hundreds of thousands of dollars to make it, is truely mind blowing. Joe Lara is Tarzan, or at least thats what they lead you to belive. His acting skills fall somewhere between Ron Jeremy and Vanilla Ice. He plays a very unconvincing Tarzan in a caricature of New York city in the eighties. The only actors in this movie that i have ever heard of are Jan-Michael Vincent and Tony Curtis. Vincent and Lara are BAD ACTORS, and Tony Curtis acts like a bad actor. This movie is not funny, not romantic, not suspenseful, not beliveable and, not entertaining. Possibly the funniest thing about this movie is the fact that i found it on DVD. I bought it for $2 out of a clearance bin to give as a joke gift to a film buff friend of mine. This is THE ONLY valid reason that anyone would ever want to purchace this horrible, horrible film."
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": ["American First Run Studios"],
      "summaries": ["Tarzan goes to New York to rescue the chimp Cheetah, who has been captured by an evil animal experimenter. There, he teams up with Jane, a cab driver and daughter of an ex-cop private eye, who help Tarzan free Cheetah and his friends."],
      "budget": 0
   },
   "movielensId": 148909,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-04-15",
      "dvdReleaseDate": null,
      "directors": ["Michael Schultz"],
      "runtime": 94,
      "movieId": 148909,
      "title": "Tarzan in Manhattan",
      "mpaa": "",
      "actors": [
         "Joe Lara",
         "Kim Crosby",
         "James Medina",
         "Jan-Michael Vincent",
         "Tony Curtis"
      ],
      "imdbMovieId": "0098444",
      "originalTitle": "Tarzan in Manhattan",
      "genres": [
         "TV Movie",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["uR07rftAZcM"],
      "plotSummary": "Tarzan goes to New York to rescue the chimp Cheetah, who has been captured by an evil animal experimenter. There, he teams up with Jane, a cab driver and daughter of an ex-cop private eye, who help Tarzan free Cheetah and his friends.",
      "tmdbMovieId": 195752,
      "avgRating": 4,
      "releaseYear": "1989",
      "numRatings": 3,
      "posterPath": "/p5gUCO2OHo9dbxZL0qZT3lrZ1NZ.jpg"
   }
}