{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "north korea",
         "id": 158538
      }],
      "imdb_id": "tt4206218",
      "video": false,
      "title": "The Propaganda Game",
      "recommendations": [
         300176,
         365183,
         267792,
         278518,
         230846,
         159032,
         51927,
         328739,
         413834,
         338353,
         333375,
         159988,
         169864,
         319073,
         295799,
         284470,
         26354,
         309050,
         324794,
         333091
      ],
      "backdrop_path": "/rLekCS7rDbo9yBRqyV6TnFFClwj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "55f624c09251413ed900110b",
            "name": "Álvaro Longoria",
            "profile_path": "/b6zXXGetK5bZq5JSHYsXD1tnzuw.jpg",
            "id": 1051295,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.817726,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 359746,
      "vote_count": 62,
      "budget": 0,
      "overview": "North Korea. The last communist country in the world. Unknown, hermetic and fascinating. Formerly known as “The Hermit Kingdom” for its attempts to remain isolated, North Korea is one of the largest source of instability as regards world peace. It also has the most militarized border in the world, and the flow of impartial information, both going in and out, is practically non-existent. As the recent Sony-leaks has shown, it is the perfect setting for a propaganda war.",
      "similar": [
         160704,
         396535,
         11658,
         72190,
         228967,
         199584,
         2440,
         59421,
         10253,
         11423,
         113,
         60747,
         200085,
         293670,
         4723,
         437068,
         165213,
         89501,
         10355,
         235704
      ],
      "original_title": "The Propaganda Game",
      "runtime": 94,
      "poster_path": "/uGvbf7joyOAjCQnoeCEmh0nO4uV.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "한국어/조선말",
            "iso_639_1": "ko"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Mare Nostrum Productions",
         "id": 90792,
         "origin_country": ""
      }],
      "release_date": "2015-10-03",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Álvaro Longoria"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Álvaro Longoria"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt4206218/",
      "coverLink": null,
      "actors": ["Rajiv Narayam"],
      "reviews": [
         "Let's put this out of the way - everyone knows that an organised tour of the DPRK is one massive facade. For a filmmaker to gain entry and keep that much footage, the film absolutely had to showcase happy citizens, sprawling buildings and new technology. How could you expect anything else? What makes this film brilliant is what he did with the footage. Aptly named \"The Propaganda Game\", director Álvaro Longoria takes us with him on tour of North Korea's capital Pyongyang. What I really enjoyed about this film is its rawness - You get to see everything from Longoria's eyes and decide for yourself what is real and what is not. It felt like a very personal experience. The deception of the State and its effects on its people are nothing short of terrifying. How could they act so naturally if everything is staged? Could it be real? Are they really so brainwashed? Are these people suffering? How? I think some people who have seen it are confused, judging from some other reviews. I urge you to see this film without searching for concrete answers. Longoria presents many opposing arguments but there really is no telling the extent of North Korea's deception or on the flip side, the warping of information in Western media (I mean, The Guardian is pretty ridiculous.) I suspect Longoria himself does not know what to make of it. You simply can't find that kind of information on North Korea; experts themselves do not have the full truth nor do they all agree with each other. Such is social science. There is simply too little information, and the film captures that wonderfully. Speculating would be unwise. The film leaves you rather unsettled, but I believe that was the intended effect. How could we be comfortable when a system as oppressive as the DPRK's is still surviving to this day? Its message, if there must be one, is that the people of North Korea are suffering - and that instead of looking at them as ignorant fools living in a joke of a nation, we should be sympathising with them and condemning such cruelty. It is a film that focuses on the people, and is a much needed take on the subject amongst all the hoo-ha surrounding North Korea.",
         "In recent years, a few documentary makers have entered the otherwise closed country of North Korea--some of which covertly filmed the land and its people. All of the films like these that I've seen have been rather critical of the repressive North Korean regime and its human rights violations, but this new film is a bit different. While it features some interviews with folks who are very critical of North Korea, it also allows the North Korean propaganda machine ample time to present its well-scripted case that their land is a sort of nirvana and that they must maintain their military might and readiness to protect itself from capitalism and democratization. It's a bit of a confusing film, mostly because you see happy and well-fed North Koreans. But, it must be remembered that the Spanish film crew was led around with government officials and they simply couldn't go where they wanted. In particular, the strange ex- Spaniard and North Korean government official Alejandro Cao de Benós takes the crew about the country and there is no freedom of movement for the filmmakers. So, when they ask about concentration camps and starvation, you never really get to see much of the country other than a couple brief and scripted trip to the countryside and insistence from Benós that such places don't exist. Instead, you see almost exclusively views of the capital, Pyongyang and with loyal North Koreans who seem like model citizens. Overall, the effect is very strange. On one hand, the country looks nice and clean and BIG....but on the other, much of it also seems fake (such as the odd church service they attended). Worth seeing but I am really not that sure what the message is or what most folks will take from the film other than confusion. Because of this, I would recommend you see other films to get a more complete view of the state of the country and its people, such as \"A State of Mind\", \"Crossing the Line\" as well as \"Seoul Train\".",
         "In this clever documentary, Spanish filmmaker Alvaro Longoria gets rare access as a foreigner to enter North Korea and document his travels there, the notoriously secretive and isolated (both self-imposed and by the rest of the world) communist regime. Longoria's goal in visiting North Korea is to try to see first-hand for himself, and by talking directly with North Koreans, if there is any truth to the propaganda about the nation coming from NK itself and also from outside (i.e., what little information that we do get about the country, mostly horrible accounts regarding human rights violations, famine, executions of anyone seen as dissenters, etc.). One of the most interesting and remarkable aspects of the doc is Alejandro Cao de Benos, a Spanish man who is the sole foreigner working for the North Korean government, and basically acts as tour guide for Longoria and as a loyal spokesman of the North Korean regime. He appears to be showing a very carefully constructed, staged tour of North Korea, with everyone smiling and singing the praises of their fearless leader Kim Jong-un. There is something off-putting about Alejandro, and one of the many talking heads in the doc hints at Alejandro receiving generous financial compensation for his services. I would like to have known a bit more about how a man from Spain became so involved in becoming spokesman for the DPRK; all we seem to get is that from a young age Alejandro was interested in communist philosophies but was dissatisfied with Spanish communist parties and its leaders. Most of the people that Longoria gets access to are part of the government; it seemed rare that he got to speak in-depth and candidly with any everyday, \"average\" North Koreans. But even then, one gets the sense that these people are both too utterly brainwashed, and simply in fear, under those seemingly forced smiles, to speak freely about the regime. One striking moment showing the regime's attempts at covering up their oppression is when Longoria visits what appears to be Christian church, during a mass and everything, but later it's claimed that this church is the only one of its kind in the country and is a \"fake\" - it's just for show, and Christianity is not allowed to be practiced. This film made for an often fascinating watch, even though I did not gain much new knowledge overall. Understandable, partially due to those that Longoria speaks to not being willing to give candid answers to the most pressing questions about the regime. North Korea still remains very much a mystery, and all I can say is that I really feel for those people.",
         "This documentary is unlike any other documentary on the subject of North-Korea. Most documentaries have a negative undertone from the start of the beginning, but Alvaro Longoria is much more neutral in his \"quest to seek out the truth\". As one would expect of the communistic country, he is not to travel freely and is always accompanied by guides and state officers, but, unlike other documentaries, a lot of 'normal' North-Koreans (assuming that they aren't all actors) were interviewed in front of a camera. This gives us an insight in what goes through the minds of the North-Korean people and makes it clear that it is truly devoted to its leaders and convinced of their divinity. I have no doubt that there were staged situations, but it just cannot be possible that everything was. Even though the documentary is 90 minutes long, there are still many questions unanswered, for example about prison camps or the black market, but at least Longoria didn't make a suggestive documentary like the VICE documentary on North-Korea, in which they claim it is almost impossible to get in the country and make it look as if they are the only ones there.",
         "The N. Koreans aren't only held in by a physical wall that separates them from freedom, they are held in by a wall of propaganda that hearkens to the age of the 3rd Reich. This film did an amazing job of showing how creepy and false the front of this country really is, you can almost feel the dying millions clawing desperately for food or safety right behind the satirically sweet school children singing praises to their crazy, delusional dictator. This film allowed the rest of the world to see the thinly placed veneer, that somehow Kim Jong Un actually believes will fool educated and aware people outside of his regime. First tip was that the camera men are always escorted and observed by government assistants. The veneer is so impossibly thin at times you are left wondering why the hell they spent the money to construct fake museums, colleges and \"public places\" instead of just feeding the starving masses. Truly the scenes shot in these places are disturbing, in a \"happy free\" country citizens would be clamoring to visit museums, colleges and gyms but there is a deathly quiet & newness to all of these places that gives away that they are in fact just constructs to fool the western world. I felt the facade, I felt the lie, I understood that the filmmaker was politely playing along to show just how crazy the militant propaganda really was. The fear and uncertainty in the eyes of every person interviewed or even caught on a passing camera,was heartbreaking. One man being interviewed actually broke out in a cold sweat, to what seemed to be a very routine and unimportant question by Western standards. The \"modern\" apartment with the flat screen was the biggest joke of all. While their military is using 70's and mid 80's media technologies, some random citizen has a flat screen and access to Western free thought movies!? I got tired of the N. Korean diplomat using the word \"socialist\" in place of totalitarian dictatorship, who does he think he is fooling? It is not democratic when the people think that the leader is god, or can read their minds. Or builds a fence to force them to stay in for that matter. That man was a very low down, slimy slug of a human and I haven't been able to decide whether he was just a forced actor that may have been trying work off some sentence, or just a really huge sellout. He didn't speak the language which seemed really unconvincing. I just get that vibe from him that he is as fake as the scenery. Another poster called him a clown, I think his issues run much darker than they do comical. I spent a good deal of the movie wishing he would trip and fall in front of a bus. All in all it was a very enlightening film, that made me feel emotional and frustrated for the brainwashed and ignorant citizens of N. Korea- they are ignorant in the very true sense of the word- they have NO idea that the west is not evil, that even our poor have access to education, food and shelter that free thought and speech is real thing available to every class. The one thing this movie did for me that others had not was that it showed me what a dangerous man the Supreme Ruler is. Here we make fun of him, we pretend that he is an idiot, a clown, a farce, but all the while he is killing thousands of people that rely on him. He may be all those things but he is one hell of a dangerous farce and I hope within my lifetime he will be dealt with accordingly and the people of his beautiful country given freedom and hope. There is no way not to get something out of this documentary, it was skillfully done and achieved it's purpose of not telling the viewer that the Regime is bombasting the outside world with propaganda but by letting the N. Koreans do it themselves. It was a really engaging film.",
         "Film maker Álvaro Longoria managed to get permission to film inside the DPRK but it was a guided tour – that was to be expected. His tour was exclusively of the cosseted capital Pyongyang. However, Longoria knew that there would be restrictions on what he could and more importantly could not film. His guides take him on a tour of all the new shiny buildings and installations and shows us all the shiny happy North Koreans enjoying the gifts of the benevolent Kim Jong-un. Everywhere there are statues and pictures of 'The Great Leaders' who must be constantly adored as some sort of deity and the people seem to have genuine emotions about these dictators. The film also interviews experts and defectors as well as human rights activists and strives to show both sides in the ever growing propaganda war. The attempts to be balanced are credit worthy and Longoria himself missed his calling for the diplomatic mission. I was reminded of a Benny Hill sketch where an advertising board said 'People buy Smiths Pies because they don't know any better'; and I think that is why North Koreans seem to be so content with their lot in the World – they just do not know what they are missing. He did mention the markets and the hard currency shops which the regime has had to allow to exist as it was too troublesome to uninvent 'choice' as it were. What is left out is equally important and any one who has studied this 'hermit kingdom' will know of some of the bizarre and cruel abuses of human rights, but the whole point of the film is to redress the more extreme distortions of propaganda and try to see if there is any unvarnished truth that would help us understand them. In the end I felt he did a rather good job and as such can recommend to anyone who has an interest in modern social history.",
         "\"The Propaganda Game\" gives a mature view at North Korea. It shows that the true believers lay on both sides. Is Bill O'Reilly, the conservative news pundit, just as biased as Alejandro, the fat North Korea-phile? Not really, but the documentaries closing shot shows you that the power news presenters hold should be used responsibly to focus on the suffering on the North Korean people instead of sensational headlines. I would recommend you watch this documentary because it is sober, questioning, and self-aware. There is never a shot where director and interviewer Álvaro Longoria concedes the point to any North Korean propagandist. His interviews weave together to tell the most complete story available yet, while noting much of North Korean life is left to the realm of conjecture.",
         "With all the ongoing debacles with North Korea in the news I figured this would be a fantastic time to watch The Propaganda Game. A Spanish made documentary with very impressive and rare access to the country it pulls back the curtain (Or at least as far back as the officials would let it go) and shows both sides of this remarkable place. The trouble is that both the west and North Korea seem to be playing the The Propaganda Game and it's extremely hard to know what is true and what isn't. My personal opinion is that it's a combination of both, but this documentary is quite unbias and gives you a chance to decide for yourself. US government, the Korean government, ultimately the real victims in this appear to be the citizens of Korea themselves as I find their chosen lifestyle monstrous but again how much of it is true and how much is staged? The Propaganda Game is well worth a watch and though heartbreaking it is very eye opening and a fantastic piece of documentary film making. Always wondered why Korea didn't kick off over Team America World Police (2004) but did regarding The Interview (2014). Perhaps a leader with less sense of humour explains it?",
         "This is an obscene movie made by a poor quality team. There are others productions from the same decade, most of them better. So this is not even rare. The lack of footage is compensated with many scenes filmed in Europe. And the producer is simply lazy or the Spanish have became overnight world specialists in North Korea. Finally all the talking heads drum their kind of propaganda oblivious to the facts and everything becomes a cheap TV report about what one or another might think about a given situation. What makes everything even worse is that the Spaniards are way too happy to enjoy the protocol and prefer to rip off old documentary footage than risk their behinds into filming the people. Something most American Documentaries do. Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Mare Nostrum Productions"],
      "summaries": [
         "North Korea, formerly known as the hermit kingdom, is perhaps the largest source of instability as regards world peace. Its border is one of the most militarized in the world. The lack of impartial information, both inside and coming out of the country, is the perfect setting for a propaganda war, which will be analyzed in the film through numerous examples of the surprising way in which information is manipulated, in and about North Korea. Alejandro Cao de Benos, the sole foreigner who works for the DPRK Government, and many locals will show us their vision of the reality in North Korea. The other side of the story will be reflected through interviews to South Korean citizens, human rights advocates, diplomats, propaganda experts, etc.",
         "Granted controlled access by national officials, filmmaker Álvaro Longoria tours North Korea to contrast his findings to the typical Western depiction of the nation."
      ],
      "budget": 0
   },
   "movielensId": 148984,
   "movielens": {
      "languages": [
         "English",
         "한국어/조선말",
         "Español"
      ],
      "releaseDate": "2015-10-03",
      "dvdReleaseDate": null,
      "directors": ["Álvaro Longoria"],
      "runtime": 94,
      "movieId": 148984,
      "title": "The Propaganda Game",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "4206218",
      "originalTitle": "The Propaganda Game",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["YGir3buLI8c"],
      "plotSummary": "North Korea. The last communist country in the world. Unknown, hermetic and fascinating. Formerly known as “The Hermit Kingdom” for its attempts to remain isolated, North Korea is one of the largest source of instability as regards world peace. It also has the most militarized border in the world, and the flow of impartial information, both going in and out, is practically non-existent. As the recent Sony-leaks has shown, it is the perfect setting for a propaganda war.",
      "tmdbMovieId": 359746,
      "avgRating": 3.62857,
      "releaseYear": "2015",
      "numRatings": 35,
      "posterPath": "/uGvbf7joyOAjCQnoeCEmh0nO4uV.jpg"
   }
}