{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1169834",
      "video": false,
      "title": "Mississippi Damned",
      "recommendations": [272414],
      "backdrop_path": "/qnwKHOrdlF0xheBEILurWNHXt6P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Kari Peterson",
               "gender": 1,
               "credit_id": "57d9acb7925141670f0078b9",
               "name": "Tessa Thompson",
               "profile_path": "/fycqdiiM6dsNSbnONBVVQ57ILV1.jpg",
               "id": 62561,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Junior",
               "gender": 0,
               "credit_id": "562bc946c3a3681b540057fb",
               "name": "Adam Clark",
               "profile_path": "/f5uroiZUykxGWyI2WutxeM0Tvel.jpg",
               "id": 1384666,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sammy Stone",
               "gender": 2,
               "credit_id": "562bc9569251412845004f74",
               "name": "Malcolm Goodwin",
               "profile_path": "/igRMW5VUmv52D6wsD03s08oRWHT.jpg",
               "id": 57997,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Delores",
               "gender": 1,
               "credit_id": "562bc966c3a3681b5c0053d1",
               "name": "Michael Hyatt",
               "profile_path": "/7SFxkBTralQauweB4TUZS6hvVz0.jpg",
               "id": 61084,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Young Sammy",
               "gender": 2,
               "credit_id": "562bc974925141284c00569b",
               "name": "Malcolm David Kelley",
               "profile_path": "/rLnHnEyFmPxnS7FlALTBlEJv8tl.jpg",
               "id": 77078,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Anna",
               "gender": 0,
               "credit_id": "562bc982c3a3681b5e0052b5",
               "name": "Simbi Khali",
               "profile_path": "/hOdj8WA4L6j4grdHti7hBTqRYDG.jpg",
               "id": 172200,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Tyrone",
               "gender": 2,
               "credit_id": "562bc99392514128570053c9",
               "name": "D.B. Woodside",
               "profile_path": "/deDzc1UEZsOvamdhvBPNbwrBSrM.jpg",
               "id": 21356,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Milena",
               "gender": 1,
               "credit_id": "57d9acd1c3a36852f4007b97",
               "name": "Cynthia Addai-Robinson",
               "profile_path": "/mdljxklvotV0CpiyWM4fs6HdjCl.jpg",
               "id": 182272,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5509059592514110cc002982",
            "name": "Tina Mabry",
            "profile_path": null,
            "id": 65521,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 1.015846,
      "production_countries": [],
      "id": 193309,
      "vote_count": 5,
      "budget": 0,
      "overview": "Three poor Black kids in rural Mississippi reap the consequences of their family's cycle of abuse, addiction, and violence.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Mississippi Damned",
      "runtime": 120,
      "poster_path": "/nTA40iBYKCRx7yh8KeLVNh69nTl.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2009-01-16",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tina Mabry"],
      "runtime": 120,
      "synopsis": null,
      "writers": ["Tina Mabry"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1169834/",
      "coverLink": null,
      "actors": [
         "Adam Clark",
         "Malcolm Goodwin",
         "Michael Hyatt"
      ],
      "reviews": [
         "I just watched this movie on Netflix, if it played in the Theater, some how I missed this very well written movie. my hat is off to the writer, Director,( Tina Mabry), Michael O'Rourke I too thought this could have been just as good as 12 years a slave, Ms. Mabry just needed a bigger budget. The acting was good Ms. Thompson who played the girl who made it out of Bad town Mississippi is a very good actress with a good career ahead of her. This story had every thing I seen in the ghetto of north Philly. at times it was hard for me to watch, because I seen all of the abuse in my own life from people living in the ghetto ,it was so real for me. Ms. Mabry you are a very good writer, I will be looking for more great movies written by you. very well written I loved it.",
         "After screening Mississippi Damned at Chicago International Film Fest in 2009, I took these notes. The survival of blacks—the community is oppressed in ghetto like conditions. The small shanty Southern town could be a prison setting. Family and community members turn on one another—use, abuse one another, generation after generation. Alcohol provides a relief of momentarily sorts; nourishment for children is scarce, as are jobs, housing, etc. There is no way out apparently. A poignant subplot: Shaking, a lesbian, mesmerized by a love that can't possibly be returned. Still, she clings to what she sees as her one chance at salvation, a crush with a girl who is bisexual. Even as she clings, she almost knows it's not going to work out; perhaps preferring madness in the face of the life before her in hell. There's no way out. Except a glimmer of perseverance that comes from the youngest daughter. Even so, when she does get enough together for an escape, she either miss-lends it, or receives money she cannot in conscience accept from the brother who sexually abused her when she was 6. Her aunt provides some relief with encouragement to play piano, and eventually a $25,000 check. At about age 18, the girl does make a determination to leave, but only after the same aunt sits down on her hard: \"Do not let your generosity of spirit keep you here. Go. You have the opportunity. You don't want to live here amongst us, die amongst us without hope.\" (Paraphrased) The film is an exceptional depiction of what I can only describe as a concentration camp of poverty. And even if offered light, what would the husband of the aunt do? She is loving, a refuge for children, a pillar for shelter and nourishment. He, the husband treats her with the utmost contempt, a symbol of bullying and abuse of all stripes. She is the light. And he refuses to see it, indeed almost kills her, but for a threat from her Mama, shotgun in hand. And yet in the hopeless, grim, violent, addict occupied prison, the director has returned to her roots and captured a film that sheds light and possibly healing. (All actors with few minor roles, were cast from LA!) I am inspired to post this review after having just seen \"12 Years a Slave.\" Though I find the intentions, star power, historical accuracy of \"Slave\" to be beyond reproach — and I do not wish to undermine the enthusiasm and recognition for Steve McQueen's vision and direction of his film — I find \"Mississippi Damned,\" low budget indie that it is, a far more compelling and haunting film. Thank you writer / director Tina Mabry with all my heart.",
         "I loved this movie. I thought it was realistic. I have lived bits and pieces of this story and it broke my heart and inspired me in so many ways. Kari's story of being talented and stuck in a place with no opportunity struck me particularly. I came from nothing, graduated with a Masters last year, and have a great job now. I cried so hard for Kari during all the times she had go to others looking for ways to pay for college, because I know what it's like to struggle to find funding for college, knowing that even though you could go to school close to home, home is part of the problem and that if you don't get out now you never will. Everyone around you is already pushed to the brink and can't help you even though they desperately want to. And when she left for college at the end, I sat and cried for almost 15 minutes, because I myself rode a greyhound bus for 18 hours out of my poverty-ridden city to a new shining life at my college while leaving behind my parents in that hole. To this day I still carry a twinge of that guilt with me. My mother also struggled with cancer and mental illness so when Delores became ill, I knew how the characters felt. I also know people like Sammy who left and through bad fortune ended up coming right back to the squalor. It's heartbreaking, but it's so very true and it happens all across America everyday. If you truly want a picture of what poverty looks like for human beings and are looking to try and understand why people don't just \"pull themselves up\", I recommend watching this movie.",
         "Mississippi Damned is what you would call a slow, consistent burner. Nothing ever gets too out of control, the pace doesn't really ever kick off and the story is constantly good. However, that is where the problem lies, as nothing much ever happens. It feels like a continuous circle with no end (not too exciting for a two hour film). But on the plus side, this film does have some interesting ideas which speak loudly and well. Besides from being rather boring for the entirety of the film, you can't look passed at what this film could have been. So many films have done what this film is trying to do, but the dark emotional slow burner does pay off in the end.",
         "This movie had a good plot line and a really good cast. However, I had some issues with it. At the beginning of the movie, I had a hard time trying to figure out what was going on. As mentioned in the summary title, there was way too much going. There were a lot of characters, so sometimes I forgot names. It was easy to get the sisters' stories mixed up. I also didn't understand some parts of the ending. I won't say too much because I don't want to spoil it for others. And overall,the movie was too depressing. Just was a complete overkill of depressing stuff. I thought that nothing would ever end well for any of the characters. I had to watch cartoons afterwards.",
         "This movie is absolutely horrible! There isn't a single redeemable black man in the entire film. Every brotha was a horror story. Dudes were in a nutshell - *Spoiler Alert*- lazy, good-for-nothing' bums who couldn't be bothered to look for a job, child molesters, irresponsible gambling fools, abusers, users, cheating-whoring losers and manipulative, pride-filled idiots! Not that there was anything they should have been proud about!! (There was one minor - very minor-guy in the film who was barely fleshed out, but he at least seemed decent). And the women weren't much better. They came off as stupid and weak. The story follows three sisters and their families. One sister is completely homophobic about her lesbian daughter and puts up with a husband that loses the bill money gambling. Another sister is sweet, but continues to put up with a man who won't work and talks to her like she is a damn dog. Hell, stray dogs are treated better. The verbal abuse she endured was painful to hear and made me cringe. And the third sister is a drunk, who lives with a man who is relentlessly screwing another - and in her face! And what does she do? At her breaking point, she knifes the other woman and goes to prison leaving her lone son (who'd already been sexually abused by a family friend) on his own. She could have at least stabbed the cheating man! And then this son, turns around and rapes his young cousin and grows up to be a child molester. The son's successful athletic career turns sour and instead of stepping up, he \"fronts\" like he still has it going on all while depending on his wife to pay the bills. There was just too much drama. I mean, every bad thing that could have happened, did happen - including cancer! I understand this was supposed to be about a young girl surviving poverty and the dysfunction of her family and triumphing by finally leaving behind the dead weight. But this is the kind of movie that makes people believe that black men ain't isht! I will admit, the acting was good and convincing. Actress Kari Thomspon did a terrific job with her role, as did the other lead female characters. This film gets 3 stars because I have still seen worst films...but this is barely earning that 3.",
         "This was an excellent and well told story.I love the way Tina introduces the character's and how the story is inter woven from house to house.The characters were so very related to me. I felt like she was telling my story.I 100% related to this film because I also came from this environment and felt this environment in my gut. I hated the one person who gave it a bad review was because he did not see a good male character but I guess he didn't see where this was based on a true story. I cried so hard for this story and for Kari. My mother drove me to school and struggled to pay for me to go to school. I am having all of my friends watch this movie. I would love to produce your next film Tina.",
         "The film goes through every possible social ill known to mankind. This is an urban problem affecting minorities; it is not just confined to Mississippi. It is basically the idea of a young girl, Kerry,trying her best to get out of this cycle which has beset the family. We see alcoholism, gambling verbal and physical abuse, breast cancer, and men constantly cheating on women in the film. There is lesbianism as well, nothing is really missed here. Everyone starts dying off as Kerry gets the opportunity to get out. Is the writer trying to say that if you can't rid yourself of this vicious cycle, you just die?",
         "I am not sure why this movie was made. Every stereotype has been exhausted to the fullest in the movie. I think black folks and homosexuals are portrayed in a light that basically enforces every stereotype on old time television. I am not a fan of smoldering movies with a payoff that is seen a mile away coming. The shades of hope are quite evident in this movie where the darker you are the darker the chances of any salvation. The topics in this drama are real but I am certain this was meant to be touching when all it seemed to be to me was an outright downer movie. I think movies should have some learning lesson for the viewer and not just droll on like Boris Karloff doing his Frankenstein thing. The end is also quite disappointing and there is nothing I can redeem from it."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Morgan's Mark"],
      "summaries": [
         "In the years 1986 and 1998 three black children living in Mississippi deal with poverty, violence and abuse. Young Kari the main character, is a talented pianist who hopes to pursue a career in it one day. Her sister Leigh is struggling to hide her lesbian relationship with her girlfriend, Paula. Their cousin Sammy, is a star basketball player. Each child deals with their dysfunctional family, including gambling, alcoholism, and poverty.",
         "Three poor Black kids in rural Mississippi reap the consequences of their family's cycle of abuse, addiction, and violence."
      ],
      "budget": 0
   },
   "movielensId": 148923,
   "movielens": {
      "languages": [""],
      "releaseDate": "2009-01-16",
      "dvdReleaseDate": null,
      "directors": ["Tina Mabry"],
      "runtime": 120,
      "movieId": 148923,
      "title": "Mississippi Damned",
      "mpaa": "",
      "actors": [
         "Tessa Thompson",
         "Adam Clark",
         "Malcolm Goodwin",
         "Michael Hyatt",
         "Malcolm David Kelley",
         "Simbi Khali",
         "D.B. Woodside",
         "Cynthia Addai-Robinson"
      ],
      "imdbMovieId": "1169834",
      "originalTitle": "Mississippi Damned",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Three poor Black kids in rural Mississippi reap the consequences of their family's cycle of abuse, addiction, and violence.",
      "tmdbMovieId": 193309,
      "avgRating": 3.875,
      "releaseYear": "2009",
      "numRatings": 4,
      "posterPath": "/nTA40iBYKCRx7yh8KeLVNh69nTl.jpg"
   }
}