{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "tokyo japan",
            "id": 12369
         }
      ],
      "imdb_id": "tt0493567",
      "video": false,
      "title": "Black Kiss",
      "recommendations": [
         26886,
         8426
      ],
      "backdrop_path": "/zmGE7znkdhb32adfXg233n1Dwgy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f8127649",
               "name": "Reika Hashimoto",
               "profile_path": "/ieFovfv5X2PmDYyxOK6ZwJrMQGG.jpg",
               "id": 79455,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f812764d",
               "name": "Kaori Kawamura",
               "profile_path": null,
               "id": 138554,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f8127651",
               "name": "Shunsuke Matsuoka",
               "profile_path": "/ok9MpgoHOGgLA1gnTtUq0nIV8ph.jpg",
               "id": 128479,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe472dc3a36847f8127655",
               "name": "Masanobu Ando",
               "profile_path": "/nrOOXnq0fpGIBp2ld1FmMj3T4BI.jpg",
               "id": 74862,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "547b7af4c3a3685af90006f8",
               "name": "Joe Odagiri",
               "profile_path": "/dR7bz6PqdKiRVSbFPrhNavmr6kL.jpg",
               "id": 63694,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "547b7b31c3a3685af3000697",
               "name": "Masao Kusakari",
               "profile_path": "/qMt0muOdQorW2kj4ZDuP8Bdiqys.jpg",
               "id": 127394,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "547b7b399251412d8200079d",
               "name": "Eiji Okuda",
               "profile_path": "/phgV64iDNJ4x673CYLHK9aaNFii.jpg",
               "id": 72389,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "547b7b4f9251412d6d000771",
               "name": "Go Ayano",
               "profile_path": "/Ap5IuncBMYnABsvkEtsdoM92VTh.jpg",
               "id": 1084911,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "547b7b58c3a3685aed0008a9",
               "name": "Kikuo Kaneuchi",
               "profile_path": null,
               "id": 1369125,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "547b7b61c3a3685b00000848",
               "name": "Ken Mitsuishi",
               "profile_path": "/qdUdKjaT2Ho20JoB5ChnfnReN8z.jpg",
               "id": 120351,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe472dc3a36847f812765b",
            "name": "Makoto Tezuka",
            "profile_path": "/2AO9E61rv2uVdsdPrhZtuI9tGzV.jpg",
            "id": 565681,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.259508,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 47331,
      "vote_count": 4,
      "budget": 0,
      "overview": "Asuka is an aspiring model who moves to Tokyo to pursue her career. She moves into a small apartment with a friend of a friend, Kasumi. A bizarre murder occurs in the hotel across the street. The body was mutilated and repositioned into a lurid work of art. After this, a string of murders start happening all around the two girls, as if some crazed serial killer was following them. At the scene of each crime, the perpetrator leaves a black lip print, and is subsequently dubbed \"The Black Kiss.",
      "similar": [
         15069,
         30833,
         807,
         4771,
         75780,
         984,
         3597,
         357096,
         21484,
         9411,
         10359,
         11423,
         8090,
         1696,
         18587,
         26390,
         12150,
         979,
         281,
         395834
      ],
      "original_title": "Shinkuronishiti",
      "runtime": 133,
      "poster_path": "/b7VgMMQGxNK0gQr9Oor7QU6NXo2.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2004-10-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Macoto Tezuka"],
      "runtime": 133,
      "synopsis": null,
      "writers": ["Macoto Tezuka"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0493567/",
      "coverLink": null,
      "actors": [
         "Reika Hashimoto",
         "Kaori Kawamura",
         "Shunsuke Matsuoka"
      ],
      "reviews": [
         "After eyeing this DVD off in the stores here in humid Japan, I finally plonked down the 4,000 or so yen, and got myself a copy. I wasn't sure what exactly I was getting myself into, but I was interested in finding out what the son of Osamu Tezuka, Makoto Tezuka, could do. What I witnessed, was a visually stunning film, drenched with atmosphere, held back only by underdeveloped main storyline, or should I say, climax. To say that the story was bad is inaccurate. After the quite intense opening, I quickly learned that this film was going to offer much much more than a typical murder mystery; gory as it may be in parts, the characters are so interesting and enjoyable to observe, I almost forgot about the grisly slaying that punctuate the film throughout. In fact, when the climax did in fact arrive, it almost seemed to abrupt. Though the film clocks in at a little over two hours, so much time is spent soaking us beautiful imagery and tense atmosphere that the revelations in the final scenes seem out of the blue. Perhaps much more could have been done in regards to this, but seeing that this film had a rocky path to cinema release, perhaps some things were out of Mr Tezuka Junior's hands. As stated above, the film is shot wonderfully, with great colour compositions and clever visual arrangements. The use of CGI in the film is minimal, but it is high enough in quality to fool those of more literal mindsets. The sound design is also worth a mention, as it really adds to the dark and foreboding mood of the rain drenched glistening imagery, and cramped and cluttered spaces. Much has been said about Tezuka's references to other film makers in this film, particularly Hitchcock, but for what it's worth, it isn't a negative aspect. It isn't cheap, and I think it is a sincere attempt by the director to show us as film-goers just what makes him tick. The medical aspects of the story, perhaps echo Makoto's own upbringing, his father being a doctor originally, and I like to think that this film reflects his father's work much closer than people have assumed: an exploration of humanity, and human life. That is what I see this film is, and the murders are just an enabler for the real dissections to take place.",
         "This film was both a huge surprise and a slight disappointment at the very same time. I was stunned by the sustained suspense, the fascinating photography and some interesting elements of the editing, the ingenious sound/soundtrack, the solid acting, the art-style, characters and the story, which has kind of a B-movie vibe to it. I was simply amazed by this tense atmosphere! A perfect example how to stage such a thriller full of uncertainty, fear and suspicion. So, why then disappointment? Well, the horrible thing is that within the storyline, at the very end, weakness is concealed. Of course there are few other slight negatives, like some rare awkward moments when the acting felt kind of enforced. And also when the editing was really strange, when the plot jumped in an incomprehensible way to a total different place, so the story-flow felt kind of broken. But in contrary i have to say that there were sometimes ingenious moments of the editing when only few seconds were cut out; this had an interesting staccato effect. I wouldn't say that the story itself is that bad because throughout the film the storyline makes perfectly sense and is, combined with the masterly crafted atmosphere, very compelling. The only problem is that the ending feels rushed and the explanation was to me way too incomplete. I was just a bit dissatisfied after the long yet amazing buildup. I don't want to spoil anything, so i will keep my mouth shut about the precise fact why this solution was so insipid to me. But maybe other people won't be that bothered by it; it is still only my opinion. I just want to say that you should definitely watch this film if you already have an interest in it. Do not hesitate! You will definitely enjoy it! In many aspects i would even call it a masterpiece!! .. but .. it is just simply that .. damn solution!! ;)",
         "Two main gripes with this are one that my DVD box indicated a running time of 99 minutes whereas it runs to more than two hours and two, the denouement. The problem with the running time was that it just shouldn't have been that long and the ending well, I'll leave you to find that out and it won't worry you till the end anyway. There is much to be said for this gruesome and good looking film not least the convincing performances by the two female leads. They are both referred to as 'halves' and I assume that in reality both are Anglo/Japanese, which clearly helps their looks and hence the modelling career but seems to set up jealousies and dislikes along the way. There are some fantastic neon and rain drenched scenes, seemingly filmed around the Shinjuku district of Tokyo and imaginative soundtrack effects which are often most unnerving. Indeed the films begins amazingly well and then treats us to the most horrendously elaborate kill, its just that to maintain such a long running time, the twists and turns have to be such that in the end you feel slightly cheated.",
         "I came across this film without knowing much about it. It was listed as a thriller/horror movie, but yet made in Japan. So I gave it a shot and it was rather good. The plot can leave you guessing in a good way. You might think Kasumi is the killer or maybe Asuka. Hell, even the retired police chief seemed like a suspect for quite a while during the film. And that is what kept it interesting. The ending was not quite as I expected, but it wasn't bad. I was hoping for an even more twisted ending than what the writers chose. But them again, they had to explain the family connection of Kasumi. And if the ending didn't involve the family somehow, then it would have wasted a lot of time for nothing. Overall, its a good film. I am not your biggest thriller fan, but this was good. Japanese or not, its worth a look by anybody. \"B\"",
         "Catwalk model Asuka (Reika Hashimoto) witnesses a brutal murder in the building opposite the apartment she shares with rebellious ex-model Kasumi (Kaori Kawamura), and becomes a target of the vicious killer herself. Black Kiss has got a lot going for it: hot sex, gory violence, and plenty of weirdness—all positives in my book. But it's way, way too long, utterly confusing, very slow-going, and just a touch too green in hue for my liking. To make matters worse, the film is also guilty of failing to resolve the numerous questions raised by its many red herrings, false suspects, and quirky plot points (maybe I wasn't paying enough attention, but I never did understand the relevance of the number 9, which features so prominently). Oh, and while I'm getting things off my chest, I'd like to mention that star Reika Hashimoto is undeniably very hot, but being a 'haffu' (half Japanese/half Caucasian), her Western nose is just a touch too big for her Eastern face, something which distracted me from the plot. There's a slim chance I would have had more success following the storyline if I hadn't been quite so fixated on her disproportionate schnozz."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Neontetra"],
      "summaries": ["Asuka is an aspiring model who moves to Tokyo to pursue her career. She moves into a small apartment with a friend of a friend, Kasumi. A bizarre murder occurs in the hotel across the street. The body was mutilated and repositioned into a lurid work of art. After this, a string of murders start happening all around the two girls, as if some crazed serial killer was following them. At the scene of each crime, the perpetrator leaves a black lip print, and is subsequently dubbed \"The Black Kiss.\""],
      "budget": 0
   },
   "movielensId": 149494,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2004-10-01",
      "dvdReleaseDate": null,
      "directors": ["Makoto Tezuka"],
      "runtime": 133,
      "movieId": 149494,
      "title": "Black Kiss",
      "mpaa": null,
      "actors": [
         "Reika Hashimoto",
         "Kaori Kawamura",
         "Shunsuke Matsuoka",
         "Masanobu Ando",
         "Joe Odagiri",
         "Masao Kusakari",
         "Eiji Okuda",
         "Go Ayano",
         "Kikuo Kaneuchi",
         "Ken Mitsuishi"
      ],
      "imdbMovieId": "0493567",
      "originalTitle": "Shinkuronishiti",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Asuka is an aspiring model who moves to Tokyo to pursue her career. She moves into a small apartment with a friend of a friend, Kasumi. A bizarre murder occurs in the hotel across the street. The body was mutilated and repositioned into a lurid work of art. After this, a string of murders start happening all around the two girls, as if some crazed serial killer was following them. At the scene of each crime, the perpetrator leaves a black lip print, and is subsequently dubbed \"The Black Kiss.",
      "tmdbMovieId": 47331,
      "avgRating": 3,
      "releaseYear": "2004",
      "numRatings": 2,
      "posterPath": "/b7VgMMQGxNK0gQr9Oor7QU6NXo2.jpg"
   }
}