{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4737910",
      "video": false,
      "title": "The Unauthorized Full House Story",
      "recommendations": [
         76657,
         45759,
         287241,
         7514
      ],
      "backdrop_path": "/aIaCMFTdWzfMaqGzmBx6NPF1Tuw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bob Saget",
               "gender": 0,
               "credit_id": "55da1d8892514143e00055bf",
               "name": "Garrett Brawith",
               "profile_path": "/vKhNav7Ifa7YazmntOQYcB8ShNP.jpg",
               "id": 149793,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dave Coulier",
               "gender": 2,
               "credit_id": "55da1d94c3a36831f60055a9",
               "name": "Justin Mader",
               "profile_path": "/uwbsLVSfLWdUmI8jfGr9ddT9nwH.jpg",
               "id": 76514,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Lori Loughlin",
               "gender": 1,
               "credit_id": "5a128c6292514138f9064d29",
               "name": "Stephanie Bennett",
               "profile_path": "/7R0gGXuxVbW5Em0Eij78GIFhltw.jpg",
               "id": 1926630,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "John Stamos",
               "gender": 2,
               "credit_id": "55e70b2d9251410f040031d8",
               "name": "Justin Gaston",
               "profile_path": null,
               "id": 1504176,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Male Student",
               "gender": 2,
               "credit_id": "5799efddc3a3680e8800119c",
               "name": "Rohan Campbell",
               "profile_path": "/8n8iZZ6y5POdqkAtsrNAFVP9x6S.jpg",
               "id": 1196041,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Scott Weinger",
               "gender": 2,
               "credit_id": "5799fad0925141408e0033e9",
               "name": "Alexander Kambolis",
               "profile_path": "/2Stq1bA62csRg2E5FQ9VJLUmeKf.jpg",
               "id": 1657817,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Stage Manager",
               "gender": 2,
               "credit_id": "5799fcd492514112fb001960",
               "name": "Peter Kelamis",
               "profile_path": "/cU03ci49oMj6cZ6glQqIJDrp49p.jpg",
               "id": 89551,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Valeri Bure",
               "gender": 2,
               "credit_id": "5799fdf9c3a3680e88001cc7",
               "name": "Lucas Morgan",
               "profile_path": null,
               "id": 1657822,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55da1d5792514143f00053c6",
               "name": "Brian K. Roberts",
               "profile_path": null,
               "id": 1212136,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55da1d63c3a3683207005364",
               "name": "Ron McGee",
               "profile_path": null,
               "id": 132578,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57f563e5c3a36831d3000e78",
               "name": "C. Kim Miles",
               "profile_path": null,
               "id": 63785,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.327194,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 352209,
      "vote_count": 12,
      "budget": 0,
      "overview": "From its start as an unassuming family comedy in 1987 to its eventual wildly popular 192-episode run, the film centers on the rise of the cast of one of America's most beloved family sitcoms and the pressures they faced in balancing their television personas with their real lives.",
      "similar": [],
      "original_title": "The Unauthorized Full House Story",
      "runtime": 88,
      "poster_path": "/8nqFZHgfSW1LOBBZCiGbRJGgBVS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6LVLYfZAEQfhJey0MGvhFXdDEK1.png",
         "name": "Lifetime",
         "id": 3431,
         "origin_country": "US"
      }],
      "release_date": "2015-08-22",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian K. Roberts"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Ron McGee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4737910/",
      "coverLink": null,
      "actors": [
         "Garrett Brawith",
         "Justin Mader",
         "Justin Gaston"
      ],
      "reviews": [
         "Since its initial run I'm one of those unapologetic Full House fans. I adore the show and have watched it countless times any chance I get. I'm completely beside myself waiting for \"Fuller House\" next year so I was actually excited about Lifetime's latest attempt at making a mockery out of something I loved like they did with the Saved By The Bell story. That was bad but you can only expect bad from the Lifetime film. So my expectations were reasonable because I expected this to be absolutely terrible and guess what? It wasn't. I mean it wasn't great and its so far removed from a mainstream cinematic movie but it was watchable, entertaining, decently cast and covered a lot of ground. I'm sure some of it was not true and they twisted things to make it more dramatic but it was still sweet, showed them as a family and gave some basic insight to what behind the scenes might have been like. Probably the worst thing about these movies is that the cast has to try and literally BE the characters they portray. I think you can play a character without being a carbon copy of them. That being said, this cast actually does a decent job of looking, sounding and acting like the original people. It was fun and simple and actually paid homage to the original show. Garrett Brawith plays Bob Saget and I think he does a solid job. He captures Saget's nasty side in a PG movie and shows a real struggle with this role whether or not it was true or not. It showed how different he was than his counterpart. Justin Mader is Dave Coulier and while he doesn't get as much screen time it seems as the others, he certainly fits the role well. It would have been nice to have an actor that could do some of Coulier's voices or his comedy routines which you never hear at all (maybe due to rights and licensing?) Justin Gaston is really fantastic as John Stamos although I think (from what I've heard) Stamos was a little more demanding than what they portray here. Still he absolutely looks the role and even sounds the part and gets some decent scenes. Thankfully the three of them have good chemistry which is vital to this story. They actually look like they get along just like Saget, Coulier and Stamos did and still do. Stephanie Bennett has a very small role as Lori Loughlin, Shelby Armstrong is very good as the younger DJ, Dakota Guppy, Blaise Todd, Kinslea Todd, Calla Jones, Tyla Jones, Kylie Armstrong, and Jordan Armstrong all fulfil their roles well. They have small roles but they look the part and it works. Director Brian Roberts comes from a lot of Television and that might be good for the idea behind the film but it also tends to make the movie feel a little disjointed. When they go off into Mary Kate and Ashley Olsen's contract and how that affected the show, it feels rushed when it was probably such an important part of the back story. Still there was really nothing else left un-turned in the movie. I don't think it was shocking at all or disrespectful. The Full House cast tweeted how bad this was but it does nothing to them and keeps their reputations in tact, doesn't attack anyone and the only person I thought came out of it looking like a jerk was Matthew Kevin Anderson as Jeff Franklin. It made his goodbye speech seem odd because he acted like he was angry and hated them up until that point. This was heads and tails above the Saved By The Bell film and its made quickly to appease us viewers that want something dumb to watch. Lifetime is what it is, you should know what to expect. 6.5/10",
         "Pretty interesting account showcasing the lives of the FULL HOUSE cast while the hit series was in production from 1987–1995 (and book-ended by relevant events outside of the show's run), with a primary focus on Stamos (Gaston), Coulier (Mader) and Saget (Brawith). Very well-casted, and its pacing is impressively smooth. A main setback is the lack of major conflict warranting such a \"dramatic story\". It's also a bit strange how the characters can say they wish their real lives were as simple as FULL HOUSE when the show was about a young widower and his three motherless daughters.... Still, kudos to the attention to detail—they even make sure to cover Posey as Danny Tanner in the unaired pilot. ★★★ (out of four)",
         "Although a dramatization, it's always nice to see what people are really like and not the characters they may be typecast as after a long running TV show. The movie focuses more on the adults than the children. Special attention is paid to Bob Saget and his history before the show and concerns and antics during it. Dave Coulier's extra talents get limited attention and John Stamos is portrayed as the playboy that isn't taken seriously. The movie didn't get his oversized mullet from the first season right but that's a minor complaint. The acting wasn't bad so very watchable for a TV movie if this was a show you watched when it aired and wanted to know some of the real people and personalities involved outside the camera lens.",
         "Just plain horrible! There are things about Bob Sagat I just didn't need to know! The guys acted less mature than the girls (kids)! If it was really like that in real life, that's sad... just plain sad. Horrible movie! May have ruined Full House for me, but I will try to watch it and forget this movie. 😬 Okay guess it needs more words so terrible worst movie I've ever seen. I love full house but hate this movie. Guys don't seriously act that way in real life do they if they do that pathetic. Not a fan of Bob Sagat anymore if he truly acted that way. Ugh Seriously I have to add more than this for the post to count! Why do I have to say so much???",
         "The \"Unauthorized Full House Movie\" from Lifetime is so bad I feel like quoting Roger Ebert's review of \"North\" but I don't want to sully the man's memory by pairing him with this lousy movie! Justin Mader as Dave Coulier and Joey Gladstone is just horrible! I thought this movie would show the real man as a funny guy who was doing material beneath him, but God, I was wrong! This movie portrayal of Dave Coulier shows a guy who can't control his gas and who tells awful jokes. Garrett Brawith does have a Bob Saget vibe about him but he is so dirty and seems proud of it! Justin Gaston as John Stamos does resemble the real actor and so does Dakota Guppy as young Jodie Sweetin. This movie shows the Olsen twins as 2 year old girls who shared the role of Michelle, but Michelle was a baby of a few months old when the show started and she had no lines to learn. The house looks nothing like the original and this movie has no drama to it! I think they should have done a movie about Jodie Sweetin because with her there was drama! Her book talks about her drug abuse and alcoholism and the custody fights she had with both ex-husbands. Now, I would watch that!",
         "I haven't seen one of these \"unauthorized\" TV movie of the weeks about a TV show in quite some time, so got around to watching this new made-for- Lifetime TV the other day, and it's a hoot! I remember watching \"Full House\" when it was on ABC from early 1988 as a mid season replacement to the Spring of '95 when it was finally cancelled. I never watched faithfully, and quite honestly the show annoyed the hell out of me, but I think there were some others in my family who watched, and I just happened to be in the room. If you watch this movie, the show seemed to annoy some of the cast members as well, especially Bob Saget, who's humor seemed to be more down the road of dark/adult persuasion. LOL. But even though I hated the original show, I was actually quite amused by this movie- laughing more at it than with it I'd say..?? But yes, it is pretty bad, but I think you'll still have fun, especially with it bringing back some memories from a time...you probably never wish to visit again...LMAO"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bay Road Productions",
         "Bay Road Productions",
         "Front Street Pictures"
      ],
      "summaries": ["From its start as an unassuming family comedy in 1987 to its eventual wildly popular 192-episode run, the film centers on the rise of the cast of one of America's most beloved family sitcoms and the pressures they faced in balancing their television personas with their real lives."],
      "budget": 0
   },
   "movielensId": 149582,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-08-22",
      "dvdReleaseDate": null,
      "directors": ["Brian K. Roberts"],
      "runtime": 88,
      "movieId": 149582,
      "title": "The Unauthorized Full House Story",
      "mpaa": "",
      "actors": [
         "Garrett Brawith",
         "Justin Mader",
         "Stephanie Bennett",
         "Justin Gaston",
         "Rohan Campbell",
         "Alexander Kambolis",
         "Peter Kelamis",
         "Lucas Morgan"
      ],
      "imdbMovieId": "4737910",
      "originalTitle": "The Unauthorized Full House Story",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "From its start as an unassuming family comedy in 1987 to its eventual wildly popular 192-episode run, the film centers on the rise of the cast of one of America's most beloved family sitcoms and the pressures they faced in balancing their television personas with their real lives.",
      "tmdbMovieId": 352209,
      "avgRating": 2,
      "releaseYear": "2015",
      "numRatings": 2,
      "posterPath": "/8nqFZHgfSW1LOBBZCiGbRJGgBVS.jpg"
   }
}