{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italian",
            "id": 924
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "pre-code",
            "id": 156764
         },
         {
            "name": "aviator",
            "id": 169814
         }
      ],
      "imdb_id": "tt0021633",
      "video": false,
      "title": "The Bachelor Father",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Antoinette 'Tony' Flagg",
               "gender": 1,
               "credit_id": "52fe4ee09251416c7516564b",
               "name": "Marion Davies",
               "profile_path": "/tprYuX0944egt854y6JFnZeW2AT.jpg",
               "id": 34742,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Ashley",
               "gender": 2,
               "credit_id": "52fe4ee09251416c7516564f",
               "name": "Ralph Forbes",
               "profile_path": "/iA6a0NmQM7gGIFO75VMayBh09N9.jpg",
               "id": 47178,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sir Basil Algernon 'Chief' Winterton",
               "gender": 2,
               "credit_id": "52fe4ee09251416c75165653",
               "name": "C. Aubrey Smith",
               "profile_path": "/u00cKiTSCbCeFLaTPL6ykgqB5AB.jpg",
               "id": 2438,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Geoffrey Trent",
               "gender": 2,
               "credit_id": "52fe4ee09251416c75165657",
               "name": "Ray Milland",
               "profile_path": "/zB7jGIBc6dc3fMqCpXlCDZxQrll.jpg",
               "id": 7124,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Richard 'Dick' Berney",
               "gender": 2,
               "credit_id": "52fe4ee09251416c7516565b",
               "name": "Guinn Williams",
               "profile_path": "/nJgaxVjWnS64wCNFQ1MnqeHjvRP.jpg",
               "id": 95276,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Frank 'Mac' MacDonald",
               "gender": 2,
               "credit_id": "52fe4ee09251416c7516565f",
               "name": "David Torrence",
               "profile_path": "/cejygbRMOBNOVy6wlp78P0TddaT.jpg",
               "id": 32139,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mrs. Julia Webb",
               "gender": 1,
               "credit_id": "52fe4ee09251416c75165663",
               "name": "Doris Lloyd",
               "profile_path": "/4QJ0iSrOQ9rwfgEaDnqTaXem6c5.jpg",
               "id": 21878,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Bolton, the Second Butler",
               "gender": 0,
               "credit_id": "52fe4ee09251416c75165667",
               "name": "Edgar Norton",
               "profile_path": "/pZclnxshBQ2zG5SXePY6taySWIm.jpg",
               "id": 29602,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Maria Credaro",
               "gender": 0,
               "credit_id": "54059463c3a36816af0033d9",
               "name": "Nina Quartero",
               "profile_path": "/1QBVSNSii7qNDFBjtNfDkpxZgiq.jpg",
               "id": 589727,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Larkin, the Butler",
               "gender": 2,
               "credit_id": "52fe4ee09251416c7516566b",
               "name": "Halliwell Hobbes",
               "profile_path": "/nLubN58cxw9GgYnzY5IXFWqmnRz.jpg",
               "id": 29601,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Mrs. 'Aunt Molly' Berney",
               "gender": 0,
               "credit_id": "5641b14d92514128a600237a",
               "name": "Elizabeth Murray",
               "profile_path": null,
               "id": 1533977,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Mr. Carson Creswell, a Lawyer",
               "gender": 0,
               "credit_id": "5641b1bc92514128b2002326",
               "name": "James Gordon",
               "profile_path": null,
               "id": 1327229,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ee09251416c75165647",
               "name": "Robert Z. Leonard",
               "profile_path": "/w6wkz4NRYhhOTWqVjXvoHAWj6yQ.jpg",
               "id": 93906,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54059346c3a368119c0036fc",
               "name": "Laurence E. Johnson",
               "profile_path": null,
               "id": 148511,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5405935bc3a368068c007f79",
               "name": "Edward Childs Carpenter",
               "profile_path": null,
               "id": 1287880,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 1,
               "credit_id": "54059373c3a368119c003700",
               "name": "Marion Davies",
               "profile_path": "/tprYuX0944egt854y6JFnZeW2AT.jpg",
               "id": 34742,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54059388c3a3682d980068bf",
               "name": "Robert Z. Leonard",
               "profile_path": "/w6wkz4NRYhhOTWqVjXvoHAWj6yQ.jpg",
               "id": 93906,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "540593adc3a36843660081f2",
               "name": "Harry Reynolds",
               "profile_path": null,
               "id": 114827,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "540593c8c3a3684363007e4b",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "540593dec3a368119c003707",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "54059413c3a3684372007e2a",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 2,
               "credit_id": "555341f3c3a3686343001799",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.328982,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 229005,
      "vote_count": 1,
      "budget": 0,
      "overview": "Lonely in his English country estate, Sir Basil decides to gather his grown (albeit illegitimate) children around him in his declining years. He uses a ledger which keeps track of the payments he has been making to ex-lovers to locate 2 of them, and a third is found by a lawyer in New York, her mother was too proud to accept any money. Sir Basil is a curmudgeon, and his three adult children have a hard time with him at first. Toni, the American, is a free spirit who had a budding career in show business. Jeffery is English and a semi-gentleman, and Maria is Italian, with a Latin temperament. They begin to bond, especially Sir Basil and Toni, whose outgoing personality finally wins over the old man. But past lives begin to creep back into the picture and threaten the old man's plans for a life filled with his children.",
      "similar": [
         1645,
         9800,
         112160,
         205587,
         13,
         59,
         389,
         314365,
         634,
         396371,
         392982,
         1607,
         11216,
         1813,
         1547,
         1574,
         1592,
         819,
         2770,
         9798
      ],
      "original_title": "The Bachelor Father",
      "runtime": 90,
      "poster_path": "/7JljSonb9Wrdrf2Pz9KOTR6CCL1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cosmopolitan Productions",
            "id": 1442,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1931-01-10",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Robert Z. Leonard"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Edward Childs Carpenter",
         "Laurence E. Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021633/",
      "coverLink": null,
      "actors": [
         "Marion Davies",
         "Ralph Forbes",
         "C. Aubrey Smith"
      ],
      "reviews": [
         "This 1931 comedy gets better with every viewing because of the comedic talents of Marion Davies and a terrific performance by C. Aubrey Smith. Smith plays a gruff old man who gathers his grown children (from his younger days as a rake) in his declining years. One is American (Davies), one English (Ray Milland who looks about 18), and one Italian (Nina Quartero). There are some surprises as the plot moves along with Ralph Forbes(was has no appeal at all) falling for Davies. Davies and Smith are just wonderful together and very touching. Davies also gets to do a few dances and make a few \"big\" entrances. And of course Davies is just gorgeous. Halliwell Hobbes, Doris Lloyd, Elizabeth Murray, Guinn Williams, Edgar Norton, and David Torrence co-star. Had they given out supporting Oscar awards in 1931, Smith might well have been nominated. He's just excellent in this this gem.",
         "A grumpy old baronet, happily unmarried, decides to send for his three grown-up illegitimate children and provide them a home at his manor. To his surprise, he finds himself bonding with his uninhibited American daughter. Can he find satisfaction in his new role as THE BACHELOR FATHER? This 1931 film, in which he gives a robust performance, marked the arrival at MGM of elderly Sir C. Aubrey Smith, very soon to be one of Hollywood's most valuable character actors. With his great hooked nose & beetling brows, Sir Aubrey looked every inch the part of the duke or general or statesman he would play so often. The acknowledged leader of the British community in Hollywood, Sir Aubrey would also champion the game of criquet in Southern California. He would remain very much in demand in studios all over town, right up to his death in 1948. The film's top-billed star is Marion Davies. Best remembered today as the mistress of media mogul William Randolph Hearst & the chatelaine of Hearst Castle, the most fabulous residence on the West Coast, she was actually a very talented & pretty comedienne. For a few years, Hearst attempted to make her the queen of MGM (with her own production company & a huge bungalow-dressing room) but the studio already had several other queens - Dressler, Garbo, Shearer, Crawford - and he eventually moved her to Warner Bros. Here Miss Davies gets a chance to joke & clown and her scenes with Sir Aubrey are entertaining. Her love interest is played by Ralph Forbes, a handsome young British actor who was just starting to find good films (THE TRAIL OF \u009198) as the silent days ended. He had all the qualities for major stardom, but sadly it was not to be. Celebrity would come to Ray Milland, here making one of his first screen appearances. Halliwell Hobbes & Doris Lloyd also appear to advantage.",
         "This delightful, well written film is based on a New York stage play bearing the same title where Sir Aubrey (knighted Sir Charles Aubrey Smith in 1944) originated the role he plays in the film. Here, in 1931, we see him in the early part of his acting renaissance in the very early era of \"talkies\" and in the character role that he would make his own until his death in 1948 after finishing his last performance in Little Women which released in 1949. This engaging play is about an elderly British aristocrat who locates his illegitimate children and introduces himself to them, having brought them to his manor in England. Marion Davies plays his daughter-by-error and it's a tour de force for her. She is all at once endearing, impatient, shallow, enchanting, wise and compassionate while creating an indelible and beguiling character that remains well ensconced in the memory. The 26 year old Ray Milland appears here in a small but prominent role having already appeared in seven other pictures then only in films for a bit more than two years. The film should be enjoyed as a representative of 1931 Hollywood factory production of course and as such is not flawless. However, it's a charming pleasure from first scene to the last.",
         "This is one of the better Marion Davies talkies - and one of the few to allow her to exhibit her skill as a physical comedian which was so endearing in her silent films. OK, so she does a clunky tap number, but even Ruby Keeler's dancing from the era does not hold up for younger generations. The problem here is the script. The story falls into unbelievable melodrama in the last reel. It's quite stagey, and is obviously adapted from a play... but not well enough. Still, there is some snappy dialogue and slapstick throughout. Worth a look.",
         "toplines this ok comedy about an aging father (C. Aubrey Smith) who decides to gather his grown children from around the world. Davies is working as a chorus girl in New York when she gets the news that \"daddy\" wants her. Hmmmm, sounds familiar. Davies' considerable talents as a comedienne save this otherwise so-so comedy as she upsets the staid British countryside with her brazen American personality. Not as sharp as some other Davies comedies, but still worth a look. Ray Milland plays her long-lost \"brother.\" Doris Lloyd, Elizabeth Murray, and Halliwell Hobbes are all fun, too.",
         "Perhaps the most unusual aspect about The Bachelor Father is the fact that the subject matter entailed has rarely been exploited in more recent,\"enlightened\" times to this extent, unless as a comedy where the man is befuddled by children (way too many of those types). C. Aubrey Smith is outstanding as Sir Basil Algernon \"Chief\" Winterton, a crusty old rake who desires to gather his illegitimate children together now that he's reached his elder years. The problem is one of these children, Marion Davies as Antoinette \"Tony\" Flagg, is not really his child. While Davies is enchanting enough, her films are generally not up to \"A\" picture status because they're usually missing the support of such actors as Smith. Davies is charming, enchanting, and genuine in this film. The film has a common theme found in many Depression era films, which is someone being elevated or rescued beyond or from financial/social status. With this in mind, it's easier to forget the contrived nature of the characters developed and plots resolved from this period. The highlights of the film are the interactions between Davies and Smith. Ralph Forbes as John Ashley, Guinn \"Big Boy\" Williams as Richard Berney, and a very young Ray Milland as Geoffrey Trent are pretty much window dressing in a film based on a stage play by Edward Childs Carpenter. Robert Z. Leonard directed and co-produced with Davies. This pre-Hayes code film was originally banned and/or had dialog censored during its initial run. **1/2 of 4 stars.",
         "Although a casual viewing might have one concurring on the children being born out of wedlock, there is at least one mention later in the movie about a divorce. If one divorce is in place, three can be fairly assumed, and thus, of course, three marriages. // My real complaint is not about this movie at all, but rather, about a much more well-known and acclaimed movie: Orson Wells' \"Citizen Kane\". Kane, assumed by all to be a fictionalized William Randolph Hearst, marries an untalented girl, and uses his money and power to promote her career, to the embarrassment of all concerned. The closest this wife character comes to a real-life person is Marian Davies. By the time someone is reading this, they are fully aware that Ms Davies is actually very talented, but because Orson Wells' film is so much more well known than the entire output of Ms. Davies, there is virtually a sub-culture with a completely wrong idea of Marian Davies and her talent.",
         "Movies come in many genres and cover life from the common, everyday, to the dreamlike fantasy, to the very unusual. Even within these there are so many variations. \"The Bachelor Father\" falls into that category of unusual. It's about a senior Englishman of status who never married, but who had a number of romances in the past. He wasn't a playboy who had uncounted one-night stands. His were romances of some duration, for which he had memories – good and not so good. In the case of three such liaisons, he kept records. They resulted in having children born out of wedlock. He wouldn't marry the women, but he would provide support for their children. This is a so-called \"pre-code\" film that has nothing risqué or taboo about it. Some films were that way. And the effect the Hays Code had after 1934 – especially on comedy, was quite good. It led to better writing and directing that resulted in much better comedy for many films. But with this pre-1934 Hays enforcement film, the only \"daring\" aspect was just in having the subject of the film. Today this would be a G-rated movie. In 1931, it shouldn't have even raised eyebrows over dress, language or behavior on film. But, the plot was enough to raise eyebrows back then. A man who fathered three children out of wedlock, and by three different women was scandalous enough. That it would be treated so lightly probably is what drew any criticism. So, now this life-long bachelor is getting on in age, and he wants to meet his children and have them share some time with him. One or more of them will one day inherit his English estate. On this basis, the story of \"The Bachelor Father\" unfolds. And, it's a delightful one indeed. One must remember that this is very early in the sound era – talkies had been around just two years. The technical equipment and cinematography were yet evolving from the silent era. Many actors still showed characteristics of the silent film acting, which was overacting. So, the sound and other technical qualities are lacking; and some of the acting is stiff or rudimentary. But, the story and interaction between the various characters is delightful. Other reviewers have noted the major role of C. Aubrey Smith. I too think he was one of the most enjoyable character actors for years in the heyday of Hollywood. Here he plays a perfect Sir Basil Winterton. I think he dominates the scenes he is in, even when Marion Davies' role draws the attention with her lines and actions. Ralph Forbes is very good as John Ashley, and Davies is very good in her role as Tony Flagg. A very young Ray Milland seems a bit wooden as Geoffrey Trent. It was only his fourth credited film (ninth overall). The rest of the cast all are very good. There are no witty exchanges or clever funny lines in \"The Bachelor Father.\" Rather, its comedy comes just in the interaction between the players. The film's rough qualities are offset some by its portrayal of the qualities of early Hollywood transition to sound. In that it has some historic value. I think the story is interesting enough (a bold one of sorts, for sure) and the acting good enough to rate it six stars. But I am surprised at the high overall rating by viewers as of the time of my writing here – in June 2015. I can't believe that so many viewers (of the 840 at this time) think this movie is on a par with or better than such great comedies as \"Love Crazy\" (1941), \"It's Love I'm After\" (1937), \"Easy Living,\" (1937), \"The Ex-Mrs. Bradford\" (1936), \"Holiday\" (1938), \"It Started with Eve\" (1941), \"Merrily We Live\" (1938), \"My Favorite Wife\" (1940), or dozens more of truly great comedies. This is a good comedy and look at Marion Davies, C. Aubrey Smith and other fine actors of the day. And a look at a young Ray Milland who's acting would grow by leaps and bounds to make him a leading star for more than four decades.",
         "Attracted to this by discovering the free and easy joys of Pre-code, which I take to be up to 1934, movies, I was surprised by some clumsily handled late information inserted into the film; For the entire film there has been the breezy exposition that Sir Basil (C. Aubrey Smith) has had a widely travelled early life and fathered children all over with women he seems to barely remember in most cases, referring to a log book of his conquests. He is a BACHELOR FATHER! Everyone, included his rediscovered grown-up children seem to accept this without judgment. Then late in the piece Sir Basil is meeting with his lawyer and there is a mumbled exchange about documents and Sir basil refers to 'the fourth divorce'. So, we are suddenly meant to say to ourselves \"oh, he was married all the times of these offspring's!\" This is quite jarring to the spirit of the film and seems like the type of compromise forced into scripts after the full enforcement of the Production Code in later years. I'd be curious to learn whether this information was in the original play.",
         "Mercifully, sound has improved tremendously from the early days of \"talkies\"--most of them based on very static stage plays. THE BACHELOR FATHER is no exception. The only thing it has going for it is a chance to enjoy SIR C. AUBREY SMITH in a delightfully crusty aristocratic role, the kind he was born to play. He does make a fuss over his American daughter--MARION DAVIES in her usual cutie-pie mode, that looks a little out of bounds at times. She's occasionally endearing, but not that endearing! The very British RALPH FORBES plays one of his sons without managing to exhibit any matinée idol charm, while RAY MILLAND--with much less to do--is strikingly attractive in a minor role as another son. But the action rests mainly on the interaction between C. Aubrey Smith and his plucky daughter--and fans of Miss Davies will no doubt welcome seeing her even though the material is not especially compelling. Without C. Aubrey Smith, this would be a real dud.",
         "Bachelor Father, The (1931) ** (out of 4) A mix of drama and comedy in this pre-code from MGM. An aging man, Sir Basil (C. Aubrey Smith) has been a bachelor from day one. Throughout his rich life he traveled the world and ended up having three kids by three different women. He hadn't had any contact with them but now he wants all three to come live with him with one (Marion Davies) who might not be who she thinks she is. It's really amazing to see some early talkies that sound extremely bad and this here is one such example. I'm really not sure what was going on in 1931 but we have a wide range of sound quality in various films but what's here is perhaps the worst I've heard. There isn't much hiss in the soundtrack but at times it appears the dialogue and sound completely drop off. Just take a look at an early scene where the three kids and their father are getting to know one another. As one character moves away, while talking, the dialogue gets lower and lower until you can't hear what's being said. I'm not sure if this was because of her walking away from the mic or what but it's very distracting. Like many early talkies, this one here is based on a famous play and the film just contains way too much talk. The pre-code nature of a man having kids all over the world is something mildly amusing and we get a couple naughty jokes out of it. The drama in the \"twist\" isn't really anything special and adds very little to the film. Davies turns in a pretty good performance even though the screenplay really doesn't give her too much to work with. We have Ray Milland in a minor role as well as Ralph Forbes. The main reason to watch this film is the performance by C. Aubrey Smith who really seems to be having a good time in the role. He manages to be quite touching and funny. In the end however, there's just not enough here to make the film work as well as it could have. Fans of the actors are the only ones who will want to check this one out."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cosmopolitan Productions",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": [
         "Lonely in his English country estate, Sir Basil decides to gather his grown (albeit illegitimate) children around him in his declining years. He uses a ledger which keeps track of the payments he has been making to ex-lovers to locate 2 of them, and a third is found by a lawyer in New York, her mother was too proud to accept any money. Sir Basil is a curmudgeon, and his three adult children have a hard time with him at first. Toni, the American, is a free spirit who had a budding career in show business. Jeffery is English and a semi-gentleman, and Maria is Italian, with a Latin temperament. They begin to bond, especially Sir Basil and Toni, whose outgoing personality finally wins over the old man. But past lives begin to creep back into the picture and threaten the old man's plans for a life filled with his children.",
         "Old man invites three of his illegitimate children to live with him."
      ],
      "budget": 502000
   },
   "movielensId": 149558,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-01-10",
      "dvdReleaseDate": null,
      "directors": ["Robert Z. Leonard"],
      "runtime": 90,
      "movieId": 149558,
      "title": "The Bachelor Father",
      "mpaa": "",
      "actors": [
         "Marion Davies",
         "Ralph Forbes",
         "C. Aubrey Smith",
         "Ray Milland",
         "Guinn Williams",
         "David Torrence",
         "Doris Lloyd",
         "Edgar Norton",
         "Nina Quartero",
         "Halliwell Hobbes",
         "Elizabeth Murray",
         "James Gordon"
      ],
      "imdbMovieId": "0021633",
      "originalTitle": "The Bachelor Father",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lonely in his English country estate, Sir Basil decides to gather his grown (albeit illegitimate) children around him in his declining years. He uses a ledger which keeps track of the payments he has been making to ex-lovers to locate 2 of them, and a third is found by a lawyer in New York, her mother was too proud to accept any money. Sir Basil is a curmudgeon, and his three adult children have a hard time with him at first. Toni, the American, is a free spirit who had a budding career in show business. Jeffery is English and a semi-gentleman, and Maria is Italian, with a Latin temperament. They begin to bond, especially Sir Basil and Toni, whose outgoing personality finally wins over the old man. But past lives begin to creep back into the picture and threaten the old man's plans for a life filled with his children.",
      "tmdbMovieId": 229005,
      "avgRating": 4,
      "releaseYear": "1931",
      "numRatings": 1,
      "posterPath": "/7JljSonb9Wrdrf2Pz9KOTR6CCL1.jpg"
   }
}