{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0243222",
      "video": false,
      "title": "The Doe Boy",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Hunter",
               "gender": 2,
               "credit_id": "54538de9c3a368147c001360",
               "name": "James Duval",
               "profile_path": "/ydlb3Rp5vkle9codpcfBWxFmUYr.jpg",
               "id": 1582,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Hank",
               "gender": 2,
               "credit_id": "54538e7b0e0a2648c800142f",
               "name": "Kevin Anderson",
               "profile_path": "/roCItER7LbrJJvAV1Fku3jG9g8k.jpg",
               "id": 51805,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Young Hunter",
               "gender": 0,
               "credit_id": "545391b7c3a3681484001473",
               "name": "Andrew J. Ferchland",
               "profile_path": null,
               "id": 1228811,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Maggie",
               "gender": 0,
               "credit_id": "545391d00e0a2648c20014a3",
               "name": "Jeri Arredondo",
               "profile_path": null,
               "id": 162574,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Geri",
               "gender": 0,
               "credit_id": "545391f8c3a3681480001488",
               "name": "Judy Herrera",
               "profile_path": null,
               "id": 102314,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Marvin",
               "gender": 2,
               "credit_id": "545392100e0a2648d6001410",
               "name": "Gordon Tootoosis",
               "profile_path": "/l10aLDp4D8ZwWdmfRdlj6FedUYk.jpg",
               "id": 37430,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Junior",
               "gender": 2,
               "credit_id": "545392bdc3a3681473001461",
               "name": "Nathaniel Arcand",
               "profile_path": "/eh4mavNMo55nWRg8IZc3havwbZc.jpg",
               "id": 60722,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Oliver",
               "gender": 0,
               "credit_id": "545392d30e0a2648c80014bd",
               "name": "Orvel Baldridge",
               "profile_path": null,
               "id": 1380041,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Manny",
               "gender": 2,
               "credit_id": "545392ed0e0a2648c80014c4",
               "name": "Gil Birmingham",
               "profile_path": "/hbcG5tET6HMacNRKimbfsG6XRkX.jpg",
               "id": 84225,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Bear",
               "gender": 0,
               "credit_id": "5453930c0e0a2648c80014c7",
               "name": "Norman Brown",
               "profile_path": null,
               "id": 1379847,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Young Cheekie",
               "gender": 0,
               "credit_id": "54539325c3a368146f001389",
               "name": "Kody Dayish",
               "profile_path": null,
               "id": 1380042,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Cheekie",
               "gender": 0,
               "credit_id": "5453933bc3a36814840014a0",
               "name": "Robert A. Guthrie",
               "profile_path": null,
               "id": 938284,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Kristy",
               "gender": 0,
               "credit_id": "545393530e0a2648cb0014d0",
               "name": "Lusheia Lenaburg",
               "profile_path": null,
               "id": 1380043,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Tattoo Artist",
               "gender": 0,
               "credit_id": "5453936bc3a368148800160c",
               "name": "Raven Letterman",
               "profile_path": null,
               "id": 1380044,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Dr. Moore",
               "gender": 2,
               "credit_id": "5453938cc3a3681488001613",
               "name": "Jim Metzler",
               "profile_path": "/tOxegcIdJ3VTixb63oSlJODMnFp.jpg",
               "id": 79740,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Mrs. Jensen",
               "gender": 0,
               "credit_id": "545393acc3a368148d001474",
               "name": "Gayle Piester",
               "profile_path": null,
               "id": 1380045,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Bird",
               "gender": 1,
               "credit_id": "545393c9c3a368146f001396",
               "name": "Alex Rice",
               "profile_path": null,
               "id": 173866,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Tommy Deer in Water",
               "gender": 0,
               "credit_id": "545393e8c3a3681478001420",
               "name": "James Smith Jr.",
               "profile_path": null,
               "id": 1380046,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "Young Junior",
               "gender": 0,
               "credit_id": "54539404c3a3681473001485",
               "name": "Kyle White",
               "profile_path": null,
               "id": 1380047,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54538a37c3a36814800013c2",
               "name": "Randy Redroad",
               "profile_path": "/nYL80vFjnoIDD2OitsndxmeeB49.jpg",
               "id": 1328221,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54538a4f0e0a2648d90013e5",
               "name": "Randy Redroad",
               "profile_path": "/nYL80vFjnoIDD2OitsndxmeeB49.jpg",
               "id": 1328221,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54538a9b0e0a2648d90013e9",
               "name": "Chris Eyre",
               "profile_path": "/4CYFLwcINhiSn8kUmIxqo6muLMC.jpg",
               "id": 1232592,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54538abbc3a368147c0012f4",
               "name": "Anthony Vozza",
               "profile_path": null,
               "id": 1380030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54538adec3a368147300139d",
               "name": "Randy Redroad",
               "profile_path": "/nYL80vFjnoIDD2OitsndxmeeB49.jpg",
               "id": 1328221,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54538b090e0a2648d6001346",
               "name": "Jennifer Newell-Easto",
               "profile_path": null,
               "id": 1380031,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54539712c3a36814730014c0",
               "name": "Adam Dorn",
               "profile_path": null,
               "id": 1380048,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5453978c0e0a2648cf0014b7",
               "name": "Matthew Booth",
               "profile_path": null,
               "id": 60592,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "545397ad0e0a2648c2001517",
               "name": "Rene Haynes",
               "profile_path": null,
               "id": 959072,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "545397ce0e0a2648c800152e",
               "name": "Debbie DeVilla",
               "profile_path": null,
               "id": 1380052,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "545397fdc3a3681484001507",
               "name": "Laura Ballinger",
               "profile_path": null,
               "id": 5390,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "545398230e0a2648c500152a",
               "name": "Erin Lenk",
               "profile_path": null,
               "id": 1380054,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "545398480e0a2648d600148f",
               "name": "Patia Prouty",
               "profile_path": null,
               "id": 1380055,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "545398be0e0a2648d9001523",
               "name": "Jackson Burns",
               "profile_path": null,
               "id": 1380056,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58d1389b9251411ae800bd17",
               "name": "László Kadar",
               "profile_path": null,
               "id": 1380049,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.005041,
      "production_countries": [],
      "id": 73526,
      "vote_count": 0,
      "budget": 0,
      "overview": "A Cherokee boy is a haemophiliac in a culture obsessed with blood identity.",
      "similar": [],
      "original_title": "The Doe Boy",
      "runtime": 85,
      "poster_path": "/6QhpNKyWNKA9RyVve9zKDvkqH5T.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2001-01-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Randy Redroad"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Randy Redroad"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0243222/",
      "coverLink": null,
      "actors": [
         "James Duval",
         "Kevin Anderson",
         "Andrew J. Ferchland"
      ],
      "reviews": [
         "I am deeply in love with this film, and each time I watch it I love it even more. I truly look forward to seeing more from its writer/director, Randy Redroad. I fear that, living outside of America, however, I may have trouble finding his work... but I hope this will not be the case! From beginning to end, \"The Doe Boy\" exudes a powerful, yet non-sensationalistic and understated spirituality that many films would do well to emulate. The story concerns Hunter, a mixed-blooded Cherokee/White young man with haemophilia (\"a white man's disease\"), and his struggle for identity and for a sense of power over his life. Throughout the film he struggles with a difficult relationship with his father, made worse by Hunter's inability to play sports, to help his father work on his car, or to, as his name suggests, hunt (which is also a favourite pastime of his father). Along the way his grandfather, a full-blood Cherokee, gently assists him by telling him tales of their history and explaining his own way of viewing the world. Hunter's father manages to persuade Hunter's overprotective mother to allow him to take Hunter deer hunting and Hunter, thinking he sees a buck, instead commits the social faux pas of killing a female deer, earning him the nickname of \"Doe Boy\". Giving away further details may lessen the experience of the first viewing, so I will not describe the other major plot developments that take place in this film, except to say that Hunter is left even more alone and powerless in this world, and calls upon the strength and wisdom of his grandfather to guide him to find the inner strength, courage and self-reliance to take the hand life has dealt him, and to become a true warrior and Cherokee brave. I am still unclear as to the implications of the ending, however that does not make me love this film any less; perhaps the film maker intended to leave the ending somewhat open, given the nature of the events and circumstances that preceded it. Without a doubt, this film - as beautiful, deep and soulful as the warpainted eyes of James Duval as the Cherokee brave of some of the final scenes of the film - is a must-see for any fan of James Duval or of modern, Native American-themed cinema. As a fan of both, I would like to thank both Mr Redroad and all the people who participated in the making of this film, for making available something so beautiful and touching, for the world to experience. I believe that James Duval may well be remembered for the role of Hunter Kirk for the rest of his career. This is a truly beautiful film, which I would very, very highly recommend.",
         "Randy Redroad's 'debut' is astounding. The story is subtle but incredibly strong and emotionally-charged. It's about the struggles of self-identity, father-son relationships, reconciliation, and healing. There is no melodrama or cliché in this film-- it's entirely refreshing. The dialogue is terrific-- often hilarious, never trite. James Duval totally possesses his character and draws you into Hunter's story-- his performance is really beautiful. Anyone at all who's mixed-blood in some way can strongly relate to this story, but I think its detailed uniqueness actually reaches that point of being universally accessible. I don't think anyone can see this film without relating with Hunter or caring immensely what happens. This is one of those 'must-see/must-have' films for anyone who values good stories.",
         "Talk about movies that slip under the radar! Almost nobody heard about The Doe Boy and there really isn't a good - or even acceptable reason. Slowly paced this very gentle film packs an emotional wallop few films with far bigger budgets, more stars and loftier reaching stories could hope to achieve. Doe Boy is about Hunter - a boy with an American Indian mother and white father. Hunter is a hemophiliac, a disease seemingly unknown to Native Americans and which separates him further, forever making him feel like an outsider. His macho father (an absolutely terrific performance by Kevin Anderson) loves him, but is ever let down by the boy's inability to be more physically active because of his disease. As the film traces Hunter's story from childhood through his late teens, we see the difficulty of the relationship between he and his father strained to the limits as well as the inability of his mother to let him go and become the man her son needs to be. James Duval gives a performance that is positively incandescent; it is an amazing achievement. With relatively little dialogue, it is through facial features and body language that he fills Hunter with a sense of defiance and a desperate need for acceptance. We witness the painful struggle he endures of always being different, in not one, but numerous ways. Acceptance and understanding do not come easy, but with the aid of his wise grandfather, a beautiful girl, and coming to grips with his heritage and and the forces of nature, Hunter's journey is one that everyone should be able to relate to. It is a brilliant, moving performance. In every way this quiet, little movie is about as perfect as indie film can be. A joy to watch.",
         "Story about an Hemophiliac Indian boy faced with cultural differences within family. Delves into the daily life and how each family member/friend deals with the situation. Good depiction of a typical boy who beats to a different drum. I would define it as dramatic, yet entertaining. Worth adding to your viewing list.",
         "The movie was wholesome and had a great story line. Blondell was great in it. =) There was some great scenery. The acting was very good. The direction of the movie was excellent. I think if this movie had gotten more press it would have done well in the box office.",
         "After watching this film a few times I fully understand why James Duval's character was extremely frustrated growing up during childhood. In my opinion, his father was just a controlling white guy who didn't give 2 hoots about his wife's Cherokee culture. It was hard to tell if he truly loved his family or not. But I didn't get any impression that he cared enough about them. I don't know why he married into a Native family to begin with. He clearly didn't care about their ways, customs and culture. He didn't even agree with the boy's grandfather, Marvin, who in my eyes was as respectably knowledgeable as any true Elder would be. Other than the fact that Duval's father was completely disrespectful towards the Native ways, I really don't know why he was so desensitized to his wife's Native ways. I recall one scene where him and Duval were talking downstairs in the basement. Apparently they were talking about something regarding a war of some sort. After a few minutes the discussion turned into an argument and the father ended up slapping him across the face just because he told him something that was absolutely true. The father didn't want to hear it because he knew it was true so he physically lashed out on him. Of course, he had no right touching him like that. He should have just admitted his guilt and that's it. The next day when he told his wife what happened between him and his son, he didn't even bother to apologize about the whole incident. All he said to her was that there was no way he was going to tolerate his son talking to him in that manner, that's all. He may have acted out of pure discipline when he struck him like that but unless he was his real father, he had no right hitting him..... period! But...... anyways...... it was a good film overall. I'm a big Alex Rice fan and she was great in it. I liked her Oklahoman accent.... she played her part very well..... and Nathaniel Arcand was excellent as usual too!! But..... ANYWAY..... these are my reasons why I gave this film a 6 out of 10.",
         "This film is absolutely gorgeous and worth every moment. It's a Native American film that touches aspects of \"Indian blood,\" the process of growing into a man, and moral/familial conflicts. Hunter is a dynamic character with facets that evolve as the film grows. For a film, I was blown away by the character progression. Hunter's story crosses ethnic lines and appeals to all audiences. Deeply personal, quietly understated film. If you have an interest in Native American culture or really just appreciate a perfect script and a beautifully made film, then this is your movie. Randy Redroad came to my school to speak and present two of his films, \"Doe Boy\" and \"133 Skyway.\" My favorite part is when he said something along the lines of: \"When I review films and I am on the panel, oftentimes it's all PhDs and me. We review films and everyone says 'this reminds me of this' or 'this film was reminiscent of this' but you know what? Look at the film for what it is. You know, good for you that you memorized an author, what do you FEEL?\" After that he quoted a line from a Woody Allan film where Diane Keaton is looking at a painting and refers the painting to another artist \"but without the wit.\" It was an eye-opening experience to hear him say this, something I had honestly never thought about before. But Randy Redroad is right, what does anything really mean without the emotion? This is the type of film you're lined up for... by an incredible artist.",
         "This movie was the biggest piece of absolute hog-wash that I had ever seen. I am from the town where the film was shot and I am also Cherokee and I must say . . . this movie (with my Indian heritage and all) made absolutely no sense. I left the room wondering what in the world I had just seen. The movie is filled with awful acting, no story-line and just nothingness. I will admit that the filmography was good. It is professionally presented although it is a \"B\" movie but otherwise I wouldn't go see it again if they paid me. What do you get when you cross a hemophiliac-native American with a poor story, bad acting and complete rubbish? Doe-Boy!",
         "I am a fan of James Duval, ergo the reason I watched the video. It left me hanging in places, particularly the ending. There was no closure. While some have termed it \"wholesome\" I find the use of four letter words through out the movie less than that. A teen with a disability trying to find himself makes for a good story line, but an 18 year old Indian drinking beer and picking fights is not what I would call \"wholesome.\" And, as a hunter myself, chasing a deer through the forest is absolutely absurd."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Anthony J. Vozza Productions",
         "Doe Boy Productions LLC",
         "Easton Limited Partners"
      ],
      "summaries": ["A Cherokee boy is a haemophiliac in a culture obsessed with blood identity."],
      "budget": 1600000
   },
   "movielensId": 149542,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-01-25",
      "dvdReleaseDate": null,
      "directors": ["Randy Redroad"],
      "runtime": 85,
      "movieId": 149542,
      "title": "The Doe Boy",
      "mpaa": "",
      "actors": [
         "James Duval",
         "Kevin Anderson",
         "Andrew J. Ferchland",
         "Jeri Arredondo",
         "Judy Herrera",
         "Gordon Tootoosis",
         "Nathaniel Arcand",
         "Orvel Baldridge",
         "Gil Birmingham",
         "Norman Brown",
         "Kody Dayish",
         "Robert A. Guthrie",
         "Lusheia Lenaburg",
         "Raven Letterman",
         "Jim Metzler",
         "Gayle Piester",
         "Alex Rice",
         "James Smith Jr.",
         "Kyle White"
      ],
      "imdbMovieId": "0243222",
      "originalTitle": "The Doe Boy",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A Cherokee boy is a haemophiliac in a culture obsessed with blood identity.",
      "tmdbMovieId": 73526,
      "avgRating": 3.5,
      "releaseYear": "2001",
      "numRatings": 2,
      "posterPath": "/6QhpNKyWNKA9RyVve9zKDvkqH5T.jpg"
   }
}