{
   "tmdb": {
      "original_language": "fa",
      "keywords": [],
      "imdb_id": "tt2912144",
      "video": false,
      "title": "Manuscripts Don't Burn",
      "recommendations": [
         44102,
         46708,
         78815,
         101330
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4c909251416c910f8ea5",
            "name": "Mohammad Rasoulof",
            "profile_path": "/uN3OKroo1NPgxJ9BDZNzY8tw2KF.jpg",
            "id": 935123,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.523939,
      "production_countries": [],
      "id": 191731,
      "vote_count": 8,
      "budget": 0,
      "overview": "Khosrow and Morteza set out on a mission to kill someone. The assassination ought to be arranged as a suicide. At the last minute however, they are obliged to change their initial plans…",
      "similar": [],
      "original_title": "دست‌نویس‌ها نمی‌سوزند",
      "runtime": 125,
      "poster_path": "/cYP9ihgtdSuP5mPTsRJmeZLIS7C.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [],
      "release_date": "2013-05-24",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mohammad Rasoulof"],
      "runtime": 125,
      "synopsis": null,
      "writers": ["Mohammad Rasoulof"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt2912144/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ2NzMwNDQ2MV5BMl5BanBnXkFtZTgwMjU2NzA4MjE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Anonymous",
         "Anonymous"
      ],
      "reviews": [
         "Mohammad Rasoulof's film was made clandestinely under highly secretive conditions. Due to its controversial and politically sensitive content, even after its release the cast and crew (bar Rasoulof) remain anonymous.The film has been made with a digital camera using non-actors. The title of the film is taken fro a sentence in Mikhail Bulgakov's The Master and Margarita. Manuscripts... is \"inspired\" by real events in Iran where a series of intellectuals were murdered in what was called \"Serial Killings\". These murders have largely remained unresolved. The film treats these events in a very realistic and matter of fact way which makes them even more chilling and disturbing. The two main protagonists assigned with the killings go about their daily life in a very normal manner, one tending to his sick child at the hospital while the other offers prayers to God so that the child can get well soon! Rasoulof's use of camera and sound is exemplary, achieving maximum tension and sustaining it for most of the film. Highly recommended but not for the squeamish.",
         "For his sixth Iranian film,\"Manuscripts Don't Burn\" Mohammad Rasoulof chose to highlight the difficult lives of intellectuals in Iran.His film shows the extent to which certain intellectuals notably writers are forced by government authorities to remain silent in order to avoid becoming a major embarrassment to the government.This is one easy angle used by many to watch this film.The film also suggests that the persecution of people who are against government is not restricted to any particular country.It is a global phenomenon.Although this film starts as a hurried thriller,it chooses to change its narrative content in the subsequent parts as audiences are led to witness intense psychological games of oneupmanship.There is a good description of all kinds of mind games being played by intellectuals and their rivals.One learns that intellectuals are not easy to crack as they use all their might to tackle any use of force by their rivals.The unique thing about this film is Rasoulof's decision to view human beings as vulnerable to folly as two killers are shown to confront their own personal problems. Despite its run time of 125 minutes,'Manuscripts don't burn\" is honest in its depiction of Iranian intellectuals who are constantly being watched by pro government authorities.Lastly,it is just a wonder that such a film was made under extremely difficult conditions.It is now for audiences all over the world to ensure that it gets a major success.",
         "Just finished seeing a screening of Manuscripts Don't Burn in Chicago at the Siskel Film Center. I couldn't recommend the film highly enough. It had a few rough spots I suppose but overall captured the tightness of the Iranian regime and how difficult it would be for an intellectual or someone with a dissenting opinion. To borrow from another film, \"resistance is futile\". Apparently based on a real event in history, it is not clear what is true and what is creative license, but the tension throughout was cleverly maintained. When I left the movie, I realized how grateful I am for the level of discourse we are \"allowed\" and the extent of alternative media, flawed though it can be at times. The acting was laudable and the writing first rate. Sadly, not enough people are likely to see this very brave film.",
         "Saw the movie at London film festival. To be honest most the audience was made up of chin scratching, cardigan wearing liberals that i assume were looking forward to a movie about the indelible fight of man versus the system. I sat there with my 3 cans of cider and ended up falling asleep for 10-15 minutes during a protracted period of navel gazing around 25 mins into the movie. Having said that, the movie managed to accelerate towards the finish. Instead of having a liberal payoff about the enduring struggle of man it manages to show what i consider the banality of life. The exploration into the corruption that this movie claims to expose is matched by the cowardice in conviction of the intellectuals and the ability of the protagonists to commit acts unthinkable due to the pressures of the state. There are no heroes, only victims and the last 30 mins are as tough as any movie. Congratulations to the movie maker for creating an opaque, disturbing, complex and anarchic movie that refuses to provide an explanation but detail the horrors that some seem to be experiencing in Iran. The final shower scene was probably overdone for the astute members of the audience but for me it brought together the numerous face washing scenes and highlighted an inherent truth about what we as humans will endure.",
         "From 1988 to 1998 the doctrine of the secret service in Iran come to the conclusion that the biggest threat toward their regime is not from foreign enemies, but the intellectual elite who continue their work despite all the suppressions and censorships. To eliminate this elite, a special unit founded and covertly eliminate around 80 writers, poets, critic etc. the most notable terror they tried was the Armenia Bus Accident which Mohamad Rasoulof explicitly explain during the movie, even the names and what they did on the mention night was unchanged. To give him more credit, he bravely made a character who is the Editor of an important newspaper and also an interrogator and torturer in secret service, is based on a real character, named Hossein Shariatmadari, Editor of Kayhan Newspaper (the same newspaper Kian used to wrap the vodka bottle) in last 24 years and well-known interrogator in Evin Prison, or the bus driver, Khosrou Bharati who participated in more murders after the bus accident. Rasoulof in not looking to build a hero with redemption, but try to create the atmosphere of terror and suppression. The continuity of terror, the dominant power of secret service on the life of people who have no power on their lives. The struggle of depressed men who keep resisting not reveal the manuscripts of their friends, and solemn life of the terrorist who his wife asked him on the phone \"maybe it's because of your job that our son got cancer\". To understand this movie it's better to compare it with Florian Henckel von Donnersmarcks' movie, \"The Lives of Others (2006)\" where the writer's redemption happened after the collapse of Berlin Wall. Although in Autocratic regimes intellectual Elites plays a prominent role, but their effort is nothing except informing the public under the continuity of fear and suppression with the price that sometimes they pay with their lives. In the other hand, Rasoulof tries to show the burden terrorist have on their shoulder. The people who deal with complicated life. From one hand, an ideological duty and from the other hand, the darkness terrorizing innocents bring to their lives. On writer, despite all the psychical impediments, trying to publish his last work, the other start a dangerous duel with his interrogator just to see his daughter for the last time, and a terrorist who must beg for money from his superiors just to hospitalized his child. The dignity under the suppression and humiliation, despite the free-will, to follow his ideological Duty. The kind of things you hear a lot in Iran",
         "Maybe I'll come back someday and digress on the politics of this film, but I would just like to hail it for some fine, fine acting. It's long, but I doubt anyone could say the atmospheric shots were overdone, and few frames were wasted--they almost all reflect on something else in the film. It's like a very long, slow, convulsion, if that makes any sense. If you, like me, were disappointed by the manipulative, false, Academy award-winning _A Separation_, then restore your sense of probity with _Manuscripts Don't Burn_. I also can't believe the director hadn't had Shelley from _Glengarry Glen Ross_ in mind as he drew the protagonist here, but, if he didn't, it probably only makes both films more real and remarks an essential cultural and human sameness at play. (Both movies, don't forget, are based on real-life situations.)"
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["Khosrow and Morteza set out on a mission to kill someone. The assassination ought to be arranged as a suicide. At the last minute however, they are obliged to change their initial plans..."],
      "budget": 0
   },
   "movielensId": 149616,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "2013-05-24",
      "dvdReleaseDate": null,
      "directors": ["Mohammad Rasoulof"],
      "runtime": 125,
      "movieId": 149616,
      "title": "Manuscripts Don't Burn",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "2912144",
      "originalTitle": "دست‌نویس‌ها نمی‌سوزند",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Khosrow and Morteza set out on a mission to kill someone. The assassination ought to be arranged as a suicide. At the last minute however, they are obliged to change their initial plans…",
      "tmdbMovieId": 191731,
      "avgRating": 3.875,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/cYP9ihgtdSuP5mPTsRJmeZLIS7C.jpg"
   }
}