{
   "tmdb": {
      "original_language": "ko",
      "keywords": [],
      "imdb_id": "tt1786668",
      "video": false,
      "title": "Cyrano Agency",
      "recommendations": [
         94555,
         63465,
         146724,
         50727,
         133601,
         155277,
         64846,
         142533,
         189150,
         88017,
         230722,
         373556,
         18526,
         42384,
         116488,
         19609,
         132711,
         60192,
         124874,
         82994
      ],
      "backdrop_path": "/bdFX42ZQ34uPlPjyk5HTfXb2Moy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1010,
               "character": "Lee Byeong-hoon",
               "gender": 2,
               "credit_id": "53de41a90e0a265a830022b8",
               "name": "Uhm Tae-woong",
               "profile_path": "/qg0ufuUQsQlv3vQ18L2h5yDCvJz.jpg",
               "id": 1238415,
               "order": 0
            },
            {
               "cast_id": 1011,
               "character": "Hee-joong",
               "gender": 1,
               "credit_id": "53de4559c3a3686c5d001349",
               "name": "Lee Min-jung",
               "profile_path": "/lyzaY4AAV3Hes9p9lfh2rGVYc8h.jpg",
               "id": 150242,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "Jae-pil",
               "gender": 0,
               "credit_id": "52fe486bc3a36847f816624b",
               "name": "Jeon Ah-min",
               "profile_path": null,
               "id": 148413,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Proposing man",
               "gender": 2,
               "credit_id": "52fe486bc3a36847f816624f",
               "name": "Lee Chang-joo",
               "profile_path": "/zsbtBT9ocTBIXmftSB4c7jrJkxe.jpg",
               "id": 1143491,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Min-yeong",
               "gender": 1,
               "credit_id": "52fe486bc3a36847f8166253",
               "name": "Park Shin-hye",
               "profile_path": "/sawobNVsHz5jvRzuhhQSwtOLkCX.jpg",
               "id": 1156197,
               "order": 5
            },
            {
               "cast_id": 1012,
               "character": "Sang-yong",
               "gender": 0,
               "credit_id": "552ca1cc92514103ce001840",
               "name": "Choi Daniel",
               "profile_path": "/rMnBmq51tkbxRfu2KNbXYizmwKD.jpg",
               "id": 1252369,
               "order": 6
            },
            {
               "cast_id": 1013,
               "character": "Yoo-mi",
               "gender": 1,
               "credit_id": "5618a0389251413752001700",
               "name": "Kim Ji-yeong",
               "profile_path": "/jt0M1MGWQARxWX9sOdN3G54kNs2.jpg",
               "id": 231477,
               "order": 7
            },
            {
               "cast_id": 1014,
               "character": "Kim Hyeon-gon",
               "gender": 2,
               "credit_id": "5634a44cc3a3681b59016fa2",
               "name": "Song Sae-byuk",
               "profile_path": "/jxMDfNq7o6SMEX6E6oSLcWit7q3.jpg",
               "id": 1299516,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5347160e0e0a264e33000074",
            "name": "Kim Hyun-suk",
            "profile_path": null,
            "id": 24989,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.934369,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 53514,
      "vote_count": 19,
      "budget": 0,
      "overview": "The Cyrano Agency is a dating agency which helps people who can't date to have a love life. The agency staff try helping their clients without being noticed. The agency's representatives Byeong-hoon (played by Eom Tae-woong)and Min-yeong (Park Sin-hye) are giving their best to pair up their client, Sang-yong (Choi Daniel), with his love interest named Hee-joong (Lee Min-jeong). But when Byeong-hun sees Hee-joong's profile, he begins to doubt their abilities. Will \"Cyrano Agency\" succeed in their mission?",
      "similar": [],
      "original_title": "시라노; 연애조작단",
      "runtime": 118,
      "poster_path": "/3Jy1kChkIlGm2TI4o9WqVpTLpJt.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Myung Film Company",
         "id": 2479,
         "origin_country": ""
      }],
      "release_date": "2010-09-16",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.cyranoagency.com",
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hyun-seok Kim"],
      "runtime": 119,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt1786668/",
      "coverLink": null,
      "actors": [
         "Tae-woong Eom",
         "Min-jung Lee",
         "Daniel Choi"
      ],
      "reviews": [
         "There is a formula that romantic comedies stick to. And this one follows it, but also offers a few laugh out loud moments that are quite original. But then, they only happen sporadically throughout this otherwise unmemorable movie, which is unfortunately drawn out by long dry spells of unconvincing, over-the-top and contrived drama. Granted, the premise is interesting: a team of goofball matchmakers work surreptitiously to turn strangers into couples. But as with most comedies, the premise is strained to such effect that is not credible that it becomes silly. Take for an instance, the crew go to extremes to orchestrate fake rain outside of a cafe where the woman they are targeting to bewitch works. This is done so to conjure a romantic ambiance. But then, is it even possible to bribe that many passers-by to hole umbrellas? Are they extras? I guess the audience is supposed to suspend all disbelief, as it is supposed to be light-hearted, meaning light on the brain. Gripes about the over-the-top scenes aside, you should take to the good- looking cast and hide the above misgivings under the theatre seat. For women who like their guys rough on the edge but tender at the core, there's brusque hunk Min-yeong (Park Sin-hye). And for those who like theirs lanky, geeky and deeply apologetic, there's pushover financial consultant Sang Yong (Daniel Choi). And with these two delectable guys, there has to be two worthy foils, who come in the elusive squinty-eyed Hee-joong (Lee Min-jeong) and petite doe-eyed Min-yeong (Park Shin-hye). So depending on your taste, you can indulge in your kind of eye-candy. But having said all that, if you are a serious cinephile, it's hard to take to this movie seriously. Apart from a nifty twist at the end that plays sly reference to the Cyrano De Bergerac legend, the rest is mostly a humdrum affair. But if you are looking for a harmless movie that is not heavy with metaphors to impress your easy-to-please date, look no further.",
         "Not a very brilliant movie but an entertaining one. Some people are complaining about how unreal it is but it is not. indeed. If you have been a Korean Drama fan, then there's no difficulty realizing how the CYRANOAGENCY succeed in helping its customers to get the girl they want. The agents in Cyrano try to make girls fall by using lines and tricks often seen in K-Drama, and to me, it's pretty cool and amusing. The other thing I like in this movie is the lighting. Every scene seems to be bright and cheerful with a lot of sunshine, which makes me feel so relax when watching it. A romantic, (kind of) hilarious movie with great acting, especially Daniel Choi and Uhm Tae-woong. And I'm going to see the original Cyrano movie. 8/10.",
         "Outsourcing, as one of the characters puts it, frees up one's time from doing something you're not good at, and leaving it to the paid professionals to deliver some quality service on your behalf. The Cyrano Agency is not your typical matchmaking agency, where dates get set up and you turn up, crossing your fingers on compatibility, conversation and so on. Its selling point is confidentiality since it involves a great deal of social engineering on the part of the Agency staff, crafting meticulous details from seemingly chanced scenarios to operate in right down to the minutest of things to say and do. The brainchild of the agency is Byung-Hoon (Uhm Tae-Woong), who together with his failed troupe of actors and crew Min-Young (Park Shin-Hye), Jae-Pil (Jun A-Min) and Chul-Bin (Park Cheol-Min) form the core of Cyrano Agency, where like its namesake, become Cyrano de Bergerac equivalents through the adoption of the stage play for a larger playing field in real world dating, in order to keep afloat, pay the bills and one day reopen and get back to their original theatre business. It's a temporary set up that employ the widest range of their skill sets combined, where we spend a significant portion of the first act understanding the lengths they will go to for their clients to be successfully hooked up with the woman of their dreams - yes, it does seem like a predominantly male clientèle they attract. The story picks up when a nerdy fund manager Sang-Yong (David Choi) walks in, and Byung- Hoon discovers that the target the agency is engaged to snag is none other than his ex- girlfriend Hee Joong (Lee Min-Jung). Talk about dilemmas here especially when there's still that lingering affection, and of course given the amount of manipulation that goes behind the scenes, there's this level of deception that one probably won't even want to put an ex through, and it also tosses up questions involving sincerity whether to attempt a pursuit on your own, given flaws, warts and all or to rely on others, since the pursuer obviously is having no qualms about getting everything engineered to seal the deal. Like a typical Korean film, there's room for comedy as well as melodrama in a bloated film adamant in covering a lot of ground. There's the exploits of Sang Yong in getting to be within Hee Joong's attention radar which the Agency crafts, with laughs coming from the former's penchant to drift beyond his prepared script, and the various rib-tickling efforts from members of the agency who pride themselves in their work, sometimes not going according to plan when their thinking on their feet fails. Then there's Byung-Hoon's inevitable meddling when not being able to separate business and personal, seeing it as an opportunity once again to work his issues with his ex when the cards fall into the right places. And Uhm Tae-Woong has that charisma to play the flawed Cyrano, bringing in the melodramatic elements as the story unfolded given the back story of the romance between him and Min-Jeong and how it sparked and eventually deteriorated, so in effect you get two stories for the price of one, with a twist in perception of this relationship put on the back burner. Exploration of the themes of Trust and Love, and the prioritization and importance of these two elements in a relationship got pushed to the forefront instead as the narrative builds toward its finale with both Sang-Yong and Hee Joong vying for Hee Joong, with one obviously not in the know of the other who's operating in the shadows, providing avenues for heart warming, and wrenching emotional outpouring in one combined, pivotal scene. Then of course there's the performance of Lee Min-Jung, the central object of affection with those anime large and saucer shaped eyes you probably cannot keep your attention off since they speak volumes for her character, whether rolling them in exasperation, or connecting and communicating with her beaus through one key element of non-verbal expression of emotion. It's no wonder her performance here had snagged her a number of Best New Actress awards in Korea last year (enhancement notwithstanding!) as the Roxanne equivalent caught up with conflicting emotions. The film had probably presented its arguments to try and swing the audience's sympathy toward the Christian character here rather than for Cyrano, but unfortunately cannot let go from its need to have an uplifting factor since this is a romantic comedy after all, with a minor romantic subplot kept brewing that you'll probably see it coming from the start. Personally, the story of Sang-Yong's pursuit of Hee Joong actually took a backseat as being the weaker of the two broad romances here and is a tad unconvincing, since after all, it's engineered, to perfection even. Still, there are plenty of stories out there about others attempting to hijack the mark they're employed to cover - coming to mind is Hollywood's own zany comedy There's Something About Mary - but for a more Asian spin coming from an adaptation of a well known classic, Cyrano Agency scores big marks.",
         "This one wasn't a bad movie. Though the romance was not as powerful as it could have been, there was a tragic mood in it and eventually, you kind of feel sad for the character, even though you must root for the other guy. The whole idea of the agency and their projects is interesting, reminding me of the inception team that prepared for the big operation before entering the guy's dream. Sure, the projects are too few to get a good taste of what is happening, but still, it's interesting to see how they operated. After the first operation, the movie focuses more on two or three characters and leaves the other guys aside, as they only play side roles. Though the flashbacks aren't that confusing, and the performances were good, the big mystery behind the lead character's past relationship wasn't that big of a mystery after all, as it wasn't enough to create a thrill mood for the audience. All in all, not a bad movie, so 6 out of 10."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Myung Films"],
      "summaries": ["The Cyrano Agency is a dating agency which helps people who can't date to have a love life. The agency staff try helping their clients without being noticed. The agency's representatives Byeong-hoon (played by Eom Tae-woong)and Min-yeong (Park Sin-hye) are giving their best to pair up their client, Sang-yong (Choi Daniel), with his love interest named Hee-joong (Lee Min-jeong). But when Byeong-hun sees Hee-joong's profile, he begins to doubt their abilities. Will \"Cyrano Agency\" succeed in their mission? This is a fun little romantic comedy made the Korean way. And a special notice for Eom Tae-woong, who i think is a good actor. He resembles another great Korean actor, Tony Leung(starred in In The Mood For Love)."],
      "budget": 0
   },
   "movielensId": 149790,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2010-09-16",
      "dvdReleaseDate": null,
      "directors": ["Kim Hyun-suk"],
      "runtime": 118,
      "movieId": 149790,
      "title": "Cyrano Agency",
      "mpaa": null,
      "actors": [
         "Uhm Tae-woong",
         "Lee Min-jung",
         "Jeon Ah-min",
         "Lee Chang-joo",
         "Park Shin-hye",
         "Choi Daniel",
         "Kim Ji-yeong",
         "Song Sae-byeok"
      ],
      "imdbMovieId": "1786668",
      "originalTitle": "시라노; 연애조작단",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Cyrano Agency is a dating agency which helps people who can't date to have a love life. The agency staff try helping their clients without being noticed. The agency's representatives Byeong-hoon (played by Eom Tae-woong)and Min-yeong (Park Sin-hye) are giving their best to pair up their client, Sang-yong (Choi Daniel), with his love interest named Hee-joong (Lee Min-jeong). But when Byeong-hun sees Hee-joong's profile, he begins to doubt their abilities. Will \"Cyrano Agency\" succeed in their mission?",
      "tmdbMovieId": 53514,
      "avgRating": 3.5,
      "releaseYear": "2010",
      "numRatings": 6,
      "posterPath": "/3Jy1kChkIlGm2TI4o9WqVpTLpJt.jpg"
   }
}