{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "chinese",
            "id": 13159
         }
      ],
      "imdb_id": "tt0099127",
      "video": false,
      "title": "Bethune: The Making of a Hero",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Norman Bethune",
               "gender": 2,
               "credit_id": "54529223c3a368023c006fb3",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Frances Penny Bethune",
               "gender": 1,
               "credit_id": "54529230c3a3687932000217",
               "name": "Helen Mirren",
               "profile_path": "/4EGgBJPUBz68ZrnFuLVo01r0uND.jpg",
               "id": 15735,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Dowd",
               "gender": 1,
               "credit_id": "5452923cc3a3687932000219",
               "name": "Helen Shaver",
               "profile_path": "/7DlGkBDdRcKPlPAXuoo6xz6hSAU.jpg",
               "id": 4160,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Chester Rice",
               "gender": 2,
               "credit_id": "545292490e0a263a0400757e",
               "name": "Colm Feore",
               "profile_path": "/ack88BRQ7mApRMOdaiOqEUh2FDu.jpg",
               "id": 10132,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Tung",
               "gender": 2,
               "credit_id": "54529255c3a3681159002492",
               "name": "James Pax",
               "profile_path": "/rGohfLMMuUcbJ1uORku4EFg96s1.jpg",
               "id": 53024,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "545291ef0e0a263a180070d1",
               "name": "Phillip Borsos",
               "profile_path": "/fIwPoBbTvv9sXrqEPmclkjJCI57.jpg",
               "id": 148119,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54529209c3a368024500707c",
               "name": "Ted Allan",
               "profile_path": null,
               "id": 146712,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "54529210c3a3687932000210",
               "name": "Ted Allan",
               "profile_path": null,
               "id": 146712,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.224694,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "CN",
            "name": "China"
         }
      ],
      "id": 281291,
      "vote_count": 2,
      "budget": 0,
      "overview": "True story of Norman Bethune, a medical doctor who fought for justice in China during Mao's rise to power.",
      "similar": [
         462,
         640,
         9388,
         769,
         5915,
         11202,
         45317,
         371638,
         363676,
         389015,
         407445,
         318846,
         446354,
         396371,
         324786,
         10139,
         323677,
         228970,
         274479,
         152532
      ],
      "original_title": "Bethune: The Making of a Hero",
      "runtime": 115,
      "poster_path": "/5PGGfltJSjrbQ8fT4CmD53aPRo2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Filmline International Inc.",
         "id": 2186,
         "origin_country": ""
      }],
      "release_date": "1993-09-17",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Phillip Borsos"],
      "runtime": 168,
      "synopsis": null,
      "writers": [
         "Ted Allan",
         "Ted Allan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099127/",
      "coverLink": null,
      "actors": [
         "Donald Sutherland",
         "Helen Mirren",
         "Helen Shaver"
      ],
      "reviews": [
         "\"I refuse to condone, by passivity, or default, the wars which greedy men make against others. Spain and China are part of the same battle. I am going to China because I feel that is where I can be most useful.\" -Dr. Norman Bethune Donald Sutherland's performance was wonderful in this film. The story is important and truly interesting. Presenting the life of Dr. Norman Bethune and his complex character, he was both selfless and arrogant, an international humanitarian, an alchoholic and a communist who acted on his beliefs (when so many of us simply talk about them). Bethune was a champion of socialized medicine and a rabid anti-facist who though subject to entirely human failings also presented the best in human achievement. Bethune's life is fascinating and truly heroic and this film demonstrates that fact very well. Several of the rational criticisms leveled at the film by other IMDB commentators are apt, but the film is a triumph nonetheless. As for the 'up with communism' criticism: Of course Mao was a big problem for China and the Chinese people. But that was not evident in 1939. In 1939 Japanese were the problem. It is easy to be smart when looking back in time and with a history book on your lap. It is harder to forsee events when they havent happened yet. Perhaps our polish friend would have chosen differently had he been in the same position. But he could not have chosen better.",
         "Contrary to the guy who said that they actors should be ashamed of themselves for promoting Communist propaganda, they should be proud for telling an inspiring story about an inspiring revolution. Indeed it's refreshing to see something that doesn't try to slander socialism and Mao. Maybe that is why this film was not widely seen and promoted. Dr. Bethune was right, and is still right even with everything we know today. The film is correct in portraying these historical events in the positive light they should be portrayed, contrary to popular Western fashion. Mao was not a murderer, he was a revolutionary hero, like Bethune, and saved millions of lives. Keep in mind that Mao led the Chinese revolution which lifted millions out of poverty and illiteracy. It was in fact the largest transition out of poverty in human history. The land reform was the biggest exchange of land in human history. There were indeed mistakes made during the transition out of capitalist (even feudalistic) economic relations and into a more socialistic economy and social structure. But to be fair the capitalist transition took a long time, failed several times, and committed outright crimes. Mao led the largest land reform in world history -- changing agriculture for 500 million people and ending feudalism. The reorganizing feudal agriculture by leading a peasant agrarian revolution did cause disruptions to the food supply, but this is not \"sanctioning the killing of millions.\" We never hear claims that say Lincoln \"sanctioned the killing of 3 million people\" because his election caused the civil war, and the civil war had sweeping consequences on both civilians and soldiers. The historical documents do make clear that whatever one thinks about Mao and the short comings, they do make clear that Mao's intentions was to create a deeply democratic (for the oppressed classes) society where the masses of people would be the rulers of their own destiny. Mao led a civil war, then a radical land reform and a series of unique political movements let led to a remarkable socialist society in China for several decades. There are lots of sensationalist books that critics quote, but if you look at the sources, and esp. the review by China specialists after they had time to review it, you will see it gets lambasted in severe ways. For example the Chang and Halliday book, \"Mao: The Unknown Story,\" is almost always cited and in vogue. The work is regarded by specialists as \"faction--fiction with a cloak of facts.' David S. G. Goodman, Professor of Contemporary China Studies for example, compared the book to \"The DaVinci Code, saying that it purports to show a \"a conspiracy of academics and scholars who have chosen not to reveal the truth.\" Goodman argued that \"the 'facts' in The Da Vinci Code are about as reliable as those to be found in...Mao: The Unknown Story.\" Goodman argued that the book could even be thought of as a \"form of fiction\" where \"a strong narrative\" is \"a substitute for evidence and argument.\" One of my favorite China historians, who I used to correspond with when I was doing some research on this very topic is Prof. Mobo Gao, and in his new book, he devotes a whole chapter to that sad affair of \"The Unknown Story.\" His book is, \"The Battle for China's Past: Mao and the Cultural Revolution\" by Prof. Gao. Find on Amazon. The reviews of the Chang and Halliday work reveal a very dubious methodology, that it exaggerates numbers, fakes evidence, provides anecdotal reading to events, etc. But this work receives praise universally from everywhere except for the field the work is suppose to contribute scholarly information to, China Studies. Nearly all China Studies scholars, even those very close politically to Chang and Halliday, have in one sense rebuked this work, yet it remains popular and cited by people as if it has any scholarly validity.",
         "Although I know nothing of the life of Dr. Norman Bethune, this biopic appears to be a credible history lesson. But not much more. Though the scenery is gorgeous and we get lots of opinions on our subject, plus writings in his journal, we never really get inside Bethune. This is because the director and the screenwriter seem to be men with banal vision and little imagination. The movie this film most reminds me of is Gandhi, whose faults it shares but Bethune does not have as powerful a cast. Acting is generally adequate but not much more than that. That the hero is a communist does not mean there couldn't have been a great story here. It does mean most American and Canadian audiences are not going to start watching wanting to see this man's greatness proven, the way they did for Gandhi.",
         "The life and times of Norman Bethune represent the stuff great epic movies are made of. Unfortunately, the creators of this film missed the opportunity and spoiled everything they could. The time line is unnecessarily disordered, psychology and camera unengaging, props are fake (e.g. brand new uniforms of the Chinese soldiers). I do not comment about the politics or ideology of the film, but as art, it is overwhelmingly disappointing.",
         "It is extremely easy to pass it as a political propaganda at first glance. However, it would extremely foolish to do so. What happened to Mao and his party was exactly like what ancient Romans had said: Absolute power corrupts absolutely. However, what happened to Mao and his party after the revolution cannot be used to mitigate what Chinese people accomplished under his leadership before the revolution. Denying past accomplishment of Mao and his party, as well as Chinese people and those great internationalists who helped China to fight Japanese fascists invaders would be as foolish as, and as racist as denying the existence of in USA simply because blacks in USA enjoy better living standards than blacks in Africa & Latin America.",
         "The only reason I'm giving this movie three stars is because it portrays an interesting historical topic. Donald Sutherland, Helen Mirren, and everyone involved in this movie should be ashamed of themselves for propagandizing for the worst mass murderer in the history of the world. Mao Tse Tung holds the world's record for genocide, killing over 60 million people. Hitler, in contrast, comes in at third place. The number two spot goes to another Communist regime, the Soviet Union. The fact that much of this film was made in Red China with the full approval of Communist censors speaks volumes. Some IMDb reviewers have stated that what happened after Mao's conquest of China can't be held against their early struggle or that Mao's atrocities \"were not evident in 1939.\" Yes they were! Communist theory itself advocates violating people's natural rights to buy, sell and own property while calling for violent class warfare. Mao's political mentors,Lenin and Stalin, had already murdered millions by the time Bethune went to China. Wikipedia.org reports that Mao himself killed over 186,000 people before Bethune came to China, while having horrible tortures committed against many Chinese, including cutting womens' breasts open and mutilating genitals. Would these reviewers have been so kind to a movie portraying Hitler in the 1920s positively because he hadn't killed anyone yet? You would never know any of this by watching the movie. The film shows a friendly, jovial Mao talking about tactics with Bethune. Communist soldiers are portrayed in positive light as principled idealists, while the Nationalist Chinese they were fighting are portrayed as brutes. Although this movie was principally propaganda for Chinese Communism, it was also propaganda for Communism in general, using Behtune's life as a tool towards that end. The Communists in the Spainish Civil War were portrayed as the good guys, and the theater scene where Bethune admitted to being a Red while the audience sang the International with clenched fists was naked Communist propaganda. If people want to watch the film out of interest of the subject, then I recommend they do so. But do it with the full knowledge of what the film is and what it deliberately leaves out."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": ["Filmline International"],
      "summaries": [
         "Bethune has long been a hero in China. Perhaps for reasons of politics and personality, however, his fame in North America lagged far behind. The film explores the complexity of a character who could be narcissistic, petty, and cruel with those who loved him, yet capable of heroic generosity and creativity for those whom he scarcely knew. It was a Canada-China-France co-production, which by the time of its release had become the most expensive movie ever made in Canada. The production had been dogged by controversy over funding, politics, location, revenue, and a dispute over the script between the author, who had been with Bethune in Spain, and the leading actor who had already played Bethune in other venues. Some scenes are tinged with humor and Bethune's speeches about universal access to humane medicine have an uncanny appeal more than half a century later. With its beautiful backdrop of Chinese landscapes, Montreal snow, and 1930s nostalgia, the film is an evocative memorial to a fascinating figure in surgery's past. Medical students love it. Director Philip Borsos Leading Actors Anouk Aimee, Helen Mirren, Donald Sutherland Studio Telefilm Canada, Canadian Broadcasting Corporation, FR3 TV France, China Film Co-production Year 1990 Color/BW Color Running Time 116 minutes",
         "Canadian surgeon Norman Bethune, 1890-1939, (Donald Sutherland) journeys 1500 miles into China to reach Mao Zedong's eighth route army in the Wu Tai mountains where he will build hospitals, provide care, and train medics. Flashbacks narrate the earlier events of his life: a bout with tuberculosis at the Trudeau sanatorium; the self-administration of an experimental pneumothorax; the invention of operative instruments; his fascination with socialism; a journey into medical Russia; and the founding of a mobile plasma transfusion unit in war-torn Spain. Bethune twice married and twice divorced his wife, Frances (Helen Mirren) who chooses abortion over child-rearing in her unstable marriage. By 1939, Bethune had been dismissed from his Montreal Hospital for taking unconventional risks and from his volunteer position in Spain for his chronic problems of drinking and womanizing. As his friend states: \"China was all that was left.\" Even there, Bethune confidently ignores the advice of Chinese officials, until heavy casualties make him realize his mistake and lead him to a spectacular apology."
      ],
      "budget": 0
   },
   "movielensId": 149755,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-17",
      "dvdReleaseDate": null,
      "directors": ["Phillip Borsos"],
      "runtime": 115,
      "movieId": 149755,
      "title": "Bethune: The Making of a Hero",
      "mpaa": "",
      "actors": [
         "Donald Sutherland",
         "Helen Mirren",
         "Helen Shaver",
         "Colm Feore",
         "James Pax"
      ],
      "imdbMovieId": "0099127",
      "originalTitle": "Bethune: The Making of a Hero",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["p9PKWZKLNC4"],
      "plotSummary": "True story of Norman Bethune, a medical doctor who fought for justice in China during Mao's rise to power.",
      "tmdbMovieId": 281291,
      "avgRating": 3.83333,
      "releaseYear": "1993",
      "numRatings": 3,
      "posterPath": "/5PGGfltJSjrbQ8fT4CmD53aPRo2.jpg"
   }
}