{
   "tmdb": {
      "original_language": "ko",
      "keywords": [],
      "imdb_id": "tt2390253",
      "video": false,
      "title": "Eungyo",
      "recommendations": [
         308118,
         146724
      ],
      "backdrop_path": "/uUmrAH6TGvlCcvASGr2t7mH7OzM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 27,
               "character": "Lee Jeok-yo",
               "gender": 2,
               "credit_id": "530dfc65c3a3685c2f002972",
               "name": "Park Hae-il",
               "profile_path": "/bzgD29gCOE5ImtU9m2Vjbrv5LlC.jpg",
               "id": 21687,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Seo Ji-woo",
               "gender": 0,
               "credit_id": "530dfca0c3a3685c12002a15",
               "name": "Kim Mu-yeol",
               "profile_path": "/yYelHbGrjqCMGKyUuSwHQ72U9fj.jpg",
               "id": 84788,
               "order": 14
            },
            {
               "cast_id": 29,
               "character": "Han Eun-gyo",
               "gender": 1,
               "credit_id": "530dfd59c3a3685c030028f2",
               "name": "Kim Go-eun",
               "profile_path": "/mrtgt2pQ5zLG1BMHLiZ3oFvs6cM.jpg",
               "id": 1067849,
               "order": 15
            },
            {
               "cast_id": 33,
               "character": "President Park",
               "gender": 0,
               "credit_id": "55d3073892514170b1000e52",
               "name": "Jeong Man-sik",
               "profile_path": "/yEtQC1fk7LtH8vQFlgPBrcKsIT6.jpg",
               "id": 1044800,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "533575df92514144540043b6",
               "name": "Kim Tae-kyeong",
               "profile_path": null,
               "id": 1301202,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5304e427c3a3683a81221d12",
               "name": "Park Bum-shin",
               "profile_path": null,
               "id": 1294606,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5304e433c3a3683a6d1eba38",
               "name": "안은미",
               "profile_path": null,
               "id": 1294607,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5304e43ac3a3683a7a1f5945",
               "name": "이상현",
               "profile_path": null,
               "id": 1294608,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5304e454c3a3683a7a1f5ba5",
               "name": "Seungcheol Hong",
               "profile_path": null,
               "id": 1293713,
               "department": "Crew",
               "job": "Lighting Camera"
            },
            {
               "gender": 0,
               "credit_id": "5304e464c3a3683a7a1f5c54",
               "name": "연리목",
               "profile_path": null,
               "id": 1294609,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5304e472c3a3683a9920a0c7",
               "name": "Choi Eui-young",
               "profile_path": null,
               "id": 1294610,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5304e47bc3a3683a91211c46",
               "name": "Yunjeong Hwang",
               "profile_path": null,
               "id": 1294139,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5312be30925141104d00465a",
               "name": "Jung Ji-woo",
               "profile_path": "/klTDC4CtCFNxXHzodiAwl2Fqhvl.jpg",
               "id": 97142,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5312be3b92514110420046aa",
               "name": "Jung Ji-woo",
               "profile_path": "/klTDC4CtCFNxXHzodiAwl2Fqhvl.jpg",
               "id": 97142,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.824159,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 118451,
      "vote_count": 17,
      "budget": 0,
      "overview": "Renowned 70-year-old poet Lee Jeok-yo falls for a 17-year-old girl named Eun-gyo. Upon realizing his love for the teenager, the poet goes through emotional turmoil and self-destruction, while willing to give up his fame as one of the nation’s most respected literary figures. Involved in the love triangle is Lee's student Seo Ji-woo, a novelist in his 30s who also becomes obsessed with the girl.",
      "similar": [],
      "original_title": "은교",
      "runtime": 129,
      "poster_path": "/yjlW5G1XSrX967ssLnhJI7YwkvS.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lotte Entertainment",
         "id": 7819,
         "origin_country": ""
      }],
      "release_date": "2012-04-25",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Desire Never Gets Old",
      "adult": false,
      "homepage": "http://eungyo.co.kr/",
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ji-woo Jung"],
      "runtime": 129,
      "synopsis": null,
      "writers": [
         "Ji-woo Jung",
         "Beom-shin Park"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt2390253/",
      "coverLink": null,
      "actors": [
         "Hae-il Park",
         "Mu-Yeol Kim",
         "Go-eun Kim"
      ],
      "reviews": [
         "Based on the novel by Park Bum-shin, Eungyo looks at the different types of relationships between the young and the old. We have the philosophical teacher, the devoted student and the foolish schoolgirl. The movie explores the author's personal thoughts on ageing, human psychology and desire in a remarkable down to earth fashion allowing us to empathise and relate to each of the three main characters on their own level. Student's often tend to admire, love and look up to their teachers but is that admiration and love reflected back by the teacher onto their student? What happens when the relationship between the student and the teacher eventually becomes a one way love regardless of the events which unfold? Romantic relationships between the old and the young are usually despised, looked down upon and pitied. Yet those individuals who are so quick to judge never truly understand the truth of the matter. This movie captures that truth perfectly for all to understand, far from biased but will almost certainly alter opinions on the subject both negative and positive. There is only so much that can be said about Eungyo in one review, especially when the film explores so many strong emotions as themes. In the end, who was wrong if any? Was it the student, teacher or the schoolgirl? Perhaps all had their own faults? That is for you and you alone to decide. All that can really be said is that this is NOT your average drama. On a side note, the score for the film is absolutely beautiful and truly reflects the different emotions occurring in crucial scenes. You may be left with tears, you may be left with a frown, you may be left cross or you may just be left emotionless... If only things could have been different.",
         "What to say about this movie?First let me say that there are not enough reviews for Korean cinema in my opinion.I an a HUGE fan of Asian cinema,and I wish everyone could see just how good it is!The main aspect I noticed in this movie was \"Humanity\"in all it's beauty.And this is Korean Cinema in it's finest!The fragility of youth,age,and love is portrayed so artfully is what makes this movie so strong!There were scenes that were so real,even in dreaminess that they took my breath away.The main character\"Eungyo\"was beautiful without even knowing it.When the movie ended,after a while of silence,and wiping my tears I felt this movie deserved a review,and that I had to honour the creation of it.It's a movie I will never forget,and I was deeply touched.",
         "The man who desires after that girl is Lee Jeok-yo(Park Hae-il with lots of make-up). He is a poet who has been revered by many people as one of the giant figures of South Korean literature, and the people even consider building the memorial museum for his achievement. He does not like being treated like an artifact, so, except accepting invitations from time to time, he lives alone in a cozy country house somewhere outside Seoul. Although he is surrounded by many books in his library, his career as a poet looks like having been terminated for a long time. He has been assisted by one of his pupils, Seo Ji-woo(Kim Moo-yeol). Ji-woo becomes famous because of his first novel which is not only critically acclaimed but also commercially successful. As his mentor, Jeok-yo should be proud of his pupil's success, but he does not seem to be pleased a lot when he receives the book. None the less, Ji-woo keeps coming to his mentor's house, and he works for his mentor as an unofficial housekeeper and secretary; he cooks the meal, and he takes care of the daily appointments for Jeok-yoo. On one day, their daily life becomes a little different when they find a young high school girl waiting for them when they arrive at Jeok-yoo's house. Her name is Eun-gyo(Kim Go-eun), and she says she just comes to the house to get a part-time job. Jeok-you reluctantly hires her, but, while watching Eun-gyo's innocent beauty, Jeok-yo begins to feel something stirring in his heart. At one rainy night, she comes to his house due to her personal reason, and he lets her into his house. Though nothing much happens on that night, he sees that he really wants Eun-gyo – but he also knows that he is a guy too old for the relationship with the girl idolized by him. As several local critics pointed out, I have to admit that it was awkward to see Park Hae-il as the aging character after watching his virile physical performance in South Korean action film \"War of the Arrows\"(2011) in last year. He is currently 35, so it is rather hard to accept him as a man around 70 in spite of the make-up on his face and upper body. In fact, he looks more natural when he plays the younger version of his character in the wistful fantasy sequence imagined by his character. But, despite this undeniable awkwardness, Park Hae-il gives an adequate performance as a man who pathetically remains young at heart. Some old men do not learn much even after they become quite old, and Jeok-yoo is one of those silly examples. Maintaining its serious attitude, the movie approaches to the hilarity of Hong Sang-soo's films sometimes, and there is a funny scene where Jeok-yoo almost risks his life just because he wants to look good and nice to Eun-gyo. If he were not an artist, he would look merely silly. Struggling with the carnal yearning created many good works in the history of literature, and the same thing can be said about Jeok-yoo's circumstance. Maybe his body remains old and wrinkled, but, what do you know, his aesthetical creativity in his heart is rejuvenated at full mode, so his desire is sublimated into his new work which is probably as good as that famous Nabokov's novel. With his new work, the situation gets more complicated due to the reason you should discover for yourself while watching the movie. While all these things happen, Ji-woo is not particularly happy about what is happening between his mentor and a girl. Though the movie is not successful in handling this triangle relationship between its main characters(I heard the book, written by Park Bum-sin, did a better job), we come to understand the true nature of the relationship between Jeok- yo and Ji-woo, who are bound to each other by the jealousy and admiration not in the way you expect. Between her co-actors, Kim Go-eun gives the best performance in the film as the character who is a lot more than the object of the desire. While radiating unadulterated charm around the screen, Kim Go-eum makes us believe her obliviousness to her effects on the other characters, and then she is convincingly transforms her character into a more active player in the story. She and Park Hae-il have a wordless scene when her character starts to sense the feelings inside the man she endearingly calls 'grandpa', and this eventually gives little poignancy to the bittersweet feeling of the last scene.",
         "Go-Eun Kim is perfectly cast in her role. She is perfection in a nearly perfect film. I hope, no I beg heaven to send her roles that allow her intellect and her natural grace to take deep roots. She has star quality and I don't use this term lightly. The question is what to do with all this talent? Given the depth and breath of contemporary Korean literature I hope for the best. Let us all send healing thoughts;protection from the star making machinery of the popular star. As a western viewer I see in Asian film a different structure to the stories told by Asian directors. The climax of the film comes very late. In Western film just about 47 to 54 minutes into the film the crises occurs with embarrassing regularity then the film winds down with a logical, if not predictable, outcomes. On re- viewing of Asian films (I always watch them 2 or 3 times) I see that the 47 to 54 minute window holds a cashe of motivating factors that makes the late climax feel like the wheels of fate have turned and the lessons for the future are planted in the ending. Different way of thinking. The reason that I bring this up in relation to thoughts about Go-Eun Kim is that she makes this poignantly readable, even to a cross cultural viewer. She has a je ne sais quoi that can not be denied. So I ask the God of film, (I am sure there is one) to care for this child of hers like a flower that should not be picked.",
         "The lines are drawn from the start. Seo Ji Woo character is weak from the get-go. His loyalties, perhaps could appear strong to some on the surface, are questionable from his very first reaction to Eungyo. Kim Go Eun (actress paying Eungyo) is very different from her appearance in the Goblin mini-series. While she tries to thread the story of tragic love, Eungyo is carefree, careless and not much of a deep thinker, unlike a similar high-school-aged character of the Goblin's bride. Eungyo disappoints. She knows Seo Ji Woo is shallow, jealous and self- centred. She is clearly repulsed by him and believing he is incapable if inspiration. And yet she takes his plagiarism at face value. It is difficult to imagine physical love between a 17 and a 70-year old. And this movie is not a fairy tale. But Eungyo going with Seo Ji Woo (who is still 13 years older than her) is boring and un-moving. Even at the end, when Eungyo finally \"gets it\", it is too little too late and good for no one. At the end the movie is about the tragedy of loneliness for all, the Professor, Seo Ji Woo and Eungyo. An all three seem to deal with it in a similar, somewhat dishonourable way. It is rare for a Korean movie not to jerk a tear in me. The closest this one comes to it is in the last five minutes where Eungyo realises what really happened. But there is no twist, there is nothing that makes your heart jump - something Korean cinematography usually achieves very well. Usually, the concept of Korean tragedy leaves you strangely inspired. Eungyo leaves you disappointed.",
         "I couldn't resist providing a positive review. Very rarely do I come across pure gold. A rather mature and debatable topic has been handled with grace, sensitivity and beauty. I cannot recall having seen anything as beautiful and amazing with similar topic. This production reminds me of 'My Rainy Days' (2009) 'Tenshi no koi' (original title). I take a bow to the whole production team, starting from the novelist who wrote the novel, to the editor who put it all together. Just because I'm being super critical that I am rating it as a 9/10 - it is near perfect anyway. Kim Go-eun is a very talented actress. Having seen her two other major productions I can truly appreciate her talent. I was waiting with baited breath for a proper ending for this beautiful experience. It was delivered to near-perfect expectation. The movie left me with a warm smile.",
         "This was a very tricky script to film whilst retaining plausible performances. Yet the result clearly is delicately, sensitively and authentically acted out, with immaculate pacing, intelligence and passion, carried by splendid camera work (especially the closeups), and astonishingly perfect music. At times the score felt more appropriate than anyone could ever have dreamed of. It is not without its flaws, but it is brilliant nonetheless. I am an instant fan of Korean cinema, pushing as it does so very much Hollywood material into the bin of mediocrity.",
         "\" Roethke referred to getting old as wearing the leaden weight of what I did not do. Just as your youth is not a prize for your efforts, my agedness is not a penalty for my faults.\" This film explores poetry in a way people understand poetry, some feel it , the way they see things becomes poetry. Age is not a punishment for something one did , they shouldn't carry the weight of inadequacy when feeling same things they did when they were young. Human connection shouldn't have expiration date . I like how this film shows human nature what one doesn't understand one wants to destroy and it saddens me , jealousy is nothing but destruction.Youth that lacks experience and modesty that is acquired with age.I like how this film by carefully selected visuals portrays feelings that you couldn't put into words , it has beautiful aesthetics. The whole film is masterpiece. Honesly i feel like any words i could try to select pale in comparison to this film i feel like you need to see it to know what i meant :}",
         "I first thought this would be one of those graphic and harsh/depressing film. But it actually turned out to be a warm romance movie to a degree. Sure, the premise may sound creepy but it's executed in a way where you actually feel for the old guy. Mainly because of the genuine heart of the man and the person he falls for. The two actors and the actress did a amazingly fine job bringing out the characters in a very natural manner. To the point it seemed like real characters. Another Korean movie called \"The Bow\" had something similar going on. But despite the artsy elements the characters were too mysterious and it didn't have enough to make the old guy to be likable and came about like a poor Hugh Hefner. While this was the opposite while having that artistic elements as well. Also the climax was not expected. 6.8/10",
         "I have watched very few Asian movies but each of them connects emotionally with the viewer, this was another one. Just like other Asian movies, it was slow in pace but the connection that it brings about was just amazing. The theme is unique in its own way and the plot has been well put by the Producer and Director of the movie. I just wished that somehow the movie had a happy ending. I was saddened when Eungyo felt prey to that wicked disciple. Also little frustrated that the old guy was so silent, if you have feelings, you need to let it out eventually. Hope the ending was perfect but still nice touching movie. The problem is the society, they have started to accept many things including same-sex marriages but a wide age-gap in relationship is still considered a taboo."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": ["Lee Jeok-yo is a 70ish year old man who is a respected poet. He cares fondly for his 30ish year old disciple Seo Ji-woo. The world of these two men are shaken when 17-year-old high school student Han Eun-gyo comes into the picture, as their mind and sexual desires are awakened."],
      "budget": 0
   },
   "movielensId": 149796,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2012-04-25",
      "dvdReleaseDate": null,
      "directors": ["Jung Ji-woo"],
      "runtime": 129,
      "movieId": 149796,
      "title": "Eungyo",
      "mpaa": null,
      "actors": [
         "Park Hae-il",
         "Kim Mu-yeol",
         "Kim Go-eun",
         "Jeong Man-sik"
      ],
      "imdbMovieId": "2390253",
      "originalTitle": "은교",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["jphHmAVTmmA"],
      "plotSummary": "Renowned 70-year-old poet Lee Jeok-yo falls for a 17-year-old girl named Eun-gyo. Upon realizing his love for the teenager, the poet goes through emotional turmoil and self-destruction, while willing to give up his fame as one of the nation’s most respected literary figures. Involved in the love triangle is Lee's student Seo Ji-woo, a novelist in his 30s who also becomes obsessed with the girl.",
      "tmdbMovieId": 118451,
      "avgRating": 3.75,
      "releaseYear": "2012",
      "numRatings": 6,
      "posterPath": "/yjlW5G1XSrX967ssLnhJI7YwkvS.jpg"
   }
}