{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pilot",
            "id": 3203
         },
         {
            "name": "storm",
            "id": 14527
         },
         {
            "name": "gulf of mexico",
            "id": 191296
         }
      ],
      "imdb_id": "tt0023878",
      "video": false,
      "title": "Central Airport",
      "recommendations": [],
      "backdrop_path": "/dtoHHjCRBkDUhvPbVSSfLq5XDRo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "James 'Jim' Blaine",
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e2809",
               "name": "Richard Barthelmess",
               "profile_path": "/sZVQW3SyQvNIctH0svsVU4M7WHb.jpg",
               "id": 13789,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jill Collins",
               "gender": 1,
               "credit_id": "52fe4a3e9251416c750e280d",
               "name": "Sally Eilers",
               "profile_path": "/licqJqTgFOz8BQoBcxB31pZoRNU.jpg",
               "id": 120534,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Neil 'Bud' Blaine",
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e2811",
               "name": "Tom Brown",
               "profile_path": "/gHteMYdsKoKLKGgY9cA65WjPEjg.jpg",
               "id": 89687,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mr. Blaine",
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e2815",
               "name": "Grant Mitchell",
               "profile_path": "/cDZpWgH0qOF4L5nmZJzGIHE5xo3.jpg",
               "id": 30215,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Eddie Hughes",
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e2819",
               "name": "James Murray",
               "profile_path": "/6vkBosrnYCIAKJo0LWbW97T1PkW.jpg",
               "id": 29986,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Mrs. Blaine",
               "gender": 1,
               "credit_id": "582e39fac3a368773001060d",
               "name": "Claire McDowell",
               "profile_path": "/rCujOYWgzRTZls7bRvrEFdxccrW.jpg",
               "id": 29974,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Havana Airport Manager",
               "gender": 2,
               "credit_id": "582e3a02c3a368772d00ea3f",
               "name": "Willard Robertson",
               "profile_path": "/obv0gmpXV3hGpnUKQVInkBPKBcA.jpg",
               "id": 103620,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Amarillo Airport Manager",
               "gender": 2,
               "credit_id": "582e3a0ac3a368773300d7d8",
               "name": "Arthur Vinton",
               "profile_path": null,
               "id": 34761,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Hotel Maid (uncredited)",
               "gender": 1,
               "credit_id": "582e3a1d925141094800ecc0",
               "name": "Louise Beavers",
               "profile_path": "/m0b2RGOMTa8yUhremaQMlpc72uc.jpg",
               "id": 89101,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Doctor (uncredited)",
               "gender": 2,
               "credit_id": "582e3a25925141094e00da16",
               "name": "Harry C. Bradley",
               "profile_path": null,
               "id": 948509,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Hotel Desk Clerk #3 (uncredited)",
               "gender": 2,
               "credit_id": "582e3a2ec3a368773900d708",
               "name": "Lester Dorr",
               "profile_path": "/l6iPmfBJvMLyTTcZkJZ4MNx1WaJ.jpg",
               "id": 121122,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Little Girl in Wreck (uncredited)",
               "gender": 1,
               "credit_id": "5a2731e10e0a264cd00f6dd3",
               "name": "Betty Jane Graham",
               "profile_path": null,
               "id": 1935903,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Amarillo Radio Operator (uncredited)",
               "gender": 2,
               "credit_id": "5837c62e925141319e01d44a",
               "name": "Charles Lane",
               "profile_path": "/wu5fTupk5atyJlCsHhXPGcdf8Mg.jpg",
               "id": 29579,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Hotel Desk Clerk #2 (uncredited)",
               "gender": 2,
               "credit_id": "582e3a37c3a368772600d5f7",
               "name": "John 'Skins' Miller",
               "profile_path": null,
               "id": 1027429,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Drunk in Wreck (uncredited)",
               "gender": 2,
               "credit_id": "5837c653c3a36836a601fa2b",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Co-Pilot in Wreck (uncredited)",
               "gender": 2,
               "credit_id": "5837c683c3a36836a001af89",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Air Show Observer (uncredited)",
               "gender": 0,
               "credit_id": "5837c69f92514131a101c557",
               "name": "Toby Wing",
               "profile_path": "/sEKrEzME3Bqwd8WPEVh79hoxP9p.jpg",
               "id": 1018113,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e27f9",
               "name": "William A. Wellman",
               "profile_path": "/m0RSN7IQTXF9ZFUrqoZJUzZqu02.jpg",
               "id": 14643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a3e9251416c750e27ff",
               "name": "Jack Moffitt",
               "profile_path": null,
               "id": 82802,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e2805",
               "name": "Rian James",
               "profile_path": null,
               "id": 29994,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "582e39c0925141095100dde0",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "582e39c9c3a36879c1007cef",
               "name": "Howard Jackson",
               "profile_path": null,
               "id": 29276,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "582e39d0925141095d00e84f",
               "name": "Bernhard Kaun",
               "profile_path": null,
               "id": 29810,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "582e39d6c3a368772d00ea00",
               "name": "Sidney Hickox",
               "profile_path": null,
               "id": 13972,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "582e39ddc3a368773300d7a1",
               "name": "James B. Morley",
               "profile_path": null,
               "id": 1345303,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582e39e3c3a368772600d5a4",
               "name": "Jack Okey",
               "profile_path": null,
               "id": 17763,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "582e39ea925141095700e733",
               "name": "Orry-Kelly",
               "profile_path": null,
               "id": 4127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.391714,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 99729,
      "vote_count": 4,
      "budget": 0,
      "overview": "Aviator Jim Blaine and his brother Neil are rivals not only as daredevil flyers, but also for the love of parachutist Jill Collins.",
      "similar": [
         27932,
         87502,
         363676,
         813,
         7227,
         29723,
         5559,
         676,
         744,
         857,
         409,
         594,
         858,
         141,
         296098,
         786,
         2567,
         374720,
         296524,
         1597
      ],
      "original_title": "Central Airport",
      "runtime": 72,
      "poster_path": "/sqwlVQ220OHrb9TLmfixyVdhutQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "First National Pictures",
            "id": 3245,
            "origin_country": ""
         },
         {
            "logo_path": "/71U7rE3nvZs3Fn7ztk8I9TATahT.png",
            "name": "The Vitaphone Corporation",
            "id": 9329,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1933-04-15",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A Man's Courage and a Woman's Faith Put to the Supreme Test",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "William A. Wellman",
         "Alfred E. Green"
      ],
      "runtime": 72,
      "synopsis": null,
      "writers": [
         "Rian James",
         "Jack Moffitt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023878/",
      "coverLink": null,
      "actors": [
         "Richard Barthelmess",
         "Sally Eilers",
         "Tom Brown"
      ],
      "reviews": [
         "How can this possibly have only a 5.4 average out of 10? This was one of the most intense and delightful and fascinating pre-code films I've ever seen! Former silent star Richard Barthelmess does a superb job playing this down and out, daredevil airplane pilot. Sally Eilers is very modern and natural as his girlfriend. Tom Brown is perfectly gentle and sweet as the younger brother who falls in love with his brother's girl. Watch the sparks fly between them all. This movie is very frank about sexual attraction. Richard's character sleeps with Sally's but doesn't want to marry her. Younger brother innocently comes between them but is smart enough to propose marriage and get the girl his brother has a yen for. Excellent atmospheric aerial stuntwork. My favorite scene, when Sally's character parachutes to safety after a crash and Richard's character saves her from the tree. The parachute falls on top of them and when they get out Richard is quite obvious about admiring certain aspects of her derriere. I was laughing like crazy. Totally wonderful. Don't miss this one when it next airs on TCM. It's great. I give it a 10 out of 10!",
         "William Wellmann, who directed one of the most exciting silent films ever made, 'Wings' (1927), here returns to the skies with another rip-roaring story of dare-devil fliers. Wellmann had been an air ace in World War One, and no one knew biplanes like he did. Here they are, stunt-flying, crashing, exploding in the air, and everything you can think of, plus a fascinating glimpse of commercial air operations in 1932 as well. And there is a good strong story, excellently played by the sombre Richard Barthelmess (the silent star who made several films with D. W. Griffith), Sally Eilers and Tom Brown. Eilers is a real sizzler. Such a relief to see a real woman with real fire and character instead of one of those photofit botoxed dummies who play in movies in today's Hollywood and all look identical. The story is a sad one, played with genuine pathos, and well directed. Towards the end of the film there are some extraordinarily thrilling scenes of danger and rescue, and what must be the most ingenious blind landing in thick fog ever thought of. I dare not give away the ingenious aspects of that particular episode. The character played by Barthelmess is very like Wellmann himself, a truly wild hell-raiser in the air. Anyone who likes early aviation would love this film, and it's very rewarding for anyone who likes good solid entertainment, love, tears, and non-stop action all combined in a kind of delectable Wellmann omelette.",
         "Very good \"Precoder\" starring Dick Barthelmess, which in a way, kind of reminded me of Hawks' \"Only Angels Have Wings\" (1939), in which Barthelmess also acted. This film was directed by masterful William Wellman, who was responsible for the landmark aviation Silent picture \"Wings\". Barthelmess plays a devil-may-care airplane pilot, who is a blamed for an aviation accident. Afterwards he meets and falls for pretty Sally Eilers, who participates as part of an Act in an itinerant Air Circus; but when Barthelmess' brother appears in scene, a triangular relationship ensues. \"Central Airport\" has many thrilling moments and some moving and touching scenes too, thanks to the great chemistry that develops between Barthelmess and Eilers (who, in my opinion, in this film resembles very much actress Dorothy Mackaill). Tom Brown is good as Barthelmess brother, fresh from his success in Wyler's \"Tom Brown of Culver\". Great special effects, good flying stunts, swiftly paced film; in all, highly entertaining. Don't miss it when TCM airs it again.",
         "Central Airport is the story of a pilot named Jim (Richard Barthelmess) who has one bad flight in over 4000 hours and is forced to give up commercial flying. He meets a beautiful girl named Jill (Sally Eilers) and the two start up an act involving flying and stunts. The two start a relationship, but when Jim is hurt, his brother (Tom Brown) takes over the act for a while and falls for his brother's girlfriend. From there, things get exciting and terribly terribly sad. This film is a pre-code because of several reasons. First, Jim and Jill have consummated their relationship without being married and with no intention of having a wedding. Second, Eilers is shown in her underwear, and absolutely restricted scene when the Production Code came into effect. This film does not skimp on the dramatic love triangle and in consequence ends bittersweetly.",
         "Having seen thousands of older movies, I can't help but think that this movie seems like many other films of the era, as several the main plot ideas has been often repeated. Here it is in a nutshell: An airline pilot (Richard Barthelmess) is blamed for his plane crashing and is forced to find other work. Eventually, he joins a woman in a traveling barnstorming show. It's obvious they care a lot for each other, but the man foolishly tells her that people in their dangerous line of work shouldn't marry. Soon, his brother (who literally looks to be only about 16 years-old) comes to work with them and eventually the brother and the lady marry--leaving Barthelmess feeling pretty rotten as he's tremendously attracted to his partner/new sister-in-law. So, he quits the air circus and goes abroad--taking any dangerous job he can find. At the same time, his newly married brother finds more responsible work flying for an airline. But, when the brother's plane is lost, Barthelmess just happens to be nearby and at tremendous risk to himself saves the brother and the surviving passengers. However, at the end, Barthelmess is still the \"5th wheel\" and disappears--back to a life of crazy and dangerous flying in order to exorcise this woman from his memory. The film is obviously a soap opera and is pretty entertaining though very predictable and clichéd. Barthelmess is fine in the lead, but he looked a lot cooler towards the end of the film, as he wore a nifty eye-patch--though I wondered how with his lack of depth perception he was able to fly so well! Oh well, this isn't the sort of film that logical details are that important. By the way, there is a plane crash scene about midway through the movie and if you look closely, you'll notice that the biplane (with 2 wings) becomes a monoplane (with only 1) on impact! Sloppy stuff, but still worth a look.",
         "There's more to this movie than John Wayne in a bit part, there are some spectacular flying scenes involving a train, sincere performances by Richard Barthelmess and Sally Eilers, a strange one by Tom Brown. Except for the flying, there's very little sign of Wellman's directorial expertise in cinematic storytelling (unusual for his 30's films), but it's likable and entertaining enough. Interesting crash scenes, and the sexual aspect of the story is somewhat shocking while being quite tastefully depicted. * * *",
         "Other than fans of John Wayne who want to see if they can spot the Duke in a film where he has no lines at all, the main reason to see Central Airport is a very exciting air/sea rescue sequence. Of course aviation fans will love seeing all the vintage planes, it seems like between them Richard Barthelmess and Tom Brown flew about everything there was circa 1933. Barthelmess is a commercial pilots who makes a bad call in trying to fly through bad weather and cracks up. He loses his ticket, no airline will hire him, so he's reduced to scratching for a living in the aviation game. That matters not to his brother Tom Brown who worships Barthelmess. Both of them become rivals for aviatrix Sally Eilers, but when Barthelmess says fliers shouldn't get married, she teams up with Brown. Of course later on when one of the brothers cracks up at sea, the other flies to rescue him. That's the best part of the film, every bit as exciting as the landing of that much larger commercial plane at San Francisco International airport in William Wellman's The High and the Mighty. In fact Central Airport is the trick answer to the trivia question what is the first film Wellman directed John Wayne in. Not either of the classic The High and the Mighty or Island in the Sky, or the less successful and non-aviation story Blood Alley. This one where Wayne is a co-pilot of one of the wrecks. Central Airport is a routine soap opera made better than it is by the rescue scene. For fans of aviation films in general, William Wellman in particular and those who want to spot the Duke.",
         "Richard Barthelmess plays Jim Blaine, an airplane pilot with over 4500 hours in the air when his plane crashes and he is unfairly held at fault for the incident. After he recovers from his injuries, he returns home where he finds his brother Neil (Tom Brown) has also gotten the flying bug. Jim voluntarily gives up flying knowing that no company will hire him after he has been branded as he has been. Later, working as a teller, he encounters stunt flyer Jill Collins (Sally Eilers) after her parachute lands her in a tree. Shortly thereafter her partner and brother is killed in a crash, and Jim asks for the job of piloting her plane in the air circus. She gives him that chance and soon sparks are flying between the two both in the air and on the ground. However, there is one problem. Jim has seen enough death in the air to dissuade him from the responsibility of a family given that he might not be around to support them. This is an opinion he voices often much to the disappointment of Jill. After an accident at the air circus that lays Jim up in the hospital for over a month, brother Neil offers to take over for Jim in the air circus. While recuperating, Jim has a change of heart and catches up to the air circus with a proposal ready for Jill. However, the dynamics between the three - Jill, Neil, and Jim - shift mightily when Jim surprises his brother and Jill and finds them snuggling close together - in bed. Not only is this film daring sexually, it is still quite interesting and exciting today, especially the aerial sequences. Since director William Wellman was a flyer himself, this does not surprise me. What does surprise me is that Richard Barthelmess just never seemed to score a hit with 30's audiences in spite of some strong performances in some very good pictures of which this is one. Someone has already mentioned the other pre-code element of this film, but it's worth mentioning again particularly considering the red scares of the time. Late in the film Jim jumps into his plane which bears the marking of his mercenary wanderings as a pilot. The plane has several flags on it which I didn't recognize, but it had one symbol that is universally recognizable even today - the hammer and sickle. It is mentioned earlier in the film that Jim had been flying for a faction in a civil war in China, so apparently Jim was working for the Communist Chinese, who were fighting on the mainland as early as the 1920's. To me this was a daring piece of symbolism even for the pre-code early 30's. Highly recommended if you like good action films and precode cinema.",
         "Many of the earlier comments are right on the money, but some, well, not so much. This Is hardly a 'B' movie...it's well produced, the live flying sequences are really superb, and the model sequences are first rate. It's no \"cheapie\". Ricard Barthelmess is quite good in this, and it makes a a nice companion piece for \"Only Angels Have Wings\". If you want to spot John Wayne, spot J. Carrol Naish first, they end up together. Tom Browne is juvenile enough (and somewhat dull), but when they saddle him with the most pathetic pencil-mustache in Hollywood history, it makes his character even less believable. Sally Eilers is much more so. As for later influences, this is Wellman in the early Airliner-in-Distress zone...the opening sequence of this film, with the Airline Operations guy arriving at the \"Grand Central Airport\" would have fit very nicely into \"The High and the Mighty\"...just imagine Regis Toomey...and a 1955 Buick.",
         "Central Airport (1933) ** 1/2 (out of 4) Some great action and stunts are ruined by some boring melodrama that doesn't add up to much. James Blaine (Richard Barthelmess) moves back home after he crashes a passenger plane and is blamed for it. He gets a job working in a carnival air show where he falls in love with a woman (Sally Eilers) but can't see himself marrying anyone. Enter the man's brother (Tom Brown) who also falls in love with the woman, which causes James to lose it. CENTRAL AIRPORT has some truly great stuff but sadly they're wasted in some boring love triangle that really never makes any sense and at the end of the movie it's really not cleared up either. Director William Wellman gets the sole credit on the film but he was replaced by Alfred Green for a number of weeks when he came down with the flu. I really do wonder which scenes Green actually directed but I've seen enough Wellman movies to where I can comfortably say that Green was in charge of the love stuff. I say that because the majority of these scenes contain no life, no energy and no atmosphere, which certainly wasn't what you'd expect from Wellman. The scenes that you can tell the wild man director contain some rather risky pre-code material including a strong bit of sexuality early on when James meets the woman as well as towards the end when they're reunited. This is 1933 we're talking about and even though the woman is married to the younger brother we get scenes where she and James are kissing mouth to mouth. That there would certainly not have happened a year later when the code was forced. Most of the stuff dealing with the younger brother simply never adds up, isn't very believable and is just downright lifeless. The performances are a mixed bag with Eilers easily stealing the show as the woman caught in the middle. She's probably best remembered for appearing in a few of the Buster Keaton/MGM titles but she really delivers a strong performance here and her undressing, pre-code moments are certainly memorable as well. Barthelmess isn't too bad in the lead but he really doesn't bring much energy. I found Brown to be incredibly boring in his role as the brother and quite annoying as well. People will want to keep their eyes open for John Wayne who appears in the final wreck sequence but doesn't have any lines. CENTRAL AIRPORT contains some amazing stunts, wonderful aerial work and some nice pre-code moments but sadly all of this gets caught up in a silly love story that just never works.",
         "The only real evidence of the directorial touch (often a fist) of Wild Bill Wellman here are the well-done aviation scenes and the sexual tension. As a pre-code entry, Central Airport has a handful of scenes that would undoubtedly be axed a year later--- Dick and Sally canoodle in adjoining hotel rooms without the dubious benefit of marriage and the plot would've probably been reworked. As it goes, it's pure soap involving lost love and a few assorted body parts. Richard Barthemless's career was on the wane by 1933 and it's not hard to tell why. He's stiff and his acting style is far more suitable for silents. With the novelty of talkies worn off, Central Airport had to be one of Warner's biggest budgeted gambles of the year. It boasts some decent special effects and the crash scenes (and there's more than one) must've been spectacular for depression-era audiences who treated pilots back then like we saw astronauts in the 1960's. Whines: John Wayne's part defines the term 'bit'--- he's barely in the movie and you practically have to keep your eyes peeled to spot him (his other notable 1933 walk-on was in Warner's Babyface, but at least he's given some lines)--- back to the Warner's Lone Star low-budget oaters for him until John Ford decides he deserves another A-picture shot after a decade as a sometimes singin' cowboy. I also spotted WB chorus girl Pat Wing (Gill) (not credited by IMDb) in a crowd sequence standing horrified behind an announcer--- her ravishing sister, Toby is credited as originally being cast but apparently became an editing room casualty. Look for the still-breathing Charles Lane as a radio operator early on (happy 100th Mr. Lane!). I love pre-code talkies... Central Airport is by no means the best of the lot but it has just enough ingredients thrown in to hold your interest. If you want to see a far better example of 1933 Bill Wellman, see Wild Boys of the Road.",
         "William Wellman liked flying and liked action, and there's plenty of both in this quick- moving Richard Barthelmess drama. He's a commercial pilot who's fired after a crash, then becomes a daredevil pilot for a parachute jumper (Sally Eilers, more than competent), then gets involved in an uncomfortable triangle when she falls for both him and his brother (Tom Brown, who seems too callow for the part), then becomes a devil-may-care mercenary pilot flying for various international political insurgencies. It's all over in under an hour and a half, much of which is spent in the sky, and climaxes with a daring sequence of one brother rescuing another in a deadly storm off the coast of Cuba. It could never happen that way, and would Barthelmess even be allowed a pilot's license, after losing an eye and a heel and demonstrating a noticeably unsafe, cavalier flying style? The ending isn't altogether satisfying, either--the writers have boxed themselves into a corner where we want Eilers to end up with one brother far more than the other. But it's an exciting journey, with some refreshing pre-Code elements, and Barthelmess was always good in these brooding roles.",
         "William Wellman knew his stuff when it came to airplanes and proof of this are the early scenes in CENTRAL AIRPORT when Richard Barthelmess witnesses a stunt flier going through some dangerous routines alongside an onrushing train. We later find out that the flier is Richard's brother (played by Tom Brown). But the numerous flying scenes are the only compensation in this pre-code aviation drama about two brothers in love with the same woman (Sally Eilers), herself a stunt pilot for a circus. And there's a \"meet cute\" scene when she and Bartholomess first meet and she's stuck in her parachute atop a tree limb. Unfortunately, their story goes downhill from this point with some racy pre-code scenes thrown in during their bumpy romance. However, the story of two brothers in love with the same girl is tired stuff, used so often by Warner Brothers that it became a big cliché in films like \"Wings of the Navy\" ('39) where Navy pilots George Brent and John Payne both love Olivia de Havilland. The book \"Warner Brothers Presents\" sums up CENTRAL AIRPORT in one sentence: \"Airplane stuff well done, despite deficiencies in every other department.\"",
         "Although they are not at their relative best in this rather routine drama, actor Richard Barthelmess (as Jim Blaine) and director William A. Wellman make \"Central Airport\" worth visiting. Mr. Barthelmess is in a familiar role as an accident prone World War I pilot. He catches Sally Eilers (as Jill Collins) hanging from a tree, after a parachute drop. This funny/sad sequence, early in the film, is a highlight - Ms. Eilers and Barthelmess have a great meeting, which is immediately followed by great tragedy. Although the two fall in love, Barthelmess won't marry; he thinks daredevil pilots are unstable husband material (a keen observation). Instead, Eilers marries Barthelmess' little brother Tom Brown (as Bud Blaine). Eilers appears in a far too brief scene in her slip, by the way (about 30 minutes into the running). Later on, an interesting scene occurs with Barthelmess and Eilers in separate rooms, divided by a wall; then, the camera moves is a way which pleasantly violates the \"Fourth Wall\" rule (showing the set). Another notable sequence occurs later in the film, near the end; wherein, John Wayne appears as an extra. Mr. Wayne plays Mr. Brown's co-pilot, on a downed plane, to the left of your screen. He tries to save a drunken passenger. A somewhat unpredictable ending keeps the film above average. ****** Central Airport (4/15/33) William A. Wellman ~ Richard Barthelmess, Sally Eilers, Tom Brown",
         "A fairly straight forward storyline. Not totally predictable nor over-simplified. The sex scenes, (did I say sex?) are tame by today's standards but are remarkable considering the era. That \"Central Airport\" got past Hays commission with a story line suggesting an unmarried man and woman would spend the night together in the same room and not in the coy way of Frank Capra's \"It Happened One Night\". This is a good movie if you are a fan of vintage aircraft, especially Ford Tri-Motors. Someone correct me if I am wrong, but that airport terminal building used in the Havana scenes looks like the old Grand Central Air Terminal that was located in Glendale.",
         "This is an entertaining film from 1933 with Richard Barthelmess,(Jim Blaine) and his brother, Neil Blaine, (Tom Brown) competing against each other as daredevil fliers and a gal named Jill Collins,(Sally Eilers) who is a parachutist and performs at a great many air shows. There is one scene when there is a plane crash and a rescue through poring rain and fog which involved two adults and a small female girl. The general public were alerted and everyone came to the airport to assist in any way that they could at the runway. There is a sad part to this film concerning love which cannot be fulfilled. This film is a B film and William Wellman did his very best to make this film into another \"Wings\" success, but it failed greatly.",
         "Loved the shots of airports -- Dallas, Phoenix, Fresno, etc., just single buildings with the name in block letters on the roof. And the tri-motors, and the well-dressed passengers. Fast-forward 75 years.... But what really got to me was the hammer and sickle emblem and what appeared to be a Chinese ideogram adjacent the logo, aft of the pilot's seat on the starboard side of the fuselage. Remember when the mutual acquaintance Neil and Jill encounter says that Jim'd become a general in a Chinese rebel army? That, based on the hammer and sickle, could only have been the People's Revolutionary Army of Mao Tse Dung!!! Never mind the undies and the unwed twosome in bed -- would that logo and that reference have survived during the Cold War? Additional observation 12/27: This film of the 30's with the soviet emblem may/must also reflect the influence on and charm of communism in Hollywood and much of America during the Depression. Adds to the historical value of this terrific film. Also I liked the American Dream aspects of two guys from Winnemucca taking at least part of the world by storm, Red-Blooded (literally and copiously in Jim's case)American Boys. Others have commented more ably than I on the aerobatics, etc. I loved it all. This gem deserved more than the mere 1.5 stars Osborne and Co. rated it on TCM, if only for recording parts of American history of the early 30s.",
         "This is a 30s B movie with an expectedly hackneyed story and script, concerning feudalism between a pilot and his grounded brother when the latter marries the former's parachuting partner (headache yet?). This really is jobbing for such a director as that of the 1927 silent aerial epic 'Wings'. However, there are a few surprises. Wellman's direction does benefit from his own previous aerial experience, all the more interesting in such a comparatively early sound film and to an extent offering more insight into his direction on the previous film. The acting is also admirably serious, with the exception of pretty boy Brown. Wayne however, for the sake of the purists, only offers a few seconds of screen time, and the film's overall creakiness is more than a little painful.",
         "Whilst appearing in this film, the 26 year old John Wayne got married to Josephine Saenz on the 24th June 1933. He was closely being associated with the western genre film, but took time out to appear in a variety of other films like this one.",
         "Three excellent but under-rated actors as well as some wonderful aerial stunts lift this above the run of the mill pilot buddy movie. Sally Eilers had shown what she was capable of in \"Bad Girl\" but then Fox forgot about her and by 1933 her career was on the slide. Tom Brown, in my opinion, was one of the best up and coming young actors of the early thirties, but like a lot of the sensitive ones, by the mid 30s his career had petered out. This was director William Wellman's first aviation drama set in peace time. \"Wild Bill\" was most at home with movies dealing with the camaraderie between professionals in the face of danger because that was how he had lived his life, being first a fighter pilot in the elite Lafayette Flying Corps during the last year of World War 1 (he was awarded a Croix de Guerre). This action packed movie about the hazardous life of pilots had the wonderful Richard Bartelmess as Jim Blaine, a \"cracked up\" pilot, on his way home to a steady, boring job as a bank teller. His plane had gone missing during a fierce storm and while he was found safe, officials blamed his cowboy antics for ignoring the storm warning and he was blacklisted!! During the train ride home he is dazzled by some amazing stunt flying (the first of several scenes throughout the movie) and he is even more surprised to find it is his younger brother Neil (Brown) who hangs around just long enough to inform his family that he has taken a job at Lockheed. Jim meets Jill (Eilers in a very unsympathetic role), a parachutist with a traveling air show, in a very cute scene that involves her being stuck up a tree. When the air show leaves town Jim, who is fed up with life on the land, goes with it as Jill's pilot and in a very revealing scene, shows just how close they have become - connecting doors in hotels, always left ajar. Once during a fight Jill locks her door and Jim kicks it in frustration!! But Jim honestly tells Jill he could not think of marrying, flying being too hazardous a business and that's what Jill really wants. And that scene is supposed to garner sympathy for Jill when she finds herself on the road with Neil - but it doesn't, it just makes her appear like a two timing floozie!! When Jim returns (he has been recuperating in hospital after yet another \"crack up) to find Neil and Jill in bed together, Jill tells him that they were married and that Neil wanted to give her what Jim wouldn't - a wedding ring!!! The film then proceeds to show that Jill married the wrong brother whether it is her far away look when garrulous friend Eddie (James Murray in a very short, short scene that belies his co-star billing) talks about what Jim is doing nowadays (Jim, not surprisingly had stormed out when he found them both in bed) or the sparks that fly when Neil is sent on a mercy mission and Jill finds she hasn't lost her feelings for Jim!!! The climatic scene features a thrilling rescue as Neil's plane crashes down on uncharted waters!!! The wonderful aerial stunt work almost makes you forget the sordid story. Wellman had reason to be thankful for \"Central Airport\". He considered the movie too routine and beneath his capabilities so as a punishment he was sent to MGM's B unit, along with Loretta Young for \"Midnight Mary\". It was a big money maker and he came back to Warners for \"Wild Boys of the Road\" and \"Heroes for Sale\"."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["First National Pictures"],
      "summaries": [
         "Commercial pilot Jim Blair is blackballed after his plane crashes in a thunderstorm. Depressed, he begins working as a bank teller until he meets beautiful Jill Collins, a barnstorming parachutist working with her daredevil pilot brother. Jim's immediately attracted, and when her brother's killed in a freak crash, he reveals his past to her and volunteers to replace her dead sibling in their air carnival act. As they tour throughout the Southwest, their affection turns physically intimate when they're on the road as they characteristically sleep in adjoining hotel rooms. Jill wants marriage but is resisted by Jim, who believes that his risky lifestyle precludes the luxury of a wife and family. When Jim's brother Bud joins them, he too is immediately attracted to Jill but respects his brother's relationship, However, after another freak accident puts Jim in the hospital for a prolonged convalescence, Jim returns to find them married and in bed together. Angry and bitter, he becomes a soldier of fortune and loses an eye and a leg flying for the Communist rebels in China and Chile. After a prolonged estrangement, a chastened Jim goes to Cuba to rejoin Bud and Jill but finds his brother's plane has gone down in a storm in the Gulf of Mexico. With only a short window of opportunity to save Bud and his passengers, Jim volunteers to go into the storm to save his brother.",
         "Aviator Jim Blaine and his brother Neil are rivals not only as daredevil flyers, but also for the love of parachutist Jill Collins."
      ],
      "budget": 356000
   },
   "movielensId": 149864,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-04-15",
      "dvdReleaseDate": null,
      "directors": ["William A. Wellman"],
      "runtime": 72,
      "movieId": 149864,
      "title": "Central Airport",
      "mpaa": "",
      "actors": [
         "Richard Barthelmess",
         "Sally Eilers",
         "Tom Brown",
         "Grant Mitchell",
         "James Murray",
         "Claire McDowell",
         "Willard Robertson",
         "Arthur Vinton",
         "Louise Beavers",
         "Harry C. Bradley",
         "Lester Dorr",
         "Betty Jane Graham",
         "Charles Lane",
         "John 'Skins' Miller",
         "J. Carrol Naish",
         "John Wayne",
         "Toby Wing"
      ],
      "imdbMovieId": "0023878",
      "originalTitle": "Central Airport",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["OiorUGSwgCM"],
      "plotSummary": "Aviator Jim Blaine and his brother Neil are rivals not only as daredevil flyers, but also for the love of parachutist Jill Collins.",
      "tmdbMovieId": 99729,
      "avgRating": 2,
      "releaseYear": "1933",
      "numRatings": 2,
      "posterPath": "/sqwlVQ220OHrb9TLmfixyVdhutQ.jpg"
   }
}