{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1825974",
      "video": false,
      "title": "Swooni",
      "recommendations": [],
      "backdrop_path": "/sTDGdkZZOrki3q6HJfaC1g57glt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4892c3a368484e0ffd51",
            "name": "Kaat Beels",
            "profile_path": null,
            "id": 568633,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.007154,
      "production_countries": [],
      "id": 73222,
      "vote_count": 0,
      "budget": 0,
      "overview": "6 personages. 24 uur. Een hotel middenin een hittegolf in Brussel. Anna en Hendrik hebben het allemaal: een toffe zoon, een goeie job, een mooi huis… Het huwelijksfeest van Anna’s zus doet hen echter nadenken over de keuzes die ze gemaakt hebben. Violette wil zich voor ze sterft verzoenen met haar dochter Vicky, die als kamermeisje in het hotel werkt. Maar Vicky lijkt niet zo snel geneigd om het conflict bij te leggen. Ze ontfermt zich over Joyeux, een kleine Afrikaanse vluchteling die zich in het hotel verschuilt voor de politie...",
      "similar": [],
      "original_title": "Swooni",
      "runtime": 90,
      "poster_path": "/3CtJah2hIINHmii6uNvR0QGSO4s.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-08-24",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.swooni.be/",
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kaat Beels"],
      "runtime": 83,
      "synopsis": "In Swooni kruisen de levens van zes mensen elkaar in een luxe-hotel. Terwijl een hittegolf de stad besluipt, lopen de emoties hoog op. Swooni is een verrassend mozaïekverhaal over hoop en vertwijfeling, passie en verraad, waarin niemand bij het uitchecken nog dezelfde is...",
      "writers": [
         "Michel Sabbe",
         "Annelies Verbeke"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt1825974/",
      "coverLink": null,
      "actors": [
         "Natali Broods",
         "Enrique De Roeck",
         "Sara de Roo"
      ],
      "reviews": ["A film about what's going on during an ordinary day in a big city hotel. The problems of the management, the peculiarities of the guests, the routine of the staff. There's a marriage going on in the hotel, and someone is having an affair. Then, a dramatic event happens that changes everything. Sounds familiar? Yes, it's the plot outline of 'Bobby', the movie about what was going on in the Ambassador Hotel in Los Angeles the day Robert Kennedy was killed. But also of Swooni, the first feature film by Belgian director Kaat Beels. There are quite a few similarities between the two movies. Swooni focuses on six persons who see their lives changed during one day in a Brussels hotel. There's a mother and her daughter, a man and his wife, as well as her lover. And then there's Joyeux, a small kid who's fled an African country with his father, but lost him during the trip and hopes to meet up with him in the hotel. The dramatic event in the end is about him. Beels knows how to make her characters interesting. We feel the doubt of the woman who has to choose between her sweet but somewhat boring husband and her romantic but superficial lover. And we understand the feelings of the lesbian chambermaid who suddenly sees the opportunity to become a mother, but has to abandon this plan when the circumstances change. The film is interesting enough, but could use some more sharp edges. It's a made-by-the-book movie, but it could use an unexpected twist or weird character. It's decent, like Anna's husband, but not exciting, like her lover. But then again, in the end she chooses decency."],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Eyeworks Film & TV Drama"],
      "summaries": ["In a luxurious hotel, the lives of 6 people cross. A story about love, life and the search for happiness."],
      "budget": 0
   },
   "movielensId": 150068,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-08-24",
      "dvdReleaseDate": null,
      "directors": ["Kaat Beels"],
      "runtime": 90,
      "movieId": 150068,
      "title": "Swooni",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "1825974",
      "originalTitle": "Swooni",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "6 personages. 24 uur. Een hotel middenin een hittegolf in Brussel. Anna en Hendrik hebben het allemaal: een toffe zoon, een goeie job, een mooi huis… Het huwelijksfeest van Anna’s zus doet hen echter nadenken over de keuzes die ze gemaakt hebben. Violette wil zich voor ze sterft verzoenen met haar dochter Vicky, die als kamermeisje in het hotel werkt. Maar Vicky lijkt niet zo snel geneigd om het conflict bij te leggen. Ze ontfermt zich over Joyeux, een kleine Afrikaanse vluchteling die zich in het hotel verschuilt voor de politie...",
      "tmdbMovieId": 73222,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/3CtJah2hIINHmii6uNvR0QGSO4s.jpg"
   }
}