{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "villa",
            "id": 885
         },
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "pianist",
            "id": 14743
         }
      ],
      "imdb_id": "tt0058949",
      "video": false,
      "title": "The Battle Of The Villa Fiorita",
      "recommendations": [],
      "backdrop_path": "/m6HWnIXcEPojlb4kE2JsxzhwU4i.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Moira",
               "gender": 1,
               "credit_id": "52fe4e5cc3a36847f828c1e3",
               "name": "Maureen O'Hara",
               "profile_path": "/pUcGzm9o8HnKQU1MGA6fVnOxt0W.jpg",
               "id": 70035,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lorenzo",
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c1e7",
               "name": "Rossano Brazzi",
               "profile_path": "/bhFXDKu6ldldNFowgS0xE5a27cE.jpg",
               "id": 29327,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Darrell",
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c1eb",
               "name": "Richard Todd",
               "profile_path": "/asmQq1hLKEHiBQdQvvO4jXzfrNg.jpg",
               "id": 20393,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Margot",
               "gender": 1,
               "credit_id": "52fe4e5cc3a36847f828c1ef",
               "name": "Phyllis Calvert",
               "profile_path": "/kyRYCX1s9mzLc5lkr8imsYVIJcS.jpg",
               "id": 89534,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c1f3",
               "name": "Martin Stephens",
               "profile_path": "/eqFF3SrUQ2yb0ONGQ96LBMtlEdR.jpg",
               "id": 70447,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe4e5cc3a36847f828c1f7",
               "name": "Olivia Hussey",
               "profile_path": "/qe2QxkaW8yQEn9dzFpUhttLs46x.jpg",
               "id": 24695,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Debbie",
               "gender": 0,
               "credit_id": "52fe4e5cc3a36847f828c1fb",
               "name": "Elizabeth Dear",
               "profile_path": null,
               "id": 1271547,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lady Anthea",
               "gender": 1,
               "credit_id": "52fe4e5cc3a36847f828c1ff",
               "name": "Ursula Jeans",
               "profile_path": "/mAd1MKUZ0RIGTYS1agdhtRCoA5i.jpg",
               "id": 222281,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Travel Agent",
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c203",
               "name": "Richard Wattis",
               "profile_path": "/hLD8EPfIER8JwlCWclUEWqjAuz5.jpg",
               "id": 85935,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Emcee",
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c207",
               "name": "Finlay Currie",
               "profile_path": "/4ezZVGhlabVRIeavptVayV1VJGC.jpg",
               "id": 10027,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Charmian",
               "gender": 1,
               "credit_id": "52fe4e5cc3a36847f828c20b",
               "name": "Maxine Audley",
               "profile_path": "/1hsZ54YqubfXJcyGj8QFA1OcxPz.jpg",
               "id": 30141,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4e5cc3a36847f828c1df",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "564cb90ac3a36860370078b8",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "564cb915c3a3682a1a0028ac",
               "name": "Rumer Godden",
               "profile_path": null,
               "id": 132506,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5951d2cec3a3681388019498",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5951d2d6c3a36814ae01a269",
               "name": "Mischa Spoliansky",
               "profile_path": null,
               "id": 592417,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5951d2ddc3a368149801922f",
               "name": "Oswald Morris",
               "profile_path": null,
               "id": 10339,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5951d2e6c3a3681498019236",
               "name": "Bert Bates",
               "profile_path": null,
               "id": 10185,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5951d2ee9251412a05017d81",
               "name": "Robert Lennard",
               "profile_path": null,
               "id": 13320,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5951d2f49251412b3101910f",
               "name": "Carmen Dillon",
               "profile_path": null,
               "id": 11836,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.659346,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 236570,
      "vote_count": 1,
      "budget": 0,
      "overview": "Two British children travel to Italy in an attempt to break up their runaway mother's affair with an Italian concert pianist.",
      "similar": [
         46705,
         150540,
         423,
         394117,
         313369,
         601,
         15373,
         35,
         298312,
         342473,
         9355,
         20352,
         394823,
         77949,
         103663,
         5123,
         16288,
         11637,
         9339,
         290637
      ],
      "original_title": "The Battle Of The Villa Fiorita",
      "runtime": 111,
      "poster_path": "/4zI6nTCDRUi3L3Bad3iT5x66wIe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1965-05-26",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The battle of the children to rescue their mother from her Italian love affair.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Delmer Daves"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Delmer Daves",
         "Rumer Godden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058949/",
      "coverLink": null,
      "actors": [
         "Maureen O'Hara",
         "Rossano Brazzi",
         "Richard Todd"
      ],
      "reviews": [
         "I saw this movie as a teenager when it came out. Typical of its time and genre. Two kids go alone across Europe to bring their mom, who has left dad for new man, back to dad. Great scenery. O K young teenager travel adventure fantasy. O'Hara and Brazzi OK but film stolen by kids. A young Olivia Hussey prior to her starting in Romeo and Juliet. The result of their attempt is in keeping with the morals of its time.",
         "Battle of the Villa Fiorita could have been so much better. The novel by Rumer Godden had more suspense. However, it is hard to make an attractive movie about such an unattractive subject, even with stars of the caliber of Maureen O'Hara and Rossano Brazzi. Their characters were like two overgrown children themselves, there was no emotional maturity there. Wife (O'Hara) leaves home, deserts her children in England, to take off to Italy with New Lover (Brazzi), leaving husband alone to pick up the pieces. The children are devastated by their mother's betrayal, and secretly travel to Italy to fetch her back, but the father never catches on to their whereabouts until AFTER they arrive in Italy? What kind of father was THAT? The children here are good actors, but even their story line is unattractive. The two girls starve themselves to frighten the mother and her new lover, and the boy gets red in the face and says he will never forgive his mother, then he secretly brings food to one of the girls and not the other. Most unpleasant. Then there is the cop-out ending. The boy and one of the girls go out on a little boat in a thunderstorm and the whole town turns out to find them. Because they almost die, the mother decides to leave New Lover and go home to the children's father, whom she no longer loves (and to whom we no longer feel any pity for, since he never bothers to come to Italy to check on his kids and bring them home). Best thing about the film, as has been pointed out by others, is the nice scenery of 1960's Italy and Europe. But if you want that you can always see an old travelogue; that in and of itself is not enough to keep your interest together for this film.",
         "I liked the movie mainly for the picturesque views of the lake,( Lake Como?) the surrounding area, and scenes of the villa itself. So much of the architectural style is remincient of the paintings done by Maxfield Parrish in the early part of the 20th century. You sort of have to look around the actors in the various scenes to get glimpses of ornate retaining walls, stairs and elaborate ballusters around and into the lake. There is an elegance about marble (or granite, or just old concrete?) stairs going down into the water. And old world gardens full of flowers. Itn reminds me of the book \"Italian Villas and their Gardens\" by Edith Wharton, 1907, Which was illustrated by Parrish. And yes, the children in the movie steal the show; All three have a much stronger determination to achieve their goals than do any of the adults. It's a good story line , dated for the sixties. And is'nt this Olivia Hussey's first feature film?",
         "Delmer Daves, director, has to have had one of the most unique careers in Hollywood. Take a look at his filmography, and you'll see there's an unusual spectrum to his films. And quite a few soap-opera-ish films later in his career...and this is one of those, although Daves does 2 things here that make this film work. First, you're never quite sure where the plot is going; so you have to pay attention! Second, once you learn the story is more about the children than the adults, Daves could have gotten maudlin...but didn't...or silly...but didn't. The nominal stars here are Maureen O'Hara and Rossano Brazzi, who go from an affair to lovers living together in Italy (rather than England where O'Hara is from in the film). The jilted husband -- in a rather short role -- is Richard Todd. But then the kids step in, and historically most interesting is Olivia Hussey, in her first film role, as the daughter of Brazzi; however, I was not impressed. By the way, the on-location scenery is stunning! Whether or not you like this film may come down to whether or not you like the ending. I didn't. Still, it was an interesting film, although that ending dropped this from a 7 to a 6.",
         "Delmer Daves created some of the great lush romantic dramas of my youth such as A Summer Place, Parrish and Rome Adventure all starring Troy Donahue, and then also at WB directed Spencer's Mountain starring Henry Fonda and Maureen O Hara. Daves then cast the beautiful Maureen in this film shot in Italy. In her book 'Tis Herself Ms. O Hara said she was simply aghast when seeing the rushes she noted that her face was shot with shadows. At first I did not believe a major star would be photographed against her wishes and that the veteran renowned cinematographer Oswald Morris held a grudge against the lovely star because of a football bet! Whether this is true or not, the fact is that La O Hara one of the cinema's great beauties has some scenes that back up her complaint. I thought the film was fine and the casting of Ms. O Hara with Rosonna Brazzi who was in Daves' Rome Adventure as well- also very fine. The location shot were gorgeous.",
         "Watching The Battle Of The Villa Fiorita I was struck at how similar this was to another Maureen O'Hara film, The Parent Trap. This is a great example of how one can take the same plot situation and treat it either comically or quite seriously. In this case the comic treatment was far better. Maureen O'Hara is a 40 something wife and mother who experiences a mid life crisis. While part of a welcoming committee for concert pianist Rossano Brazzi the two of them begin an affair that breaks up Maureen's home and hearth, the one she shares with husband Richard Todd and children Martin Stephens and Elizabeth Dear. Todd's not happy, but willing to let things go. But the kids are determined one way or another that the Brazzi/O'Hara marriage will never take place. Curiously enough when they hitchhike to Italy they find a willing ally in Olivia Hussey who is Brazzi's daughter. Brazzi is a widower, still Hussey wants no one taking her mother's place. The kids use all kinds of wiles and strategies to break their parents up. Nothing with any parent trap like cuteness, this film never would have been done for Disney. It ends with an uncertain future for all concerned. If there's a message here it misses the mark considerably. If you think you'll be seeing Maureen O'Hara after reading the description in another Parent Trap than The Battle Of The Villa Fiorita will disappoint you greatly. It doesn't quite cut it as drama either.",
         "Maureen O'Hara and Rossano Brazzi are glowing middle-agers in love whose romance is thwarted by their respective pre-teen children: his haughty Italian daughter and her stubborn, bratty British boy and girl. Stories of kids meddling in their parents' love lives are usually successful if played as comedy; here, the melodrama gets to be too much, with the adults continually exasperated and the kids unlikably victorious in their immature pranks. The familial arguments which arise are probably realistic, but here they dissipate interest in the movie, particularly since the love affair between the grown-ups is much more interesting than the finger-pointing. ** from ****"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Based on a novel of the same name by Rumer Godden, this story centers around a British woman, Moira Clavering, who falls in love with a visiting Italian pianist, Lorenzo Tasara. Moira leaves her neglectful husband and two children and moves to Italy to start a life with Lorenzo. Her two children journey to their mother's new home, the Villa Fiorita, where they team up with Lorenzo's daughter to try to break up the couple.",
         "An English mother leaves husband and two children to follow her Italian lover to a lakeside villa. Her children follow her, intent in breaking up her affair."
      ],
      "budget": 0
   },
   "movielensId": 150635,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-05-26",
      "dvdReleaseDate": null,
      "directors": ["Delmer Daves"],
      "runtime": 111,
      "movieId": 150635,
      "title": "The Battle Of The Villa Fiorita",
      "mpaa": "",
      "actors": [
         "Maureen O'Hara",
         "Rossano Brazzi",
         "Richard Todd",
         "Phyllis Calvert",
         "Martin Stephens",
         "Olivia Hussey",
         "Elizabeth Dear",
         "Ursula Jeans",
         "Richard Wattis",
         "Finlay Currie",
         "Maxine Audley"
      ],
      "imdbMovieId": "0058949",
      "originalTitle": "The Battle Of The Villa Fiorita",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two British children travel to Italy in an attempt to break up their runaway mother's affair with an Italian concert pianist.",
      "tmdbMovieId": 236570,
      "avgRating": 4.5,
      "releaseYear": "1965",
      "numRatings": 1,
      "posterPath": "/4zI6nTCDRUi3L3Bad3iT5x66wIe.jpg"
   }
}