{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0368375",
      "video": false,
      "title": "Trouble",
      "recommendations": [],
      "backdrop_path": "/fqWfpIzq3w5fwCoqw9hoYuvWNBF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Matyas / Thomas",
               "gender": 2,
               "credit_id": "52fe4766c3a36847f813385b",
               "name": "Benoît Magimel",
               "profile_path": "/aDNOzcFpleAbGiWie9LmwijedTT.jpg",
               "id": 5442,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Claire",
               "gender": 1,
               "credit_id": "533901869251417dad003c04",
               "name": "Natacha Régnier",
               "profile_path": "/so9iXkL7FgvKNUJ40mJJuaHXjg1.jpg",
               "id": 59826,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Petit Pierre",
               "gender": 0,
               "credit_id": "533901949251417dad003c08",
               "name": "Nathan Lacroix",
               "profile_path": null,
               "id": 1305893,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Le père",
               "gender": 2,
               "credit_id": "533901a19251417dad003c0c",
               "name": "Olivier Gourmet",
               "profile_path": "/y1g5UGYEiRiBqdc35zrekZox0tu.jpg",
               "id": 45152,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "557030cfc3a3681071001fbf",
            "name": "Harry Cleven",
            "profile_path": null,
            "id": 1161618,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.28071,
      "production_countries": [],
      "id": 48431,
      "vote_count": 2,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Trouble",
      "runtime": null,
      "poster_path": "/hz2GsKoOpAykE4chNcwbPsz1amU.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2005-03-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harry Cleven"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Harry Cleven",
         "Isabelle Coudrier-Kleist"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0368375/",
      "coverLink": null,
      "actors": [
         "Benoît Magimel",
         "Natacha Régnier",
         "Nathan Lacroix"
      ],
      "reviews": [
         "I recently saw this film as part of the Cinemuerte Horror Film Festival in Vancouver, on the closing night, and it was a great way to wrap up the final year of that particular festival. \"Trouble\" is one of those thrillers that you wouldn't want to give away too much about, suffice it to say that the main character, Matyas, is a photographer with a wife and adolescent kid, who one day discovers that he has a twin brother! The film has elements of Hitchcock and Cronenberg, and is well shot and acted, and well paced. Even the music lends an element of tension to the way things unfold in the film. You easily get caught up in Matyas' circumstances, and his slow, gradual revealing of his murky past as a child, and how his twin, Thomas, figures into that. A great Euro thriller! Hopefully, it'll arrive in North America soon on DVD, or in theatres. Definitely worth checking out.",
         "The photographer and family man Matyas (Benoît Magimel) is married and has a happy life with his beloved wife Claire (Natacha Régnier), who is pregnant and near the delivery, and his young son Pierre (Nathan Lacroix). Matyas was raised in an orphanage, and he believes his mother died when he was six. However, he receives a correspondence and discovers that his mother has just passed away and that he has a twin brother, Thomas. Matyas does not recall his childhood with his mother and brother and has problems with blood. When Thomas visits his family, Matyas becomes paranoid, believing that his sibling wishes to takeover his family. \"Trouble\" is a great and dark thriller, with a weird suspenseful and original story that recalled me the style of David Cronenberg and Dario Argento. The screenplay is open regarding the accident with Thomas \u0096 it is never clear whether Thomas self-inflicted the mutilation or Matyas did. The rage and feelings of Thomas together with the fact that Matyas was abandoned by his family seem to indicate that Matyas was the responsible; but the attitude of their father also seems to indicate that Thomas was abused by him. Anyway, the plot is dark, the cinematography and the special effects are excellent and the performance of Benoît Magimel is top-notch. The final twist was really unexpected and I do not understand why some people compares this film with other movies with twins (like for example Bette Davis' \"Dead Ringer\" or David Cronenberg's \"Dead Ringers\"). My vote is seven. Title (Brazil): \"Duplicidade\" (\"Duplicity\")",
         "The film has a very interesting story. I found all players very successful. However, i think there were 2 points in the story which i could not understand: 1- At the beginning we had the impression that when Matyas was together with Elina in the dark room, Thomas went to Matyas's home and beat his wife. Then we find out that Elina and Thomas were same persons. Therefore, how could Thomas be in 2 different places ? 2- When Manyas went to Thomas's home for the first time, he met with Elina there. At that time, Thomas had been to Manyas's home and met with his wife. Again, how could this be possible? Is there something i was missing?",
         "Please do not mention Hitchcock!The Master knew that without a solid screenplay it's a waste of breath.All those \"modern\" French thrillers suffer from approximative vague scripts.The directors think that special effects ,disturbing music (here very Chabrolesque),and an ominous soundtrack can make the job done.Spice with uninspired flashbacks and nightmares .Add some sex.Serve tepid. Benoit Magimel is too limited an actor to suggest two different personalities (Jeremy Irons he is definitely not).Even the final trick is not new.It was invented by Sacha Guitry half a century before.And whereas \"trouble\" takes finally the easy way out ,the 1953 film did not give the audience any answer. Like this?Try these .... \"Dead ringers\" David Cronenberg 1988 Irons and his twin \"Dead ringer\" Paul Henreid 1965 Bette Davis and her twin (2) \"Toi Le Venin\" Robert Hossein 1958 Marina Vlady and Odile Versois \"La Vie d'Un Honnête Homme \"Sacha Guitry 1953 Michel Simon and his twin. \"A stolen life \"Curtis Bernardt 1951 Bette Davis and her twin. \"The dark mirror\" Robert Siodmak 1946 Olivia de Havilland and her twin.",
         "CONTAINS SPOILERS Just viewed a copy of this film, and what a ride. Freaky as hell, and an ending that is extremely unnerving. I kinda had a feeling Tomas was the victor, but was still disturbed nonetheless. I though the twist of Tomas/Elina was a nice touch, and an excellent plot twist. Great performances from the cast all around, and tons of suspense that kept me on the edge of my seat. Some nice cinematography , and the scene with Matyas arriving at the home with the bathtub running sent chills down my spine. Lets hope Hollywood does not decide to stick its dirty fingers in this film, and produce a remake.",
         "I have to agree with one of the previous reviews when they said that this was the best 'twin' special effect that they have ever seen- I honestly thought at first that they were using identical twins. It is dark and dreary, is layered with meaning and brings some really dark questions out in the open. Spoilers In the end I found Matyas to be the victim, the wife's behaviour was appalling and it really makes you think. I agree that it seems unlikely that Thomas could have been in two places at once, but at the same time Elina was played by a woman. So perhaps this belongs in the message board. Otherwise, a great, dark film."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Outsider Productions",
         "To Do Today Productions",
         "VnO Media"
      ],
      "summaries": [
         "The photographer and family man Matyas is married and has a happy life with his beloved wife Claire, who is pregnant and near the delivery, and his young son Pierre. Matyas was raised in an orphanage, and he believes his mother died when he was six. However, he receives a correspondence and discovers that his mother has just passed away and that he has a twin brother, Thomas. Matyas does not recall his childhood with his mother and brother and has problems with blood. When Thomas visits his family, Matyas becomes paranoid, believing that his sibling wishes to takeover his family.",
         "Having grown up in an orphanage, Mathias is shocked to discover that his mother has only recently died and that he has a twin brother, Thomas. He also learns that he and his twin brother were together until the age of six when Mathias was placed in the orphanage but Mathias has no recollection of this early period of his life. As he spends time with his new-found sibling, Mathias becomes more and more troubled and some of his memories are coming back to him ..."
      ],
      "budget": 0
   },
   "movielensId": 150941,
   "movielens": {
      "languages": [""],
      "releaseDate": "2005-03-09",
      "dvdReleaseDate": null,
      "directors": ["Harry Cleven"],
      "runtime": 0,
      "movieId": 150941,
      "title": "Trouble",
      "mpaa": null,
      "actors": [
         "Benoît Magimel",
         "Natacha Régnier",
         "Nathan Lacroix",
         "Olivier Gourmet"
      ],
      "imdbMovieId": "0368375",
      "originalTitle": "Trouble",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 48431,
      "avgRating": 2.75,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/h54jYkhJOeVN3UsyWBq8OZoKCsk.jpg"
   }
}