{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "car",
            "id": 33885
         },
         {
            "name": "road movie",
            "id": 167043
         },
         {
            "name": "top gear",
            "id": 185375
         }
      ],
      "imdb_id": "tt2540072",
      "video": false,
      "title": "Top Gear: The Worst Car In the History of the World",
      "recommendations": [
         301235,
         39376
      ],
      "backdrop_path": "/hJwLB7LwFxGQiQLDrdQ1Q90N4ue.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4b479251416c750fdded",
               "name": "Jeremy Clarkson",
               "profile_path": "/bwiGlvV08wPTEifSLwOjkA6Z0iD.jpg",
               "id": 81113,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53fe1bb00e0a262de2002383",
               "name": "James May",
               "profile_path": "/Khhz7h7dT9PL5XfcDqEONPEsqS.jpg",
               "id": 216269,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53fe1bb80e0a262deb0023bc",
               "name": "Richard Hammond",
               "profile_path": "/iUgqdoCDd0OFejT0Byq0hDDlOxw.jpg",
               "id": 82658,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b479251416c750fdddf",
               "name": "Phil Churchward",
               "profile_path": null,
               "id": 148497,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b479251416c750fdde5",
               "name": "Brian Klein",
               "profile_path": null,
               "id": 84633,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 1.029174,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 144942,
      "vote_count": 10,
      "budget": 0,
      "overview": "Jeremy Clarkson and James May travel to the North of England to name and shame some of the worst cars in history, from manufacturers who \"should have known better\".",
      "similar": [
         920,
         924,
         817,
         818,
         158,
         773,
         11637,
         4108,
         168259,
         2898,
         11282,
         49013,
         19908,
         100042,
         138832,
         212778,
         291870,
         105,
         165,
         296099
      ],
      "original_title": "Top Gear: The Worst Car In the History of the World",
      "runtime": 73,
      "poster_path": "/80pEa4dBjCEm4YyxsXOt0UWO6uD.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "BBC",
         "id": 5996,
         "origin_country": ""
      }],
      "release_date": "2012-11-19",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 74,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2540072/",
      "coverLink": null,
      "actors": [
         "Jeremy Clarkson",
         "James May",
         "The Stig"
      ],
      "reviews": [
         "By far the best of the \"Christmas DVDs\" Clarkson made lately. Little bit of top gear, little bit over the top, but May's presence made it better as Clarkson didn't push his metaphors beyond threshold of pain. (ie.: no Indian F1 driver, no ice skates/flippers, no diy rockets and so on...]) It is nothing as brilliant as Top Gear's F430-Zonda-GT, Carrera GT or SLR reviews, but it is nowhere as bad as the James Bond, Indian, Middle East specials. The mix of both presenters make the video nicely presented without either presenter nagging on for slightly too long and personally I like when May and Clarkson agree on the big things. As usual some nerds may get offended by remarks about Ford GT, Escort Cosworth and F50. ...and Panda gets crushed!!! I wasn't too keen on their view of X3 - which I think made a huge improvement from the last generation. (and everyone by now knows that BMW's idea of off-road is broken pavement or small curb) All in all, I was pleasantly surprised.",
         "I watched this expecting just over an hour of hilarious, and occasionally fascinating material from the Top Gear lads. And it delivered. Rather disappointing, Hammond was absent from the DVD, but Clarkson and May stepped up and delivered a brilliant DVD. We begin with as you'd imagine, some old, cheap cars that no one has ever heard of. At this point I was fearing the entire DVD would just be cheap cars of the past, but thankfully it changed. They explain that the worst car would be one that fails to deliver what is expected of it. And so the search begins. There were a couple of parts that were slightly disappointing, such as when they compared to 1970 American cars to a modern BMW, since they outcome was so predictable, yet it dragged on for 10 minutes. But other than this, the rest was brilliant, and well worth the money.",
         "Being an avid viewer of Top Gear, this film is just another episode, and not a good one at that! Only Clarkson & May, which is a little benefit. This DVD is being sold as a 'Special' Top Gear, take it from me, there is nothing special about this DVD, all of the BBC TV versions are better! Do Not waste your money! The TV specials are so much better, this is just a yearly offering from Clarkson (most of his Xmas stocking filler video's are rubbish, all made on the back of 'Top Gears' success)This time with the backing of Top Gear and with James May. The cars reviewed are not as bad as the story line or the Presenters trying to steal your Xmas cash! Avoid at all costs!",
         "Loathed that I am to say this...but this sadly is NOT one of the best efforts Jeremy and good old James May have put together...Hammond is not around, he actually adds something to the trio on normal occasions...So the don't believe the hype that has been going on all the radio the TV shows...and anywhere else where you get free time to PUSH your product...Just because they team up...spend lots of money going sideways around a track and destroying tyres in 25 minutes does not make this a GREAT DVD...I fell asleep so did not even see the end, my dog woke me as there was white noise from the DVD player...I am grateful that I did not get this for an Xmas present...no I was able to source from other areas...if you have money to spend, buy a round of drinks...look at the TOP GEAR shows...it will make much more sense...and best of all this less than exciting DVD wont be in the rack gathering dust...You have not missed anything at all...trust me I still love the TOP GEAR programmes... will still avidly watch there new show coming soon on the good old BBC...",
         "I do enjoy a documentary on car reviews, but I didn't enjoy this one. While they pointed out a few bad to awful products from different manufacturers, they spent a lot of time praising some selected models. I would have liked to see them rank the bad cars from bad to worse - it didn't happen. Maybe it was the format that was had for me to understand: \"This car is really bad, here's why. And then they move on to another.\" I agree with them on 2 of the designated \"bombs,\" but their worst car, I can't believe. Shame on them for showing us how most anyone can steal a collector car at the end. Watching this ended up being a waste of time, and money - I did not get what I paid for."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": [],
      "summaries": ["Everyone has an opinion on bad cars. Now it's time to hear the ones that really count - ours. As it's the worst car in the history of the WORLD, we're out to name and shame the most rubbish car from a manufacturer which, frankly, should have known better. And we have a special, surprise fate in store for the car we pick as our biggest loser."],
      "budget": 0
   },
   "movielensId": 150900,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "2012-11-19",
      "dvdReleaseDate": null,
      "directors": ["Phil Churchward"],
      "runtime": 73,
      "movieId": 150900,
      "title": "Top Gear: The Worst Car In the History of the World",
      "mpaa": null,
      "actors": [
         "Jeremy Clarkson",
         "James May",
         "Richard Hammond"
      ],
      "imdbMovieId": "2540072",
      "originalTitle": "Top Gear: The Worst Car In the History of the World",
      "genres": [
         "Comedy",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["nenQI4HrUhk"],
      "plotSummary": "Jeremy Clarkson and James May travel to the North of England to name and shame some of the worst cars in history, from manufacturers who \"should have known better\".",
      "tmdbMovieId": 144942,
      "avgRating": 4.05556,
      "releaseYear": "2012",
      "numRatings": 9,
      "posterPath": "/80pEa4dBjCEm4YyxsXOt0UWO6uD.jpg"
   }
}