{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0020656",
      "video": false,
      "title": "Au Bonheur des Dames",
      "recommendations": [],
      "backdrop_path": "/usCNYR9DTpB8oN9wPsNMQ2UujSt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Denise",
               "gender": 1,
               "credit_id": "52fe473bc3a36847f812a7d1",
               "name": "Dita Parlo",
               "profile_path": "/jVPFD7DlpH8j4A9l3YsSFDecvsz.jpg",
               "id": 11545,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Octave Mouret",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7d5",
               "name": "Pierre de Guingand",
               "profile_path": null,
               "id": 992679,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mme Desforges",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7d9",
               "name": "Germaine Rouer",
               "profile_path": null,
               "id": 992680,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Madame Aurélie",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7dd",
               "name": "Madame Barsac",
               "profile_path": null,
               "id": 992681,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Geneviève Baudu",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7e1",
               "name": "Nadia Sibirskaïa",
               "profile_path": null,
               "id": 139769,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Colomban",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7e5",
               "name": "Fabien Haziza",
               "profile_path": null,
               "id": 992682,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sébastien Jouve",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7e9",
               "name": "Fernand Mailly",
               "profile_path": null,
               "id": 992683,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Deloche",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7ed",
               "name": "René Donnio",
               "profile_path": null,
               "id": 992685,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Bourdoncle",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7f1",
               "name": "Albert Bras",
               "profile_path": null,
               "id": 992686,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "le Baron Hartmann",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7f5",
               "name": "Adolphe Candé",
               "profile_path": null,
               "id": 992688,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a7cd",
               "name": "Julien Duvivier",
               "profile_path": "/Hm7rqRuqGLtsUdSTyuDXfvXYk5.jpg",
               "id": 39058,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5667cd33c3a36836b4001a32",
               "name": "Émile Zola",
               "profile_path": "/oXA6DkOtc1xYaKmmbAUc2l56UEh.jpg",
               "id": 87667,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5667cd3bc3a3683699001abf",
               "name": "Noël Renard",
               "profile_path": null,
               "id": 1196379,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5667cd46925141740e001b5c",
               "name": "Charles Delac",
               "profile_path": null,
               "id": 1538044,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5667cd4f9251417411001adb",
               "name": "Marcel Vandal",
               "profile_path": null,
               "id": 1342963,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5667cd57c3a36836a6001dc0",
               "name": "André Dantan",
               "profile_path": null,
               "id": 1330183,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5667cd6292514173fc001b79",
               "name": "René Guichard",
               "profile_path": null,
               "id": 1342219,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5667cd6fc3a36836b4001a37",
               "name": "Émile Pierre",
               "profile_path": null,
               "id": 1511497,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5667cd779251417411001ae2",
               "name": "Armand Thirard",
               "profile_path": null,
               "id": 2579,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5667cd81c3a3683697001d31",
               "name": "Gerlaur",
               "profile_path": null,
               "id": 1546681,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5667cd8892514173ff001ca0",
               "name": "Marthe Pinchard",
               "profile_path": null,
               "id": 1546682,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5667cd9ac3a36836b4001a3f",
               "name": "Christian-Jaque",
               "profile_path": "/pxQRaAfnaI7LHCxj9VjMdIHADqf.jpg",
               "id": 48995,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5667cda5925141740b001be0",
               "name": "Fernand Delattre",
               "profile_path": null,
               "id": 1342968,
               "department": "Art",
               "job": "Set Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.334747,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 47612,
      "vote_count": 3,
      "budget": 0,
      "overview": "Denise, an orphaned girl, moves to Paris where she hopes to find work at her uncle's store. But the glamorous department store 'Aux Bonheur des Dames' across the street crunches all the little businesses around. She finds a position there.",
      "similar": [],
      "original_title": "Au bonheur des dames",
      "runtime": 85,
      "poster_path": "/gFNBSuLaj6xhYPsqZm1jlcJiX8o.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Le Film d'Art",
         "id": 1573,
         "origin_country": ""
      }],
      "release_date": "1930-07-03",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Julien Duvivier"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Noël Renard",
         "Émile Zola"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0020656/",
      "coverLink": null,
      "actors": [
         "Dita Parlo",
         "Ginette Maddie",
         "Andrée Brabant"
      ],
      "reviews": [
         "Duvivier's AU BONHEUR DES DAMES is a gorgeous surprise, since along with SUNRISE, METROPOLIS, and a few other of the masterpieces of the period, it taps into so many key movements and concerns of the 1920s. It's a faithful adaptation of Zola's novel by the same name, part of his sweeping \"Rougon-Macquart\" series that casts a panoramic look on 19th century French society. The story, banally put, is a proto- \"You've Got Mail.\" But instead of the giant bookseller edging out the human-scale bookstore in the neighborhood, it's a small fabric merchant vs. the huge department store. (The department store was a new phenomenon in the mid-to-late 19th century.) Like SUNRISE, this movie shows the seduction of the fast pace of the modern city, mass consumption and revolution of our desires--and the insults that modernity hurls at older ways of thinking about community and \"values\" such as honesty, family, and propriety. AU BONHEUR is now available on DVD, with a very good musical score. It is an exquisite example of what silent-era cinematic \"Impressionism\" was all about--including fantastic experiments with conveying sound, emotion, speed, and confusion through images and their editing. In sum, this is an important film and a beautiful one. Wacky ending, but let's not spoil it... With not only Dita Parlo (cf. Vigo's L'ATALANTE and Renoir's GRAND ILLUSION), but Nadia Sbirskaya (Renoir's CRIME OF M. LANGE).",
         "This silent version of Zola's classic was impossible to see for a long time.Zola's heirs (concerning a novel from the 19Th century) were suing Duvivier's (video cassettes and DVDs) producer René Château ,reportedly.That may account for the disappearance of such other great Duvivier movies as \"la fête à Henriette\" or \"Au Royaume des Cieux\" (the latter was available on cassette a long time ago). In the Rougon-Macquart saga ,\"Au Bonheur des Dames\" is far from being one of my favorites.The depictions are impressive,but the story is melodramatic ,particularly the ending .Duvivier has transposed the action to his time ,the early thirties.It's not a big problem,since the director introduces ,in the first sequences ,sandwich men and advertising leaflets coming down from the sky.And the neons as well. That said,\"Au Bonheur des Dames\" displays a director who hadn't found himself yet.As every French cine buff knows,Duvivier was the film noir master,the poet of evil.He was also a past master when it came to depicting a place ,the Halles de Paris or Bastille Day.Actually,the true Duvivier would appear in his next effort \"David Golder\" (1931) Best sequences: Genevieve 's fiancé ,telling the old shopkeeper Baudu how seedy his place is :the cobwebs ,the old furniture and the dilapidated walls speak louder than words;Baudu ,becoming mad as he hears the noises of the walls falling down; A giant worker with a pick destroying everything;and finally Denise's face ,in the last sequences ,who tends to to show that far from being an ingenue,she is a potential business woman and the story does not tell if she will show compassion for people who fall by the wayside. Mouret's fête by the river will become a Duvivier's permanent feature too.Even at his nastiest,at his darkest,there will always be a cause for celebration: the Guinguettes in \"La Belle Equipe\" and \"Voici le Temps des Assassins\" ,the ball in \"la fête à Henriette\" or the fair in \"Boulevard\" . But Duvivier was still searching for an identity at the time and there are weaknesses in his film:the relationship Denis/Mouret is as bland as that in Cayatte's talkie (1943).Blame it on the actor,Pierre de Guingand ,because Dita Parlo's talent is incontestable.Ditto for Armand Bour whose performance would be dwarfed by Michel Simon's (who else?)a decade later. I will not make ,anyway,any comparison between the silent and the talkie.Today's audience will fatally favor the latter over the former. Every cine buff has got to see both and make up his mind. NB.In Zola's saga ,\"Au Bonheur des Dames\" is the follow -up to \"Pot-Bouille\" (Octave Mouret is featured in both books).In 1957,Duvivier transferred to the screen that book,with only fair results .The movie was slagged off by Truffaut who (for once) was not wrong.Gerard Philippe was cast as Mouret.",
         "This needs to be considered among the preeminent achievements of silent film, and pending more exposure I'm sure it will, up and above anything Murnau did, and in the lofty company of visual epics La Roue and L'Argent. My theory is that the French revolutionized the cinematic eye, the subjective eye in motion, at around the same time but quite independently from the Soviets, by studying the same DW Griffith scenes. Since then exists a deep fraternity between the two schools, up to Godard and beyond, and of course well before; it was Parisians who realized the first modern commune after all. Insofar as that revolutionary eye is concerned, you'll be hard pressed to find a better resume; just the stunning array of technique used is the equal of Kane, 10 years early. But there is a lot more than virtuoso display here, channeled from the French notion of noir at the time when it was still a fluid and new impulse for a certain type of story, and not yet melded with the detective film and solidified as a category of its own. The Germans going back to Caligari and Mabuse and reflecting the overall daze of the Weimar period, had posited an early noir blueprint in metaphysical terms; forces of some calculating darkness devising narratives to control dazed minds. The French were more clear-eyed and pragmatic, no doubt influenced by Marx and going all the way back to that commune. This compares favorably to L'Argent from two years before. Both are adapted from Zola, both are highly asymphonic looks of modern life in motion, both demystify Weimar film's evil masterminds to be nothing but scheming business men in service to their capital. Both nevertheless assert profound forces mobilizing for control of a multi-layered world. The central character is a plucky young girl fresh to Paris from we presume a slice of innocent countryside, for her wide-eyed introduction to big city life she is layered through wheels, chains, trains, streets bustling with automobiles, visually rendered transparent as another cog in the huge machinery. Life does not simply happen here but is actually engineered, has staccato sound, urgency. Her haberdasher uncle at the brink of foreclosure owns a shop opposite the new dazzling mega-plex, a real palace of commerce called Au Bonheur des Dames. Ordinarily, this would unfold a trite David/Goliath plot, progress starving out the little guy plus a forlorn denouement. Not so here. The genius of the thing is all in the rhythm of shifts between opposing pairs of characters saturating the world to reveal some part of the machinery. There is no solid anchor, and the film can be read simultaneously from multiple overlapping points. On one hand we have the engineers, the nerve center from where they hatch their plans for control is above the throng of consumers excitedly cavorting in the huge halls of the department store, and later on a balcony overlooking nothing short of the entire city. When the owner proclaims on a whim during a company trip that the first in a bathing suit wins a pay rise, the entire crowd of employees is seized in a paroxysm. The women on the other hand, our orphaned heroine and as counterpart the haughty daughter of a multimillionaire funding the enterprise, already living the dream the other aspires to, lavished by a father the other has been deprived of. The manager of the store is between them, love is at stake. A third pair, the haberdasher uncle stubbornly clinging to his small property and his young clerk who eventually gives in to the seductive dream on the other side of the street. The manager is once again layered in between, arriving at the scene too late to note dire repercussions of his business. The clerk's wife is in her last throes, and we presume this is going to translate as a karma where he loses love, final and irrevocable punishment for hubris. At this point, the film pulls an amazing coup. Faced with eviction notes, the uncle has gone stark raving mad, the scene is rendered with tremendous rapid-fire montage as nearby construction workers on the Bonheur payroll demolishing the walls of his mind. This would have been the Soviet notion only a few years back, workers crushed by the capital and spliced together in a way that arms the eye. Now I don't know if this is found in Zola or is Duvivier's contribution.. ..but in the finale the manager is contrite and about to call off his involvement with Bonheur, except is stayed at the last moment by the young girl proclaiming her love and devotion to him and the incandescent dream. This is the anti-Strike, the anti-Potemkin. (I believe this small scene, just these two minutes, explains away the entire difference in French and Soviet worldviews. The French would have clearly seen around them the same motifs as workers did in Petrograd, no doubt, but this system had already succeeded to provide a good enough life. 1936 would see the first paid vacations.) And this is the genius for me, because it's a really trite finale at face value, this sudden change of heart, almost immoral, but we can read it through many different pairs of eyes, starting with the manager. Another layer on top of all this; the neon-lit mega-plex as a sumptuous movie house, named the same as the movie no less, the young girl enticed to star in a dream that has reserved a place for her, the whole movie daydreamed somewhere as a movie, probably back in the countryside or during a boring day on the job.",
         "More than a film - or a good adaptation of Zola novel- it is a fascinating experience, escaping of definitions. sure, impressionism, close -up, editing, noble message, love story. and more than an old film. for its modernism. for its science to reflect the states in the most inspired manner. for the status of cinema lesson for each viewer. for the art to give to a mute film a force who remains fresh long time after its last scene. because it is a story about Paris and, in same measure, a story about values, more usefull today than in XIX century. and this does it a brilliant example of inspired cinema.or authentic art.",
         "The final silent film from Duvivier (of Pepe le Moko fame) is an adaptation of an Emile Zola novel starring Dita Parlo (of L'Atalante and The Grand Illusion fame). I didn't even know Parlo made any other films! She's wonderful. She plays an orphan girl who shows up to Paris to live with and work for her uncle. Unfortunately, she finds him and his tailor shop destitute, failing under the encroaching department store across the street, Au bonheur des dames (translated as \"Ladies' Paradise\"). She's only too happy to get a job at the fabulous store, where she attracts the attention of several different men (and the jealousies of some of her female co-workers). Meanwhile, her family across the street is going to Hell. The visuals and direction are very good, as are the performances.",
         "Only a handful of film directors have fully exploited the medium to its utmost effect. After seeing this film I must include Julien Duvivier along with Hitchcock, Eisenstein, etc. as a master of the art. Duvivier doesn't just show you the mad rush of crowds of people but through his use of camera movement makes you feel that you too have been swept up in the rush. I have to admit that a large part of the film's impact comes through the new score by Gabriel Thibaudeau which helps express the inner feelings of the characters. The combination of the score and editing in the shopkeeper's crackup sequence is so intense that I felt I was going mad myself. Clearly, Duvivier was familiar with Eisenstein's work and theories. The ending was a disappointment. The entire film makes you feel for the little guy but in the end the film makes an about face and seems to say that progress is good no matter what the cost. Perhaps this ending was demanded by the film's financial backers. Nevertheless, the shortcomings of the story only slightly weaken the impact of this powerful work of art.",
         "Having recently watched Duvivier's 1925 'Silent' Poil de Carrotte I was more than prepared for the mastery on display here, some five years later. The very first shot of a train bringing Denise from the provinces is worthy of Renoir's La Bete Humaine and trains don't really figure in the story so this was merely Duvivier flaunting his skill, as well he might. By coincidence the Zola novel on which this is based is part of the sequence containing La Bete Humaine so who's to say that it wasn't Renoir - working several years later - who sought to link the two via locomotives. I tend to agree with other notices here regarding the acting though we have to remember that back then acting was, of necessity, what today we would describe as 'hammy' or over the top. This does not apply to the lead, Dita Parlo, so unforgettable in La Grande Illusion, who was a fine actress with relatively few credits. The story - big business versus the Little Man - is, of course time-honoured and Duvivier tells it splendidly in fluid camera-work laced liberally with opticals. A must-see.",
         "A number of earlier Julien Duvivier films are now available on DVD. Lobster have Au Bonheur des Dames (1930) which presents silent cinema technique at its most effective and forceful. Superbly photographed, the department store drama is engagingly played by wide-eyed Dita Parlo as the heroine and a fine support cast led by Armand Bour as the oppressed uncle, delicate Nadia Sabirskaia as his sickly daughter and brusque Pierre de Guingand as the overly ambitious department store owner. However, despite Duvivier's fluidly inventive direction and marvelous production values (some of the scenes are staggering in their staging), the script tends to run off the rails. It has two climactic events that are hard to swallow, yet nonetheless the movie would be poorer without them.",
         "Seattle International Film Festival - Anne Hockens for SIFFblog.com, 30 May 2006 contains spoilers I saw this film at The Seattle International Film Festival last weekend where it was well received. I am a substance over style audience member, so, though glad I saw it in a theater,I didn't really like this film.I enjoyed the way the film looked, the cinematography and editing were superb as was the art design, but I had real problems with the story and the acting. The endless cheesecake shots didn't help either. I thought if Dita Parlo either opened her eyes really wide or look down in a softly feminine modest manner one more time I was going to scream. It was hard to take such an irritatingly gamine performance after seeing Lillian Gish the day before in The Scarlet Letter! I felt the two films were equal in terms of the physical aspect of film-making- cinematography etc. However, Seastrom's cinematography and settings served to highlight the inner and social conflicts of the characters. I found Duvivier's style a bit overbearing and obtrusive- at times it overwhelmed the story and, for me, didn't compensate for the lack of interesting characterization or a compelling narrative. For me, the uncle's snapping and going nuts was the highlight of the film, because I felt for him. I was, of course, rooting for and pleased by the shooting of the personnel",
         "Sunday May 28, 4:00pm The Egyptian Saturday July 15, 1:40pm The Castro (San Francisco) \"Upon the ruins, the future is built!\" A train pulls into a Paris station and off steps Denise Baudu (Dita Parlo), an orphan who has come to live and work with relatives in their dress shop. She arrives to discover her Uncle's tiny establishment is about to be swallowed up by its enormous neighbor, Au Bonheur des dames (The Ladies Paradise), and is forced to seek employment there. Every frame of Julien Duvivier's extraordinary film is composed with an obvious mastery of innovative photography and editing, presenting a vision of harsh urban life and palatial grandeur in a unique and often unexpected way. The film combines this breathtaking visual tableau with a story of heartless progress and its consequences. Duvivier fails to extract great depth from his actors but perfectly times a fascinating use of montage to punctuate key elements of the story. The humor is dry and very Parisian, while the tragedy is consuming and operatic.",
         "Zola's novel starts with Denise arriving in Paris and finishes some 500 pages later in what might be called a happy ending. In between are so much character detail and socio-economic ideas that the BBC could have made a six-hour miniseries out of it. Alas, that option was not open to Duvivier in 1929 as he was shooting this film. The young (early 30's) director had studied the Soviet artists closely; Dziga Vertov and Fritz Lang must have been familiar to him. As a result, we have some very impressive split screen work for the delusions of Baudu. Dita Parlo keeps looking like a girl scout most of the time--she does not take direction well. Pierre de Guingand as Mouret is given little to work with; we don't know why he's so smitten with Denise. Germaine Rouer as the grasping socialite does impressive work; she's one of the few characters who is given a personal story to work with."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Le Film d'Art"],
      "summaries": ["Denise, an orphaned girl, moves to Paris where she hopes to find work at her uncle's store. But the glamorous department store 'Aux Bonheur des Dames' across the street crunches all the little businesses around. She finds a position there."],
      "budget": 0
   },
   "movielensId": 151105,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1930-07-03",
      "dvdReleaseDate": null,
      "directors": ["Julien Duvivier"],
      "runtime": 85,
      "movieId": 151105,
      "title": "Au Bonheur des Dames",
      "mpaa": null,
      "actors": [
         "Dita Parlo",
         "Pierre de Guingand",
         "Germaine Rouer",
         "Madame Barsac",
         "Nadia Sibirskaïa",
         "Fabien Haziza",
         "Fernand Mailly",
         "René Donnio",
         "Albert Bras",
         "Adolphe Candé"
      ],
      "imdbMovieId": "0020656",
      "originalTitle": "Au bonheur des dames",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["G_3LlCgSDD0"],
      "plotSummary": "Denise, an orphaned girl, moves to Paris where she hopes to find work at her uncle's store. But the glamorous department store 'Aux Bonheur des Dames' across the street crunches all the little businesses around. She finds a position there.",
      "tmdbMovieId": 47612,
      "avgRating": 0,
      "releaseYear": "1930",
      "numRatings": 0,
      "posterPath": "/gFNBSuLaj6xhYPsqZm1jlcJiX8o.jpg"
   }
}