{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0074635",
      "video": false,
      "title": "Hollywood on Trial",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Narrator",
            "gender": 2,
            "credit_id": "52fe4c1bc3a368484e1a7821",
            "name": "John Huston",
            "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
            "id": 6593,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4c1bc3a368484e1a781d",
            "name": "David Helpern",
            "profile_path": null,
            "id": 936521,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.037427,
      "production_countries": [],
      "id": 136716,
      "vote_count": 1,
      "budget": 0,
      "overview": "A detailed look at the events leading up to the blacklisting of Hollywood writers and artists. In October 1947 nineteen Hollywood personalities were subpoenaed by the House Committee on Un-American Activities to testify about their knowledge or possible involvement in the American Communist Party. The first ten to be called refused to cooperate, claiming their first amendment rights, were cited for contempt of Congress and sent to prison. They became known as the \"Hollywood Ten\" and this is their story.",
      "similar": [],
      "original_title": "Hollywood on Trial",
      "runtime": 105,
      "poster_path": "/feEN1WokDPhtAZRarrd3XYaYYEH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1976-11-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["David Helpern"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Arnie Reisman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074635/",
      "coverLink": null,
      "actors": [
         "Walter Bernstein",
         "Alvah Bessie",
         "Lester Cole"
      ],
      "reviews": [
         "\"Hollywood on Trial\" presents a detailed account on one of the darkest and most shameful periods of Hollywood history with the red scare and the House of Un-American Activities Committee investigation on writers, directors, actors and others who were considered subversive and sympathizers of the Communism. Narrated by the great John Huston, the documentary gives us an insightful chronology of events about the committee's works, from the Hollywood Ten trails and imprisonment, to the loud hearings of the 1950's involving not only the persecuted figures but also friendly witnesses of the committee who helped them by denouncing their friends and colleagues on the industry in order to whether keep the Communists away from the movies or to guarantee their future safe in the film business by not being blacklisted. David Helpern's film was released in 1976, same year Martin Ritt's \"The Front\" introduced the period to new audiences with a story focusing a persecuted writer, played by Woody Allen, who continues to write his movies, despite being blacklisted, by asking his friends to be his front and take credit for his productions. A year before both movies, the House of Un-American Activities ceased their works and by that time many of the people imprisoned due to their investigations and prosecutions already had ended their jail sentences but Hollywood was still touchy in remembering that era, with only a few notable individuals returning their careers back on track. Interviewed here are some of the Hollywood Ten such as Dalton Trumbo, Ring Lardner Jr., Lester Cole (the whole group can be seen in \"The Hollywood Ten\" documentary, with some clips introduced here), a brief interview with Zero Mostel who was persecuted in real life and also plays a pivotal dramatical role in \"The Front\" - his interview was right on Ritt's film set; and there's also the voice from members of the committee, and Edward Dmytryk, film director who named names and continued his career in the 1950's to much acclaim. The first mentioned people are known for their bravery and courage while taking the fifth amendment and refusing to testify to the committee on personal and moral grounds, a true act of defiance that cost them deeply with years in jail and being shut out of Hollywood for a period, with many of them writing films with the use of a front (Dalton Trumbo wrote \"The Brave One\", won an Oscar but the award was given to the name who received the credits on screen, someone who didn't exist, actually. Many years later, the Academy gave him the award and stated him as the one who wrote the movie). Their testimony to the movie is the one that captures our attention for the details they provide about how they survived through this dark moment, how they were incredibly secure about their thoughts and actions, rarely frightened of the possibility of losing everything and go to jail for their freedom of speech. Even though, it's years later from all that, they never admit in the film about being Communists or sympathizers so it feels like a lot like \"Guilty by Suspicion\" (1991), a case where liberal figures were put along next to the Reds simply for defending positive ideals that weren't the norm back in the 1950's. Dmytryk, on the other side of the fence, isn't much passionate or compelling about why he acted that way, throwing his fellow colleagues into the mud. Kazan isn't even here. Mr. Halpern's film is a great historical lesson to those who doesn't know anything or know very little about Hollywood's witch hunt, it presents facts and informations without overcharging the viewers with too much information, it's all very precise, amazingly rich in images of the period, the films responsible for scaring audiences about the perils of the URSS regime, plus the interviews in the 1970's. A must-see. 9/10",
         "Hollywood on Trial (1976) *** (out of 4) In 1975 The House Un-American Activities Committee (HUAC) was basically closed and it ended a very dark period for both the government and Hollywood. The following year Hollywood would somewhat fight back or show their side with the release of this documentary as well as the Woody Allen film THE FRONT. Of the two, there's no question that THE FRONT is the better of the two but this documentary serves an important purpose because it does feature some terrific footage from the actual trials as well as some current interviews that are rather priceless and especially since so many of those people are no longer with us. We get interviews from the likes of Edward Dmytryk, Otto Preminger, Martin Ritt, Ronald Reagan and various others. John Huston serves as the narrator and he's got a terrific voice so listening to him is a major plus. For the most part Hollywood ON TRIAL is a film that will appeal to history and film buffs but at the same time there have been better documents out there. This one here is a bit too dry for its own good but one must remember that it was the first to tackle the subject.",
         "This is a tough film to rate. In 1976 it would rate an 8 because it was revealing a topic that was being hidden. In 2017 you won't find much new here nor will it seem so strange. The bottom line, of course, is that the film industry is not exempt from political influence, as if anyone needed to know that today. But even in the 40s and 50s, the film industry had already gone through the political editing for sexual content, and certainly the war films of the 40s were in response to political initiatives. This film is well worth watching, but it will seem tame now.",
         "I saw this on TCM and it was introduced by Ben Mankiewicz who called this the \"darkest period\" in American history. The House Un-American Activities Committee investigated Hollywood for communist influences and the result was the infamous \"Hollywood Ten\". The Hollywood Ten were communist sympathizers--some were former sympathizers, others still believed in the cause. They were correctly blacklisted for years. These were not innocent men who were being crucified for mere political beliefs. Communism is antithetical to the American way of life. So these Hollywood Ten slimeballs believed in an idea to subvert the American way of life, then tried to hide behind the Constitution. That sounds pretty hypocritical to me. They were not and never will be heroes, despite how Hollywood tries to make them out to be saintly victims.",
         "The overreaching House of Representatives shown in this documentary is currently being replayed after the last presidential election where Donald Trump won the election. With current congress members shouting \"Russia, Russia, Russia\", \"Resist, Resist, Resist\" and \"Impeach, Impeach, Impeach\" the House is once again bullying and attempting to defy the results of a lawful and legal election by assertions that the communists subverted our election. The end of the current situation has not yet been written but the similarities are clearly seen."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Cinema Associates (III)"],
      "summaries": [
         "The documentary analyzes a dark period in Hollywood's history due to the Red Scare of the 1940's and 1950's, when actors, writers and directors were persecuted and investigated by the House of Un-American Activities Committee after being considered suspects of committing Anti-American acts by preaching the Communism in their films and television shows.",
         "The work of the House Un-American Activities Committee (HUAC), established in 1947, which resulted in the blacklisting of several people working in the US motion picture industry, most notoriously those coined as the Hollywood Ten, the blacklisting led by the Hollywood studios (who at the time controlled the majority of commercial film production in the US), is presented. That blacklisting was accompanied by imprisonment for some for contempt for their actions at committee hearings. The geopolitical situation globally in the previous decade or so is provided as context, then which saw the rise of Fascism, especially in hot spots such as Germany and Spain, resulting in a response of Communism to combat that Fascism. Certain Hollywood movies of the early 1940s reflected a pro-Soviet sentiment as an outcome. But the strong anti-Communist feeling hit Hollywood in the post-war era with labor disputes by certain movie craftspeople, especially members of the Screen Writers Guild, against the studios which were seen to be supported and fed by the Communist Party. HUAC divided the Hollywood community, not only by political lines, but by those who saw the necessity of the committee to quash Communism within the community during the start of this Cold War era versus those who viewed the mandate of the committee as being unconstitutional, with the Hollywood Ten, standing united, initially refusing to answer directly such questions as, \"Are you now or have you ever been a member of the Communist Party?\" at committee hearings to which they were subpoenaed. This documentary combines archive footage, including at committee hearings, with current day interviews with personalities on both sides of the hearing microphones."
      ],
      "budget": 0
   },
   "movielensId": 151359,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-11-01",
      "dvdReleaseDate": null,
      "directors": ["David Helpern"],
      "runtime": 105,
      "movieId": 151359,
      "title": "Hollywood on Trial",
      "mpaa": "",
      "actors": ["John Huston"],
      "imdbMovieId": "0074635",
      "originalTitle": "Hollywood on Trial",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A detailed look at the events leading up to the blacklisting of Hollywood writers and artists. In October 1947 nineteen Hollywood personalities were subpoenaed by the House Committee on Un-American Activities to testify about their knowledge or possible involvement in the American Communist Party. The first ten to be called refused to cooperate, claiming their first amendment rights, were cited for contempt of Congress and sent to prison. They became known as the \"Hollywood Ten\" and this is their story.",
      "tmdbMovieId": 136716,
      "avgRating": 3.5,
      "releaseYear": "1976",
      "numRatings": 1,
      "posterPath": "/feEN1WokDPhtAZRarrd3XYaYYEH.jpg"
   }
}