{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1977915",
      "video": false,
      "title": "Spanish Lake",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "539efb2dc3a36827c7000089",
            "name": "Phillip Andrew Morton",
            "profile_path": null,
            "id": 1018097,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.377058,
      "production_countries": [],
      "id": 276898,
      "vote_count": 2,
      "budget": 0,
      "overview": "A bold and unflinching documentary on 'white flight' in the area of Spanish Lake, Missouri, a post WW2 suburb. The town experiences rapid economic decline and population turnover due to racism and governmental policies which support the white exodus. The themes of the film parallel America's growing political divide, racial tension, and rise of anti-government sentiment.",
      "similar": [],
      "original_title": "Spanish Lake",
      "runtime": 82,
      "poster_path": "/jtthaA6vGnmKUTKdaXwtTwIGXOj.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-06-13",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A small town with big problems.",
      "adult": false,
      "homepage": "http://www.facebook.com/spanishlakefilm",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Phillip Andrew Morton"],
      "runtime": 79,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1977915/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ3ODUwOTQ5MF5BMl5BanBnXkFtZTgwNTQxOTc5MTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Dora Gianoulakis",
         "Timothy Green",
         "Raphael Bostic"
      ],
      "reviews": ["I came across this documentary on Netflix streaming. Spanish Lake, maybe 10 miles north of downtown St Louis, has a rich history, and in the 1950s was pretty much the ideal unincorporated community. Ideal in that it was pretty much 100% white mid- westerners with heartland values and attitudes. The people there liked it just the way it was. However it changed, not too different from how scores of similar communities changed from the 1950s to the 2000s, when racial segregation was being abolished and government programs were created to help erase poverty. A big part of that was to create affordable, subsidized housing for the poor, and that meant mostly the poor black population. Spanish Lake's unincorporated status, ideal for eliminating unnecessary government influence, worked against its desire for the status quo. Subsidized housing sprang up, poor neighborhoods relocated from inner city St Louis to Spanish Lake. Fear, partly driven by the real estate agencies seeking more business, resulted in whites selling homes and black Americans moving in. But that was not really the bad part, a heavy criminal element moved in also. As a the younger single black lady living now in Spanish Lake says, the biggest problem is \"kids raising kids\" and not really knowing how to prepare them for the real world. Lacking in education the cycle of poverty continues. The film was motivated by a young man who grew up in Spanish Lake and moved away when his parents were divorced in the 1970s. When he returned he was dismayed to find his town so changed. But Spanish Lake is not unique, I go to my small town, about 4 hours away, and see businesses closed, storefronts empty, homes in disrepair, the old school building long gone, not because black Americans moved in but because times change. We all live in a disposable society, we tend to move to bigger and better things, and what gets left behind is just a distant memory of what it used to be. This documentary is interesting but leaves no great impact. If you go to Google maps and do street view of Spanish Lake you'll find a nicely attractive area with typical 1950s and 1960s homes. The documentary seems to focus on some properties which have been neglected but the community seems rather nice-looking today."],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Amberdale Productions",
         "Spanish Lake Film Productions"
      ],
      "summaries": ["A documentary on white flight in the area of Spanish Lake, Missouri, a post WW2 suburb. The town experiences rapid economic decline and population turnover due to racism and governmental policies which support the white exodus. The themes of the film parallel America's growing political divide, racial tension, and rise of anti-government sentiment."],
      "budget": 0
   },
   "movielensId": 151369,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-06-13",
      "dvdReleaseDate": null,
      "directors": ["Phillip Andrew Morton"],
      "runtime": 82,
      "movieId": 151369,
      "title": "Spanish Lake",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1977915",
      "originalTitle": "Spanish Lake",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A bold and unflinching documentary on 'white flight' in the area of Spanish Lake, Missouri, a post WW2 suburb. The town experiences rapid economic decline and population turnover due to racism and governmental policies which support the white exodus. The themes of the film parallel America's growing political divide, racial tension, and rise of anti-government sentiment.",
      "tmdbMovieId": 276898,
      "avgRating": 3.75,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/jtthaA6vGnmKUTKdaXwtTwIGXOj.jpg"
   }
}