{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0321353",
      "video": false,
      "title": "BaadAsssss Cinema",
      "recommendations": [
         56224,
         31064,
         70862,
         1595,
         56591,
         50627,
         7736
      ],
      "backdrop_path": "/k13w3nTVjkJiOEPe98Mo2deTxwG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c1957",
               "name": "Larry Cohen",
               "profile_path": "/jB85d7bfXoIWW2nKxMe7fQJQ7rC.jpg",
               "id": 19266,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4756c3a368484e0c195b",
               "name": "Tamara Dobson",
               "profile_path": "/havBn6A5n2oP6YLcOnzBb82dQHF.jpg",
               "id": 21923,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c195f",
               "name": "Ron Finley",
               "profile_path": null,
               "id": 176256,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4756c3a368484e0c1963",
               "name": "Pam Grier",
               "profile_path": "/k4oITsTAfhmYICLkFBvgotnEcpU.jpg",
               "id": 2230,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c1967",
               "name": "Ed Guerrero",
               "profile_path": null,
               "id": 547961,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c196b",
               "name": "Isaac Hayes",
               "profile_path": "/4igh7emwzt4xBLw1r05gCUHxwzD.jpg",
               "id": 6542,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4756c3a368484e0c196f",
               "name": "Gloria Hendry",
               "profile_path": "/2RmBVfzSFb0tSYezSyYPiRWHt5O.jpg",
               "id": 10227,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c1973",
               "name": "Bell Hooks",
               "profile_path": null,
               "id": 547962,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c1977",
               "name": "Roy Innis",
               "profile_path": null,
               "id": 547963,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c197b",
               "name": "Jesse Jackson",
               "profile_path": "/yhhswMRSS5yd2gSWTnbPD67ON5C.jpg",
               "id": 89289,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c197f",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c1983",
               "name": "Max Julien",
               "profile_path": "/bcHyCgoZ6VtCtRs72picxOhk4kP.jpg",
               "id": 92036,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c1987",
               "name": "Jim Kelly",
               "profile_path": "/ko3M5sVTr4Al7GZmOeLM1DIga0l.jpg",
               "id": 82832,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c198b",
               "name": "Yaphet Kotto",
               "profile_path": "/qsaWzjzI41EXMldEn6sSp5fnsQ0.jpg",
               "id": 5050,
               "order": 13
            },
            {
               "cast_id": 33,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5794c2a59251414269000b7c",
               "name": "Curtis Mayfield",
               "profile_path": "/7e7g6uoYVIxDH5yFLlTvBuQlrcB.jpg",
               "id": 1239860,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c1993",
               "name": "Elvis Mitchell",
               "profile_path": "/4hIFuA6qLdImK08Bi7z7ZsuccLx.jpg",
               "id": 207800,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c1997",
               "name": "Ron O'Neal",
               "profile_path": "/zagW0Cr1rhSpUQMxNC0fVpjPUrs.jpg",
               "id": 55841,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c199b",
               "name": "Gordon Parks",
               "profile_path": "/yldLBBMsqCZ7ha1XpUqV15qCxJx.jpg",
               "id": 6558,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c199f",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19a3",
               "name": "Afeni Shakur",
               "profile_path": null,
               "id": 547964,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c19a7",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19ab",
               "name": "Melvin Van Peebles",
               "profile_path": "/ddQPAHTf764jN1V8S34BnGGzRT0.jpg",
               "id": 135650,
               "order": 21
            },
            {
               "cast_id": 26,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19af",
               "name": "Armond White",
               "profile_path": null,
               "id": 547965,
               "order": 22
            },
            {
               "cast_id": 27,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19b3",
               "name": "Fred Williamson",
               "profile_path": "/tc4K1y80KA8RrVR8tvmSNCuvWa8.jpg",
               "id": 9811,
               "order": 23
            },
            {
               "cast_id": 32,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c19cf",
               "name": "Jim Brown",
               "profile_path": "/u2woKBMGvouznYELvlPwqj4Y81A.jpg",
               "id": 4774,
               "order": 24
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4756c3a368484e0c194d",
               "name": "Isaac Julien",
               "profile_path": "/aXkCoFvW4yYOicU75xtS995wasu.jpg",
               "id": 108464,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c1953",
               "name": "Andy Cowton",
               "profile_path": null,
               "id": 547960,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19b9",
               "name": "Neal Brown",
               "profile_path": null,
               "id": 547966,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19bf",
               "name": "Gary Kinkead",
               "profile_path": null,
               "id": 547967,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19c5",
               "name": "Jonathan Partridge",
               "profile_path": null,
               "id": 547968,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4756c3a368484e0c19cb",
               "name": "Adam Finch",
               "profile_path": null,
               "id": 111082,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.345032,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 67083,
      "vote_count": 9,
      "budget": 0,
      "overview": "With archive film clips and interviews, this brief look at a frequently overlooked historical period of filmmaking acts as an introduction rather than a complete record. It features interviews with some of the genre's biggest stars, like Fred Williamson, Pam Grier, and Richard Roundtree. Director Melvin Van Peebles discusses the historical importance of his landmark film Sweet Sweetback's Baadasssss Song. For a contemporary perspective, the excitable Quentin Tarantino offers his spirited commentary and author/critic bell hooks provides some scholarly social analysis.",
      "similar": [],
      "original_title": "BaadAsssss Cinema",
      "runtime": 58,
      "poster_path": "/25Ob4PFvrdhlpMuN1QXOtWR6LKG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2002-01-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A bold look at 70's blaxploitation films.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Isaac Julien"],
      "runtime": 58,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0321353/",
      "coverLink": null,
      "actors": [
         "Pam Grier",
         "Fred Williamson",
         "Melvin Van Peebles"
      ],
      "reviews": [
         "A very entertaining doc that gives a good overview of a unique side of 70's cinema. It great to see some of the people who worked in this influential genre get a chance to reflect and talk. The collected critics are interesting too. Where this doc is of sort of a disservice is when it tries to explain the end of the genre. Nobody here is really able to step back and admit that the majority of black action films from the 70's were extremely bad. Even the great ones are poorly made from a technical standpoint but have become classics due to the energy and talent of the main cast. Many of the lesser films were impossible to watch and not feel ripped off. After a sitting thru a bunch of duds, people would naturally stop supporting them. Also by 1975, the neighborhood independent movie theaters were closing and the start of the major chain cinema was beginning to take hold. This killed all independent exploitation film making eventually. No kung-fu films, women in prison films, spaghetti westerns or monster films like in the sixties and early 70's. This has to be taken into account including whatever \"racist\" conspiracy that squelched the black cinema of the 70's. That's my historical comment. There was about 5 minutes too much time spent discussing the \"Jackie Brown\" controversy. But anything that creates more screen time for Pam Grier makes up for it.",
         "Cold-blooded balance of entertainment and academic perspectives on the so-called blaxploitation urban films of the seventies. This is not only useful as a seminal film rundown, but also for its educative industry participant interviews. Two, of Pam Grier and Quentin Tarrantino, are respectively honest and energetic. Others, of Fred Williamson and Gloria Hendry, reek of bitter, unfounded entitlement. BAADASSSS also delves into the debates on the responsibilities, or lack thereof, this genre had to the broader socio-political context. Here, reviewer Elvis Mitchell provides especially introspective guidance. AfroPixFlix throws down 9 sho-nuff greasy cake-cutters for this Isaac Julien reel deel.",
         "A pretty good overview of black cinema in the early '70's. The first ten minutes are taken up with trying to set the political climate of the time, which I don't think is necessary, this is about movies. Clips from all of the major films are shown: \"Superfly\", \"Sweet Sweetback...\", \"Shaft\", etc... Plus nothing is cut out so the viewer is allowed to see the \"shocking\" stuff. Of the talking heads, Fred Williamson, Larry Cohen and Pam Grier come off as the most interesting, although film historian, Armond White adds a lot. As with most documentaries, there is some head scratching, Afeni Skakur and Quentin Tarantino add nothing and could have been easily dropped. I also have to disagree with \"Jackie Brown\" being an homage to these films. But those are minor quibbles. Anyone interested in delving into this genre should watch this documentary.",
         "It was Quentin Tarantino's famous interest in the old 1970s blaxploitation films, as well as Pam Grier, that first got me interested in the genre, but not knowing what the genre was really about, or at least not knowing the history behind it's formation, its themes, even its actors, made me not enjoy the first handful of the films that I watched, like Coffy, Foxy Brown, Black Mama, White Mama, and Sheba, Baby. Granted, I don't think any amount of documentaries could make me enjoy Sweet Sweetback's Badaaasss Song, but I suppose I can certainly understand the society in which it was made. What I loved about this documentary is the way it gives a look not only at the blaxploitation films of the 19670s, but also gives the historical context under which they were made, including their level of popularity in places like Los Angeles, where I live, and Hollywood's response. There are a number of debatable claims made in the documentary, such as blaxloitation saving Hollywood or Hollywood killing the blaxploitation genre, but what I really appreciated were the interviews from some of the original actors as well as brief looks at several of the more prominent blaxploitatoin films, some of which I enjoyed, like Black Caesar, and some of which remain not really my favorites, like Sweet Sweetback and Super Fly. The cast give very revealing interviews, both about their experience in being involved in the blaxpoitation genre, as well as giving their insights into the meaning and fate of the genre. I was glad to see that Quentin Tarantino appears to talk about blaxploitation's influence on him and his films because he is obviously so heavily inspired by them, but there were some other heavyweights that are far too conspicuously absent, most notably the tremendously successful Spike Lee. Odd, since this documentary was released in 2002, far too early for them to have already been mad at Spike for She Hate Me. Gloria Hendry tells the story about getting her first role in Black Caesar and becoming instantly famous, and others talk about their involvement and experience with the genre, such as Samuel L. Jackson and even Ameni Shakur, Tupac's mother, who was a member of the Black Panther party. Pam Grier gives a brilliant interview, revealing a depth of character and a studied intelligence that far surpasses anything that she has ever been able to reveal in any of her films. She speaks so intelligently that this interview alone almost makes it look like she has been accepting roles far beneath her ability for the majority of her career. And she's good, too, I'd like to see a lot more of her in the future. I really think she has adapted well to the changes that have taken place in her life and in the film industry since the end of blaxploitation. Fred Williamson, one of the most famous actors from the genre, gives a rather sour, disillusioned interview, focusing on pretty negative subjects and ideas. The one that stuck out to me the most was that he said something like no one ever wanted black film, their was never any real desire or need for it, people just wanted to see black people on film. Something like that, at any rate, he claimed that no one ever really wanted blaxploitation, it happened for other, more superficial reasons, which I don't agree with at all. The people that packed those theaters sure wanted it. Blaxploitation is something of an offbeat subgenre in cultural film history, but I think that it is one that needs some explanation before a lot of people will really enjoy, and some people won't enjoy it even then. Sort of like how some supplemental documentaries included with DVDs will make you enjoy certain movies more than you otherwise would have, this documentary is an excellent way to get a basic introduction to the genre, and make sure to have a pen and paper handy when you watch it, because you'll want to write down some of the movies that it talks about so you can remember to watch them!",
         "(\"BaadAssss Cinema\" movie-quote) - \"Don't jive me, you lousy, black mother-fukker!!\" For the most part - This 60-minute documentary was a pretty entertaining look back at the movie genre known as \"Blaxploitation\" which came into its own in the USA during the early-to-mid 1970s (and, then, like disco, it faded away into obscurity). Believe me - It was really quite a hoot looking back at the hilarious, bad-boy/bad-girl fashion trends that prevailed amongst blacks during those turbulent days in pop culture. It was all platform shoes, big \"Afro\" hairdos, and skintight outfits, non-stop. Through a continual parade of blaxploitation film clips, along with interviews from actors, film historians, and directors - The viewer gets a golden opportunity to enjoy a real slice of bad-ass cinema at its absolute baddest. *Final note* - I think that Quentin Tarantino (and his limp-wristed hand contortions) should be christened \"The Countess of Flatulence\". He really should.",
         "Baadasssss Cinema (2002) *** 1/2 (out of 4) Quentin Tarantino, Pam Grier, Samuel L. Jackson, Melvin Van Peebles, Fred Williamson and critic Elvis Mitchell are among the people interviewed for this entertaining documentary that takes a look at the blaxploitation movies of the 1970's. At just under a hour there's no question that this doesn't contain the greatest details but it at least has many of the stars that were in the movies as well as people like Tarantino who has kept the genre alive for new fans to discover. The best thing about this movie is that we get some very good discussions about race relations at the time and how these movies were fresh and original and especially in how these movies helped give black crowds a different type of hero. The documentary covers not only the popularity of these films but also the controversy that haunted them. Both subjects are discussed in great detail and we also get some wonderful clips from various movies. There's also a great interview with Grier who of course was one of the best actresses from this era and certainly one of the most beautiful women to ever grace the screen.",
         "With one exception, this film was an exceptional look at a genre of films overlooked today...the so-called 'blacksploitation' film. Using lots of clips from many of the most important movies as well as a lot of interviews, it's a very nice homage to the pictures. The film begins, well, at the beginning. \"Sweet Sweetback's Badasssss Song\" was the first film and the experts talk about it...and completely ignore that the film was among the worst films in Hollywood history...worse than \"Plan 9 From Outer Space\"!! Its lack of criticism of the film is odd. Sure, it was the first, but it was also the worst and features child pornography and practically no plot. Fortunately, after this rocky start the film does a much better job and goes from \"Shaft\" to \"Superfly\" to the films of Pam Grier and Fred Williamson among others. This is very interesting and worth your time....and is a GREAT introduction for folks who are unfamiliar with the genre and want to know where to start...as well as learning what killed these exciting films. Well worth seeing...just wish they's spent less time on \"Sweet Sweetback\" and perhaps had mentioned some other great films such as \"Truck Turner\" and \"Bucktown\" or, perhaps, a discussion of the horrible blacksploitation films! Still, well made and well worth seeing.",
         "Even I, who have seen Melvin van Peebles' Sweet Sweetback's Baaddasssss Song, loved every minute of this revealing documentary. Richly documented with inserts from the films that are being discussed on camera, or that merely give extra power to the narration; also, a number of newspaper clips with headers that made history, or highlighted the political change trends in the late 1970s. The number of people interviewed, and the important messages they deliver now - is a unique upraisal of their work of a quarter of a century ago. For me at least, it was also marvellous to see how Pam Grier, and Gloria Hendry, have gained weight, but are beautiful, sexy women even now. For the young generation, this documentary is also a good introduction to white/black relationships in the USA in the late 1960s - and a big incentive to discover nice, little action and nudity films of the 1970s now (unfortunately) mostly relegated to video warehouses."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Independent Film Channel (IFC)",
         "Minerva Pictures"
      ],
      "summaries": ["Filmmaker Isaac Julien uses film clips and interviews to illustrate the history of the so-called \"blaxploitation\" genre."],
      "budget": 0
   },
   "movielensId": 151441,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": null,
      "directors": ["Isaac Julien"],
      "runtime": 58,
      "movieId": 151441,
      "title": "BaadAsssss Cinema",
      "mpaa": "",
      "actors": [
         "Larry Cohen",
         "Tamara Dobson",
         "Ron Finley",
         "Pam Grier",
         "Ed Guerrero",
         "Isaac Hayes",
         "Gloria Hendry",
         "Bell Hooks",
         "Roy Innis",
         "Jesse Jackson",
         "Samuel L. Jackson",
         "Max Julien",
         "Jim Kelly",
         "Yaphet Kotto",
         "Curtis Mayfield",
         "Elvis Mitchell",
         "Ron O'Neal",
         "Gordon Parks",
         "Richard Roundtree",
         "Afeni Shakur",
         "Quentin Tarantino",
         "Melvin Van Peebles",
         "Armond White",
         "Fred Williamson",
         "Jim Brown"
      ],
      "imdbMovieId": "0321353",
      "originalTitle": "BaadAsssss Cinema",
      "genres": [
         "Action",
         "Documentary"
      ],
      "youtubeTrailerIds": ["1gVB4N9Kl9Q"],
      "plotSummary": "With archive film clips and interviews, this brief look at a frequently overlooked historical period of filmmaking acts as an introduction rather than a complete record. It features interviews with some of the genre's biggest stars, like Fred Williamson, Pam Grier, and Richard Roundtree. Director Melvin Van Peebles discusses the historical importance of his landmark film Sweet Sweetback's Baadasssss Song. For a contemporary perspective, the excitable Quentin Tarantino offers his spirited commentary and author/critic bell hooks provides some scholarly social analysis.",
      "tmdbMovieId": 67083,
      "avgRating": 4.27778,
      "releaseYear": "2002",
      "numRatings": 9,
      "posterPath": "/25Ob4PFvrdhlpMuN1QXOtWR6LKG.jpg"
   }
}