{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0138068",
      "video": false,
      "title": "Ruby Bridges",
      "recommendations": [
         100028,
         144580
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ruby Nell Bridges",
               "gender": 0,
               "credit_id": "52fe49be9251416c750d1f49",
               "name": "Chaz Monet",
               "profile_path": null,
               "id": 156896,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Barbara Henry",
               "gender": 1,
               "credit_id": "52fe49be9251416c750d1f4d",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Robert Coles",
               "gender": 2,
               "credit_id": "52fe49be9251416c750d1f51",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Abon Bridges",
               "gender": 2,
               "credit_id": "52fe49be9251416c750d1f55",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lucielle 'Lucy' Bridges",
               "gender": 1,
               "credit_id": "52fe49be9251416c750d1f59",
               "name": "Lela Rochon",
               "profile_path": "/9DBu3r5O4fBosSS4FnSzFCVpm0O.jpg",
               "id": 51359,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jane Coles",
               "gender": 1,
               "credit_id": "52fe49be9251416c750d1f5d",
               "name": "Jean Louisa Kelly",
               "profile_path": "/mJJltLZRxaoMoMVpGvJXPqZE9b4.jpg",
               "id": 26495,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dr. Broyard",
               "gender": 2,
               "credit_id": "52fe49be9251416c750d1f61",
               "name": "Peter Francis James",
               "profile_path": "/ksA1HX5fVPgEj3CiYY9ie9zEaBK.jpg",
               "id": 113230,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Miss Woodmere",
               "gender": 1,
               "credit_id": "52fe49be9251416c750d1f65",
               "name": "Diana Scarwid",
               "profile_path": "/1Z11dGfpfJygcL0r3CYLFREEU8l.jpg",
               "id": 2958,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Miss Spencer",
               "gender": 1,
               "credit_id": "52fe49be9251416c750d1f69",
               "name": "Patrika Darbo",
               "profile_path": "/ixUbj1NWOtLSpu1T2DN8EaQYHpi.jpg",
               "id": 54044,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe49be9251416c750d1f45",
            "name": "Euzhan Palcy",
            "profile_path": null,
            "id": 108824,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.51303,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 96715,
      "vote_count": 4,
      "budget": 0,
      "overview": "The true story of Ruby Bridges, an African-American girl who, in 1960 at age 6, helped to integrate the all-white schools of New Orleans. Although she was the only black girl to come to the school she was sent to, (and since all the white mothers pulled their children out of class, she was the only one there, period), and though she faced a crowd of angry white citizens every day, she emerged unscathed, physically or emotionally. Encouraged by her teacher, a white woman from the North named Barbara Henry, and her mother, Lucille, and with her own quiet strength, she eventually broke down a century-old barrier forever, a pivotal moment in the civil-rights movement",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         858,
         141,
         634,
         112160,
         394117,
         376867,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Ruby Bridges",
      "runtime": 96,
      "poster_path": "/fJvTFNHqQogviv9PEmkuClRLjT2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-01-18",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Euzhan Palcy"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Toni Ann Johnson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138068/",
      "coverLink": null,
      "actors": [
         "Penelope Ann Miller",
         "Kevin Pollak",
         "Michael Beach"
      ],
      "reviews": [
         "I happened to see this movie in my son's second grade classroom when I was volunteering as a parent helper. The film and Ruby Bridges herself are truly inspiring, more poignant and heartwrenching because I know it is a true story, and that this year-long incident actually happened within my lifetime. The script doesn't seem to take liberties with reality and sticks to the truth as I understand it. Wars against injustice are fought one battle at a time. And this movie really brings home the story in such a powerfully understated way that children, and adults alike, are able to appreciate and relate to Ruby's unrelenting bravery. As a result, we are perhaps better prepared to search for and find a bit of bravery in ourselves to rise up whenever we get the chance. The movie is well done and it was refreshing to see that it wasn't overacted or overdirected. The story alone is enough that it doesn't require the usual sprucing up by Hollywood. To another reviewer who found it \"yawn\" provoking I would only say, sorry there were no car crashes, bloody scenes, knife wielding maniacs, naked ladies, or otherwise thrilling happenings gratuitously added in to try to hold the interest of viewers such as himself. There was only an angry mob of white, so-called Christians threatening and poised to attack a SIX YEAR OLD LITTLE GIRL. Perhaps he doesn't understand that this is a true story. This means IT REALLY HAPPENED. To me, the bravery of one small first grader is more exciting to learn about than all of the fictional Terminators/Arnolds, Rambos, Dirty Harry's, etc., etc., combined. This type of movie and, in particular this specific movie, is the perfect venue for parents and children to watch together and then share and discuss other real-life events they have encountered dealing with man's inhumanity to man. We take it for granted that anyone can walk up to any lunch counter and order a coke, or drink from any drinking fountain, or sit in any open seat on any bus, or walk into his or her designated electorate polling place unhampered, or enjoy countless other privileges which we can take for granted now; while, just 44 short years ago, persons of certain skin colors or ethnicities could not without great personal risk. The movie itself is quite long and his teacher showed it in two 45 minute segments including several discussion pauses while viewing. I really have to thank my son's teacher for sharing this movie with her class and myself, and for providing the excellent education he is receiving. The children's book by Robert Coles (the real-life psychiatrist who is portrayed by Kevin Pollak in the film) is also highly recommended reading for children. My son was also delighted to see that some of the music in the film was composed by Patrice Rushen who sings his favorite song, \"Forget Me Nots.\" To another reviewer I would like to ask, if there are a dozen better movies on this topic, could I see a copy of that list? They must be spectacular!",
         "Disney has done it again. Several years ago, they have captured the real life drama of the intergration at Little Rock Central High school with the powerful film, \"The Ernest Green Story.\" Now, they have struck gold twice with this equaling stirring true-life story of Ruby Bridges, the little black girl who successfully intergrated an all white school in New Orleans in the midst of riots, and hate mongers. This incredible tale is not JUST about racial differences, but it is also a testimony to the strength and power of God that little Ruby puts her faith in for help. Powerful performances by all. This is a MUST-SEE! Thank you Disney, for giving us a positive film about strength, courage, and the power of God.",
         "Not great cinematic art, granted, but the sweet spirit and sharp intellect of the real person Ruby Bridges comes across and the era is by and large accurately portrayed. For Disney, this is excellent. Michael Beach is quite good, as is Diana Scarwid, and Chaz Monet is wonderful in the title role. Robert Coles, M.D., played by Kevin Pollak, has written many books about children in crisis. I lived in this era. The marshals were dignified, the \"cheerleaders\" appalling, that little girl one of the greatest heroines who ever lived. It's worth watching.",
         "I teach 5th grade and show this movie to my class every year. It moves them and shows them an important period in the history of our country. They are amazed when I tell them that this happened in America, not some other country and that we still fight for these rights on a daily basis, both in America and abroad. It makes them appreciate the civil rights all Americans are supposed to have. There are some racially inappropriate words, but that adds to the realism and sparks discussion about words as weapons. This movie goes really well with a host of books and web sites that you can look up on the internet and use with many different age levels.",
         "This film details the effects of racism on a first grader sent to an all white school in Louisiana in 1960. The child, Ruby Bridges, must endure the taunts of bigots in the street to protest her enrollment. What's even worse is that she encounters a bigoted teaching staff led by a vicious, prejudiced school administrator. Diana Scarwid catches the essence of bigotry in her performance. However, it is never pointed out who exactly she represents. Is she the principal, superintendent or school secretary? No matter who she is, she is the epitome of bigotry. The film deals with the psychological trauma affecting Ruby and her family. The child playing Ruby is just wonderful. Other acting kudos must go to the teacher who plays Mrs. Henry. She is kind and understanding. Kevin Pollak gives a wonderfully understated performance as the psychologist working with Ruby and her parents. Michael Beach is excellent as the father, who loses his job, during this situation and is bitter against everyone: Black neighbors who feel increasing pressure, a Jewish store owner who is pressured in telling Beach not to come into the store, and NAACP officials who he feels are not doing enough. The film is an excellent one for trying to break down the religious and racial barriers that affect us all.",
         "Ruby Bridges, an African-American girl who, in 1960 at age 6, helped to integrate the all-white schools of New Orleans. Although she was the only black girl to come to the school she was sent to.All the white parents took their kids out of school so therefore Ruby was the only child in the school.Everyday Ruby went to school she was faced to angry white people where they cussed at her , said hurtful and racism things. Ruby had an a teacher named Barbara Henry that was by her side while parents were doing hurtful things like taking their kids out of the class ruby was in. Ms.Henry still taught Ruby as if she was teaching an whole class.",
         "This was a really great movie up until the part where they acted like the north didn't have slaves. Perpetrating stereotypes is wrong. This movie is trying to teach a message and it puts this in there? Give me a break. I know this happened in Louisiana as to why the movie is set there, but that doesn't mean the north is automatically some great place where everyone got along. I still enjoyed the movie. I really feel for Ruby and her struggle.",
         "There's probably at least a dozen movies like this one, but most are better. Ruby Bridges is a little black girl who breaks new grounds by attending an all-white school in New Orleans in 1960. The movie is not very inspiring and the acting is not very good. Skip this one. 6 out of 10.",
         "And I don't mean that in the way that everyone says during a bad movie. This was honestly the most terrible film I have had the misfortune to view. The acting was terrible, but I don't really blame the actors, because the script was on the level of a fourth grade play. There were times when I laughed out loud at the words coming out of the actors mouths. There is also an angry mob that chants one thing over and over through out the entire film, and it eventually becomes funny. Many parts just didn't make sense, and the people acted very strangely, as if they were in an illogically blocked, once again, fourth grade play. Even the scoring was bad. Everything about this movie was just horrid. I have seen Disney Channel sitcoms with twice the acting, writing, and production of \"Ruby Bridges\". No one in their right mind could think this movie has any value, regardless of the subject.",
         "What would you expect? Pap, pure pap. No context, no content. And by the way, in 1960 6-year-old girls would have gotten their behind paddled for saying \"butt.\" Now they tell me I have to fill up 10 lines, so here goes. Meet Mom: Gentle, loving, Christian, patient, hardworking. Meet Dad: Gentle, loving, Christian, patient in a manly way, hardworking. Meet the local Jew: As racist as any cracker in New Orleans, but she sees the light. Meet Ruby: Obedient, smart, strong, brave. Meet the new teacher: Sweet, kind, considerate, not a racist bone in her Yankee body. Meet the old teachers: Racist, dour, prim and proper. Meet the psychiatrist: Caring, racist as the day is long but Ruby teaches him better! Meet the NAACP: Light skinned and they own a piano.",
         "I don't remember too much from this TV movie, as I've watched it once when it was first aired back in the '90s on ABC as part of the Wonderful World of Disney Sunday night movie specials. It tells the true story of Ruby Bridges, a six year-old African-American girl is integrated in an all-white schools in the New Orleans. While the plot surrounds the tense race relations back in the 1960s, this movie focuses more on the courage of Ruby Bridges to face the odds and adversity and strive for the best to earn her education in the school and place in society. Despite how controversial and unpleasant race relations can get, the filmmakers made this movie one for the entire audience to watch. The overall movie may not be very exciting or suspenseful and the acting may be sub-par, but it is a serviceable movie to sit through with just the right plot momentum for a TV movie and is a sweet, innocent take on a chapter in American history. Grade C+"
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Marian Rees Associates",
         "Walt Disney Television"
      ],
      "summaries": ["In 1960, a six-year-old African-American girl named Ruby Bridges helped to integrate the all-white schools of New Orleans. Although she was the only black girl to come to the school she was sent to, and since all the white mothers pulled their children out of class, she was the only one there. Although she faced a crowd of angry white citizens every day, she emerged unscathed, physically or emotionally. Encouraged by her teacher, a white woman from the North named Barbara Henry, and her mother Lucille, and with her own quiet strength, she eventually broke down a century-old barrier forever, a pivotal moment in the civil-rights movement."],
      "budget": 0
   },
   "movielensId": 151729,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-18",
      "dvdReleaseDate": null,
      "directors": ["Euzhan Palcy"],
      "runtime": 96,
      "movieId": 151729,
      "title": "Ruby Bridges",
      "mpaa": "",
      "actors": [
         "Chaz Monet",
         "Penelope Ann Miller",
         "Kevin Pollak",
         "Michael Beach",
         "Lela Rochon",
         "Jean Louisa Kelly",
         "Peter Francis James",
         "Diana Scarwid",
         "Patrika Darbo"
      ],
      "imdbMovieId": "0138068",
      "originalTitle": "Ruby Bridges",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The true story of Ruby Bridges, an African-American girl who, in 1960 at age 6, helped to integrate the all-white schools of New Orleans. Although she was the only black girl to come to the school she was sent to, (and since all the white mothers pulled their children out of class, she was the only one there, period), and though she faced a crowd of angry white citizens every day, she emerged unscathed, physically or emotionally. Encouraged by her teacher, a white woman from the North named Barbara Henry, and her mother, Lucille, and with her own quiet strength, she eventually broke down a century-old barrier forever, a pivotal moment in the civil-rights movement",
      "tmdbMovieId": 96715,
      "avgRating": 3.66667,
      "releaseYear": "1998",
      "numRatings": 3,
      "posterPath": "/fJvTFNHqQogviv9PEmkuClRLjT2.jpg"
   }
}