{
   "tmdb": {
      "original_language": "he",
      "keywords": [],
      "imdb_id": "tt2882590",
      "video": false,
      "title": "The Wonders",
      "recommendations": [
         43083,
         261825
      ],
      "backdrop_path": "/vkOYKhMr35xn0cCxCqLn41gSAE0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4dd3c3a368484e200027",
               "name": "Efrat Gosh",
               "profile_path": null,
               "id": 1198741,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4dd3c3a368484e20002b",
               "name": "Ori Hizkiah",
               "profile_path": null,
               "id": 1198742,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4dd3c3a368484e20002f",
               "name": "Yehuda Levi",
               "profile_path": "/tCbZoN3YopufGpH0hNnMge3J5Dl.jpg",
               "id": 82098,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4dd3c3a368484e200033",
               "name": "Adir Miller",
               "profile_path": "/tRqcW2jtJU9x2BTm7QdcxAq5BVp.jpg",
               "id": 583792,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4dd3c3a368484e200037",
               "name": "Yuval Scharf",
               "profile_path": "/2qQQ5UA4hPmntvHQ2KkTUuoiR7m.jpg",
               "id": 1001959,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dd3c3a368484e200017",
               "name": "Avi Nesher",
               "profile_path": null,
               "id": 95550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4dd3c3a368484e20001d",
               "name": "Avi Nesher",
               "profile_path": null,
               "id": 95550,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd3c3a368484e200023",
               "name": "Shaanan Street",
               "profile_path": null,
               "id": 1198740,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Mystery",
         "id": 9648
      }],
      "popularity": 0.891981,
      "production_countries": [{
         "iso_3166_1": "IL",
         "name": "Israel"
      }],
      "id": 214105,
      "vote_count": 5,
      "budget": 0,
      "overview": "Avi Nesher's new film tracks the complex relationship between a Jerusalem Graffiti artist and a mysterious modern day prophet who is imprisoned in an abandoned apartment across the Artist's window.",
      "similar": [],
      "original_title": "Plaot",
      "runtime": 112,
      "poster_path": "/lQ44BqX8xDIzcpZ3LTWnmTyhgFr.jpg",
      "spoken_languages": [{
         "name": "עִבְרִית",
         "iso_639_1": "he"
      }],
      "production_companies": [{
         "logo_path": "/gf4S6UfByfEaSpDPLl663ivyDRC.png",
         "name": "United King Films",
         "id": 16,
         "origin_country": ""
      }],
      "release_date": "2013-06-05",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Avi Nesher"],
      "runtime": 112,
      "synopsis": "Rollicking, Beverly Hills Cop-style comedy thriller set in Jerusalems seamy Musrara district. Art school dropout Arnáv [Hebrew for \"rabbit\"] tends bar, and his just-found-religion girlfriend, Wax, waitresses, in a neighborhood bar. One morning on his way to his cannabis connection (located in the backroom of a barbershop), Arnav discovers that Schmaya, a charismatic rabbi believed to possess the gift of prophecy, is being held prisoner in the abandoned apartment upstairs. Cop-turned-private eye Gitis introduces Arnav to his client, Eiláh, Schmaya's sister-in-law, who pays Arnav 15,000 to let Gitis to stay in Arnav's apartment and spy on Schmaya and his thug handlers, who are trying to get him to write some sort of confession. At various points, the confused (but growing savvier by the minute) Arnav suspects either Gitis or Eilah of playing him or each other. Together with the rapid-fire dialog, the viewer is carried along on a wild ride through Musrara and environs, alternately working-class neighborhood by day and full of cutthroat intrigue after nightfall. The final scene is Schmaya's sons / Eilah's nephews bar mitzva party, where the freed (and cleaned-up) Schmaya dances gleefully with toker-turned-hero Arnav*, while at the bar, Wax tells Gitis how Schmaya foretold that she would fall in love with a former cop! *Think Bo in Bottle Shock.",
      "writers": [
         "Avi Nesher",
         "Shaanan Street"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt2882590/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjIyMzI1MDYwMF5BMl5BanBnXkFtZTgwMTQ1NjAyMTE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Adir Miller",
         "Ori Hizkiah",
         "Yehuda Levi"
      ],
      "reviews": [
         "The Wonders is an imaginative, conspiratorial mystery from the mind of Israeli filmmaker Avi Nesher. It both reflects upon and is critical of a variety of elements of Jewish culture, that different types of people will identify with. It tells the story of Arnav (aka Rabbit)- a local bartender, graffiti artist and general slacker- who gets sucked into the middle of a conspiracy after he witnesses a group of men force another man into the vacant building across from his flat. His curiosity is particularly peaked when this scene is followed by the emanation of a brilliantly alluring blue glow. After a little investigation, he finds out that a psychic televangelist Rabbi is being forcibly confined by a group of rabbinical mobsters. They are blackmailing him because he refuses to let them exploit his powers and participate in the cult that has been built up around him- for their monetary benefit, and the retention of their power- any longer. His confinement has a dual purpose though. It turns out that his willing participation in the mafioso's con made the \"perks\" go to his head. He too got addicted to the money and the power- while using his position as a holy man to sexually exploit his flock. This willing involvement caused him to lose his powers- which he, of course, perceives to be a punishment from God. Considering this, he sees it fit to subject himself to this solitary confinement in order to sacrifice and make penance. The Rabbi's wife's sister- Ellen- has hired a hardened ex-cop turned private investigator and tasked him with tracking the movements of the psychic Rabbi, as the gangsters move him from place to place. When they move the Rabbi into the building across from his flat, the PI approaches Arnav with a proposition that will both earn him a bit of money and satiate his curiosity surrounding the matter. Arnav accepts the PI's offer and begins to form a relationship with the Rabbi, only to discover he has been swept up as a pawn in a game being played out amongst a number of competing interests, driven by different motivations. Each of the forces involved has a plan for the good rabbi; who possesses the ability to accurately predict the futures of others. Once Arnav has agreed to help him, the ex-cop utilizes a series of entrapment techniques to scare Arnav into running surveillance related activities for him: using his relationship to spy on the Rabbi, and planting bugs so that he can be constantly monitored. As things progress, though, Arnav ends up becoming the moderating force in the matter- either sent by God or just because he was in the right place at the right time (depending on how you look at things). As was previously mentioned, the conflict he must circumvent is oriented around the fact that the Rabbi- who by this point has recovered from his loss of \"The Wonders\"- refuses to continue on as a willing participant in the thugs' scheming and conning. But the PI is also angry at him because he has not seen his wife and child since they joined his cult. Ellen is hiding a secret that is likely being used to blackmail him- and could ruin his reputation. While Arnav's best friend just wants a reading, so she can find out who her true love is. Will Arnav be able to successfully pit the competing forces against one another, to evade a conflict and save the day? Will the Rabbi's prophecies end up being fulfilled? You'll have to watch for yourself to find out. Nesher has included an underlying commentary on the nature of the \"surveillance state\" in this film. But he has also incorporated a number of \"fun\" elements into it as well: like Arnav's illustrations coming alive as animated characters, and all the humour that exploits a variety of cultural stereotypes. Throughout, he manages to maintain a balance that keeps you interested- while it's mystery element keeps you intrigued. As a non-Jewish westerner, I could really identify with Arnav (the pot smoking, secular, rebellious, accidental hero type), which helped me ground myself in the world of the film, despite being surrounded by the more explicitly Jewish characters whose nuances I was less likely to pick up on. With that being said, I found this to be a magically fun mystery that will both have you laughing- and leave you smiling- when you walk out of the theatre. If you are Jewish, you'll probably think the whole thing is downright hilarious! But you certainly don't have to be Jewish to love it (or even to get all the Jewish jokes). It's magical element isn't particularly Jewish either, which I think helps us non-Jewish audiences feel at home within the world of the film, despite it's Jewish orientation. It really is a film that can be enjoyed by anyone from any culture. 7 out of 10.",
         "Comedian Adir Miller is cast, with a full but short beard, as a fellow with a secretive profession. In his personal life, he is cut off from the woman he loves. He hires our protagonist, who can always use a little money, to facilitate his snooping. He scornfully nicknames the protagonist, with whom his working relationship is strained because they see the case from different points of view. That brief description fits both THE WONDERS and Avi Nesher's previous film THE MATCHMAKER (or ONCE I WAS). Regarding Adir Miller's character, the main difference is that in THE WONDERS he doesn't smile. But THE WONDERS is a further artistic step for Nesher because a string of successes in Israel (following a sojourn in the USA that seems to have been less successful) seems to have given Nesher the confidence to follow his instincts past the point where everything in the movie fits together traditionally. Nesher dares to revisit Alice in Wonderland (having visited it before in his American movie RITUAL), he fiddles with animation, he takes risks in casting. One reviewer complains that as Nesher's protagonist roams here and there on his mission, the story ultimately adds up to no clear message unless you count a bit of ethnic stereotyping. But for the most part, the movie seems to be enjoying an enthusiastic reception, and in my opinion rightly so.",
         "...but I want to add my two *zuzim*, weighing in as an Israeli. I loved it: The dialog and plot were clever, and the stereotypes were employed to just the right degree. The balance between comedy and thriller was perfect, as was the casting...pure fun. I fell in love with both both Arnav (who wouldn't?) and the setting, which mirrored the plot in its twists, turns, and leaps over drainpipes and across alleyways. Enjoyable film, solidly recommended. I admit that I failed to keep up with the plot's complexities, but it's to Nesher's credit that it didn't matter: Both viewers who grasp them, such as meddleCore (see review above) and viewers such as myself, who just \"enjoyed the ride\", will enjoy The Wonders equally. Kudos to Nesher!"
      ],
      "genres": [
         "Comedy",
         "Mystery"
      ],
      "productionCompanies": [
         "58th Century Entertainment",
         "Artomas Communications",
         "Metro Communications"
      ],
      "summaries": ["The complex relationship between a Jerusalem street artist and a mysterious, modern-day prophet being held prisoner in an abandoned apartment across the alleyway."],
      "budget": 4000000
   },
   "movielensId": 151753,
   "movielens": {
      "languages": ["עִבְרִית"],
      "releaseDate": "2013-06-05",
      "dvdReleaseDate": null,
      "directors": ["Avi Nesher"],
      "runtime": 112,
      "movieId": 151753,
      "title": "The Wonders",
      "mpaa": null,
      "actors": [
         "Efrat Gosh",
         "Ori Hizkiah",
         "Yehuda Levi",
         "Adir Miller",
         "Yuval Scharf"
      ],
      "imdbMovieId": "2882590",
      "originalTitle": "Plaot",
      "genres": ["Mystery"],
      "youtubeTrailerIds": [],
      "plotSummary": "Avi Nesher's new film tracks the complex relationship between a Jerusalem Graffiti artist and a mysterious modern day prophet who is imprisoned in an abandoned apartment across the Artist's window.",
      "tmdbMovieId": 214105,
      "avgRating": 3,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/lQ44BqX8xDIzcpZ3LTWnmTyhgFr.jpg"
   }
}