{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "religion",
            "id": 11001
         },
         {
            "name": "disabled",
            "id": 158558
         }
      ],
      "imdb_id": "tt3132714",
      "video": false,
      "title": "Marie's Story",
      "recommendations": [
         283699,
         83345,
         180418,
         26232
      ],
      "backdrop_path": "/rDMcShe8QhL5wUQfqKOOTCanE74.jpg",
      "revenue": 11720,
      "reviews": [{
         "author": "Reno",
         "id": "571ce0fc9251414a87001a05",
         "content": "> A unique tale of a student-teacher relationship.\r\n\r\nI did not know this movie till the last week, but I'm very happy that I discovered it. My experience watching it was like I have been waiting for a movie like this for a some time, but did not realise it until I saw it. I liked it a lot within the opening few minutes itself like I already finished watching the whole film. Because somehow I knew it will make my day. It is a heartwarming biographical family drama that tells about a girl who discovers that she can communicate with the world and can learn more about it, despite her birth defects.\r\n\r\nBased on the real story of a 14 year old blind and deaf girl Marie Heurtin that sets in the late 1800s rural France. As being a daughter of a craftsman who does not know how to raise a child like her, decides to send her to the Larnay institution where she can learn things among similar other girls and live a better life. After the initial hiccup, sister Marguerite takes the special interest in Marie and so the wonderful tale begins by revealing all the good, bad and sad events.\r\n\r\nA fascinating film with the wonderful characters, especially the two main characters were the focus of the whole film and no one else, not even a small peek on any other incidents. From a wild child to getting along, knowing the world is much bigger and learning it is the only way to cooperate. But when there is a dedicated teacher, students achieve more than what they dreamed of.\r\n\r\nThe actors who played those roles were exceptional. Especially the Marie's was very challenging one, but was so perfectly done by young new face. And Marguerite was the inspiring young nun that every convent in the world would dream to have under their wings. There are thousands of Marie and Marguerite in the world who never meet, that's why this movie is so special.\r\n\r\n> \"I am so happy. I will see Marie again. She is my joy, the daughter of my soul, the light of my life.\"\r\n\r\nThe French countryside where this film shot was so beautiful. The cinematography was at its best with a pleasing background score. While having so much fun, it also brings some intense tears in our eyes. Not like sentimental stuff, but happy tears. There comes a time for it as well when the movie gets emotional in the final stage of the storytelling. Like when it goes beyond the our reach, that makes us to accept the fate of what every life has to go through.\r\n\r\nI have heard that some are arguing the story was merely true, especially some of the scenes were overly cinematised. If you see it in that angle most of the historical event based films suffers the same issues while portraying the actual event or the character on the screen. Nonetheless, it is true and obviously modified for the adaptation.\r\n\r\nI have also heard it was totally resembling the Helen Keller's autobiography 'The Story of My Life' which was later made into a Hollywood movie that won both leading and supporting actress awards at the Oscars. Now I added that into my watchlist. Likewise the lead two actresses from this deserves similar high profile honour. But it is very sad to know the movie got much less attention despite it got a quality to strike the family audiences.\r\n\r\nAnyway, I thoroughly enjoyed the film. Lately I've been watching some interesting films. Better way to say it is I'm choosing good one, because I am not addicted to superhero, Hollywood or the big budget films alone like most of the young film fanatics are nowadays. I am here to find the hidden gems and suggest them to film fanatics. Now I highly recommend this one to all\r\n\r\n9/10",
         "url": "https://www.themoviedb.org/review/571ce0fc9251414a87001a05"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Sister Marguerite",
               "gender": 1,
               "credit_id": "53eb70a10e0a267a7e000e92",
               "name": "Isabelle Carré",
               "profile_path": "/phcKjntsViGBvj2NVNIYXutDDvn.jpg",
               "id": 4166,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Marie",
               "gender": 0,
               "credit_id": "53eb70a80e0a265f45001276",
               "name": "Ariana Rivoire",
               "profile_path": null,
               "id": 1352758,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Mère Supérieure",
               "gender": 1,
               "credit_id": "53eb70b20e0a265f5a00128e",
               "name": "Brigitte Catillon",
               "profile_path": "/5Lk7epqxqcd8TdxfexOc06kiTNn.jpg",
               "id": 20081,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "53eb70b70e0a265f49001250",
               "name": "Laure Duthilleul",
               "profile_path": "/4Ywi2S7bkI9onMjFKLDzECi6oSl.jpg",
               "id": 122571,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Sister Véronique",
               "gender": 0,
               "credit_id": "53eb70be0e0a265f500012c2",
               "name": "Martine Gautier",
               "profile_path": null,
               "id": 19064,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Sister Elisabeth",
               "gender": 1,
               "credit_id": "53eb70c50e0a265f500012c6",
               "name": "Sonia Laroze",
               "profile_path": null,
               "id": 1352760,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Sister Joseph",
               "gender": 0,
               "credit_id": "53eb70ce0e0a265f3b001231",
               "name": "Patricia Legrand",
               "profile_path": null,
               "id": 1352761,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "The Priest of Mazière",
               "gender": 0,
               "credit_id": "53eb70d30e0a265f500012cb",
               "name": "Christophe Tourrette",
               "profile_path": "/v5vBmtYOM5r5FpmbTTyVAIUMXU5.jpg",
               "id": 1352762,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "53eb70d80e0a265f45001280",
               "name": "Gilles Treton",
               "profile_path": "/bVI4lWMuttYa7fW6JfEoxDAOPbd.jpg",
               "id": 1198539,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53eb70e60e0a265f49001257",
               "name": "Jean-Pierre Améris",
               "profile_path": "/iH1RnwRYkYh5MY02aIdwhujdylA.jpg",
               "id": 145117,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53eb70ee0e0a265f45001282",
               "name": "Jean-Pierre Améris",
               "profile_path": "/iH1RnwRYkYh5MY02aIdwhujdylA.jpg",
               "id": 145117,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53eb70f80e0a267a7e000e9b",
               "name": "Philippe Blasband",
               "profile_path": null,
               "id": 19985,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53eb71040e0a265f570012d9",
               "name": "Denis Carot",
               "profile_path": null,
               "id": 20432,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53eb710f0e0a265f42001344",
               "name": "Sophie Révil",
               "profile_path": null,
               "id": 1167745,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.014358,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 286595,
      "vote_count": 34,
      "budget": 0,
      "overview": "Marie Heurtin is born both blind and deaf. Sister Marguerette wins her trust and teaches her how to express herself.",
      "similar": [
         268677,
         335778,
         2331,
         1813,
         615,
         324786,
         9946,
         6844,
         5876,
         310,
         583,
         13363,
         9411,
         866,
         192,
         9509,
         9552,
         10545,
         9693,
         242
      ],
      "original_title": "Marie Heurtin",
      "runtime": 95,
      "poster_path": "/YculuNkPUrtaM8jdNBmZAQt8yp.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "La Banque Postale Image 7",
            "id": 46205,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Escazal Films",
            "id": 14026,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 3 Cinema",
            "id": 16804,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rhône-Alpes Cinéma",
            "id": 1666,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Région Rhône-Alpes",
            "id": 12392,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France Télévision",
            "id": 7454,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciné+",
            "id": 10611,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinémage 8",
            "id": 27123,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2014-08-10",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean-Pierre Améris"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Jean-Pierre Améris",
         "Philippe Blasband"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt3132714/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNjMwMzE2MTc2NF5BMl5BanBnXkFtZTgwNTQ3MTQ0NDE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Isabelle Carré",
         "Ariana Rivoire",
         "Brigitte Catillon"
      ],
      "reviews": [
         "Marie Heurtin is based on the true story of Soeur Marguerite, a sister who lived in a covenant in the 1800, in France, and Marie Heurtin, a young girl who was born blind and deaf. She grew with almost no education, and at the age of ten, her parents brought her to the covenant les Filles de la Sagesse, which was specialized in taking care of deaf girls and teaching them sign language. However, Marie proved much of a challenge because she was also blind. The film relates the early life of Marie Heurtin, who was taught sign language by the kind and determined sister Marguerite. Although Marie is very difficult to teach to, Soeur Marguerite's perseverance and the bound they build together is extremely touching. The movie doesn't have a lot of spoken dialogue, in fact most of the dialogue is through sign language and is intentionally not subtitled, because we are meant to feel it; the words are not important, we can figure out their meanings just by looking at the emotions the characters convey to us through the screen. Isabelle Carré and Ariana Rivoire's performances are poignant and real. The only thing I found disappointing is that the movie only shows us a very small portion of Marie Heurtin's life, and makes it seem like Soeur Marguerite only taught her for about a year or so, when in reality, she taught her sign language for around ten years of her life, and Marie was 25 years old when her teacher passed, not 10 or so like in the movie. Then Marie Heurtin at her turn taught sign language to many other girls, including her young sister who was also blind and deaf. I think it was a mistake to omit her later years from the movie, especially since it runs a little long. Seeing her grow up would have been a real plus to the movie, so that's a missed opportunity. Nonetheless, it's a beautiful and heart-warming movie that shows us the importance of what love and interaction between people can bring into our lives, and the power that being able to convey feelings really gives us.",
         "For me, this was the best Netflix film find of the year. This is a French movie, with subtitles in English. Marie's Story is the biography of Marie Heurtin. Not unlike Helen Keller, Marie is deaf and blind. The story unfolds very similarly to that of The \"Miracle Worker.\" But unlike The Miracle Worker, this film explores fully aspects of life, that \"The Miracle Worker\" never dared to cross. In the space of 95 minutes, this movie explored the full range of human emotion. There very little need for spoken dialogue. Instead what was communicated through the actions of the characters, needed no audible communication to comprehend. The acting was truly exceptional. The music was perfect. Not overpowering. Not distracting. Marie's signing at the end weren't words. They were poetry from the heart. Wayno",
         "Writer (with Phillipe Blasband) and Director Jean-Pierre Améris has created a stunning film that speaks about people born with disabilities and how in the case of this character those people often become significant contributors to our understanding of humanity at its most sensitive. Based on a true story the film is radiant in both the acting and the extraordinary setting in which the story is presented. The synopsis outlines the message very succinctly:' At the turn of the 19th century, a humble artisan and his wife have a daughter, Marie (Ariana Rivoire), who is born deaf and blind and unable to communicate with the world around her. Desperate to find a connection to their daughter and avoid sending her to an asylum, the Heurtins (Gilles Treton and Laure Duthilleul) send fourteen-year-old Marie to the Larnay Institute in central France, where an order of Catholic nuns manage a school for deaf girls. There, the idealistic Sister Marguerite (Isabelle Carré in a luminous performance) sees in Marie a unique potential, and despite her Mother Superior's skepticism, vows to bring the wild young thing out of the darkness into which she was born. The film recounts the courageous journey of a young nun and the lives she would change forever, confronting failures and discouragement with joyous faith and love.' A sensitive film, rich in message and in visual realization, this is one of those quiet, uplifting films – especially made for those who tire of the deluge of killing/action/crash/apocalyptic/undead films that assault our senses. Highly Recommended.",
         "Movies about people who have \"issues\" are difficult to watch. And it's not different with this one. The performances are great, even if you can predict almost everything that is about to happen beat for beat. It doesn't make the movie less emotional or less engaging to watch and experience that journey. There are always obstacles to overcome (as in life and this is based on a real person), though I'm not overly familiar with the real story, so I can't tell if this is close to what actually happened. Some things might be heightened for drama aspects, but we are used to that and the movie does a good job with it.",
         "This movie portrays a fantastic and moving experience with great beauty and sensibility. When I saw the trailer I figured out the greatness of this movie, but it went further, exceeding expectations. It not only a great story, but it is full of surprises from the beginning to the end. A life reflection. To which confines can a human heart go looking for the other. Which barriers can a human mind surpass in the most lost place. It is touching to follow Marie and Marguerite groping for dark paths to meet and understand each other. The fury, the despair, the discouragement, the resumption, resumption, resumption. This is a movie for the heart above all.",
         "I did not know this movie till the last week, but I'm very happy that I discovered it. My experience watching it was like I have been waiting for a movie like this for a some time, but did not realise it until I saw it. I liked it a lot within the opening few minutes itself like I already finished watching the whole film. Because somehow I knew it will make my day. It is a heartwarming biographical family drama that tells about a girl who discovers that she can communicate with the world and can learn more about it, despite her birth defects. Based on the real story of a 14 year old blind and deaf girl Marie Heurtin that sets in the late 1800s rural France. As being a daughter of a craftsman who does not know how to raise a child like her, decides to send her to the Larnay institution where she can learn things among similar other girls and live a better life. After the initial hiccup, sister Marguerite takes the special interest in Marie and so the wonderful tale begins by revealing all the good, bad and sad events. A fascinating film with the wonderful characters, especially the two main characters were the focus of the whole film and no one else, not even a small peek on any other incidents. From a wild child to getting along, knowing the world is much bigger and learning it is the only way to cooperate. But when there is a dedicated teacher, students achieve more than what they dreamed of. The actors who played those roles were exceptional. Especially the Marie's was very challenging one, but was so perfectly done by young new face. And Marguerite was the inspiring young nun that every convent in the world would dream to have under their wings. There are thousands of Marie and Marguerite in the world who never meet, that's why this movie is so special. \"I am so happy. I will see Marie again. She is my joy, the daughter of my soul, the light of my life.\" The French countryside where this film shot was so beautiful. The cinematography was at its best with a pleasing background score. While having so much fun, it also brings some intense tears in our eyes. Not like sentimental stuff, but happy tears. There comes a time for it as well when the movie gets emotional in the final stage of the storytelling. Like when it goes beyond the our reach, that makes us to accept the fate of what every life has to go through. I have heard that some are arguing the story was merely true, especially some of the scenes were overly cinematised. If you see it in that angle most of the historical event based films suffers the same issues while portraying the actual event or the character on the screen. Nonetheless, it is true and obviously modified for the adaptation. I have also heard it was totally resembling the Helen Keller's autobiography 'The Story of My Life' which was later made into a Hollywood movie that won both leading and supporting actress awards at the Oscars. Now I added that into my watchlist. Likewise the lead two actresses from this deserves similar high profile honour. But it is very sad to know the movie got much less attention despite it got a quality to strike the family audiences. Anyway, I thoroughly enjoyed the film. Lately I've been watching some interesting films. Better way to say it is I'm choosing good one, because I am not addicted to superhero, Hollywood or the big budget films alone like most of the young film fanatics are nowadays. I am here to find the hidden gems and suggest them to film fanatics. Now I highly recommend this one to all 9/10",
         "Of course, \"The Miracle Worker\". There is the same disease, same physical struggle with a stubborn teen to force her to learn, but in French not English. I appreciated the photography and the location but I continually had to resist the temptation to check my watch. It might be just over 90 minutes but at times it seemed like hours. It would drag and drag and then suddenly leap forward after she learns the sign for one object. The next thing we know is she is showing off how she can spell her name and understanding abstract concepts like 'patience'. There was also the monologue at the end which seemed especially message-y. I liked the acting by Isabelle Carré and Brigitte Catillon but Ariana Rivoire as the deaf/blind girl didn't impress. Possibly it was just because she had so little to work with. To sum up, see \"The Miracle Worker\" instead."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Escazal Films",
         "France 3 Cinéma",
         "Rhône-Alpes Cinéma"
      ],
      "summaries": ["Marie Heurtin is born both blind and deaf. Sister Marguerette wins her trust and teaches her how to express herself."],
      "budget": 0
   },
   "movielensId": 152185,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2014-08-10",
      "dvdReleaseDate": null,
      "directors": ["Jean-Pierre Améris"],
      "runtime": 95,
      "movieId": 152185,
      "title": "Marie's Story",
      "mpaa": "PG",
      "actors": [
         "Isabelle Carré",
         "Ariana Rivoire",
         "Brigitte Catillon",
         "Laure Duthilleul",
         "Martine Gautier",
         "Sonia Laroze",
         "Patricia Legrand",
         "Christophe Tourrette",
         "Gilles Treton"
      ],
      "imdbMovieId": "3132714",
      "originalTitle": "Marie Heurtin",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["7HG-bDNEumw"],
      "plotSummary": "Marie Heurtin is born both blind and deaf. Sister Marguerette wins her trust and teaches her how to express herself.",
      "tmdbMovieId": 286595,
      "avgRating": 4.07143,
      "releaseYear": "2014",
      "numRatings": 7,
      "posterPath": "/YculuNkPUrtaM8jdNBmZAQt8yp.jpg"
   }
}