{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "music video",
            "id": 5699
         },
         {
            "name": "pop music",
            "id": 33922
         },
         {
            "name": "ghoul",
            "id": 158729
         }
      ],
      "imdb_id": "tt0119194",
      "video": false,
      "title": "Ghosts",
      "recommendations": [
         92060,
         342381,
         80269,
         129893,
         44625,
         40466,
         60428,
         144421,
         40378,
         30666,
         27052,
         79550,
         83651,
         14416,
         75404,
         14033,
         16077,
         17994,
         20595,
         8417
      ],
      "backdrop_path": "/vgbPOKJXzmFUeZ7xDBO5Yi2es7K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Maestro / Mayor / Mayor Ghoul / Super Ghoul / Skeleton",
               "gender": 2,
               "credit_id": "52fe466e9251416c910544c5",
               "name": "Michael Jackson",
               "profile_path": "/9nDsffd8kZ2O9MlnIiqWRVausM7.jpg",
               "id": 82702,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Pat",
               "gender": 0,
               "credit_id": "52fe466e9251416c910544c9",
               "name": "Pat Dade",
               "profile_path": null,
               "id": 134710,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Amy",
               "gender": 0,
               "credit_id": "52fe466e9251416c910544cd",
               "name": "Amy Smallman",
               "profile_path": null,
               "id": 134711,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Edwina",
               "gender": 1,
               "credit_id": "52fe466e9251416c910544d1",
               "name": "Edwina Moore",
               "profile_path": null,
               "id": 6214,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Dante",
               "gender": 2,
               "credit_id": "52fe466e9251416c910544d5",
               "name": "Yasiin Bey",
               "profile_path": "/x51WKi3gxwobt9Sov5HeS5kKHUe.jpg",
               "id": 4239,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Seth",
               "gender": 2,
               "credit_id": "52fe466e9251416c910544d9",
               "name": "Seth Smith",
               "profile_path": "/uHGa5v9V597j1UIDWAz29771U8P.jpg",
               "id": 134712,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Kendall",
               "gender": 0,
               "credit_id": "52fe466e9251416c910544dd",
               "name": "Kendall Cunningham",
               "profile_path": null,
               "id": 134713,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Loren",
               "gender": 0,
               "credit_id": "52fe466e9251416c910544e1",
               "name": "Loren Randolph",
               "profile_path": null,
               "id": 134714,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Heather",
               "gender": 0,
               "credit_id": "52fe466e9251416c910544e5",
               "name": "Heather Ehlers",
               "profile_path": null,
               "id": 134715,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544b5",
               "name": "Mick Garris",
               "profile_path": "/g7NQv3FBJaQaXTVHDydqaDADir6.jpg",
               "id": 61824,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544bb",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544c1",
               "name": "Michael Jackson",
               "profile_path": "/9nDsffd8kZ2O9MlnIiqWRVausM7.jpg",
               "id": 82702,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544eb",
               "name": "Stan Winston",
               "profile_path": "/bs8iaDGeDg0vHw4GLcT7A2nAJbb.jpg",
               "id": 60261,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544f1",
               "name": "Stan Winston",
               "profile_path": "/bs8iaDGeDg0vHw4GLcT7A2nAJbb.jpg",
               "id": 60261,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544f7",
               "name": "Stan Winston",
               "profile_path": "/bs8iaDGeDg0vHw4GLcT7A2nAJbb.jpg",
               "id": 60261,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c910544fd",
               "name": "Mick Garris",
               "profile_path": "/g7NQv3FBJaQaXTVHDydqaDADir6.jpg",
               "id": 61824,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c91054503",
               "name": "David Nicksay",
               "profile_path": null,
               "id": 8305,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c91054509",
               "name": "Nicholas Pike",
               "profile_path": null,
               "id": 57902,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c9105450f",
               "name": "Russell Carpenter",
               "profile_path": "/zhcM8RBTC8goTfJT3TbraeO1x5n.jpg",
               "id": 8523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe466e9251416c91054515",
               "name": "Marcus Manton",
               "profile_path": null,
               "id": 72547,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c9105451b",
               "name": "Michael Z. Hanan",
               "profile_path": null,
               "id": 34858,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c91054521",
               "name": "Rick Baker",
               "profile_path": "/duiRGU1zSX3w1bhGW8UztVHjpeG.jpg",
               "id": 16178,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.030735,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37793,
      "vote_count": 32,
      "budget": 0,
      "overview": "The film tells the story of a scary Maestro with supernatural powers, who is being forced out of a small town by its mayor. The movie includes a series of dance routines performed by Michael Jackson and his \"family\" of ghouls. Every song from the film was taken from Michael Jackson's HIStory and Blood on the Dance Floor albums.",
      "similar": [
         2005,
         872,
         254470,
         525,
         6477,
         824,
         630,
         354912,
         69,
         786,
         15121,
         27,
         252,
         3933,
         10020,
         114150,
         353616,
         316029,
         10947,
         8587
      ],
      "original_title": "Ghosts",
      "runtime": 39,
      "poster_path": "/e52BUE3YGwbFuVYG4CKWNYt4JmD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Heliopolis",
            "id": 6785,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MJJ Productions",
            "id": 14405,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-04",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Are you scared yet?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stan Winston"],
      "runtime": 40,
      "synopsis": "Before watching the 1997 film, \"Ghosts\", you should watch the music video to the song \"Ghost\" by Michael Jackson. It is three minutes and fifty-seven seconds long, and it gives a taster of what the film is like. An ordinary large town has a creepy, old, dark, mysterious mansion on the outskirts. The Maestro (Michael Jackson) is an elusive young man who lives in the old mansion. All the children of the town go to the mansion every day, and the Maestro entertains them with his wonderful, supernatural powers. The children end up telling their parents about all the fun they have at the Maestro's home. Gradually, all the adults of the town hear about this, and none of them trust the Maestro, especially the Mayor (Michael Jackson), who is a pompous, old, fat man, who dresses smartly. Despite what the kids say, the people of the town get together, and agree that that night, they would banish the Maestro from the town, remove everything he owned, and destroy his house. Late that night, there is a storm. All the townspeople have arrived outside the Maestro's house. The further they get into the house, the more frightened the people become. It's only the children who show excitement at what they may experience on this particular trip. When they reach the main hall of the house, they hear an odd noise from a dark corner and the Mayor nominates himself to investigate. A skeleton wearing a long black robe appears from the darkness, scaring all in the room. The Maestro emerges from behind what is revealed to be a skull mask, and asks if he scared anybody. In a forced brave tone the Mayor insists that the Maestro may have scared everybody else but he didn't scare him, and the Maestro states that he must try harder next time. Bucking up some courage, the Mayor begins to tell the Maestro that a quiet and normal town like his doesn't need a \"freaky boy\" like him, and demands that he leave town. A small argument follows, with the Maestro admitting that although he does like to frighten people, he only does it for fun, and the children agree that they enjoy their experiences in his house. However, the Mayor refuses to accept this, threatening that he will use force if need be. Taking this as a challenge, the Maestro attempts to scare the Mayor - first mockingly, pulling faces, which getting stranger as he stretches the skin around his eyes and mouth by inches, and then he means business. Having scared everybody, the Maestro shifts his face back to normal, and summons his 'family' of ghosts. Once all twelve ghosts are present, he and all the ghosts proceed with their challenge by performing an elaborate dance routine. [\"2 Bad\", from the album \"HIStory\"] Once this is finished, the Maestro stands at the back, and the twelve ghosts dance. [Instrumental version of \"You Win Again\" by the Bee Gees] Once that is over, the Maestro goes to the centre of the hall once more, and very quickly removes all his clothes, skin, and muscle until he is just a skeleton. The skeleton then performs \"Is It Scary?\" [by Michael Jackson, from the album \"Blood On The Dance Floor\"] Once this is over, he steps aside once more, and all the ghosts mock and haunt the Mayor. When they have had their fun, the Maestro's skeleton transforms into a large devil. The devil slowly disappears, and in doing so, he has possessed the Mayor. Now that the Mayor has been possessed, he goes to the centre of the hall, and performs \"Ghost\". [by Michael Jackson, from the album, \"Blood On The Dance Floor\"] When he is finished, the Mayor regains sanity, and has just about had enough, when an arm plunges out of his stomach. The arm holds a mirror. The Mayor looks in the mirror, and when he does so, he transforms into a beast. After all this, the Maestro stands before the Mayor and asks if he still wants him to leave, to which the Mayor responds with a desperate \"yes!\" Giving in almost easily, the Maestro throws himself to the floor, smashing his hands and head to the stone, crumbling until he's just dust, and the breeze blows him away. Almost triumphantly, yet still with the mark of terror, the Mayor turns on the spot and marches straight to the door. Upon opening it he sees the Maestro's demonic face blocking the entire exit. Petrified, the Mayor runs through the glass windows and out of sight. The people, who have been watching in both horror and awe, turn to see the Maestro smiling. \"Did I scare you?\" asks the Maestro, sounding exceptionally pleased. The people nod furiously, having never been more terrified in their lives. \"Did we have a good time here?\" the Maestro enquires. After a moment of silence, he urges the people to answer, and they respond feverishly. Then their faces drop. The Maestro asks what the matter is, spinning slowly around once realising that there is someone behind him. The skeleton in a black robe is standing there, causing the Maestro to step back in shock. It's revealed that two of the children have teamed up with the skull mask to try to frighten the Maestro. Admitting that they maybe scared him a little, the Maestro begins to laugh. The final scare of the movie is when the third child begs the attention of all in the room, asks \"is this scary?\" and begins to pull at his face...",
      "writers": [
         "Stan Winston",
         "Mick Garris"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119194/",
      "coverLink": null,
      "actors": [
         "Michael Jackson",
         "Pat Dade",
         "Amy Smallman"
      ],
      "reviews": [
         "This was a breathtaking short-horrormusical with Michael Jackson, finally a bit cool. Some people think that it is a spin off to THRILLER, but I can't see any similarity at all. Let's all remember that Michael Jackson was an adult as a child, and he has got to have room for his childhood somewhere too. I love Michael Jackson's short films, and this is no exception.",
         "This video serves as a reminder that the only thing that has changed about Michael Jackson is the way we look at him. The genius is still there and has grown 10,000 times since thriller. If you put this movie up against thriller it makes thriller pale in comparison musically, special effects wise, basically in every way, it's just that most people are too stupid to see it because like little kids, they are too caught up in the way he looks (which is just fine in this movie btw). The dancing is jaw dropping! The music is excellent! Makes you want to get up and dance! The plot is funny and shows Michael Jackson's sense of humor about the way he knows people think about him. EXCELLENT MOVIE! Do yourself a favor and stop believing all the crap you hear and missing out on jaw dropping perfection which is everything he puts out! In my opinion my top 10 favorite pieces of work by him are: 1) The 'Scream' Video (over 7 Million Dollars and you see every dime) 2) The 'Ghosts' Video / Movie 3) The 'Earth Song' Video (if it doesn't move you emotionally you're not human) 4) The 'HIStory' album (easily his best work for someone mentally over the age of 12) 5) The 'Dangerous' album (every song is perfection) 6) The 'You Rock My World' video (Chris Tucker, Malron Brando, Michael Madsen & Michael Jackson how do you not have a great video?) 7) The 'Invincible' album (10 million records sold & counting, great piece of work, tuned to perfect pop precision) 8) The 'Black or White' song / video (They are both excellent!!) 9) The 'Stranger in Moscow' song /video (I mean that's where you see how much of a genius he still is) 10) The 'Blood on The Dance Floor' album (the first five tracks really show how amazing he is as a writer, it awesome) *** Thriller goes without saying, but he really has done some of his best work since then.***",
         "Being a Michael Jackson fan since the early 1980's I've always remained interested in anything he does. I think commercially his best days were behind him in the mid-90's, but this is still an excellent video and it far exceeds a lot of the crap that artists put out there today. Most videos are the same thing over and over, the artists with the line dancers in bikinis behind them, YAWN! Michael Jackson comes along and takes the music video to the next level, he puts a storyline into it and killer special effects. When you get done, the only person the guy has failed to outdo is himself. Like him or no, Michael Jackson is still the king of music video.",
         "I love this as its just so cool and so Michael (all wild imagination and amazing dance routines) and brings the joys of childhood and the memories every child had of the haunted house down the road that never was haunted Michael takes a simple Childhood fantasy adds some magic and brings it to life it's one of those short film where you can imagine you were there with superb special effects and Amazing dance routines. Michael Jackson fan or not this short film slash music video is the totally cool to get you moving to the beat wonder how do his legs do that? and appreciating the talent MJ really does have as a performer.",
         "This film is absolutely stunning once AGAIN Michael Jackson stuns us with his excellent dance moves and vocal. I love this film to bits and it is so funny. I mean his dance moves are just SOOOOO GOOD, I would recommend anyone to see this.",
         "Michael Jackson has embraced generations with beautiful short films. Usually they are made to promote a single, but in this case he gives us something else. Sure, in this film there are also songs (which are available on c.d.), but the emphasis is on a funny story and great special effects. This release passed many people by, which is a shame since this thing is really worth watching and shows great promise at Michael's promised new acting jobs.",
         "As a life long fan of Michael Jackson, you could argue that I am bias. But one of the reasons why Jacko's career is so amazing, is his music videos. No artist in history has created as many fantasical music videos as he. Billie Jean, Thriller, Smooth Criminal, Leave Me Alone, Black or White, Remember the Time.... This list goes on, Jacko is a quality entertainer! The dancing is spectacular, The soundtrack is awesome, the melodies and rifts are vintage Jackson and the special fx are superb. Sure, it could be seen as Thriller of the 90's, but who else could produce such a thing? Madonna? not a chance! anyone? not even close! What suprises me the most is its limited release and promotion. If the music was publisised more and the short film was given its deserved air-time, then people would have to stand back and watch in ore of a true genius at work. 10/10, As music videos go, Ghost is spectacular and only the true King of Pop could produce such a masterpiece!",
         "This film is not really a film at all. It's more of a TV show. It deals with a \"Freak\" living alone in a house that tells kids strange stories and performs strange tricks. The townspeople want him to leave, but he doesn't want to... so he does what all \"Freaks\" would do... dance. Just like on Thriller. I felt honored to see this, being that it was only released overseas. VH1 and MTV aired it many times during the Halloween season. I taped it... so, I can watch it any time I want. I think that you should check it out if you ever get a chance. Of course, Thriller is better... but this is a close second. A 10/10!!",
         "If you don't want to know the story, then DO NOT read this! Well...I have to say, I actually like this. A little like 'Thriller' but much better and the special effects are amazing. The music is good, and at some point; you can't help but laugh at Michael's face. This would be a good movie for Halloween, you get the goodness of Zombies, music and a middle-aged pop star grabbing some crotch, I'd put the children to bed first. If you like Michael Jackson then this is your kind of film, if you don't like him then\u0085why are you reading reviews?? So they story\u0085Well people decide they want to get rid of a creepy guy in his haunted house, so the mayor gathers the town folk and they go up there. Eventually the bump into Michael Jackson, the mayor takes an instant disliking to Michael. Everyone is convinced Michael likes scaring people, which he admits to, and of course he scares everyone. He does a little singing, dancing and crotch grabbing and people begin to like him, even thought he turns into a skeleton. Hmm\u0085But there's a twist, with the mayor maybe?? Ehheeee, you'll have to watch the rest.",
         "In some way, I think Michael was trying to get another \"Thriller\", he didn't. But he did come out with a great music video. It worked on a lot of levels. The only creepy thing was Michael's make up, and no make up. And the kids in the video, even more creepy. I was kind of expecting Maculy Culkin to be in it for some reason. Or Liz Tailer. J/K! But I'm letting go. I thought he was wonderful. The video is original. The story is original. And even though this is no \"Thriller\", it's still excellent. Michael Jackson is the king of pop. No matter what anyone says, he is still the king. He can't be topped in music or videos. 9/10",
         "He may not look like the same Michael Jackson we saw in \"Thriller\", but he's just as good as he was before. The special effects were incredible. The makeup work (I loved seeing Michael Jackson as the mayor-ish guy) was incredible and so was the dancing. It's too bad the music wasn't as good. He uses some of his worse stuff in \"Ghosts\", which is mediocre by our standards. It isn't his best work, but \"Ghosts\" is still pretty entertaining.",
         "\"Ghosts\" plays more as a special effects reel than as a movie or a music video. The \"song\" portion of the video is incredibly slight. In his heyday, Michael Jackson and his accomplices were able to produce videos that integrated fun (if not brilliant) visuals with his once unique brand of pop music. Now, his videos -- of which \"Ghosts\" is easily the worst -- have become half-hour-long egofests. Stan Winston is a brilliant makeup artist, but as a director he is just awful. This video plays like a series of reaction shots: Michael Jackson does something ooky; the parents, kids, and Mayor react with horrified visages and huddle together; Michael does something \"funny\"; the parents and kids look amused (and for some reason comforted), while the Mayor continues to look perturbed. This series of events happens over and over and over again. At least half the video consists of those annoying reaction shots; what a waste of videotape! Even the choreography for this video is poorly filmed, and choreography should be the focal point of any Michael Jackson video. Winston focuses on the makeup rather than on the dancers, giving closeups of their grotesque features instead of their footwork. The video's message is obviously that odd-looking weirdos like Michael Jackson can still be lovable, but I do not see how the video succeeds in reinforcing this theory. The little kids involved seem to have no problem with Michael's ability to jump down another human's throat and manipulate him like a puppet. I dunno -- if I were ten years old, I think that might bother me a bit.",
         "Michael Jackson's Ghosts just further engraves the King Of Pop's unique ability to produce a very entertaining and high quality short film. Although this can hardly be called a short film, as it runs approximately 35 minutes. There is no doubt that a lot of thinking and money went into this, all for a music video that is. I like the fact that Michael helped write the whole script and did a lot of the work, not just the acting. This video lives up to the whole Michael Jackson standard, and would be appreciated by not just fans but anybody of all ages. May not be as organic as the Thriller days but still comes pretty close. Great music video, definitely check it out!",
         "This movie is incredible. I don't think it was released in the U.S. and if you can get it, it is a must see. If your a fan of MJ or not this film is actually better than the Thriller video. It is scary, thought provoking and fun and is a must see!! The effects are done by Stan Winston and by todays standards are a bit dated, However still effective for their intentions. Some notable characters are evident. Mos Def plays a frightened visitor to the home. There are a couple of must see scenes. The possession of the mayor by Michael is priceless, the dance sequence by the demons, and the dance sequence by MJ's skeleton are all unique visions that have not been seen on screen before.",
         "This is a wonderful short film, with stunning visual effects. You can't deny the effects, make up and dancing in this film weren't top notch. The acting was a bit rusty but it wasn't awful, and to be honest, with everything else going on, it didn't matter. When people say this is similar to Thriller, they're thinking one-dimensionally. Yes, Michael Jackson did Thriller...a short film with zombies in. But so? Does everyone who has done more than one action film, more than one love song, more than one something something mean they're unoriginal, copying themselves or whatever? No. This is nothing like Thriller, apart from the fact its make believe and maybe scary for little kids. I also think this is a sort of stab at all the people who say Michaels face is destroyed and what not...with the scene where he takes his face off and smashes it into the ground...as if to say 'yeh look at me and my good looking face that you all so willingly diss, f/ers'. Haha, maybe I'm wrong but thats my perception. Michael takes risks, and because he does he can produce a fantastic short film. He'll always be the king of videos.",
         "When I saw this movie, I was amazed! The intriguing story of a mysterious man in a mansion, who did magic tricks and danced among ghouls, like their King. This reminded me of the movie Labyrinth and its goblin king. Jim Henson once remarked of the filming of Labyrinth that David Bowie was not their first choice and among many singer/actors, a choice could have been Michael Jackson! At that time, I thought it was hard to picture...to fill a role of David Bowie's but now to see this movie of Michael's, this whimsical short, with all his fun and magic, and yet his stern demeanor \"Are we having fun yet? HELLO?!\", I could see perhaps how he could do that. The dancing is superb, the special effects excellent! HOW he could pull off so many intricate prosthetic costumes, I don't know. I guess that's MJ for ya. This movie also includes the general theme of not judging others by appearance, something that is always important to remember. It's a great short and very unique.",
         "Mike has and is going through a lot but Ghosts is a one of a kind type thing . Tell me how many movies have you seen a dancing and sing ghost with others of all sorts.when you go deep into thought about it it can scare you fonding other than pure good hearted fun. Sure it is some what a little well weird but there are music videos I've seen plan awful. Not this one this one is a true one of a kind as I say again.The great thing of all I want to stress is the fact that he is preforming in this so when it comes to a end you have to see what that hole part is about which can target another idea and just as long as the performance went on another can to stress the answer of this problem or the problem that needs to be answered. Which is why THis is a just wonderful superb movie to fill a tape. Even though mike isn't the most popular thing right now his movie can be.",
         "I really enjoy watching GHOSTS! I think its really imaginative and well done! The dance routines are totally awesome!!!! My favourite part apart from the dancing has to be when Michael turns into the ghoul and says to the mayor (also played by Michael) \"Are ya' scared yet?\". It's ACE!!!! 10 out of 10 for GHOSTS!!",
         "Well Michael Jackson has done it again. He has made another cool short film that everyone would enjoy. This movie is very good. The plot is good, the actors especially Michael Jackson did an excellent job and the songs that Michael sang are awesome! The direction of this movie is good and the setting of the movie is great. I got this movie and when I watched it for the first time, I really enjoyed it. My nephew also enjoyed this movie and we like to watch it again and again. Good job Michael. Rating: 10 out of 10",
         "Now I have been a fan of Michael Jackson since I was a baby. I LOVE this video, it's my favorite video in the world! Haha, there are some pretty funny scenes in it too (i.e. \"Don't hit your brother!\"), and some I was like \"WHOA!\" Hehee... my sister is six and she LOVES it. We're planning on getting it on video.",
         "Once again The King Of POP dazzles us with an amazing short film. Every time he makes a piece of entertainment, we sit back and wonder how and why he gets those ideas. Somehow he manages to get the top of the line to help him. This piece can be watched again and again, and still be nothing else than a masterpiece. Michael Jackson will always have a dear place in my heart, and this extra vaganza is no exception !!",
         "It was a noble effort to get Stephen King and Michael Jackson to work together, but this is just really an effort for Michael to show himself off and hide behind a few masks. The special effects were good, but paranormal reasoning just flies out the window as nothing makes sense in this short film. There's a lot of talk, but not much of a plot to follow. You sort of think you understand as things keep changing the details you've picked up. Michael should have stopped with Thriller; this film just gives me a headache.",
         "I love Ghosts. As a MJ fan I think it's the best mini-movie he's ever made. Thought it could've been a little bit longer, it was completely awesome. I like his role for the Mayor. I'm mad it wasn't released around my area though. I also like his dances especially when he was singing 2Bad. The whole mini-movie was for Ghosts, Is It Scary, and 2Bad. All in all , out of 10 I'd give it an 8. When this new album comes maybe there will be more lengthy short films like he made \"Ghosts\". If you watch carefully you can see Mos Def. I don't know if there are any more stars besides Mike in the movie. I really like the mini-movie Michael Jackson's Ghosts.",
         "Michael Jackson's Ghosts follows traveling maestro (played by Michael Jackson), who settles in an old haunted mansion on the outskirts of a small ordinary town. After one of the young children tells an adult of the tricks that the maestro has been playing, many people in the small town mob together to confront him, lead by a devious mayor. The mayor of the small town (also played by Michael) threatens him to leave and in exchange, the maestro decides to make this encounter a game, whoever gets scared first must leave. The maestro then summons the various ghosts that live in the mansion and puts on an elaborate show to scare the mayor away. The entire video lasts about 30-40 minutes and is one of the most spectacular short films I have ever seen. With fantastic choreography and music, awesome special effects, a unique and original concept, and great performances by the entire cast (most notably Michael, who truly shines as he plays multiple roles, all of which are very different from each other) this short film is a chilling yet fascinating viewing experience. I personally find it to be one of Michael's most overlooked short films (music videos). 10/10 One question: \"Are you scared yet?\"",
         "Those who says it's a re-cycled Thriller obviously didn't understand much of this film. Which is a shame because by some of the hateful comments it's exactly them who have something to learn from this message. I consider this film a masterpiece and unlike Thriller it's not just an entertaining horror story. It's a lesson about how we, as a society tend to treat people who are different. We lynch them, want to drive them away, want to ostracize them. We hate them. And that all just because they are is different. In real life Michael Jackson was at the receiving end of this kind of hatred (as demonstrated even in some comments here), so he knows exactly what he is talking about. It's also important to listen to his lyrics. The song \"Is it Scary\" says it all about how we project OUR OWN dark thoughts onto others and how we should be careful because the evil we assume in others might actually come from our own mind! Masquerade the heart Is the height of haunting souls Just not what you seek of me Can the heart reveal the proof Like a mirror reveals the truth See the evil one is you I also have to say the acting on Michael Jackson's part in this short film is fantastic! He doesn't only play the protagonist, the Maestro, but also the Mayor whose character was probably inspired by Tom Sneddon (the bigoted, judgmental, hateful right winger). Not to mention the crazy and unique dance routines where MJ never disappoints. When this piece came out the media (especially in the US) already decided that no matter what MJ does they will trash it. From some of the criticism directed at this film it is painfully obvious that they didn't even intend to give it (and MJ in general) a chance. Criticism was often directed not at the art piece itself but at Jackson's looks or tabloid gossip. Is that serious criticism of art? But ironically exactly this phenomenon is what proves Jackson's point that he presents in this film! It seems like the people who should look into Jackson's mirror try to avoid this mirror he holds up in front of them. He certainly hit a nerve! So the film remains very, very underrated. I don't think it will stay this way for ever. The film is too good and too profound for that. Perhaps the society which is criticized in it has to pass before a new generation comes along and will analyze Jackson's art with an open mind, without the decades long media brainwash influencing them."
      ],
      "genres": [
         "Short",
         "Fantasy",
         "Horror",
         "Music"
      ],
      "productionCompanies": [
         "Heliopolis",
         "MJJ Productions"
      ],
      "summaries": [
         "The story tells of a small town that is very much bothered by a very strange and weird man living in a visually haunted house. One day the mayor decides to go with a couple of people from his town to the weird man who's living up the hill, and tell him to leave. When they reach the mayor starts convincing him to leave his town, but the people with the mayor started liking Michael Jackson, and he started singing to them and scaring the mayor. Until in the end the mayor gets too scared and runs away, and the people come to know that Michael isn't too bad after all.",
         "A Maestro is stalked by the Mayor of a small town. When he is forced to leave based on his potential, he puts on a show that the entire mob has to see."
      ],
      "budget": 0
   },
   "movielensId": 152175,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-04",
      "dvdReleaseDate": null,
      "directors": ["Stan Winston"],
      "runtime": 39,
      "movieId": 152175,
      "title": "Ghosts",
      "mpaa": "PG",
      "actors": [
         "Michael Jackson",
         "Pat Dade",
         "Amy Smallman",
         "Edwina Moore",
         "Yasiin Bey",
         "Seth Smith",
         "Kendall Cunningham",
         "Loren Randolph",
         "Heather Ehlers"
      ],
      "imdbMovieId": "0119194",
      "originalTitle": "Ghosts",
      "genres": [
         "Music",
         "Horror"
      ],
      "youtubeTrailerIds": ["YS1olsjtkFc"],
      "plotSummary": "The film tells the story of a scary Maestro with supernatural powers, who is being forced out of a small town by its mayor. The movie includes a series of dance routines performed by Michael Jackson and his \"family\" of ghouls. Every song from the film was taken from Michael Jackson's HIStory and Blood on the Dance Floor albums.",
      "tmdbMovieId": 37793,
      "avgRating": 3.21429,
      "releaseYear": "1997",
      "numRatings": 7,
      "posterPath": "/e52BUE3YGwbFuVYG4CKWNYt4JmD.jpg"
   }
}