{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "racial segregation",
            "id": 6984
         },
         {
            "name": "priest",
            "id": 10093
         }
      ],
      "imdb_id": "tt0178821",
      "video": false,
      "title": "Passing Glory",
      "recommendations": [],
      "backdrop_path": "/3rEkuUhPKnUX91ocpoQuQgsLjXf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Father Joseph Verrett",
               "gender": 2,
               "credit_id": "54d792eb9251416b9f005fe7",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Father Robert Grant",
               "gender": 2,
               "credit_id": "54d793089251416b9f005fe9",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Mommit Porter",
               "gender": 1,
               "credit_id": "54d79337c3a3683b8f006626",
               "name": "Ruby Dee",
               "profile_path": "/hadVr5kdeqlorRmjaMhHAutTbAm.jpg",
               "id": 15532,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Howard Porter",
               "gender": 2,
               "credit_id": "54d793539251416ba8005cb5",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54d79284c3a3683b99005d10",
               "name": "Steve James",
               "profile_path": "/xDbq83XNYa52oG8YxTPTAooxmUc.jpg",
               "id": 122449,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56be102a92514140a6001f65",
               "name": "Harold Sylvester",
               "profile_path": "/ycHQQeuvrQ8vo9PwsmgLrffqITw.jpg",
               "id": 27540,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.950432,
      "production_countries": [],
      "id": 288186,
      "vote_count": 2,
      "budget": 0,
      "overview": "A true story of a priest (Andre Braugher) in New Orleans who formed a group of black players and challenged an all-white prep school basketball team in the 1960's. Eventually events like these signaled the pivotal turn in the games' history leading to the integration in today's sport. Directed by Steve James (Hoop Dreams), these basketball players didn't just make shots, they made history.",
      "similar": [
         9552,
         45054,
         2300,
         154400,
         314365,
         48171,
         9945,
         9946,
         9476,
         10637,
         13223,
         8836,
         73,
         68730,
         561,
         670,
         407448,
         381284,
         30159,
         27579
      ],
      "original_title": "Passing Glory",
      "runtime": 100,
      "poster_path": "/p5SHtB8UnF5TOFsOqImAoi0YfVy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-02-21",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve James"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Harold Sylvester"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0178821/",
      "coverLink": null,
      "actors": [
         "Andre Braugher",
         "Rip Torn",
         "Sean Squire"
      ],
      "reviews": [
         "Passing Glory is based on a historical event, and it's certainly a gripping tale. (The story, in case IMDB hasn't got the plot up yet, is based on a real-life basketball game played between two Catholic high schools -- one white, one black -- in the segregated South of the 1960s.) However, the real reason to catch this made-for-TV film is the amazing casting. Any movie that brings you Rip Torn, Andre Braugher, and Ruby Dee on the very same screen is worth your time. Watch this one!",
         "I must admit that I watched picked this one up on the drawing power of Andre Braugher, based on his powerful work on the now-defunct tv series \"Homicide: Life on the Street\". So I guess I shouldn't be disappointed that his character in this movie strongly resembles Homicide's Frank Pembleton. (In this movie he's a Jesuit priest; in Homicide his strong moral centre arises from his Jesuit background) Despite this, or perhaps because of this, Braugher is almost always compelling when he's onscreen, exercising his range from indignant anger to his icy cold stare. There were also some strong supporting performances, especially Bill Nunn as the concerned father of the best player on the high school team. The whole thing is apparently drawn from real life, and the background of the struggle to overcome America's apartheid system is certainly compelling. All that said, however, this movie does have some problems. Many of these probably arise from the format- in a 90 minute made for cable movie, there isn't time to be as expansive as one would like. But still, too many of the characters are really one dimensional, and follow a pattern of set up/resolution. Rather than showing any real-life personality, they get the movie-imposed \"character arc\". (And pity the poor white folks in this movie; I know there's frustratingly little time to offer us more characters, but we get really no chance to get into the heads of the players on the other side of the ball and their families.) And worst of all, this movie ends with the deeply cliched BIG GAME. Seeing as this comes from the director of the very good documentary \"Hoop Dreams\", I would have hoped for more investigation of the characters involved, and the circumstances of their lives, rather than more kinetic in-game action. (And, despite the executive producer presence of Magic Johnson, the basketball sequences are fairly uninspired.) All things considered, the movie was well put together and moved along briskly. If I wasn't thrilled, at least I wasn't bored. If you like Andre Braugher, you'll probably want to see this movie, but in general, you'd probably be better off watching a few old episodes of \"Homicide\", and chasing that with \"Hoop Dreams\". Final note: If I were making a movie about a high-school basketball team, I'd get my people to watch \"Hoosiers\", and then filter everything from that film out of my project. Sports are such a huge part of so many people's lives, there's got to be more stories than these movies keep on telling. In this flick, I found all the trouble that went into setting up the BIG GAME much more interesting that the game itself; why can't that be the focus? Rating: 5 out of 10 (average). (And this factors in a bonus point for Andre Braugher)"
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Magic Johnson Entertainment",
         "Quincy Jones-David Salzman Entertainment",
         "Rosemont Productions International"
      ],
      "summaries": [
         "An angry black priest in 1960's New Orleans goes against the wishes of his parish leader as he pushes a basketball game between his unbeaten all-black team and an undefeated all-white prep school team.",
         "This is based on the true story of the first integrated basketball game in the history of New Orleans. The plot follows the events leading up to the game between all-black St. Augustine High School and all-white Jesuit High. It focuses on the struggles that Father Joseph Verette had in trying to pull the game off and trying to earn respect for his team.",
         "A talented all-black high school basketball team challenges the top all-white team in civil-rights-era New Orleans."
      ],
      "budget": 0
   },
   "movielensId": 152491,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-02-21",
      "dvdReleaseDate": null,
      "directors": ["Steve James"],
      "runtime": 100,
      "movieId": 152491,
      "title": "Passing Glory",
      "mpaa": "PG",
      "actors": [
         "Andre Braugher",
         "Rip Torn",
         "Ruby Dee",
         "Bill Nunn"
      ],
      "imdbMovieId": "0178821",
      "originalTitle": "Passing Glory",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["H5mx7bKvnLk"],
      "plotSummary": "A true story of a priest (Andre Braugher) in New Orleans who formed a group of black players and challenged an all-white prep school basketball team in the 1960's. Eventually events like these signaled the pivotal turn in the games' history leading to the integration in today's sport. Directed by Steve James (Hoop Dreams), these basketball players didn't just make shots, they made history.",
      "tmdbMovieId": 288186,
      "avgRating": 3.75,
      "releaseYear": "1999",
      "numRatings": 2,
      "posterPath": "/p5SHtB8UnF5TOFsOqImAoi0YfVy.jpg"
   }
}