{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "historical figure",
            "id": 6165
         }
      ],
      "imdb_id": "tt0115631",
      "video": false,
      "title": "Soul of the Game",
      "recommendations": [],
      "backdrop_path": "/a91sLXmP3C6Tks6RCIPuiUAABLq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Satchel Paige",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cb5",
               "name": "Delroy Lindo",
               "profile_path": "/uhjdTemc2kYbQj47bVqRb7OdVjH.jpg",
               "id": 18792,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Josh Gibson",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cb9",
               "name": "Mykelti Williamson",
               "profile_path": "/8TTxzpuvvpw2tB8xZBCDslYupNU.jpg",
               "id": 34,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jackie Robinson",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cbd",
               "name": "Blair Underwood",
               "profile_path": "/xDqEtEwJNb3fDYnopeFlmMYVQ66.jpg",
               "id": 56871,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Branch Rickey",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cc1",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lahoma",
               "gender": 1,
               "credit_id": "52fe48e6c3a368484e110cc5",
               "name": "Salli Richardson-Whitfield",
               "profile_path": "/huQHvzHVULR965KGFcHSw9IYXbN.jpg",
               "id": 53918,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Wilkie",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cc9",
               "name": "R. Lee Ermey",
               "profile_path": "/r8GBqFBjypLUP9VVqDqfZ7wYbSs.jpg",
               "id": 8655,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Cum Posey",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110ccd",
               "name": "Obba Babatundé",
               "profile_path": "/vUYCsIIoasA6rnxGuN7ZjaRIBrn.jpg",
               "id": 52057,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Grace",
               "gender": 1,
               "credit_id": "52fe48e6c3a368484e110cd1",
               "name": "Gina Ravera",
               "profile_path": "/cJDWfNdmnBFSFFi1YKXCM4YVyY6.jpg",
               "id": 77279,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Frank Duncan",
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cd5",
               "name": "Brent Jennings",
               "profile_path": "/wkKnquYyWGT5ciIfgJAdy7tAxXX.jpg",
               "id": 84685,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110cb1",
               "name": "Kevin Rodney Sullivan",
               "profile_path": "/hRlaIKMsnAqQ0tAppg8fszF1TMg.jpg",
               "id": 70777,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e6c3a368484e110cdb",
               "name": "Gary Hoffman",
               "profile_path": null,
               "id": 1044114,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110ce1",
               "name": "David Himmelstein",
               "profile_path": null,
               "id": 71342,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e6c3a368484e110ce7",
               "name": "Lee Holdridge",
               "profile_path": null,
               "id": 47452,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.39906,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 74942,
      "vote_count": 4,
      "budget": 0,
      "overview": "Satchel Paige and Josh Gibson are the greatest players in the Colored leagues, and everyone expects that one of them will make the leap to the Major Leagues, now that there is talk of integration. But, unexpectedly, it's the rookie with the army record, Jackie Robinson, that gets tapped to be the first.",
      "similar": [
         323677,
         13416,
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         4942,
         10474,
         9563,
         2323,
         86130,
         11202,
         1578,
         5925,
         12163,
         1367,
         1374,
         612
      ],
      "original_title": "Soul of the Game",
      "runtime": 94,
      "poster_path": "/8vpuN0jQXT3wtaSb5N13bMsDA6X.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Home Box Office",
            "id": 6752,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gary Hoffman Productions",
            "id": 12827,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mike Medavoy Productions",
            "id": 12828,
            "origin_country": ""
         }
      ],
      "release_date": "1996-04-20",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Rodney Sullivan"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Gary Hoffman",
         "David Himmelstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115631/",
      "coverLink": null,
      "actors": [
         "Delroy Lindo",
         "Mykelti Williamson",
         "Edward Herrmann"
      ],
      "reviews": [
         "This is a great movie. With accurate depictions of Satchel Paige, John Gibson, and Jackie Robinson, this is one of the unsung great baseball movies of the mid 90's Great performance by Delroy Lindo as Satchel Paige and a good story line.. If you are a baseball fan you will love this movie, if you aren't you should watch it to become informed about some trials faced by african-american ballplayers",
         "Kevin Rodney Sullivan uses this masterpiece of a cable movie to build his resume for his entre into feature film directing (\"How Stella Got Her Groove Back\"). HBO Pictures' faith in the young actor/director, who to date has very few credits as either, is justified. The year is 1945. Everyone knows that soon, the Major Leagues will be integrated. Most think the player who breaks the \"color line\" will be an established Negro Leagues star, such as legendary hurler Leroy \"Satchel\" Paige of the Kansas City Monarchs or Homestead Grays' catcher Josh Gibson, who was called \"the black Babe Ruth.\" But Dodgers General Manager Branch Rickey confounds the experts and chooses the confrontational but cerebral Jackie Robinson first. Delroy Lindo, an unheralded but talented character actor (\"Broken Arrow,\" \"Get Shorty,\" \"Malcolm X,\" \"Crooklyn\") shows true leading man potential as Satchel Paige in this engaging story about the struggle for Negro League stars to make it to the \"big leagues\" in the mid 1940s. Mykelti Williamson (\"Forrest Gump,\" \"The New WKRP in Cincinnati,\" \"Midnight Caller\") is excellent as Josh Gibson. Blair Underwood (\"L.A. Law\"), a fine actor, seems physically miscast as Jackie Robinson, but turns in a credible performance as the future Brooklyn Dodger second baseman and Hall of Famer. Edward Herrmann (\"Richie Rich\" and Dodge automobile pitchman) is properly pontifical as Rickey, and an excellent facial match, although he is much taller and more nattily attired than \"The Mahatma\" was in real life. Venerable character actor R. Lee Ermey (\"Full Metal Jacket\") steals a couple of scenes in his role as J. L. \"Wilkie\" Wilkinson, the visionary Kansas City Monarchs owner who, among other innovations, invented night baseball. The story is mostly entertainment, a docudrama. It is a sumptuously photographed period piece with clothes, cars, ballparks, and hotel lobbies perfectly festooned in the style of the day. As a character study, it is flawed. Paige, while portrayed as the consummate showman he was, is also shown as a devoted husband whose wife Lahoma (Salli Richardson) travels everywhere with him. The real life Paige was a notorious womanizer. And although there are many scenes with Gibson and Robinson together, including a near-fight that probably never happened, in reality, there is no evidence to suggest that Gibson and Robinson ever met each other. The screenplay also glosses over Gibson's well-documented alcoholism and heroin addiction, suggesting that the brain tumor which eventually killed him at the tender age of 36 was the sole cause of the bizarre behavior that kept him from being the first African-American selected to play in the majors. The movie also has fictional scenes at the beginning and end where a newspaper reporter talks to Willie Mays during the 1954 World Series before the young Giants outfielder goes out and makes \"the catch\" of Vic Wertz's blast in Cleveland's Municipal Stadium. It is also convenient how many times the juvenile Mays seems to pop up in opportune moments as a spectator or autograph seeker during the film. One such scene was used to make the point that his father, Cat Mays, had been a standout in the Negro Leagues long before baseball integration was a remote possibility, and also to get Robinson--and the audience--to question how old Paige really was at that point. On the other hand, the film does a creditable job of showing how tough times were for Negro League ballplayers and how eager most were to be accepted into so-called \"organized baseball,\" despite the Jim Crow laws and attitudes of the day. There is a shocking and touching scene where a clueless young fruit vendor repays the kindness of Mr. and Mrs. Paige by calling them the ugliest racial epithet used against African-Americans. As entertainment, \"Soul of the Game\" deserves an \"A.\" As a historical document, it is about a \"C.\" That's \"C\" as in \"see it.\"",
         "Very good Baseball movie that wasnt advertised much at all. If Any. I just happened to come across it on HBO and was caught. Everyone knows Jackie Robinson broke the color barrier in baseball, but not many know the events that led up to it. This movie actually brought a tear to my eye for Josh Gibson and Sachel Paige, I really felt sorry for those two. Also it was a very nice touch how Willie Mays was wrote into the movie as a whole, if you see it you will understand. Again this is a very good baseball history movie. If you are a fan of the National Pastime, then watch this film.",
         "Everybody knows that director Spike Lee wants to make a film about Jackie Robinson, and he's probably the best man to do it. While we are waiting, here we have an honest TV movie about the early days of Robinson un pro baseball. The film shows us the two greatest athletes of the Black Men Baseball league, Josh Gibson and Satchel Paige. I think it's a bit sad to portray these men with foolish minds, always tryin' to have some fun, because I'm sure that discipline was necessary to them to be so excellent on the field. Anyway, I think this movie is entertaining, well done and it can be a good filler while we're waiting for Mr. Spike Lee epic.",
         "The soul of the game is a movie that follows around 3 prominent negro league baseball players with Satchel Paige, Josh Gibson and Jackie Robinson. Branch Rickey is looking to integrate the Dodgers but is looking for just the right guy to do it, he chooses Robinson who at the time didn't have as much notoriety as the other two. But he didn't have as much baggage as Gibson and a lot younger then Paige and Rickey felt that Robinson had the background to handle all of the heckling far better then either of the other two. Excellent performances by everyone involved and the movie tells a good story about how the game of baseball and conversely all sports and if you think about it the whole world was changed in the process. If you it wasn't for the success of the movie you wouldn't have had Jim Brown in the NFL or Bill Russell in the NBA."
      ],
      "genres": [
         "Drama",
         "History",
         "Sport"
      ],
      "productionCompanies": [
         "Gary Hoffman Productions",
         "Home Box Office (HBO)",
         "Mike Medavoy Productions"
      ],
      "summaries": [
         "Satchel Paige and Josh Gibson are the greatest players in the Colored leagues, and everyone expects that one of them will make the leap to the Major Leagues, now that there is talk of integration. But, unexpectedly, it's the rookie with the army record, Jackie Robinson, that gets tapped to be the first.",
         "The true story of the friendship between three of the greatest Negro League Players of all time (Jackie Robinson, Satchel Paige, and Josh Gibson) and how things change when Robinson is chosen to break the color barrier in the Major Leagues.",
         "The friendship between Baseball Negro League pitcher Satchel Paige and catcher Josh Gibson is tested as both men strive to become the first black baseball players in professional baseball in 1945. Brooklyn Dodger's owner Branch Rickey chooses Jackie Robinson instead.",
         "In 1946 when Black baseball players were still not yet allowed to play in the major league, Brooklyn Dodger owner Branch Rickey decides it's time to allow them in. He establishes a team in the Negro League, and every great player in that league knows that Rickey plans to bring to the majors. And the two men who believe that they're on top of the list are Sachel Paige and Josh Gibson. But Rickey wants not only good players but good men and he feels that they're not. And one of Rickey's scouts sees a good prospect in rookie, Jackie Robinson.",
         "Black baseball greats, Satchel Paige and Josh Gibson, vie to be the first afro-American major leaguer, only to see the outspoken rookie, Jackie Robinson, be chosen."
      ],
      "budget": 0
   },
   "movielensId": 152487,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-20",
      "dvdReleaseDate": null,
      "directors": ["Kevin Rodney Sullivan"],
      "runtime": 94,
      "movieId": 152487,
      "title": "Soul of the Game",
      "mpaa": "PG-13",
      "actors": [
         "Delroy Lindo",
         "Mykelti Williamson",
         "Blair Underwood",
         "Edward Herrmann",
         "Salli Richardson-Whitfield",
         "R. Lee Ermey",
         "Obba Babatundé",
         "Gina Ravera",
         "Brent Jennings"
      ],
      "imdbMovieId": "0115631",
      "originalTitle": "Soul of the Game",
      "genres": [
         "History",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Satchel Paige and Josh Gibson are the greatest players in the Colored leagues, and everyone expects that one of them will make the leap to the Major Leagues, now that there is talk of integration. But, unexpectedly, it's the rookie with the army record, Jackie Robinson, that gets tapped to be the first.",
      "tmdbMovieId": 74942,
      "avgRating": 3.25,
      "releaseYear": "1996",
      "numRatings": 2,
      "posterPath": "/8vpuN0jQXT3wtaSb5N13bMsDA6X.jpg"
   }
}