{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1241018",
      "video": false,
      "title": "Silent Venom",
      "recommendations": [
         76197,
         350751,
         89139,
         143901,
         37571,
         218671,
         76654,
         28473,
         81859,
         386123,
         66121,
         55078,
         29597,
         56172,
         289214,
         29854,
         95140,
         32100,
         36567,
         38610
      ],
      "backdrop_path": "/18K5UwZOGlh3JaaFUhs1G7DzVqo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lt. Cmdr. James O'Neill",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b631",
               "name": "Luke Perry",
               "profile_path": "/78TAr0wLoRHyubnYxjyHNCt70V2.jpg",
               "id": 8395,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Andrea Swanson",
               "gender": 1,
               "credit_id": "52fe4601c3a368484e07b635",
               "name": "Krista Allen",
               "profile_path": "/aPNoOzxPicfSzPv2Qv7Ccex8WJL.jpg",
               "id": 21858,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Admiral Bradley Wallace",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b639",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jake Goldin",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b63d",
               "name": "Louis Mandylor",
               "profile_path": "/4DCfloJ8CDsvchaKE0KdYW07obz.jpg",
               "id": 54649,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Eddie Boudreau",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b641",
               "name": "Anthony Tyler Quinn",
               "profile_path": "/v4IgsxmtWVjb1v7A5xxAOxzXv4R.jpg",
               "id": 105167,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Major Drake",
               "gender": 0,
               "credit_id": "57ed3ac49251411a15006aa7",
               "name": "Robert Catrini",
               "profile_path": "/cBtEHBZ2ykjqCCIjQeoDQ7MVgsU.jpg",
               "id": 149590,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4601c3a368484e07b62d",
            "name": "Fred Olen Ray",
            "profile_path": "/vHcV6RYDAT1kh3RGRah8tiNrDyK.jpg",
            "id": 31155,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.476089,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29889,
      "vote_count": 9,
      "budget": 0,
      "overview": "The only thing more terrifying than Snakes on a Plane is \"Snakes on a Submarine,\" and that's exactly what we get in this claustrophobic, sub-aquatic thriller starring Luke Perry. Lieutenant Commander O'Neill (Perry) was piloting a retired submarine to its final port when Admiral Wallace (Tom Berenger) diverted the crew for one last mission: rescue an imperiled army research team before they meet a watery death. In order to reach the researchers and their top secret cargo while avoiding detection by a hostile enemy fleet, Lieutenant Commander O'Neill orders his crew to \"run silent\" in the depths. That silence is soon broken, however, when the cargo proves to be two genetically altered leviathans. Now, far beneath the ocean floor, a new kind of predator emerges to prove just how vulnerable man truly is when there's nowhere left to run.",
      "similar": [],
      "original_title": "Silent Venom",
      "runtime": 90,
      "poster_path": "/rSFNAc0NAw9HmfqQS1KQzeY9l2O.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinamour Entertainment",
         "id": 27180,
         "origin_country": ""
      }],
      "release_date": "2009-06-02",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "The greatest danger to the mission is already on board.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Olen Ray"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Scott Salter",
         "Mark Sanderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1241018/",
      "coverLink": null,
      "actors": [
         "Luke Perry",
         "Krista Allen",
         "Tom Berenger"
      ],
      "reviews": [
         "This movie has been re-titled \"Sea Snakes.\" Maybe it had a name change to dodge a bad reputation. Anyways, it's a movie about snakes on a submarine. \" Aha,\" you say. \"The crew will simply isolate compartments, wear breathing equipment, and turn the compartment oxygen off.\" Well, we all know that would make for a 15 minute movie ... So pretend that it's not a real submarine, a real submarine crew, or real snakes. Oh yeah, the scientists aren't real either. I guess this is my beef with this flick, no suspension of disbelief. Most of the stuff looks fake, and it's hard to care or get engaged. There's a lot of technical errors and they are annoying. One teeny example: in one scene the ship's corpsman (the medic) puts some anti-venom next to a bunch of glass containers, all sitting on top of a cabinet. That's OK if the cabinet is affixed to a building in a non-seismic zone. All those glass jars would have fallen off the cabinet and shattered once the sub went to sea. If you want to see bigger technical errors or learn lessons in careless movie making, watch the flick. Just don't expect to be entertained.",
         "*************** Warning may contain spoilers ******* What is not to like about this film? Cheesy effects, rather wooden acting, a silly plot line, and SNAKES! On a SUB! Why they couldn't get Luke Perry to echo Samuel L Jackson's famous line about snakes on a plane, I'll never know. I guess it just would not fit the military image - even though Perry was playing a Navy Captain! A mildly entertaining fun romp with nary a pit viper to be seen (but plenty of albino boas, corn snakes, rat snakes, and some fake overgrown diamondbacks), some very hokey special effects of Big Momma and the usual stupid plot holes. My wife and I enjoyed it, as we are fans of this sort of ridiculous trash. It was better than some we have seen, worse than others. If you have some time to kill, it might be worth your time. At least it had sub titles, and the submarine action was pretty good.",
         "Wow. This one is bad even by SyFy's incredibly low standards. I'm pretty sure the number of snakes i counted and the number of snakes the characters say are on the sub are radically different, even accommodating the same snake showing up in multiple scenes. And subs apparently are run by eight-man crews. And...sort of spoiler...if you are going to electrocute a snake by sticking a live cable in its mouth, don't hold onto the snake's neck while you are doing it or letting it lay on top of you while you do it, and don't then drop the live cable on a metal floor that you are still lying on. I think that could be a bit worse than dying by snake bite. As a point of comparison, this is actually worse than Ice Spiders, and I wasn't sure anything could be worse than that.",
         "Intentional camp, and fun enough for a good laugh. Snakes have gotten tired of planes, trains, and automobiles, so now they set sail under the sea. It's up periscope, finance a film budget of $49, and bon voyage. \"Captain, we have snakes on board.\" Oh really? Perhaps that means the rubber toys that vaguely resemble snakes. Also, some hilariously cheap CGI serpents that move more like video game cartoon characters than a snake. Shots of them slithering around aimlessly on the floor with no actors anywhere around pop up once in a while; this may be inserted stock footage of real ones in a glass case. The actors trying to look scared of these blue screen and/or rubber beasties is priceless. One scene has a guy gingerly lifting a the rubber toys off of an imperiled person, then hurls it wildly lol. It's all a government conspiracy; astonishing. Some evil guy sends a scientist on board to covertly transport genetically engineered snakes for military use (neglecting to inform the crew of the hissing cargo, of course). Maybe it's the DNA mutation that makes them look so fake, and lazily hang out doing nothing like they've been drugged. Anyway, things progress exactly as expected, in the ludicrous fashion that's expected. Turn off the brain before watching.",
         "\"Snakes on a Sub\" (or \"Recoil\" or \"Silent Venom\") was on my list of films to see, simply because I had to know why some (once mighty) actors would want to appear in a Fred Olen Ray (or whatever name he's going by this week) movie... The answer is (obviously) money. The film wastes no time in letting the audience in on what to expect. Really (and I mean really, painfully) bad CGI snakes, that the average 12 year old kid could do a better job with on his home PC. It makes you wonder if they even tried? Yes, they look like cartoons of the worse kind. That being said, the story is not all that bad... Once the premise switches over to the what (and why) a submarine is involved, it actually pulls you in, and you begin to forget about the stupid snake storyline. There is an underlying war-themed adventure about an out of commission sub (and crew) that accidentally wanders into enemy waters. Very well acted by both Berenger and Perry, this part of the film really worked for me, and I became engrossed in the story. The dialog appears to follow proper Navel protocol, and you begin to feel for the characters. Unfortunately, we are soon reminded that this is \"Snakes on a Sub\" and the B-Movie resurfaces. I think it could have made a decent war drama on it's own, however not many people would likely rent (buy) it for that. \"Horror Sells!!!\" Thus, we are left with good acting and really, painfully, horribly, cheesy FX and an hour and a half of our lives gone forever... Enter at own risk.",
         "this is one of the worst movies about killer snakes i have ever seen.the cgi is so bad it looks like a cartoon.you will laugh when it shows the giant cartoon looking snakes.the only reason i sat and watched all of this movie is because krista allen was in it.even with the brunette goddess in this it was tough to sit through.also Luke perry was in this so that is another reason to hate it along with horrible special effects.so if you are a krista allen fan i suggest on giving this a look but if you are not a fan you might as well forget about watching this because you will regret that you did.when will movie makers learn that cgi is to fake looking unless you have a big budget.",
         "This movie was sooooooo crappy. The only thing that was interesting in it was that they combined a \"submarine war movie (there aren't that many of those) with a \"creature feature movie\" ..... but it was hardly a successful endeavour. Yes it's true, the CGI rendering of the giant snakes was a total joke! Oh and I must comment on Krista Allen (the only woman in the film): Her acting is TERRIBLE! Seriously, its as if she was on Botox the whole movie because the expression on her face hardly changed and therefore she seemed like she had no reaction to the current situation! Don't get me wrong, she is gorgeous, but she would be much better suited to be a model or a porn actress where she won't need any acting skills. Bottom line, go watch one of the \"Anaconda\" movies if you want a creature feature with big bad CGI snakes ........ they are a lot more entertaining than this piece of bunk.",
         "\"Sea Snakes\" is a pretty decent killer-snake film with a few minor flaws. **SPOILERS** Arriving at a naval base, Commander James O'Neill, (Luke Perry) is informed a scandalous incident in his past will be dropped if he brings along a decommissioned submarine to Taiwan. Accompanied by crew Houston Davies, (John L. Curtis) Eddie Boudreau, (Anthony Tyler Quinn) Lozano, (Travis Dixon) Cab, (Oliver Rayon) Rhodes, (Haran Jackson) Kovacek, (Sam Scarber) and Kelso, (David Andriole) they set sail but are soon ordered to escort Andrea Chapman, (Krista Allen) and Jake Goldin, (Louis Mandylor) off an island to save them from an enemy attack. Getting them off in time, the crew suddenly starts dying off due to an unknown virus and they reveal they've been studying venomous snakes and brought them on-board only to have them get loose within the ship. As their presence draws enemy attention, they must find a way of dealing with the deadly snakes without giving up their position to be attacked. The Good News: This one had a lot of good parts that really helped it nicely. There's some nice snake-action in here, including the opening wrangling in the jungle, where it bites the local from inside the cage and slithers away before the jungle confrontation, set off quite nicely with the suspenseful rattling in distance continually getting closer before it appears from the watering hole in a nice shock. Their escape scene is handled quite nicely as well, with the dropped equipment and subsequent damaging, followed with a quick bite-attack and then shown slithering away, starts this with some nice suspenseful bits. That's carried out even further with shots of the snakes in the sub, mainly with continuous shots of them crawling on the floor or over submarine equipment, under doorways or the feet of unsuspecting crew-members. By choosing these types of scenes continuously, it makes it quite chilling as to when their attack will be launched. The number of quick attacks, from the strike while the crew-member is fixing the intercom to the engine room, is all good stuff, mixing the suspense with the action nicely. The follow-up attack in the kitchen is really good, with them surrounding food and slithering around before attacking. How they're dealt with works nicely, and the aftermath sets up future events as well. The search for the snakes throughout the ship contributes more suspense, due to the claustrophobic setting of the sub as well as finding the snake-skin, which leads to a nice attack. Since the tactic used, drawing them to a heated place, is both original and quite entertaining, this segment is really good. The action returns to the film in several big scenes, including an attack in the torpedo room, where the surrounded-victim begins clanging on the pipes with a wrench, drawing attention before encountering the giant snake and the ensuing attack, which is really good. The scenes of them retrieving the stolen anti-venom is just golden, where they fight off the giant snake only to find an army of snakes on the floor between them, and the attempt to acquire it results in being swarmed. As they're blocked by snakes in the escape hallway, the rescue later on finds them willingly becoming a Buddha statue of snakes, and the removal and eventual gunfire escape is great. The battle with the snakes in the com room is full-on chaos, and the later encounter with the giant one is purely-awesome all around. Aside from that, the encounters which make it feel like a true submarine-movie are really good, with believable battle tactics, several different attacks from others, and their continuous presence makes for a realistic scenario, and it mixes some nice action as well. The torpedo launch is especially good, and the different battles employed are a lot of fun. The last good part is the use of real snakes for the swarming scenes, which is quite nice and appreciated, since those snakes have a mass to them during these moments missing elsewhere. These are the film's good parts. The Bad News: There wasn't a whole lot here that didn't work. One of the main issues here is the fact that there's the ever-present cliché of the greedy associate on the project. The individual chosen to portray that character is just painfully obvious from the get-go, the motive is the same thing done every time this is presented, and from the initial stand-point, the amount of cluelessness that must be present to ignore the danger is just astronomical to think that anything like this couldn't happen, which just makes the film that much harder to get into when dealing with so many of the different clichés in the genre. Another big flaw here is the fact that the snakes are a complete after-thought in the finale, handled just once and then forgotten about quickly, dealing with the other areas instead and just making them seem like a joke to have been handled so easily and then dismissed despite being the centerpiece for the majority of the time. It's quite disheartening to see that done, and it really takes a lot of fear out of the creatures. The lack of kills in here is something else to get over, since the original plot line dictates few chances for any blood or gore here, as their method of attack doesn't leave a lot of opportunities for that, and the body count is surprisingly-low for a film of this type. The last flaw is the ever-present CGI for the snakes, which is painful and again quite common, so it is a necessary evil here. These are the film's problems. The Final Verdict: While not completely flawless, this killer-snake film has enough going for it that it manages to become somewhat better-than-expected and wholly enjoyable. Recommended mainly to fans of these kinds of films, Sci-Fi Channel creature-feature enthusiasts or fans of the cast, while others should heed caution. Rated R: Violence and Language",
         "Lt Commander James O'Neill(Luke Perry)is granted by Admiral Bradley Wallace(Tom Berenger)one last mission before allowing him to retire after 20 years of service(we're supposed to accept that someone as young as Perry had been at it for 20 years)and that is to make a pick up of two personnel from an island to transport them to the Okinawa base. Krista Allen is Dr. Andrea Swanson, her field in snakes, along with assistant Jake Goldin(Louis Mandylor), and they are on the island, doing studies on snake venom research. Snakes of abnormal experimentation are brought on board the submarine without O'Neill's knowledge(as you might expect, certain military members are behind the venom research in the hopes of helping soldiers in the field of battle), and against Swanson's orders(there were only supposed to be four brought on board the sub, but Jake sees great potential on the black market for the snakes he was ordered to dispose of). So once aboard the sub, a moronic, curious member of O'Neill's crew opens the canister containing them(anytime you hear a noise and see a canister rattling, instead of telling another crew member, you open the canister and let whatever is inside loose). So commences \"snakes on a sub\" with O'Neill having to handle this situation(along with another dangerous development, Chinese ships, including a war sub, occupying waters forbidden for O'Neill's sub; O'Neill's coordinates from his commanders were a mistake sending him in the wrong direction)the best way he can without the ability to use torpedoes(they are dummies), while running his sub with a skeleton crew. Yep, the deck is stacked against him. Surprisingly, director Fred Olen Ray's SEA SNAKES(as titled by sci-fi channel)goes through the motions, with all the clichés expected, no new surprises. About like Luke Perry who doesn't crack his sullen expression, seemingly bored with his role as a commander in charge of a sub with plenty of insurmountable obstacles standing in his way. The plot just forwards ahead to it's predictable conclusion. Jake is the typical cretin who steals two vials of anti-venom to keep for himself, keeps the secret of his bringing so many snakes on board from Swanson until it is absolutely necessary to tell her, and gets what's coming to him in the usual fashion. It just never seems to take off for some reason; it lacks the fun you normally expect from a FOR creature feature. I think it was the serious approach, everyone in the movie plays the material straight. The ending, where O'Neill grapples with one of two giant snakes brought on board, is a bit hard to swallow. And, after O'Neill specifically requests that the gun usage should be at a minimum, he sure gets gung-ho with his when the time comes. I did like how the filmmakers incorporate live snakes in the movie, but, as expected, the two(CGI) big ones aren't very convincing.",
         "Silent Venom starts on Manku Island in the East China Sea where military research scientist Dr. Andrea Swanson (Krista Allen) & her assistant Jake Goldin (Louis Mandylor) have been breeding local radiation infected Snakes with Pit Vipers to produce angry killer mutant Snakes some of which are huge. The Chinese authorities seem to have caught on to what's going on & the top brass back in the US send a submarine in on a rescue mission before the Chinese get there, Lt. Commander James O'Neill (Luke Perry) gets the job done & with Dr. Swanson, her assistant Jake & a container full of twenty deadly Snakes on-board his submarine sets off home. However a stupid sailor opens the container full of deadly Snakes & lets them loose, the Snakes quickly start attacking the crew who all die because of the deadly venom. With the Chinese military above them, the deep blue sea all around them & trapped inside a submarine full of deadly Snakes the odds of survival are not good... Directed by Fred Olen Ray this apparently had the working title Recoil & has a TV title of Sea Snakes although under whatever title you see it this is a really bad 'Creature Feature' that seems to want to rip-off Snakes on a Plane (2006) as it substitutes a plane for a submarine even if it did come three years too late to cash-in on the Hollywood flick. Silent Venom is our typical awful 'Creature Feature' only set on a submarine, the very start of the film features a giant Snake but the majority of the rest of it just features ordinary sized ones that just slither around & really don't do anything else apart from bite the odd crew member. Most of the clichés are here, the military experiments gone wrong (although I am at a loss to see what purpose these experiments could have had in the first place), a scientist, a leading military officer, the isolated location, the monster/animal/insect threat & there's even a bit of time for some awful dramatics in the style of The Hunt for Red October (1990) as there's a bit of warmongering between US & Chinese submarines although this angle is really pathetic as we never see any Chinese submarine or crew or learn what their plan is as it's all relayed through dull exposition scenes on the US submarine. At just over 80 odd minutes Silent Venom feels longer, it has no pace or excitement & even as a bad 'Creature Feature' this is awful stuff with next to nothing happening & a forgettable climax. The Snakes used here are mostly real & they offer up no threat at all, they seem totally disinterested in doing anything other than just slithering across the floor & it's almost laughable to see the actor's trying to act scared of them when the Snakes appear completely harmless. When CGI computer effects are used they are predictably terrible & unintentionally funny. There's zero gore, the Snakes just bite people & then they die. Krista Allan talks about taking a shower but she never does on screen therefore there is nudity either. Silent Vanom has no scares, no atmosphere & the cramped conditions of a submarine are not utilized at all & the whole thing just feels below par like no-one was interested in making a good film. Wouldn't firing guns in an enclosed space like a submarine be a very dangerous thing to do? No-one here seems bothered about any potential hull breach. The IMDb reckons Silent Venom had a budget of about $2,000,000 which sounds like a lot of money for such a rubbishy film, in fact I don't think there's any way Silent Venom would have cost even half that much. Krista Allen looks quite cute & what on Earth is one time Oscar nominated actor Tom Berenger doing in a film as bad as this? Silent Venom is a really awful 'Creature Feature' of the worst kind, it's a total rip-off of a much better film & it's not even fun, there's no gore or nudity & the plot is dull. One to avoid unless your a die hard 'Creature Feature' fanatic or just plain desperate.",
         "Fred Olin Ray with Luke Perry and Tom Berenger is what amounts to \"Snakes on a Sub\". the plot has a decommissioned sub going to rescue a research team from an island. The crew is unaware that the people they are rescuing are doing research with poisonous snakes, and that the snakes will inevitably get out at the worst possible time. How many films have there been with computer generated snakes over the last couple of years. Too many if you ask me, I'm guessing that the effects supply store had a fire sale and every low budget producer bought a snake program. That said as these sort of dumb films go this film is pretty good. Of course you'll have to over look a couple of logic gaps the size of Montana but assuming you can do that you might enjoy yourself. Actually if you watch this with friends in a witty mood, you'll have an even better time.",
         "\"Silent Venom\" is--no surprises here--essentially snakes-on-a-sub. The U.S. Navy has sold an old submarine to Taiwan and Admiral Bradley Wallace (Tom Berenger of \"Sniper\") assigns Lieutenant Commander James O'Neill (Luke Perry of \"The Fifth Element\") to skipper the sub. It seems that O'Neill disobeyed a direct order and he stands to lose his retirement benefits as well as his rank, but Wallace engineers a deal that will save the Lieutenant Commander both his rank and honor. Naturally, our hero does not care to sail as a skipper on an unarmed sub. Meanwhile, on an island, Dr. Andrea Swanson (Krista Allen of Emmanuelle, Queen of the Galaxy\") and her unethical research assistant Jake Goldin (Louis Mandylor of \"Renegade Force\") have been conducting research on venomous snakes so that they can provide the Pentagon with anti-toxins for troops in chemical warfare situations. The Red Chinese decide to stage maneuvers and the Pentagon needs somebody to pick up Swanson. You guessed it. The old sub is the closest thing to transport so Admiral Wallace orders our hero to let them hitch a ride. The catch is that Dr. Swanson can neither divulge the nature of their research nor that they are bringing snakes aboard a submarine. Furthermore, Swanson has only a few bottles of anti-toxin that has never been tested so she does not know if it works. No sooner have Swanson and Jack settled into the sub than the snakes get loose. A curious sailor is the culprit. \"Silent Venom\" is reminiscent of a 1974 made-for-television David Janssen thriller \"Fer-de-Lance.\" The bigger snakes are clearly computer-generated-imagery while the smaller snakes appear to be real snakes. Veteran exploitation filmmaker Fred Olen Ray of \"Hollywood Chainsaw Hookers,\" knows his craft well enough to milk a modicum of suspense out of the formulaic screenplay by Mark Sanderson. Indeed, Ray has called the shots on over an hundred of these direct-to-video movies. The best scenes show both the real-life actors handling the snakes. Luke Perry has to remove several snakes from the neck of Krista Allen. \"Silent Venom\" qualifies as strictly an exercise in boilerplate suspense. The ending is clever. Tom Berenger doesn't have a big role, but everybody does fine.",
         "First, there was \"Snakes on a Plane\". Next, we were given \"Snakes on a Train\" by poverty-row studio The Asylum. Now, with \"Silent Venom\", we are given (thanks to notorious director Fred Olen Ray) snakes on a submarine! In fairness to Ray, this movie looks a lot better than a lot of his past cheapies. They actually got a decent-looking submarine set, for one thing, and it's acceptably photographed. But those looking for low budget horror thrills will be very disappointed. The movie is pretty dull in its tone, the movie moves very slowly, and there's very little blood. (Also, the CGI snakes look REALLY bad and are not the least bit scary.) The movie has a lot of stuff happen offscreen or is never explains (Just what is that mysterious substance that's found on a pipe at one point?) Perry looks aged, and Berenger fans will be disappointed because he's hardly in the movie. To sum up, it's incomprehensible that a major Hollywood studio would handle this direct-to-DVD release.",
         "As someone said previously, Krista Allen could be the only justified reason that you'll find after watching this film. I understand the idea behind the script, but the delivered scenario was a complete failure, starting from the attitude and the actions of Krista Allen's assistant and carry on with the imminent danger and attack of a foreign enemy. ... Of course, despite having all the modern technologies on their side, it was not possible for the Asian enemy to stop a museum submarine, but hell, you need more than this and some snakes against a schoolboys crew. Acting? Non-existent. Special effects are laughable, if the case, the highlight being the big snakes rolling down submarine's corridors. Krista Allen wasn't convincing as a scientist and neither her qualities haven't been well reflected by a too static role.",
         "Okay, so maybe the plot was silly, but watching it at 2:00 AM on a real fuzzy screen made it believable. I watched this for Luke Perry, I enjoy his acting and here was no different. Krista Allen is a cute and fun and... well, okay I'll come out and say it, I enjoyed this movie. I guess since I only watch a movie every month or so, I don't experience much. Only thing I would have liked to see was when Luke Perry's character was about to board the plane it would have been funny if they told him the in-flight movie was Snakes on a Plane. Regardless, fun movie, don't take it too seriously and you may just find yourself caught up in it.",
         "Yes, this movie in some aspects is better than Crimson Tide. Read below. The basic plot of Sea Snake (SyFy title)has two scientist breeding and studying snakes on a small remote island for the military. A decommissioned sub is on its way home when it is ordered to divert to the island to vacate the scientist and the snakes, because of impending Chinese maneuvers in the area. Now the action starts. The snakes some how become loose, don't they always? and threaten the crew and the sub. Now for Crimson Tide. It is a seemingly good thriller except for one fatal flaw. The constant arguing and bickering and power positioning of G. Hackman and D. Washington in Crimson Tide. I am so tired of bickering in the top staff. Sea Snakes present the military as it is. A chain of command and respectful interaction. For example, when Davies suggest to O'Neill, the Commander of the sub, that they run silent, the Captain says good idea. He did not ARGUE like Hackman would in that phony Crimson Tide. I liked their military cooperation and reasoning which is very real. In fact as a mariner I would serve under O'Neill before I would serve under the nutty Hackman Also, production values were great, good lighting, composition, steady camera, etc. Except for the ubiquitous cheesy CGI effects. When will Sci Fi producers get the message. I don't know. And the CGI was just as cheesy in Jurassic Park. Dr. Swanson, was played by Krista Allen, and although she is hot, she was not in a busty top and played the scientist with aplomb. Does every movie have a scientist that has to \"make money on the sale of this specimen back in the real world\". God, they are all over the place. Are there really scientist like that? He was the helper to Dr. Swanson and seems uncredited in IMDb. You know, \"don't kill the ********, we could use it for further study even tho it is destroying everything in site\" type scientist who is in every sci fi thriller. Did you expect a love interest somewhere on the boat as in most Hollywood epics? Guess what? Didn't happen. As it would not happen in real life. Kudos to a job well done by Fred Olan Ray, for a realistic portrayal of military protocol and a subdued performance from the actors and not the over hyped \"fight club\" acting style of most lead characters in Hollywood movies. He sure made the 2 million dollar budget go far. I thought they would flush the snakes out of a torpedo tube, but such was not the case.",
         "Genetically enhanced deadly snakes get loose on board a submarine on its final run. It's up to tough veteran Lt. Commander James O'Neill (a solid performance by Luke Perry) to figure out a way to stop them before it's too late. Director Fred Olen Ray, working from a compact script by Mark Sanderson, keeps the enjoyably inane and eventful story moving along at a quick pace, stages the snake attacks with flair, treats the silly premise seriously, and generates a good deal of claustrophobic tension. Moreover, it's acted with zest by an enthusiastic cast, with especially praiseworthy contributions from the foxy Krista Allen as perky scientist Dr. Andrea Swanson, Tom Berenger as the hard-nosed Admiral Bradley Wallace, Louis Mandylor as greedy bumbling jerk Jake Goldini, Anthony Tyler Quinn as O'Neill's loyal longtime friend Eddie Boudrea, and John L. Curtis as eager rookie officer Houston Davies. The cruddy CGI snakes possess a certain lovably low-rent charm. Theo Angell's slick cinematography provides a nice glossy look. Stu Goldberg's robust score does the rousing trick. A fun little Grade-B flick.",
         "Snakes on a plane; snakes on a train...snakes on a submarine. Familiar peril; familiar story line. Luke Perry plays Lt. Commander James O'Neill, a disgraced leader, is given a final assignment. Something as easy as bringing back a retired sub to its final station. In route, Admiral Wallace(Tom Berenger)diverts the submarine to rescue an Army research team from a remote island. Coming on board is classified research...snakes. This silent cargo is accidentally released, but is not the only problem for O'Neill's crew...an enemy fleet is in the way of the unarmed sub and safety. Not exactly bad; but not necessarily good either. Perry fans will enjoy. And for submarine movie fans, don't feel bad about being suckered in. Just enough suspense to keep you entertained. Others in the cast: Krista Allen, Louis Mandylor, Robert Catrini and Anthony Tyler Quinn."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinamour Entertainment",
         "ARO Entertainment",
         "Baby Steps Entertainment"
      ],
      "summaries": ["Deep in the jungle of a remote island in the Pacific lives a new breed of mutant snake. Dr. Andrea Swanson and her research assistant Jake have been studying the species in a top secret military experiment to develop the ultimate anti-toxin. But when tensions rise with the Chinese military, Admiral Bradley Wallace quickly evacuates the island. The only way home is an old, decommissioned submarine on its final voyage to its new home in Taiwan. Wallace decides to put Lt. Commander James O'Neill at the helm, a hardened pro facing forced retirement... and he is less than pleased to be \"babysitting\" his two new guests. But they're not alone. Andrea was ordered to bring some of the experimental snakes back to the mainland - and worse, Jake has smuggled some of the deadlier mutated snakes on board, including a giant diamondback. When a Chinese vessel attacks the sub, the vicious creatures are released from their secure containers and begin to stalk the crew members one by one. Trapped two hundred feet below sea level with no way out, the sub's skeleton crew find themselves attacked... in the galley, torpedo room, shower, and control room. The snakes are hungry and vicious... but nothing can prepare the crew for the terror that awaits them when the diamondback escapes its captivity. Growing in size and ferocity with each meal... the mutated beast is seemingly unstoppable. O'Neill and Andrea become unlikely allies in the fight to keep the deadly snakes at bay as Wallace worries about an international incident as they try to save the sub from the enemy vessels tracing their every move..."],
      "budget": 2000000
   },
   "movielensId": 152471,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-06-02",
      "dvdReleaseDate": null,
      "directors": ["Fred Olen Ray"],
      "runtime": 90,
      "movieId": 152471,
      "title": "Silent Venom",
      "mpaa": "",
      "actors": [
         "Luke Perry",
         "Krista Allen",
         "Tom Berenger",
         "Louis Mandylor",
         "Anthony Tyler Quinn",
         "Robert Catrini"
      ],
      "imdbMovieId": "1241018",
      "originalTitle": "Silent Venom",
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["4B6oVszcCnM"],
      "plotSummary": "The only thing more terrifying than Snakes on a Plane is \"Snakes on a Submarine,\" and that's exactly what we get in this claustrophobic, sub-aquatic thriller starring Luke Perry. Lieutenant Commander O'Neill (Perry) was piloting a retired submarine to its final port when Admiral Wallace (Tom Berenger) diverted the crew for one last mission: rescue an imperiled army research team before they meet a watery death. In order to reach the researchers and their top secret cargo while avoiding detection by a hostile enemy fleet, Lieutenant Commander O'Neill orders his crew to \"run silent\" in the depths. That silence is soon broken, however, when the cargo proves to be two genetically altered leviathans. Now, far beneath the ocean floor, a new kind of predator emerges to prove just how vulnerable man truly is when there's nowhere left to run.",
      "tmdbMovieId": 29889,
      "avgRating": 0,
      "releaseYear": "2009",
      "numRatings": 0,
      "posterPath": "/rSFNAc0NAw9HmfqQS1KQzeY9l2O.jpg"
   }
}