{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2571782",
      "video": false,
      "title": "As the Palaces Burn",
      "recommendations": [
         34511,
         34510,
         84198,
         21843,
         32482,
         34163,
         70086,
         29436,
         34506,
         64350,
         30649,
         34508,
         62719,
         38205,
         45615,
         79483,
         68098,
         41141,
         64029
      ],
      "backdrop_path": "/7fr9KGi5XIiBBuO25HobW7s4aTy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 0,
            "credit_id": "5312856bc3a36829d3003444",
            "name": "Randy Blythe",
            "profile_path": "/etaZPFSApkcUsuz5QvNvAZco5iY.jpg",
            "id": 112235,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "531282e4c3a36829c40034dd",
               "name": "Don Argott",
               "profile_path": null,
               "id": 90583,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5312848192514110130033e6",
               "name": "Sheena M. Joyce",
               "profile_path": null,
               "id": 90585,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53128795925141104200359e",
               "name": "Demian Fenton",
               "profile_path": null,
               "id": 90586,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "531287ed92514110350033d8",
               "name": "Jennifer Wessner",
               "profile_path": null,
               "id": 1297858,
               "department": "Editing",
               "job": "Digital Intermediate"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.33747,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 257614,
      "vote_count": 14,
      "budget": 0,
      "overview": "As the Palaces Burn is a feature-length documentary that originally sought to follow Lamb of God and their fans throughout the world, to demonstrate how music ties us together when we can’t find any other common bond. However, during the filming process in 2012, the story abruptly took a dramatic turn when lead singer Randy Blythe was arrested on charges of manslaughter and blamed for the death of one of their young fans in the Czech Republic. What followed was a heart-wrenching courtroom drama that left fans, friends, and curious onlookers around the world on the edge of their seats.",
      "similar": [],
      "original_title": "As the Palaces Burn",
      "runtime": 121,
      "poster_path": "/vxpa3BOKEID3qVtXykYNC4CHU0F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "9.14 Pictures",
            "id": 4274,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Epic Records",
            "id": 7914,
            "origin_country": ""
         }
      ],
      "release_date": "2014-01-27",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "The only way out is through the fire.",
      "adult": false,
      "homepage": "http://www.asthepalacesburn.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Argott"],
      "runtime": 121,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2571782/",
      "coverLink": null,
      "actors": [
         "Chris Adler",
         "Willy Adler",
         "Randy Blythe"
      ],
      "reviews": [
         "After having seen Lamb of God interviewed on The Metal Show I wanted to check out their movie. I was not a fan of their music and barely knew anything about them, but they were incredible guests. The movie chronicles their journey through a difficult situation of losing a fan at one of their shows and then being accused of the crime. The band members come off as just regular guys, but truly inspirational and stand up guys all the way! They are extremely well spoken and total class acts. My wife and I enjoyed them sharing the honesty of this emotional journey! When you go to the movie stay for the segment after the credits roll. It was a shame that this story did not receive more press in the US. I had never heard about this story until the TMS interview.",
         "Sometimes as a documentary maker, you hit the paydirt, I guess. This would be a totally uninspiring \"We do it for the fans\" tour DVD documentary if it were not for the film-makers' luck and the band's misfortune half way through. (I don't mean to be crass about the situation that occurred. I do sympathise. I just mean from a film-makers point of view it made the film something more than it ever would have been). What then follows is a story of fellowship and friendship, watching a man walk the harder path to do what is right and find peace in himself. The sins of the past have been cleared away by sobriety and he now has the ultimate test of his resolution and of his new path. It is heartening to watch how he and others around him stand up and be counted. I'm not gonna become a fan of Lamb Of God but I certainly loved this \"right place, right time\" piece of documentary making that was well crafted and told a human story behind what a lot of people may feel is devilish music.",
         "When I was younger, I viewed metal music as dangerous- something the angry, mischievous kids listened to, and thus I stayed away. Later, I found that I couldn't digest it as music; it was too much for me- I only heard unstructured sounds and silly growling. Here we are, in March of 2014, and I had remained ambivalent- perhaps until now. I was clueless to who 'Lamb of God' was, nor did I recognize any songs, despite the band having had the #2 charting album quite recently. According to this documentary, they're a metal heavyweight, standing shoulder to shoulder with the likes of Megadeth and Metallica- not that I knew any better. \"As The Palaces Burn\" had the unlikely task of enlightening me to a side of music I had dismissed, simply due to a lack of understanding. I'm pleased to report that it succeeded, not just in re-educating me, but also the way it deftly handles a complete swing in tone. Vocalist Randy Blythe's intro lays the framework for what this documentary tries to tell us over the first half, i.e. the purpose of metal music in people's lives, and the extent to which Lamb of God is responsible for that. We're introduced to a couple of 'die-hard' fans from different cultures, and the way they explain their affection for this music is unexpected. Their love appears to come not just from the music itself, but also a need to release aggression, to purge unhealthy feelings, and the desire to belong to something. Listening to a young Columbian cab driver spoke volumes- he thinks about \"getting out a machete and start cutting off heads\", but he puts in the music and he feels better. That mindset may seem on the verge of sociopathic behavior, but in this context it seems reasonable. Music has always been an organic, healthy outlet for people; it has a way of bringing focus and peace to minds constantly barraged by negativity. \"As the Palaces Burn\" lends credence to the thought that there exists a healthy connection between the angst and energy of metal and the fans who crave it to release their own. After all, it stands to reason that if the lyrics come from a place of hurt, desperation, and anger, it will likely resonate with many a person. That's a fascinating angle that I hadn't considered before, and a welcome thought indeed. If I told you that's simply what the documentary was about, you might think it was perfectly fine as is. However, we're led down an entirely different path as the band reaches the Czech Republic for a leg of their tour- a path the film had to explore, and it becomes the crux of the experience. Fans familiar with the band know the story, but allow me to illuminate those in the dark- as they landed, the band was detained. Why? Back in 2010, as was alleged, a fan died as a result of injuries sustained 'leaping' from the stage at a Lamb of God concert in Prague. The prosecution alleged that Randy Blythe was partially responsible for this, and thus charged him with manslaughter- later he was indicted. If your first reaction was 'what?', you're on the right track. We'll need to put aside the fact that a human being did die, a young man and fan of the band to boot- that's clearly sad enough. What's interesting for our purposes is the legal situation itself. The documentary does a commendable job of intertwining the emotional journey of Blythe through this process and the guts of putting a real defense together, all laid out before our eyes. As an American just familiar enough with our legal system to get by, I could easily spot the holes in the prosecution's case. However, I also know of the danger in allowing foreign courts, with all the uncertainty, to decide the fate of an American. The end result might seem perfunctory- but be it by accident or not, the filmmakers were able to craft this unfortunate court case to the tune of a perfectly adept legal thriller. I commend the film for getting through to me as a non-fan of the genre, and furthermore for deftly weaving our new-found intimate knowledge of the band with a messy overseas legal scenario. It's honest, forthright, and unflinching as it reveals to us the band's personal demons along with the celebration of their triumphs and successes. We see the band for who they are- talented musicians with varied backgrounds who managed to put something special together, and nearly lost it. What we may take for granted, as fans, is that bands are families too; non-traditional, perhaps, but families nonetheless. The threat of losing a family member long- term had to weigh on the group, especially if you consider how unfair the entire situation seemed. On top of that, think of something like this happening to, let's admit it, a 'more popular band'. Take N-Sync at the height of their popularity, or Beyonce. I never heard of this particular incident involving Lamb of God, but a major American band had a member detained in a jail– my guess is that we'd break Twitter again if Beyonce was put behind bars. Luckily this documentary exists to tell us what happened. If there is one negative to take away from this, I'd say the lack of immediate reaction from the band, or the failure to capture what was likely more visceral disbelief in Blythe's imprisonment is slightly disappointing. I imagine that out of respect for the young man who lost his life, some stronger commentary existed, but it's not for our eyes. That's hardly a damning statement, for this is still a very well- done documentary- tense and informative, even enlightening for this metal rookie.",
         "This is a really interesting insight into not only the band, Lamb of God, but also how quickly life can change. This starts out as following the band as they prepare for and start their world tour (very typical style of movie, just like Iron Maiden and others have done), however half way through, things take a turn for the worst when lead singer Randy Blythe is arrested for the death of a fan who dies shortly after attending one of their concerts. A great insight into the band. I'm sure I'm not the only one who is conflicted listening and watching Randy talk- he's quiet and softly spoken, looks a bit nerdy but put the microphone in his hand and he has this deep, guttural roar! Also an interesting insight into legal system he was charged under. We're not all the same, so it makes for some interesting challenges. Well worth the watch....."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "9.14 Pictures",
         "Epic Records"
      ],
      "summaries": [
         "Lamb of God, whose fanbase continues to grow on a daily basis, giving them the number two album in the country behind Taylor Swift, set out to make a movie about how their genre of music has gone global. Midway through filming, lead singer Randy Blythe was arrested and charged with manslaughter in the Czech republic. This caused the project, which was originally meant for fans, to drastically switch tracks, turning it into an edge-of-your-seat legal thriller.",
         "Two years ago, the iconic metal band, Lamb of God, set out to make a movie about how their genre of music has gone global. Midway through filming, lead singer Randy Blythe was arrested and charged with manslaughter in the Czech republic. This caused the project, which was originally meant for fans, to drastically switch tracks, turning it into an edge-of-your-seat legal thriller. This first look at As the Palaces Burns offers insight into the band's life during this time, and shows how they dealt with the whole ordeal.",
         "Documentary that follows metal fans in different countries set against Lamb of God's 2012 world tour."
      ],
      "budget": 0
   },
   "movielensId": 152674,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-01-27",
      "dvdReleaseDate": "2014-10-14",
      "directors": ["Don Argott"],
      "runtime": 121,
      "movieId": 152674,
      "title": "As the Palaces Burn",
      "mpaa": "",
      "actors": ["Randy Blythe"],
      "imdbMovieId": "2571782",
      "originalTitle": "As the Palaces Burn",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["nB6k-Ev_H7c"],
      "plotSummary": "As the Palaces Burn is a feature-length documentary that originally sought to follow Lamb of God and their fans throughout the world, to demonstrate how music ties us together when we can’t find any other common bond. However, during the filming process in 2012, the story abruptly took a dramatic turn when lead singer Randy Blythe was arrested on charges of manslaughter and blamed for the death of one of their young fans in the Czech Republic. What followed was a heart-wrenching courtroom drama that left fans, friends, and curious onlookers around the world on the edge of their seats.",
      "tmdbMovieId": 257614,
      "avgRating": 3.75,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/vxpa3BOKEID3qVtXykYNC4CHU0F.jpg"
   }
}