{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0810082",
      "video": false,
      "title": "Scrambled Beer",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vladimir",
               "gender": 2,
               "credit_id": "52fe4b5bc3a36847f81ffef9",
               "name": "Diego Muñoz",
               "profile_path": "/aEgljOKD7xwfhJKnzpWBaamar1z.jpg",
               "id": 296274,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jorge",
               "gender": 2,
               "credit_id": "52fe4b5bc3a36847f81ffefd",
               "name": "Nicolás Saavedra",
               "profile_path": "/bR7CWH8GCiMYHEWUwCo2TtkzaQw.jpg",
               "id": 963911,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rocio",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f81fff01",
               "name": "Javiera Díaz de Valdés",
               "profile_path": "/jkAivd9CzROmT1JqhiSBgQnok1T.jpg",
               "id": 962031,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Fedora",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f81fff05",
               "name": "Manuela Martelli",
               "profile_path": "/fH2Ir9Qh37ivjyGSEht3aX4qFp4.jpg",
               "id": 1040061,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4b5bc3a36847f81ffef5",
            "name": "Cristobal Valderrama",
            "profile_path": null,
            "id": 965009,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.00353,
      "production_countries": [{
         "iso_3166_1": "CL",
         "name": "Chile"
      }],
      "id": 114922,
      "vote_count": 0,
      "budget": 250,
      "overview": "After moving into a new house with his friend, Vladimir starts to notice that he awakes every day in a different week as if he has traveled trough time. Could it be the popular local drink -- beer with eggs?",
      "similar": [],
      "original_title": "Scrambled Beer",
      "runtime": 88,
      "poster_path": "/xX4QL4Ya9SuzySGRlBSarqUmJRf.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "2007-03-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Una Mezcla que atrapa",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Chile",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Cristobal Valderrama"],
      "runtime": 88,
      "synopsis": "After moving into a new house with his friend, Vladimir starts to notice that he awakes every day in a diferent week as if he has travel trough time, could be the popular and local drink the cause of that? or maybe the witch of the neighborhood.....",
      "writers": [
         "Carlos Labbe",
         "Cristobal Valderrama"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0810082/",
      "coverLink": null,
      "actors": [
         "Diego Muñoz",
         "Nicolás Saavedra",
         "Javiera Díaz de Valdés"
      ],
      "reviews": [
         "\"Malta con Huevo\" is one of those movies you can really enjoy when certain aspects are ignored. Like a lot of other chilean movies, it does not take itself seriously because it knows that otherwise something could mess up. But anyway, it definitely went over my expectations with some really original elements. The movie is really funny at times, but in general it has a fast pacing which doesn't make it any boring and let's you ignore some less-polished aspects of the film. Still, I wouldn't recommend it to someone outside Chile, due to the local jargon and the type of humor. I could be wrong, but there are definitely other much-better chilean movies out there. Anyway, if you're looking for an effective, light comedy, this is a good one. The acting is fine, the actors play just fine in a setting which doesn't make much sense and everyone seems to be a little crazy. This isn't bad at all- the mess in everything makes it even more fun. However, don't try to make a serious cinematic appreciation of this film while watching it or you will spoil it.",
         "Vladimir, a really fresh guy, goes eternally evicted from every flat for not paying the rent. His situation seems to improve when he accidentally meets an old schoolmate, Jorge, a geek who invites him to share a house. But, contrarily, Vladimir's situation gets much worse since one day he wakes up and realises that everybody in the neighbourhood literally wants to kill him with no apparent reason, and he has had sex with Jorge's girlfriend but he cannot remember it. However, when he wakes up the morning after, everything looks calm and quiet, and the girl even does not seem to know him. Soon he understands he had been experiencing strange time leaps, forward and backward, chaotically. Apparently, he has been drinking too much \"malta con huevo\", a \"nutritive\" shake brewage made of Guinness and egg, kindly prepared for him by his pal Jorge. However, Jorge's motivations are far to be kind. The movie depicts a strange, dark and hysterical Santiago city, plenty of neurotic people and bad moods. The scenario we see from the beginning, quite rightly chosen, is a typical grey inner-city quarter. But then, you see the image of Vladimir driving a merry yellow \"citroneta\", and it becomes clear this movie is going to be quite sarcastic. A deliberate \"seventy\" style (the car, the drink, the clothing, the neighbourhood) contributes to create this vicious and surrealistic environment. This is not a minor cinematographic achievement by the director, because the 1970s decade was especially scaring for most Chileans due to the military dictatorship (even though, correctly, this movie does not give any reference to political issues\u0085 three hurrahs for that!!!). Obviously, this movie does NOT resolve the many contradictions inherent to the past-present-future leaps. On the contrary, the script leaves too many loose ends. But, honestly, could anyone expect \"scientifically convincing\" explanations about time-travelling from a simple comedy? This is a-bit-more-than-average-intelligent-movie, just for those who like funny comedies, good performances, and want to spend an hour and half enjoying a film. The plot is surprisingly unconventional, and the general result has much more pros than cons. It kept me thinking about it for a couple of weeks. The soundtrack, especially the movie-theme is also hard to forget: a melange between Rock and Chilean vulgar cumbia. Characters are quite stereotypical, but this is how this kind of movie works; just like Alex De La Iglesia's or Santiago Segura's movies. Nevertheless, these actors perform quite convincingly: Saavedra (the nerd), Díaz De Valdés (his really sexy and b..tchy girlfriend), Muñoz (the fresh guy) who performs probably the best role in his entire career, Martelli (the freaked-out teenage dark-witch). The rest of the cast does also good (the psychopathic owner of the liquor store is remarkable). All actors speak just few enough Chilean slang, so the movie can be understood by international audiences without problems. And then you have a novice director (Valderrama) that delivers surprisingly well. Light direction might be probably not the best (unfortunately, this is the typical problem in Chilean movies), but photography and film edition are very professional. Moreover, an extra \"mystical\" surprise emerges at the very end of the movie. In sum, a totally recommendable Chilean comedy."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Cinepata",
         "Forma Producciones"
      ],
      "summaries": ["Scrambled Beer is a delirious black comedy telling the story of Vladimir and George, two best friends who move in together. Vladimir lives a supernatural life of time travel while Jorge follows a twisted obsession. With the girlfriend of one of them in the middle of it, things are bound to get scrambled!"],
      "budget": 250000
   },
   "movielensId": 152609,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2007-03-10",
      "dvdReleaseDate": null,
      "directors": ["Cristobal Valderrama"],
      "runtime": 88,
      "movieId": 152609,
      "title": "Scrambled Beer",
      "mpaa": "R",
      "actors": [
         "Diego Muñoz",
         "Nicolás Saavedra",
         "Javiera Díaz de Valdés",
         "Manuela Martelli"
      ],
      "imdbMovieId": "0810082",
      "originalTitle": "Scrambled Beer",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After moving into a new house with his friend, Vladimir starts to notice that he awakes every day in a different week as if he has traveled trough time. Could it be the popular local drink -- beer with eggs?",
      "tmdbMovieId": 114922,
      "avgRating": 2.75,
      "releaseYear": "2007",
      "numRatings": 2,
      "posterPath": "/xX4QL4Ya9SuzySGRlBSarqUmJRf.jpg"
   }
}