{
   "tmdb": {
      "original_language": "hi",
      "keywords": [],
      "imdb_id": "tt0349878",
      "video": false,
      "title": "Netaji Subhas Chandra Bose: The Forgotten Hero",
      "recommendations": [],
      "backdrop_path": "/zxraEP6jWIyPlc8vK6MMXPMlizD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Subhas Chandra Bose",
               "gender": 2,
               "credit_id": "52fe4970c3a36847f819a4c9",
               "name": "Sachin Khedekar",
               "profile_path": "/ixTRCHhnpdyA4JeSW46RVIzPBqt.jpg",
               "id": 85589,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Ila Bose",
               "gender": 1,
               "credit_id": "592f1d51c3a3685291001a5f",
               "name": "Divya Dutta",
               "profile_path": "/n3yWF0XMtt5uiiZyThGFQVaMzDk.jpg",
               "id": 35778,
               "order": 1
            },
            {
               "cast_id": 24,
               "character": "Abid Hasan",
               "gender": 0,
               "credit_id": "592f274f92514131b4002586",
               "name": "Rajit Kapoor",
               "profile_path": "/mATIzHiXTeW6xB8IoJVLTD5NDMn.jpg",
               "id": 226769,
               "order": 2
            },
            {
               "cast_id": 22,
               "character": "Lt. Col. Shah Nawaz Khan",
               "gender": 2,
               "credit_id": "592f208192514131f5001d59",
               "name": "Sonu Sood",
               "profile_path": "/yzrNCCx8qvylZeT0oMoX3wrCT4q.jpg",
               "id": 95750,
               "order": 3
            },
            {
               "cast_id": 31,
               "character": "Prime Minister Tojo",
               "gender": 0,
               "credit_id": "592f2a19c3a36852e10026da",
               "name": "Kelly Dorji",
               "profile_path": "/dT8RFmwn7Yxz6VhoPdyvo3xI94L.jpg",
               "id": 584888,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gurbaksh Singh Dhillon",
               "gender": 2,
               "credit_id": "592f1d6092514131df001a2e",
               "name": "Arif Zakaria",
               "profile_path": "/wWa01WsvwLxqknpySC1V25k4CVB.jpg",
               "id": 53375,
               "order": 5
            },
            {
               "cast_id": 30,
               "character": "Bhagat Ram Talwar",
               "gender": 2,
               "credit_id": "592f29e892514131f50025ae",
               "name": "Rajpal Yadav",
               "profile_path": "/aXMoR7xVHjicEWDEFitNBqMC6Du.jpg",
               "id": 35756,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Capt. Lakshmi Sehgal",
               "gender": 0,
               "credit_id": "592f20d79251413219001de5",
               "name": "Rajeshwari Sachdev",
               "profile_path": "/6TV8oGgiOrL5PgmjOfaEBTSRTXF.jpg",
               "id": 1238188,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Ranu",
               "gender": 0,
               "credit_id": "592f1d72c3a36852ad001a02",
               "name": "Ila Arun",
               "profile_path": "/yIVZZ9zfexGJ3k0IwqRdIO8MyGq.jpg",
               "id": 225162,
               "order": 8
            },
            {
               "cast_id": 3,
               "character": "Uttamchand Malhotra",
               "gender": 2,
               "credit_id": "52fe4970c3a36847f819a4cd",
               "name": "Kulbhushan Kharbanda",
               "profile_path": "/1ECYLNlTHjgFzfGxbrzVSFZGDbN.jpg",
               "id": 53377,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Alexander Werth",
               "gender": 2,
               "credit_id": "592f1f53c3a3685318001c23",
               "name": "Florian Panzner",
               "profile_path": "/uFThrzolaV3zPRnHyEpmmB1djOx.jpg",
               "id": 40634,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "CID Officer",
               "gender": 2,
               "credit_id": "592f1f9092514131f5001c96",
               "name": "Rohan Nichol",
               "profile_path": "/nzvL3MRpADYWlH4ppyYgmCnM1kZ.jpg",
               "id": 33184,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "592f1f23c3a3685318001bf7",
               "name": "Zakir Hussain",
               "profile_path": "/5TKf0ROvgbHKkzP93cU1oF9XI35.jpg",
               "id": 85656,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Hitler",
               "gender": 2,
               "credit_id": "592f28b3c3a36852e10025c6",
               "name": "Udo Schenk",
               "profile_path": "/3hSjt1GAANVJzQVGrktDR9mx54H.jpg",
               "id": 31643,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "Governor of Bengal",
               "gender": 0,
               "credit_id": "592f1e47c3a3685291001b40",
               "name": "Howard Lee",
               "profile_path": "/lwxInDDV2FQzx1V3IAhuiRIYJWU.jpg",
               "id": 572135,
               "order": 14
            },
            {
               "cast_id": 5,
               "character": "Sisir Bose",
               "gender": 0,
               "credit_id": "592f1d3992514131c4001ad7",
               "name": "Jisshu Sengupta",
               "profile_path": null,
               "id": 545144,
               "order": 15
            },
            {
               "cast_id": 9,
               "character": "Aabid Khan",
               "gender": 2,
               "credit_id": "592f1d8892514131f5001a9e",
               "name": "Pankaj Berry",
               "profile_path": "/aJsJQWSkmvINUjLXHOJYciL4zRk.jpg",
               "id": 1238025,
               "order": 16
            },
            {
               "cast_id": 10,
               "character": "Raja Habib ur Rahman Khan",
               "gender": 0,
               "credit_id": "592f1dcb92514131b9001b5d",
               "name": "Narendra Jha",
               "profile_path": "/yubB6AJ2psFHD4R9VV3AxoQmoCX.jpg",
               "id": 1637846,
               "order": 17
            },
            {
               "cast_id": 11,
               "character": "General Auchinlek",
               "gender": 2,
               "credit_id": "592f1de4c3a36852e1001bc1",
               "name": "Nicolas Chagrin",
               "profile_path": null,
               "id": 47930,
               "order": 18
            },
            {
               "cast_id": 12,
               "character": "CID Chief",
               "gender": 0,
               "credit_id": "592f1e1c9251413219001b60",
               "name": "Chris England",
               "profile_path": null,
               "id": 177902,
               "order": 19
            },
            {
               "cast_id": 19,
               "character": "Gandhiji",
               "gender": 0,
               "credit_id": "592f200692514131b4001e79",
               "name": "Surendra Rajan",
               "profile_path": null,
               "id": 1704878,
               "order": 20
            },
            {
               "cast_id": 20,
               "character": "Prabhavati Bose",
               "gender": 0,
               "credit_id": "592f203892514131f5001d1b",
               "name": "Alaknanda Roy",
               "profile_path": null,
               "id": 1261144,
               "order": 21
            },
            {
               "cast_id": 21,
               "character": "Spy Police 2",
               "gender": 0,
               "credit_id": "592f204ec3a3685318001d0e",
               "name": "Ashiesh Roy",
               "profile_path": null,
               "id": 1254501,
               "order": 22
            },
            {
               "cast_id": 26,
               "character": "Ambassador Oshima",
               "gender": 0,
               "credit_id": "592f28cb92514131be002670",
               "name": "Gen Seto",
               "profile_path": null,
               "id": 1386137,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Jail Warden",
               "gender": 2,
               "credit_id": "592f28edc3a368531800250f",
               "name": "Arindam Sil",
               "profile_path": "/fWm8hdZG8zVMbFqBwPDk0hYCQbB.jpg",
               "id": 1377009,
               "order": 24
            },
            {
               "cast_id": 28,
               "character": "Nambiar",
               "gender": 0,
               "credit_id": "592f296092514131b000272b",
               "name": "Sandeep Srivastava",
               "profile_path": null,
               "id": 85051,
               "order": 25
            },
            {
               "cast_id": 29,
               "character": "Checkpost Policeman",
               "gender": 0,
               "credit_id": "592f2978c3a36852f0002563",
               "name": "Lalit Tiwari",
               "profile_path": null,
               "id": 1427907,
               "order": 26
            },
            {
               "cast_id": 32,
               "character": "Captain Inayat Gyani",
               "gender": 0,
               "credit_id": "592f2a57c3a36852e100270a",
               "name": "Manish Wadhwa",
               "profile_path": null,
               "id": 1730661,
               "order": 27
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4970c3a36847f819a4c5",
            "name": "Shyam Benegal",
            "profile_path": "/eZyc3ECCZvCQpd4NKUkpZlA1Dq0.jpg",
            "id": 114636,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.400353,
      "production_countries": [],
      "id": 58725,
      "vote_count": 3,
      "budget": 0,
      "overview": "Netaji Subhas Chandra Bose: The Forgotten Hero (also known as Bose: The Forgotten Hero) is a 2005 film directed by Shyam Benegal and starring Sachin Khedekar, Kulbhushan Kharbanda, Rajit Kapur, Arif Zakaria, and Divya Dutta. The movie depicts the last five years of the life of the Indian independence leader \"Netaji\" Subhash Chandra Bose. It starts out at the point where Bose resigns from his position as the president of the Indian National Congress (I.N.C.) to the meeting with Italians by crossing Afghanistan's rugged terrains and entering into Europe, to romancing his German secretary and appointment with Adolf Hitler in Berlin, to his inspiring of the Indian P.O.W.s (Prisoners Of War) of the 'Punjab Regiment' (British Army) for fighting against the British forces in India, to the patriotic speeches.",
      "similar": [],
      "original_title": "Netaji Subhas Chandra Bose: The Forgotten Hero",
      "runtime": 222,
      "poster_path": "/wc2Z11hYoyRW9Y3NeVRzxGw2nIY.jpg",
      "spoken_languages": [
         {
            "name": "বাংলা",
            "iso_639_1": "bn"
         },
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         },
         {
            "name": "اردو",
            "iso_639_1": "ur"
         }
      ],
      "production_companies": [],
      "release_date": "2005-05-13",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "The Forgotten Hero",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Shyam Benegal"],
      "runtime": 208,
      "synopsis": null,
      "writers": [
         "Atul Tiwari",
         "Shama Zaidi"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0349878/",
      "coverLink": null,
      "actors": [
         "Vinay Anand",
         "Ila Arun",
         "Pankaj Berry"
      ],
      "reviews": [
         "Bose, a movie, an understatement that lingers starkly loud in the memory space. The brilliance of Benegal matches with the effortless éclat of some of the best names in the Indian movie industry to create this classic of sorts. Looking back at the attempts of Indian directors at recreating the lives and contributions of the few men that remain unforgotten in the Indian freedom struggle, this depiction of one of the most influential yet neglected heroes of those times, Netaji Subhash Chandra Bose, stands apart for its simplicity and eye for detail and proximity with historical facts. A few movies that I can think of in this league would be The Legend of Bhagat Singh by Santoshi, Sardar by Ketan Mehta(a master piece, which I don't know why everyone seems to have forgotten), and of course Gandhi. Looking back, also at all these works makes me feel all these have been the best efforts of the respective directors. So is Bose Benegal's best work? Well I would agree that it is his most elaborate, ambitious work till date, and I am least interested in comparing his other works, because all his movies are so original and distinct in their genres, like Zubeidaa, Sooraj Ka Saatva Ghoda or may be Sardari Begum, for that matter. Bose works, and works magically, at various conscious and sub-conscious levels. It is a decent and honest attempt at depicting a forgotten phase in Indian history without even the slightest pinch of controversy or contempt, amidst the mist of Quit India and Gandhi, a phase no less substantial. It invokes a respect for the great work and ideals the man stood for, and still continues to inspire many generations alive and those yet to come. Another feat of the movie is the slick narrative and editing that holds the entire length of the movie with effortless flow. Khedekar is highly impressive, with his distinctive style of natural acting without any pretense or desperate attempts at imitating Netaji. But at the same time, he succeeds at the same with a surprising sensibility and spontaneity. A special mention for the mellifluous score by Rahman, which magnifies the grandeur and gives an identity to the plot. Take a bow, Benegal, Rahman and Khedekar! This one's for every Indian at heart!",
         "Directors are usually reluctant to translate history on celluloid. They are instead inclined to offer new interpretations of history, shed light on little-known facts about their subjects, and even raise questions that were missed. On the contrary, the title of Shyam Benegal's film- Netaji Subhash Chandra Bose – The Forgotten Hero- itself tells a story! Nobody remembers what he did, except to say that he was a great big hero. Few people remember that he challenged Gandhi, or that he was married. The film's narrative is brilliantly broken into three parts. These are headed under Itmad, Ittefaq and Qurbani after the motto of the Indian National Army. The film brilliantly captures the vast canvas of its history, geography and political ambiance just before India's independence from British rule. The film is the product of painstaking historical, documentary and other research that spanned 18 months. The research team explored all available material, interviewed the people alive such as Netaji's Japanese interpreter, then in his late eighties. The film comepletely lacks loud and bombastic rhetoric, a common feature of most nationalist and biographical films made on national heroes. Its central focus is on the man behind the hero, the human being behind the mask of the national leader, a true lover of his country dedicated to get it liberated from foreign rule. The film is characterised as much by the patriotism and hero-worship that brought young men in hundreds to join their hero, as by its documentation of history. It is the film of a journey- ideological, political, historical and personal that uncovers almost by incidence than by connivance of history, a beautiful fictionalized documentation of one of the greatest national heroes Indian has ever produced.",
         "To start off with I am the most ardent supporter of subhash chandra bose. I feel that if he had not died he would have definitely been the first prime minister off India. This movie is no way even close to what Subhash ever was. He was the only person to beat Gandhi in an election!! He had a blazing fire within him and this sense of desire to lead the Indians to Independence that just can not be matched by any other Indian. The Subhash in this movie is always nicely smiling and has no charisma off his own, well we don't expect it to match SCB's actual charisma, but the whole calm appeal shown is exactly opposite to what Subhash actually was. Plus there is no detail shown of Subhash's intelligence, which is in abundance, like 4th in ICS, his diplomatic and persuasive abilities to get the Bose-Tojo pact. He was the ideal person to be but after seeing this movie you will wonder where this lump of a figure would ever do anything, yes that is how he is portrayed in the movie. The special effects are the worst ever seen in Indian or any other movie. The only reason I am giving the score 5 is because it does contain historical facts. It is the only movie to ever cover the great hero, which is a real pity for Indian cinema. If you want to watch the movie. Watch it for the facts, not for what Subhash actually was.",
         "Yes, the movie fails on a number of cases- especially character development of Bose himself. It seems to me the whole thing was written and directed in haste. Further, some of the scenes were absolutely unnecessary (what is the need for a showing a German U-Boat firing a torpedo at a ship in this movie). Some of the war scenes were also very badly done. One expected a lot more from a director of Benegal's reputation. I thought the lead actor was very good but again fell short of expectations. But I would ask all Indians to watch the movie. BeThe movie wakes you up to the life and struggles of this hero. Before this I didn't know too much about the man.",
         "I watched this film at its world premiere at the Harvard Film Archive yesterday night (Feb 11). I went to the movie with certain amount of expectation given the subject matter and the caliber of the director. However, I was bitterly disappointed and, moreover, embarrassed by this film about Bose. Bose is a little known personality in the history of Indian independence outside of India and his contribution has been overlooked inside India for 50 years primarily due to his differences with the Gandhi-Nehru axis. As a story, Bose's biography reads like a thriller and ultimately a tragedy, and hence make a great material for a film. Shyam Benegal has been one of the leaders of alternate (non-Bollywood) cinema in India for over two decades and has made some of the best and definitive (at least in my opinion) interpretation of Indian history and effect of historical episodes on common people in cinema. His television series based on Nehru's \"Discovery of India\" stands out as one of the best TV series made not only in India but through the world. \"Making of Mahatma\", his last attempt at biographical movie about an Indian leader was a very respectable movie even if it was hampered by low budget and had some excellent acting and, importantly, more depth and a fairer balance of personality of Mahtma Gandhi than Richard Attenborough's influential film. Thus, ignoring his dismal attempts at commercial movies recently, Benegal could be interpreted as a worthy descendant of the likes of Satyajit Ray, and one could bemoan his lack of exposure in the international market. \"Bose: a Forgotten Hero\" was seen by many of his admirers as a comeback for this worthy director to his field of expertise. I liked the way the movie started abruptly in 1940 at the moment of Bose's resignation as the president of the INC and the script's strategy of concentrating on the events of only the last 5 years of his life. Bose's rise and fall in the hierarchy of Congress Party would itself make an full-length political movie and hence was wisely discarded by the screenwriters. The story of his dramatic escape from India, under house-arrest by the British Government & under media glare, his earnest, if misguided, attempt at forming military alliance with the Italians/Germans/Russians/Japanses forces, and finally, his failed attempt at invading India in the last days of WW2 are brought to screen in astaggering 222 minutes. The movie is structured into three sectionsdealing with one each of the three plot lines mentioned above. Thescreenplay is more or less accurate in storyline. However, it has the ultimate flaw of historical movies, which tend to treat everybody, including Bose, like caricatures. Long screenplays trying to capture the life of a person can be excused for having some of these flaws. The problem with *this* movie is that, it seems completely unedited (note some of the scenes where the camera is not even in focus). I wonder if Benegal just finished shooting and clamped together every frame he shot without even an attempt at editing. Given what I saw on screen, this movie could have been salvaged by a crisper editing to make a more fast-paced movie. As it is, the film feels more suited to be a PBS mini-series than a feature length movie. If that was the only problem with the film, I could still live with it. However, it also had the added problem of shoddy acting on part of almost every single character. Sachin Khedekar, a television actor of TV soap operas was perhaps chosen for this role because of his resemblance to S.C. Bose. He did not put much effort into understanding his character and his acting was worthy of any day-time TV soap. Some supporting acting was good but mostly seemed to be cast of filler. All the international characters seemed like non-actors picked randomly from streets who were uncomfortable being on screen or were over-compensating for lack of talent by over-acting. The romance between Bose and his Greman secretary comes out without any credibility not just because of the lack of any screen intimacy between the characters (notice how the characters rarely even touched each other, leave alone kiss on screen. As the head of the censor board of India, Benegal is well known for his puritanical/conservative views on sex) but also because of really bad acting. Even the cleverest of editing would have not been able to mask this deficiency in the movie. Lastly, I must comment on the \"bollywoodization\" aspect of this movie. The movie has some of the worst and most embarrassing melodrama I have seen in ages. There were SO MANY moments through the movie where the audience were bursting out with unintended giggles because of the almost campy nature of dialogs. I would be the first one to confess that Indians are a melodramatic people in general and presence of melodrama in Indian movies, even historical, is an integral part. Melodrama *does* work in Bollywood movies in enhancing the emotional impact. In this movie, however, all it does is to cheapen the storyline and, furthermore, near the end of the movie, even feels insulting when the INA soldiers are shown in such inane melodramatic state. It adds nothing to the emotional impact and takes a lot away from the tragedy being played out on screen. I think the subject deserved more respect from the actors and the director than this. This movie is hard to digest for even the Indian audience who know the history of S.C.Bose and are used to Bollywood. I wonder what message it would give to international viewers about Indian films and about Bose. To do any justice to Bose, I seriously believe, this movie should not be shown in public. I will end the review with the advice not to see this movie unless you are studying film-making, in which case, this movie is great example of how a movie should NOT be made.",
         "So on 16 September 2008, I finally got to watch this film on Zee Cinema in UK. I had been dying to watch this film for some time now! I love biographical films like Sardar, Legend of Bhagat Singh, Gandhi, JFK and other films like. The reason being that these are the types of films that are made only after a ton of research has been done. But Bose, I did not enjoy! Why? Because of its cheap production values and crappy acting. Sachin started off brilliantly, portraying Bose wonderfully but then everything started looking cheap and executed in a hurry. This film should have been an epic but it lacked everything that would have brought closer to being an epic! Cinematography at times was just simple, boring and unattractive. The wide angle lens were used very badly. Dialogues were just plain stupid at times. Sound Mixing was stupid at moments. The way INA was portrayed very badly. The army movements were stupid! I really wish that they had used some real Military Advisers. The drunk solider scene was just pointless! The 600 South Indian soldiers' scene was pointless!!! The actor was portraying as Hitler was very inappropriate! The scene in Kabul where Sufi Saint and his followers were singing was totally pointless and dragged for too long, unnecessarily! Those two cops outside Bose's house were stupid characters and had no value! The Austrian secretary character was pretty much useless and acted very badly! She was trying to act in a Bollywood-ish manner which did not suit her at all! The special effects/computer effects were horrendous! They were blowing spitfires off with hand grenades! You can damage a spitfire but you can not destroy a plane with grenade like that! The explosion animation/effect that was used to blow up the planes at night was used again and again, and even in daytime when they were blowing up the tanks when INA is attacking India. The train shot in the beginning of the film were shot very badly and without any invention and creativity! Two times, same shots were used twice in the film! The infrastructure that was shown around in the film, definitely didn't look like it was from 1930s 1940s. The cheating shots such as, when Bose were attending the INA parade in Singapore or Japan, didn't look like either of those countries. They were clearly shot in India. When INA is finally marching towards India,they are attacked by British planes. This as done with computer graphics but the planes were so obviously just black blobs flying! They didn't even bother to fix it so that the tree that were between the planes and road were between the planes and road. To put it short, computer effects sucks big time! They would probably look OK in a Pakistani film! lol! Overall this film was just 2, 2 out of 25!!!!!!!!!!!!!!! RUBBISH!!! RUBBISH!!! RUBBISH!!!!",
         "Netaji Subhas Chandra Bose a name which is unforgettable. Give me Blood and i will give you Freedom. We love you sir. This movie gave us many information from which we were not aware. Thank you so much to the entire cast and especially to Mr. Sachin Khedekar, what a performance. Blessings from the bottom of my heart. Warm thanks to Shyam Benegal who enlighten the entire story of our nation unforgotten hero - Netaji Subhas Chandra Bose.I am proud to be an Indian. We all love you Netaji we respect your thoughts and will never forget your sacrifice. Veer Netaji Subhas Chandra Bose you are not dead. You are still alive in our heart. JAI HIND"
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Sahara India Media Communication Ltd.",
         "Shyam Benegal Sahayadri Films"
      ],
      "summaries": [
         "Born in a prominent Bengali family, Subhas had dedicated much of his younger years by being actively involved in ridding the British from India. For this purpose he joined hands with stalwarts such as Jawaharlal Nehru and Mohandas Gandhi, but expressed his frustration, especially with Gandhi's slowgan and painstaking way of trying to win over the enemy with love. This is the reason he decided to separate from the Congress Party. The British became weary of him, placed him under arrest, but when he started a hunger strike unto death, they let him go, but kept him under surveillance. Subhas eluded the police, under the guise of Pathan Mohammad Ziauddin, crossed the Indian border in Afghanistan so that he could enter Russia and form an Indian Army to oust the British. His efforts failed, he ended up as Italian Orlando Mashtar, with an office in Germany. He did manage to convince the Nazis, despite of Hitler's views in \"Main Kempf\" that he preferred India to remain colonized under the British. Nevertheless he was permitted recruit Indian-born British soldiers prisoners of war, and this is how the movement began. He secretly married his German Secretary, Emily Sanken, and did earn the ire of the Germans, who wanted to keep their race pure (Caucasian). His efforts to take his army to India through Russia and Afghanistan were in vain as Adolf Hitler declared war on Russia. Leaving his German-based army, Subhas journeyed to Singapore via a submarine, from there he entered into an agreement with the Japanese. And it was with the help of the Japanese that he marched an army of approximately 8000 troops, both men and women, against the might of the British. It was here that he was informed that he had become the father of Anita. Then, fate again played a cruel hand, when America entered the war, atom-bombed Hiroshima and Nagasaki, forcing Japan to surrender unconditionally. At this point, Subhas had two alternatives: to carry on fighting against the British and their new allies, Australia and America, or just disband his army.",
         "The film, which is about the last five years of the Indian leader Subhas Chandra's life, also includes his life's story in flashback sequences. However, it does not cover the controversy surrounding Bose's death."
      ],
      "budget": 210000000
   },
   "movielensId": 152986,
   "movielens": {
      "languages": [
         "বাংলা",
         "हिन्दी",
         "اردو"
      ],
      "releaseDate": "2005-05-13",
      "dvdReleaseDate": null,
      "directors": ["Shyam Benegal"],
      "runtime": 222,
      "movieId": 152986,
      "title": "Netaji Subhas Chandra Bose: The Forgotten Hero",
      "mpaa": null,
      "actors": [
         "Sachin Khedekar",
         "Divya Dutta",
         "Rajit Kapoor",
         "Sonu Sood",
         "Kelly Dorji",
         "Arif Zakaria",
         "Rajpal Yadav",
         "Rajeshwari Sachdev",
         "Ila Arun",
         "Kulbhushan Kharbanda",
         "Florian Panzner",
         "Rohan Nichol",
         "Zakir Hussain",
         "Udo Schenk",
         "Howard Lee",
         "Jisshu Sengupta",
         "Pankaj Berry",
         "Narendra Jha",
         "Nicolas Chagrin",
         "Chris England",
         "Surendra Rajan",
         "Alaknanda Roy",
         "Ashiesh Roy",
         "Gen Seto",
         "Arindam Sil",
         "Sandeep Srivastava",
         "Lalit Tiwari",
         "Manish Wadhwa"
      ],
      "imdbMovieId": "0349878",
      "originalTitle": "Netaji Subhas Chandra Bose: The Forgotten Hero",
      "genres": [
         "Action",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Netaji Subhas Chandra Bose: The Forgotten Hero (also known as Bose: The Forgotten Hero) is a 2005 film directed by Shyam Benegal and starring Sachin Khedekar, Kulbhushan Kharbanda, Rajit Kapur, Arif Zakaria, and Divya Dutta. The movie depicts the last five years of the life of the Indian independence leader \"Netaji\" Subhash Chandra Bose. It starts out at the point where Bose resigns from his position as the president of the Indian National Congress (I.N.C.) to the meeting with Italians by crossing Afghanistan's rugged terrains and entering into Europe, to romancing his German secretary and appointment with Adolf Hitler in Berlin, to his inspiring of the Indian P.O.W.s (Prisoners Of War) of the 'Punjab Regiment' (British Army) for fighting against the British forces in India, to the patriotic speeches.",
      "tmdbMovieId": 58725,
      "avgRating": 2.75,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/wc2Z11hYoyRW9Y3NeVRzxGw2nIY.jpg"
   }
}