{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0400370",
      "video": false,
      "title": "Dogora",
      "recommendations": [],
      "backdrop_path": "/4FY1pXuGfaJjHVtDeE0O8ojAfAo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49c29251416c910b7e7f",
            "name": "Patrice Leconte",
            "profile_path": "/dvtsf5ZlmnDOv1AIrG3kvM0tWZ2.jpg",
            "id": 37626,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.060733,
      "production_countries": [],
      "id": 87394,
      "vote_count": 1,
      "budget": 0,
      "overview": "Director Patrice Leconte weaves an impressionistic, sensorial tapestry of existence in and around early 21st-century Cambodia. Journeying through the country's farmlands, factories, streets and rural villages, camera-in-hand, Leconte glimpses the people and the elements of the landscape that make Cambodia so culturally specific, and gently contrasts modes of life found there. Written by Nathan Southern",
      "similar": [],
      "original_title": "Dogora",
      "runtime": null,
      "poster_path": "/7f28o0UenmWX9F1qcX4QCsh5Zxo.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-11-04",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Patrice Leconte"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "None",
      "imdbLink": "http://www.imdb.com/title/tt0400370/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Patrice Leconte is a major mid-career French director and so anything he puts out will be of interest to Cinephiles. This is something of a departure however as it is a non-narrative, music only feature. It comprises a stream of images from Cambodia - people crowding onto motorbikes, fields of crops, villages, temples - with a driving musical score. It is only just saved from being a tourist travelogue and the total lack of editorializing or other context may annoy some. The point of reference is presumably Baraka and, in another vein, Koyaanisqatsi. It is beautifully shot and occasionally hypnotic but overall an acquired taste.",
         "Dogora comes with a heavy nod to some very thoughtful ancestors, particularly the Qatsi trilogy and Baraka. That said it has reason to claim uniqueness as unlike the others, the music is not purely separated from the visuals. What you see will at least be partially accompanied by background sounds. There are some scenes that also differentiate Dogora's message from the aforementioned, such as a scene of Cambodian dancers, intermixed with clips of kickboxing. Admittedly, this is a bit clichéd and grasping for symbols of a very complex country, but the footage in this case remains indistinct enough to be interesting. Other times it feels not unlike a home video of a tourist who just won't put the camera down even when the subject is uncomfortable, unlike the ambiguity of scenes in the Qatsi trilogy where the subject remains unaware, indifferent, or amused. The far-too-long segment of the girl with a hat, about halfway through, elicits a feeling of voyeuristic discomfort rather than curiosity. The photography seems to struggle with awareness of this, electing for short cuts, or blurry shots at distance, which detract from the potency. I also can't help but think it would have been better entirely with natural sounds of the recordings. The unfortunate part is that any sensation Dogora brings is tainted by the orchestral accompaniment, which bears not even the slightest acoustic relation to Cambodia, and often no musical relation to what you're watching. Crescendos arise without any visual connection. The scene at the end, of the choir singing, has no relation to the rest of the film, except to confirm that this movie is more about matching exotic imagery to a mediocre musical composition than expressing anything nuanced about Cambodia. Bit of a let down overall, especially considering that I don't doubt there are backpacker videos that express more than this video.",
         "Revered French filmmaker Patrice Leconte attempts to craft a wordless documentary in the vein of Koyannisqatsi but generally misses the boat, its visual artistry hampered by a vague, simplistic \"message\". Had this been made by Cambodian filmmakers, I might be obliged to think differently, as undoubtedly they would have, too. Granted, it's full of pretty imagery (mostly of poor people, of course) and a sweeping (though inappropriately leading) tragi-operatic score by a massive European orchestra with choir seen on screen at regular intervals, most inappropriately at the end. There's a French subheading/tagline for the film that translates directly to \"Open Your Eyes\" which indicates that -- in spite of defenders who think the film deserves a more exalted reputation because of its music and imagery alone, or those who see no editorializing going on -- Leconte clearly WAS trying to make a \"statement\" with this film, a la such broader-canvassed productions as the aforementioned Koyannisqatsi, Baraka or Chronos. But where the directors of those films made that message one part of a larger commentary on our crazy world, and usually contrasted it with imagery of bustling, technology-choked metropolises and the like, Leconte seems to have thought that a vanilla travelogue of seemingly random yet very carefully selected scenes of lower-class, rural Cambodian malaise and ennui (read: people staring into the distance not realizing they're being filmed) set to an emotionally-charged choral musical backdrop would be enough to \"open the eyes\" of his audience to how the have-nots of East Asia really live. Instead, his show comes off like the work of a (typically white-privileged) 20-something millennial Social Justice Warrior whose sense of righteousness and predictable reverence for all things East Asian is not matched by a well-informed understanding of his host country and what sets him apart from the unwitting people he's essentially exploiting for profit. Apart from pictorially, DOGORA doesn't seem like the work of an accomplished auteur like Leconte. It's a tourist video with an \"epic\" soundtrack -- by the noticeably all-white Bulgarian State Orchestra -- layered in to \"open your eyes\" to its rather shallow, ill-defined \"message\": that the indifferent, often bored-looking faces of rural and small-town Cambodians going about their day-to-day lives are actually the face of a people locked in some kind of eternal struggle that the filmmaker doesn't actually identify.",
         "This movie creates a very nice blend of common Cambodian life, and splendid, powerful music. Having lived in Cambodia for nine years, I can definitely understand this film. It describes the Cambodian culture awesomely. The photography is great to say the least. You are taken from 5 minute, unbroken shots of people just walking (perfect pictures of suburb life), to choppy, blurred shots of the chaotic traffic, and back to the silent, peaceful provinces. Very nice. The music is beautiful, and I think it is fitting, despite what some people have said. It adds the perfect touch, and makes everything a lot more enjoyable. I can see how this movie would not mean much to someone who had never seen Cambodia, but I think it's certainly worth at least one watch. I give it 8 out of 10."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Epithète Films",
         "Zoulou Films",
         "Canal+"
      ],
      "summaries": ["Director Patrice Leconte weaves an impressionistic, sensorial tapestry of existence in and around early 21st-century Cambodia. Journeying through the country's farmlands, factories, streets and rural villages, camera-in-hand, Leconte glimpses the people and the elements of the landscape that make Cambodia so culturally specific, and gently contrasts modes of life found there."],
      "budget": 0
   },
   "movielensId": 153096,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-11-04",
      "dvdReleaseDate": null,
      "directors": ["Patrice Leconte"],
      "runtime": 0,
      "movieId": 153096,
      "title": "Dogora",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0400370",
      "originalTitle": "Dogora",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Director Patrice Leconte weaves an impressionistic, sensorial tapestry of existence in and around early 21st-century Cambodia. Journeying through the country's farmlands, factories, streets and rural villages, camera-in-hand, Leconte glimpses the people and the elements of the landscape that make Cambodia so culturally specific, and gently contrasts modes of life found there. Written by Nathan Southern",
      "tmdbMovieId": 87394,
      "avgRating": 3.25,
      "releaseYear": "2004",
      "numRatings": 2,
      "posterPath": "/7f28o0UenmWX9F1qcX4QCsh5Zxo.jpg"
   }
}