{
   "tmdb": {
      "original_language": "ky",
      "keywords": [{
         "name": "boy",
         "id": 5202
      }],
      "imdb_id": "tt0166503",
      "video": false,
      "title": "The Adopted Son",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Beshkempir",
               "gender": 0,
               "credit_id": "578f1ef59251410848014151",
               "name": "Mirlan Abdykalykov",
               "profile_path": null,
               "id": 1431092,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "578f1f02c3a3682bb2020d62",
               "name": "Adir Abilkassimov",
               "profile_path": null,
               "id": 1653435,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "578f1f0b9251412ec2004483",
               "name": "Mirlan Cinkozoev",
               "profile_path": null,
               "id": 1653436,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "578f1f1992514174ac000305",
               "name": "Bakit Dzhylkychiev",
               "profile_path": null,
               "id": 1653437,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Aynura",
               "gender": 0,
               "credit_id": "578f1f26c3a3686ecc00ee7c",
               "name": "Albina Imasheva",
               "profile_path": null,
               "id": 1189055,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "578f1f31c3a3680c870002ba",
               "name": "Talai Mederov",
               "profile_path": null,
               "id": 1653438,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe48d19251416c910995b5",
            "name": "Aktan Arym Kubat",
            "profile_path": "/eBSok7fdMgAkENfWsiiAwf9Qme5.jpg",
            "id": 1287492,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.390329,
      "production_countries": [
         {
            "iso_3166_1": "KG",
            "name": "Kyrgyz Republic"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 84023,
      "vote_count": 3,
      "budget": 0,
      "overview": "In a Kyrgyz village, five older women adopt an infant foundling. Jump ahead about 12 years: the boy, Beshkempir, is entering puberty, the age, his granny says, when life goes berserk. He plays with friends, horsing around, sniggering about sex, going to an outdoor movie. He works, fishing and making bricks of mud. And, he's starting to notice girls. He and his best friend fight, and he learns to his consternation that he's a foundling. A death in the family pushes Beshkempir even faster toward adult roles: he must brush tears from his eyes, lead a funeral procession, and reconcile with his friend. Then, he borrows a bicycle and calls on Aynura: courtship begins.",
      "similar": [
         36210,
         450015,
         244336,
         446906,
         9552,
         85350,
         258230,
         44826,
         8838,
         36536,
         11236,
         3035,
         9662,
         39013,
         11293,
         62837,
         10895,
         862,
         59967,
         11349
      ],
      "original_title": "Beshkempir",
      "runtime": 81,
      "poster_path": "/mzZaaU55vXVm1ddUsiFMmrUUEOu.jpg",
      "spoken_languages": [{
         "name": "??????",
         "iso_639_1": "ky"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Noé Productions",
            "id": 23433,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kirghizfilm",
            "id": 40456,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-08-11",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Kyrgyzstan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Aktan Arym Kubat"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Avtandil Adikulov",
         "Aktan Arym Kubat"
      ],
      "originalLanguage": "Kirghiz",
      "imdbLink": "http://www.imdb.com/title/tt0166503/",
      "coverLink": null,
      "actors": [
         "Mirlan Abdykalykov",
         "Adir Abilkassimov",
         "Mirlan Cinkozoev"
      ],
      "reviews": [
         "Beshkempir is one of the resonable rare films which does not overfill you with a lot of pictures. The story is very simple - the growing up of a young boy in a rural part in Kirgistan - but it contains in a way the whole \"meaning of life\". The growing up from child to a young adult is shown in a tremendous poetic way",
         "A minimalist film from Kyrgyzstan, a Central Asian nation and former Soviet republic (there are several alternative spellings of the country). Shot in black and white, but with a few scenes in color, the film is set on a rural village and starts as a young baby boy is adopted by another family. The film cuts to several years later, when the boy is now a teenager. With other boys he is shown having the small adventures that boys in small towns have, stealing fruits from a neighbor, fighting, splashing in a mud pool, going with the rest of the village to an outdoor cinema (where an Indian film is shown, using an old projector). The central conflict of the movie starts when other boy, after losing against him the favor of one of the girls, tells him he is an adopted boy (which is apparently a cause for embarrassment in the local culture). This small conflict will eventually reach a happy resolution, when his parents (which had hide to him his origins) tell him the truth. The movie is well done, in the tradition of the slow Soviet art movies, though it would be a stretch to call it a masterpiece. But because the country and its culture are little known outside the former Soviet Union, most of the viewers will see the film with the thrill of discovery, as a portrayal of a strange, little known culture.",
         "Not only is this film visually beautiful, shot in black and white with occasional scenes in color depicting the rural village where the film is set and its ancient rituals and traditions, but Abdykalykov also succeeds in telling us the story of Beshkempir, a boy who discovers his adoption, and the transition he makes from a child to a young adult. Strongly recommended.",
         "Sometimes striking cinematography that vacillates between chromatic and monochromatic lends verisimilitude to this tale of a young boy in search of his roots. Like the boy in CINEMA PARADISO, BESHKEMPIR finds himself drawn to the after dark outdoor screening(s) of movies in his village. Here, as in the opening sequence showing the boy's own birth, Life is rendered in glorious Color. It's a far cry from the drab day-to-day realities of life in the village (where everything is literally earth-bound; villagers are shown making bricks from mud and sod and laying them out in the sun to dry and harden). BESHKEMPIR soon becomes a quiet, sometimes subtle meditation on the cruelty and comradeship of kids. He learns, along the way, that when Mother Nature calls, nobody hangs up...",
         "This movie has a great peace. It shows that materialism is something we hang onto too much. The atmosphere of the movie is breathtaking. There's not that much happening in the movie but that doesn't make it less interesting. The black and white and colored sequences are beautifully interacting. 8 out of 10.",
         "This film is not only well-acted and written, but it also one of the most visually impressive in years. The story is very simplistic in nature, and its detailed scenes of childhood discovery are captivating and enlightening. A great movie for movie goers of all ages and interests.",
         "When I was first watching this movie, I was reminded of Fellini's \"Armacord,\" because it seemed to be more poetic and atmospheric in nature than driven by a narrative structure. I soon realized that it was not so much the collage sort of film that Fellini had made of his reminiscence of his childhood, but that there was a narrative to \"Beshkempir.\" This film is wonderfully acted, filmed, and edited, and it incorporates the sounds of nature to great effect. As other reviewers have written, the film's pace is \"slow,\" but deliberately so. It gives the viewer time to soak in the landscape, feel familiar with the village and its surroundings, and get to \"know\" the characters as well as the traditions of the village. It is a peak into the world of Kygystan, which was my first ever, and I envied the closeness of the villagers and the rich life they live with only the most essential of material things. This is a coming of age film, but one done in a way that has made it one of my favorite movies of all time. Not enough people in the world will ever know of it, even though it ranks among the best of works by filmmakers like Truffeat, Bergman, and Rohmer, all favorite directors of mine for years.",
         "This movie is interesting primarily because it is a Kyrgyzstani film, and as such it offers a few interesting glimpses of Kyrgyz culture and rituals - particularly those around death after the passing of Beshkempir's mother. Aside from that, I didn't find a whole lot to get excited about in this pretty straightforward coming of age story. Beshkempir is the title character - a boy adopted as a baby by a childless couple, but who has never been told he's adopted. He's treated with a strange mix of contempt and acceptance by the other boys of his village (who know the secret) and even by his own father, although by the end of the movie Beshkempir and his father seem to have sorted out their relationship. Eventually, in a competition for the attentions of a local girl, Beshkempir's secret comes out, and the entire village has to come to terms with it. The movie is filmed mostly in black and white with occasional bursts of colour popping in. It didn't really take hold of me. Overall, a disappointment. 3/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Centre National de la Cinématographie (CNC)",
         "Kirghizfilm",
         "Noé Productions"
      ],
      "summaries": ["In a Kyrgyz village, five older women adopt an infant foundling. Jump ahead about 12 years: the boy, Beshkempir, is entering puberty, the age, his granny says, when life goes berserk. He plays with friends, horsing around, sniggering about sex, going to an outdoor movie. He works, fishing and making bricks of mud. And, he's starting to notice girls. He and his best friend fight, and he learns to his consternation that he's a foundling. A death in the family pushes Beshkempir even faster toward adult roles: he must brush tears from his eyes, lead a funeral procession, and reconcile with his friend. Then, he borrows a bicycle and calls on Aynura: courtship begins."],
      "budget": 0
   },
   "movielensId": 153194,
   "movielens": {
      "languages": ["??????"],
      "releaseDate": "1998-08-11",
      "dvdReleaseDate": null,
      "directors": ["Aktan Arym Kubat"],
      "runtime": 81,
      "movieId": 153194,
      "title": "The Adopted Son",
      "mpaa": null,
      "actors": [
         "Mirlan Abdykalykov",
         "Adir Abilkassimov",
         "Mirlan Cinkozoev",
         "Bakit Dzhylkychiev",
         "Albina Imasheva",
         "Talai Mederov"
      ],
      "imdbMovieId": "0166503",
      "originalTitle": "Beshkempir",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In a Kyrgyz village, five older women adopt an infant foundling. Jump ahead about 12 years: the boy, Beshkempir, is entering puberty, the age, his granny says, when life goes berserk. He plays with friends, horsing around, sniggering about sex, going to an outdoor movie. He works, fishing and making bricks of mud. And, he's starting to notice girls. He and his best friend fight, and he learns to his consternation that he's a foundling. A death in the family pushes Beshkempir even faster toward adult roles: he must brush tears from his eyes, lead a funeral procession, and reconcile with his friend. Then, he borrows a bicycle and calls on Aynura: courtship begins.",
      "tmdbMovieId": 84023,
      "avgRating": 3.25,
      "releaseYear": "1998",
      "numRatings": 2,
      "posterPath": "/mzZaaU55vXVm1ddUsiFMmrUUEOu.jpg"
   }
}