{
   "tmdb": {
      "original_language": "da",
      "keywords": [{
         "name": "erotic movie",
         "id": 190370
      }],
      "imdb_id": "tt0066407",
      "video": false,
      "title": "Quiet Days in Clichy",
      "recommendations": [
         355505,
         137891,
         138750,
         236063,
         136762,
         211209,
         105583,
         256222,
         153410,
         116370,
         147015,
         66538,
         10244,
         147211,
         151436,
         146815,
         151730,
         111793,
         95378,
         173029
      ],
      "backdrop_path": "/iTcVFDjht8nAmExtC9dE0XSMCPR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Joey",
               "gender": 2,
               "credit_id": "52fe468cc3a368484e096c17",
               "name": "Paul Valjean",
               "profile_path": null,
               "id": 235961,
               "order": 0
            },
            {
               "cast_id": 1005,
               "character": "Mara",
               "gender": 1,
               "credit_id": "52fe468cc3a368484e096c23",
               "name": "Avi Sagild",
               "profile_path": "/3czxDmnAWmeqRXLEnHXDDRekJg8.jpg",
               "id": 235965,
               "order": 1
            },
            {
               "cast_id": 1008,
               "character": "Jeanne",
               "gender": 1,
               "credit_id": "59107e639251414eca030c71",
               "name": "Lisbet Lundquist",
               "profile_path": "/khjAsh1tMF1N5wYqsKRRuLyUrma.jpg",
               "id": 107264,
               "order": 2
            },
            {
               "cast_id": 1012,
               "character": "Nys",
               "gender": 1,
               "credit_id": "59a7edbdc3a3683ce6011d0a",
               "name": "Ulla Koppel",
               "profile_path": null,
               "id": 235964,
               "order": 3
            },
            {
               "cast_id": 1010,
               "character": "Colettes værge/Vært i Cafe",
               "gender": 2,
               "credit_id": "59107f45c3a368646b0357f5",
               "name": "Olaf Ussing",
               "profile_path": "/sox335xCN241xgQ124ihziPeDA1.jpg",
               "id": 51208,
               "order": 4
            },
            {
               "cast_id": 1011,
               "character": "Festdeltager",
               "gender": 2,
               "credit_id": "59107f699251414e85032aeb",
               "name": "Klaus Pagh",
               "profile_path": "/jrPVUztccwaMU9O6R3yfKH2BvCt.jpg",
               "id": 91515,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe468cc3a368484e096c0d",
               "name": "Jens Jørgen Thorsen",
               "profile_path": null,
               "id": 235960,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55941a73c3a368356600050f",
               "name": "Jens Jørgen Thorsen",
               "profile_path": null,
               "id": 235960,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55941a689251410e92002ee6",
               "name": "Henry Miller",
               "profile_path": null,
               "id": 206299,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.363039,
      "production_countries": [{
         "iso_3166_1": "DK",
         "name": "Denmark"
      }],
      "id": 62759,
      "vote_count": 12,
      "budget": 0,
      "overview": "Jens Jorgen Thorsen's freewheeling adaptation of Henry Miller's notorious novel offered a different kind of American in Paris and pushed the boundaries of sex on the screen",
      "similar": [
         55580,
         28468,
         80752,
         50124,
         134764,
         27066,
         14174,
         48650,
         2770,
         86331,
         81774,
         341174,
         249397,
         250225,
         258480,
         9285,
         370663,
         9453,
         50270,
         24402
      ],
      "original_title": "Stille dage i Clichy",
      "runtime": 80,
      "poster_path": "/mgSIdqoHzIiwyPZNslumdG1tLol.jpg",
      "spoken_languages": [
         {
            "name": "Dansk",
            "iso_639_1": "da"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "SBA",
            "id": 56994,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dans-Svensk",
            "id": 56995,
            "origin_country": ""
         }
      ],
      "release_date": "1970-06-01",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jens Jørgen Thorsen"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Henry Miller",
         "Jens Jørgen Thorsen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066407/",
      "coverLink": null,
      "actors": [
         "Paul Valjean",
         "Wayne Rodda",
         "Ulla Koppel"
      ],
      "reviews": [
         "I don't know about this one. The point, if there was one, seemed to get by me. Multiple references to the film's source, Henry Miller's eponymous novel, don't help much. Much of Miller's appeal comes not just from his go-to-hell attitude towards life and art but from the way he expresses his sentiments on the page. Maybe he just doesn't translate well to the screen, not that Miller himself would care one way or the other. The street words that Miller flung about so carelessly in his prose seem emphasized here, as if designed expressly to shock. Not just the F word either. Well the street words are old and established. Shakespeare worked a terrible pun on the C word into one of his comedies, I forget which. The F word goes back to the Angles and the Saxons or the Mooks and the Gripes or somebody. Wait a minute -- the C word was also worked into a pun in \"Hamlet,\" come to think of it. \"I feel like going out and getting myself a fatal dose of clap.\" Well, no kidding. Are we supposed to be shocked? Maybe we were, back in 1970, if we had blue hair and lived in Dogpatch, USA. If Henry Miller doesn't add much cachet, neither do Country Joe and the Fish, whose music whangs away on the sound track with lyrics that are as pointlessly vulgar as the horribly dubbed dialog. Ben Webster is okay, though. And the photography, though irritatingly grainy, is several steps removed from the billowing pastels of soft-core porn. It's honestly black and white, and the naked bodies, of which there are plenty, aren't painted, trimmed, or shaved. If the babe has a pimple anywhere, you see the pimple. And the guys are bald on top and hairy everywhere else. A for sincerity there. The story goes no place. There is no story. People run around half naked on the streets of Paris, flapping their arms and panting, supposedly having a great time. Half a dozen ordinary-looking people slosh around in a tub pouring wine over one another and laughing giddily because the director told them to act as if they were having the grandfather of all good times. (The French do this joi de vivre stuff better.) In the first scene of the film, the bespectacled hero, a pallid imitation of Miller, picks up a girl in a café and, after sex, gives her all his money, can't get any more credit at the restaurants, and is forced to raid his own garbage pail for leftover nuggets. Plenty of sex but not enough food. That's how a viewer feels after watching this. I wish this movie had been better. It was dumped on for obscenity, but the sexual and linguistic candor was at least an innovation in a mainstream movie. It deserves dismissal, true, but only because it lacks any substance. As it is, it stands as an historical curiosity.",
         "*Contains Possible Spoilers* I consider myself quite well connected with the late 1960s, even being quite a Joan Baez fan in kindergarten! In the mid-seventies a relative gave me a big stack of old Evergreen Review magazines, and I started an interest in more counter-culture things from the '60s because of that, since I was just a child when much of it took place. One of the films Evergreen released in 1970 that they gave a lot of coverage to was Quiet Days In Clichy, showing tantalizing pics of the cast in naked moments. And in 2004 I finally got to see what the hubbub was about... Mainly a curiosity of the late '60s and of interest mainly for those interested in the \"art\" cinema of that time, this film is really another of those where philosophy and intellectual conversations are padded with people having sex, showing even the intellectuals have a base interest just like everyone else. But since it centers around someone like Henry Miller, it's high art apparently. Certainly off to an interesting start, the film immediately gets one to think though that there is a promise of more like the hardcore footage shown right after the strange credit sequence. That might have been better actually, because instead we then mainly get characters meandering around Paris and Luxembourg, laughing a lot and wondering why they are never satisfied. Here are some of the perplexing things for me: --Joey complains that Nys could have left him a few francs after he first met her and gave her his money, but Joey actually INSISTED she take all of it to begin with. --The guys keep yakking about how Colette's brains are in her genitals and that she just wants to have sex (a feeling they seem to have about women in general), but by watching this whole film it seems Joey and Carl spend all their time trying to get laid as well. --The women are portrayed as a bit mentally off, except for Colette's mother (upon which Carl then just says how hot she was, which seemed like belittling her after she was kind to them). --Joey is a writer, but we rarely see him even doing that, he just complains how he has no money and has nothing to eat, but can spend a lot of time walking around town and looking for sex. --Suddenly while in Luxembourg, and somehow with money, they wind up pouring bottles of wine all over prostitutes and letting the bread they have to just wind up in the tub and going down the drain with the wine. If we're supposed to appreciate Joey and Carl's \"bohemian lifestyle,\" it doesn't help that they just waste food and drink after always saying they never have it. --Hoping there would be a resolve to the story, instead after a naked woman can't have sex with them because she was crying over the memory of her late husband, the others just sit there naked and laugh while the camera zooms in on their genitals. Huhhhh??? That's it? I don't regret seeing this film after wondering for so many years what it was all about, and discovering more curiosities from that era. It's just that I think some people will find any reason to say it's poetic mainly because Henry Miller is involved -- if this were not based on him and just a film of its own, I doubt as many folks would be worshiping it. Had a film been made of a character based on Henry Miller washing dishes for an hour and a half, I'm sure these people would somehow come up with many a thesis on the amazing meanings of it. But it all just comes down to silly naked people laughing, in my eyes...",
         "Context is everything. If you come to this cold, you will think it an amateurish production of an artless man and his life. Miller's reason to be in our life was his place in moving a barrier of sexual prudishness to a more defensible location. Thus for a decade or so, the arbiters of art celebrated his boldness and the marketplace of prurience sprinkled him about, ensuring that he is \"read.\" Now, his life seems merely feckless and his art artless. So if you accept this as it was intended and received when new, you'll be disappointed. All the gas has gone out of that excuse for our time. But I saw this together with \"La Dolce Vita.\" That film is sublimely competent, a beautiful receptacle whose beauty amplifies its emptiness. So too is the story, about beautiful people with empty lives, people we would just as soon never existed. So take this as a beat version of that film. Accept its provenance, as a film by a hippie painter, and its proximity to the actual Miller and his actual, now completely worthless life. Take it that way and it works. If you take out the sex scenes, the actual humping, you get a rather well conceived portrait. Its a collection of sequences, each sequence defined by the woman or women who were the target of that sexual encounter. Each woman exists only as a receptacle. One involves a runaway retarded girl of fifteen who provides a specific type of sexual availability. I suppose all the events in this film actually happened, but the way she is depicted surely references \"Lolita,\" a sort of 800 pound gorilla or sexual literature. The point with Lolita was the untrusted narrator. Here, its more like \"Withnail,\" an untrusted life. The other notable woman is the last one. She really is lovely, almost precisely a cross between Anita Ekberg and Nico, both of \"la Dolce.\" This woman has two children. Her husband is dead. She comes home with Miller and lays down nude with him to have sex, then balks. He pursues her, almost raping, but she escapes. Its the perfect end, as far from erotic as one can get. Has very much a Fellini manner, that sequence, allowing for the music. So the striking thing about this is the same as in Fellini's film. There's a fantasy involved, but it is not the romantic fantasy that film usually supports and perhaps invented. Its the opposite of that fantasy: a life without a happy ever after. As with Fellini, some of the compositions are superb. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "I only heard about this when the Blue Underground DVD first came out; of course, I was aware of controversial author Henry Miller, on whose novel the film was based - whose work, incidentally, was contemporaneously being transposed to celluloid for the first time via the late Joseph Strick's TROPIC OF CANCER (1970). Anyway, it was merely a coincidence that I ended up acquiring the two film versions of the book (the other being the 1990 adaptation by Claude Chabrol) virtually simultaneously! Since I was going through a retrospective of that director's work anyway, I decided to check this one beforehand; well, I am glad that my generally negative reaction to it did not give me second thoughts about passing on the remake (as the latter was a more rewarding, and altogether different, experience – but more on that in its own review)! Anyway, I have never been fond of Erotica per se and this is pretty much what one got here: some critics praised the kaleidoscopic style adopted here (actually borrowed from Richard Lester) but this particular approach dates the film more than anything else. Besides, it is further bogged down by the lack of a proper plot (a fault which is much better disguised in the later version), revolting detail (the graphic sexuality on display got it banned in the U.S. on original release – atypically, this is a Danish picture shot in the English language and black-and-white) and characters who seem to have crawled from under rocks (especially the two leads)! In essence, we follow the dreary and over-sexed exploits of two penniless bohemians (the more studious-looking of whom is supposed to be an alter-ego for the author himself); they become involved with several women, of various ages and nationalities, and not even that good-looking in many cases. Eventually, they both become attached to someone in particular but, with respect to the protagonist's companion, the girl in question is a 14-year old half-wit!; in the end, the film just ends abruptly as if its makers had suddenly run out of money themselves\u0085or film stock or, quite simply, ideas! However, the eclectic score is a big plus – some of it typically French and the rest comprised of numerous conceptual songs by Country Joe (McDonald) of the psychedelic and radical \"Country Joe & The Fish\" band fame.",
         "If you were there at the time the film makes sense. All of the taboos were there to be broken and this one tried to break them all at once just to prove it could get away with it. So there's naked women everywhere (in poses 'pushing out the envelope' of the day), bad language and lavatorial humour in abundance. My guess is that the producers were so fixated on pushing back the boundaries of the then conventional taste, that even the most the most rudimentary craftsmanship was contemptuously discarded. So it's a pity that the acting is terrible, wit is noticeable by its absence and the nudes aren't really all that exciting. Some gross outs can be amusing. These ones were not. With very little effort this could have been so much more fun and put one over on the wicked establishment at the same time. Watch 'I Am Curious' instead. It's (they're) no great shakes but much better than this.",
         "Joey, a writer, and Carl, a Frenchman, are two bohemians living in Paris spending all their time looking for more poon. All the women are slut and/ or mentally unstable and stupid only good for what's between their legs in their world view and the film itself seems to suggest that the idea is true. Based loosely on the Henry Miller book which was in turn based loosely on his actual life. Made and seems to be only for the pretentious and unbearable Art-house crowd. (hey even THEY have base interests..I think) For the rest of you people (Ie. Normal) just go rent some real porn instead, you'd get more out it. And likely more of a plot to boot. I usually like the movies that Blue Underground choose to release, but this one is a vast disappointment. It is however the most anti-feminist movie you'll likely ever see. I guess that deserve something. My Grade: C- DVD Extras: \"Dirty Movies, Dirty books\" featurette; an 11 minute piece on the music, Poster and stills gallery; Bios of Henrey Miller and Jens Thorsen DVD-ROM: Court Documents 2 Easter Eggs: highlight the word EXTRA in the extras menu, and the word CLICHY in the talent bios menu for 2 more clips of Barney Rosset interviewed Eye Candy: Ulla Koppel. Suzanne Krage, Lisbet Lundquist, and Louise White all so much flesh",
         "I'm reviewing this from the perspective of myself as a fan of Miller .. Though this is a poorly-done piece of amateur cinema, there is at least enough curiosity in seeing the presentation of the characters and other elements of the book, though you will likely be horribly disappointed with everything. \"Quiet Days\" is certainly one of Miller's crudest books, in terms of him coming off like a real jerk, albeit a smart and charming one (which the actor playing Miller totally lacks). In that sense, the film captures the baseness in the fact that it's as if the novel has been interpreted by tittering frat boys who pick out the most basic \"shock\" elements and run with them with anti-authoritarian glee. The previous review of this film mentions plot points which make no sense. This is because the director showed his obvious carelessness and sloppiness by not attaching logic to actions which are clear in the book. A curiosity of the late 60's (including footage of Paris in 69/70; also notable for the use of text within image which I actually quite liked), but a real disappointment for Miller fans, and a pretty bad movie overall.",
         "I am a fan of Henry Miller and have read many of his books. When I saw a DVD of \"Quiet Days in Clichy\" on my local video store's \"Staff Pick's\" shelf, I excitedly plucked it off and read the back. It sounded great, an artistic rendition of one of Miller's works. I took it home practically rubbing my hands. As the previous reviewer commented, the acting is abysmal. Painful to watch. What a disappointment. The photography is good. There are some (filming) tricks employed, but do nothing to salvage this failure.",
         "My girlfriend said she'd never seen a porno film, so she dragged me into the cinema to see \"Stille Dage i Clichy\" in Copenhagen, when the film was new. To say it's a bad film is to overvalue Warhol's \"Flesh.\" It was worse. The only good bit was right at the beginning, with the play on \"Gray Day.\" After that, it was downhill all the way. The acting was abysmal. The plot... well, what plot? The \"Germs won't attack a starving man\" scene was memorably sickening. The bonking was overdone and hugely \"in your face.\" For a poetic film, See \"Last Year in Marienbad.\" Spot the difference. IMHO, Miller wasn't a particularly good writer. His books did, however, mark a turning-point in censorship. This film, though, has about the same artistic qualities as \"The Texas Chainsaw Massacre\" and \"The Toolbox Murders.\" When the film ended, though, it was interesting to note that, while the women in the audience stood and put on their cardis and coats, the blokes sat quite still for a minute or so :-) .",
         "This is a poetic movie describing recollection of aging Henry Miller of his stay in Paris before the WWII. It follow the adventures decribed in the book of the same title. The movie has both good humor and great bodies. I would love to have a copy of this movie in any format.",
         "Pretty funny and trashy take on Miller's vision. The sex in this movie makes The Room love scenes to look like high art. For example the almost total absence of doggystyle position, I don't know if it was a censorship issue but it seems stupid to watch this Italian Stalion softcore sex over and over. The guy playing Miller does a rather awful job anyway. He might be an interesting person himself but he is no Henry Miller that is for sure! Anyway, the movie is oversexed in a silly way like if someone saw American Psycho as only being about physical violence for example. Thus in a way it is a weird take on Miller to make it about sex. Miller had a number of other interests such as philosophy.",
         "this is just one of those pro-tend-be \"art-house\" junk Euro made in 70s,i do not know why blue-underground release this junk. A very boring movie, 80% of time are silly fake love-making scenes with out any meaning. poor plot, poor acting. silly slut and bastard(the main male roles)There are really no likable people in the movie. If you like this kind of movie, you should rent a real porn, just like last poster said give 1 vote just because no zero. I suggest no one should watch this piece of trash. the only good thing in this movie is the music. Just forget about this movie and try your best to avoid it.",
         "I read \"Quiet Days in Clichy\" some fifty years ago. Whatever else can be said for porno--it does have a certain joie-de-vivre to it. And this movie--more or less--captures the mindlessness of Henry Miller chasing after c**t in Paris. And apparently with some success. (The word is splattered all over the film in the opening minutes of the film... So trust it doesn't violate IMDb TOU. And the reality of Henry Miller and the story is reduction of women to a simple anatomical part.) While the 1990 film portrays the 14 year old Collette with a certain charm, innocence, style, and attractiveness--this film prefers to depict Collette as some sort of simpleton waif, mentally unbalanced. While I thought the 1990 version bordered on the silliness--partly because of the sterilization of the sex scenes, which I thought Henry Miller would not have approved, and partly for use of studio sets for exterior shots of Paris--this version actually is filmed outdoors with Paris as a backdrop. The cineme-verite added a dimension of reality that was appreciated. The story, \"Quiet Days in Clichy\" Henry Miller records his sexual exploits in vivid detail--I thought one of those great moments in story telling. \"Wow, who knew mindless humping and drinking could be fun?\" And this 1970 version managed to capture that in a small way that sense of fun that mindless humping is--and that Henry Miller wanted to convey in his autobiographical story. While the 1990 version seemed to never quite admit that basic element of effing for fun. A great movie ?--not by a long shot; but interesting to see how Henry Miller's pornographic autobiographical sketch was transposed to film; and this movie was a far more successful adaptation than the sterile 1990 version. (And both worth a look see on a rainy Saturday evening.)",
         "If you want to experience Henry Miller, read the books for goodness sake. This pathetic excuse for a film owes more to the idiotic counter culture of the late 60s and early 70s than it does to either Miller's ideas, or the tenor of the times in pre-war France. The central characters are repulsively misogynistic, not a single soul in this homemade-seeming film has a shred of acting ability. On top of that, the script is grating, the direction laughable, the camera work strictly amateurish, and the editing clumsy. No subtlety. No finesse. No artistry. A complete waste of two hours. One of the very few DVDs I have ever had the pleasure of tossing in the garbage.",
         "One wonders what Claude Chabrol was thinking when he decided to make this as-far-from-typical-Chabrol as he or indeed anyone could get. Even the sense of period - the one thing that might have saved it - is unconvincing and the average viewer will spend most of the time - assuming he hasn't walked out after the first couple of reels - wondering why anyone - outside, of course, of a porn movie theatre - work up much of a sweat over a pair uninteresting guys dedicated to laying everything they can and whinging about their lack of food and money. By the time of shooting Chabrol was long divorced from Stephane Audran which may account for why he cast her, presumably he would have hesitated if she were still his wife."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Dans-Svensk",
         "SBA"
      ],
      "summaries": ["Not so quiet, Joey and Carl's days in Clichy... The two men, living in a small apartment, are penniless writers, with not enough to eat, which does not prevent them from enjoying life. One of their main interests is to get laid with women of various ages, physical appearances and nationalities. Among them, a neighbor in need, a fourteen-year-old half-witted girl, an American newspaper vendor who tends to smash up everything before making love, a Swedish woman who mourns her late husband..., all being merely sex toys they play with"],
      "budget": 0
   },
   "movielensId": 153154,
   "movielens": {
      "languages": [
         "Dansk",
         "English"
      ],
      "releaseDate": "1970-06-01",
      "dvdReleaseDate": null,
      "directors": ["Jens Jørgen Thorsen"],
      "runtime": 80,
      "movieId": 153154,
      "title": "Quiet Days in Clichy",
      "mpaa": null,
      "actors": [
         "Paul Valjean",
         "Avi Sagild",
         "Lisbet Lundquist",
         "Ulla Koppel",
         "Olaf Ussing",
         "Klaus Pagh"
      ],
      "imdbMovieId": "0066407",
      "originalTitle": "Stille dage i Clichy",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jens Jorgen Thorsen's freewheeling adaptation of Henry Miller's notorious novel offered a different kind of American in Paris and pushed the boundaries of sex on the screen",
      "tmdbMovieId": 62759,
      "avgRating": 3,
      "releaseYear": "1970",
      "numRatings": 4,
      "posterPath": "/mgSIdqoHzIiwyPZNslumdG1tLol.jpg"
   }
}