{
   "tmdb": {
      "original_language": "sk",
      "keywords": [],
      "imdb_id": "tt0115040",
      "video": false,
      "title": "The Garden",
      "recommendations": [
         6511,
         136146
      ],
      "backdrop_path": "/gPkG2RosQgAUovmgw6ChMuitfk8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1006,
               "character": "",
               "gender": 0,
               "credit_id": "54c8da4892514157cc001e14",
               "name": "Zuzana Šulajová",
               "profile_path": "/uuor79Fbdmd4LUhQPFDKOHaAwJ0.jpg",
               "id": 96382,
               "order": 1
            },
            {
               "cast_id": 1007,
               "character": "",
               "gender": 2,
               "credit_id": "5761dd25c3a3685c6d00000f",
               "name": "Marián Labuda",
               "profile_path": "/jzpuDqEi1vR1P2vqnbaJWwAajNA.jpg",
               "id": 72793,
               "order": 2
            },
            {
               "cast_id": 1008,
               "character": "",
               "gender": 0,
               "credit_id": "5761dd2f9251415ea000001c",
               "name": "Roman Luknár",
               "profile_path": "/dp5HqVOoksyEENiQ7WqPA2SGZmN.jpg",
               "id": 130903,
               "order": 3
            },
            {
               "cast_id": 1009,
               "character": "",
               "gender": 0,
               "credit_id": "5761dd3d9251415ea3000013",
               "name": "Jana Svandová",
               "profile_path": null,
               "id": 1555855,
               "order": 4
            },
            {
               "cast_id": 1010,
               "character": "",
               "gender": 0,
               "credit_id": "5761dd47c3a3685c7900001a",
               "name": "Katarína Vrzalová",
               "profile_path": null,
               "id": 1636472,
               "order": 5
            },
            {
               "cast_id": 1012,
               "character": "",
               "gender": 0,
               "credit_id": "5761dd65c3a3685c7d000012",
               "name": "Ján Melkovič",
               "profile_path": null,
               "id": 1280685,
               "order": 7
            },
            {
               "cast_id": 1013,
               "character": "",
               "gender": 0,
               "credit_id": "5761dd6c9251415ea0000022",
               "name": "Stanislav Štepka",
               "profile_path": null,
               "id": 1494927,
               "order": 8
            },
            {
               "cast_id": 1014,
               "character": "",
               "gender": 0,
               "credit_id": "59b34dd29251414a7a006fcd",
               "name": "Dušan Trančík",
               "profile_path": "/bUKba26fiyvvdAUTXuXApBeIRa4.jpg",
               "id": 138064,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47b39251416c750a2845",
               "name": "Martin Šulík",
               "profile_path": null,
               "id": 575744,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b39251416c750a284b",
               "name": "Martin Štrba",
               "profile_path": "/y2EgMoy4B8bgcieNpO8mpf82Jer.jpg",
               "id": 575745,
               "department": "Camera",
               "job": "Camera Department Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b39251416c750a2851",
               "name": "Peter Mojžíš",
               "profile_path": null,
               "id": 575746,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b39251416c750a2857",
               "name": "Miro Šindelka",
               "profile_path": null,
               "id": 575747,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b39251416c750a285d",
               "name": "Ondrej Šulaj",
               "profile_path": "/eCO18m1OviCCigokImqzPmfKgVV.jpg",
               "id": 575748,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b39251416c750a2863",
               "name": "Rudolf Biermann",
               "profile_path": "/zoKMBzfjlmHlzoggrcj2RWOPsmI.jpg",
               "id": 72798,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.597527,
      "production_countries": [
         {
            "iso_3166_1": "CZ",
            "name": "Czech Republic"
         },
         {
            "iso_3166_1": "SK",
            "name": "Slovakia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 19008,
      "vote_count": 8,
      "budget": 0,
      "overview": "Jakub's life arrived at a dead-end. He leaves his job, and gets into conflict with his father. The trouble just grows by his relation with a married woman. Breaking out, Jakub realizes the pleasures of the countryside in the old garden of his grandfather. He finds true love with an angel, and encounters various exciting moments of his new free life. Strange visitors arrive, and he wont get back to town anymore",
      "similar": [],
      "original_title": "Záhrada",
      "runtime": 99,
      "poster_path": "/kl3wCMoIqWGIA10jkohheGi9NOu.jpg",
      "spoken_languages": [{
         "name": "Slovenčina",
         "iso_639_1": "sk"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "In Film Praha",
            "id": 64295,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artcam International",
            "id": 30553,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Charlie's Bratislava",
            "id": 78160,
            "origin_country": ""
         }
      ],
      "release_date": "1995-06-09",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Slovakia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Sulík"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Marek Lescák",
         "Ondrej Sulaj"
      ],
      "originalLanguage": "Slovak",
      "imdbLink": "http://www.imdb.com/title/tt0115040/",
      "coverLink": null,
      "actors": [
         "Roman Luknár",
         "Zuzana Sulajová",
         "Jana Svandová"
      ],
      "reviews": [
         "Martin Sulik's poetic vision of reality offers an interesting probe into the relationship between an elderly father (Marian Labuda) and his son Jakub (Roman Luknar) in his early 30's. The main story is happening in the old garden, which belonged to Jakub's grand father. In this mysterious place he finds the peace he was looking for so desperately. What is even more important - the father and the son finally find the way to each other. Like in other Sulik's movies, the plot, story and tension are not the most important. This kind of poetic cinematography is more about the mood and quite hardly identifiable joy coming from \"no one knows what\". A timeless independent movie. Good work.",
         "I don't know what is making me to see this movie again and again. I think is something under the line I can not describe. For me it is absolutely amazing movie and all I can say about it is that you have to see it. It is not about being a masterpiece or having million dollar budget, it is about feelings that will stay inside you for a while after seeing this. I don't know if somebody can imagine to be in position of Jakub, but I would like to be on his place every time he is spending his time in garden where you can feel the touch of ages. I think for people outside of Slovakia it could be nice look into Slovakian way of thinking. Enjoy",
         "Every time I see this movie, my love for it grows. It is one of my treasures on VCR. It confronts you with life and living life, but not in a cynic way, which is often the case in film and literature. It shows the beauty and mystique of this world without being pretentious. The movie contains a great sense of humor, because humans are strange creatures with funny methods of approaching life and how they try to make sense of it. You have to love them for it, in spite or because of the mistakes they make.",
         "One of the best movies I have ever seen. A visually beautiful, modern fairy-tale. This movie can be enjoyed as a comedy with a witty plot and a perfect cast, and, as an essay in the history of culture with archetypical characters and situations. Sulik has a distinctive style of his own, which he continues to develop also in his latest work, \"Orbis Pictus\", but I think \"Garden\" is his best movie so far. If you ever get a chance to see it, do so - you will not regret.",
         "I absolutely love this movie. It gives you the feeling of entering a new dimension where the distinction between reality and fiction gradually vanishes. The powerful images of a mystical garden are dream like. It takes you to a place where you feel it touches your innermost wishes of tranquillity and peace. A dream within a dream, a fantasy that becomes reality. Let this movie take you to a place you never imagined existed and enjoy the ride.",
         "Jakub is a teacher living in a flat with his father. After some quarrels he is asked to leave. He found a place to live at his grandfather's raddled house among fields in the countryside. Jakub starts to live a calm life, repairing the house and big garden. From time to time he encounters strange visitors - man who wants to be saint and wants Jakub to wash his feet, man who exchanges his broken car for Jakub's pretty good car etc. And mainly he has one regular visitor....magical girl, Helena. Not working he's fired from his job and decides not to go back to the city. Sometimes his father comes to visit him and they relationship gets better. Jakub starts to teach at the local school and stays with Helena. Just watch the poetry of this jewel of Slovak cinematography. You're gonna love it.",
         "A beautiful movie, with a dreamlike feel to it. The main character is Jakub who has fallen out with his father and has moved into a ramshackle house in the countryside. There is an overgrown garden and orchard.It is organised in chapters like a book, as Jakub encounters various odd visitors to the house and garden. Don't expect much of a message or action, just sit back and enjoy.",
         "A film about origins and ordinary mysteries. About the nuances of childhood. About freedom. A school teacher and his father. A young woman. A girl. And a garden. A poem about roots and happiness. It is difficult to describe this movie. The story of Jakub is only self definition. Few parts, some characters as steps to real image of reality, trees and ants, magic and exile, knowledge and answers. Small drops of a spring rain. And the fly. It is a form of soul song. And shadow of lost ages. A fairy tall with taste of apples and summer vacation. Nothing complicated. Maybe, a Proust madlene. That movie type about nothing and all. A travel to memories and slice of silence. And nostalgics bones of a far world.",
         "Its not often that you see a movie, which you leave with two hearts in your breast, and your head filled with colourful words. And its not often that you can see a movie more than seven times, without noticing that the elements loose its magic one-by-one; without getting bored such as so easily happens when information gets repeatedly in touch with human conciousness. But this incredible mixture of reality and fairy-tale, filosophy and lightness, makes it all work in a film, of which you have the feeling that it always existed, like The Odyssee itself. And then there is that girl!",
         "Have you ever dreamt about Love ? The one which comes out of nowhere, turns your world upside down, heals all your wounds and gives your life a meaning ? Now this movie is about a love like this. It is a contemporary romantic fairy tale with a good sense of humor achieved by not taking itself too seriously. You won't regret seeing it.",
         "If you think movie in which nothing really happens must be boring... forget it. It's non-action and calm, but far from ,,artistic\" and ,,intelligents-only\" ones. It's hard to say what is it about (i have heard something about ,,seeking yourself\" :-), because you simply sit and watch and after the movie you find yourself smiling to people around you - without necessarily for thinking about ,,what it meant and what it means for me\".",
         "A marvelous tale of great beauty. It is advised to read 'Candide' (by Voltaire) as well (a very nice book indeed). This makes the movie even better. Saw the movie three times, and I expect the number to rise.",
         "Mysthicisme is not dead. The world is bigger than your imagination allows it to be. \" Let your mind go, and the rest will follow.\" This movie shows that, in places you don't expect, you can find bewilderment, amazement and spirituality. I was amazed that within it's simplicity, the film lets you experience nothing and everything.",
         "In Slovakian film, \"The Garden\" the joys of idleness are shown in a broader setting of a troubled father/son relationship which is depicted in a variety of poignant scenes. One of these scenes for which viewers might like have a difference of opinion features a hilarious situation wherein the tailor father starts to trouble his flamboyant son while he was busy making love to a lady who also happens to be his father's regular customer. Apart from this troubled episode of things not being well for father/son duo, director Martin Sulik has shown an equally distressed relationship between a carefree young lass and her authoritarian mother. He provides additional lighter moments by showing the irrelevant confrontation between the film's leading man and the cuckolded husband of his lover. The Garden also attempts to include some important philosophical lessons for viewers' intellectual pleasure but fails miserably as Martin Sulik carries out an absolutely bad job of choosing inappropriate actors to portray two great philosophers Jean- Jacques Rousseau and Ludwig Wittgenstein. This is probably the reason why philosophical sentences concerning these two great men would not be retained by viewers for a very long time. Lastly, the division of this film into various chapters also does no good at all as it merely adds up to a boring tale moving at a slow pace.",
         "Young professor of letters leads to a tired and (un) comfortable routine between the forced cohabitation with his father, an elderly tailor long a widower, and the pitfalls of a mature and unsatisfied married woman. He lived with the dilapidated and neglected country home of his paternal grandfather, rediscovers the unexpected delights of a bucolic life in the care of a garden flourishing and abandoned, the legacy of the ancestor wise farmer and the enigmatic and enchanting presence of a young and mysterious girl. Small moral fable-toned light and sparse, the story of Sulik is a delightful fable ecologist who runs backwards along the path neglected and unknown of a return to nature, to its biological cycles and mystery, its remedies and its consolations, the alienating wisdom and magical alchemy of a rediscovery of self. The echo of a submissive and patient recall atavistic moves from the silent shadows of a garden dormant ancestral to the wishes of the young protagonist as the haunting song of a comely and remote siren that promises sensual reward for hidden treasures and immodest virtue. Ideally divided into 14 chapters (with a title and description) proposes the metaphor explicit diary and secret, the diegesis of a process that goes through the steps required for a journey of discovery and renewed awareness (from the comforts of an indolent life home town and enlightening the simplicity of rural life by the rhythms of time and seasons), where the meeting with the symbolic figures and goggled of mysterious wanderers (the saint who recalls Francis, the natural philosopher that recalls Rousseau and the rationalist conceptual recalling Wittgenstein) is the unexpected event of the fantastic, an unexpected materialization of unconscious desires that embody the prototypes examples of virtue 'philosophers'. Keeping the log lighter than a moral comedy film of the Slovak filmmaker manages to keep a safe distance the easy duplication of the symbolism of a cryptic language and convoluted as is the tired cliché of the grotesque typical of the western film to orient towards the rather rarefied elegy Soviet cinema (Tarkovskji, Konchalovskji) both in the choice of some visual solutions and color (the plane of the prologue sequence that opens the heavy foliage of an apple tree overflowing with fruits never caught, the use of a photograph saturated that enhances the varied polychrome Slovak autumn but especially the final sequence of levitation supine illuminating a lovely hag) that the use of a musical texture suspended between the mystery of the inevitable and that of a revelation. In almost vividly illustrative minimalism of the episodes you can see the thread of a deep feeling and arcane, mysterious sense of the time and nature through the things and people transforming them into the elements of a new cosmogony, the busty sensuality of the female body as a symbol of ancient the fertility of the earth, in the encryption of a mirrored language that you write and you read through the reflection of the signs of the real world, in the allusive complementary symmetry of destiny (the binomial mother-daughter and the father-son). Sulik signing his work original and fascinating at the bottom of the painting that appears at the beginning of the film (in the 'House of Jacob'): the icon of a cubist sore and tortured Saint Sebastian. Special Jury Prize at the 1995 'Karlovy Vary International Film Festival' and the 'International Festival of Young Cinema of Turin' and winner of five Czech Lions in 1996.",
         "Dear pals, there are the pretty provincial cinemas, like the American, the Spanish, the German one, the Scandinavians; and the truly mature cinemas—like the French, Italian, Czech, Polish, Russian, Japanese cinemas. I wonder where the British one might fall in. now once we took up heavy theorizing I might break it to you as well that the meteoric appearances or the Halley comets in provincial cinemas—a Bergman, a Welles or a Buñuel \u0085--leave things pretty intact. ZAHRADA is the kind of thing that looks even better on paper only, as a draft, as a reverie. Martin Sulik is not one of the greats; but his small fantasy testifies for a cinema healthier that the commercial mainstream ones. As it is, ZAHRADA hints to a desire, to some secret aim some indulge in—the desire for a hidden wonderland. As ZAHRADA is a pretended mature comedy, this wonderland is strongly sexual. There is, in fact, some _truish ring to this ZAHRADA—Martin Sulik, the director, gathered some nice actors—one of them, Labuda, known from the '60s directors' outputs—for a dry fairy—tale; the idea being that a young man might find somewhere a realm that's even more magic and soothing than sex with a married woman. The budget must have been close to none; the atmosphere is healthy, and there are only six actors for the whole movies—two babes, two men, the creepy Rousseau (--with his wife—let's not count each bitty player) and one mum (well, one of the babe's also a mum \u0085). I liked the score; the two babes; Labuda's performance; Rousseau's intriguing role; the loose surrealism, no strings attached, no ambitions whatsoever either. The merry careless sexuality is very Czech. For a nasty surreal comedy, ZAHRADA is quite sensual and sexy; the babes are hot. Now Czech imagery is bathed in surrealism and bizarre comedy; and in this comedy there is also a wife with awesome tits, a MILF, as they call them \u0085. Breasts are basically the sincerest part of the woman's body; they are meant for babies, for lovers, etc.. They inspire and suggest sincerity, confidence, ingenuity. Now you'll get a pair of those in this friendly comedy."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Artcam International",
         "Charlie's Bratislava",
         "In Film Praha"
      ],
      "summaries": ["Jakub's life arrived at a dead-end. He leaves his job, and gets into conflict with his father. The trouble just grows by his relation with a married woman. Breaking out, Jakub realizes the pleasures of the countryside in the old garden of his grandfather. He finds true love with an angel, and encounters various exciting moments of his new free life. Strange visitors arrive, and he wont get back to town anymore."],
      "budget": 0
   },
   "movielensId": 153174,
   "movielens": {
      "languages": ["Slovenčina"],
      "releaseDate": "1995-06-09",
      "dvdReleaseDate": null,
      "directors": ["Martin Šulík"],
      "runtime": 99,
      "movieId": 153174,
      "title": "The Garden",
      "mpaa": "",
      "actors": [
         "Zuzana Šulajová",
         "Marián Labuda",
         "Roman Luknár",
         "Jana Svandová",
         "Katarína Vrzalová",
         "Ján Melkovič",
         "Stanislav Štepka",
         "Dušan Trančík"
      ],
      "imdbMovieId": "0115040",
      "originalTitle": "Záhrada",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jakub's life arrived at a dead-end. He leaves his job, and gets into conflict with his father. The trouble just grows by his relation with a married woman. Breaking out, Jakub realizes the pleasures of the countryside in the old garden of his grandfather. He finds true love with an angel, and encounters various exciting moments of his new free life. Strange visitors arrive, and he wont get back to town anymore",
      "tmdbMovieId": 19008,
      "avgRating": 3.58333,
      "releaseYear": "1995",
      "numRatings": 6,
      "posterPath": "/kl3wCMoIqWGIA10jkohheGi9NOu.jpg"
   }
}