{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0875130",
      "video": false,
      "title": "Love on Sunday",
      "recommendations": [],
      "backdrop_path": "/aZRacF8KDUPEohhsEjuUx1ecD8A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tamaki",
               "gender": 1,
               "credit_id": "52fe45a69251416c910398fb",
               "name": "Yuria Haga",
               "profile_path": "/tnYoNVxrly73R7B3BIwkX26DoHL.jpg",
               "id": 114304,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Akira",
               "gender": 0,
               "credit_id": "52fe45a69251416c910398ff",
               "name": "Takami Mizuhashi",
               "profile_path": null,
               "id": 114305,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gaku",
               "gender": 0,
               "credit_id": "52fe45a69251416c91039903",
               "name": "Kazunori Sasaki",
               "profile_path": null,
               "id": 114306,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Nao",
               "gender": 0,
               "credit_id": "52fe45a69251416c91039907",
               "name": "Ryuya Wakaba",
               "profile_path": null,
               "id": 114307,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a69251416c910398f1",
               "name": "Ryuichi Hiroki",
               "profile_path": "/7XZ5fdUUzPdNuGSZIgkseKUbv0q.jpg",
               "id": 78268,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a69251416c910398f7",
               "name": "Andrew Tamon Niwa",
               "profile_path": null,
               "id": 114303,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.078571,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 35451,
      "vote_count": 2,
      "budget": 0,
      "overview": "Akira had to transfer schools upon graduation because of her father's job. She was reluctant to move because of her secret love for Nao...",
      "similar": [],
      "original_title": "恋する日曜日",
      "runtime": 89,
      "poster_path": "/9y16kpweAEOhRbABflGLxnBzFDG.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "King Records",
         "id": 23399,
         "origin_country": ""
      }],
      "release_date": "2006-07-22",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Manabu Asô",
         "Ryuichi Hiroki"
      ],
      "runtime": 89,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0875130/",
      "coverLink": null,
      "actors": [
         "Mark Chinnery",
         "Yuria Haga",
         "Takami Mizuhashi"
      ],
      "reviews": [
         "I had the opportunity to see this at Nippon Connection Festival in Frankfurt/Germany and was quite surprised cause it has been a long time since I've seen a Japanese movie without Yakuza, sex, violence, slapstick or tarantinoesk gang-shootout. This one takes some time to get fully into gear, but after 20 Minutes the audience gets the connection to the four main characters which are teenagers in a town not far from Tokyo. SPOILER - These two girls and two boys are connected one to another in the way that every single one of them loves another one, so that their feelings \"build a circle\". A emotional tense situation that finds its release in a traditional Japanese bow-and-arrow-competition that will be interrupted surprisingly. SPOILER END - There isn't much to spoil about the story of the flick which is quite simple but profound. If you can remember the time in school and if you had a school-love, perhaps, you will find a sweetness in this picture, that will make you laugh and that will make you sad. The director Ryuichi Hiroki was present at the film festival and said that he wanted to see if other people could connect to the topic. I certainly could which is something I cannot say about many Japanese movies. After all Mr. Hiroki-san gets a 7 out of 10 for a beautiful little movie about school-times and school-love. Watch it. Verbal_K",
         "The beginning and end of Love on Sunday is nearly perfect. The director has a real talent for creating realistic teenage relationships in a world suffused with catchy Japanese pop rock music. Yet the middle chunk of the movie, while compelling, is an uncomfortable blend of realism and melodrama. The story is simple enough. Teenage Akira is about to move to Tokyo but before she goes she wants confess her love to best friend Nao. He is not only oblivious but is in love with popular girl Tamaki, who is still in love with ex-boyfriend Gaku, who is in turn in love with Akira. There are multiple twists and turns as each of the boys and girls compete for the affections of their crush. The melodramatic tendencies of this kind of story is tempered somewhat by the uniformly excellent performances of the young actors who make the cliché romantic dialog and somewhat unrealistic situations mostly believable. The use of rock music, and in some shots music video closeups though, belies the more realist aesthetic of the movie with its silent long shots. I left it slightly confused as to whether this was a mass-market film with an indie sensibility or an indie film with mass-market aspirations. The youthful energy of the film though is obvious. The actors look like they are the same age as the characters they are portraying. They have good chemistry and create a love quadrangle that is likely to make the film compelling to watch, regardless of its flaws."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["King Records"],
      "summaries": [
         "A girl is dying, Girl wants to recall her childhood and a childhood friend who is her crush. Girl leaves the city to her hometown and stays with a said childhood friend who is her crush. A childhood friend who is her crush wants to get married to someone who is already married with a child. she meets that child and they run away. It seems like she murdered the child but the child was just tired and sleeping near the beach. A childhood friend who is her crush gets mad at her, not knowing who of her illness. She runs away. a childhood friend that is her crush catches u with her and she, whilst on a bus, has a dramatic speech and cries and leaves to go home, possibly.",
         "Nagisa, a 17-year-old who has been given three months to live. Without telling her widowed father where she is going, she heads out from the city to the small town where she was born. She wants to recall her childhood memories, and reach out to her love for childhood friend Satoshi. However, she finds out that Satoshi is in love with a married woman named Eriko, who he himself wants to marry, Then one day, when Nagisa meets Eriko's daughter, Madoka, she ends up spending time with her at the beach. Nagisa later returns without Madoka and Eriko is unknown where her daughter is. Leaving everyone distressed.",
         "Akira had to transfer schools upon graduation because of her father's job. She was reluctant to move because of her secret love for Nao, a childhood friend. Nao, however, is head over heels for Tamaki. A farewell party is planned for Akira. She had longed to spend the final day with Nao, but oblivious to Akira's feelings, he invites Tamaki to the party instead. An argument ensues at the party, prompting Akira to leave. Akira cannot forgive Tamaki for playing with Nao's feelings. Then, a senior member of Akira's archery club and Tamaki's former boyfriend, Gaku comes into the picture."
      ],
      "budget": 0
   },
   "movielensId": 153262,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2006-07-22",
      "dvdReleaseDate": null,
      "directors": ["Ryuichi Hiroki"],
      "runtime": 89,
      "movieId": 153262,
      "title": "Love on Sunday",
      "mpaa": null,
      "actors": [
         "Yuria Haga",
         "Takami Mizuhashi",
         "Kazunori Sasaki",
         "Ryuya Wakaba"
      ],
      "imdbMovieId": "0875130",
      "originalTitle": "恋する日曜日",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Akira had to transfer schools upon graduation because of her father's job. She was reluctant to move because of her secret love for Nao...",
      "tmdbMovieId": 35451,
      "avgRating": 3,
      "releaseYear": "2006",
      "numRatings": 1,
      "posterPath": "/9y16kpweAEOhRbABflGLxnBzFDG.jpg"
   }
}