{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0422366",
      "video": false,
      "title": "The Guatemalan Handshake",
      "recommendations": [],
      "backdrop_path": "/sqQiICPe8bYejFWgy2pLap8Qh2R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Turkeylegs",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812966b",
               "name": "Katy Haywood",
               "profile_path": null,
               "id": 139003,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mr. Turnupseed",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812966f",
               "name": "Ken Byrnes",
               "profile_path": null,
               "id": 139004,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Donald Turnupseed",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129673",
               "name": "Will Oldham",
               "profile_path": "/failAZJ5Nowvg8TPmmTJ49qIOH6.jpg",
               "id": 77080,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sadie",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129677",
               "name": "Sheila Scullin",
               "profile_path": null,
               "id": 139005,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Ethel Firecracker",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f81296a9",
               "name": "Kathleen Kennedy",
               "profile_path": null,
               "id": 1179102,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Stool",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812967b",
               "name": "Rich Schreiber",
               "profile_path": null,
               "id": 139006,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Spank Williams",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812967f",
               "name": "Cory McAbee",
               "profile_path": null,
               "id": 87630,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ivan",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129683",
               "name": "Ivan Dimitrov",
               "profile_path": null,
               "id": 139007,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Barnard",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129687",
               "name": "Andy Nadler",
               "profile_path": null,
               "id": 139008,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Curtis",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812968b",
               "name": "Jim Ligons",
               "profile_path": null,
               "id": 139009,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Delabia",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812968f",
               "name": "VaLonda Harris",
               "profile_path": null,
               "id": 139010,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Lunchmeat",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129693",
               "name": "Sam Myers",
               "profile_path": null,
               "id": 139011,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Neckface",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129697",
               "name": "Andy Sheffer",
               "profile_path": null,
               "id": 139012,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Leonard",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812969b",
               "name": "T.J. Bream",
               "profile_path": null,
               "id": 139013,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Insurance Man",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812969f",
               "name": "Christopher Morse",
               "profile_path": null,
               "id": 139014,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4736c3a36847f81296a5",
               "name": "Todd Rohal",
               "profile_path": "/rTL6xavUBpxBoX8LBNruDjVpj1W.jpg",
               "id": 45421,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a1ba850925141033304bf34",
               "name": "Todd Rohal",
               "profile_path": "/rTL6xavUBpxBoX8LBNruDjVpj1W.jpg",
               "id": 45421,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba860925141032604f6ff",
               "name": "David Wingo",
               "profile_path": null,
               "id": 937895,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba868c3a3680b8d04d2d3",
               "name": "Richie Sherman",
               "profile_path": null,
               "id": 1296231,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a1ba86f0e0a264cc104c190",
               "name": "Alan Canant",
               "profile_path": null,
               "id": 1103632,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba878c3a3680b9a050c68",
               "name": "Jim McNamee",
               "profile_path": null,
               "id": 1930505,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba8840e0a264cd004dab1",
               "name": "Sage Rockermann",
               "profile_path": null,
               "id": 1930506,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba89cc3a3680b9d049eeb",
               "name": "Melissa Clarke",
               "profile_path": null,
               "id": 1930507,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba8a60e0a264cd004dad6",
               "name": "Sage Rockermann",
               "profile_path": null,
               "id": 1930506,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba8af0e0a264cc404b1a2",
               "name": "Marissa Ronca",
               "profile_path": null,
               "id": 1930508,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a1ba8ba925141032c04dc3b",
               "name": "Todd Rohal",
               "profile_path": "/rTL6xavUBpxBoX8LBNruDjVpj1W.jpg",
               "id": 45421,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba8c30e0a264cc104c1d9",
               "name": "Nicholas Panagopulos",
               "profile_path": null,
               "id": 1930509,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a1ba8cec3a3680b8f04d216",
               "name": "Jason Orfanon",
               "profile_path": null,
               "id": 1930510,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5a1ba8d6c3a3680b9304d86e",
               "name": "Megan Griffiths",
               "profile_path": null,
               "id": 303064,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.212142,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47510,
      "vote_count": 3,
      "budget": 0,
      "overview": "A mysterious power failure in a small mountain town coincides with the disappearance of one of its most eccentric young residents. Mystery piles upon mystery as his family and friends search for him, fail, and ultimately try to forget about him, an undertaking that results in many unexpected, and in some cases bizarre, effects on the town's already peculiar community.",
      "similar": [],
      "original_title": "The Guatemalan Handshake",
      "runtime": 98,
      "poster_path": "/vBtFeD3JnzXULCa7G2VK7LiCKho.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Little Fat Girl Productions",
            "id": 97842,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Amalgamated Filmworks LLC",
            "id": 97843,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Brainbox Productions Inc.",
            "id": 97844,
            "origin_country": ""
         }
      ],
      "release_date": "2006-01-23",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "The Guatemalan Handshake",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Todd Rohal"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Todd Rohal"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0422366/",
      "coverLink": null,
      "actors": [
         "Katy Haywood",
         "Ken Byrnes",
         "Will Oldham"
      ],
      "reviews": [
         "Rohal's first full length movie won awards at various film festivals. That being said, it does not make it enjoyable. The movie strings together stories from a small, obviously poor, rural town somewhere in the east coast (it was shot in Pennsylvania). The movie has been compared to Napoleon Dynamite, which I could see, if Napoleon Dynamite was really, really depressing. The main subject of the movie, Donald, disappears amid strange happenings at the town's power plant. He is never found (which isn't surprising, since no one is really looking for him), but his actions affect everyone. Except they don't, really. His girlfriend kills his pet turtle by throwing it off a cliff (so they can get a dog, because the turtle's shell is acidic and a dog would lick it and get sick) with no remorse. So Donald goes out to catch a dog for his pregnant girlfriend (who we are to assume is his, although it's never specifically mentioned). While he is tracking an old woman's lost dog, the dog whizzes on a power transformer and gets electrocuted. Donald takes the dog, parks his car in a field, and thus is gone from the movie. Some kids find his car and joy-ride it, selling it to a dealership, where the car is traded around town to the various characters. At the end of the movie, the car drives itself backwards to a park where an unsuccessful suicide victim drives it away. Through the middle of the movie, there is much overacting and unexplained occurrences (such as the woman who attends her own funeral, then later on is re-united with her dead dog -- which I would chalk up to her being dead the whole movie, except she interacts with a living character by giving him food), all overlaid by a decent soundtrack that overuses the sound of a didgeridoo. I love indie films, but this was poorly executed. There may be a vein of people who love this movie, but for the average viewer, it's a waste of time. Rent it before you buy it.",
         "My favorite musical group is the incomparable Feo Y Loco -- \"The World's Most Politically Incorrect Band.\" Among their many salaciously satirical songs is \"Why Do I Need You When I've Got My Hand?\" In a similar fashion one can say to Hollywood's myopic moguls \"Why Do I Need You When I've Got My HANDSHAKE?\" For fans of independent cinema everywhere, THE GUATEMALAN HANDSHAKE is exactly what movies should be and all too often are not. I've long been a huge fan of Todd Rohal (you can call me Vornado if you want). His short films comprise an eclectic body of work that has been honored at film festivals from coast to coast. In this, his brilliant feature film directorial debut, Rohal once again creates a maddening milieu for a host of Felliniesque characters to inhabit. Shot in Pennsylvania, HANDSHAKE is populated with some of the most quirky, heartwarming, poignant characters this side of the Susquehanna. I call this Pocono Pathos for lack of a better description. It is, yet again, a visionary viewpoint unique to this rising star -- a Rohalian world of folksy fun and fastidious fantasy where the Tilt-O-Wheel is probably the only thing seen on the level. In the tradition of his short films, Rohal continues to push more envelopes than the U. S. Postal Service in incorporating almost every cinematic trick imaginable to further his vision. This is risky business, indeed, but in the hands of a consummate filmmaker like Rohal the gimmicks work and the end result is more surprises than even March Madness can generate. Whatever you do, do not blink or you will surely miss something. HANDSHAKE requires Visine viewing -- one screening is definitely not enough to catch everything being thrown you way. Even the closing credits are fun: \"When in Pennsylvania, please take the time to visit Three Mile Island.\" You gotta love the sentiment. The production design by Jim McNamee and Sage Rockermann is noteworthy for not only the overall cheery look of the film, but for the many fun little extras they have meticulously embedded in scene after scene. Cinematographer Richie Sherman crisply lenses the whole thing. In fact, all facets of this production deserve kudos given the extremely low budget. Producers Marissa Ronca, Jason Orfanon and Nicholas Panagopulos have clearly put every penny on the screen. As you must surely have gathered by now, THE GUATEMALAN HANDSHAKE is a must-see for anyone who enjoys cinematic creativity and sagacious story telling. If you are tired of the boring, banal \"blockbuster\" fare fostered on the local Bijou, do yourself a favor and seek out this little gem. Compared to GUAT, the studios don't know squat... Robert A. Nowotny needtovent.com",
         "I originally saw this film at Slamdance, and it left me wanting more. While it's visually arresting, the ideas all seem brilliant but incoherent. I struggled with the puzzle for a year. It took me that long to come around to the conclusion that it didn't all have to add up. That unlike most cinema, where there's the thematic wrap-up at the conclusion... this film doesn't leave you with that same sense of Hollywood satisfaction. It jumps through characters each struggling with their place in the world; each slamming and being slammed in an unpredictable fashion. And this is what I was left with. Not a neatly wrapped present but an open box that's had its guts dumped all over the ground. This is a film that I imagine will get better each time you watch it. Familiarity with the huge cast of characters, and their relationships to each other will only assist with interpretation. But brain-candy aside, the moments in the film are enough to keep you smiling. 8/10",
         "You found the IMDb page because some piece of media out there made you more curious about this film. What everyone has told you is correct. This film is an absurdist masterpiece. Rather than referencing pop culture, Mr. Rohal and his creative compadres have created pop culture. It's so interesting and bizarre the film seriously could have been 6 hours long, and I would have been just as involved. Many films of this sort are lulled by either gaps in narrative or clever winks. There's none of that in this film. It's a vision so complete and detailed and so funny and truthful. Everything about this film is far better than it should be; whether it's the gorgeous cinematography, the beautiful music, the spot on performances. Even if the scene just follows a little girl wandering in her neighborhood-- it evokes that sense of an adolescent leisurely rural summer. Even though you can tell they didn't have a huge budget-- it was made completely without compromise. I cannot wait to see his next film. Do yourself a favor and don't rent, but BUY this DVD. You'll be lending it to all of your friends anyways.",
         "Watching this movie was so tedious and laborious that I think I would have enjoyed a punch in the stomach far more. Now this is an indie movie that you've probably never heard of, and for good reason too, but pray that you stay lucky and never accidentally see it. Who knows, someone may break into your home, tie you and your family up, and force you to sit through it. Once is torture, more could be lethal. This is like an un-funny version of Napoleon Dynamite... Except Napoleon Dynamite wasn't funny. Do yourself a favor and avoid this movie. You'll thank me. And yourself. And which ever God you believe in.",
         "\"The Guatemalan Handshake\" is a terrific story of loss and hope set against the backdrop of small-town Pennsylvania and the demolition derby. The idea of the demolition derby and its goal of being the last one still moving is played out in the various lives of the characters. Each of the characters suffers varying degrees of life damage and loss, from lost pets to missing children to forgotten combinations to broken limbs. But in the end, each of the characters has enough left to come out of his or her own personal demolition derby with enough motion to take the victory - pets (or likenesses thereof) return, locks come open, actual demolition derbies are won. The one main character who doesn't go through this is the young girl Turkeylegs, but she tells us at the beginning of the film that one day she's going to be the world's best demolition derby driver. She suffers too, but the narration implies that her race has just started and she's not yet at an age where she can find victory. The film is visually engaging and features a great soundtrack and ambient score that lends itself well to the film's internal ghost story, a character who disappears near the beginning of the film seemingly with few friends. Despite this and despite the fact that few people bother to look for him, his life and actions continuously touch everyone and everything in the film as though he is in every frame. I was not expecting the film to be uplifting (I saw a lot of press comparing it to \"Napoleon Dynamite\"), but it really was. It left me with a similar feeling to the movie \"Millions\" - though they are very different films, they both contain a strong sense of hope emerging from hardship. Don't be put off if you hear this labeled a \"quirky film\" and don't think quirky films are for you. This is a film with a very relatable (if not obviously so) story that really speaks to the basic human conditions of loss and recovery. Very worthwhile.",
         "Whatever \"The Guatemalan Handshake\" means in the title of Todd Rohal's offbeat comedy (I think) I certainly hope it has nothing to do with the sexually explicit definition the always helpful Urban Dictionary provided me with. However, let's say that the title stems from the graphic sexual fetish and that such symbolism of the practice exists inside Rohal's film. I would never know, for I could hardly extract anything from the film that acts like it doesn't want anything extracted from it at all. This is a peculiar picture that manages to make ninety-eight minutes feel twice as long and exists in that rare crack of cinema where films without an identifiable genre go and reside. The plot less endeavor that is The Guatemalan Handshake seems to merge the likes of Harmony Korine's Gummo, Jared Hess's Napoleon Dynamite, and Wes Anderson's Bottle Rocket to extremely eye-raising results. It opens with a power outage occurring right when a demolition derby driver (Will Oldham) abruptly vanishes from the small town he calls home. Following his disappearance, this ignites a strange series of events in the town, which seems to treat the demolition derby event as the all-encompassing purpose of their very existences. His pregnant girlfriend now feels more hopeless than ever, but determined to win the demolition derby and his father is a lonely wreck. One of the only characters the film decides to focus on for a decent portion of the time is Turkeylegs (Katy Haywood), a precocious kid who is attempting to find her missing friend. Haywood is a nice young talent, who plays confused and aimless rather well, however, the film's act of alienating its viewers makes it hard to come to the realization that she is in fact a young talent. Things happen in this film, and I challenge anyone who has watched it to explain them and justify them in a coherent way to which the entire project makes sense. It is a series of vignettes, all nicely photographed on the sunlit landscapes of Pennsylvania and through the warm-lens of Rohal, but each one of them shockingly vapid and baffling. The actions of the characters and the fact that there are several of them that are nearly impossible to connect with because of the lack of exposition and thought given to them is immensely contradictory to the way the whimsical environment of their home is so welcoming and natural. Imagine a beautiful resort with a sign that says \"come on in!\" with all the guests, workers, and tourists giving you the cold shoulder. At no point does The Guatemalan Handshake feel like a film about real people or even people that are halfway believable. They feel like the brainchild of a screenwriter giving as many obscure, colorful traits to people with names as he can think of. The result is a cold picture that purposely desensitizes its material to make it almost inaccessible and unrelatable to the average viewer. At the end, the only thing I could extract from the film is that may be trying to comment on the loneliness of rural areas. Even if that is the case, and the film's ultimate goal is to detail how being surrounded by almost nothing can lead to a person's housing nothing remotely significant, the film doesn't do a great job of making this clear or meaningful. Todd Rohal's sophomore directorial effort was another strange piece called The Catechism Cataclysm, about a priest who reconnects with an old classmate and then proceeds to go on a canoe trip with him down a small river. The film quickly descended into a surrealist piece of work, which began to give off the vibes that you really aren't supposed to like it no matter how hard you try. Rohal used similar tactics of alienating the viewer by giving a rather unbelievable setup and an annoying lead character, but wound up making the film work on some level because of its stunning lyrical conversations between its two leads. The Guatemalan Handshake doesn't even have the benefits of lyricism in its writing; the only thing marginally poetic is the sunsoaked landscapes that begin to feel all too familiar way too quickly. There is one great scene in the film, however, and if only it made something of a vision or a purpose clear. It involves an elderly women who has been looking for her dog the entire film, plastering signs around town and trying to get the townspeople searching. At one point in the film, she notices she is in the obituary section of the newspaper and is seen attending her own funeral. Despite this, the character still returns later in the picture, in another scene similar to the aforementioned one that is supposed to be relevant in someway and so on and so forth. A film is a terrible thing to waste, and Rohal unfortunately sacrifices humanity and commentary in The Guatemalan Handshake for oppressive weirdness and scenes with no clear purpose. Starring: Katy Haywood, Ken Byrnes, Kathleen Kennedy, and Will Oldham. Directed by: Todd Rohal.",
         "...everything that's wrong with \"indie\" film. This is a hatefully pretentious, yet mind- bogglingly stupid film, made more maddening by the apparent size of the budget. It's as if the director sat down and wrote a list of the hundred quirkiest things he could think of, and then just strung them together into a \"screenplay,\" thinking he was too much of an artiste to worry whether it made sense, or meant anything, or had any connection whatsoever to the experience of real human beings. 'Cause to try to actually reflect real life or tell a real story is so cliché, right? The truth (apparently lost on most adherents to this unfortunate genre) is that \"indie\" films have been around long enough to have their own catalog of clichés, and this movie is nothing but cliché, cliché on top of cliché with cliché garnish. It's like every character works at Tchotchky's, but instead of flair, each one has to wear fifteen pieces of cliché. Todd Solondz would think this was indie garbage. I've seen reviews that praise this film's multitude of interesting characters. In fact, every scene is about the same person: the director. He seems to be constantly insisting how quirky, how indie, how profound he is. Well, anyone can write an eccentric character. What's difficult is to make an eccentric character believable as an inhabitant of planet Earth, an achievement the director does not even attempt. There are no back stories, no explanations for how these people became who they are or why they feel the way they do. It's just a pile of writer's invention, and we're supposed to be impressed--nay, moved by it. It's not moving, it's not funny, it's totally intellectually lazy, and wretchedly proud of itself. The most hateful thing about movies like this is that their only goal (as far as I can tell) is to deceive. To deceive audiences, critics and festival-goers into thinking that the director is a profound and creative man, a complex individual whose scope of imagination is matched only by the intensity of his empathy. Baloney. This was not a story that was dying to get out, nor a reflection of deep seated passions, nor a portrait of hometown nostalgia. It was an exercise in narcissism by someone who treats the art form like his vanity table. But people buy it. The reviews are mostly good. The user comments on this thread are unfathomably adulatory. What can one say? People are gullible. And stuff like this intimidates them into thinking they liked it. I didn't. I hated it. Can you tell? The cinematography was good.",
         "Underneath the initial exterior---humor and absurdity that is, The Guatemalan Handshake is a true movie with such depth in themes, characters, and perspectives that it will make you laugh and scathe you at the same time. Throughout T.G.H, the narrative scenes are presented to us objectively, and while there's great humor, the kind where we as an audience choose to laugh because of our own judgment, that same stylistic approach that's present throughout the whole movie progressively has an entirely different effect where we see for the first time, not through our own eyes, but through Ronald's. The ending at the same time resolves nothing, and everything, or to be more accurate, shows us that there was never anything to be resolved in the first place. This movie is one of my favorite movies released this year, and a movie for its genre, one that's unmatched in complexity, dialogue, and in character development. There is so much in this movie that's revealed to the audience on several different levels that while very entertaining, requires the viewer's patience as we are there only to watch, and only until the attend do we really understand and in turn think back in nostalgia. This movie, is a must see.",
         "...so this one has to be quick. If you want a film that gives you titties (sideboob, nip slip, or full frontal) and explosions, there are films for you. These films will make you say, \"F*** yeah!\" while you quietly fart, turn over the Nova, and drink the flat Coke from yesterday's Valu-meal. If you want a film that envelopes and warms you like an old sweater while you cry as you are reminded about the boyfriend who took your b-card and then ran off with the hostess at Applebees's, there are films for you. This film will not provide you these experiences. This film will leave you wonderfully bewildered. If you're looking for the other types, get off this message board, haul your cookies to the latest Hollywood video, and pick the first thing that is eye level and shut the hell up because I've action figures to catalog and I do not have time to weed through your pseudo-film critic crap.",
         "I find few films truly memorable, but this is one I haven't been able to shake off. There is something disruptive about this film. The untidiness of the story together with the bright summer colors and low economic status of the characters gives the film a tone of reality. The oddity of the characters, their inexplicable choices, and supernatural events give the film a dream like quality. The film does an incredible job of playing with our value system. Things are stolen, lost, and killed, but nothing is permanent. The film does manage to resolve many of the subplots by the end, but this is mainly by inference. The nuclear power plant seems to interact with the people in the story via power lines and the electric car."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Amalgamated Filmworks LLC",
         "Brainbox Productions Inc.",
         "Little Fat Girl Productions"
      ],
      "summaries": ["A mysterious power failure in a small mountain town coincides with the disappearance of one of its most eccentric young residents. Mystery piles upon mystery as his family and friends search for him, fail, and ultimately try to forget about him, an undertaking that results in many unexpected, and in some cases bizarre, effects on the town's already peculiar community."],
      "budget": 0
   },
   "movielensId": 153238,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-01-23",
      "dvdReleaseDate": null,
      "directors": ["Todd Rohal"],
      "runtime": 98,
      "movieId": 153238,
      "title": "The Guatemalan Handshake",
      "mpaa": "",
      "actors": [
         "Katy Haywood",
         "Ken Byrnes",
         "Will Oldham",
         "Sheila Scullin",
         "Kathleen Kennedy",
         "Rich Schreiber",
         "Cory McAbee",
         "Ivan Dimitrov",
         "Andy Nadler",
         "Jim Ligons",
         "VaLonda Harris",
         "Sam Myers",
         "Andy Sheffer",
         "T.J. Bream",
         "Christopher Morse"
      ],
      "imdbMovieId": "0422366",
      "originalTitle": "The Guatemalan Handshake",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A mysterious power failure in a small mountain town coincides with the disappearance of one of its most eccentric young residents. Mystery piles upon mystery as his family and friends search for him, fail, and ultimately try to forget about him, an undertaking that results in many unexpected, and in some cases bizarre, effects on the town's already peculiar community.",
      "tmdbMovieId": 47510,
      "avgRating": 2.1,
      "releaseYear": "2006",
      "numRatings": 5,
      "posterPath": "/vBtFeD3JnzXULCa7G2VK7LiCKho.jpg"
   }
}