{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0390005",
      "video": false,
      "title": "Finisterre",
      "recommendations": [],
      "backdrop_path": "/7j9RWv0LmR0ncVM7N5g4GhSRQ1Y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "56080adb925141305e004d1e",
            "name": "Paul Kelly",
            "profile_path": null,
            "id": 1117039,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.002356,
      "production_countries": [],
      "id": 182991,
      "vote_count": 0,
      "budget": 0,
      "overview": "London has always been a source of influence, inspiration and curiosity - Finisterre tries to identify the dreams that London holds for so many. Presented and scored by Saint Etienne, the film enraptures with a journey through the ultimate city of possibilities - from John Nash and Berthold Lubetkin to Hendon FC and Hampstead Heath via the New Piccadilly cafe. A genuinely moving meditation on the capital in all its tawdry glory, with extra features and deluxe booklet",
      "similar": [],
      "original_title": "Finisterre",
      "runtime": 57,
      "poster_path": "/hlBjHLAkHgTFQvM2mPWhiZ1twwL.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2003-05-22",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "A film by Saint Etienne about London.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": [
         "Kieran Evans",
         "Paul Kelly"
      ],
      "runtime": 57,
      "synopsis": null,
      "writers": [
         "Kieran Evans",
         "Kevin Pearce"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0390005/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ4OTAxNjQyNl5BMl5BanBnXkFtZTgwMDE0NzcyNDE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Vashti Bunyan",
         "Vic Godard",
         "Andy Hackett"
      ],
      "reviews": [
         "As a fan of St Etienne, I was looking forward to seeing this but I'll admit to being a little disappointed, there wasn't really enough of their music to make it essential for me. The portentous voice over was a little too \"Little Britain\", and although the film started well, the eulogising over London started to become irritating towards the end. Phrases like \"Anyone with any ambition at some point moves to London\" won't go down too well outside the M25. Still, what there is of the St Etienne soundtrack is predictably good, and there are enough interesting shots of London to make Finisterre worth viewing. I'd recommend it to anyone who's a fan of the band, or who's interested in seeing the less touristy side of London.",
         "Anyone familiar with the music of Saint Etienne (who provided the soundtrack, and whose Bob Stanley co-wrote the script) will instantly recognize their input into this film: the referencing of classic pop lyrics, the obsession with London, at once mythologising and yet very honest. A documentary about London- its buildings its people and the magic it holds, Finisterre can draw comparions with the films of Patrick Keiller. This, however more accessible and has some lovely (albeit rather brief) interviews and reflections from artist Julian Opie, recording studio owner Liam Watson, and musicians Lawrence (from Felt) and Vic Godard (from Subway Sect). Never shying away from showing uglier sides of the city, but managing to find beauty in them, Finisterre is a very entertaining and quite magical documentary.",
         "As others have noted, it's the narration that bogs this down. I know Saint Etienne make nods to the 1960s, but it's that fruity male voice that seems to belong to the kind of Government-funded supporting feature you sat through in the cinema as a kid while you waited for the Bond film to start. Your main course before you're allowed dessert. Question is, were the makers doing in this deliberately? Is it meant to be ironic? Many of the shots in this piece are timeless; Primrose Hill, the canal in Camden, which do add to the feeling that this could have been done in the 1960s. Again, maybe this is deliberate but it does seem a bit pointless; it's hardly a time capsule. Some of the visuals are lovely, the sort you see in the C4 show Skins, but without any drama, you may as well be clicking through photos on your laptop machine, nice as they are. Backed by the band's rather tinny, bloodless music, they succeed for the first half in making London about as exciting as Saint Etienne's hometown, Croydon. It does pick up a bit from Primrose Hill onwards but this is overall a strangely distant, antiseptic treatment of the capital. Recalling it the next day is more enjoyable than sitting through it at the time.",
         "The cameras are not state of the art and there are few tracking shots - not surprising with it having been made on such a tight budget - but they still could have made better use of the resources available. The impact of some sequences is weakened by excessive cutting. Potentially majestic images, such as construction cranes against the sky, are often only in shot for about two seconds before we cut to something else, which seems entirely the wrong approach aesthetically if you trying to make a dreamy, contemplative film rather than an extended pop video. Despite these flaws, good use is made of St Etienne's songs, and the imagery accompanying them is agreeable enough, although rarely breathtaking. If you expect a documentary to impart information or give you a radical perspective on familiar subject matter then this is definitely not for you. But if you've simply had an awful day at work and you need something to relax with, providing minimal intellectual and emotional stimulation, then Finisterre could hardly be more perfect. Bland, but soothing, it's best thought of as digital lavender oil, or perhaps the film equivalent of listening to the shipping forecast.",
         "Beautifully shot by Kieran Evans and Paul Kelly and magnificently orchestrated by Saint Etienne, \"Finistere\" is one of a kind documentary, an hour long love song dedicated to an amazing city. \"Finistere\" is a trip throughout Londonium circa 2003, from all angles, from all backgrounds, from bad to worse, from good to ecstatic, from simple to sophisticated, from cup a tea to pint of biter,from grim council estate to lavish penthouses, from dusk till dawn and back. Saint Etienne have always been proud Londoners and their music is a perfect fit to the poetry of the constant narration of Michael Jayston, to the inspiring series of living postcards unveiling the secret heart of the city and to the earnest commentaries of Londoners about their true home. \"Finistere\" is indeed a love song to London as that true love implies acceptance of its object's flaws. The documentary suggests that London isn't perfect and that is most certainly what makes this love even more potent. As far as travel documentary goes, it doesn't get any better than that: all London is right here.",
         "Being a fan of Saint Etienne and the City of London, I was very excited to see this movie on the list of the Vancouver International Film Festival. This movie has great shots, an absolutely excellent soundtrack and interesting insights into a 'not so well known' London. The movie is held completely in 'dark' colours, which I personally don't like too much. Furthermore the narration was a little too British and the comments sometimes got a little flat. Other than that, there are some great comments by Londoners and excellent shots. FINISTERRE doesn't glorify London by showing all the great attractions of the city, but rather gives deep insights in what London is really like. From the East end to the vibrant centre with its music scene as well as the 'special little retreats' for Londoners. All in all: +Great Soundtrack +Nice shots +great insights -Narration -Tiering to watch at times -Very dark picture Worth watching! I give it a 7/10",
         "This film is a series of snapshot of London viewed through the eyes of a British band, Saint Etienne. I am a Saint Etienne fan. I remember \"Finisterre\" being released on DVD back in 2003, and it was on the shelves for 17 pounds. I thought the price was steep so I did not buy it. After seven years, I finally got to watch the film. And, wow, I am so disappointed by it. \"Finisterre\" is a collection of shots filmed in London. It can hardly be called a film. There is no plot. I find it so boring to sit through minutes of graffiti, bicycles and uninspiring council blocks of London. It does nothing to promote London, actually people might get put off by it. I don't understand, why would Saint Etienne present London's unglamourous side when they are obsessed with it? \"Finisterre\" seems to be a self indulgent project. I guess the meanings behind the shots can only be comprehended by the filmmakers and the band. I am so glad I did not buy it when it first came out."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "CC Lab",
         "Heavenly Films"
      ],
      "summaries": ["London has always been a source of influence, inspiration and curiosity. Paul Kelly and Kieran Evans' FINISTERRE tries to identify the dreams that London holds for so many, and the reality of the city -- the spaces between the landmarks, the spaces Londoners inhabit. Presented and scored by Saint Etienne, the film takes us on a journey from the suburbs into the heart of the city over an imaginary 24 hours. Along the way we hear from characters that have influenced or been a part of the Saint Etienne story. FINISTERRE features the observations and reminiscences of Lawrence from Felt/Denim, Mark Perry, the editor of original punk fanzine Sniffin' Glue, as well as Vic Godard from Subway Sect and artist Julian Opie, folk singer Vashti Bunyan, London-centric author Shena Mackay, and Nick Sanderson from Earl Brutus. Through the interviews and imagery we see London from an insider's perspective. The result is a hymn to London, and an extraordinary record of the city today. Digitally shot and edited, FINISTERRE evolved alongside the Saint Etienne album of the same name. Initially conceived as a way of channelling the money allocated for music videos into something more substantial, it became in every sense an independent production. Its development is unique: early sequences were projected as visuals behind the band during their latest tour, while the film played recently to cinema audiences in London and Tokyo."],
      "budget": 50000
   },
   "movielensId": 153228,
   "movielens": {
      "languages": [""],
      "releaseDate": "2003-05-22",
      "dvdReleaseDate": null,
      "directors": ["Paul Kelly"],
      "runtime": 57,
      "movieId": 153228,
      "title": "Finisterre",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0390005",
      "originalTitle": "Finisterre",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "London has always been a source of influence, inspiration and curiosity - Finisterre tries to identify the dreams that London holds for so many. Presented and scored by Saint Etienne, the film enraptures with a journey through the ultimate city of possibilities - from John Nash and Berthold Lubetkin to Hendon FC and Hampstead Heath via the New Piccadilly cafe. A genuinely moving meditation on the capital in all its tawdry glory, with extra features and deluxe booklet",
      "tmdbMovieId": 182991,
      "avgRating": 4,
      "releaseYear": "2003",
      "numRatings": 2,
      "posterPath": "/hlBjHLAkHgTFQvM2mPWhiZ1twwL.jpg"
   }
}