{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0910935",
      "video": false,
      "title": "A Parting Shot",
      "recommendations": [],
      "backdrop_path": "/gRB6MQ6iLPoAk83FeNpJ0MlG4Ns.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Fred",
               "gender": 1,
               "credit_id": "52fe46f3c3a368484e0acc83",
               "name": "Isild Le Besco",
               "profile_path": "/6BlUwhWTlQk78pyTHeTbA2yr269.jpg",
               "id": 151180,
               "order": 0
            },
            {
               "cast_id": 1022,
               "character": "Eugenia",
               "gender": 1,
               "credit_id": "52fe46f3c3a368484e0accd9",
               "name": "Lio",
               "profile_path": "/uryhG58e60FuwCifYovolyo7nkq.jpg",
               "id": 130712,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Marco",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc87",
               "name": "Steven de Almeida",
               "profile_path": null,
               "id": 572237,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Miguel, le père de Marco / Marco's father",
               "gender": 2,
               "credit_id": "52fe46f3c3a368484e0acc8b",
               "name": "Yves Verhoeven",
               "profile_path": "/zj1N6PEmJWGQlfbC7SigdjXhFyP.jpg",
               "id": 77195,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Le commissaire",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc8f",
               "name": "Michel Raskine",
               "profile_path": null,
               "id": 572238,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Rita",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc93",
               "name": "Jocelyne Desverchère",
               "profile_path": "/95nYyiwFEHazubh0uLh8ns7twSI.jpg",
               "id": 572239,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Jérémy",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc97",
               "name": "Maxime Kathari",
               "profile_path": null,
               "id": 572240,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "L'infirmière rousse",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc9b",
               "name": "Sylvie Huguel",
               "profile_path": null,
               "id": 94693,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "Le père de Fred",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc9f",
               "name": "Philippe Vuilleumier",
               "profile_path": null,
               "id": 572241,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "L'ami du père",
               "gender": 2,
               "credit_id": "52fe46f3c3a368484e0acca3",
               "name": "Christian Sinniger",
               "profile_path": "/gfIjB6MPRd2yq25BnTjyMEvYaEF.jpg",
               "id": 21664,
               "order": 9
            },
            {
               "cast_id": 1012,
               "character": "Garçon tir",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acca7",
               "name": "Caryl Minder",
               "profile_path": null,
               "id": 572242,
               "order": 10
            },
            {
               "cast_id": 1013,
               "character": "La fille de Rita",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accab",
               "name": "Romina Tahami",
               "profile_path": null,
               "id": 572243,
               "order": 11
            },
            {
               "cast_id": 1014,
               "character": "Renate",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accaf",
               "name": "Estelle Bealem",
               "profile_path": null,
               "id": 572244,
               "order": 12
            },
            {
               "cast_id": 1015,
               "character": "Le Blessé Ivre",
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accb3",
               "name": "Bernard Nissile",
               "profile_path": null,
               "id": 49277,
               "order": 13
            },
            {
               "cast_id": 1016,
               "character": "André",
               "gender": 2,
               "credit_id": "52fe46f3c3a368484e0accb7",
               "name": "Christophe Sermet",
               "profile_path": null,
               "id": 438290,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0acc7f",
               "name": "Jeanne Waltz",
               "profile_path": null,
               "id": 572234,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f3c3a368484e0accbd",
               "name": "Didier Haudepin",
               "profile_path": "/gsB2S3UBbLoYvFuda9FMW0OkyTC.jpg",
               "id": 19615,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accc3",
               "name": "Pierre-Alain Meier",
               "profile_path": "/eX5f156mLHKhVyYNB5woDS3yDP1.jpg",
               "id": 64628,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accc9",
               "name": "Cyril Ximenes",
               "profile_path": null,
               "id": 572245,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accd5",
               "name": "Eric Renault",
               "profile_path": null,
               "id": 407465,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f3c3a368484e0accdf",
               "name": "Jeanne Waltz",
               "profile_path": null,
               "id": 572234,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5506a298c3a36862e50041d7",
               "name": "Hélène Louvart",
               "profile_path": null,
               "id": 56289,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59cbe37ac3a36877970164da",
               "name": "Bruno Dupuis",
               "profile_path": null,
               "id": 1895762,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59cbe380c3a36877a901463b",
               "name": "Marie-Christine Lafosse",
               "profile_path": null,
               "id": 36126,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59cbe3889251412be1013cb3",
               "name": "Françoise Arnaud",
               "profile_path": null,
               "id": 1178578,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59cbe3909251412b8f015642",
               "name": "Isabelle Blanc",
               "profile_path": null,
               "id": 1895763,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59cbe3979251412b8f01564c",
               "name": "Catherine Schneider",
               "profile_path": null,
               "id": 1432512,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.13532,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 64944,
      "vote_count": 0,
      "budget": 2700000,
      "overview": "A rebellious teenager and a \"border-line\" young nurse will learn to tame each other and get a fresh start in life...",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         540,
         112160,
         858,
         141,
         634,
         376867,
         394117,
         297762,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532
      ],
      "original_title": "Pas Douce",
      "runtime": 84,
      "poster_path": "/qNrNmgzS9tiqEGI9eO57vLniISw.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fonds Culturel de Suissimage",
            "id": 78505,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bloody Mary Productions",
            "id": 23330,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Prince Film",
            "id": 95504,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Télévision Suisse-Romande (TSR)",
            "id": 8453,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rhône-Alpes Cinéma",
            "id": 1666,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Centre Européen Cinématographique Rhône-Alpes",
            "id": 22319,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Office Fédéral de la Culture",
            "id": 21990,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2007-05-30",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Jeanne Waltz"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Jeanne Waltz"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0910935/",
      "coverLink": null,
      "actors": [
         "Isild Le Besco",
         "Lio",
         "Steven de Almeida"
      ],
      "reviews": [
         "Ia small mountain town Isild Le Besco's character, Fred (Frédérique) is an angry young woman working on the night shift at a hospital. As a nurse, she's efficient but remote. She's fed up with her life. Says she \"can't take it any more.\" When she talks to her cop ex boyfriend André (Christophe Sermet) about leaving town, he makes her even madder when he admits he's already got a new girl living with him. In reaction she picks up two men in a bar and has quick sex with one after the other. \"Couldn't you be more tender?\" the first asks her. \"Have you heard? I'm not tender,\" she tells the second (\"T'as entendu? J'suis pas douce.\") That's the film's original French title: 'Pas Douce'. Not Tender. Fred is a crack shot, a champion marksman when she was younger. She's also mad at her dad (Philippe Villeumier), a commanding presence and a supervisor at the firing range where she practices. As striking an actress as she is striking looking (when she's properly used), Le Besco is as obsessively angry here as she was obsessively adoring of the famous singer in her role as a naïve fan in Emmanuelle Bercot's 2005 Backstage, but here, though still just in her mid-twenties, she has more authority. Just when Fred seems to be getting ready to leave town as she's told André she's about to do, throwing away her junior marksman silver cups, she suddenly takes up her rifle and goes out. She's on a hill in the woods when a bunch of school kids walk by below her. Two aggressive boys are yelling at each other. One has a slingshot. He shoots a bird, then when the other boy protests, shoots him and hits him in the eye. Impulsively Fred swings her rifle toward them and fires, hitting the boy with the slingshot in the knee after grazing the boy holding his eye. An ambulance comes. She rushes after it in her car. The boy with the damaged knee, Marco (Steven De Almeida), is put in the ward where Fred works. After some rough moments on both sides, Fred commits herself to Marco's care. This development is justified in the plot by the fact that he's so hostile and difficult no other nurse wants to deal with him. A relationship develops that tempers the rebellion of both individuals. Fred's plan to leave town goes on hold; she still has to decide what to do about her legal culpability. As Marco's care proceeds, both he and Fred soften. Fred opens up to Marco's divorced parents, including a mother Eugenia (Lio) returned from Portugal, and his dad with whom he lives (Yves Verhoeven). The history of family problems Marco comes from is deftly sketched in, as are several other occupants of the hospital room, always with an alteration in Marco. Marco and Fred relate in part through PlayStation. She's good at that, so she's cooler than he thought. If you asked what makes 'A Parting Shot' different from something on an American TV series, the quick answer would be Le Besco's breasts. As in Jacquot's recent Untouchable, they're seen and they are beautiful. But there's more to it than that. The initial rebellion is outlined rather quickly for both characters, but the short (83-minute) film still manages to be subtle at showing the emotional changes in both these wild children after the shooting. Perhaps the best thing about the film is it doesn't tie up all its threads neatly as a TV drama might. Le Besco's pouty manner can be irritating sometimes, but this is a role made to order for her. De Almeida is also excellent. His Marco is a handful but also, behind the anger, winningly vulnerable. Ultimately A Parting Shot, far from not tender, leaves one with an impression of surprising tenderness. ''A Parting Shot'/'Pas douce' was awarded the Fipresci (international federation of film critics) Prize at the San Francisco International Film Festival 2007. This is the Swiss-born Waltz's first feature-length film, and it promises good things to come.",
         "Frederique is a sexy, bolshy and slightly dangerous young woman. I am annoyed with myself that I find her slightly attractive. There is a simmering sexuality. As if her hormones are on adrenalin. As if her desire, whatever it is, will brook no obstacle. As if it rules her life. Not the sort of woman to get involved with if you can help it, I think. It's like she has a permanently bad case of PMT. She's a nurse. Planning to pack it all in a week from now. A patient has just died. Bl**dy nuisance. But I start to suspect that Frederique's aggressive exterior conceals a lot of emotional turbulence. Maybe pain. But not that she's likely to let anyone know. She believes in the tough exterior she's created for herself. Frederique tries to relax after work. She's an expert shot with a rifle. Nice hobby. Carelessly leaves her gun on the back seat of a car sometimes though. She has an emotionally unsatisfying confrontation with her ex. Goes to a bar and gets p*ssed. Gets off with two men. Yes, both of them. Now comes the bad bit. No, nothing to do with those two d*ckheads she's just bedded. They haven't even begun to slake the anger that's boiling over inside her for no particular reason. Out in the woods a couple of schoolchildren, early teens, are taunting each other. Why is Frederique there? We don't know yet, but she can't take her eyes off these boys. One of them has a catapult. He shoots a bird. Then he shoots his friend. Then Frederique shoots him. Parting Shot is about dealing with anger, about finding epiphany, about forgiving others - and oneself. Frederique lies to the police and isn't discovered. But (possibly worse) the boy, his knee badly injured from the rifle shot, is in her ward. Her attempts to get him transferred fail. Slowly, the two of them form a strange bond. In helping him to deal with his pre-teen angst she is able to face her own anger, as well as the shock and self-reproach she suffers: the results of her unpremiditated action are sinking in. Hospitalised and eventually opening up, when our catapult-wielding lad says he only wanted to hurt his pal \"at the time\", something clicks inside Frederique. But then he begins to suspect her. The main problem with Parting Shot is believing in the character of Frederique. She hides many complex contradictions. Passionate but emotionally detached. Surface normal but deeply troubled. Is her isolation the result of modern day pressures we all feel to a degree? Once we can accept her, Parting Shot becomes a fascinating meditative study for anyone that has ever felt themselves in the grip of uncontrollable passion, rage, frustration. Or simply wanting to vent one's anger against the universe for no particular reason. (Note to IMDb - it would be helpful to know what words you consider 'prohibited' - otherwise one has to make random guesses and just splatter a review like this with asterisks)",
         "A Parting Shot (Pas Douce, \"not tender\", in French) is a strange little film: not fully convincing, but not boring either. Constantly juggling profound psychological analysis and contrived simplicity, it ultimately leaves the viewer with nothing new, its short running time, steady pace and gritty performances ensuring, however, that it flows quickly without exasperating. The original title refers to the female lead, Frédérique (Isild Le Besco), a lonely, mentally unstable nurse who lives in a small Swiss town. To be more specific, \"not tender\" is how some bloke describes her when she engages in casual sex with him and another guy. Why she does that is never explained. The same goes for the following scene, where she hides in a wood and decides to kill herself with a shotgun. Weirdly enough, the bullet winds up injuring a young boy named Marco (Steven de Almeida), and just to make things more ironic, she is among the nurses who are asked to take care of him. The premise is admittedly fresh and intriguing, offering plenty of ideas for a solid drama. Alas, for some reason director Jeanne Waltz opts for opening a couple of subplots without exploring them any further, depriving the film of meaning and resonance. What, for example, is the point of introducing Marco's parents and their supposedly troubled marriage and then ignore the whole situation for the rest of the movie? Similarly, some room is offered to Frédérique's boyfriend, but with no explanation of her unhappiness and his possible role in it those scenes come off as hollow and pointless. Another flaw is the shooting scene that triggers the entire movie (pun intended): reading the plot synopsis, I expected a certain sequence; what I saw was so different and ridiculous (I will not reveal any details, see for yourself) it almost ruined the mood of the feature. Fortunately, the few bits where perpetrator and victim interact are enough to keep the film on track, Le Besco's ambiguous stare and de Almeida's contained rage completing each other in a bond that effectively saves A Parting Shot from being the usual simple-minded, arty piece of work that tries to reach the heart without even knowing where it is. 6,5/10",
         "I can kind of understand why some would not like this movie. You could certainly accuse it of being pretentious, except I don't know exactly what it is \"pretending\" to be. You could also accuse the lead actress, Isild Lebesco, of chewing up the scenery at times, but this isn't so much overwrought performance on the part of the actress, as it is the strange character she plays, who seems to do one aimless, impulsive--and often destructive--thing after another, often with completely opaque motives. LeBesco plays a nurse and former female shooting champion. She's cold and abrasive to her patients and co-workers, bitterly estranged from her father, a burden on her protective sister, and very sexually aggressive but \"not tender\" (as the French title of this translates). After breaking up with a boyfriend, she goes in the woods with her rifle to commit suicide, but instead ends up impulsively shooting a troubled young boy, who is as hostile and disagreeable as she is. When he winds up under her care at the hospital, they end up bonding and both become a little bit more \"tender\". Isild Lebesco is one of the most interesting young French actresses. She is not a classical beauty--she's rather ordinary looking in the face, and even unattractive from some angles. Her body though is positively stunning (which is perhaps why she's had nude scenes in about every movie she's been in since appearing in \"Gilrls Can't Swim\" at 17). She also has a strange charisma that always makes her watch-able, even though I don't think she's ever been in a movie that really fully takes advantage of her talents. This movie has her blasting away with a hunting rifle, riding a bike straight down a hill and into a lake (without the benefit of a Hollywood stunt double), and having wild sex with two guys at a time. But her performance becomes much more subtle and nuanced by the end. She really carries this whole film, and while it's not exactly good, she certainly makes it interesting at least."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bloody Mary Productions",
         "Prince Film",
         "Télévision Suisse-Romande (TSR)"
      ],
      "summaries": ["A rebellious teenager and a \"border-line\" young nurse will learn to tame each other and get a fresh start in life."],
      "budget": 2000000
   },
   "movielensId": 153310,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2007-05-30",
      "dvdReleaseDate": null,
      "directors": ["Jeanne Waltz"],
      "runtime": 84,
      "movieId": 153310,
      "title": "A Parting Shot",
      "mpaa": null,
      "actors": [
         "Isild Le Besco",
         "Lio",
         "Steven de Almeida",
         "Yves Verhoeven",
         "Michel Raskine",
         "Jocelyne Desverchère",
         "Maxime Kathari",
         "Sylvie Huguel",
         "Philippe Vuilleumier",
         "Christian Sinniger",
         "Caryl Minder",
         "Romina Tahami",
         "Estelle Bealem",
         "Bernard Nissile",
         "Christophe Sermet"
      ],
      "imdbMovieId": "0910935",
      "originalTitle": "Pas Douce",
      "genres": [
         "Drama",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A rebellious teenager and a \"border-line\" young nurse will learn to tame each other and get a fresh start in life...",
      "tmdbMovieId": 64944,
      "avgRating": 3,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/qNrNmgzS9tiqEGI9eO57vLniISw.jpg"
   }
}