{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "wax museum",
         "id": 10771
      }],
      "imdb_id": "tt0064729",
      "video": false,
      "title": "Nightmare in Wax",
      "recommendations": [
         29071,
         56140,
         84784,
         26643,
         28586,
         18696,
         95107,
         85498,
         221660,
         54875,
         84720,
         35662,
         101060,
         31131,
         22385,
         115666,
         127186,
         43248,
         40954,
         63088
      ],
      "backdrop_path": "/snrtSnQwuZwDdeYN18qnlMtMPfW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Marie Morgan",
               "gender": 1,
               "credit_id": "52fe454ec3a368484e052a0f",
               "name": "Anne Helm",
               "profile_path": "/roBrzHNsFlTs3u9UAQmuKvCdcuz.jpg",
               "id": 83390,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Det. Haskell",
               "gender": 2,
               "credit_id": "52fe454ec3a368484e052a13",
               "name": "Scott Brady",
               "profile_path": "/2JlQcMIbISvcQjtO4iIB1yZSqwW.jpg",
               "id": 14847,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Max Black",
               "gender": 2,
               "credit_id": "52fe454ec3a368484e052a17",
               "name": "Berry Kroeger",
               "profile_path": "/dIP8Ah1uGvbZjItzkjWJf82Y7qz.jpg",
               "id": 85988,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Theresa",
               "gender": 1,
               "credit_id": "52fe454ec3a368484e052a1b",
               "name": "Victoria Carroll",
               "profile_path": null,
               "id": 97964,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Tony Deen",
               "gender": 2,
               "credit_id": "52fe454ec3a368484e052a1f",
               "name": "Phillip Baird",
               "profile_path": null,
               "id": 97965,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Det. Sgt. Bud Carver",
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a23",
               "name": "John 'Bud' Cardos",
               "profile_path": "/yji6UiMRYVd75WrA2oNVEWQ3WO4.jpg",
               "id": 97966,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Ralph Tenier",
               "gender": 2,
               "credit_id": "52fe454ec3a368484e052a27",
               "name": "Virgil Frye",
               "profile_path": "/ryJZmbNAFOOLREZUZ2XZlr3kP99.jpg",
               "id": 8954,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Bartender (as Kent Osborne)",
               "gender": 0,
               "credit_id": "552e304992514103ce0068e4",
               "name": "Ken Osborne",
               "profile_path": null,
               "id": 928480,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Vincent Renard",
               "gender": 2,
               "credit_id": "52fe454ec3a368484e052a41",
               "name": "Cameron Mitchell",
               "profile_path": "/59qGcBDKN1H4UysLaOEdV1PJter.jpg",
               "id": 44728,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454ec3a368484e0529f9",
               "name": "Bud Townsend",
               "profile_path": null,
               "id": 97960,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e0529ff",
               "name": "Rex Carlton",
               "profile_path": null,
               "id": 97961,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a05",
               "name": "Martin B. Cohen",
               "profile_path": null,
               "id": 97962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a0b",
               "name": "Herbert Sussan",
               "profile_path": null,
               "id": 97963,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a31",
               "name": "Rex Carlton",
               "profile_path": null,
               "id": 97961,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a37",
               "name": "Herbert Sussan",
               "profile_path": null,
               "id": 97963,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a3d",
               "name": "John 'Bud' Cardos",
               "profile_path": "/yji6UiMRYVd75WrA2oNVEWQ3WO4.jpg",
               "id": 97966,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a47",
               "name": "Glen R. Smith",
               "profile_path": null,
               "id": 1148570,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ec3a368484e052a4d",
               "name": "Leonard Kwitt",
               "profile_path": null,
               "id": 1148571,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.073766,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27496,
      "vote_count": 5,
      "budget": 0,
      "overview": "The disfigured curator of a wax museum murders his enemies and then uses their bodies as exhibits in his museum.",
      "similar": [
         10066,
         29095,
         18573,
         28762,
         32652,
         27522,
         28494,
         43036,
         185495,
         470757,
         119212,
         128152,
         134615,
         125133,
         64078,
         23126,
         200326,
         65160,
         94740,
         110669
      ],
      "original_title": "Nightmare in Wax",
      "runtime": 98,
      "poster_path": "/qtPFLZYekdTWr7jBZPodJRXK00T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Paragon International Pictures",
            "id": 4905,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Productions Enterprises Inc.",
            "id": 13088,
            "origin_country": ""
         }
      ],
      "release_date": "1969-05-14",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Half Human... Trapped In A Bubbling Cauldron Of Terror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bud Townsend"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Rex Carlton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064729/",
      "coverLink": null,
      "actors": [
         "Cameron Mitchell",
         "Anne Helm",
         "Scott Brady"
      ],
      "reviews": [
         "This is a treat for fans of Z-grade movies. Here you will find writing and acting bad enough to rival anything Ed Wood ever produced. Veteran bad movie actor Cameron Mitchell is a former makeup man from \"Paragon Studios\" who, after a nasty acid-in-the-face incident at a social gathering, becomes an embittered Mad Scientist (tm) with a rubber scar on his face who takes revenge by kidnapping Paragon actors and turning them into living statues in his Secret Laboratory (tm) handily located in the local wax museum. Or are they zombies who do his bidding? He's not sure. Happily, many of your favourite movie clichés are here. Check out the villain's lab! Are those mysterious steaming vats of liquid? Test tubes of coloured water with no explained purpose? Yay! And what ho, do we see spare arms and legs arranged kinda casual-like on a wooden rack? You betcha! Marvel at the bumbling detectives acting with straight out of Plan Nine! Now, enjoy a stupidly tame car chase, and hear more dizzy bimbo screaming than you could possibly want. Raise an eyebrow at the screwy plot line, made even more opaque by the totally meaningless ending that seems to have no connection to the rest of the movie. Cheesy trash and much fun for the bad movie connoisseur.",
         "Definitely not a good film but nowhere as bad as some would paint it to be. Nightmare in Wax tells the story of a man, having had his face disfigured in a typical flashback scene, wreak his vengeance on those directly responsible and those indirectly for the losses in his life - most notably the love and companionship of a beautiful young actress. Cameron Mitchell plays the artist with his typical flair, albeit limited flair. Actually, I thought he gave one of his better performances. What exactly does that mean? Mitchell wears an eye patch, endlessly smokes cigarettes, wears a motley tunic, and talks to his creations in wax. They are not your ordinary wax dummies, but rather people still alive controlled by some serum that makes them lose control of all neurological function. They become zombies in effect. I thought the premise here was inventive if nothing else. It has some ludicrous explanation, but does serve the plot. This is a film of the 60s to be sure with some psychedelic camera-work by Bud Townsend and company. The acting is mediocre but Mitchell, Scott Brady, and Barry Kroeger give interesting turns. The wax figures of Hollywood's bygone era are done very effectively and most of the location shooting was very credible. The end of the film dissipates into something not quite real - either another example of 60s cultural cinema or the end of the scriptwriter's creativity. I'm banking on the latter. Despite its many flaws, I enjoyed the film. The opening scene showing an actor being needled was effectively done as was a police chase on the waterfront.",
         "I love this flick. It's sleazy and mean without being xplicict. It's tacky and way entertaining. If you want Citizen Kane, look elsewhere, otherwise this House of Wax rip -off is a clunky blast! Cameron Mitchell is an eyepatch wearin' wax museum curatin' psycho who \"freezes\" various Hollywood hacks...if you can find it and you like bad movies it's well worth 90 minutes of your life.",
         "Along with his turn in the super-sleazy 'classic' THE TOOLBOX MURDERS (1978), this is considered the ultimate bad Cameron Mitchell horror vehicle. It's a little too slow-moving for my tastes, has zero likable characters and not much action until the very end, but Mitchell's dedicated central psycho performance as a vengeance-minded whack-job is good. Not Anthony Perkins good, mind you, but definitely fun enough. As a spoof of the shallow conceit that is Hollywood, it's only so-so; as a horror movie it's also only fair. Even as a simple vintage exploitation picture, it's just OK. I'm a big fan of the unnecessary gratuitous dance sequence, so I was also thankful for the appearance of the Gazzarri Dancers, who just rule. Five of them do a crazy hair- thrashin', floor-slidin', hip-shaking' go-go dance routine to \"Don't Cry, Look For the Rainbow\" by the T-Bones. Watching these ladies bounce around with huge smiles on their faces in their fringe-covered bikini top and parachute pants ensembles is a major reason why I'm giving this a slightly higher rating than it probably deserves. Former movie make-up man Vincent Rinard (\"The best since Lon Chaney!\") goes after people at Paragon Studios. A flashback shows how Max Black (Berry Kroeger), a jealous and drunk studio executive, flung wine in Vinnie's face right when he was about to light a smoke. He's engulfed in flames and dives into a pool, but not before scarring up one side of his face and losing an eyeball (not to mention his sanity). Now employed by the \"world-famous\" Movieland Wax Museum in Buena Park, California, Vincent uses a special serum (described as a mixture of truth serum, nerve medicine and special \"vitamins and minerals\") to paralyze victims. They disappear and the dense detectives on the case (headed by Scott Brady) act baffled as new 'statues' are put on display in the museum. Vince talks to himself (\"I'm a terribly nice man!\"), chain-smokes, mumbles, hisses and describes how he gets \"excited\" by the sound of women's screams. Vinnie also has to deal with a bunch of back-stabbing scumbags and self-absorbed witches, most of whom will deserve what's coming to them. Aside from Max (a real Grade-A jerk... who doesn't even die!) and the stupid cops, the other two lead roles are women and both are pretty atrocious. Marie Morgan (Anne Helm) is not your typical innocent heroine; this tramp has been engaged to no less that five different characters in this movie, including Vince, Max and two of the wax dummies / missing male stars (I guess she never had time to make a go at the one missing girl). For some reason, she begs and pleads in her irritating baby-voice for Vince to give her a 'replica' of the head he's designing of the newest missing actor (and fiancé Number 5) Tony Deen (Phillip Baird). She doesn't know that Vince has already jabbed a syringe in the back of his neck, but I love it when Mitchell dryly agrees with her demands \"so you can completely retreat for reality.\" He also wants her to 'pose' for him, which means she's eventually held prisoner in a box. Unfortunately, the box has a hole where her head sticks through so she can continue to talk and whine. The other \"woman\" is Theresa (Victoria Carroll), one of the go-go girls, who's first seen proving she is thoroughly rhythm-deficient by jiggling on stage in a lime-green fringe bikini. Theresa is tolerable before she talks, but when you realize her grating presence combines the abrasiveness of Lorraine Bracco with the airhead mentality of the Landers sisters, you'll be hoping Vincent injects her with the serum as soon as possible. Unfortunately, we're first subjected to a scene of her making endless demands to the studio head honcho and running around in the museum trying to avoid Mitchell. She and the rest of the characters are completely unsympathetic, but function as a way to poke fun at the Hollywood system in general, I guess. And I'm probably giving this movie more credit than it actually deserves. The pluses are few and far between, but include (other than Mitchell and the dance routine), colorful, slightly stylized lighting and a bizarre ending that seems to suggest that Rinard will be severely punished for his crimes by spending the rest of his life in his own personal hell... Married to Marie!... Yikes, now that is scary. Also in the cast are director John \"Bud\" Cardos (also the production manager) as a police sergeant, James Forrest as a film director, Virgil Frye as a statue, Rini Martin and Kent Osborne as a bartender. Many of the people who worked on this one (including executive producer and script-writer Rex Carlton) also worked on the Al Adamson movie BLOOD OF DRACULA'S CASTLE and other atrocities. My Score: 4 out of 10",
         "I'm not sure what the 80's repackaging with the burning skull has to do with it but............ It's like someone filmed a community play. What's wrong with that? Definitely some good shoe clicking foley artist work. It's good to see a movie where people smoke cigarettes as they work/act - improv smoking. Cameron Mitchell movies are always watchable. Especially when there is an eye-patch involved. Some people called this a \"Z\" Movie and that's what it is, but good still under proper conditions. Would be good in IMAX 3-D. Gave it a \"5\" because it's definitely one of those get it or not movies. I think I bought a lawnmower from that detective guy in scene 29 over at ACE in 1974. Would actually be good at a drive-in with a six pack.",
         "I must really like you folks to sit through $#%^ like this so you don't have to.As painful as it is I'll recap some of the plot.Excuse me if I start yawning. Vince Renaud was Paragon Studios' top make up expert. He is in the middle of an affair with Paragons top female star. She is coveted by the studio head who built her career.When Renaud informs the jealous man at a party the studio boss sets Renauds face on fire.Instead of having the boss arrested Renaud opts for a bygones be bygones out look.Yeah, I can understand that. Actually Renaud is crazier than a loon and has worked out an evil plan of revenge. After opening up a wax museum Renaud perfects a serum to put people into suspended animation.Then he starts kidnapping and \"freezing\" actors from Paragon Studios. The actors are put on display as wax figures. They need a shot of the old serum every once in a while to keep them rigid.Good thing these folks are stiffs as actors. Renaud (who runs around in a strange outfit complete with a short cape)commits a few murders.One very unnerving scene has him motoring around town with a woman he just killed. He's planting a few kisses on her as well. YUCK!Of course the Police are absolute morons (led by Scott \"I have no talent\" Brady).The movie crawls on to an absolute horesbleep ending. To say this movie reeks is an understatement.Cameron Mitchell (Renaud) chews up the scenery rolling his eyes and whispering stupid lines like\"I love to hear you scream!It excites me!\"So glad somebody is excited about this waste of film.The acting is horrible, the plot & dialogue just screams of incompetence and the director has no clue. Your time would be better spent dry shaving a pit bull.Hold your nose and run from this garbage!",
         "This is one of those clunky, underpowered movies that doesn't seem to know what to do with itself once it establishes the basic premise, which seems to be to rip off a better known (and much better) Vincent Price movie. (Or to take the idea in a different direction, if you are feeling generous).Price's movie was a classic - this one, well, isn't. Cameron Mitchell does his usual workmanlike job from behind an eye-patch, scars, an omnipresent cloud of cigarette smoke, and a cape that must be there to invoke the spirit of Quasimodo...or is it the Phantom of the Opera? (That costuming choice indicates everything that's wrong with the movie right there.) Give him credit,he's the best thing about \"Nightmare\", which gives you an idea of how dull and dumb the rest of the movie is, but I was thoroughly tired of him (and his character) by the end of the movie. The director (and the screenplay) can't decide whether to go for horror, or soap opera, or Hollywood-is-a-snake-pit \"Day Of The Locust\" style intrigue. Problem is, the writing and the dialog isn't sharp enough to make any of those styles work. One of the choices that sinks it is the casting of the role of main \"diva\" movie starlet, who is supposed to be the romantic desire of all manner of Hollywood leading men and producers. The role calls for Elizabeth Taylor - what we get is Anne Helm, who is mousy,immature, and unimpressive...and who talks in a little girl voice that is not at all compelling. She's OK to look at (if you like kewpie dolls), and she may have been the best they could get for this movie,but a sex bomb? Not hardly. She pretty much deflates every scene she's in. I see in IMDb that she actually got a lot of work in television (and good for her), but the director and cameraman didn't do her any favors here. What the movie is really lacking, is energy and a sense of conviction. Do this same basic treatment with a British film crew, who would treat it like Shakespeare, and the odds are very good that the results would be quite watchable. But the movie just mopes along from one plot point to the next, and the whole thing just goes down the drain well before the end of the first act. Also, the ending really sucks - it's a \"surrealistic\" cop-out that basically admits to the audience that the writer couldn't think of a good ending either.",
         "This re-run of the classic horror films MYSTERY OF THE WAX MUSEUM and HOUSE OF WAX is more of a time waster than a real full-blooded horror yarn, as this poverty-row cheapie doesn't offer up much in the way of chills, thrills or spills. Instead what we have is a bare minimum of nonsensical plot, padded out with endless scenes of cars driving around and people talking. In fact, around the hour mark the plot seems to fall apart altogether, and instead the film opts for endless stalking sequences portraying Cameron Mitchell as he chases a blonde around his museum and later as he himself is pursued by a pair of bumbling, dim-witted cops. Cameron Mitchell's delightfully hammy portrayal of the scarred, deranged curator of the wax museum is probably the only reason to see this film. Complete with a bizarre cape, eye patch, and scarred face (achieved with cheap clay-like makeup), Mitchell is a delight as he converses with his dummies and the dead, plots, and mutters bizarre threats and the like. It's a shame that the rest of the cast can't match his performance and just end up boring as a result, a factor which isn't help by the total lack of characterisation other than that of Mitchell's Vincent Renaud; Anne Helm is a pretty but vacuous actress and the detectives are just plain stupid (one of them played by John 'Bud' Cardos, who went on to direct THE DARK). The only character of interest is the slimy Max Black, as played by Berry Kroeger as an egocentric lecher wanting to have his wicked way with the ladies. The film seems to have added in an unbelievable and unnecessary subplot that states that Mitchell's victims are not dead, but in a state of suspended animation; unfortunately a side-effect of the serum Mitchell uses on them means that they become animated again within a period of days so the fluid must be reapplied over and over. Surely it would be easier - and more fitting - just to kill the people and be done with it? Not in this film. The direction is static and unimaginative, the sets cheap-looking and lacking in atmosphere, despite being filmed in a real waxworks. Apart from Mitchell's colourful character, everything seems to be lacking in life and flourish. The one good horror scene comes when Mitchell is horribly scarred by Black, who throws a glass of wine in his face which is then ignited by a lighter is holding. Mitchell jumps through a window and into a pool outside, where he grasps his horribly bleeding features, Grand Guignol style. Good sleazy stuff, but unfortunately the only scene in the movie to offer a real low budget thrill. The bizarre ending sees all of the dummies come back to life to dunk Mitchell in a pot of boiling wax, then Mitchell awake to discover that the entire film was just a nightmare - only for him to relive that nightmare once more and wake up once again to discover it wasn't real after all. Huh? Seems to this reviewer like they were just stuck for an ending so filled it with rubbish in a hope to appeal to those easily impressed instead. For Mitchell completists and sadists only...",
         "***SPOILERS*** Ridicules remake of the 1953 horror classic \"House of Wax\" with a deranged Cameron Mitchell, who's seen better day and was in far better movies, as the mad as a hatter wax museum curator Vincent Rinard. Rinard who's face had been disfigured when his boss Paragon Pictures CEO Max Black, Barney Kroeger,spilled a glass of brandy at him while he was lighting up a cigarette. That happened during a fight he had with him over Paragon Pictures' top star Marie Morgan,Anne Helm, over whom of the two suiters, Rinard or Black, she was to marry. Recovering from his injuries Rinard opens up the famous Hollywood Wax Museum and uses his talents to kidnap and turned into wax like zombies those that he has it in for including his love Marie's former boyfriend actor Tony Dean, Phillip Brird, among others. We also have two bumbling policemen Det. Haskell, Scott Brady, and his partner Sgt. Carver, Johnny Cardos, on the case of the missing actors whom Rinard turned into living and breathing wax figures. Rinard's big plan is to kidnap Max Black and punish him for what he did to him by having him join his victims as members of his wax museum encourager. And he uses the not too bright go-go dancer Thereas, Victoria Carroll,to entice Black to go there and be turned into a ball or man of wax. ***SPOILERS***The movie really goes nowhere with Rinard too crazy to accomplish his devious plans which is to turn all is enemies into wax figures and soon goes completely nuts, if he wasn't already, when the love of his life the beautiful actress Marie Morgan turns him down cold for her true love the waxed and drugged up Tony Dean. It's Tony whom Rinard, in trying to impress her with his skills of waxing people, introduces Marie to in order to get her, in seeing that Tony is no longer able to satisfy her anymore, to fall in love with him. The films final sequence has all of Rinard's immobilized wax zombies suddenly come alive after their shocked back to life during an electoral storm. The ending is a real letdown in it having really nothing to do with whats been happening during the entire movie but to finally and mercifully put an end to all this insanity. It takes some time to figure out what exactly happened in the films final few minutes which by then you've just about lost all interest in it! The only saving grace in the movie is Cameron Mitchell's acting as the crazed and off the wall wax museum curator Vincent Rinard. It's Mitchell who seemed to have put his entire heart and soul into the part. Mitchell seems so caught up with his role that what would have caused most actors to crack up and break into uncontrolled hysterics he actually takes seriously!",
         "The career of Cameron Mitchell is fairly typical of a good, but second line actor after the collapse of the studio system. Left adrift they took work where they found it and Mitchell appeared in some awful films after the Fifties. Nightmare In Wax could be considered one of them, but the screenplay makes this film a camp delight with Mitchell leading an entire cast in an object lesson in overacting. Cameron Mitchell is our protagonist in this film, he plays a former studio makeup artist who was burned and lost an eye as a result of an accident. He starts a Hollywood Wax Museum, but this man through a combination of drugs and hypnosis is using live subjects as his exhibits. He's planning revenge on those he felt wronged him. Scott Brady is a cop who suspects, but can't prove his involvement in the disappearance of some Hollywood notables. Anne Helm is the girl Mitchell once loved, Berry Kroeger does a great caricature of a studio head, casting couch and all. Kroeger's latest squeeze is blond bimbo Victoria Carroll. Carroll in her own way gives the best performance in the film. Nightmare In Wax is a fun black comedy, not to be taken seriously. It's hardly a great film, but far more enjoyable than I thought.",
         "Certainly not a bad purchase for only £1.97, especially not when you're, like me, a fan of minimally budgeted and legendary BAD horror cinema of the older days. Genre regular Cameron Mitchell (\"Blood and Black Lace\", \"The Toolbox Murders\") gives another tremendously grotesque performance, this time as the deranged & deformed sculptor-artist/curator of a wax museum in Hollywood. Vince Renard wasn't always an eccentric loner... Once he was a celebrated make-up artist in a big production studio and engaged to a beautiful and promising young actress. The sneaky studio boss, however, fancied the actress too and he set fire to Vince's face when he lit a cigarette. Now Vince, wearing an eye-patch and still smoking like a chimney, puts all his anger in his skillful and extremely detailed wax statues that are strangely exhibited in the museum simultaneously with the real actors disappearing. Rex Carlton's script shamelessly imitates the success of \"House of Wax\" when it comes to the psycho's motivation, but his modus operandi is different as he keeps the victims alive like mindless zombies. There's very little suspense and/or creepy atmosphere, because the situations are so exaggeratedly absurd, and all the characters are incredibly stupid. At one point police detective Haskell asks himself, if Vince is a maniacal killer, then where exactly in his museum does he hide the corpses? Um, what do you think Sherlock? But no one beats Theresa, who's so stupid she doesn't even understand simple English words like \"discreet\". There's very little gore (probably due to the lack of budget), apart from the bloody flashback scene illustrating how Vince lost his eye, but still \"Nightmare in Wax\" is never really boring and at least it's bad in a fun way. The ending, however, is unforgivably retarded even though it makes sense if you follow the plot literally.",
         "A scarred, embittered owner of a wax museum with a twisted mind devises horrible fates for those who cross him. This piece of trash was written by the prolific Rex Carlton, and directed by Bud Townsend (who went on to direct the much more memorable film, \"Alice in Wonderland\" -- the porn version). It comes to us with below average film quality, at least on the Mill Creek disc. Star Cameron Mitchell (\"Blood and Black Lace\") probably regretted appearing in this one. There is an interesting, bulky head bandage with the victim smoking... unintentionally scary... but that's like the only nice thing i can say about it. There is a pointless go-go dancing scene with a band called the T-Bones... really dates the film, for better or worse. There is no point in ever seeing this movie.",
         "BAD VERY VERY BAD but very entertaining in a so bad it's good way. Cameron Mitchell's hilarious over the top performance was perfect and made me have a huge grin on my face throughout the film. The dialog is terrible and especially cheesy (I want to hear you scream it excites) me. The film is very cheap and the blood looks laughably fake but the delightful over the top performances laughable dialog are all part of it's charm. Plus it has a really funny ending. This was another one i got on that 8 horror disc set. There is a bit of gore but it's laughably fake. we get a needle in the neck and face, a laughable looking burnt face with blood all over it, and a bloody stabbing. The acting is horrendous Cameron Mitchell is AWESOME here and he kept the movie alive with his great over the top performance, and was just downright hilarious. Anne Helm was very pretty but her acting wasn't good at all and her chemistry with Mitchell was off. Scott Brady is TERRIBLE as the detective and he had some terrible dialog. Victoria Carroll was pretty but almost had me in tears from laughing so hard with her clumsy performance. Overall seek this out one of the best so bad it's good movies i have seen! *** Out of 5",
         "I enjoyed Nightmare in Wax, taking it on the pulpy level that it intends and achieves. It's fun. It's not mindlessly sadistic (so if you want that, look elsewhere). Not hopelessly incompetent, either (just a bit, maybe, but hope is there). I admit that at first I confused it with a wax museum horror featuring a curator with a false hand, which is interchangeable with a hook or a cleaver. Were there two versions of this film? No; the man with the cleaver was Patrick O'Neal in Chamber of Horrors (1966). It gave me a restless night figuring that one out. These things worry horror fans. The Patrick O'Neal film is a classier offering. The photography is much glossier, and Wilfred Hyde-White adds his own charm to the proceedings. But Cameron Mitchell in Nightmare in Wax adds his own special (if not too refined) touch of wickedness, pursuing Anne Helm through his Faustian workshop, hypodermic in hand. That chase between tottering dummies and bubbling vats doesn't quite elevate the film into the realms of horror achieved by Lionel Atwill and Fay Wray... but it's pretty good, all the same. A couple of years before Nightmare in Wax, Cameron Mitchell starred in a Spanish/West German co-production of Island of the Doomed (1967) (a.k.a. The Bloodsuckers, The Maneater of Hydra, etc.) I was fortunate enough to see that sharing a double-bill with Slaughter of the Vampires. That was in my long-ago teens. Much more recently I bought it on DVD (with the widescreen sadly cropped). Now wouldn't it be great if someone had the discrimination (I shan't say the taste) to bring out a restored widescreen double-DVD of both Nightmare in Wax and Island of the Doomed. We can only hope!",
         "Crown International Pictures deliver another bit of schlock with Nightmare in Wax (a title I am guessing inspired the name of ambient electronica band of the 90's Nightmares on Wax). This one stars B-movie stalwart Cameron Mitchell as a disfigured wax museum artist, who abducts actors, injects them with a drug that induces paralysis and then douses them in wax and puts them on display as exhibits. And all because a pesky film producer set his face on fire at a party\u0085don't you just hate when that happens? The premise of this one has some potential given the promising nature of the idiocy of its central idea. In practice though it is a bit underwhelming with some admittedly good moments sprinkled throughout. There's quite a good extended stalk sequence in the wax museum with Mitchell's demented madman pursuing a woman, there is a music performance from the never-popular pop act the T-Bones, there are a pair of knuckle-headed cops and living wax exhibits; while everything is rounded off with an ending that I think might have been senseless but I'm not sure. On a side note, the public domain copy that is doing the rounds is compromised by really bad sound quality which makes this one harder work to watch than it should be.",
         "Cameron Mitchell is Vincent Renard, a wax figure maker who's waxworks are very life-like - too life-like! He murders his enemies and turns them into waxworks! But why all the enemies? The film is mystery-horror and it's not all that bad of a film even though it's not the best film about a wax museum it's certainly not the worst. The move does not a have lots of blood and gore but it does have a fairly good story - it's just not great. And if you do like horror movies about wax museums then you might like this one - just don't expect it to be one of the better films in the category. 6/10",
         "Nightmare In Wax is a typical wax museum horror film which is a rip-off of the Vincent Price classic House Of Wax which is a remake of 1933 Mystery Of the Wax Museum. The plot isn't really the same besides being based on a wax museum and a man who gets scars from being burnt. Nightmare is overdone and corny (particularly the eye-patch, Berry Kroger with sunglasses and a band performing known as The T-Bones). It's plot is rather far fetched as well, ending is pointless yet the entire film really is. Nightmare defines bad horror with bad acting and a bad plot, everything is so bad throughout which keeps it entertaining and fun. It came out in 1969 and is going to be extremely campy and dated, it was probably dated even in 1969. Nightmare is all style over substance. If you want to watch a real horror classic, check out the original '33 Mystery Of the wax Museum or the Vincent Price remake but if you want to watch one of the best bad horror movies, check out Nightmare. Also check out Terror In Wax starring Ray Milland, another good wax museum/horror film.",
         "This is a low-budget horror film from Crown International Pictures. Vincent Renard(Cameron Mitchell)is a former film special effects artists, who is disfigured accidentally on purpose by Max Black(Berry Kroeger), the head of prosperous Paragon Pictures. Black also happens to be competing with Renard for the affections of the pretty Marie Morgan(Anne Helm). Getting out of the movie business, the disfigured Vince opens a wax museum. Within a few months of each other, four popular stars at Paragon disappear. And soon wax figures of the missing stars become featured at Renard's wax museum. Sure seems suspicious and local Detective Haskell(Scott Brady)begins an investigation. Not exactly the worst wax museum flick, but the story line in predictable and the shock value wanes. Mitchell has always been able to make the best of his many roles. Brady is a much used character actor, and a good one. If Miss Helm looks familiar; she was Elvis' love interest in his movie FOLLOW THAT DREAM. Rounding out the cast: Phillip Baird, James Forrest, John Cardos and Victoria Carroll.",
         "This was not a good film by any stretch of the imagination. One also has to wonder why it was in a movie collection called Gorehouse Greats when I have seen more blood flow with a paper cut, but seeing as there has not really been a bloody film in the collection much less a gory one I guess I can understand why this one was in it. I think it was supposed to be called Borehouse Greats as most of the films so far have done just that. This one is about a wax sculptor who was left scarred by an incident and now he wants revenge! There are no twists or turns, save the one at the end so I am not giving anything away by saying that indeed the scarred wax curator is the bad guy. Wow, they were not really trying here until they backed themselves into a corner at the end and said \"I know, for a twist, how about we make the most horribly conceived ending ever?\" Yes, the ending sucks and before that there is not much excitement as you see the museum guy flashback to how he got his injuries and you will also see his girlfriend try and stay with him and he pushes her away and he is not exactly doing to badly with the ladies so one can see why he wants revenge and how it is justified. Well not really I guess, the guy is just an idiot who instead of doing some really interesting things decides to get petty revenge or something to that effect cause the ending kind of dispels everything in a way. Still, the cops were on the ball...well not really, they are easily fooled and one can get away while being chased by them by throwing spare tires in the water and locking screen doors. Took all I had to finish this one and I was rewarded with one of the most horrible endings ever.",
         "Here is yet again another Z movie that I sat through. This guy with an pointy eye patch runs a wax museum and guess what? His wax figures are not make of wax at all. Someone touring the museum could have figured this out since real people have to go to the bathroom and eat. But this is a bad movie and there is no real point to it. The eye patch guy is about to kill this guy and he tells him exactly what he is going to do. Like his career, he sinks lower and lower into wax but he can see for the longest time that he never really had a career to begin with. There are probably a lot better wax museum movies. There was even an episode of \"The Twilight Zone\" that had wax figures. Please, I beg you, watch that instead.",
         "Legendary Cameron Mitchell turkey about an actor/makeup man who is burned by the head of a studio when a drink is tossed in his face as he is lighting up a cigarette. Reduced to a scarred mess and wearing an eye patch Mitchell works at the Movieland Wax Museum . He also kidnaps and kills people using a solution which paralyzes them so he can turn them into displays. Genuinely bizarre bad movie that defies description. Watch as the various wax figures try not to move, watch as the entire tobacco out put for several Southern states is consumed\u0085watch as things just get weirder and weirder. Its an awful train wreck of a movie and you won't be able to take your eyes off the screen. A classic bad movie that will amaze you even as it leaves permanent scars on your psyche.",
         "Nightmare in Wax (1969) ** (out of 4) Former actor Vincent Renard (Cameron Mitchell) had to put his acting career on hold after his lover's jealous boyfriend burned his face beyond recognition. Vincent, being the good guy he is, didn't let this deformity get him down. Instead of lying around doing nothing, Vincent decided to open a max museum to display various celebrities from Frank Sinatra to Elizabeth Taylor. However, there's also a special section devoted to recently missing actors who in fact are the real victims killed by Vincent himself. It's quite clear this is another takeoff on Mystery of the Wax Museum, which was also remade by Vincent Price in House of Wax. Both of those films are highly entertaining mysteries but that's not the case for Nightmare in Wax, which comes off more of a hack job than anything else. Unlike the previous two films however, this one here allowed some more graphic death scenes including the wonderfully bloody disfiguration of Vincent himself, running around with blood gushing from his eye. The actual \"mystery\" of the previous two films were a bit far fetched but the mystery in this movie really hurts the film because it's so damn obvious Vincent is the killer that it gets quite boring watching the detectives try and figure out the mystery. There are so many clues given to the police that I had to keep shaking my head wondering how long it was going to take them to figure it out. Cameron Mitchell, God bless his poor soul, is quite good here in his usual over the top way and keeps the film interesting throughout. If you haven't seen Mystery or House then check those out before viewing this one.",
         "Cameron Mitchell plays an actor who is dating a young actress who used to date the head of a movie studio (she's too young for both of them!). At a party, when he's lighting his cigarette, the studio boss throws a high alcohol content drink in his face, and he catches fire. In the hospital, his face is entirely bandaged and he still lights up a cigarette! He becomes the resident sculptor of the Movieland Wax Museum and Palace, where he also lights up cigarettes! Mitchell recovers, more or less, having really poorly done burn makeup on one side of his face that looks like gray spackle and tape, and an eyepatch. When Mitchell isn't smoking, he's killing people. Well, he only kills people sometimes, since he prefers to inject them with something that puts them in a sort of waxy coma. If he doesn't administer it regularly (and he never seems to remember), they start to move again a little, although they're in a sort of hypnotic zombie state. Not all his sculptures are people, though. He evidently does have talent as a sculptor. The ending, which seemed to have been struck from a much poorer print than the rest of the movie, is really absurd. They seemed not to know what to do, and went back to the title for an idea. Apart from the oddly grainy final shots, the rest of the movie is in fairly good shape, except for the audio in some scenes which sounds like it was run through a blown speaker. Definitely not one of the better wax museum movies.",
         "While no grade Z classic; this film does have some of the perverse spunk of Rex Carlton's other well know slummer; \"The Brain That Wouldn't Die.\" The drink in the face scene is indeed a nice shocking moment. Too slow and talky overall, though, and they didn't really find anywhere interesting to take the silly premise. Some enjoyable hamming all around though. Rex Carlton supposedly committed suicide because he owed the Mob money he borrowed to fiancé his grade Z cheapos. Well, it's nice to know someone gave there all to bring us \"The Brain That Wouldn't Die\", or even \"Nightmare in Wax\" for that matter.",
         "While IMDb doesn't say so, this film is a remake of a remake. The original film, \"Mystery of the Wax Museum\", was okay but the 1953 remake, \"House of Wax\" is a brilliant horror classic. So why remake it in 1969? And, why bother if you are going to spend so little for makeup or talent? Cameron Mitchell was not a bad actor--but he wasn't very good here in the film. His personality and style didn't put the part over like Vincent Price did in the previous version...and that's an understatement! Additionally, while Mitchell's character is supposed to be horribly disfigured, the facial makeup actually looks like it was made up of a flour/water paste and clumsily applied to him! It simply looks ridiculous. As for the story, it's a lot like \"House of Wax\" but set in modern Hollywood. And, because of this, the actual Movieland Wax Museum was used as the setting. Aside from this, there is NOTHING in the film that would make it worth recommending. The writing is terrible, the direction is terrible and the entire effort limp and uninspired. The bottom line is that I suffered through this bad film--you don't have to yourself!"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Paragon International Pictures",
         "Productions Enterprises Inc."
      ],
      "summaries": ["The disfigured curator of a wax museum murders his enemies and then uses their bodies as exhibits in his museum."],
      "budget": 0
   },
   "movielensId": 153466,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-05-14",
      "dvdReleaseDate": null,
      "directors": ["Bud Townsend"],
      "runtime": 98,
      "movieId": 153466,
      "title": "Nightmare in Wax",
      "mpaa": "PG",
      "actors": [
         "Anne Helm",
         "Scott Brady",
         "Berry Kroeger",
         "Victoria Carroll",
         "Phillip Baird",
         "John 'Bud' Cardos",
         "Virgil Frye",
         "Ken Osborne",
         "Cameron Mitchell"
      ],
      "imdbMovieId": "0064729",
      "originalTitle": "Nightmare in Wax",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "The disfigured curator of a wax museum murders his enemies and then uses their bodies as exhibits in his museum.",
      "tmdbMovieId": 27496,
      "avgRating": 0,
      "releaseYear": "1969",
      "numRatings": 0,
      "posterPath": "/qtPFLZYekdTWr7jBZPodJRXK00T.jpg"
   }
}