{
   "tmdb": {
      "original_language": "pt",
      "keywords": [
         {
            "name": "brothel",
            "id": 1411
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "prostitution",
            "id": 13059
         }
      ],
      "imdb_id": "tt0847154",
      "video": false,
      "title": "Angels of the Sun",
      "recommendations": [
         215846,
         15939
      ],
      "backdrop_path": "/kRsDSnGYVxHj45bkQKWLG2oFoAG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Saraiva",
               "gender": 2,
               "credit_id": "52fe46869251416c910574c1",
               "name": "Antonio Calloni",
               "profile_path": "/jVgYlr6Q5ROPLTr5eVmSYNYKhip.jpg",
               "id": 130636,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lourenço",
               "gender": 2,
               "credit_id": "52fe46869251416c910574c5",
               "name": "Otávio Augusto",
               "profile_path": "/b19b1hPh2IrAcvo1DAloVofHcq1.jpg",
               "id": 10062,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Vera",
               "gender": 0,
               "credit_id": "52fe46869251416c910574c9",
               "name": "Darlene Glória",
               "profile_path": "/w3VpXQYFrTymSF0hDAFiZa6igGa.jpg",
               "id": 130637,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Nazaré, the Madam",
               "gender": 1,
               "credit_id": "52fe46869251416c910574cd",
               "name": "Vera Holtz",
               "profile_path": "/vMeTcHsefEkiEY4GigLF5evfGM4.jpg",
               "id": 130638,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Public Health agent",
               "gender": 0,
               "credit_id": "54ee50f1c3a3686d64005468",
               "name": "Mauricio Gonçalves",
               "profile_path": "/2r1cLpS831Gj38nY1swYMo7myJU.jpg",
               "id": 87340,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tadeu",
               "gender": 0,
               "credit_id": "54ee5106c3a3686d5800473d",
               "name": "Chico Diaz",
               "profile_path": "/WFC675ljCqtRH1lFQOvvJYmDXp.jpg",
               "id": 92193,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Inês",
               "gender": 1,
               "credit_id": "54ee511bc3a36869e50022d1",
               "name": "Bianca Comparato",
               "profile_path": "/gZYRuXvmDxMU9vPuJlsen03ZLtL.jpg",
               "id": 931850,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Celeste",
               "gender": 0,
               "credit_id": "59b694b1c3a3682b190149d6",
               "name": "Mary Sheila",
               "profile_path": "/7uHKGjsKbG2fYv2VR02M0zRnOQg.jpg",
               "id": 444956,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Maria",
               "gender": 0,
               "credit_id": "59b694c8c3a3682b3d015a20",
               "name": "Fernanda Carvalho",
               "profile_path": null,
               "id": 821632,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Truck Driver",
               "gender": 0,
               "credit_id": "59b694d9c3a3682aad0156cc",
               "name": "Caco Monteiro",
               "profile_path": "/leiSLzZWDzX9J1zLmYhvynYF92h.jpg",
               "id": 953333,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Jet Pilot",
               "gender": 0,
               "credit_id": "59b694efc3a3682b0a0142c9",
               "name": "Antônio Gonzalez",
               "profile_path": null,
               "id": 1886135,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Maria's mother",
               "gender": 0,
               "credit_id": "59b694fac3a3682b0a0142e8",
               "name": "Evelin Buchegguer",
               "profile_path": null,
               "id": 1523926,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Maria's father",
               "gender": 0,
               "credit_id": "59b695049251417d17015b05",
               "name": "Rui Manthur",
               "profile_path": null,
               "id": 1886136,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Public Health agent",
               "gender": 0,
               "credit_id": "59b69514c3a3682b0a01430d",
               "name": "Maurício Gonçalves",
               "profile_path": null,
               "id": 1886137,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "59b695239251417cb50150db",
               "name": "Larissa Beckman",
               "profile_path": null,
               "id": 1886138,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "59b6952ec3a3682aad01573d",
               "name": "Kallanda Caetana",
               "profile_path": null,
               "id": 1886139,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46869251416c910574bd",
               "name": "Rudi Lagemann",
               "profile_path": null,
               "id": 130634,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46869251416c910574d3",
               "name": "Rudi Lagemann",
               "profile_path": null,
               "id": 130634,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.657881,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 37993,
      "vote_count": 12,
      "budget": 0,
      "overview": "In Northeastern of Brazil, the father of the twelve years old illiterate Maria sells his daughter to Tadeu to be employed as a housemaid and have a better life. However, the girl is resold to the farmer Lourenço that deflowers her, and he gives the abused girl to his teenager son to have his first sexual experience. Then she is sent to a brothel in a gold field in Amazonas and explored his owner, the despicable Saraiva. When Maria escapes to Rio de Janeiro expecting a better life, she is explored by the cáften Vera.",
      "similar": [
         50270,
         351964,
         1904,
         86331,
         979,
         1690,
         2057,
         26973,
         12093,
         109424,
         110415,
         80752,
         81774,
         82695,
         44214,
         106646,
         112160,
         2118,
         4995,
         27
      ],
      "original_title": "Anjos do Sol",
      "runtime": 92,
      "poster_path": "/eMZ4WMnHgkQgnI8S0ByBEUHt0ZV.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Globo Filmes",
            "id": 13969,
            "origin_country": "BR"
         },
         {
            "logo_path": null,
            "name": "Apema Filmes",
            "id": 94768,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caradecão Filmes",
            "id": 94769,
            "origin_country": ""
         }
      ],
      "release_date": "2006-03-04",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": "BRL ",
      "directors": ["Rudi Lagemann"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Rudi Lagemann"],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0847154/",
      "coverLink": null,
      "actors": [
         "Antonio Calloni",
         "Otávio Augusto",
         "Darlene Glória"
      ],
      "reviews": [
         "Sincere, didactic, sentimental, predictable account of how 12 year-old Maria (inexperienced, doe-eyed Fernanda Carvalho) is sold by her own destitute parents in Northern Brazil to be employed as a housemaid, instead ends up being forced to work as a prostitute under slave-like conditions in an indigent brothel in the Amazon, run by evil Saraiva (Antonio Calloni). Overcoming all odds, Maria manages to escape to Rio de Janeiro, where she hopes her life will change for better when she meets Vera (Darlene Glória, the unforgettable star of \"Toda Nudez Será Castigada\", unrecognizable after a series of unsuccessful face-lifts)...but will it? The theme is important and urgent: child prostitution exists in most Third World countries (well, I guess everywhere...), but in Northern Brazil it takes endemic proportions, as it's not unusual for destitute parents to sell their own daughters to brothels, in a region where virginity is still a valuable commodity, and men pay high prices to deflower virgin child prostitutes, not remotely à la \"Pretty Baby\" glamorization. The fact that documentaries on the subject are difficult to make due to legal issues (they're underage!) makes fictionalized films like these essential and director/writer Rudi Lagemann shows he did his research homework. Nevertheless, the film seldom clicks, due to the usual weak points in contemporary Brazilian fiction film-making: the loose/inefficient direction of actors, the predictability of plot development, the abuse of formulaic characters and unconvincing/flat dialog. If the film is ultimately frustrating, it's mainly due to cliché cardboard good vs. evil characters and the fact that we can outguess nearly every next sequence. The dialog seldom rings true, marred by the awkward acting of the young cast (with the exception of talented and more experienced Mary Sheyla), the mix of unlikely accents and the shameless scenery-chewing of the veterans (especially Calloni and Darlene Glória, while usually reliable Chico Díaz and Vera Holtz resort to ticks and tricks; Otávio Augusto is fine, as usual). The mix of professional and non-professional actors never lets the film impose its tone (it keeps teetering between melodrama and docu-realism). Visually, the film is also contradictory, as Lagermann indulges in carefully planned framings and complex camera movements that belie (and soften) the urgent, raw, ugly theme. I sincerely wish I could recommend this film heartily; it IS a labor of love, well-intentioned and deals with an important issue. But if you want to see a really great Brazilian film about child exploitation and prostitution (among other throbbing themes), try to find the brand new DVD release of \"Iracema -- Uma Transa Amazônica\". That one is a real punch in the stomach and a completely successful mix of cinéma- vérité, improvisation and fiction, still as urgent and shocking as it was 30 years ago, and which -- tragically -- hasn't dated at all.",
         "It's supposed to bring not a milligram of pleasure, be it directing or, especially, acting. Who cares? That's not a piece of art. That's a desperate yell that fades into a hopeless howling. This movie alone is enough not to want to wake up next morning. Watching can easily lead to a heart attack. I nearly had one. But filmed impeccably by a guy with a very big heart. Great photography, great sertaneja score intended to contrast, great cast including Otavio Augusto, Chico Diaz, Vera Holtz and Antonio Calloni among others. Virtually a documentary with a very slight acting, which may be just a bit too much. But the most shocking is that the movie leaves you breathlessly ashamed for being part of this world.",
         "I'm not much of an expert on acting or other movie details, but this movie just hit me deep. I don't think I'll ever forget it. One scene especially (I think that anybody who has seen the film will know of which one I am speaking) is imprinted on my brain. I also watched the similar movie Lilja 4-ever (as referred to by a previous commentator). It was also very moving, but not quite as straight to the point and brutal. If you are sensitive at all, either will bring tears to your eyes, but Anjos Do Sol (Angels of the Sun) may stay with you forever. This is very depressing subject matter, but I think, no, I HOPE that the film succeeds in bringing more attention to it. More people need to see this film!!!!!!",
         "In Northeastern of Brazil, the father of the twelve years old illiterate Maria (Fernanda Carvalho) sells his daughter to the middle man of a prostitution organization, Tadeu (Chico Dias), to be employed as a housemaid and have a better life. However, the girl is resold to the farmer Lourenço (Otávio Augusto) that deflowers her, and he gives the abused girl to his teenager son to have his first sexual experience. Then she is sent to a brothel in a gold field in Amazonas and explored his owner, the despicable Saraiva (Antonio Calloni). When Maria escapes to Rio de Janeiro expecting a better life, she is explored by the cáften Vera (Darlene Glória). \"Anjos do Sol\" exposes the sad and shameful reality of child prostitution in Brazil through the fate of the girl Maria. Last year I saw \"Lilja 4-ever\" that tells an identical story in the former Soviet Union; therefore this problem does exist in Third World countries. Director and writer Rudi Lagemann presents a great movie exposing the reality but never showing nudity or explicit sexual scenes. It is the debut of the promising Fernanda Carvalho, who has an excellent performance in the role of a scared child fighting for survival. Most of the prostitutes are amateurs, and it is impossible to recognize the famous Darlene Glória so different she is after many plastic surgeries. The bitter and hopeless end of the story is also very realistic. My vote is ten. Title (Brazil): \"Anjos do Sol\" (\"Angels of the Sun\")",
         "Anjos do Sol was one of those movies I was hesitant to watch -- another film on child prostitution, another Trade or Human Trafficking? I've seen enough of child exploitation films. However, I was pleasantly surprised. The plot was less trite than I had feared, the ending especially heartfelt and surprising as the audience perceives that Maria has absorbed her previous experiences negatively. (Duh. How can child prostitution be positive?) The ending gives a powerful message on how child prostitution severely affects the minds of its victims and urges people to become aware of its continuing affects. Although the plot is brilliant from some angles and not so much from others, the score and cinematography are what truly makes the movie a masterpiece. The music, sometimes repetitious, incites emotions. The cinematography enhances the story by allowing the viewers to interact with the characters. Two instances of beautiful cinematography must be mentioned: ---SPOILER ALERT--- 1] After Maria's first night at the club, the camera peeks around the corner of her doorway to reveal her crying in the bed. The camera moves at such a slow angle that the viewers feel as though they too are in the club, peeking around the doorway at something they should not see. 2] When Saraiva ties Inez to the jeep, the camera circles Inez's face from the profiles to the front. As the camera moves and Inez approaches imminent doom (Saraiva starts the jeep that will drag her), Inez's face transforms from a cool countenance to a wrinkled, despairing expression. Just as the camera stops, the jeep starts. ---END--- The acting was atrocious at times because many of the actresses were young and inexperienced, including the main actress Fernanda Carvalho, who had no previous acting experience. However, Carvalho's portrayal of Maria was so simple and natural that I felt her childish inexperience and honesty added reality to the film ... which is more that I can say for the antagonists, who were uninspiring and one-dimensional. Overall, the performances were so-so, but the emotional cinematography and score demands a viewing of the film.",
         "\"Angels of the Sun\" (title in English) is directed by Rudi Langelman (he was already assistant of Ruy Guerra in the film \"Kuarup\"). Of this interchange resulted that the cinematographic language of Ruy Guerra was very well apprehended by Rudi, though in some moments of the film we can \"see\" something of \"TV Language\". I'll explain: abrupt cuts, followed by \"close-up\" and \"opened plans\", in which the camera catches all the environment. Surprisingly, the cast works in a uniform way, and behaves accurately as the director wanted, perhaps due to the inexperience of the actors. (When an actor starts to gain experience, let us say: with 15 or 20 years of interpretation, he/she always suggests a change, in the process of making a movie: psychological aspect of a personage, or in the positioning of camera or in the elimination of scenes and/or some dialogs. But that is not the principal subject... The story is \"cushioned\" by the constant denunciations of such a practical, internationalized by magazines, periodicals and by TV. In spite of all the defects, I vote in a scale of 1 to 10: 5 (fair).",
         "I saw many films in that week and I was tired, but this film was like a slap in the face then I woke up, it was so strong. It's not a documentary, but an unhappier reminder of world that exists. Great photography and painful images. I consider it one of the best Brazilian movies.",
         "The whole cast is a long series of cardboard silhouettes marching around in a silly dance. A TV report about child prostitution has about the same emotional and artistic value for only a fraction of the price. So why do it? Because the they can. Anyway, everything is cleaned up to sterility. The miners are poor. They have unfashionable clothing. Yet the clothes are clean and new. The brothel is hospital clean and there are no sanitation issues. There is no blood, no vomit, even the chain is new and shinny. Why do they do it? Any of the characters moving around? Who cares? The team has a movie to shoot and big dreams. In the end, the screen announces this is made from true stories. Really? If that's so why is there only one story? And if that is one story, where is the evolution, the reason to feel something for the girl? In the end, after 90 minutes, the girl is just another piece of meat. Does she change? Does she have dreams? Long into the movie she starts speaking. She is trying to become human: she talks about pain. But she is cut short by the director's need to keep up filming. I should have felt sorry for the girl. Yet the only conclusion rests: she was better off dead. And this movie unmade. Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch",
         "More the norm are child prostitute movies, and I like ones that shock and hit hard with the message. This is one of those films, an indie one with shades of amateurish as if for budget, whatever. It's seems like the producers, filmmakers, whatever, were really pushing hard to get it made. The subtitles look cheap. This is an impressive work I must say, where again the scum who sell kids are merciless. A 12 year girl, unbeknown to her will become a child prostitute as her slightly older scouted sister has caught malaria. What begins for this poor girl is a merciless hell as she becomes a commodity for sex from perverted older men, who buy them like objects, one girl described by a madam as \"a delicate flower\" or words to that effect is nine if a day, where the girls are doled up in gaudy dresses, eye candy for these perverted sons of bitches. One guy buys two girl's, including the 12 year old main of our story, who gives her to his 18 year old son as a birthday present, to lose his virginity. There are some ugly bits of this movie, where one girl pays the ultimate price for running away, which is truly is a disturbing scene. The film is well acted by the young cast, and there are a couple of hotties, but the film never detracts from the reality and truth about what goes on in this girl's hell, or in the lives of the other girls in this sickening trade, where the punches keep coming back at ya. Finally she has to escape, where again it's a revolving door. The last scene, especially is a reminder of that very fact, for the what the price of a child's beauty, holds. It's something as if a scene out of Matrioshki, where yes, the film is stereotypical, but they are all with their small familiarities, if plot points, whatever. But with this one, I like it's unflinching pull no punches, ugly side of the trade. An stern quality about the film, I admired."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Apema Filmes",
         "Caradecão Filmes",
         "Globo Filmes"
      ],
      "summaries": [
         "In 2002, 12-year-old Maria, living in dire poverty with her family, is sold by her fisherman father to prostitute recruiter Seu Tadeu, who takes her to a low-class brothel in the Amazon region. While she suffers innumerable abuses, Maria only thinks of escaping the horrible conditions she's faced with.",
         "Maria, a 12-year-old girl, is sold by her parents, believing she was going to work as a maid at some rich family's house. But the people who bought her have other plans: they'll force her to work at brothels all around Brazil, as many poor girls her age."
      ],
      "budget": 1500000
   },
   "movielensId": 153486,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "2006-03-04",
      "dvdReleaseDate": null,
      "directors": ["Rudi Lagemann"],
      "runtime": 92,
      "movieId": 153486,
      "title": "Angels of the Sun",
      "mpaa": null,
      "actors": [
         "Antonio Calloni",
         "Otávio Augusto",
         "Darlene Glória",
         "Vera Holtz",
         "Mauricio Gonçalves",
         "Chico Diaz",
         "Bianca Comparato",
         "Mary Sheila",
         "Fernanda Carvalho",
         "Caco Monteiro",
         "Antônio Gonzalez",
         "Evelin Buchegguer",
         "Rui Manthur",
         "Maurício Gonçalves",
         "Larissa Beckman",
         "Kallanda Caetana"
      ],
      "imdbMovieId": "0847154",
      "originalTitle": "Anjos do Sol",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In Northeastern of Brazil, the father of the twelve years old illiterate Maria sells his daughter to Tadeu to be employed as a housemaid and have a better life. However, the girl is resold to the farmer Lourenço that deflowers her, and he gives the abused girl to his teenager son to have his first sexual experience. Then she is sent to a brothel in a gold field in Amazonas and explored his owner, the despicable Saraiva. When Maria escapes to Rio de Janeiro expecting a better life, she is explored by the cáften Vera.",
      "tmdbMovieId": 37993,
      "avgRating": 3.125,
      "releaseYear": "2006",
      "numRatings": 4,
      "posterPath": "/eMZ4WMnHgkQgnI8S0ByBEUHt0ZV.jpg"
   }
}