{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "alien abduction",
            "id": 12553
         },
         {
            "name": "found footage",
            "id": 163053
         },
         {
            "name": "abduction",
            "id": 235261
         },
         {
            "name": "smoke alarm",
            "id": 237394
         }
      ],
      "imdb_id": "tt0142074",
      "video": false,
      "title": "Alien Abduction: Incident in Lake County",
      "recommendations": [
         114635,
         33988,
         164423,
         211914,
         27773,
         32585,
         43099,
         378488,
         96235,
         31134,
         29297,
         110545,
         30081,
         100669,
         58789,
         39914,
         381063,
         20216,
         35203,
         50477
      ],
      "backdrop_path": "/5q6AHLDBcXKeWX5ZIgvwAD7NiE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Matthew McPherson",
               "gender": 2,
               "credit_id": "52fe43dcc3a368484e0023d9",
               "name": "Benz Antoine",
               "profile_path": "/gLOKZwkcDjCIyZAQeOZ6rbWKYQm.jpg",
               "id": 80178,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tommy McPherson",
               "gender": 2,
               "credit_id": "52fe43dcc3a368484e0023dd",
               "name": "Kristian Ayre",
               "profile_path": "/xAgueVKdQxgjxt4kwVtwXQF6nmT.jpg",
               "id": 85811,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roselyn McPherson",
               "gender": 1,
               "credit_id": "52fe43dcc3a368484e0023e1",
               "name": "Gillian Barber",
               "profile_path": "/qoqPX15J5jh6Sy0A9JvvRJIuw64.jpg",
               "id": 56522,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Brian McPherson",
               "gender": 2,
               "credit_id": "52fe43dcc3a368484e0023e5",
               "name": "Michael Buie",
               "profile_path": "/bbOL5cofgLQFm8SF7JW0D0d8lqz.jpg",
               "id": 85812,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Renee",
               "gender": 1,
               "credit_id": "5890b63dc3a368701d00759c",
               "name": "Emmanuelle Chriqui",
               "profile_path": "/oEvHO6yJnGHvD5vObI31UglPcwP.jpg",
               "id": 59192,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Melanie",
               "gender": 2,
               "credit_id": "5890b64992514103f7007d37",
               "name": "Marya Delver",
               "profile_path": "/8qyWiiKOlNiZbvVhrYuJjouHQmC.jpg",
               "id": 75948,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Rosie",
               "gender": 0,
               "credit_id": "5890b655c3a368701d0075ac",
               "name": "Katlyn Alexandra Ducharme",
               "profile_path": null,
               "id": 1239262,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Linda",
               "gender": 1,
               "credit_id": "5890b660c3a368702000772e",
               "name": "Ingrid Kavelaars",
               "profile_path": "/iMi9SA3CCmiAhdQEMHuq48M7xzh.jpg",
               "id": 147473,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Kurt",
               "gender": 2,
               "credit_id": "5890b67492514103e4007cd6",
               "name": "Aaron Pearl",
               "profile_path": "/bgc9RfqNqK4pPVmt4FWJtlCS1fz.jpg",
               "id": 27128,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Colonel Hampton",
               "gender": 0,
               "credit_id": "5890b68ec3a368701d0075d6",
               "name": "Gary Hetherington",
               "profile_path": "/nYXYnXGAGrwuFZKVOVZhSdatmmK.jpg",
               "id": 85545,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43dcc3a368484e0023eb",
               "name": "Dean Alioto",
               "profile_path": null,
               "id": 85813,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dcc3a368484e0023f1",
               "name": "Paul Chitlik",
               "profile_path": null,
               "id": 85815,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dcc3a368484e0023f7",
               "name": "Dean Alioto",
               "profile_path": null,
               "id": 85813,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.103994,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20182,
      "vote_count": 33,
      "budget": 0,
      "overview": "After a mysterious blackout, a son goes out to investigate and captures footage of actual aliens. When the aliens follow he and his brothers back to their home all hell breaks lose.",
      "similar": [
         348,
         49849,
         126889,
         228161,
         602,
         22824,
         10200,
         47933,
         118340,
         7191,
         299687,
         137113,
         274855,
         2675,
         339964,
         8077,
         7453,
         68179,
         16866,
         274870
      ],
      "original_title": "Alien Abduction: Incident in Lake County",
      "runtime": 93,
      "poster_path": "/q9lMEcT641gXaNkDxi9G2Hq2JDz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "dick clark productions",
         "id": 3734,
         "origin_country": ""
      }],
      "release_date": "1998-01-20",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dean Alioto"],
      "runtime": 93,
      "synopsis": "The footage, interspersed with \"expert\" interviews, begins with the McPherson family gathered for Thanksgiving dinner. The power goes out, so Kurt and Brian go outside to check the fuses; Tommy follows with his camera. After finding the fuses charred and partially melted, they head into the woods to investigate a transformer which is throwing sparks. They find a UFO in a nearby field. As they watch from the treeline, two aliens exit the ship and use a ray-gun on a cow. Despite their attempt to remain hidden, the three men are spotted. They rush back to the house and try to convince their incredulous family to flee while there is still time. They see lights in the sky and a furtive figure outside a window, but the family refuses to believe the brothers' story until Tommy plays them the tape. Suddenly, a high-frequency screech incapacitates everyone but six-year-old Rose. When it stops, Kurt straps a flashlight to his shotgun and decides to get everyone in his truck and leave. The truck won't start. The battery has melted so they return to the house. As they take stock of the situation they hear scrabbling sounds from the roof and discover that an alien has made its way in through an open window. Kurt leads the way up the stairs and begins to search. Tommy takes the opportunity to go into his bedroom and change his soiled pants when is ambushed by an alienit (apparently) puts him in a trance, investigates his camera, and slips away, leaving Tommy with no memory of the encounter. Tommy is awakened by the shouts of Kurt, who has trapped an alien in an adjacent room. They are greeted by a laser shot and Kurt responds with his shotgun. Everyone retreats downstairs. A ball of light floats into the house and puts Renee into a coma. Kurt and Brian go outside to try to swap out the truck battery in a final attempt to get the family to safety and take Renee to a hospital. Seemingly minutes after they leave, gunshots are heard outside and the lights begin to flicker. Those who remain experience a series of vivid auditory and visual hallucinations to which Rose seems to be immune. Tommy puts the camera down, and in a moment when she is left alone, Rose takes the shells out of the remaining shotgun. Later, everyone (except Rose) feels a burning sensation on the backs of their necks where they discover triangle-shaped burns. The group becomes hysterical as more shots are heard. They go outside where Tommy discovers a couple of mangled shotguns, but not his brothers. The camera pans towards the woods to reveal strange lights and two approaching figures. Everyone races back into the house where they barricade themselves in. The camera is dropped and goes black. Tommy then gives a tearful testimonial, a la The Blair Witch Project, and wonders if he'll live to see tomorrow. He searches through all the rooms and suddenly comes face-to-face with an alien. Tommy drops the camera and stands frozen in a trance-like state. The tape stops. The family and their guests haven't been seen since. Alternate ending An alternate ending is presented in an extended version of the film, made available after the initial television airing. In it, the family is seen re-entering the house and, after the death of Renee, the survivors gather around the table to eat in order to keep up their strength and spirits. It is implied that Rosie unlocks the front door because the aliens gain entry to the house and subdue the family with what appears to be psychic powers. An alien disables the camera as the family is seen following the aliens out of the house. Though the tape is a depiction of a supposedly real incident, the actors' credits roll at the end, showing that the film is, in fact, a work of fictio",
      "writers": [
         "Dean Alioto",
         "Paul Chitlik"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0142074/",
      "coverLink": null,
      "actors": [
         "Benz Antoine",
         "Kristian Ayre",
         "Gillian Barber"
      ],
      "reviews": [
         "Now when watching this we know that its not real because it shows the aliens craft and what they look like and this would be hard evidence of the existence of aliens and this wasnt in the news. So we all know that this film isnt real but leave that and just watch a scary film. Now ive read all the reviews and they say its sh** scary and I agree, I watched it at 1am in the morning and was terrified. Now this came before blair witch so dont say its a rip off of the film. You have to see this wonderful TV Movie to experience one of the scariest movies ever.",
         "I find it rather strange how many people can find flaws with this movie. Many people may think the little girls' acting was too calm for someone her age (if she was actually in the situation of the film). To you I would ask were you just judging the actors abilities or trying to watch the film? If you were watching, you would have seen and understood that she had some sort of connection with the aliens. I did not watch the movie from the very beginning (I missed about 20 minutes), but throughout she was telling the family how to act, as she knew what the aliens were doing. She kept running upstairs, as if by force, trying to see the alien. When Tommy put down the camera she unloaded the shotgun so that if the aliens did come within firing range, they would not get hurt. If you were watching her carefully, you would have seen her drawing aliens, even though she never saw them (correct me if I am wrong, as I said I missed the first 20 minutes). And the concluding story to her so called \"calm acting\" was when at the end when the aliens walked in she didn't even get drawn to the aliens like the rest, she just walked to join her flock. And if you didn't pick up on this, the choice of putting her photo last out of the whole family (when if you think about it, it should be Tommy), and giving that image more on screen time than the rest shows she had some significance. When I was about 11 years old, at the time of Blair Witch came (not being able to see it though), I was drawn into the hype as I didn't fully understand how the world worked. For people of about 14 and upwards, you should understand even if video footage was found of a family who have been abducted (and nowhere to be found), the government would never allow it to be released for TV (at least not after many years of working with it). I think most of you already knew this. So you shouldn't watch the movie and complain about the obvious fact its a film made for entertainment! For the time you part of the movie, it is meant to seem real as it makes you emote more. But afterwards you leave the film and realise it was a movie and thought it was a great one at that. The film makers would not deny it was just a film. That phone number before the credits just helps to keep you part of the film. I can understand how for some people the cuts in the film (where it fades to black then to an expert) can be very annoying, but it effectively heightens the suspense. Just as something creepy happens because of the aliens, the frame pauses just on a really interesting picture. After this you are on the edge of your seat trying to see the aftermath. I never knew any of these actors when I saw the movie, so maybe I was at an advantage rather than always thinking \"Thats the guy from Stargate!\". I thought overall it was a great movie, and I was watching in constant suspense. So I think this movie is for any suspense seeker, especially for those who have a craving for some alien invasion. Okay, now I would like to make the flaws of the movie that are actually important known. The amount of the light that the camera has available is too much for any flashlight (I believe he is holding one whenever he is outside). Instead I think the night-vision capability should have been used (which is widely available on the market of DV cameras these days). This would have enhanced the element of being made by a teen with a cheap camera. Thats it. After all, again, it was a film, and not real life. Genuinely scary and gripping from start till end, though still requesting more footage, this film gets a 9/10. A must see, but do not buy (as its one of those films you don't want to regularly watch).",
         "This film is an absolutely brilliant idea executed to perfection. The actors are superbly convincing from beginning to end. I first saw it under the belief that it was supposed to be an actual incident - and this is how the film was intended to be seen. It was years later that I realised it was a film not an actual record of events. Perhaps it is because of this that I found the film so convincing, but it is well worth watching even though you have seen that it is not a record of an actual alien abduction. However, the impact of the film will be lost on you. This does not diminish the skill of the film at all and I congratulate all concerned on conceiving the film and in carrying it off so convincingly.",
         "Well, I'm actually sitting here, now in 2006, actually scared more than half to death , I'm on my own, the film finished about 10 minutes ago its 1.10am, and Wow...am I scared! Apart from still shaking ( I don't like horror films at the best of times ), it was a really really good film, the screenplay and acting of all the characters was too perfection ( apart from the Black guy, his performance let things down I think ) The imagination and initiative of the scrip to make it seem like it was not plotted was one to be reckoned with, a truly amazing, spine-shivering film. I still have tingles going round my body..I doubt I will sleep tonight!",
         "In 1992, BBC give us Ghostwatch which scared me and kids around the UK on Halloween. Then in 1998, I came across this film and was scared even more! I love all things about Aliens and this film wasn't a let down, in fact, it's amazing! It's pure horror and it's freaky to watch them all get taken one by one, I hid behind my pillow throughout the film! A lot of people call it cheesy and rubbish, but to me, it's great! I mean after Ghostwatch in 1992, which was a hoax too, but that doesn't matter. If it can scary you to death and make you believe it's real, it does it's job! So I hope to get this film on DVD very soon, it would be very welcome in my collection!",
         "I lived in Ontario, Canada in 1997/1998 and one day in 1998 CKCO-TV (owned by CTV) ran a special report called \"Abduction in Lake County\" it ran for roughly 35 mins and another 30 mins afterwards was the Sheriffs reports, expert interviews about the tape, etc. This is not what was originally shown in 1998! This movie is clearly done by actors (I recognize them from multiple shows) and the original was terrifying, literally terrifying! This one isn't, it's a complete mockery. This is clearly a re-make of the original footage. Anyone who saw the original would know this. This is what happened in the original. A farming family is getting ready for a dinner, the son is playing around with the video camera, within minutes the power goes out, they think its a lightning storm, the father and 2 sons (1 has the cam with him) go to check it out outside, they notice a nearby transformer is sparking and sustained damage, they walk closer to see it, they look down under the transformer and notice 3 aliens slicing a cow with a laser, they get spotted, 1 alien fires the laser at them (no beam is seen), the other son is injured, they run back to the house, tell the family, the family immediately panics and wants to take the son to the hospital, the father and the son go to the truck (a really old beat up truck) and cant start it, they notice the engine was completely melted, they run back to the house, and they hear them upstairs, the father and son walk up the stairs and hears a alien in the bedroom (the door is closed), the alien fires a laser through the door, the father fires the shotgun, kills the alien (presumably), they run back down, the family is panicking even more, they attempt to run out of the house, an electrical bolt/laser comes through the window above the door, injures another family member, they run back to the dining room, a loud noise enters the room, they fall in pain, the sound stops, then they notice they all have nose bleeds and what appear to be radiation burns on their bodies, the little girl (no older than 5) says (in a monotone voice) that everything is going to be OK, she seemed zombified and keeps reassuring them everything will be OK and not to worry, she doesn't move or say anything else, the father finally goes out of the house to try to get the truck working or find some other transportation, they hear shots fired, they all run out and notice he's gone and the shotgun is melted, they run back to the house, the son with the camera goes upstairs to change his pants (because he peed himself) he goes back down and notices everyone is gone, he runs back upstairs in the bathroom sits on the toilet, sets the camera to point at him, he says he's scared and doesn't want to die, he starts crying and he says he doesn't know what's going on or why are they doing this, then you see a 3 fingered hand grab the camera lens, a alien grabbed it, looked at it (meanwhile the lens is facing it so you see the alien)it then puts the camera down in a different direction, and that's all you see. (all this happened in roughly 35 mins) These people were not recognizable, not actors, they were kind of ugly in fact. This movie (Warning: Contains spoilers) was nothing like the original. This movie lasted over an hour, and it includes family arguments, bad acting and a lot of soap-opera style drama. This family sits down and eats dinner while they know aliens are outside, no one panics, the little girl is a lot older in the video and is too active and talkative. She takes shells out the gun and hides it (didn't happen in the original). This movie includes elements of racism (again which didn't happen in the original). The truck is newer. The battery is destroyed, not the engine. The eldest male person is an older brother, not a father. You see a red light hit the son. You see a ufo and 2 aliens in front of it (which look like terrible Halloween costumes) they are not under the transformer. There is no electric bolt/laser ever shown. Aliens are heard on roof, not upstairs. A alien is shot upstairs in a different room. They go through a whole ordeal with walking in the room, looking at the body, tying the door, putting a bookcase in front of it. The whole family comes upstairs (again not original). The family sits and eats some more, the mother drinks heavily and is only talking about the dinner and having dinner. Everyone is relaxed and not panicking. The African American actor is a lot taller and plays a major role in the film (in the original he was a quiet guest that was terrified and wanted to leave). There is drama where he making out with the other guys wife. The son with the camera runs upstairs to his room to change his pants and that's when he encounters a alien that seems to hypnotize him, but somehow he ends up going downstairs to eat dinner again. He places the camera on a kitchen counter, they eat dinner some more, a red light enters the room and it shows 2 aliens (obviously costumes, its awful) begin taking the family members away and then the camera slowly gets static on it and fades out, then it goes to credits. Seriously, did they think that people who saw the original and remember it would honestly fall for this film? The real footage is gone forever I assume! This movie is not worth seeing because it's not the original.",
         "I first saw this movie on Sky Digital here in the UK.. I am aware of it being a fake but I still liked it.. I liked the way it's made to look like a home movie.. This makes it seem more realistic and I like the way it's made to seem unscripted.. This gives it a raw genuine look and feel.. I also liked the way they had segments which cut away from the movie with people commenting on the footage.. I take this movie for what it is. A fake made to look real.. I like it none the less.. Also I have to keep commenting for up to 10 lines due to the 10 lines minimum law.. So Er yeah like I was saying I like this movie because it's a movie I enjoy and movies that I like to watch I enjoy watching...........",
         "Ok I believed it at first. You see here in Chile, when this film was recently released, appeared a so-called UFOLOGIST in a TV show telling that this movie ( or whatever it is) was true, so I was dying to see it & comprobate it. When I saw this production, i was shocked at the beggining, but I realized then that it was a joke or hoax. It's impossible that a 16 years old kid could film scenes with that temper...my god neither a pro could film like that ! I must admit also that the performances of this movie was very variated. I must celebrate the incredible acting of the little girl ...it was awesome ! but another ones, like the black boyfriend of the McPherson sister or 1 of the brothers really sucked. But as the guy who commented this movie before me I have the same question : What in the world was this?",
         "Growing up in the nineties, UFOs and alien abduction were on many tongues. Obviously in pop culture since the sixties, the decade of my youth was filled with stories of little gray men and nocturnal visitations. \"Communion\" was recent enough to be easily found in libraries, \"Fire in the Sky\" hit theaters in '93, and pseudo-science \"documentaries\" filled cable. For many years, I considered alien abductions to be definitive proof of extraterrestrials. As a teen, I spent many nights worrying about seeing grays in my bedroom. Until I read about sleep paralysis and found it explained the majority of encounters. Anyway, it's a good thing I didn't see \"Alien Abduction: Incident in Lake County\" when it first aired on television. There would have been many more sleepless nights if I had. A found footage film just predating \"The Blair Witch Project,\" if not \"Cannibal Holocaust,\" \"Alien Abduction\" depicts the McPherson family's Thanksgiving dinner, all filmed by youngest son Tommy. At first, the tensions of Thanksgiving are normal, such as mother's alcoholism, the liberal sister bringing her black boyfriend to dinner, and her racist brother reacting to it. When the power goes out, the three brothers discover a cadre of aliens mutilating some cattle. The family spends the rest of the night terrorized by the beings, Tommy catching it all on tape. There's a reason found footage has taken a foothold in the culture. It's not just because the movies are cheap to make and speak to millennial paranoia about privacy. The best moments of \"Alien Abduction\" create an eerie tension. The lack of any music has the audience listening carefully for sounds off-screen. Similarly, the hand-held camera-work has the viewer watching the corners of the frame, on the look-out for half-seen aliens. The best moment in the film involves Tommy retreating to his bedroom and putting the camera down. When he picks the camera up, an alien appears in the room. Without an obnoxious score signifying the scare, the jump is allowed to breath, stretching to disturbing lengths. Another notable moment involves the men retreating outside, noticing the upstairs bedroom window is open. Both of those awesome bits take place in the first hour. Smartly, the movie doesn't mess around, getting to the action quickly. However, the premise proves too thin to sustain a 93 minute story. The middle section involves the family dodging a red light, caring for a sick family member, experiencing burning rashes and, weirdly, deciding to continue dinner. The aliens are apparently petty pranksters, psychically manipulating their victims. The mother sees her dead husband, the black boyfriend and oldest brother's wife make out, and the little girl plays an unheard piano concerto. The movie lays down the cards concerning the little girl early. She's either possessed by aliens or being psychically controlled by them. Most annoyingly, the story is occasionally interrupted by talking head interviews. Some of the interviewees are connected to the story, like the Lake County sheriff. Others, like a Hollywood special effects technician or British rock star, have little to do with what's happening. Either way, the segments unnecessarily distract. Despite the style choices and dragging middle, \"Alien Abduction\" picks up at the end. The final image, the family sitting around the table, the aliens slowly coming to abduct them, is rather creepy. The movie has a bizarre legacy. It was aired on UPN, presented as true, and heavily edited to conform to docudrama standards. Despite having end credits, many were convinced it was true. \"Alien Abduction\" is actually a bigger budgeted remake of the same director's first feature and probably based on the Hopskinville/Kelley incident. Weirdly, a tape of that rare, original film circulated at UFO conventions, convincing many it was true. Despite the director out right saying it's fiction, some people still believe the original McPherson tape is legit. You can't convert those who truly want to believe. Anyway, \"Alien Abduction: Incident at Lake County\" won't blow your socks off. The acting is sometimes sketchy and the writing occasionally rough. The premise is still fantastic and the creepy, effective moments justify the whole project.",
         "A found footage alien abduction movie that originally aired on the UPN network in January of 1998. Much like the contemporaneous Blair Witch Project, many were convinced it was real. It's very clearly not. The acting is very amateurish. The film is broken up with interviews from experts. One of them, a film director, claims that it has to be real because it has no real plot. The fact is, not only does the film have a very basic horror movie plot, it also has about half a dozen subplots, like mom's alcoholism (the woman carries a wine glass even while running from aliens) or sister's dating a black man. No matter, though. For what it is, it's actually very well done. It's quite frightening. I'm surprised it didn't lead to bigger things for the director. I suspect, given which network it aired on, that almost no one saw it at the time. This is actually the second version of the film. The first was made nine years earlier. Both versions can be found on Youtube.",
         "when the film came out on TV around 98 or so I saw it and thought it was the best sci-fi film that was ever made.....bare in mind I was 8. Now in 2007 i watched it a second time and before seeing it i saw people on the IMDb website saying words like it's superb or excellent and and thought to myself it must be as good as I remembered. Oh God how I was wrong. I seriously can't find one good thing about this movie. This is the perfect example of bad film making... 1) Bad Script (e.g. The Blond saying Kurt is out there more than 15 times etc) 2) Not realistic (e.g. Tommy not putting down camera....ever) 3) Terrible! acting (I seriously tried to get into the film but the bad acting from EVERYONE accept from the black guy and the one called Mel...and they were only okay) 4) Eye Sore watching all the different camera angles from the camera 5) Not Original (came out just after year after Blair witch came out) 5 great reasons to hate this film and for the love of god read this = IT IS NOT REAL, IT IS NOT BASED ON TRUE EVENTS, IT IS A STORY Written BY DIRECTOR and just found out today the film has a fan club. this is the first film i have ever said was terrible (check my records) and i can't understand why anyone over 10 would think this was real or any good at all! COP ON!",
         "I thought it was a brilliant film, it was well shot, and very suspenseful. Although the actual aliens themselves were very crappy, they compensated for this by only shooting them with he camera out of focus, or in darkness. A minor triumph in independant cinema, for a tv film, I was thoroughly entertained, and even scared on occasion, which I don't think I actually have been before when watching a movie. (and i've seen ALOT of movies) Late night gold :) Watch it if you catch it, but i wouldn't buy it personally. Not to knock it ro anything, just not the kind of thing i like to watch over and over. Mistakes are numerous, but quite frankly I don't give a damn, this is a cracking film.",
         "First off, if you don't have an open-mind to the belief in Aliens, you will most likely find this movie to be completely awful and boring. But if you're like me, and absolutely believe in aliens, this movie should deliver, a little bit anyways. The movie is shot in Blair Witch fashion by a young kid who is using his new video camera to document his family's Thanksgiving. Funny thing is this movie was made a year before the Blair Witch Project, so in reality BWP was copying this movie....and this movie was copying Cannibal Holocaust. But anyways, things go awry when the three brothers go out to find out what's the problem with the electricity, which was shutoff possibly by lightning. The brothers notice something in the distance and decide it's best to check it out. What they find is a UFO and aliens doing their research on some unfortunate cow. Obviously they're not being quiet and stealthy enough and the Aliens see them. From this moment the Aliens instead refocus their attention on the humans, and obviously the humans don't handle the situation in a very safe manner. Aliens \"mess\" with humans, and this is how the story goes. The good thing about this movie, is that it was made. There are no way near enough Alien based movies out there. There are mounds and mounds of ideas available concerning Aliens, be it Greys or Reptilians or Alien/Human hybrids.....it's a genre of film that should be paid more attention. But unfortunately, the movie itself is very amateur. The acting is laughable at times. Especially the breaks between the footage where they interview a specialist of some sort. I do applaud all the actors since they are all trying very hard to come across as \"real\", but they are trying way too hard. The mother and oldest son are especially weak. The writing also is pretty weak....at such an unbelievable time, the main focus of sane people would be to relax. But instead there is confusion, anger, and illogical thinking all over the place. Another good thing about the movie is that the makers of the film know a little bit about Aliens and they tried to implement all their knowledge into the film. Although at times it seems they're trying to do too much, but it still works kinda well and keeps the pace up pretty high. One another surprising aspect to the movie is that it actually has a couple decent scenes of tension. There is zero music (obviously it's footage) and mixed with dark scenes where an Alien may be around the corner....it's more than passable with the scares. But again, if you don't care for anything Alien, you're just gonna roll your eyes. Alien Abduction: Incident in Lake County is an average film through and through. It has a couple good scares and a nice idea, but it truly suffers from acting and writing. Knowing that people actually believed this was real footage and that the people being interviewed were actually real.....it's mind-blowing how out-of-it some people are. Again, if you're into Alien based flicks like Communion and Fire in the Sky, it's wouldn't be a waste of time to check this film out. But if you don't like Alien stories and independent flicks, I'd skip this. 6 outta 10",
         "Comment already written: Okay, you got a kid with a video camera videotaping a family's alien experiences. Three mistakes: 1) The second time they aired it, they put in \"lost scenes\". That only comes with a real movie, not a video recording. 2) They picked a guy who actually had a filmography (meaning he had acted before in noticeable shows). 3) The fatal mistake: THEY CREDITED THE ACTORS IN THE VIDEOTAPE!!! IT SAID \"ALIEN 1: SO-AND-SO\", LIKE THAT! SERIOUSLY, UPN, HOW STUPID DO YOU THINK THE PUBLIC IS? And now the sad part. 50% of America thought this was a real videotape! If you never saw this, stay away from it at all costs! My comment: Well, if 50% of america believed it was a real video. I would give it a 10 !!! I saw the movie and I first thought it was real too. It is a well thought and good made video. It really seems like they's verry affraid. And besides all this, it was really thrilling. So, .. good movie..",
         "You know the story of this utterly bananas 'found footage' movie, so here are a few supplementary observations. -Crouching in the woods watching the alien the three sons noisily shush each other quiet, then when the alien sees them, they run away shrieking like little girls. -The aliens are armed with laser pointers. Guess they stopped in at an office supplies place to tool up before going a-probing and a-cow-tipping. -Drinking game: Every time someone says 'what was that?' More hardcore drinking game: Every time the mum is seen with her wine glass. -Tommy can't film the dead alien upstairs because older brother Kurt says it might not be dead yet. Yet it's okay for everyone else to crowd closely around the 'corpse' and obscure it from the camera? -Why is the grand-daughter so calm? Because you can't genuinely terrify a wee kid just to make a TV movie and so the script has her 'in league with the aliens'. Or something. -Nobody ever threatens to shove that damned video camera up Tommy's butt. Video cameras capture SOUND as well as pictures, so we didn't have to see everything. Some subtitling of conversations on a black screen would have been a welcome atmospheric touch. -Did the editor forget to dub in the grand-daughter's 'amazing' piano playing? -The mum is remarkably hot, even behind those silly 'old lady' glasses. Kurt was brave to leave big hunky Matthew behind with all those sexy women...",
         "Well, i cant believe what a film that was, If you are like me, then you will find that horrors nowadays are not what they used to be, But JACKPOT BABY, I mean i know that it is made in 1998 but it does not stop it from being probs one of the greatest horrors to be made, Right from the start it actually maintains the course of looking like a genuine home video, and when they realise the aliens are actually after them, The horror on there faces, Some believe Sum Do not, it is just brilliant, And the Way that they portray that Rosie has been taken over somehow is just brilliant, Also they bring in the racist side of it tackling that view with great authority, they make every bit of the film as enjoyable as the ever, People who are looking for flaws in the film i have this message( My God Get A Life ) its a film go bloody have a pop at a Disney film or summit, As for me This is Danny Robinson Signing out with a big 10 outa 10",
         "I have seen this movie a few times now, each time I watch it , I really enjoy this movie . Teenage boy filming his family thanksgiving before they can cut the turkey, they get disturbed by things from another world! I like how the movie did not take to long to get going , the movie flowed really well , the first half of movie was really fast past. A lot of strange things started to happen to the family , I really enjoyed those , they made it look so real (I know it not ) . There were some calm scenes in the middle part of the movie, we. suited the movie really, it did not last, as more odds things started happen again I really liked the fact the lite girl had some sort of connection with aliens some how, which strange in A good way. The acting in this movie was really good , in mostly places, there few actors in some scenes could have been better. When I saw the ending of this movie, I thought the ending was good and creepy at the time, it seeing again made me think. (Aliens did not seem to that creepy this time around) Would it have been so better if we never saw the aliens at the end, if the movie? , should have left to are oen imagination! I am going to give this movie 8 out of 10",
         "Compared to the original, the story is much more fleshed out, much scarier and the acting is much better. Throughout the beginning of the film, the acting seems quite fake, but near the end, the acting is brilliant and seems very real. The point of the movie is to seem realistic and acting is a gigantic point of that. But, it does only very well near the end. Also, the cuts in the film are quite annoying but also funny because you know they're fake. This does quite ruin the realism though, but it was funny to see the director - Dean Alioto in one of the cuts saying \"No one could have directed this except me\". I kind of think another remake would be pretty amazing with better effects and actors (maybe the same actors, just years on when they've gotten better!)",
         "The script is awful. The aliens are crap. The characters are irritating idiots, even by zero-budget horror flicks standard. The lines these characters come up with are probably the most ridiculous in the history of cinema. Many of them are complete non sequiturs. Also, everyone keeps shouting and stating the obvious - that is when they are not busy talking complete incoherent nonsense. Still, I can see where they got the idea for the movie 'Signs': aliens on the roof, people trapped inside the house, locking an alien inside the room... I don't really mind the cheapness, the main problem is the script, which is indescribably bad. A child would write better than that. If they'd completely improvised the whole thing it would have turned out better. Another thing that doesn't work at all is the constant cutting to various interviews, which are ridiculously fake and dull. I have no idea what they were trying to accomplish with them. They just break up the action and make it look like they are trying to convince us the thing really happened, even though the footage of the family has already established a contract with the audience whereby we all know it's cheap and ludicrous, but we play it like a joke. Once you decide to watch the film in that way, the interviews become annoying.",
         "There has been a big discussion going on about whether this movie is real or not - I fail to see the point behind that as, to me, it's just a horror movie - and a really good one at that. I knew it was a mock before watching it, so I was just looking for a decent horror/ sci-fi movie. In a nutshell, the movie depicts a family hiding in their house as it's being attacked by extraterrestrials - that's basically the whole plot, so there's not much depth to expect. You see the entire film through the eyes of family member Tommy's hand-held camera, much like in \"The Blair witch project.\" The real horror comes from what you don't see: Instead of throwing crisp images of blood-lusting aliens or expensive special effects at you, the producers show hints of what's going on (things explode outside the house, there's thunder and sparks), but you rarely actually see what's happening. Most of what you don't see is explained by the family members as they run around the house together, trying to fight off the intruders. The fact that you only see what Tommy sees makes for a really dense movie as you follow the same character all the time, seeing things from his perspective. The actors did a good job, too: All of them play believable roles, so it's not much of a wonder people thought this video could depict an actual incident. That's pretty much it: To sum it up, this movie managed to do what dozens of others failed to achieve - it scared the hell out of me. Much fun.",
         "great film i have this film got it off sky sum time and yes its freeky as hell there's no blood no swearing and sorry to those people that want to see it but no nudity well its censored. anyway i thought this film was real when i first seen it and i couldn't go anywhere alone i became paranoid that the aliens were gonna come get me. i think this film is psychological and really gets to you.evan thought this film was fake some say it actually happened and this was the remake, ethier way it still freaks me out to this day not as much but i get those shiverer's down my back when i watch it. PS this film has 2 names as far as i no Alien Abduction: Incident in Lake County and Alien Abduction: the macpherson tape. if you no of any others or the real tape please say.",
         "Ok, seriously, this is what Blair Witch should have been! Face it! Here's why: You SEE the creatures! It's made on Thanksgiving, making it a plausible time to have a videocam out. The special effects aren't all bad. It scared the $*!& outta me! This was great. It was so realisitic. possibly one of the finest things UPN's ever done. I'm so glad I taped it too! I was so scared all night, that when my alarm went off for me to go to wake up for school, I was so terrified, that I just let it ring for 20 minutes afraid to move! I don't get scared easily either! Sure, there was some things wrong, but the first time I watched it, I didn't notice, so its not bad. The credits actually list the actors! As if we wouldn't notice?!? The other problem is the way it had the fake static. We've used videocams before. They don't do that. That was just a special effect. All in all, this show was great. I think I'll watch it again tonight! Hope I'm not as scared in the morning!",
         "how can this movie even got qualify as a Biography ?? This is nothing but a low budget sci-fi movie. The script and all the actings was so terrible, I just lost for words. Maybe back in the 1998 people are more easier to believe in such craps but now the year is 2013 and with so many reality shows out there so with just a few minutes into the movie, I can tell this was not a genuine home made video and then a few more minutes into it, I also found that the script and all the supposedly 'genuine' actings are really really bad. I would not even want to waste my time to write a review for this movie if it is getting a 1 star on IMDb but it is rated 6.2 so I got to speak of the truth :-)",
         "I almost like this film, but for all the wrong reasons. It's about a family trapped in their home during an alien siege. I stumbled across it about ten minutes in, and found it so bad I had to keep watching. I love the fact that for a supposed 'documentary' I recognised two of the actors straight off. The overall acting is pretty dodgy, (I love the girl yelling for Kurt every five minutes, who wisely leaves very early in the film) apart from maybe the son, (who's recording the whole thing) he's not too bad. But special mention has to go to the mother, who at no point was seen without a glass of wine in her hand, even when the family try to escape! By the time I actually got a glimpse of the aliens, tears of laughter were streaming down my face. How anyone who isn't a kid thought this film was real, I honestly can't understand. But I'll still give it a 2 out of 10, one, for making me laugh, and one also for the mum, for dealing with an alien invasion by getting completely blotto."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Dick Clark Productions"],
      "summaries": ["After a mysterious blackout, a son goes out to investigate and captures footage of actual aliens. When the aliens follow him and his brothers back to their home, all hell breaks loose."],
      "budget": 0
   },
   "movielensId": 153544,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-20",
      "dvdReleaseDate": null,
      "directors": ["Dean Alioto"],
      "runtime": 93,
      "movieId": 153544,
      "title": "Alien Abduction: Incident in Lake County",
      "mpaa": "",
      "actors": [
         "Benz Antoine",
         "Kristian Ayre",
         "Gillian Barber",
         "Michael Buie",
         "Emmanuelle Chriqui",
         "Marya Delver",
         "Katlyn Alexandra Ducharme",
         "Ingrid Kavelaars",
         "Aaron Pearl",
         "Gary Hetherington"
      ],
      "imdbMovieId": "0142074",
      "originalTitle": "Alien Abduction: Incident in Lake County",
      "genres": [
         "Drama",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After a mysterious blackout, a son goes out to investigate and captures footage of actual aliens. When the aliens follow he and his brothers back to their home all hell breaks lose.",
      "tmdbMovieId": 20182,
      "avgRating": 3.125,
      "releaseYear": "1998",
      "numRatings": 8,
      "posterPath": "/q9lMEcT641gXaNkDxi9G2Hq2JDz.jpg"
   }
}