{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0062997",
      "video": false,
      "title": "Joy of Learning",
      "recommendations": [],
      "backdrop_path": "/nsfG8W2KDd4p1OqV7TmE8ZE5HBb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Patricia Lumumba",
               "gender": 1,
               "credit_id": "52fe47e7c3a36847f814e50b",
               "name": "Juliet Berto",
               "profile_path": "/5ene8zcRp8ppEE8KEmQfC1SyfOi.jpg",
               "id": 18228,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Emile Rousseau",
               "gender": 2,
               "credit_id": "52fe47e7c3a36847f814e50f",
               "name": "Jean-Pierre Léaud",
               "profile_path": "/dzkPODapVe4CSubEqI9ytTCqnZ7.jpg",
               "id": 1653,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "52fe47e7c3a36847f814e513",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47e7c3a36847f814e501",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47e7c3a36847f814e507",
               "name": "Jean-Jacques Rousseau",
               "profile_path": null,
               "id": 146529,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47e7c3a36847f814e519",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "583729c9c3a36836be014bc7",
               "name": "Georges Leclerc",
               "profile_path": null,
               "id": 29678,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.801626,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 51205,
      "vote_count": 3,
      "budget": 0,
      "overview": "Night after night, not long before dawn, two young adults, Patricia and Emile, meet on a sound stage to discuss learning, discourse, and the path to revolution. Scenes of Paris's student revolt, the Vietnam War, and other events of the late 1960s, along with posters, photographs, and cartoons, are backdrops to their words. Words themselves are often Patricia and Emile's subject, as are images, sounds, and juxtapositions.",
      "similar": [],
      "original_title": "Le Gai Savoir",
      "runtime": 95,
      "poster_path": "/jGIouxKvrEOnBbu6tn0Moww9D9P.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1969-07-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean-Luc Godard"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Jean-Luc Godard",
         "Jean-Jacques Rousseau"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0062997/",
      "coverLink": null,
      "actors": [
         "Juliet Berto",
         "Jean-Pierre Léaud",
         "Jean-Luc Godard"
      ],
      "reviews": [
         "As descendants of Rousseau and Lumumba (Léaud and Berto) deconstruct images and sounds in the absolute darkness of an isolated studio, Godard, as the film repeatedly calls for, 'goes back to zero.' That is, he distills and destroys all the elements composing cinema and hurls 95 minutes worth of molotov cocktails at the establishment. Indeed, Godard is seen in the film only through his voice, as he whispers amidst the sound of a radio, like a guerillero preparing his attack on institutional cinema. More situationist than Marxist-Leninist, Le Gai Savoir has a unique sense of tenderness and wit, more of a continuation of leftist pop art that was La Chinoise than the nihilistic attack on consumer society that was WeekEnd or the cerebral rhetoric of a Lotte In Italia. Perhaps it is also due to the presence of Jean Pierre Léaud, the ultimate symbol of the 1960s as seen through the cinema, that Le Gai Savoir is at once in an announcement of something to come and a kind of unconscious eulogy for the end of 1968 (the film began before the protests and was completed after), today it stands as one of the most moving, remarkable and tender hommages to revolutionary aspiration and youth power ever made. As Jean-Pierre and Juliet discuss their revolutionary aspirations, their hopes and dreams, their rhetoric and their philosophy, powerful symbols of radicalism and pop culture strike the audience like a hammer coming out of the screen: A photo of Fidel Castro cutting cane, the sound of a revolutionary Cuban song, a famous quote by Ché Guevara, a reflection on Mao Zedong, many cartoons, a shot of Juliet standing in front of a background dedicated with comic book characters, the sound of a mechanical whistle which blasts through the screen sometimes and then finally, the logical conclusion of Godard's radical experiment with the chemistry of cinema, the complete dissolution of all the elements, a black screen with only sounds, so that we can return to the origin of everything, and recreate society.",
         "One rather confusing film. Apparently deliberately so. I enjoyed it thoroughly though. Some of the themes seemed to be: May 68 The inability to get rid of bourgeois society Sexuality - as something that brings together but rips apart Language Knowledge As usually with Godard it's also an statement about film - and in this case more than usually. It ends with Godards voice-over over a completely black screen saying something like that this is not the film that should be made, but that all films that will be made should have something that is this film.",
         "It has been almost twenty five years since I've seen this -- I saw it a couple times in the early 80s and I've never seen it available on tape or disk -- but I found it to be one of the most enjoyable lesson films from Godard. I though it was beautiful to look at, and quite funny in parts, and easy to follow. It IS extremely didactic -- but as the title says, there is JOY in learning. It's popping up in a Godard festival running at the Hammer Museum in June, on a double bill with Weekend, and I intend to check it out again. If I don't like it this time, I'll write again -- but I remember just totally digging this movie. The other writer here says that he didn't go to a Godard film for ten years he so disliked this -- but in my memory it was so joyous i wanted to see it again and again. hey -- maybe we're both right (or wrong).",
         "At one point in this cinematic essay (as someone close put it, not really a real storyteller Godard is here but an essayist with camera and sound), some still images pop up with Che Guevara speaking (I think it's Che), and it says that (to paraphrase) in order to be a true revolutionary one must love. I wonder how much love Godard really has to offer, or can really share through his film-making in the case of \"The Joy of Learning\" or Le Gai savoir. His film here, a capstone of his late 1960s work that started amazingly (La Chinoise and especially Week End with Sympathy for the Devil thrown in the mix) and ended with this, is cold and analytical and sometimes put together in such a way that I would need a professor in an advanced film and politics class to really get everything across in a class discussion. This is no longer a Godard who can communicate philosophical and poetic and political dialog through the means of cinematic entertainment and \"CINEMA\" (in caps and quotes), but an anarchist out to f*** with time and space and language... and only sometimes succeeding in my estimation. This doesn't mean that for some intellectuals or just those tuned into the socialist/Maoist revolutionary aesthetic may not have some enjoyment or tickling of the intellect here. Indeed there are some moments that even stick out amid the whole jambalaya of discourse and narration and non-sensible/incredulously self-indulgent diatribes by the two characters. But I was strangely more intrigued by the visual pattern more than the actual dialog and political ideas, wherein the two characters are placed amid a black background, minimal but striking and provocative lighting set-ups, and spliced-in still images of newspaper clippings and communist propaganda with a car's view of driving around a French city. It may be the strongest criticism of all that I connected more (and was wondering what his thinking was) to Godard as a director and editor than as a \"screenwriter\". So much of what's in here is only interesting in small bits and pieces as far as information goes, and has been presented better, more audaciously in other pictures (and with less satirical bite and bile than La Chinoise, possibly his masterpiece of political cinema), and I'm left with wondering how he did this or that or what his thinking was doing it then the actual ideas. But that's just me, your 'love most 60's Godard, usually bored or perplexed by everything after' movie-buff.",
         "This film is one of Godard's most didactic and least cinematic. It could easily have been a play. Taking place on a bare sound stage, the characters are meant to seem detached from the distractions of the world. This is supposed to allow them to dwell completely in the world of ideas and come to terms with the essence of revolution. But oddly this device seems to work against Goddard. Istead of creating an atmosphere of purity and lack of compromise, it seems as if they have detached themselves from reality and are completely wrapped up in themselves. One gets the idea that their thoughts are overblown to the point of becoming egotistical. Goddard is trying to show two people willing to go to the limits of their ideas. It is an interesting concept, but long after the point is made, he continues to make it to the point of tedium. Where Goddard tries to be an iconoclast, he only achieves a very painful boredom. It is an experiment that didn't work. The concept of the film sounds good but in practice it doesn't come across. I think this film is only for the hard core Goddard fan, or someone who so strongly agrees with his social-political view, that any statement of them is reassuring and pleasant. Unless you are one or the other, proceed at your own risk. I saw this when it came out in the 60's at a film fest in NYC at Lincoln Center. I was a big fan of Goddard at the time, but this film changed that. I didn't see another Goddard film for 10 years. I have gotten back to enjoying his films, but I would never revisit this one.",
         "As the 1960s went by, Jean-Luc Godard was increasing adding social concerns and strident political messages to his films, but never without breaking traditional storytelling, however zany it might be with his French New Wave style. In 1967, however, he set off on a new direction. LE GAI SAVOIR was the first production that Godard shot after he bade farewell to his usual crew and dedicated himself entirely to political filmmaking. Originally made for French television, it was rejected and only screened at a few festivals, and it is easy to understand why: LE GAI SAVOIR still feels very avant-garde and intense today, though the rich imagery will appeal to those comfortable with Godard's immediately preceding pictures. The film's title is best translated \"The Joy of Learning\". The two people that appear in the film are less distinct characters than representations of Godard himself: Emile (Jean-Pierre Léaud) and Patricia (Juliet Berto) meet on a darkened sound-stage and announce that they will study revolution. A heap of still images begins to appear on the screen: fragments of workers' union speeches, Vietnam footage, pornography, Parisian street scenes, Black Panthers, African guerrilla movements, fashion shoots, advertisements from magazines, and comic books. Emile and Patricia (but really Godard) wish to make sense of everything they are seeing and to put it in the right order, for Godard believed that cinema could reflect the truth were its materials only presented in the right way. Biting the hand that feeds him, Godard attacks French television, as well as other European television networks, and Hollywood. Godard's leftist sympathies were more Maoist (or rather an infatuation with a sort of fantasy Maoism shorn of horrors it inflicted on China) than traditionally Western European Communist, and some of his biting criticism is directed towards the Soviet Union. As the film opens with this chaos of social and culture themes, the dialogue is initially driven by free association, and there's a lot of humour in the way that Godard manages to link one issue to another. One can expect puns and bitter jokes, and Godard also whispers in voice-over over the proceedings as he famously did in his earlier film \"Deux ou trois chose que je sais d'elle\". In one section of the film, Emile and Patricia pose questions to three people brought in off the street: two children and an old man (the last seems a bit of a wino, really), basically giving a word and asking their interlocutor to say whatever comes to mind. This is intended as a way of showing how bourgeois society is or isn't willing to confront the issues of the age, but there seems to be some hope for the kids. The film closes on a hopeful note where the characters suggest that anything missing from the film will be shot by other well-known filmmakers like Bertolucci. \"It's a bit vague,\" they say of Godard's end result, \"But film makes people think.\" (Godard's peers didn't quite take up his challenge.) LE GAI SAVOIR is an interesting portrait of late 1960s Paris, or at least its radical side. Shooting began before the upheavals of May 1968, and Godard was certainly prescient of the coming wave of youth anger. Editing was finished after May'68, which allowed Godard to make references to Daniel Cohn-Bendit and his expulsion from France. Another way that the film is of its era is the way that Godard links his vaguely Marxist economic ideas with sexual liberation and psychoanalysis. Jean-Pierre Léaud seems to have less room for real acting here than in his other films of the 1960s, which is somewhat disappointing. Berto's part is remarkable, however. Godard has the camera constantly study her face. Berto is so consistently sad and pouting in Godard's films of the 1960s that the brief moment here when she laughs is absolutely shocking.",
         "Night after night, not long before dawn, two young adults, Patricia and Emile, meet on a sound stage to discuss learning, discourse, and the path to revolution. Scenes of Paris' student revolt, the Vietnam War, and other events of the late 1960s, along with posters, photographs, and cartoons, are backdrops to their words. The shooting started before the events of May 68 and was finished shortly afterwards. Co-produced by the O.R.T.F., the film was upon completion rejected by French national television, then released in the cinema where it was subsequently banned by the French government. The title is a reference to Nietzsche's book \"The Gay Science\". For me, this film just further cements the weirdness that is Godard. He is something of a cinematic anarchist, throwing just about any picture or sound he wants on the screen, and this seems to be a running theme of his throughout the 1960s. The extended scene where a child is playing a word association game -- what is that? Is that taken from another film, or did Godard actually include it for some sort of strange, revolutionary metaphor?"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Office de Radiodiffusion Télévision Française (ORTF)",
         "Anouchka Films",
         "Bavaria Atelier"
      ],
      "summaries": ["How do we learn? What do we know? Night after night, not long before dawn, two young adults, Patricia and Emile, meet on a sound stage to discuss learning, discourse, and the path to revolution. Scenes of Paris's student revolt, the Vietnam War, and other events of the late 1960s, along with posters, photographs, and cartoons, are backdrops to their words. Words themselves are often Patricia and Emile's subject, as are images, sounds, and juxtapositions. In addition to the two characters' musings, the soundtrack includes narration, music, news clips, and noise. The result is a montage, a meditation, a reflection on ideas and how words and images mix - and how filmmaking is a path."],
      "budget": 0
   },
   "movielensId": 153524,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1969-07-12",
      "dvdReleaseDate": null,
      "directors": ["Jean-Luc Godard"],
      "runtime": 95,
      "movieId": 153524,
      "title": "Joy of Learning",
      "mpaa": null,
      "actors": [
         "Juliet Berto",
         "Jean-Pierre Léaud",
         "Jean-Luc Godard"
      ],
      "imdbMovieId": "0062997",
      "originalTitle": "Le Gai Savoir",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Night after night, not long before dawn, two young adults, Patricia and Emile, meet on a sound stage to discuss learning, discourse, and the path to revolution. Scenes of Paris's student revolt, the Vietnam War, and other events of the late 1960s, along with posters, photographs, and cartoons, are backdrops to their words. Words themselves are often Patricia and Emile's subject, as are images, sounds, and juxtapositions.",
      "tmdbMovieId": 51205,
      "avgRating": 3.7,
      "releaseYear": "1969",
      "numRatings": 5,
      "posterPath": "/jGIouxKvrEOnBbu6tn0Moww9D9P.jpg"
   }
}