{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0342777",
      "video": false,
      "title": "Misa mi",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Misa",
               "gender": 0,
               "credit_id": "52fe4a6cc3a368484e152643",
               "name": "Kim Jansson",
               "profile_path": null,
               "id": 1074855,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mormor",
               "gender": 0,
               "credit_id": "52fe4a6cc3a368484e152647",
               "name": "Lena Granhagen",
               "profile_path": "/kyTwXHZXnwJpPyobiWIcjR8aE0R.jpg",
               "id": 560051,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pappa",
               "gender": 2,
               "credit_id": "52fe4a6cc3a368484e15264b",
               "name": "Magnus Krepper",
               "profile_path": "/iHJ5HM0bV5UfogcOobnKJtyJklf.jpg",
               "id": 143391,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a6cc3a368484e15263f",
            "name": "Linus Torell",
            "profile_path": null,
            "id": 1074852,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.565309,
      "production_countries": [],
      "id": 121754,
      "vote_count": 0,
      "budget": 0,
      "overview": "When her mother died, 10 year old girl Misa's world stopped. And when her father, along with her new girlfriend, wants to spend the summer in the Swedish province Skåne she refuses to come with them. Misa's father reluctantly agrees that Misa stays with her grandmother in Arjeplog over the summer instead. In the deep forest of northern Sweden Misa find more than she ever could imagine; she meets a wolf with cubs that Misa develop a deep and strange connection with. But the wolf spreads fear in the small village and someone has hired a poacher to kill it and her cubs...",
      "similar": [],
      "original_title": "Misa mi",
      "runtime": 80,
      "poster_path": "/dTr0VtUzd2oj8tWjPUJT31mSxA8.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [],
      "release_date": "2003-12-19",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Linus Torell"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Lena Hanno",
         "Martina Stöhr"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0342777/",
      "coverLink": null,
      "actors": [
         "Kim Jansson",
         "Lena Granhagen",
         "Per Nilja"
      ],
      "reviews": [
         "The film has been shot in northern Sweden. So there is few sunlight. Kim is a young girl of 10 years and lives with her grandma after her mother has died. The wolf lives in the woods and is also lonely because her male partner has been shot. The relation between Kim Jansson and the female wolf is very well filmed and the camera often zooms in on Kim's face and particular her beautiful eyes. The film shows good and evil. Kim and some of her friends are the good ones, helping the wolves. The male hunters are the bad ones, shooting animals for money. After the wolf saves Kim, when she is lost in the woods, she visits the wolf once more to detect that she has two puppies. The hunters eventually kill the female wolf. Kim tries to save the puppies of the wolf and delivers them to ...... another wolf. This is a weak part, because that is not quite realistic. It may be also fiction here. The good thing of this film is that it shows the intrinsic warm love for nature of men.",
         "Looking superficially \"Misa mi\" may leave an impression there's nothing new here and it is a medley of clichés. A widowed father finding new love, child-animal relation, grandmother living in wilderness, kids who dislike each other becoming friends while working for mutual aim, national minority with different lifestyle and traditions... Everything sounds so familiar. And beautiful nature, cute animals... Looks like playing a safe card, you just can't lose. Now you expect an education movie: kids will get information about certain animal species, and be told to accept differences between people and usual things about environment etc. And if you watch the movie with one eye shut, during ironing or cooking or reading headlines in papers, you'll stay in that conviction. However, if you take your time to watch it without prejudices, you'll see this is a family and not child movie, targeting equally on all generations. There are no moralities, no final answers, no ecological proclamations and pamphlets, no psychological analyzing, no patronizing messages.. Questions are open, answers are offered, but there is always more than one. This is real life, you don't have simple answers. This is not \"You must stop when the light is red\" or \"Don't touch the stove\", not even \"Black and white are equal\" or \"It's wrong to steal in the shop\" child movie. A girl is not prepared to share her father with a (potential) new stepmother? She has right to avoid her when she can, but her father has a right for his life to continue. Is traditional medicine better than official, scientific one? Both are here to cure people, and none of them can do everything. Growing up in old or modern way? First includes drinking coffee at the age of 3; the second means TV addiction. The best example is the grandmother: she doesn't justify killing the wolf (the endangered species), but she also tells her granddaughter who stands for the right of the wolves to survive: yes, but people also live here and also try to survive. The only final message may be - you can't make up your mind, you can't find definite answers until you try not just to hear and see, but live and understand both sides. And even then, it is only your choice and your answer, and not the universal truth (that most movies and most people in reality pretend to offer)."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "FilmHaus Lagnö AB",
         "Filmpool Nord",
         "Paradox Spillefilm AS"
      ],
      "summaries": ["When her mother died, 10 year old girl Misa's world stopped. And when her father, along with her new girlfriend, wants to spend the summer in the Swedish province Skåne she refuses to come with them. Misa's father reluctantly agrees that Misa stays with her grandmother in Arjeplog over the summer instead. In the deep forest of northern Sweden Misa find more than she ever could imagine; she meets a wolf with cubs that Misa develop a deep and strange connection with. But the wolf spreads fear in the small village and someone has hired a poacher to kill it and her cubs..."],
      "budget": 0
   },
   "movielensId": 153602,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "2003-12-19",
      "dvdReleaseDate": null,
      "directors": ["Linus Torell"],
      "runtime": 80,
      "movieId": 153602,
      "title": "Misa mi",
      "mpaa": null,
      "actors": [
         "Kim Jansson",
         "Lena Granhagen",
         "Magnus Krepper"
      ],
      "imdbMovieId": "0342777",
      "originalTitle": "Misa mi",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When her mother died, 10 year old girl Misa's world stopped. And when her father, along with her new girlfriend, wants to spend the summer in the Swedish province Skåne she refuses to come with them. Misa's father reluctantly agrees that Misa stays with her grandmother in Arjeplog over the summer instead. In the deep forest of northern Sweden Misa find more than she ever could imagine; she meets a wolf with cubs that Misa develop a deep and strange connection with. But the wolf spreads fear in the small village and someone has hired a poacher to kill it and her cubs...",
      "tmdbMovieId": 121754,
      "avgRating": 2.5,
      "releaseYear": "2003",
      "numRatings": 1,
      "posterPath": "/dTr0VtUzd2oj8tWjPUJT31mSxA8.jpg"
   }
}