{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "sexual obsession",
            "id": 459
         },
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "black money",
            "id": 5969
         },
         {
            "name": "drug use",
            "id": 11494
         }
      ],
      "imdb_id": "tt0964516",
      "video": false,
      "title": "Fashion",
      "recommendations": [
         20492,
         15772,
         20742,
         14467,
         31364,
         39839,
         21461,
         19637,
         20931,
         27298,
         19658,
         26815,
         37951,
         15975,
         20360,
         41188,
         19672,
         44425,
         37822,
         53569
      ],
      "backdrop_path": "/zo0cdCAhDlZrqiXko93SDTP88jc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Meghna Mathur",
               "gender": 1,
               "credit_id": "52fe47e69251416c750a92dd",
               "name": "Priyanka Chopra",
               "profile_path": "/iTcExyMhCa0yc5AmMPQcDOETLtW.jpg",
               "id": 77234,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Shonali Gujral",
               "gender": 1,
               "credit_id": "52fe47e69251416c750a92e1",
               "name": "Kangana Ranaut",
               "profile_path": "/gsL02ekTmvi09wtDclNQP9ZLzkI.jpg",
               "id": 85470,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Janet",
               "gender": 1,
               "credit_id": "52fe47e69251416c750a92e5",
               "name": "Mugdha Godse",
               "profile_path": "/xtVnTjpp4R8oeFUkhSqszFjfkV3.jpg",
               "id": 85471,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Maanav",
               "gender": 2,
               "credit_id": "52fe47e69251416c750a92e9",
               "name": "Arjan Bajwa",
               "profile_path": "/c9rUBQeAPW7WhEYoBRFOnHZWgZe.jpg",
               "id": 85472,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rahul Arora",
               "gender": 0,
               "credit_id": "52fe47e69251416c750a92ed",
               "name": "Samir Soni",
               "profile_path": "/77R5FYVhiR7scfLkBO8sWuLXWao.jpg",
               "id": 85473,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Rohit Khanna",
               "gender": 2,
               "credit_id": "52fe47e69251416c750a92f1",
               "name": "Ashwin Mushran",
               "profile_path": "/dxfQ55yipSZvQh5l2YVRCHwEjqq.jpg",
               "id": 85474,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Anisha Roy",
               "gender": 0,
               "credit_id": "52fe47e69251416c750a92f5",
               "name": "Kitu Gidwani",
               "profile_path": "/lpAaynxmON3tIxblRd8eWfAfN6x.jpg",
               "id": 53374,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Specical Appearance",
               "gender": 1,
               "credit_id": "52fe47e69251416c750a9305",
               "name": "Konkona Sen Sharma",
               "profile_path": "/dwqDBUVQgvXm7BCcds31wEskIc5.jpg",
               "id": 85666,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47e69251416c750a92fb",
               "name": "Madhur Bhandarkar",
               "profile_path": "/okNkdIul270FfreWd8iyNvrRZH.jpg",
               "id": 92693,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47e69251416c750a9301",
               "name": "Madhur Bhandarkar",
               "profile_path": "/okNkdIul270FfreWd8iyNvrRZH.jpg",
               "id": 92693,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58ad20bc9251410794002b35",
               "name": "Ajay Monga",
               "profile_path": null,
               "id": 1763475,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58ad20dec3a3682fb20025b6",
               "name": "Madhur Bhandarkar",
               "profile_path": "/okNkdIul270FfreWd8iyNvrRZH.jpg",
               "id": 92693,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58ad21039251410794002b58",
               "name": "Anuradha Tiwari",
               "profile_path": null,
               "id": 1763476,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58ad2116c3a3682fc0002397",
               "name": "Anuradha Tiwari",
               "profile_path": null,
               "id": 1763476,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.552287,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 19624,
      "vote_count": 36,
      "budget": 5000000,
      "overview": "Fashion begins in, where aspiring model Meghna Mathur (Priyanka Chopra) expresses her wish to go to Mumbai and pursue her dream of becoming a supermodel. Through her eyes we see that behind the glitz and glamour of the world of fashion not everything is as it seems.",
      "similar": [
         796,
         267,
         4964,
         345,
         1164,
         28468,
         394117,
         401898,
         376867,
         53445,
         10068,
         524,
         164457,
         402,
         707,
         755,
         316154,
         27066,
         10795,
         99
      ],
      "original_title": "Fashion",
      "runtime": 178,
      "poster_path": "/4kUx8PgPNxVF9KKAcz6hNiiFbrg.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [
         {
            "logo_path": "/oCp4hIEjxEOfVfAuyVyKeRsPrlF.png",
            "name": "UTV Motion Pictures",
            "id": 2320,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bhandarkar Entertainment",
            "id": 3724,
            "origin_country": ""
         }
      ],
      "release_date": "2008-10-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.fashionthemovie.net/",
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Madhur Bhandarkar"],
      "runtime": 167,
      "synopsis": null,
      "writers": [
         "Ajay Monga",
         "Madhur Bhandarkar"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0964516/",
      "coverLink": null,
      "actors": [
         "Priyanka Chopra",
         "Kangana Ranaut",
         "Mugdha Godse"
      ],
      "reviews": [
         "Madhur Bhandarkar is known for his realistic, dramatic, often shocking and often women-oriented films. He always takes a medium and decides to portray it in a film which will expose the reality behind it. This time he chose to depict the world of fashion in a film called... well, Fashion. And yes, it's an interesting, well-made film that works for the audience. However, it has one main problem: It is stereotypical and overly pessimistic to be called totally realistic, and in that aspect falls flat. I don't say Bhandarkar's previous works were any different or were particularly optimistic as his films generally present the dark side of his subjects, but this one goes one step down. We learn from the film that everything, sorry, EVERYTHING is bad in the world of Fashion - it is a terrible world of sex (not that it's bad, but this movie is all about infidelity and one-night stands), alcohol, drugs, grief and loneliness. There's nothing good about it - and it is clearly a wrong depiction - it's not reality. If you want to make an issue-based film, you should present both sides, and this is not done here. It is also mostly stereotypical in its general portrayal of gay men, which is amusingly exaggerated. Above all, Priyanka's character in the first portions of the film is annoying. She is not presented as a girl who is just innocent, she is presented as a complete idiot which is odd for someone who wants to enter the world of fashion and says she wants to be a \"supermodel\". I don't think a girl who wants to be a supermodel can be that shy. Some other flaws include the sudden way the director shows the girl smoking and drinking without any prior indication to it (starting to smoke is not just about lighting a cigarette, is it?). This transformation was far too quick to be believable. Anyway, what I did like about the film is its well-invested execution and good film-making from the technical point of view. Other than the problems mentioned above, the script is decent, the dialogues are well-written, the drama is not overdone, the film is well-directed, and at the end of it all, the ending provides a well-deserved sigh of relief, although it's not completely positive. Not less important, it is visually impressive, the music is outstanding (\"Maar Jaawan\" and \"Kuch Khaas Hai\" are two of my favourite Hindi songs in recent times), the cinematography is great, the costumes are well chosen and designed, the actors are well-cast, and the entire concept of following one model's way to the top, her rise and her fall, is interesting. Priyanka Chopra is good and impressive. One of her best, though considering her body of work it does not really mean much as of now. She acted with aplomb and looked very attractive which is very important in that kind of a role. The real winner, the real show-stealer, however, is Kangana Ranaut who delivers a knock-out performance. Her confidence, hysterics, good looks, arrogance and confusion are superbly acted. This is not the first time she plays psychologically disturbed girls, but she is just too brilliant at it, so I salute it. This is an exceptional intense portrayal. 'Fashion' may show only one side throughout and may be a bit disturbing at some points, but towards the end it shows a brighter, more optimistic side, which was missing during the entire show and is reasonably worth the wait. Prepare yourself for an interesting and entertaining flick about a girl who tries to make her dream come true, but don't expect to see a knowledgeable and correct depiction of the fashion world.",
         "I watched this movie simply because of the good hype surrounding it. Although it was def. not my type (modeling does not interest me at all). Believe me, anyone would like this film! Wow. I always thought Priyanka's acting was horrible. Come on after Salaam e ishq I was really wondering who would hire this girl... but maybe its just because she's been in these comedy/sexy roles and not a very complex character. Well guys her performance in Fashion was incredible. She def. deserved the IIFA best actress award over Aish in Jodha Akbar! That being said this is a very gritty portrayal of the fashion world that whether it is a realistic depiction or not is very interesting. It takes you into an 'alternate universe' in India and fills you in on all the gritty details and all the central characters that by the end you feel like you have journeyed with Meghna (Priyanka's character) all the way and seen it all yourself. Well all of that being said you are in for a real treat with Fashion. It is no typical masala film as I'm sure you know but go in with an open mind and you will come out feeling like you have really seen something memorable!",
         "The glamorous world of fashion gets put under the spotlight with Madhur Bhandarakar's Fashion, a story which tells of the rise and fall of a fictional Indian supermodel Meghna Mathur, played by ex Miss World Priyanka Chopra, who holds court with her performance as the phoenix finding her own standing in an industry known for ruthlessness and fickleness that comes with changing its representative face with the seasons. As Meghna, Chopra brings to life the wide-eyed small town girl who dreams of making it big on the catwalks of Mumbai, and thereafter the world, and we journey with her through this long and arduous road to modelling. Given that a typical Bollywood movie comes in two parts after an intermission, each part serves its intent well, acting as a separation of attitudes adopted, of the transformation of Meghna from aspiring model, to one at her peak, bad attitude notwithstanding. You'd come to expect a story that's almost mirroring that of The Devil Wears Prada, where good natured girl gets caught up with all the bright lights and glamour, that she loses her humanity quite consciously, looking at herself change from angel to demon, yet powerless in the grip of fame and money to find the moral courage to do anything about it. It tells of pitfalls, not only in this particular industry, but in general the kind of negative person we are susceptible to turn into, should we lose touch with reality, and let success get into our heads. Priyanka Chopra is quite perfect in the role and believable both as the girl next door, and a supermodel as well, given her beautiful looks and height to carry the role of a clothes horse. She brings to the screen some steely resolve in that it's not enough to be just a part of the industry, but to be #1 through any methods and means. During production of course there was talk about her going on a crash diet for her role, and I guess such rumours get spun because the industry favours pencil thin (read: unhealthy looking) models who grace the catwalks. However, Chopra brings about a healthy glow to her role as Meghna, though I thought toward the end she looked a little more svelte in her figure than to begin with. It's good to see that at least she's not quite obsessed into being yet another waif looking character, as there might be some pressure given the production did feature real models, some even from Elite, gracing the screen as background eye candy. And this film was really quite encompassing with its portrayal of the industry, what with all the power players from agents to agencies, from designers (including fashion labels like Jimmy Choo) to magazines (Vogue India), from genuine friends to those looking to feel up skirts. I particularly liked how the film introduced us to all the key players and characters in one fell swoop, and what more through a fashion show, listening in to who's who and rivalries that exist, before observing just how hypocritical everyone can be toward one another. Granted there were some lapses into character stereotypes like the gay designer and the married modelling agency boss (played by Arbaaz Khan) who has no qualms about sleeping with his top model, and with some moments in the plot being quite predictable, especially with relationships both personal and professional, Fashion still comes through unscathed as it's delivered in a slick package, sashaying to the cool seductive moves of catwalk modelling, of showing off its best side to the audience. Since this is a film from Bollywood, you can expect many sleazy bits to be toned down and self-censored, with one scene involving a wardrobe malfunction actually being mosaic-ed off. And besides Priyanka Chopra, Mugdha Godse also held her own as Meghna's best friend Janet, who shows her the ropes and also bearing witness to her meteoric rise and fall. But I thought Kangna Ranaut's show-stopper role as top supermodel Shonali was something to sit up and take notice, with her pitch-perfect arrogance on the catwalk being quite a sight to behold, and her character being a parallel to that of Meghna, as a pre-cursor and warning of what one's life would be if you'd throw it to the wind, given her indulgence in drugs, drink, smoke and a choice of the wrong partner. I haven't seen a lot of movies about the fashion industry, but I suppose this one form India serves as a catalyst to begin, even if it's a work of fiction. Eye candy galore and a simple storyline to follow, it's houte couture on display, everything good and nasty about it. As close to front row seats to a fashion show I can get.",
         "Bollywood movie industry has started making realistic films. This movie explores the world of fashion and all those who wish to be model won't get inspired after watching this film. \"In the world of fashion you have to compromise more than just your morals.\" Models here are alcoholics and drug addicts. Meghna Mathur (Priyanka Chopra) is a small town middle class girl who wants to be a model, especially after winning a beauty contest. After many procedures she becomes one and many problems starts to occur. Movie is directed well with lots of effort from the cast and the crew. Costumes are all nice showing the present day fashion. Priyanka Chopra surprisingly delivered a good performance. She has taken a lot of effort for role. Kangna Ranaut's role was more challenging and she pulled it off easily. The newcomer Mugda Godse also did her part well. The songs are good and the background score is excellent. The title music of fashion is stupendous. Overall it is a good movie especially towards the end. The last one hour is the best in this film. 7/10",
         "Fashion was a really nice movie, and mostly it was it was showing the life of models. It even shows the models dark side, not only smoking, drinking etc. Priyanka Chopra did a very good acting as Meghna Mathur. But I felt that if she could have given a bit more expressions it would have been a better film. Kangana Raunat did a satisfying role as Shonali Gujral. She was into her character. Specially then when she had to act drunken etc. I guess she was the one who acted the best in this movie. But I still think the movie could be made shorter. She really showed how ambitious she was. Priyanka really showed how nicely she could act and do cat walk. I think Madhur Bhandarkar has made a really successful and real life based movie. His movie has a depth and shows the real life of models. You all should go and see this incredible movie.",
         "Thoughts tumble over each other as I try to process this movie. The glorious gam quotient, of course, is unmatched. Guys have to understand, you can't expect to find this much beauty and glamor in any other movie you go to. It is all over in that regard and the trophy has been surrendered to this movie. But there has to be more than that. And there is. The cast is loaded with old hands and newcomers, and they all give a lot. The star is Priyanka because she is telling the life story of her character. Everything is viewed through the prism of her changing perspective on her dreams. And I remember the moment in the movie when I let out a gasp of amazement at how wonderful she looked. Plus, this is her next movie achievement after Aitraaz. Many stories do not demand much of Priyanka. She's like a jewel in most movies that merely has to sparkle to justify the salary. In this movie, she has to dig into her soul and look beautiful and ugly and all the grades in between. This is the Priyanka rainbow folks. But she has superlative help. My startling discovery from this movie is Mugadha Godse. When I saw the PR pictures, featuring her with Kangana and Priyanka, my thought was, \"she's pretty but doomed to be overshadowed\". Well, I have to say that in the entire cast of characters, she's the one I liked best. I might have had to adjust that if Konkona Sen Sharma had had more than a cameo. But as it was, Mugadha was extraordinarily likable. After that there were others. Suchitra Pillai played the wife of Panache owner Abhijit. Every time she was on screen, my eyes were drawn to her. Now I hope they cast her again and again. She has SO much presence and dignity. I also liked Kitu Gidwani, who played Rahul's book publisher in Strangers, a tiny role. But still I remembered her. Her role is much bigger and more important in this movie, and she fits it perfectly. The guys who played the fashion designers were great without exception. But my top prize on that side of the cast is Arbaaz Khan. Arbaaz is the only actor from that Khan family that I trust. He doesn't do more nor less than a role requires. The other guys in his family have personality quirks that leave me with an off taste. But Arbaaz never disappoints me. I suppose that's why he has that glamorous wife and her child. He is a MAN. Some reviews call Kangana the real star of this movie. In some of her scenes, that is easy to understand. She starts the movie as the \"show stopper\", and when she marches out on the runway, there is a big voltage boost. But I have to protest her \"James Dean\" career. Like Mr. Dean, she always gets a non-survivor role. The first time I saw her, she was diving to her death from a tall building in Seoul. That made a huge emotional imprint on my memory. The next time she was locked up for her own good. Then she was KK Menon's floozy on the side. James Dean had a memorable career, but it was only 3 movies long. I want Kangana to do at least ten times that many, so she needs some movies where she shows she cannot be crushed, no matter how the world tries. I hope it starts soon. In Woh Lamhe, Sana is nursed back to sanity by Adi. It is a very touching section of the movie. In this movie, Shonali is nursed by Meghna. If I had to choose, my favorite will be Shonali and Meghna together. The fact is that Shonali saves Meghna's life. That's a big turnaround from Woh Lamhe. In a movie whose parts I liked so much, Shonali giving Meghna someone who she cares more about than herself, is my favorite part of the movie. This movie touched me more than any movie has in quite a while. I think there might be some people out there who will feel that way and be glad they went to a movie with heart. 9/10",
         "Madhur Bhandarkar is known for revealing the stark truths of various facets of the Indian society. And this definitely doesn't change with Fashion as well. A well told story of a small town girl with big aspirations, who loses herself to the devouring fashion industry only to re discover herself at the end of it all. Your routine run of the mill story? Not quite. Madhur has picked up important events in India's fashion industry (wardrobe malfunction, the demented model found in the markets etc.) and shown what all models go through. The identities of various designers, how the industry REALLY works and how a fashion career is to be perceived are very well told. The music is awesome, and the ramp scenes are truly genius. The downside? the movie is too long, could be cut short by half an hour at least. Priyanka Chopra doesn't always look as glamorous as she should, but Kangana Ranaut justifies her role completely and pulls of a good show. All in all, definitely not to miss, what with the lean bollywood season going on, fashion is definitely a'show stopper'",
         "With 'Fashion' Bhandarkar, quite obviously, takes us to the world of fashion. The storytelling falls on the same line as his previous films like 'Corporate', 'Page 3' and 'Chandni Bar'. In a way this is a strength and weakness. The good thing about it is that it shows a darker side of the fashion industry, though Bhandarkar does not go as extreme like he did in 'Page 3'. The problem with his portrayal is that there is no good side. The fashion industry is portrayed as hell. Clearly it couldn't be that bad for every model. I'm not saying that Bhandarkar needs to balance both the good and the bad in his film (as his focus is on the negative) but a glimpse of the positive would have been interesting. Bhandarkar's own 'Satta' is an example (and I believe it is his best film to date). What is it that attracts people about becoming a part of the fashion industry? Is it just the glitter and glamour? What is it that attracts Meghna to become a supermodel? These are things I would have liked to see in the film but Bhandarkar pretty much follows the 'small-town girl enters hell' routine. This was also the same problem with 'Page 3' (where all the rich and wealthy are portrayed as bad), 'Corporate' (ditto) and 'Chandni Bar' (society is bad). What Bhandarkar does is simply throw the negative in the audience's face and let the 'heroine' suffer. Moreover, Bhandarkar infuses some deja-vu and clichéd plots such as Meghna getting pregnant (a la Tara Sharma in 'Page 3'). The homosexual characters are stereotypically portrayed (with the exception of Samir Soni's character). Perhaps a more satirical approach could have made this a better film. Where editing is concerned, there are too many walk-on-the ramp scenes. Alright so it's a movie about fashion so that is expected but overdoing commercial isn't necessary (though it is not as bad as 'The Devil Wears Prada') Yet, 'Fashion' isn't all that bad. It does make one aware of the kind of darkness that taints the industry. The storytelling is compelling in parts as I liked the idea of showing the rise of one model leading to another's fall from grace. The performances are good. It's been a long while since Priyanka Chopra's been in a role of substance and she does a good job of carrying the film. Mughda Godse makes a confident debut and definitely does a fine job. Kangana Ranaut is a little too loud and is clearly getting typecast as the damsel in distress. Samir Soni too does a fine job and Ashwin Mushran performs adequate as Meghna's supporter. Kitu Gidwani and Arjan Bajwa make their presence felt and Arbaaz Khan is sufficient. Overall, 'Fashion' is certainly no bad watch. I like that Bhandarkar attempts different kinds of films and the risky subject matters that scare away other filmmakers. There may be a little pretension and one-sidedness but in the end it's the story of an individual trying to make it and then losing herself in an albeit exaggerated biased ruthless bad world.",
         "Madhur Bhandar the director has shown the dark side of celebrities in Page 3, business in Corporate and now he is showing us the dark side of models in fashion. The movie is really good that has a very interesting story based on a real life model played by Priyanka Chopra as Meghna Mathur. It shows the life of models when they are not on a catwalk wearing make-up, lipstick, nail polish and wearing glamorous dresses. But it was also very stylish, visually impressive and doesn't just show the dark side because fashion is a great thing as well. Fashion has a very important message that we can all learn from especially the girls and young women who intend to be a model. The film may seem that it will only appeal to the female audience but the story is so good that it's also good for male. Priyanka Chopra may have delivered six flops in a row but it was still her best performance of the year. The story is about Meghna Mathur who is a small town girl with a dream and the determination, she knew in her bones that she was meant to be famous. The world of fashion - the clothes, the colours, the make-up... all of these form a part of a fascinating world that Meghna longed to be a part of and she would do anything to reach the top. She reaches the peak of her success and rises to walk the ramps for leading designers across India. However karma catches up with Meghna as she slowly starts to pay the price for her fame and her journey to the top but her attempt at a comeback was going to be a near impossibility. Basically it is a journey of the rise and fall. Whether it's an original film or the music that has killer tunes, film director Madhur Bhandar always has the ability to surprise you. The music for Fashion is no different. Heavy beats combine well with powerful melodies on solid songs. The pick of the great songs are Fashion Ka Jalwa and the superb Mar Jaawa. Overall it was such a good film and I would recommend it to those who want a different story but not to those who don't like people talking throughout the whole film.",
         "I saw this movie yesterday and Priyanka Chopra's role as a Fashion Model was fantastic. The movie portrays the dark side of Indian Fashion Industry. Meghna Mathur (Priyanka) an ambitious girl from Chandigarh moves to Mumbai to become model, without the consent of her father. She struggles hard to become a model and faces the dark side of fashion industry. She becomes top model very soon but she becomes too much arrogant and involves in all immoral activities. Her career graph begin seeing downfall and she looses all friends and relations because of her excessive pride. The role of Kittu Gidwani and Priyanka reminds me of Meryll Streep and Anna Hathway from \"Devil Wears Prada\". Both movies are somewhat long and have similarities. The Cast in the movie is superb and well selected- Priyanka Chopra, Kangna Ranaut, Mugdha Godse, Arbaaz khan, Kitu Gidwani all were superb. \"Mar Jaava\", \" Aashiyana\" Songs were also excellent and suits very well to theme of movie. A must see movie from (real life) film maker Madhur Bhandarkar.",
         "'Fashion' is consistently entertaining if not as hard-edged as Madhur Bhandarkar's earlier films. It's basically a star vehicle for Priyanka Chopra, who does well as a supermodel who makes an unlikely comeback. The film lacks inside information on the fashion industry and mostly restricts itself to catty remarks about designers stealing ideas. Most of the film deals with Priyankas's journey through the fashion world. Kangna Ranaut excels in her role as the reigning 'show-stopper' despite her awkward dialog delivery. The film does go on too long but remains watchable. Overall 7/10",
         "Ramp walks, arrogant supermodels, conniving modeling agency heads, wardrobe malfunctions, and delusional ex models on the street - expectedly it's all there in Madhur Bhandarkar's take on the fashion industry, 'Fashion'. It is a hard hitting look alright, but being a first of its kind perspective as far as Bollywood is concerned, it does get away with a few inconsistencies. In trying to bridge the chasm between perception and reality about the glam world of modeling through the story of the rise and fall of aspiring model Meghna Mathur (Priyanka Chopra) the film does stand out thanks to its well crafted fashion show sequences, intense performances and a nice dose of self deprecating gags (Bhandarkar even plays himself in a cameo!). But where it lacks is that after not taking itself too seriously early on, the second half is a little too intense a tad too long. Priyanka Chopra deserves special mention for easing into the metamorphic role from aspirant to the supermodel who then goes on to lose her modeling mojo. The other two models, Shonali (Kangana Ranaut is pretty tolerable in a slightly uni-dimensional role) and Janet (Mugdha Godse seems comfortable) hold their own as well. Even the support roles (Ashwin Mushran as the very gay Rohit Khanna looks suspiciously familiar to Stanley Tucci's character from 'The Devil Wears Prada' while Kitu Gidwani puts in a quietly confident role as Anisha Roy) are well executed though they are a bit on the caricaturish side. Bhandarkar packs every news-bite possible about the fashion industry into the script which tends to lose focus in the latter half. But as is his wont he does manage to touch a few chords and at least agitate the viewer's mind. In short, as far as the invite to this 'Fashion' show goes, come for Madhur Bhandarkar and stay for Priyanka Chopra!",
         "After making his mark with realistic flicks like Chandni Bar, Page-3, Corporate and Traffic Signal which portrayed the underbelly of dance bars, high society, boardrooms and the streets respectively, Bhandarkar has repeated his realism feat, this time with the glittery world of fashion. With scenes inspired by real life events, a la Carol Gracias’ wardrobe malfunction and Gitanjali Nagpal’s sad fate, Fashion is a worthy film. Following her idol supermodel Shonali (Kangana), Megha (Chopra) arrives in Mumbai from Chandigarh to make it big in modeling. Her confidence soon gives her too much success too soon when she loses herself and hits downturn. By then, Shonali is already down into drugs and begging on streets. And there is a struggling model and free spirit Janet (Mugdha). The following drama is about Meghna pulling her life together. Going by his earlier flicks, Madhur Bhandarkar portrays strange relationships again; with gay designers, model coordinators playing the contract muddle, changing attitudes with changing fortunes, power abuse by a leading design house, accusations of stealing designs and lecherous socialites amongst others. Fashion’s biggest enemy, as is with realistic flicks is its predictability giving you a feeling as if you knew the story fully! Talk of showstoppers and Priyanka Chopra has delivered her career best in a character that transitions from a sweet small town girl to a trample-all bitch to someone desolately lost to rediscovering herself back again. Complimenting the performance are the five distinct looks by stylist Rita Dhody. If at all it doesn’t lift her sagging box office fortunes, this one-time Filmfare winner has just inched closer to a possible second. Kangana has successfully portrayed a psychopath again; the girl seems to have carved a niche for herself. Yet, her dialog and diction are as poor as ever. Mugdha Godse is a revelation for a first timer. Samir Soni and Ashwin Mushran shine as the gay designers and benefactors of the protagonist. Chak-de girl Chitrashi Rawat too makes a mark in a small role. Music is reasonable with the score feeling too repetitive towards the end. Timing it to perfection as the Deepawali release, the audience are steadily flocking the screens. But as you near the end of the 150 minute run time, replete with overused terms like ‘show-stopper’ et al, you can sense the restlessness of the audience. In the end, barring a few clichés, it leaves with a sense that you got your money’s worth. But you are left wondering why in the censor’s wisdom was this certified an adult movie!",
         "Dazzling beauties, scintillating faces and an unprecedented dark shadows of backlashes: backstage of the glamour world is grossly scaring and unbelievably haunting. Madhur Bhandarkar's next real life reel movie although not in the same league of his previous works but yet makes a strong mark on the mind of viewers. The wow of the movie is the way fashion shows have been presented, remarkable camera work to capture the zest of the glam, astonishing sets and most importantly sizzling Kangana and Priyanka on the ramp. Kangana surely played a real showstopper in the movie; her confidence on the ramp would definitely give complex to seasoned models and even super models. The story is about rise & fall of an aspiring chandigarh model Meghana played by Priyanka who wants to burn the ramp with her aura and set the stage on fire with her presence. Her confidence and dynamic attitude makes her in the wish list of all the top brands and she acclaims supermodel status from veteran model Shonali played brilliantly by Kangana. I although have not seen much of live fashion shows but had my share of watching and I could definitely rate both of them on the acme of the act they have incorporated for Fashion. Kangana appeals me more than Priyanka as she definitely stands tall when it comes to the flair and attitude on the ramp than anyone else in the movie. She steals the shows when ever she comes on the screen, be it on ramp or being hysterical on and off drugs, she plays such high-spirited roles with so ease and convenience that sometimes I feel that she definitely need a rehab! Priyanka is sassy and sparkling throughout the movie. I guess after Aitbaar this is the first time she has shown her gay shades in movies and I must say it suits her to the fullest. I could not praise the entire star cast as everyone has put a splendid show but can't leave three other picks which are Mugdha, Arbaaz and Kittu Gidwani. They are looks so apt and professional especially considering Mugdha as this is her debut she comes as a fresh breeze and makes a positive statement over her acting capabilities. What impresses me the most is every time I go for a Madhur film being assured that it will be naked truth yet convincing and this guy never lets you down, so real yet commercial. This quality of his film making put him on the list of top directors, another impressive fact is he like Yash Raj, Johars and other houses doesn't necessarily keeps his patent star cast for making a movie treat to watch but his thorough research and in-depth analysis and most importantly interweaved issues which depicts in the movies like in Fashion it was homosexuality, drugs, casting couch although it could be barred keeping in mind that glamour world cannot be discounted without it, this makes his work so unique. He is a real star maker; he can make deliver goods from anyone and everyone; kudos Madhur for the efforts and consistency. Undoubtedly until \"Ghajani\" and \"Rab Ne Mila Di Jodi\" comes this is going to be the best movie of the year from Bollywood.",
         "One of most realistic movies to be seen in recent Hindi Cinema.... Acting by everyone is done superiorly. And the movie have been greatly crafted to perfection. Special Credits to Kangana........her acting was superb with due respect to PC and RG Itz a complete WOW!!! experience Madhur Bhandarkar has come with a gem this time around. You need to see this movie to enjoy it for a lifetime!!! If you don't' then you need to stop seeing movies then..............:P Thanks and Regards",
         "It is interesting to see what it is like to be part of the fashion industry. I commend the director for creating a daring film staring mostly women. He tackled realistic issues such as coping using drugs and loneliness.One lesson learned from this movie is that aspiring to be independent and having too much confidence could be seen as arrogance and selfishness.Some parts of the movie seemed a bit unrealistic and too dramatic. I was amazed at Priyanka Chopra's acting. She really pulled thought and this type of role fits her well. Kangana Ranaut had a strong performance compared to Priyanka. Her role fit like a glove but I really want her to do something a little different than these types of roles. Mugdha Godse was just thrown into the mix to add glamor.The other supporting characters really added depth to the movie. The songs were interesting and tuneful. Also, the cinematography and editing was done nicely. Overall, I recommend this movie to any aspiring woman who wants to become an actress or a model not to discourage her but to be an eye opener.",
         "I must say madhur bhandarkar has made absolutely awesome fast movies with really untouched subjects, subjects which most of the people want to know about. All his movies, chandani bar, page3, corporate, traffic signal were great and has made his own genre of movies. He has succeeded in fashion too... Some bad thing in the movie first: (cos i like happy endings ) Very very slow... Confusing first half. so many things happen that you cant even remember during second half. Very Very Long... Struggling Priyanka as a model shown for a very less time. Few unwanted scenes which would surely cut the length by 10- 15 minutes. Audience lose interest just few minutes after second half. Should have started with the actual SUBJECT of the movie in the second half, takes a long time reaching there... You will get nauseous about Priyankas acting, no variations, just the same. Good points: The life of a model, u just feel it, u get into her life, no compromises showing that. The Fashion world is shown really nicely. \"Kangana Ranaut\" is just amazing. Perfect as a model she gets 9/10... Sets by Nitin Desai are huge and fabulous... The end does make sense, not any bollywood film with \"tears of happiness\" in the end. Overall if u remove few scenes it could get 8/10. VERDICT: u like madhurs movies or like realistic ones: GO u like Bollywood masala, comedy, action: Don't GO(but at least watch it on a DVD)",
         "Summary : Fashion is yet another addition to Madhur Bhandharkars preachy probes in sleazy industries. There is nothing that really differentiates Fashion from other Madhur Bhandharkar Flicks. The same old rather amateurish film making, a power hungry female protagonist, character stereotypes, betrayal and a sense of innocence loss and finally coming of age. Not to mention the preachy out of nowhere skits thrown in (as a matter of fact one about a b grade actress seems to have jumped in from the editing table of Page Three). The bottom line message of the movie is that this the way the fashion industry is and you have to live and be successful in it in spite of what it offers The Details : Well as I mentioned the above could be the review of any Bhandarkar flick. So the power hungry female protagonist is played by an extremely hot looking Priyanka Chopra who is your small town girl trying to make it big in the fashion world. There are the stereotypes \u0096 the gay fashion designers who are helpful but at times irritating, the arrogant super model (played by once again a hysterical Kangana Ranaut \u0096 I doubt she knows how to act otherwise) and the overpowering czars (Kitu Gidwani and Arbaaz Khan) who seem nice and smart but are as usual cold and calculating The Performances : What you can say saves fashion are the performances of pretty much everybody. Kangana Ranaut looks all the gleam that she is supposed to be and carries off her hysteria and ego trip really well. As a matter of fact I think there is only one dialog in sober uttered by her in the entire film which was \"Tumhe Yeh Karna Hi Hoga\" Godse with a dazzling smile is fantastic though her characters actions are a little hard to digest. Kitu Gidwani as a fashion magazine editor is controlled and fun to watch. As is Arbaaz Khan as a fashion czar who makes and breaks careers on his whims and fancies. Ashwin Mushran ad model now turned actor is OK . In a better actors hand his role could have been quite a well done one. For me Raj Babbar as an irritated father took the toast, really wish he was seen more in roles like these. But the film runs on Priyanka Chopra . She is pretty much there in every single shot of the film. She looks the part and so do her dresses. From the big buckle and silver sparkling jeans when she arrives from Chandigarh in Mumbai to the elegant tops and skirts when she makes it big. She eventually graduates to the rather showy look at me kind of dresses as her downfall begins. Her costumes match her character to the tee as do her expressions.which is good enough. Bottomline : Overall Fashion does not deserve much praise for being stereotypical predictable and a been there done that but I get the feeling considering the kind of competition it seems to be having (heroes, hello and Golmaal returns), Fashion would be another hit for Bhandarkar -- maybe his biggest yet!! P.S. : On a side note I think Fashion would make a case study in terms of product placement. There are Nokia cell phones, Lenovo laptops, and even Sunsilk ads sprinkled across the film. have not done the math but wouldn't be surprised if the product placement covered for at least 50% of the production cost!! go easy people please make movies not products.",
         "The film is a nice peek into the highly insular and very artificial world of fashion in India (and probably the world). The world of air kisses, tight deadlines, anorexic models, show stoppers and diva designers. All this compounded of course by extreme bitchiness, back-biting and jealousies. While it does a good job of communicating the high adrenalin rush you get from watching a good fashion show (just like in any other live performing art), it unfortunately shows too much of the negatives to make the film a truly pleasurable watch. It shows, through rose-tinted glasses, the struggle of Priyanka Chopra to become a model (it cant be that bad though when you're spending your struggling days in Café Coffee Day) and then shows how her rise to supermodel status is accompanied by a similar rise in her super-bitchiness and arrogance, and a parallel fall from grace of another model (Kangana Raut). You watch the film with a degree of morbid satisfaction \u0096 just wondering how bad its going to get, hoping Priyanka's character will finally see sense or someone will be able to spank some into her. There are some good performances \u0096 Priyanka's, who looks good as always, Kangana, in yet another portrayal of a manic depressive alcoholic (can somebody please give her another role ?) and some lovely cameo's by Kitu Gidwani, Arbaaz, Mugdha Godse, Sameer Soni and Arjan Bajwa. I really liked the dresses shown as well \u0096 quite beautiful and very vibrant colours and different materials and even the shows themselves were well choreographed with stunning backdrops. And the music / songs were nice, not interfering with the movie but enhancing it. I really wish Madhur Bhandarkar had injected some more moments of humour (for example, in one scene, the models discover 'made in Bangkok' tags on the dresses of a major designer about to do a show), dwelt more on the positives (maybe more of Priyanka's joy at the accessibility of the finer things in life) or even found a better ending / some twist as its too predictable right now. The film is actually uncomfortable to watch and depressing vs being interesting / uplifting and surely that cant be right ? In the spirit of the festive season, the movie provides a visual depiction of not one but two age-old morals, the types we grew up being told by parents, teachers and all others around us. The first is 'All that glitters is not gold' and the other is 'Pride hath a fall'. Wish someone had drilled that into Priyanka's or Kangana's characters as well. More reviews at ApurvBollywood at blogspot",
         "In 1957, the livind legend of bollywood, Manoj Kumar debuted through a movie titled as Fashion. More than five decades later, the self-proclaimed realistic filmmaker of Hindi cinema, Madhur Bhandarkar who is habituated of showing the dark side of every phenomena in his movies, has presented a movie under the same title. The movie has not only got accolades for realistic (!) portrayal of the fashion world, but also is a box office hit and the leading ladies' winning prestigious awards for their performances in the movie, is certainly the icing on the cake. Now, should we believe anything picturised as reality, only because the storyteller has earned a reputation for himself as a realistic filmmaker ? Let's examine. Fashion is the story of a small town middle class girl who made it big in the modelling world of Mumbai. After watching the whole movie, what I felt is that the movie should have been appropriately titled as 'Model' instead of 'Fashion' because it is filled with the experiences of the (female) models throughout. It does not touch any other aspect of the fashion world or the fashion industry. Do a few ramp-walking models and ad-agencies are the whole fashion world, excluding the dress designers, their marketing, canvassing and cut-through competition; the tailors doing the real job, the changing fashion trends and the condemnable sexual exploitation of the newcomer models ? Madhur Bhandarkar wants us to believe that fashion world is just an aggregate of catwalk, big fashion shows, renowned showstopper supermodels, ad agency owners mighty enough to make or break any model's career and of course, drug abuse, all night parties, drunken driving, wayward one-night stands and gay fashion designers ? No Mr. Bhandarkar ! Fashion world is too big to be just the sum total of whatever you have shown. Howsoever intelligent a filmmaker might be, he cannot be allowed to take his audience for a ride. By incorporating the real life story of a ruined model - Geetanjali Nagpal through the character of Kangana Ranaut, Madhur Bhandarkar has tried to prove his plot as authentic. But everything portrayed by him - irresponsible and unprofessional behaviour, drug addiction, carefree sexual life etc. on the part of the successful models is too exaggerated to be true in general. The reality for a few cannot be generalised for all. If success goes to the head of a successful model and she starts behaving irresponsibly in her personal and professional life, inviting her doom; it is her problem and the fashion industry has nothing to do with it. Madhur's research work is also poor. He has depicted Adarsh Nagar in Mumbai as the big centre of struggler models. This is an outdated fact. Now the real centre for auditions of new models is Link Plaza at Oshivera, Mumbai. Madhur Bhandarkar has shown Priyanka, a small town girl with middle class morality, first living-in with another model, Arjan Bajwa and then getting sexually involved with any known-unknown person anytime without any hitch. Is it reality ? Come on Madhur ! The big reality is not an ambitious model's trading her sexual favours with an ad agency owner for stardom, the big reality is the forced sexual exploitation of thousands of aspiring newcomer girls by model coordinators and ad agency owners which has been very conveniently skipped by you. Why ? Because it is easy to expose anybody outside your fraternity but very difficult to expose your own fraternity people. A sign of hypocrisy. Isn't it ? By default perhaps, the good thing portrayed by Madhur Bhandarkar is how success goes to a person's head showing its ugly colour in his (in this film, her) behaviour, snatching the virtue of modesty and politeness, neglecting own well-wishers and creeping in of non-professional element in professional life. He has also shown the depression which is manifested when the life of the protagonist undergoes a lean patch. This is the bright side of the movie. It is also exemplary to show that one should strive hard to come out of depression and if fortunately life gives him (or her) another chance, he (or she) should exploit it to the fullest, avoiding earlier mistakes and transforming own personality in own interest. The movie is fast-paced and engrossing. And had Madhur termed this movie as an entertaining one instead of a realistic one, he would have been perfectly correct. The sets, the costumes and the technical aspects are good. The music has one or two chartbusters to its credit. Priyanka Chopra and Kangana Ranaut have deservingly won the national as well as the Filmfare awards for best actress and best supporting actress respectively for their performances. Kangana, though seems to have found herself typed as a ditched, lonely, melancholous girl which may not be good for her in the long run. Full supporting cast playing the characters that keep coming in and going out of the life of the main protagonist, i.e., Priyanka Chopra, has done a good job. The actress not winning any award but the hearts of the viewers with her debut performance itself, is Mugdha Godse. Madhur Bhandarkar's appearing in a scene of the movie and calling himself a realistic filmmaker through the mouth of another character in the scene, is ridiculous. Don't do this job yourself Madhur. Let others do it for you. My concluding comments upon this so-called realistic movie - it is not a movie about fashion; it is, in fact, a collection of dos and don'ts (especially don'ts) in times of unexpectedly received huge success and hard-hitting failure. And the message is to keep your cool in both the life-situations. As Lord Krishna advises us in Bhagvad-Geeta to be a STHIT-PRAGYA (a man maintaining his mental-balance in all times whether good or bad). And this is the real strength of Fashion.",
         "MB's films are a bit different from the usual bollywood fare and this subjects are bold. Fashion, whilst watchable has a cliché ridden story. In addition, it looks like he has a set template of characters which move from one film to the other - it was like Page 3 set in the fashion world with same rich socialites (bad), middle class (good), psychos (Kangana in sparkling form) and extras doing social commentary. Priyanka is looking gorgeous and does a sterling job (Especially when compared to the suffocating Sana she played in Love Story 2050). Arbaaz is his wooden self and looks like he is reading the lines straight off the tele prompter. The supporting cast are generally very good as is the case in a lot of Madhur's films. Its a wafer thin story with shocks as fillings - Lets do something new Madhur.",
         "MB, has a gift for film-making.He selects everyday themes and put his own spin on them. 'Fashion,\" is yet another spin on his bowling score that includes some great movies; including my personal favorite's \"Satta,\" and \"Chandini Bar\". Even though the movie has a \"dejavu\" feeling after the interval (wait a minute, did't I see this before-Meghan meets Sarin-same Catwalk-same fashionistas etc etc) The one actor who shines bright is Kangana Ranout who has an edge over Priyanka at least in this movie. She does the \"Drug addict\" bit to perfection. The movie shows \"Behind the Scenes\" look into the Catwalk Trade-some exxagerated-some scary and some-pretty convincingly believable. This reminds me of the Life and tribulations of a Joker as in \"Mera Naam Joker.\" where the Show has to go on-no matter what-and it does-meanwhile the audience is intrigued but nevertheless entertained as all of Madhur Bandharkar's films do. One day they will all reach a cult status when the Film Buffs will be quoting his films.",
         "Madhur Bhandarkar's all earlier films, were no doubt based on realistic themes, but with \"Fashion\", he dives more deep into the human psyche of ambition and greed. Unexpectedly, \"Fashion\" comes out to be a more emotional and psychological experience along with being hard hitting on the fashion fraternity. Everyone was expecting that \"Fashion\" will target the designer world and would try to reveal its hidden secrets like we had seen in \"Page3\". As expected everything is there in it, the casting couch, the gay world, wardrobe malfunction, women jealousy, professional rivalry, one night stand, all is in there. But \"Fashion\" goes beyond these commercial inserts and comes out to be a more powerful movie with some great shocks and performances. Truly speaking I was not expecting the strong philosophical and emotional angle in the second half from Madhur Bhandarkar. In business sense, \"Fashion\" may not be a huge successful movie as many viewers can find it too emotional, slow and preachy. It can also be said that Indian audiences are not used to this kind of cinema as in the west. Indian viewers believe in more glossy and imaginative world of movies, so I have my doubts on \"Fashion\" being accepted by them. But since we are all developing our tastes with World Cinema in our home TV channels, so let's hope for the best. Coming to the movie content, it has beautiful ladies with gorgeous looks, delivering best performances of their entire careers. The top most performer is the girl with the minimum scenes and dialogues in the movie but she still manages to burn the screen with her hot talent. She is \"Kangna Ranaut\". The Bhatt camp has a great sense of talent discovery, this is a proved fact again as Kangna was introduced by them. Kangna undoubtedly gives the best of her career after \"Woh Lamhe\". In one way the role is an extension of what she did in her debut movie. But here she says it with her eyes and on the ramp, she just gives shivers to all real life ramp walkers. Priyanka Chopra too scores on the performance chart and after \"Aitbaar\" this is her best movie till date. She is expressive, especially in the second half. The scene when she wakes up and finds a Negro sleeping next to her is mind blowing and one can just imagine the state in which a girl would be after experiencing that unwanted tragedy. We see her best when she loses his confidence and freezes on the ramp and also in the scene when she is given the news about Kangna just before she is going to step on to the ramp. Another actress who wins your heart is Mugdha Godse, as Priyanka's close friend who introduces her to the city and its lifestyle. She really acts and acts well. A great find by Madhur, who once again proves that models can be actors. All others in the supporting cast have also contributed their best. Arbaaz Khan however seems to be stiff. Suchitra Pillai, Harsh Chhaya, Samir Soni and Kittu Gidwani get full marks. Raj Babbar and Kiran Juneja don't do anything new as Priyanka's parents. But one more performer stays in your mind, and he is the bald gay friend of Priyanka, who later also takes her back in his show with open arms. You must have seen him in many TV comedy shows. He gives a superb performance and his contribution must not be forgotten under the shadow of big names. Musically, the film has one great song, \"Fashion Ka Hai Yeh Jalwa\", which should have been used as the theme music with repeated play at times in the background. But Madhur, opts using it only once in the ramp show. No other song was needed anywhere in the narration. Now, onto some weak points I felt needed attention. First in a movie called \"Fashion\" there are no major talks, discussions or display of designer clothes. Instead there are more talks of advertising agencies and their top models. There are only indications to the rivalry in fashion designers but the story revolves more around the models and their agencies. Secondly, its hard to digest that a small time girl coming to Mumbai, bags the supermodel tag with only minor struggle in the city and manages to meet the right persons with luck. And lastly, post interval, the movie becomes a bit lengthy and heavy which leads to loss of interest. Madhur did his extensive research before writing the script and he adds all the real life incidents in the story innovatively. It's really impressive how he uses the wardrobe malfunction and the mentally disabled Delhi model references in the movie with dignity. But it's not all glossy, shining and fashion all the way. The long awaited movie has its moments to enjoy but at the same time it is also slow and dragging in its last hour. So if you want to see a sensitive movie along with entertainment, then \"Fashion\" is a must watch, but I think instead of \"Fashion\", it should have been titled \"Models\".",
         "\"Page 3\", \"Corporate\", \"Chandni Bar\", \"Traffic Signal\", the previous efforts of Madhur Bhandarkar, wore their ragged production values as a badge of honor: the grainy film stock, the tatty wardrobes, the casts that appeared to be recruited right off the streets were meant to indicate a seriousness of purpose and a defiance of the accepted Hindi film aesthetic. These films were gritty, unlovely, a tad too earnest, and somewhat salacious, for, in their quest to expose societal filth, they had much in common with tabloid journalism and trash TV. What elevated them, however, was Bhandarkar's knack for drawing out strong performances from his actors. \"Page 3\" exposed, without any discernible glee, and more's the pity, the tawdry lives of socialites but gave film-viewers a vivacious Konkana Sen Sharma and a hard-as-nails Atul Kulkarni, while \"Chandni Bar\", a gloomy look at the lives of bar dancers, offered a piece de resistance performance from Tabu. I haven't seen \"Corporate\" or \"Traffic Signal\", but suspect they are similarly plodding and humorless. Bhandarkar's production budget was certainly quadrupled for his newest opus, \"Fashion\" to depict the glitz and glamor of the latest industry to come under his gimlet-eyed scrutiny. \"Fashion\" boasts slick production values, a thumping techno soundtrack, but unfortunately, not a lot of fun. Fashion, a worldwide multi-billion dollar industry, is certainly a serious business, but to be entertainment, it shouldn't take itself unduly seriously, because\u0097let's face it\u0097astrophysics and neuro-surgery, it ain't. Sure, the business has always attracted the pretty and none-too-bright, as also the predatory and disreputable, but if Bhandarkar's take on it is as accurate as touted, it has lost the all-important aspect of fun, which is what makes it attractive to millions the world over. Shobha Dé documents the infancy of the Indian fashion scene in her vastly entertaining memoir \"Selective Memory\". In one amusing anecdote, an industry lech proposes that the three young models Shobha, Zeenat Aman, and Asha Puthli perform a striptease for him. While the naïve Shobha and Zeenat are horrified, Asha Puthli giggles her readiness and darts off to her room to prepare. She emerges wrapped in shredded newspaper, does a saucy little dance, and says to the creep, \"You got your striptease: here are the strips\"\u0097pointing to her newspaper costume; \"and I am the tease.\" In the ensuing laughter, the man loses the nerve to pursue them further. It was this crucial element of light-heartedness that is missing from \"Fashion\". Sadly, Puthli, who also acted in the early Merchant-Ivory film \"The Savages\", vanished a long time ago, a rumored victim of drug addiction. I wonder if it is because fashion is now big business in India, as it always was elsewhere, that Bhandarkar doesn't find much levity in his enterprise. \"Fashion\" tells the story of three fashion models at different stages in their careers: dewy fresh, somewhat plump Meghna (Priyanka Chopra) is the small-town girl recently arrived in Mumbai with a ferocious drive to succeed; Shonali (Kangna Ranaut) is the fine-boned, wild-maned reigning queen of the ramp, while Janet (sprightly newcomer Mugdha Godse) is the worldly long-time model who's never struck it big. Right off the bat, Meghna acquires a fairy (of course, he's gay) godmother Rohan, fashion industry small fry with some tenuous access to the bigwigs. Predictably, we witness Meghna's ascendancy even as Shonali's star is on the wane. The race is on, and it seems the one who can look more sullen who will emerge triumphant. Sensible Janet, ever on the sidelines, proffers nuggets of wisdom to upwardly-mobile Meghna, and settles for a marriage of convenience with a successful closeted gay designer. Shonali turns increasingly erratic, suffering drug addiction and much degradation from a parasitic lover, while Meghna, newly svelte, hardened and callous, nimbly steps into the top position, despite some dangerously high heels. If \"Fashion\" works as a cautionary tale, it is due to Kangna Ranaut and Priyanka Chopra, who rise above a rudimentary script, devoid of subtlety or nuance, and deliver haunting performances. Both have taken on daring (by Indian standards) roles depicting drug abuse, along with some truly scary scenes requiring them to appear without makeup. While not exactly bimbos, they do appear to confuse hubris with confidence and throw hissy fits that underscore their pettiness. But the girls succeed in bringing out the human frailties, ambitions, and hopes of the characters. Despite Madhur Bhandarkar's insistence that \"Fashion\" is the result of diligent research, the characters are stereotypical. The models are relentlessly vapid and all the gay characters (save one\u0097the closeted one) flounce and lisp. Is this Bhandarkar's idea of humor? Stanley Tucci in \"The Devil Wears Prada\" is frighteningly efficient, clever, funny, and long-suffering, and one perceives immediately why he is the Meryl Streep character's right-hand man. He is gay, but that is never belabored. Smart writing would have punched up the proceedings, and made \"Fashion\" more watchable. Reality isn't all it's cracked up to be, and we're usually at the movies to escape it. Realistic cinema doesn't have to be as boring as real life; that's where artistic license comes in. I did like Kittu Gidwani, a model from the 'eighties who graduated to movie roles, looking remarkably fit and fine, playing the morally ambiguous fixer at the fictitious agency named Panache, where our model heroines futilely battle for supremacy. Panache is owned by one Abhijit Sarin\u0097played with reptilian sang-froid by Arbaaz Khan\u0097with Gidwani, stubbing out one cigarette after another with her long elegant fingers, as his prime enabler. The married Sarin routinely beds \"the Face of Panache\", whoever she might be at a given moment, and heartlessly inserts anti-pregnancy clauses into modeling contracts. They could have been cartoonish villains, but the pair possesses too much chic and\u0097let's say\u0097panache, to let their characters become laughable. \"Fashion\" aspires to be serious cinema, but given its theme and scope, should have opted to be light as a soufflé, the better to get its point across."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Bhandarkar Entertainment",
         "Grassroots Productions",
         "UTV Motion Pictures"
      ],
      "summaries": [
         "Set against the glittering backdrop of the glamorous but ruthless world of haute couture fashion, this is the story of a small town girl with big dreams. Meghna always knew she was meant to be famous, but she was about to find out the hard way that success came at a price. Fashion is the tale of what happens when the price of success becomes too much to pay",
         "Living a middle-classed lifestyle in Chandigarh's Sector 17, Meghna Mathur wins a beauty contest and decides to become a model, much to the chagrin of her dad, who wants her to be a Chartered Accountant. Determined to succeed, she re-locates to Mumbai, where she initially lives with her maternal uncle, Kuldip and his wife, Santosh. When they find out that she has been appearing scantily-clad in magazines, they ask her to leave. She moves in with fellow-model, Manav Bhasin, and soon finds herself as the lead model of 'Panache', replacing Shonali Gujral. Her decline from fame and fortune begins when she has an affair with her boss, Abhijit Sarin, becomes pregnant, and gets fired for attempting to break-up the Sarin family. Disgraced, and publicly humiliated, she must now decide to stay on or return home to her parents.",
         "Meghna is from small town and wants to make it big in fashion world she comes to Mumbai and tries to get work from her fashion designer friend Rohit she befriends a small time model Janet and enters the fashion world with small assignments where she catches the eye of Anisha Roy and executive for major fashion agency Panache,Shonali is a top model for Panache but agency is fed up with her tantrums and drug abuse which makes them replace Meghna with Shonali she meets Abhijeet Sarin owner of Panache who takes advantage of Meghna where she gets pregnant at the height of success Meghna looses her friends due to her attitude and returns back to her home town she comes back to the city to try her luck back in fashion world and is helped by Rohit and Janet while Meghna is overcoming from her past she gets the news that Shonali is gone in depression and is found begging on streets and Meghna blames herself for that.",
         "A small-town girl finally realizes her dream of becoming a famous supermodel but soon finds out that there's a price for her glamorous new life."
      ],
      "budget": 0
   },
   "movielensId": 153792,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2008-10-29",
      "dvdReleaseDate": null,
      "directors": ["Madhur Bhandarkar"],
      "runtime": 178,
      "movieId": 153792,
      "title": "Fashion",
      "mpaa": "PG-13",
      "actors": [
         "Priyanka Chopra",
         "Kangana Ranaut",
         "Mugdha Godse",
         "Arjan Bajwa",
         "Samir Soni",
         "Ashwin Mushran",
         "Kitu Gidwani",
         "Konkona Sen Sharma"
      ],
      "imdbMovieId": "0964516",
      "originalTitle": "Fashion",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["WPWcIw5xF4c"],
      "plotSummary": "Fashion begins in, where aspiring model Meghna Mathur (Priyanka Chopra) expresses her wish to go to Mumbai and pursue her dream of becoming a supermodel. Through her eyes we see that behind the glitz and glamour of the world of fashion not everything is as it seems.",
      "tmdbMovieId": 19624,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 19,
      "posterPath": "/4kUx8PgPNxVF9KKAcz6hNiiFbrg.jpg"
   }
}