{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0388242",
      "video": false,
      "title": "Mariages !",
      "recommendations": [
         19565,
         58497,
         40413,
         31789,
         72363,
         46728,
         64357,
         60106,
         10268,
         13740,
         51861,
         33704,
         45061,
         21776,
         13730,
         62134,
         62822,
         19099,
         57417,
         18825
      ],
      "backdrop_path": "/o8294S0fKmDP8et9rP0Rw9dY3n9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe4831c3a36847f815bf93",
               "name": "Jean Dujardin",
               "profile_path": "/fpNJxVL3I4atLSmWJqmVzDR4TWI.jpg",
               "id": 56024,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Valentine",
               "gender": 1,
               "credit_id": "52fe4831c3a36847f815bf97",
               "name": "Mathilde Seigner",
               "profile_path": "/2aH71AKpo9qbkjOU1XQFv97r4Fj.jpg",
               "id": 48577,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hugo",
               "gender": 2,
               "credit_id": "52fe4831c3a36847f815bf9b",
               "name": "Antoine Duléry",
               "profile_path": "/ythiHHJtHKVQcMlrnKnwSkOwf21.jpg",
               "id": 74110,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gabrielle",
               "gender": 1,
               "credit_id": "52fe4831c3a36847f815bf9f",
               "name": "Miou-Miou",
               "profile_path": "/oqTRzZm0h7KDTQEy5K4DSskaBrm.jpg",
               "id": 4274,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Micky",
               "gender": 1,
               "credit_id": "52fe4831c3a36847f815bfa3",
               "name": "Lio",
               "profile_path": "/uryhG58e60FuwCifYovolyo7nkq.jpg",
               "id": 130712,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Chantal, la mère de Ben",
               "gender": 1,
               "credit_id": "52fe4831c3a36847f815bfa7",
               "name": "Catherine Allégret",
               "profile_path": "/kb6186eWhiozkAmF3O2UziwY0G9.jpg",
               "id": 16926,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4831c3a36847f815bf8f",
            "name": "Valérie Guignabodet",
            "profile_path": null,
            "id": 113606,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.289748,
      "production_countries": [],
      "id": 52538,
      "vote_count": 34,
      "budget": 0,
      "overview": "Ils ont 25 ans et se marient aujourd'hui.Ils ont 35 ans, se sont unis il y a dix ans et se déchirent aujourd'hui.Ils ont 45 ans, se sont déchirés il y a dix ans et tentent aujourd'hui de se réconcilier...",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         10735,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Mariages !",
      "runtime": null,
      "poster_path": "/2UJfJgJwMchfiLOGJ3KcnIOsO9.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-04-21",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Valérie Guignabodet"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Valérie Guignabodet"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0388242/",
      "coverLink": null,
      "actors": [
         "Mathilde Seigner",
         "Jean Dujardin",
         "Miou-Miou"
      ],
      "reviews": [
         "The film is an essay on marriages. Robert Altman tried to do the same in \"A Wedding\" and ended up with a delectably visual and aural feast that missed your heart by a mile. Altman tried to approach the subject as a black comedy, while this French film reaches out truthfully to lay bare all the charades between man and woman as seen through the lives of different married couples over a couple of days. Altman is a man; Valerie Guignabodet is a woman--viva la difference! Guignabodet unlike Altman is not worried about the ceremony--she is more interested in dissecting the cadaver as in an autopsy. In the end, her shot of the bride's mother walking away taking the middle path (literally and figuratively) away from it all is a masterstroke. The end, in some ways, is better than the rest of the film because it makes a mute statement. (Remember the end of Mazursky's \"An Unmarried Woman\"?) The rest of the film belongs to the actors--the most underrated actress in the world Miou-Miou (see her in Claude Miller's \"Dites-lui que je l'aime\" or that brilliant \"Netoyages a sec\") and the arresting Mathilde Seigner. True they have great lines but they make the characters leap out the screen, however small (a teeny weeny Air France seat TV screen in my case). The film is unusual--it has sex but never shows it, it is only aural. The film captures the effect it has on others. The social jibes at the British (thru a fictional Kenneth Branagh who never appears) and the East Europeans (a Pole who is seen as Russian) could easily have been an Altman effect, but director Guignabodet is able hit you below the belt as she makes jabs after jabs at various social institutions, e.g., replacing the wedding march music with pathos, the best man who forgets the rings, traditional marriages compared to modern ones, role of gays vs. heterosexuals at marriages. A true blue-blooded French film, if ever there was one.",
         "On the day of the wedding of Johanna (Chloé Lambert) and Benjamin (Alexis Loret), her mother Gabrielle (Miou-Miou) has carefully planned all the details to welcome family and guests in her house in the country and have an unforgettable ceremony. Benjamin does not recall in the morning his bachelor party with his best man Alex (Jean Dujardin), who is in crisis in the relationship with his wife Valentine (Mathilde Seigner). She is having a secret affair with their friend, the wolf Dr. Hugo (Antoine Duléry), who is married with the sweet Micky (Lio). When Valentine tells Alex that she wants the divorce, he becomes upset and disturbed, drinking a lot. During the presentation of the travesty Roberta (Michel Dussarat), who had just arrived in the party to bring the wedding rings lost in the bachelor party in the cabaret where she works, Alex speeches disclosing a series of revelations in the relationships of his acquaintances and friends. \"Mariages!\" approaches a serious theme, the relationship of a couple before and after wedding, with a subtle line between comedy and drama. The director and writer Valérie Guignabodet was able to present a delightful and deep discussion about the war of sexes using a magnificent cast, intelligent and witty lines and a wonderful music score. In spite of having many lead characters, all of them are very well developed along 100 minutes running time. Further, the excellent French actresses are strong characters and very gorgeous women, actually a pleasure for the eyes, and the smile of Lio is one of the most beautiful I have ever seen on the screen. In the end, love prevails and wins this pleasant war. My vote is seven. Title (Brazil): \"Casos e Casamentos\" (\"Affairs and Marriages\")",
         "The French are very good at exploring what brings us into a relationship and what destroys everything. Sure, this movie has a comic twist, but the subject in itself is serious. One day, everything's going well. The next: your life falls apart. It's the timeless game of love. And the subject is well approached by Guignabodet. The fact that she's got a great cast helps a lot. Mathilde Seigner, Miou-Miou, Didier Bezace and Lio are all wonderful in their respective role. Chloé Lambert is delectable. The music is good and there's also great camera work. Seen on April 2th, 2005, at the Royal Cinema, in Toronto, during the Cinéfranco festival. 79/100 (***)",
         "As a wedding is going to take place, there are all kinds of things to consider. Usually, the bride and the groom have no saying in what is going on; they leave it to the parents to quarrel among themselves because otherwise it gets too complicated. Gabrielle, the divorced mother of the bride to be, has done most of the preparations. The groom's parents go over the expenses carefully, noticing how expensive the whole thing is going to be. The guests are gathering for what they think is going to be a festive occasion. What no one has prepared for is the revelations about how most of the guests have been sexually involved with one another. This almost derail the wedding, but alas, being this a French comedy, all end's well. There are some talented people involved in this comedy that could only be done in France because they can only pull this off. Valerie Guignabodet wrote and directed \"Mariages\" with sure hand. There is a lot going on in this film that is funny and entertaining. Miou Miou plays Gabrielle, the mother of the bride. Mathilde Seigner makes an interesting Valentine. Jean Dujardin has some good moments as Alex. We also enjoyed Antoine Dulery, the wonderful Lio, and Catherine Allegret, daughter of Simone Signoret makes an appearance.",
         "'Mariages!' resembles 'Festen', with its observance of the dramatic unities, absence of special effects and minimal musical score. It upsets family values just as much, with plenty of wry wit from that women's point of view that is so refreshing in today's cinema. Yes, the male characters are all weak and unadmirable, and the women are all finding strength and freedom, but we are getting so used to that these days that it is hardly noticeable any more. \"Another coward, like all men\", says the Mathilde Seignet character, and that's it for the men in this movie. The story arc is well maintained, and the climax, for once, actually works, stitching it up nicely in the rom-com genre. There are passages where the picture almost doesn't work. At the start, we are not sure whether it is a wedding or a wedding rehearsal. The transvestite character almost doesn't fit in. But in the end, after the whole of adult society has been torn to bits, everything fits together again with a bit of philosophy. A satisfying piece of French film-making that miraculously avoids explicit sex."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Pan Européenne",
         "StudioCanal",
         "France 2 Cinéma"
      ],
      "summaries": ["On the day of the wedding of Johanna and Benjamin, her mother Gabrielle has carefully planned all the details to welcome family and guests in her house in the country and have an unforgettable ceremony. Benjamin does not recall in the morning his bachelor party with his best man Alex, who is in crisis in the relationship with his wife Valentine. She is having a secret affair with their friend, the wolf Dr. Hugo, who is married with the sweet Micky. When Valentine tells Alex that she wants the divorce, he becomes upset and disturbed, drinking a lot. During the presentation of the travesty Roberta, who had just arrived in the party to bring the wedding rings lost in the bachelor party in the cabaret where she works, Alex speeches disclosing a series of revelations in the relationships of his acquaintances and friends."],
      "budget": 0
   },
   "movielensId": 153897,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-04-21",
      "dvdReleaseDate": null,
      "directors": ["Valérie Guignabodet"],
      "runtime": 0,
      "movieId": 153897,
      "title": "Mariages !",
      "mpaa": null,
      "actors": [
         "Jean Dujardin",
         "Mathilde Seigner",
         "Antoine Duléry",
         "Miou-Miou",
         "Lio",
         "Catherine Allégret"
      ],
      "imdbMovieId": "0388242",
      "originalTitle": "Mariages !",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ils ont 25 ans et se marient aujourd'hui.Ils ont 35 ans, se sont unis il y a dix ans et se déchirent aujourd'hui.Ils ont 45 ans, se sont déchirés il y a dix ans et tentent aujourd'hui de se réconcilier...",
      "tmdbMovieId": 52538,
      "avgRating": 2.25,
      "releaseYear": "2004",
      "numRatings": 2,
      "posterPath": "/2UJfJgJwMchfiLOGJ3KcnIOsO9.jpg"
   }
}