{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "hallucination",
            "id": 3298
         },
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "taxidermy",
            "id": 9719
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "gothic horror",
            "id": 15032
         }
      ],
      "imdb_id": "tt0166377",
      "video": false,
      "title": "The Third Eye",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mino",
               "gender": 2,
               "credit_id": "52fe4a41c3a36847f81c3be5",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Martha",
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3c01",
               "name": "Gioia Pascal",
               "profile_path": null,
               "id": 1140829,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Laura/Daniela",
               "gender": 1,
               "credit_id": "52fe4a41c3a36847f81c3c05",
               "name": "Erika Blanc",
               "profile_path": "/k2M4a74wlBf91G4YUzBanxDXPrU.jpg",
               "id": 97929,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mutter",
               "gender": 1,
               "credit_id": "52fe4a41c3a36847f81c3c09",
               "name": "Olga Solbelli",
               "profile_path": "/Aitgs3GSD5r4yKBR1zl6mpqehmk.jpg",
               "id": 1050319,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Nightclub performer",
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3c0d",
               "name": "Marina Morgan",
               "profile_path": null,
               "id": 1140830,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Doktor",
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3c11",
               "name": "Richard Hillock",
               "profile_path": null,
               "id": 1140831,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Policeman",
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3c15",
               "name": "Luciano Foti",
               "profile_path": "/i2xM8OzI1bSzFfBlvpPXq0Vaks.jpg",
               "id": 1140832,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Loredana",
               "gender": 0,
               "credit_id": "58e4859392514127ec02bb4d",
               "name": "Gara Granda",
               "profile_path": null,
               "id": 1790086,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3be1",
               "name": "Mino Guerrini",
               "profile_path": null,
               "id": 99440,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3beb",
               "name": "Mino Guerrini",
               "profile_path": null,
               "id": 99440,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3bf1",
               "name": "Piero Regnoli",
               "profile_path": null,
               "id": 49894,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a41c3a36847f81c3bf7",
               "name": "Gilles De Reys",
               "profile_path": null,
               "id": 1140828,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58e4850f9251412819028804",
               "name": "Luigi Carpentieri",
               "profile_path": null,
               "id": 49899,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e4851bc3a3684a7901b642",
               "name": "Ermanno Donati",
               "profile_path": null,
               "id": 49900,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e4852492514128350299c8",
               "name": "Francesco De Masi",
               "profile_path": null,
               "id": 37789,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58e4852e92514179de01cace",
               "name": "Alessandro D'Eva",
               "profile_path": null,
               "id": 553861,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58e4853892514179de01cad2",
               "name": "Ornella Micheli",
               "profile_path": null,
               "id": 101099,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58e48543c3a368731a02b356",
               "name": "Mario Chiari",
               "profile_path": null,
               "id": 25802,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58e48552c3a36872ee02afd6",
               "name": "Joe Gossip",
               "profile_path": null,
               "id": 1790085,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5ab7c196925141395201b709",
               "name": "Phil Young",
               "profile_path": null,
               "id": 2007241,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.164027,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 104927,
      "vote_count": 2,
      "budget": 0,
      "overview": "The young Count Mino live in a big, old castle together with his dominant mother and a maid. Mother does not want him to marry his fiancee Laura, which turns out to have dire consequences.",
      "similar": [
         238636,
         452507,
         588,
         8413,
         281957,
         133805,
         9272,
         357096,
         49950,
         9654,
         156022,
         261023,
         260346,
         281,
         979,
         1427,
         73861,
         10781,
         11033,
         10285
      ],
      "original_title": "Il terzo occhio",
      "runtime": 98,
      "poster_path": "/7st1ANZERy83fAVG5A5VHuoRztY.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Panda Societa per L'Industria Cinematografica",
         "id": 4827,
         "origin_country": ""
      }],
      "release_date": "1966-06-11",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mino Guerrini"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Gilles De Reys",
         "Mino Guerrini"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0166377/",
      "coverLink": null,
      "actors": [
         "Franco Nero",
         "Gioia Pascal",
         "Erika Blanc"
      ],
      "reviews": [
         "THE THIRD EYE (Mino Guerrini - Italy 1965). This interesting little chiller by Mino Guerrini, starring Franco Nero and Erika Blanc, certainly was much better than I expected. Often categorized as an early Giallo, it's actually more of a mix of Gothic horror and some Giallo elements. Definitely not the six-penny quickie, I expected. It's quite an elaborate production, well-shot, with fine acting and cinematography. Franco Nero is Mino, a young count who lives with his dominant mother and jealous servant Martha in an isolated mansion in the Italian countryside. Like Anthony Perkins in PSYCHO - with which this film shares quite a few parallels - Mino has a fascination with birds, particularly stuffed birds. A few days before his marriage with the young and beautiful Laura (Erika Blanc), she mysteriously dies in a car crash and soon-after, his mother is killed. Mino begins to lose his sanity and starts luring young women into his mansion in order to kill them, together with his willing accomplice Martha, who secretly loves him, but one day, a young woman visits him who looks just like his late fiancée Laura. Although the \"Count gone mad scenario\" was already a bit over-used by the time the film was made, the (then) contemporary setting, the murder mystery angle, elegant production design, professional cinematography and more than adequate direction, make this one well worth a look and definitely a cut above the average attempt within European genre-film-making, to say the least. The film is also surprisingly candid in its sexual nature (although complete nudity is absent) and, regarding that aspect, is a typical exponent of the transitional period in the mid-sixties. Fans of Franco Nero might wanna take a look at him in a role as a neat, well-dressed and impeccably coiffured young man, quite the contrast to the sweaty, unshaven Django-look, or generally sleazy look, he would cultivate later in his career. The film was remade as BURIED ALIVE (1978), the gore classic by Joe D'Amato. Currently only available in German, but with the DVD-age already coming to a close, it's unlikely that this film will ever see an English-language release, so the German-only version is perhaps something even English speaking fans of obscure Italian cinema should consider. Camera Obscura --- 7/10",
         "***SPOILERS!*** Franco Nero truly is an amazingly versatile actor, and his films from 1966, probably the most important year for his career, are a perfect proof for that. In the same year when Nero became an immortal cult-icon as the cynical and super-tough eponymous antihero in Sergio Corbucci's \"Django\", he also played an insane mother's boy with a Norman Bates complex in this amazing psychological chiller \"Il Terzo Occhio\" (aka. \"Third Eye\"). Released several years before the heyday of the Giallo in the early 70s, and only few years after Mario Bava's genre-defining masterpieces \"The Girl Who Knew Too Much\" (\"La Ragazza Che Sappeva Troppo\", 1963) and \"Blood And Black Lace\" (\"Sei Donne Per L'Assassino\", 1964), \"Il Terzo Occhio\" is sometimes referred to as an early Giallo with Gothic elements, but it isn't really, in my opinion. Giallo or not, \"Il Terzo Occhio\" is doubtlessly an amazingly morbid Psychological Horror Film with a wonderful Gothic atmosphere and a stunning mood of insanity that should definitely appeal to all those who love the Giallo genre. Nero plays Mino, a young count whose life is dominated by his possessive Mother (Olga Solbelli). Mino's plans to marry the beautiful Laura (Erika Blanc) are a thorn in the flesh both of the malicious old countess and the murderously ambitious Maid Marta (Gioia Pascal)... The film begins exquisitely macabre, when the murderous plans of two possessive women get out of hand, and carries on morbidly when the young count himself goes absolutely nuts. Terriffically set in an eerie country mansion, \"Il Terzo Occhio\" very obviously copied some elements of Alfred Hitchcock's masterpiece \"Psycho\" (1960), but, as usual for Italian Horror Films, it is in many ways more explicit and morbid than the acclaimed American film. As famous movie-Psycho Norman Bates, mother's boy Mino enjoys stuffing animals, but, as opposed to \"Psycho\", we also get to watch his hobby in explicit detail, for example. Franco Nero is, as always, brilliant in his role, and the rest of the cast is terrific too. Fans of Italian Cult-Cinema will be delighted to see the beautiful Erika Blanc (\"Kill Baby... Kill!\", \"The Devil's Nightmare\", \"The Night Evelyn Came Out Of The Grave\", etc.) in the role of Laura. THE great female performance in this film, however, comes from the equally beautiful Gioia Pascal, who sadly never appeared in any other film. Olga Solbelli is great in the role of the horrible old witch of a countess. \"Il Terzo Occhio\" is probably most famous for spawning a more (in-)famous remake, sleaze-deity Joe D'Amato's notorious and ultra-nasty Exploitation highlight \"Buio Omega\" (\"Beyond The Darkness\", 1979). Buio Omega, which tells basically the same story, but focuses more on (very) explicit gore, necrophilia and detailed perversions is also highly recommendable, but only to those with a good stomach. While both films are definite must-sees for my fellow Italian Horror buffs, this one is also recommendable to those who are not into extreme nastiness and nauseating gore. Even though it does not (yet) get the attention it deserves, \"Il Terzo Occhio\" is an amazingly creepy film with a great ensemble cast that must not be missed by fans of Italian Horror. Highly recommended!",
         "Although I only saw this movie once and over 25 years ago, the imagery and disturbing feel have stayed with me. Sure, the production values weren't up to current standards and the acting is not top drawer, but somehow what makes it to the screen gets under your skin and makes it crawl. True horror buffs should be fighting to get a copy of this for their collections - and I don't understand why it hasn't received more play in the USA. (OK, so it's foreign and involves cannibalism and other nasty things; is that any reason to pass it over?!) The young Franco Nero in this feature shows the acting promise of the later movies he appeared in, a number of them made for US audiences.",
         "Contains Spoiler! This lesser known early Giallo tells the story of a young count (played by a very young looking Franco Nero) who loses his sanity completely after his fiancée has died in a car accident. The accident happened because the jealous housekeeper of the count and his dominant mother sabotaged the fiancée's car. The young count takes the body back home, only to learn that his mother has died too. She died after the housekeeper had pushed her down the stairs and beaten to death. So, now the count is alone with the murderous housekeeper, and he himself starts to kill every woman he takes home with him. The housekeeper helps him, but only to pursue her own interests. One year later, the sister of the dead fiancée appears, and she looks just like her... Mainly inspired by Alfred Hitchcock's \"Psycho\" (the overtly dominant mother, the count likes to prepare dead animals, hints on necrophilia), this sinister thriller was also the inspiration for Aristide Massacesi's best horror film \"Buio Omega\" (1979). Filmed in black and white, it boosts an uncomfortable atmosphere throughout, and even though it's not very graphic, there are some unpleasantly violent scenes (especially a stabbing towards the end of the movie). There is also a squirm inducing sequence when the count eviscerates a dead bird to prepare it. The only thing with the movie that is annoying are the credits: Almost all people involved are credited with phony English aliases. \"Il Terzo Occhio\" is a catching movie which deserves to be rediscovered by an audience keen to the Thriller and Giallo genre. For my part, I can't understand why the movie is that little known. Rating: 7 out of 10.",
         "The Third Eye has been pretty much forgotten; but many fans of Italian horror will have heard of the film it heavily influenced; Joe D'Amato's notorious exploitation effort Beyond the Darkness. This one does not have the gore and savagery of the later film and it has to be said that Mino Guerrini's film is rather more arty than horrific. The film is also often seen as a precursor to the Giallo genre, though the links between the two are weak at best. Personally, I would describe this film as Gothic horror, and a precursor to later Italian exploitation. The plot focuses on Mino; a young nobleman that lives in a big house with his mother and their maid. His fiancée, Laura, is not well liked by either the mother or the maid, who seem jealous of her presence. The mother, therefore, decides to sever Laura's brakes and this results in a car accident that kills Laura. Meanwhile, the mother and the maid have a fight and the mother dies are being thrown down the stairs. This leads Mino into madness and murder; he kills a couple of women, before Laura's twin sister arrives at the house... The film stars the great Franco Nero in an early lead role and of course he delivers an excellent performance that mirrors the one he would go on to play a few years later in Elio Petri's A Quiet Place in the Country. The atmosphere is also a major part of the film and the central location is a great place for a Gothic horror film to take place; director Mino Guerrini makes good use of it and creates a claustrophobic feel for the film. The influences for the film are clear; with Edgar Allen Poe and Alfred Hitchcock's Psycho being foremost among them. The Third Eye features some really rather morbid elements such as necrophilia, but through the way it's shot, the film always manages to retain an artful feel and this is a bit of a downer in my opinion as the film could have used a bit more impact. It does remain interest for the duration, however, and everything eventually boils down to a fitting conclusion. Overall, this is a rare film and sourcing an English language version is not easy; but it's well worth the effort for Italian horror fans.",
         "I was extremely astonished to find out that this virtually unknown italian Giallo is actually the original version of the famous BUIO OMEGA. No book on italian horror movies has written anything about this movie and it certainly holds a lot of surprises for those interested in the history of italian exploitation cinema. First, it was made in 1966, black and white, 1:1,66 widescreen. Second as gore goes it's on par with Bava's Sei Donne, so it`s pretty brutal and has an uneasy sadistic subtone. Third Franco Nero (here credited as FRANK Nero) plays the lead role, the necrophil count who has lost his wife. Fourth, theres animal snuff in there. Fifth, a quite explicit rape scene. Anyone who knows Buio Omega will be very familiar with the plot. It's virtually the same. So it is a hidden gem? Yes, absolutely. Is it a classic? Hm ... the acting ranges from wooden to ridiculous and the whole movie looks and sounds and moves more like a teleplay. So it's not really a technically good one (unlike Sei Donne). But anyway, if you have the chance to see this film, get it. Out on DVD currently in Germany with a nice, crisp print (das dritte Auge), but language only in german...",
         "Franco Nero plays a young taxidermist named Mino,who lives with his domineering mother and a loyal family servant Marta in a Gothic residence.The elderly widowed Countness doesn't want his son to marry his beloved Laura.To achieve her goals Marta cuts the brake cable on Laura's car causing the vehicle to roll off an embankment and into a lake and murders the Countess pushing her down the stairs.This is the beginning of Mino's madness.He takes Laura's body and preserves it and starts picking up women and choking them to death in the presence of his preserved love.\"The Third Eye\" is strikingly similar to \"Buio Omega\",but nowhere nearly as gruesome and disgusting.The cinematography is elegant and stylish and the use of romantic score is a nice touch.A must-see for fans of \"Buio Omega\".8 out of 10.",
         "Now, here we have a fully fledged Italian nasty in 1966! Didn't see that coming, and with Franco Nero in a starring role too! Nice. This one starts like it's heading off into Psycho territory, what with the twitchy young man (Nero) due to be married to his fiancé (Blanc) who is hated by his domineering mother (who has a spyhole to her son's room - that's a bit sick for starters!), also, there's the maid Marta, who loves Nero and will stop at nothing to have him for herself. There's no masked killer here as Marta basically kills Nero's mother and causes Blanc to die in a car crash, which causes Nero to become insane and bring lovely Italian babes home to murder while a stuffed version of Blanc lies in the bed next to them. It all becomes a game of 'Who's the Craziest Murderer' before Blanc's twin sister turns up and throws everything into chaos as Nero thinks she's his fiancé. This film is full of bizarre and brutal images, from Nero bringing a sexy dancer home only for her to wander his creepy mansion (no film from this era could exist without one!), to the very brutal stabbing of a main character (who survives to drag themselves around the house!), to the terror of Blanc's twin sister suffering at the hands of a psycho and a bizarre rape on a beach, The Third Eye was full of crazy imagery and basically paves the way for the 'no holds barred' films we would be subject to in the seventies. Franco Nero is pretty young here, and he's almost got his 'staring emotionally' thing almost down to a tee, but not quite. He's still pretty good though. I'm surprised that Gioia Pascal didn't make more films, because she's really good as Marta, the crazy maid who brings all this madness down on everyone's head. It looks like the version I watched might have been one of those 'rebuild' films as the soundtrack switches from Italian to German at the more violent points, but this is a nice hidden gem worth looking out for Nero fans and fans of crazy Italian films.",
         "THE THIRD EYE is a proto-giallo made on a low budget and in black and white. This is more of a psycho-thriller in the Hammer mould than a Bava-style giallo. There's a debt of inspiration owed to Hitchcock's PSYCHO. If a sense of familiarity comes to you while watching, it's because Joe D'Amato virtually remade the movie for his 1979 nasty, BLUE HOLOCAUST. As a psychological thriller this is an interesting little film, with the usual bunch of nasty characters holed up in a rambling mansion. There's the dominating old mother, the conniving housekeeper, and the wayward son; the son's innocent bride-to-be soon learns of the madness inherent in the household. The requisite number of plot twists hold the attention throughout, and there's plenty of style to boot. Some of the violence is explicit for the period and the taxidermy theme can be unpleasant. Some of the acting is a little histrionic but overall this is an interesting, albeit neglected, curio. Franco Nero headlines the cast prior to achieving fame as DJANGO.",
         "A troubled young Count (Franco Nero), living in a crumbling villa with his domineering mother, takes comfort in taxidermy (sound familiar?) until he falls in love with a girl (Erica Blanc) his mother naturally doesn't approve of. The old battle ax tells a servant she treats \"like a daughter\" that she'd be forever grateful if the girl would make her son's fiancée disappear and not only does the servant kill the son's intended, she offs his mother, too. The Count takes his mom's death hard but not as hard as his fiancee's, whose body he stuffs before he starts strangling strippers. The servant tells him she'll help cover up his crimes if he'll marry her and he agrees but when his dead fiancee's look-alike sister (also Erica Blanc) shows up looking for answers, complications ensue... To say THE THIRD EYE was inspired by Alfred Hitchcock's PSYCHO would be an understatement but it does go off on a crazy tangent of its own and was obviously capitalizing on a spate of Hammer \"mini-Hitchcock\" thrillers popular at the time (MANIAC, PARANOIA, HYSTERIA). In black & white with cool-looking red subtitles, the damn thing was never dull, that's for sure. Cult director Joe D'Amato \"unofficially\" remade this as BEYOND THE DARKNESS in 1979.",
         "Whilst much of this b/w film is well shot with interesting angles and perspectives, I didn't feel that the director truly had a grip on things. There are good moments and frankly duff moments and despite the presence of franco Nero there were times when I wondered if I was even going to stick with this. First real problem is that as things get under way we are introduced to the overpowering mother of Nero's character, played by Olga Solbelli and she is fantastic, like some Fellini grotesque and , of course, the splendid, EriKa Blanc, and they both disappear from the picture. Almost in the blink of an eye the best are gone and we are left with a struggling Nero and a conniving maid. Nero works very hard in his role as a latter day Italian Bates but the director doesn't seem to help and he sometimes seems to overdue things, to become just too 'crazy'. Worth a look as a supposed forerunner to D'Amato's Buio Omega and it probably features the longest struggle towards a ringing phone in movie history."
      ],
      "genres": [
         "Thriller",
         "Horror"
      ],
      "productionCompanies": ["Panda Societa per L'Industria Cinematografica"],
      "summaries": [
         "A young bachelor Mino Alberti (Franco Nero), lives in an old manor with his overprotective mother and his faithful maid, is just a few days before getting marry, his fiancee dies in a mysterious car crash. Soon afterwards Mino begins to lose his sanity and lures young women into his house with nefarious intentions.",
         "A young count who lives with his dominant and jealous mother, begins in a downward spiral into madness after his fiancée dies in an accident - or it wasn't an accident?"
      ],
      "budget": 0
   },
   "movielensId": 153955,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1966-06-11",
      "dvdReleaseDate": null,
      "directors": ["Mino Guerrini"],
      "runtime": 98,
      "movieId": 153955,
      "title": "The Third Eye",
      "mpaa": null,
      "actors": [
         "Franco Nero",
         "Gioia Pascal",
         "Erika Blanc",
         "Olga Solbelli",
         "Marina Morgan",
         "Richard Hillock",
         "Luciano Foti",
         "Gara Granda"
      ],
      "imdbMovieId": "0166377",
      "originalTitle": "Il terzo occhio",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "The young Count Mino live in a big, old castle together with his dominant mother and a maid. Mother does not want him to marry his fiancee Laura, which turns out to have dire consequences.",
      "tmdbMovieId": 104927,
      "avgRating": 2,
      "releaseYear": "1966",
      "numRatings": 1,
      "posterPath": "/7st1ANZERy83fAVG5A5VHuoRztY.jpg"
   }
}