{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0349752",
      "video": false,
      "title": "Loverboy",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Denise",
               "gender": 0,
               "credit_id": "52fe4b15c3a36847f81f1905",
               "name": "Monique van der Werff",
               "profile_path": null,
               "id": 239572,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Michael",
               "gender": 0,
               "credit_id": "52fe4b15c3a36847f81f1909",
               "name": "Dragan Bakema",
               "profile_path": "/u0WyVXcyDAJULrgKIpiDMkkYMFA.jpg",
               "id": 227768,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe4b15c3a36847f81f190d",
               "name": "Marie Louise Stheins",
               "profile_path": null,
               "id": 1054639,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Claudia",
               "gender": 1,
               "credit_id": "52fe4b15c3a36847f81f1911",
               "name": "Chantal Janzen",
               "profile_path": "/sZrata3NAORpfcRU6E9K6gAAHGk.jpg",
               "id": 115690,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4b15c3a36847f81f1901",
            "name": "Lodewijk Crijns",
            "profile_path": null,
            "id": 1026383,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.102117,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 112346,
      "vote_count": 2,
      "budget": 0,
      "overview": "Scholiere Denise is ontevreden met haar leven en als ze de 19-jarige charmante Michael tegenkomt lijkt haar verlangen naar luxe en romantiek vervuld te worden. Maar Michael investeert in haar uit eigen belang.",
      "similar": [],
      "original_title": "Loverboy",
      "runtime": 79,
      "poster_path": "/rP5nOJz2sWQ0eN44P3189uyE6AZ.jpg",
      "spoken_languages": [{
         "name": "Nederlands",
         "iso_639_1": "nl"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Motel Films",
         "id": 865,
         "origin_country": ""
      }],
      "release_date": "2003-04-12",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Lodewijk Crijns"],
      "runtime": 79,
      "synopsis": null,
      "writers": ["Jacqueline Epskamp"],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0349752/",
      "coverLink": null,
      "actors": [
         "Monique van der Werff",
         "Dragan Bakema",
         "Marie-Louise Stheins"
      ],
      "reviews": [
         "This film is about loverboys, men who seduce young girls/women and force them in to prostitution. They're not very friendly people, usually using violence so that their victim is too afraid to do anything about their situation. So what do you do when you make a movie about loverboys? You make the loverboy a nice guy, someone who falls in love with his victim, awww isn't that romantic? Yes it is and that's the whole problem about this movie. It totally underrates the problem. Never is there a real threat, Denise the victim never seems to be stuck in her situation, she isn't forced to become a prostitute, she isn't forced to stay one. At the end she finds out that the loverboy has other girlfriends and then she just quits with the guy. Just like that. One can argue that it wasn't the intention of the makers to make a film about the real problem, the actor portraying the loverboy did acknowledge that in real life the loverboy situation is far more violent. However since this film is about the only one about loverboys it's regarded as a good source and a good representation about it. And that's the real disturbing part since the film more or less promotes the good side of loverboys more than emphasize the negatives. At least the previous commenter also knows better. In the Dutch show 'Cut (2003)' there was an episode about loverboys as well, but handled so much better. Especially since it didn't have a happy ending, and the girl that was the victim disappeared just like many do in real life.",
         "Loverboy is a movie made for TV and at the end of summer 2004 it will be repeated. As a health care teacher I use this movie in the classroom. I think all children must see this movie. But followed by a discussion about loverboys and forced prostitution. The Loverboy in this movie looks like a nice guy. Too nice if you ask me. But if he wasn't that nice the victim would not have fallen for him. That's the reason why I think it would be best to discuss this issue afterwards. In my opinion this movie is best seen by children aged 14+ But accompanied with an adult. With kindest regards Marion",
         "This movie was made for television but could have made for cinema if they had rewrote the script. Nasty loverboy Michael gives a 17-year old girl presents so she falls in love with him. But he also begins to like her, even he sells her to men for money. The splitscreentric do work for me, but the MTV-videoclips doesn't. I rather saw a decent ending. Pitty, could have been better. 6/10",
         "I don't get it, does this movie make lover boys look good or bad. the guy who is the lover boy first does everything for its victim, later gets her to become a prostitute. That is normal with lover boys, but most part the victim doesn't seem to care and the lover boy isn't tricking the victim in the prostitution (The lover boys seems to love her for real.). it's almost just a love story with prostitutes. I guess they wanted to keep the movie for 12 years and older (Which is kind off weird for a movie with, perhaps censored (you don't see breast or the penis-vagina), sex scenes. the ending is way to happy, it seems she just goes away from the lover boy without any problem, only later she gets a cut from him at the very end. My point is, if they wanted to warn people about lover boys they failed. in real life the girls don't like being prostitute's (In the movie, except for a little bit of doubt at the beginning, the protagonist doesn't seem to care.) and in real life they don't get away so easily or so unharmed. Nor do real lover boys really love the girl they get, in this movie the lover boy defends its victim sometimes. To make a story short the idea is good, but the movie is just too happy, and doesn't teach us anything except lover boys take you on vacations or give you expensive stuff and don't hurt you when you disagree.",
         "First of all, I think the movie isn't believable and for a science fiction that is oke, but for a drama it isn't. That is because of a couple of points, the actors haven't really done a great job, many times I was confused with expression they were giving. Second, I think it's selling being a prostitute and I wouldn't advise any parent to let their child see this movie. There were many moments through the movie that I thought, well being a prostitute isn't so bad. The movie almost only shows good sides to being a prostitute and everything bad that happens, the female just doesn't really care, or get's over it within a minute and everything is happy again.",
         "Made this year for TV, Loverboy is an example of a Dutch movie with a (psuedo)-criminal subject as theme. One scary little detail is that such things happen in reality, and as such is not just fiction. possible spoilers ahead in synopis There once was 17 years old girl, unhappy with her life. When alone she dreams away on the sounds of MTV/TMF, about rich people who are happy, who have fun, who can do whatever they want. She wants that life. Then there appears mister nice guy. Not on a white horse, but in a black Mercedes cabrio. He fancies her with presents (mobile phone, jewelry), and they look a happy couple. At least, she thinks, but silly silly girl, mister nice guy is not mister nice guy at all. He perfectly manipulates her, using her weakness of being let down by him, and she starts working as a prostitute for him, to pay back the expenses he made to buy her fancy goodies. He has some serious debts, you must know... However, silly silly girl she is, she still is convinced he loves her. But she overhears a conversation between mister not-so-nice guy and his, also not so nice, friends. She decides to quit her profession, and returns to her elderly home. Home sweet home at last. I rated this movie 7/10. The theme is original, and also actual. Furthermore, though I am not a psychologist, the movie somehow addresses the problem of the lone child influences by the sweet tunes of MTV, singing about a life with parties, fast cars. When at a certain moment a mister nice-guy appears, who promises her parties and fast cars, one may doubt his intentions. I didn't rate the movie 8/10, since the characters are relatively one-dimensional. Not a bad view after all. Mothers beware!",
         "This film is about an issue which is quite often in press here in Holland: Maroccan Loverboys (hence the title) gets nice blond dutch chick to be a prostitute. She does not mind and things go from bad till worse... And then she finds out, but it's not... The movie gets better through time... Nice waist of time though.",
         "I think that the main issue, in the background, of this movie is that young girls are being taught by videoclips on MTV to love the external, material aspects of life, which makes them vulnerable to loverboys (pimps who recruit young girls). This movie is about the process of a young girl, Denise, becoming a prostitute. She is seduced by a good looking, succesful and rich guy, Micheal. Step by step Micheal changes her from a sweet, innocent girl, into a prostitute. The movie shows in great detail how Micheal plays a psychological game with her. The second storyline of this movie is that Micheal falls in love with her, which was, of course, not planned, because he is a pimp. You see Micheal's internal struggle with this. He tries to get her to be a prostitute, but sometimes he tries to protect her from it. Denise is ruining her life, quitting school, running away from home, losing her friends. The viewer is omniscient, you see both Denise's conversations with her family and school-friends, as Micheal's conversations with his co-pimps.",
         "Loverboy is made within the project of TeleFilm to promote Dutch movies. Of course the budget is much smaller than the mean Hollywood production, so that we shouldn't expect a high quality production. However this has its own charming effect on the movie. Perhaps the story is simple, but it is easygoing and nice to watch at, especially for the younger people. A reality is exposed which perhaps can be used as a warning: do not trust guys with money too soon! Your self respect is much more important than money. The story is about a girl named Denise who meets Michael: a charming man who has lots of money and likes to spend it (on Denise). What she doesn't notice, is that Michael has other plans with her; he is a loverboy and wants to use Denise to make money for 'them' by introducing her into the prostitution circuit. Landing in a network of smart tricks and many lies she walks away from home and throws her safe environment and future away. Finally the only mistake Michael makes, is falling in love with Denise. But after all his lies, can this love still be answered and fulfilled?!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Motel Films",
         "Vrijzinnig Protestantse Radio Omroep (VPRO)"
      ],
      "summaries": ["Seventeen year old Denise from the poor part of a Dutch city falls in love with the charming Michael who promises her a life she can only imagine. But Michael has a secret agenda and manipulates her into prostitution making her believe that's the only way to continue their expensive lives together."],
      "budget": 700000
   },
   "movielensId": 153975,
   "movielens": {
      "languages": ["Nederlands"],
      "releaseDate": "2003-04-12",
      "dvdReleaseDate": null,
      "directors": ["Lodewijk Crijns"],
      "runtime": 79,
      "movieId": 153975,
      "title": "Loverboy",
      "mpaa": null,
      "actors": [
         "Monique van der Werff",
         "Dragan Bakema",
         "Marie Louise Stheins",
         "Chantal Janzen"
      ],
      "imdbMovieId": "0349752",
      "originalTitle": "Loverboy",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Scholiere Denise is ontevreden met haar leven en als ze de 19-jarige charmante Michael tegenkomt lijkt haar verlangen naar luxe en romantiek vervuld te worden. Maar Michael investeert in haar uit eigen belang.",
      "tmdbMovieId": 112346,
      "avgRating": 2,
      "releaseYear": "2003",
      "numRatings": 1,
      "posterPath": "/rP5nOJz2sWQ0eN44P3189uyE6AZ.jpg"
   }
}