{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt5144072",
      "video": false,
      "title": "A Girl in the River: The Price of Forgiveness",
      "recommendations": [],
      "backdrop_path": "/amUFPare0kueuWNYwADQVno8NYF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Herself",
               "gender": 0,
               "credit_id": "570d114092514116f200009b",
               "name": "Saba",
               "profile_path": null,
               "id": 1604829,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "570d114cc3a36850810000df",
               "name": "Asad Jamal",
               "profile_path": null,
               "id": 1604830,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5697b3f8c3a3683afd0026fd",
               "name": "Sharmeen Obaid-Chinoy",
               "profile_path": "/aGzyegTseAdR1qeVfzLSm6PizfE.jpg",
               "id": 1299467,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "57658986c3a36854c4000db0",
               "name": "Sharmeen Obaid-Chinoy",
               "profile_path": "/aGzyegTseAdR1qeVfzLSm6PizfE.jpg",
               "id": 1299467,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57658996c3a36820df000711",
               "name": "Geof Bartz",
               "profile_path": null,
               "id": 116086,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576589be92514168ab002012",
               "name": "Wendy Blackstone",
               "profile_path": null,
               "id": 545376,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "576589dcc3a36812ce00079b",
               "name": "Nadir Siddiqui",
               "profile_path": null,
               "id": 1637933,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 1,
               "credit_id": "589ce1abc3a368114f00266e",
               "name": "Sheila Nevins",
               "profile_path": "/sRjSyPc4gMFw8VzKjSmWGFM6HZx.jpg",
               "id": 1238136,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "589ce1f592514108880029ed",
               "name": "Sara Bernstein",
               "profile_path": null,
               "id": 81150,
               "department": "Production",
               "job": "Supervising Producer"
            },
            {
               "gender": 0,
               "credit_id": "589ce246c3a368115c00297f",
               "name": "Gunnard Doboze",
               "profile_path": null,
               "id": 590352,
               "department": "Crew",
               "job": "Additional Music"
            },
            {
               "gender": 0,
               "credit_id": "589ce2609251410888002a24",
               "name": "Asad Faruqi",
               "profile_path": null,
               "id": 1637932,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.892468,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 369364,
      "vote_count": 9,
      "budget": 0,
      "overview": "A woman in Pakistan sentenced to death for falling in love becomes a rare survivor of the country's harsh judicial system.",
      "similar": [
         10555,
         109445,
         9762,
         10340,
         10144,
         10193,
         10895,
         10527,
         9479,
         12162,
         12230,
         568,
         597,
         1089,
         808,
         812,
         1581,
         3981,
         10882,
         10530
      ],
      "original_title": "A Girl in the River: The Price of Forgiveness",
      "runtime": 43,
      "poster_path": "/8yd3to9I7MrxeTu80U6igsOwGaZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "ਪੰਜਾਬੀ",
            "iso_639_1": "pa"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "HBO Documentary Films",
         "id": 17980,
         "origin_country": ""
      }],
      "release_date": "2015-10-28",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "Falling in love and living to tell her tale.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sharmeen Obaid-Chinoy"],
      "runtime": 40,
      "synopsis": null,
      "writers": ["François-Xavier Durandy"],
      "originalLanguage": "Panjabi",
      "imdbLink": "http://www.imdb.com/title/tt5144072/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNWIyODQ4YjYtNDljOS00MTQyLTk1ZjUtYzQ5MDc2YjFmNzg2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Asad Jamal",
         "Saba"
      ],
      "reviews": [
         "This film is set in Pakistan and is about so-called 'honor killings'--when families murder their own daughters in order to save face with their neighbors. The particular subject of this film is a young lady named Saba. Saba married a man despite her family not giving her permission and her father and uncle dealt with it by shooting her and dumping her into the river. However, Saba's case is unusual because she actually survived the gunshot to her face and the film follows the case through the Pakistani court and to its ultimate resolution...or lack of resolution. The film is hellaciously depressing but fortunately the gunshot wound isn't as horrible to see post-surgically as you might imagine and Saba is rather inspiring because of her inner strength. It's also an amazing film because everyone talks so openly about what occurred and the father seems incredibly proud of his actions and by the end of the film he is elated that he maintained his sense of honor by trying to murder his daughter. By the way, if you are curious, the filmmakers and folks they interviewed were careful to reiterate that these honor killings are not in any way approved of in the Koran but are more cultural than religious in nature. UPDATE: This film did take the Oscar for Best Documentary Short.",
         "We follow a lovely, and at the same time incredible tough, 18 year old girl (Saba) who survives a murder attempt carried out by her father and uncle. Her crime is to have fallen in love with the boy that her family wanted as her husband. A new decision about marriage is taken but Saba follows her heart instead of her fathers rules and runs off and gets married. This act of independence is so hideous and dangerous that the only thing that can restore the family's honor is to kill her. She survives and through interviews with her, the police, a lawyer and family we start to get a picture of how women are looked at in a society that are governed by feudal laws. Especially the interview with her father and uncle in prison makes us understand that daughters should be considered being in eternal debt to their father who has worked so hard to sustain their lives. If she gets \"meal three times a day\" then she shouldn't ask for more. Womens rights are so neglected that if an honor killing is committed and the killer afterward are forgiven by his nearest family - then he walks free. So if Saba forgives her father then he will walk free and so the suspense starts. Will she do this or not? I will not spoil the last part of the story for you but just recommend the movie for being more than politic correct. When you see Saba together with her newly wedded husband you simply cannot understand that this marriage is looked upon as a crime. The happy end is that the movie has gotten so much attention that a fund raising has gotten the couple enough money to buy their own land. /Simon",
         "If you like true stories told very well, but briefly, and you'd like to get a leg up in an Oscar pool, then this review is for you! In my continuing effort to see as many Oscar nominees as possible, I took advantage of the opportunity to see the shorts.TV theatrical presentation \"Oscar Nominated Short Films 2016: Documentary\" (NR, 3:00 – with 10 min. intermission). Here's a brief, spoiler-free summary and evaluation of one of those five films... \"A Girl in the River: The Price of Forgiveness\" (40 min.) – Saba was an 18-year-old Pakistani girl who fell in love with and married a young man of whom her family did not approve. For this \"crime\", her father and uncle kidnapped her from the home of her new husband's family, drove her to a riverbank, shot her in the head, placed her in a sack and threw her in the river. Saba was one of over 1,000 women targeted for \"honor killings\" every year in Pakistan, but unlike most of those nameless victims, Saba survived. We see her in the hospital being treated for her wounds, then we follow her as she returns to live with her husband and his family and is pressured to drop the charges against her uncle and father and publicly \"forgive\" them. All the key players in this real-life drama give interviews in which they tell us about their roles in this story and openly discuss their points of view. We even get to sit in on a meeting between local tribal elders and Saba's lawyer, trying to find a resolution to the case. With remarkable access, a flare for story-telling and the ability to present all points of view without judgment, Sharmeen Obaid-Chinoy has directed an important and outstanding film which rises above the label of \"documentary short\" and demands to be seen by everyone who cares about our common humanity. \"A+\" The other four films in the shorts.TV theatrical presentation \"Oscar Nominated Short Films 2016: Documentary\" are\u0085 \"Body Team 12\" \"Chau, beyond the Lines\" \"Claude Lanzmann: Spectres of the Shoah\" \"Last Day of Freedom\"",
         "This documentary shows the grim reality in its entirety, so much so that we even see wounds and scars. This is what the victims see and feel every day. This film helps fight the case against these laws which allow people to get away with the most heinous crimes and even feel proud about it. No remorse from the attackers. It's frustrating to know how common and similar these stories are and how often there is no justice. I used to hear them and read about them even when growing up, yet nothing changed for the better in all these years. Why?! The problem goes further than the areas of Pakistan where this is common. Many people who originate from these places, bring such heinous views and traditions to the countries where they build a new life. Some of my family members share them, some of our Pakistani family friends agree with them. I hope films like these will help bring an important change, because too many lives have been destroyed already.",
         "I am fond of watching movies but its all about entertainment; nothing for to know the reality of life , when I watch A girl in the river \" I felt a pain in my heart and tears in my eyes because we had no idea of those people whom are living with us but not living with life!Its a great movie against gender discrimination in our tribal traditions and some how fake Islamic scholars.These all traditions are against the Qurran & Islam.In our society there are so many other customs and values to banned the women to show their natural abilities and talent in public working field. Now a days its little bit easy to face the aggression of right wing and credit goes to those powers whom stop the Talban thoughts and trying to make Pakistan a modern liberal country where every could be live without gender, religion, language, cast, status and racial discrimination. I want to see my country a beautiful and piece full place where we could enjoy art, film, games, music,religion values with beautiful family units.",
         "Sharmeen Obaid-Chinoy won an Oscar for her documentary \"Saving Face\", about victims of acid attacks. Her documentary \"A Girl in the River: The Price of Forgiveness\" looks at so-called honor killings (the murder of a family member who is perceived to have brought shame upon the family). In this case, a girl hooked up with a man of whom her family disapproved, so they tried to kill her but she survived and filed charges against her attackers. The question then becomes whether or not she can forgive her attackers. I don't know how long honor killings have been going on. I suspect that every fundamentalist from every religion would do this sort of thing if given the chance. Whatever the case, it's an outstanding documentary drawing attention to a too often ignored problem. It deserved its Oscar win, and I hope that Obaid-Chinoy continues making these sorts of documentaries.",
         "\"A Girl In the River: The Price of Forgiveness\" (2015 release; 40 min.) is a short documentary about Saba, a 19 yr. old lady from Gujranwala, Pakistan. As the documentary opens, Saba is on an operating table and attended to by a doctor. The doctor shares some graphic/stomach-turning pictures as to Saba's original wounds to her face. It's not long before we learn that she was shot by her father and uncle, who actually tried to kill her for something Saba did that (allegedly) dishonors her family. What did Saba do? What will become of her father and uncle? To tell you more of the facts would spoil your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: this is another documentary by acclaimed director Sharmeen Obaid-Chinoy. She previously won an Oscar for Best Short Documentary for 2012's \"Saving Face\", a feat she would eventually repeat with this film. She is known for her activism to showcase the inequality of women in Pakistani society. Here she tackles a particular egregious topic: the so-called 'honor-killings' (of which more than 1,000 take place each year, we are reminded at the beginning of the movie). We get to know Saba, as well as her immediate family and the family of her husband, all of which speak on record and fully convinced that their personal opinion is the one and only correct (if not righteous) one. The suffocating \"mores\" of Pakistani society (never mind what the law actually says) is hard for anyone in the US to fully grasp and understand. But it makes for a jaw-dropping viewing experience. If I have one criticism of this documentary, it is that there is so much material to cover, that the documentary frankly feels rushed at a running time of just 40 min. I don't think it would've been all that hard to stretch this out to a feature-length documentary. I recently stumbled onto this film while browsing the documentary section of HBO on Demand. So glad I found this. No, this does not make for \"fun\" viewing but it is all the more ESSENTIAL viewing. last and certainly not least, major kudos to Saba for her bravery to speak out. \"A Girl in the River\" is HIGHLY RECOMMENDED.",
         "\"A Girl in the River: The Price of Forgiveness\" is a 39-minute documentary from last year written and directed by female Pakistani filmmaker Sharmeen Obaid-Chinoy. With this one here, she already won her second Oscar after \"Saving Face\", a documentary short film that centers around the mutilation of females in the Middle East. And in this one here, her newest project, the subject is once again the humiliation of and discrimination against females in the Middle East. This time, the subject is a young woman named Saba who almost died at the hands of her (seemingly) beloved ones. This film is about honor killings, and in particular about a woman who was really lucky to survive it and we find out why she still manages to forgive the people who want her dead. It is a touching subject for sure and an emotional movie at times, but I personally felt that it delivered nothing really new beyond the fact that everybody (with an open mind) knows about, namely how women in the Islamic world have hardly any rights, except the right to die when they don't strictly obey to what the men in their lives have in mind about them. It's a solid watch, but an Oscar may be a bit too much I guess. I still recommend checking it out. Oh yeah, and make sure you got subtitles unless you're fluent in Panjabi."
      ],
      "genres": [
         "Documentary",
         "Short"
      ],
      "productionCompanies": [
         "HBO Documentary Films",
         "SOC Films"
      ],
      "summaries": [
         "The extraordinary story of a young Pakistani woman who lived to tell of her narrow escape from an attempted \"honor\" killing by her father and uncle. Told through the lens of a true love story, the film tells the story of Saba who was shot and left for dead after marrying a man once promised to her. The result is a scathing examination of the contradictions between modernism and tradition within Pakistani society.",
         "A woman in Pakistan sentenced to death for falling in love becomes a rare survivor of the country's harsh judicial system."
      ],
      "budget": 0
   },
   "movielensId": 154278,
   "movielens": {
      "languages": [
         "English",
         "ਪੰਜਾਬੀ"
      ],
      "releaseDate": "2015-10-28",
      "dvdReleaseDate": null,
      "directors": ["Sharmeen Obaid-Chinoy"],
      "runtime": 43,
      "movieId": 154278,
      "title": "A Girl in the River: The Price of Forgiveness",
      "mpaa": "NR",
      "actors": [
         "Saba",
         "Asad Jamal"
      ],
      "imdbMovieId": "5144072",
      "originalTitle": "A Girl in the River: The Price of Forgiveness",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["Gk2OcKVu8qU"],
      "plotSummary": "A woman in Pakistan sentenced to death for falling in love becomes a rare survivor of the country's harsh judicial system.",
      "tmdbMovieId": 369364,
      "avgRating": 3.5,
      "releaseYear": "2015",
      "numRatings": 7,
      "posterPath": "/8yd3to9I7MrxeTu80U6igsOwGaZ.jpg"
   }
}