{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "judge",
            "id": 934
         },
         {
            "name": "witness",
            "id": 3581
         },
         {
            "name": "jury",
            "id": 8881
         },
         {
            "name": "judgment",
            "id": 11297
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "legal drama",
            "id": 222517
         }
      ],
      "imdb_id": "tt0188195",
      "video": false,
      "title": "The Seventh Juror",
      "recommendations": [
         60938,
         20028,
         105670,
         80555,
         79921,
         136922,
         48954,
         26762,
         247426,
         48153,
         106284,
         4746,
         86236,
         69526,
         220124,
         2647,
         208374,
         42818,
         89160,
         87417
      ],
      "backdrop_path": "/tQp4siQgBbsO6x7k2nlHH0x8nha.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55e082fbc3a36805da00002c",
         "content": "Grégoire Duval - The Pharmacist - The 7th Juror.\r\n\r\nLe septième juré (The 7th Juror) is directed by Georges Lautner and adapted to screenplay by Pierre Laroche and Jacques Robert from the Francis Didelot novel. It stars Bernard Blier, Maurice Biraud, Francis Blanche, Danièle Delorme and Jacques Riberolles. Music is by Jean Yatove and cinematography by Maurice Fellous. \r\n\r\nHorrible Crime Near Pontarlier! \r\n\r\nOvercome by the sight of a nude lady sunbather, Grégoire Duval (Blier) forces himself upon her and in a panic strangles her to death when she begins to scream. Returning back to his hum-drum existence, Duval is shocked to find the victim's boyfriend charged with her murder on circumstantial evidence. He's even more shocked when he is chosen for jury service on that very trial... \r\n\r\nCrime of a coward - or a madman? \r\n\r\nA caustic and potent piece of French cinema, Le septième juré operates on many narrative levels. In parts it's a cracker-jack legal drama, featuring a court case of dramatic verve, while the observations about the sometimes folly of the law is brutally laid bare. At other parts it's a cutting deconstruction of small town mentality, of class distinction and standings, all of which are not favourably portrayed in the slightest. \r\n\r\nFirst you must save your soul. \r\n\r\nFirmly operating in the realm of film noir, the makers produce a clinically atmospheric picture. Georges Lautner opens with an ominous shot of a lone fisherman in his boat, out on a mist covered lake, the accompanying classical music amazingly in sync with the scenes. It's evident from this point we are in for some visual and aural treats. Blier provides a classic noir narration as we move among bohemian architecture, through smoky jazz clubs and clientèle exclusive bars. At night the streets are full of shadows, in daylight there's a muted tone to Maurice Fellous' photography, this is not a happy place to live - unless you be one of the secular bourgeois of course... \r\n\r\nOthello was misunderstood too. \r\n\r\nOther imagery strikes hard. A confession box sequence is brilliantly filmed, noir nirvana, a tilted mirror used during a key exchange between husband and wife is astute, and the pièce de résistance that involves grotesque reflections on a brandy glass. Haunting scenes drop in and out, normally involving the tortured Duval staring blankly out at someone, while the court case is a hot-bed of hurt and chaos, even turning to the macabre as the crime is reenacted at the actual murder scene. Lautner also likes pull away movements as well, and so do we! \r\n\r\nSuperbly acted, directed, scored and photographed, this is yet another French film that proves that although the first wave of American film noir had faded cum the start of the 60s, the French were keeping the flame alight well into the decade. From that opening misty lake scene, to the black twist finale that is crowned by a stunning ambulance light sequence, this is black gold cinema. Merry Christmas. 9/10",
         "url": "https://www.themoviedb.org/review/55e082fbc3a36805da00002c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Grégoire Duval",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c101",
               "name": "Bernard Blier",
               "profile_path": "/xjahZAVqbJYdR9YMSsGhSWwJq7w.jpg",
               "id": 24379,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Veterinarian",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c105",
               "name": "Maurice Biraud",
               "profile_path": "/oz0OiOloXWUl7Z7G8aLhqmktQ4D.jpg",
               "id": 32100,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Attorney General",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c109",
               "name": "Francis Blanche",
               "profile_path": "/qVsqVa28aUG2zm9snBog2ZJPQTv.jpg",
               "id": 39645,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Genviève Duval",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c10d",
               "name": "Danièle Delorme",
               "profile_path": "/jIAIMS98jfVnz9ujVjjBgftri8D.jpg",
               "id": 25178,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sylvain Sautral",
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c111",
               "name": "Jacques Riberolles",
               "profile_path": "/vJns2qkq0Wp27gkC69znrDTHjpb.jpg",
               "id": 87065,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Maître Adreux",
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c115",
               "name": "Yves Barsacq",
               "profile_path": "/d0ZfIPpDL5IoEVZOwNUExuZN9ZH.jpg",
               "id": 39334,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mme. Souchon",
               "gender": 1,
               "credit_id": "57cdeae4c3a36868d9006d84",
               "name": "Catherine Le Couey",
               "profile_path": "/663zjzeWGNInCJ5GJiRxmF01XGN.jpg",
               "id": 579415,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Fisherman",
               "gender": 2,
               "credit_id": "57cdeb17925141752d00348f",
               "name": "Robert Dalban",
               "profile_path": "/n5YMsa6FoNoLVjoEXgzjSxQV1N.jpg",
               "id": 19647,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Alice Moreux",
               "gender": 1,
               "credit_id": "57cdebf1c3a368599a0073b7",
               "name": "Anne Doat",
               "profile_path": "/aFFNZ1ZbbfkKPQ6LfPfl3WYQlIN.jpg",
               "id": 272412,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Mme. Sylvestre",
               "gender": 0,
               "credit_id": "57cdec67925141794c006b25",
               "name": "Madeleine Geoffroy",
               "profile_path": null,
               "id": 590241,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Catherine",
               "gender": 0,
               "credit_id": "57cdecb49251417958006bab",
               "name": "Françoise Giret",
               "profile_path": null,
               "id": 36912,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Judge",
               "gender": 0,
               "credit_id": "57cded1a9251413d5b001ba4",
               "name": "Camille Guérini",
               "profile_path": "/caAGKX1uVEI01LIuPRB2jfFlkJz.jpg",
               "id": 579539,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Preceptor",
               "gender": 0,
               "credit_id": "57cdef54c3a36867dd0019cc",
               "name": "Charles Lavialle",
               "profile_path": null,
               "id": 932514,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 1,
               "credit_id": "57cdefa5c3a36868d9007062",
               "name": "Paloma Matta",
               "profile_path": null,
               "id": 1630041,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "M. Souchon",
               "gender": 2,
               "credit_id": "57cdefe19251417958006df5",
               "name": "Raymond Meunier",
               "profile_path": "/r2NCnSBO25LVJF7jhQgMwAdmKPb.jpg",
               "id": 103398,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Magistrate",
               "gender": 2,
               "credit_id": "57cdf057c3a36868d90070dd",
               "name": "Jacques Monod",
               "profile_path": "/nFMqgmyLtfN969gRVLcc78zU84I.jpg",
               "id": 24933,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Testut",
               "gender": 0,
               "credit_id": "57cdf090c3a3680a3f003a0b",
               "name": "Jean-Pierre Moutier",
               "profile_path": null,
               "id": 1509562,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Police Superintendent",
               "gender": 2,
               "credit_id": "57cdf0dfc3a36868d900715c",
               "name": "Albert Rémy",
               "profile_path": "/6b8eyIXAV6oA5eX6ltc3hF7ZB3d.jpg",
               "id": 1655,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Laurent Duval (as René Renal)",
               "gender": 0,
               "credit_id": "57cdf14b9251413d5b001ee9",
               "name": "René Tramoni",
               "profile_path": null,
               "id": 1675206,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Druggist",
               "gender": 0,
               "credit_id": "57cdf49ec3a36867dd001d12",
               "name": "Jean Sylvère",
               "profile_path": null,
               "id": 579419,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c0f1",
               "name": "Georges Lautner",
               "profile_path": "/6lw5jAJUchGiFUhzZw8YaSvCpSY.jpg",
               "id": 18563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c0f7",
               "name": "Francis Didelot",
               "profile_path": null,
               "id": 87063,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe440ac3a368484e00c0fd",
               "name": "Jacques Robert",
               "profile_path": null,
               "id": 19792,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440ac3a368484e00c11b",
               "name": "Pierre Laroche",
               "profile_path": null,
               "id": 1063185,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.777365,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 21070,
      "vote_count": 17,
      "budget": 0,
      "overview": "In a moment of madness a middle-aged, married and respectable pharmacist kills a young woman who is sun-bathing by a lake. Unable to take in what he has done, he flees from the scene of the crime and behaves as if nothing has happened. Eventually her boyfriend is charged with the crime and, in a strange twist of fate, the killer finds himself serving on the jury.",
      "similar": [
         996,
         182560,
         4771,
         769,
         10545,
         50348,
         75780,
         169917,
         392044,
         181283,
         452507,
         281957,
         346364,
         14638,
         910,
         11560,
         1939,
         3112,
         2048,
         562
      ],
      "original_title": "Le septième juré",
      "runtime": 90,
      "poster_path": "/94C7q1iO8DL2KOA5TwS8NZ1EaLd.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Orex Films",
         "id": 75258,
         "origin_country": ""
      }],
      "release_date": "1962-04-16",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Georges Lautner"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Francis Didelot",
         "Pierre Laroche"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0188195/",
      "coverLink": null,
      "actors": [
         "Bernard Blier",
         "Maurice Biraud",
         "Francis Blanche"
      ],
      "reviews": [
         "Grégoire Duval (Bernard Blier), one of the most upstanding citizens in his provincial French town, commits a spur-of-the-moment crime of passion and subsequently gets picked for the jury when a man with a dubious past goes on trial for the murder. Grégoire's probing questions get the man acquitted but in the eyes of the community, the defendant's still a killer and when Grégoire eventually confesses to the crime, nobody wants to hear it... Director Georges Lautner's extremely satisfying film noir also doubles as an autopsy of cold, cruel, hypocritical bourgeois values and is not unlike \"Madame Bovary\" in that respect. The philosophically resigned voice-over narration of a man tormented not only by what he's done but by the way his entire life played out has a chilling effect and it's a dark universe, indeed, right down to THE INVASION OF THE BODY SNATCHERS ending (on Christmas Eve, no less). There's bitter irony to spare with a dazed walk through nocturnal city streets present in some of the finest noir such as ELEVATOR TO THE GALLOWS and BLAST OF SILENCE and director Georges Lautner (who'd go on to make the giallo-esque ROAD TO SALINA with Rita Hayworth & Mimsy Farmer) gives the bleak proceedings a grey, misty patina that doesn't go away, even in the daytime. The Francis Didelot novel the film is based on was adapted in the U.S. a year earlier for an episode of THE ALFRED HITCHCOCK HOUR called \"The Star Juror\" and the timeless tale was also turned into a 2008 TV movie in it's native France. 10/10!",
         "I wonder why Lautner got lost in mediocrities all along his long and lucrative career.Dozens of junk movies like\"la grande sauterelle\" \"quelques messieurs trop tranquilles\" or \"flic ou voyou\"...why did he bother with such things when he had a brilliant potential that explodes here? \"Le septième juré\" is a psychological thriller of the first order,that actually belongs to the fifties,when the overrated \"new wave\" had not happened.Blending Duvivier's pessimism with Clouzot's misanthropy, and beating André Cayatte at his own game (justice and trials),it stands as Lautner's finest achievement. Bernard Blier,excellent as ever,portrays a notable who strangles a semi-whore.Probably because of a sexual frustration.His wife(an excellent Danielle Delorme) is probably a frigid bourgeois woman.The plot thickens when Blier is asked to be a juror when a wrong man is arrested and tried for HIS crime.Then begins a suspenseful and rich story,in which looks tell more than words (the juror and the accused),in which a whole town is involved with its narrow-minded petits bourgeois,its holier-than-thou spinsters,its rotten justice. And that's not all!In the very last minutes,comes a final revelation that will leave you on the edge of your seat.And logical,at that,because it thoroughly explains Blier's behavior.The black and white cinematography is stunning,and the ambulance light in the final shots mesmerizing.",
         "Le septième juré (The 7th Juror) is directed by Georges Lautner and adapted to screenplay by Pierre Laroche and Jacques Robert from the Francis Didelot novel. It stars Bernard Blier, Maurice Biraud, Francis Blanche, Danièle Delorme and Jacques Riberolles. Music is by Jean Yatove and cinematography by Maurice Fellous. Horrible Crime Near Pontarlier! Overcome by the sight of a nude lady sunbather, Grégoire Duval (Blier) forces himself upon her and in a panic strangles her to death when she begins to scream. Returning back to his hum-drum existence, Duval is shocked to find the victim's boyfriend charged with her murder on circumstantial evidence. He's even more shocked when he is chosen for jury service on that very trial... Crime of a coward - or a madman? A caustic and potent piece of French cinema, Le septième juré operates on many narrative levels. In parts it's a cracker-jack legal drama, featuring a court case of dramatic verve, while the observations about the sometimes folly of the law is brutally laid bare. At other parts it's a cutting deconstruction of small town mentality, of class distinction and standings, all of which are not favourably portrayed in the slightest. First you must save your soul. Firmly operating in the realm of film noir, the makers produce a clinically atmospheric picture. Georges Lautner opens with an ominous shot of a lone fisherman in his boat, out on a mist covered lake, the accompanying classical music amazingly in sync with the scenes. It's evident from this point we are in for some visual and aural treats. Blier provides a classic noir narration as we move among bohemian architecture, through smoky jazz clubs and clientèle exclusive bars. At night the streets are full of shadows, in daylight there's a muted tone to Maurice Fellous' photography, this is not a happy place to live - unless you be one of the secular bourgeois of course... Othello was misunderstood too. Other imagery strikes hard. A confession box sequence is brilliantly filmed, noir nirvana, a tilted mirror used during a key exchange between husband and wife is astute, and the pièce de résistance that involves grotesque reflections on a brandy glass. Haunting scenes drop in and out, normally involving the tortured Duval staring blankly out at someone, while the court case is a hot-bed of hurt and chaos, even turning to the macabre as the crime is reenacted at the actual murder scene. Lautner also likes pull away movements as well, and so do we! Superbly acted, directed, scored and photographed, this is yet another French film that proves that although the first wave of American film noir had faded cum the start of the 60s, the French were keeping the flame alight well into the decade. From that opening misty lake scene, to the black twist finale that is crowned by a stunning ambulance light sequence, this is black gold cinema. Merry Christmas. 9/10",
         "Georges Lautner is possibly best known outside France for a film he made shortly after this one, Les Tontons flingeurs, which enjoyed something of an international mild success. He compensated by making scads of multiplex fodder but with The Seventh Juror he turned in his piece de resistance. Basically it adds a new wrinkle to such entries as The Big Clock, Mr. Arkadin and Police Python 357, that wrinkle being that a murderer finds himself on the jury when the wrong man is brought to trial. Stumbling across a young woman sleeping topless in the open air the middle aged Blier succumbs to temptation and attempts to rape her. When she begins to scream for help he moves his hands to where they will do the most good and chokes her to death. Remaining undetected he stands by as an innocent (in this case) man is charged with the crime and then winds up on the jury where he does everything he can to secure a not guilty verdict. Never exactly sylph-like even in youth Blier in middle age resembles no one so much as Sydney Greenstreet and performs just as well if not better. It is, of course, really the town itself that is on trial - we are clearly in Le Corbeau and Les Inconnus de la maison country here - and there is a brilliant twist at the end. Made in 1962 it it also sticks two fingers up at the new wavelet brigade. Masterful.",
         "M.Duval (Blier), bored and out walking, comes upon Catherine, a beauty sunbathing topless. He tries to kiss her and when she resists and screams, strangles her. He feels no great remorse or pangs of conscience, but when he finds himself on the jury at the trial of her main lover (she had several) does all he can to to get the wrongly-accused man acquitted. To say more would spoil your enjoyment. suffice to say the film is thoroughly gripping, and the ending terrific. Pathe have been issuing DVDs of restored, relatively rare French films like this one. The prints are excellent and have English subtitles: I wish Gaumont would follow suit, as there are so many neglected works from the 50s and 60s by the likes of Cayatte and Hossein, brushed aside by the New Wavers like the abysmal Jean-Luc. \"Juror\" could have been made by the more prestigious Clouzot or Chabrol, as it shares their disgust at the prejudice and self- protection of the provincial petit bourgeoisie, Duval's wife being a prime example (no wonder he's so frustrated.) I've seen three Lautner films restored by Pathe, and this is easily the best (probably his masterpiece, but I haven't seen all of his work.) It's a pity he mostly made silly romps with insufferably smug stars like Belmondo and Meurisse, where nothing's at stake. All that prevents me giving this film 10 is that after Duval met the prosecuting counsel in a shop pre-trial and said he believed the accused innocent, said counsel would surely have rejected Duval as a juror: that scene was a mistake. As an outsider it was fascinating to see how the French legal system works. The juror basically conducted the defence (the defence counsel hardly said a word!) Duval constantly interrupted proceedings to ask questions. He grilled witnesses, called for one to be recalled, argued with the prosecutor and suggested a reconstruction at the crime scene. None of this would be possible in the adversarial system we have in the UK and Us: the French system, which seems focused on trying to find the truth, seems superior.",
         "Sometimes ago, I read the comments on Le 7ème Juré, which opened my interest to have a look on it. Though Bernard Blier has never been someone I liked very much, perhaps only for his cold demeanor... Possibly not explainable, or just because occasionally you like someone you don't know, and you have no apparent sympathy for another one... it just goes by feeling. I have still no \"ellective affinities\" with BB (not Brigitte Bardot, don't get me wrong! :) but his fine performance reminds me his other movies in which he plays. Amici miei (Mario Monicelli 1975) is one example that comes to my mind... (much more enjoyable, only because it's a kind of comedy) My apologizes to Blier : he's pretty good ! Once more ! They are pretty good, too, in that small town, with the conspiracy of silence, and indulgence for the good society. What can be said, what should not... an so forth! Lautner is also not known to me to make very funny nor good films, but mildly diverting ones. Sorry for his fan! Now, in that one, possibly his cinematographic achievement, he demonstrates an accurate vision of human society. And as said by another comment I wonder why he didn't use this creative force to make more ones like Le 7ème Juré. For me, it is not possible to like this movie: it is too true, to well describing how it goes and functions everywhere... But it's an excellent one! Critical, cynical, clinical and desperate : great drama/thriller One may, like me, not like it but still appreciate it, as I did : great cinema !",
         "Gathering up over 100 French films to watch over the next few months,I started to take a look at French Film Noirs that fellow IMDbers have praised.Whilst reading a review from a IMDBer,I started to wonder about why I had waited to view the title for so long!,which led to me finally going on jury duty. The plot: Less than happy with how his mistress has been treating him, (something we can all identify with!) Grégoire Duval gets into a row with mistress Catherine as she sunbathes.Heating up,Duval strangles Catherine to death.Once the red mist has faded,Duval rushes away from the murder scene,and goes back to his quiet small town. Playing a major part in the town, (which includes standing in local elections) Duval is viewed by the locals as a loyal part of the town,who would never do anything wrong.Thinking that it will be left unsolved,Duval discovers that one of Catherine's other lovers has been arrested for the killing.Caught off guard,Duval is told that he must serve jury duty on the case,which leads to Duval deciding to prove the accused innocent,whilst proving his own guilty verdict. View on the film: Sitting down in court for their adaptation of Francis Didelot's novel,the screenplay by Pierre Laroche & Jacques Robert brilliantly turn the heated courtroom Drama into Film Noir shapes,via layering Duval's brittle narration over proceedings,which allows the writers to deconstruct the courtroom Drama \"traditions\" and to shoulder Duval with unrelenting Film Noir guilt.Spending time with all of the locals who look up to Duval,the writers strangle Duval with a deliciously dark sense of humour which sinks Duval deep into the Film Noir mist,as Duval finds it impossible to crush anyone's belief that it is impossible for him to commit a crime. Sending ripples across the screen over the gentle credits,director Georges Lautner and cinematographer Maurice Fellous grab Jean Yatove's great jagged score,and smash the peace into Film Noir doom. Stylishly revealing the murderous passion Duval has for Catherine, (played by an alluring Françoise Giret-who appears topless)Lautner buries Duval into Film Noir misery,where a gaze into a glass allows Duval to reflect,whilst the town build a decaying \"good\" wall of madness around him.Carrying the guilt and closed-minded beliefs of the town like the member of a chain gang, Bernard Blier gives an incredible performance as Duval,thanks to Blier exposing Duval's humble roots in order to drag them into a Film Noir sandpit,where a confession and a final verdict are not able to stop Duval becoming a judge,jury and executioner for his own crimes.",
         "I was curious to track down this movie for all the praise it got by IMDb reviewers. Some were so ecstatic as to rank it as a major directorial effort from journeyman Lautner. They were openly lamenting 'too bad he did not keep up with this kind of bravado'. In the land of the blind, the one-eyed man is King I guess these movie buffs must be watching too many bad movies as they compete to review the long tail of IMDb's inventory. This sets their expectations pretty low. Sure 'Le septième juré' has a great cast lead by the magnificent Bernard Blier, although characters are more picturesque than deeply engaging, and its story-line is compelling. The social commentary does hold it together, but honestly this is really not done masterfully here. Voice-over narration fast turns a nice movie into a verbose hack. All the more so when the voice-over delivers a bitter ironic social commentary. Actually this is very much a literary device: that is why I won't mistake Bernard Blier forceful performance with a directorial tour de force. I may be forgetting a couple of details but frankly I cannot see where the direction lifts the script and the cast well above their raw potential. Rhythm, suspense, cast interaction (let alone real chemistry): all these rank pretty low here in my scale of expectations. All in all this is an OK movie, worth watching if you're a fan of Blier (and of Maurice Biraud or Francis Blanche). Don't expect to much and you will be rewarded by the fine performances. Now personally I was much less impressed by Blier here than in Quai des Orfèvres (whose director's ability doesn't call for a lengthy debate) where he has less screen time. I would rather recommend tracking down Non-coupable (1947) on a similar premise. In this one the work by director Henri Decoin is unmistakably excellent (rather than adequate, at best, in the Le septième juré). There the social commentary is actually blended in the story, not painted over it. And of course on the topic of a juror stepping in for a weak defence you always have the excellent Twelve Angry Men. Le septième juré is nowhere near half as good as any of those 3 movies by Clouzot, Decoin and Lumet, so if this is really the best Lautner could do, no wonder he never came close to acclaimed directors."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Orex Films"],
      "summaries": ["In a moment of madness a respectable pharmacist kills a young woman who is sun-bathing by a lake. Unable to take in what he has done, he flees from the scene of the crime and behaves as if nothing has happened."],
      "budget": 0
   },
   "movielensId": 154414,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1962-04-16",
      "dvdReleaseDate": null,
      "directors": ["Georges Lautner"],
      "runtime": 90,
      "movieId": 154414,
      "title": "The Seventh Juror",
      "mpaa": "",
      "actors": [
         "Bernard Blier",
         "Maurice Biraud",
         "Francis Blanche",
         "Danièle Delorme",
         "Jacques Riberolles",
         "Yves Barsacq",
         "Catherine Le Couey",
         "Robert Dalban",
         "Anne Doat",
         "Madeleine Geoffroy",
         "Françoise Giret",
         "Camille Guérini",
         "Charles Lavialle",
         "Paloma Matta",
         "Raymond Meunier",
         "Jacques Monod",
         "Jean-Pierre Moutier",
         "Albert Rémy",
         "René Tramoni",
         "Jean Sylvère"
      ],
      "imdbMovieId": "0188195",
      "originalTitle": "Le septième juré",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a moment of madness a middle-aged, married and respectable pharmacist kills a young woman who is sun-bathing by a lake. Unable to take in what he has done, he flees from the scene of the crime and behaves as if nothing has happened. Eventually her boyfriend is charged with the crime and, in a strange twist of fate, the killer finds himself serving on the jury.",
      "tmdbMovieId": 21070,
      "avgRating": 2.16667,
      "releaseYear": "1962",
      "numRatings": 3,
      "posterPath": "/94C7q1iO8DL2KOA5TwS8NZ1EaLd.jpg"
   }
}