{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "the bowery",
            "id": 204981
         }
      ],
      "imdb_id": "tt0050800",
      "video": false,
      "title": "On the Bowery",
      "recommendations": [
         67535,
         54001,
         4443,
         70090,
         99686,
         47430,
         24588,
         46210,
         101382,
         104153,
         228187,
         8749,
         101279
      ],
      "backdrop_path": "/fIYQzYYp2QzdRz33ay3LaTV1t8Y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe49e79251416c910bca43",
               "name": "Gorman Hendricks",
               "profile_path": null,
               "id": 1049446,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe49e79251416c910bca47",
               "name": "Frank Matthews",
               "profile_path": null,
               "id": 1049447,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe49e79251416c910bca4b",
               "name": "Ray Salyer",
               "profile_path": null,
               "id": 1049449,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49e79251416c910bca3f",
            "name": "Lionel Rogosin",
            "profile_path": null,
            "id": 933247,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.007871,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 88051,
      "vote_count": 9,
      "budget": 0,
      "overview": "A mix of documentary and scripted footage on the Bowery, New York City's skid row. Against a backdrop of men (and a few women) drinking in bars, talking and arguing, and sleeping on sidewalks, we have the story of Ray.",
      "similar": [
         1771,
         772,
         769,
         1572,
         594,
         51876,
         59108,
         57431,
         40807,
         9029,
         1813,
         1374,
         8835,
         8065,
         9654,
         453,
         605,
         639,
         928,
         1724
      ],
      "original_title": "On the Bowery",
      "runtime": 65,
      "poster_path": "/Au3bvrQlxcrJDlWMBlgRsf4IyXY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1957-03-18",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.ontheboweryfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lionel Rogosin"],
      "runtime": 65,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050800/",
      "coverLink": null,
      "actors": [
         "Ray Salyer",
         "Gorman Hendricks",
         "Frank Matthews"
      ],
      "reviews": [
         "This film had tremendous influence on documentary film making and in many ways is still ahead of its time. John Cassavetes, the great American independent director, once said that Rogosin is \"probably the greatest documentary filmmaker of all time.\" \"Wait a minute,\" you might say, \"that isn't what I was taught in film school!\" To understand that quote, and the impact of \"On the Bowery,\" you would have to understand the world of documentary film making in the 1950's. Robert Flaherty, and Walter Ruttmann were the people who had largely shaped what documentary film making had become in the 50's. Flaherty had shown us natural people in natural settings. This in itself was not new, but his mastery of film skills raised the documentary to an art form. His images were beautiful and haunting, and that eventually became the norm for good documentaries. Ruttmann, in his film \"Berlin; Symphony of a Great City,\" photographed a day in the life of Berlin, and edited it to match the structure of a symphony. Once again we saw the marriage of documentary and high art. This was copied by Dziga-Vertov (who is often given credit for Ruttmann's innovations) in his \"Man with a Movie Camera\" and by others. There were, of course, other influential film makers. There is, for example, a tradition of political films and propaganda pieces that are often thought of as documentaries. But in discussing non-political, documentaries in the world of 1957, they were generally highly aesthetic, and usually about fairly safe subjects such as native people, famous scientists, animals etc. The films were sometimes scripted, and a representative story (not a real story) of the lives of the people was done using native non-professional actors. \"On the Bowery\" can be seen as a transitional piece between the Flaherty school and modern documentaries, On one hand it is aesthetic, and contains some script, but on the other, it is mostly unscripted. The film also has a strong feel of reality. This is because the people in the film were going through their daily routine rather than acting. Instead of coming up with a representative story, the scripted parts of the film are recreations of a specific, real story, played by the person who lived it. It is interesting to note that after the film was shown the main character was offered $40,000 and a Hollywood film contract. He refused it and went back to the Bowery. I do not know what became of him. Doc, (who had been a real doctor at one time) stayed on the Bowery and died of a heart attack shortly after the film. Because it is partly scripted, it is often misunderstood as being fictional, but Rogosin methods reflect this connection with reality. He spent 6 months studying and observing, then a year and a half filming. You don't need to spend a year and a half to film a fictional script. I attended a screening of the film in the 60's put on by Rogosin and was able to ask him some questions. The scripted scenes came out of the the real life events that occurred during the filming, not the other way around. \"On the Bowery\" is clearly the breakthrough film that that paved the way for today's documentary style. Another breakthrough occurred with the subject of the film and the way it was treated. Instead of animal life, native people, or a famous person, the subject was alcoholics on New York's skid-row. This was pretty much unheard of at the time except in the political/propaganda type of documentary. But unlike the political documentary, there was no comment or judgment or manipulation of the footage to lead you to a conclusion that the film maker wanted you to have. As an audience member you feel free to interpret it as you like, and many people had different ideas of what it meant. In doing this Rogosin is ahead of his time even today. In an article in \"Film Culture\" 1960, \"Interpreting Reality (Notes on the Esthetics and Practices of Improvisational Acting)\", Rogosin gives his \"Manifesto\" for documentary film making. Although he respects Flaherty and his school he feels that they are not actually making documentaries. Also he rejects true documentaries as being a, \"meaningless catalog of stale, factual representation,\" and even says that he does not make documentaries. Instead he wanted to spontaneously film elements of reality and \"put it in a form that would capture the imaginations of others.\" This is not the same as making a representative story. The scripted scenes in \"On the Bowery\" are made from the actual experiences of the people in the film. They are being recreated by the people who lived them. This clearly sets him apart from even modern documentary film makers. Another thing that still sets Rogosin apart is that he gives his characters dignity. It is very easy for a documentary film maker to ridicule people, or show them in a bad light, especially because they no way to make a rebuttal to the audience viewing the film. Modern documentary film makers too often fall into this trap. Rogosin's effort was just the opposite. \"I want to give man a new dignity, to make a true national hero of a Nebraska farmer, a Pennsylvania coal miner, a Harlem taxi driver,\" Rogosin says in his 1960 article. He certainly succeeds in doing this in \"On the Bowery.\" You walk out of the theater with a sense that these people have a certain nobility in their lives; that they are not caricatures but distinct individuals. Not an easy job, considering the subject matter. \"On the Bowery\" was a groundbreaking film, but it is also a film that is still unique in its vision of what a documentary film should be. Even today it is ahead of its time.",
         "This movie must have seemed very startling to audiences at the time, when \"homelessness\" wasn't yet a concept (only the somewhat more abstract, accusatory \"bums\" or \"winos\"). Like many \"documentaries\" made before the 1960s, when a more purist approach was introduced, it is partly staged and acted, albeit by nonprofessional principals who were purportedly playing themselves, surrounded on real locations by real people who clearly aren't following any script. Thus the line between staged drama, improv and documentary is thoroughly blurred. You could call this falsification by strict verite standards, but that would deny \"In the Bowery's\" extraordinary capture of a particular underside that mainstream society (let alone movies) preferred to ignore until the 60s myriad social-change movements focused more attention on the urban poor and disenfranchised. The loose \"story\" focuses on ruggedly handsome thirtysomething ex-railroad worker Ray. He lands in NYC, buys drinks for some Bowery drunks, passes out on the street and has his threadbare suitcase of possessions stolen by Gorman, the one who'd befriended him. Ray does day-laboring gigs, attends a rescue mission sermon, sleeps at a charity flophouse (where most sleep on newspapers on the floor) and tries to avoid the demon alcohol--but he free-falls nonetheless. It's worth reading the Wikipedia article about the movie, which offers a number of interesting facts about its creation and reception. (It won a Venice Fest award and an Oscar nomination, though the unflattering if poignant expose of Skid Row also got it attacked by the New York Times and other significant voices.) Supposedly Ray Salyer was \"offered a Hollywood contract but chose to remain on the Bowery\"--which sounds just-possible, but also unlikely enough to require further proof. This is a unique and striking memento of a disappeared world (though the issues remain very relevant--only the neighborhoods and racial mix have changed).",
         "On the Bowery (1956) *** (out of 4) Lionel Rogosin's first film is part documentary and part scripted story as we visit the Bowery, which at the time was one of the worst sections of New York. The film centers on a man who enters a bar and becomes mixed up with various drunks. The \"documentary' aspect of the film gives us a little trip around the Bowery where we get to see various portions of the people who live there. ON THE BOWERY was nominated for an Academy Award and even over fifty-years later you can't help but be blown away by some of the images. I must admit that the scripted stuff was probably my least favorite but at the same time it was fascinating seeing these men in their daily lives. If you caught this movie on Turner Classic Movies there was some interesting details told by the host about the fate of some of the men involved. It's clear that none of them wanted help or an acting career so what we get here really does seem real and authentic. The shots of the Bowery were certainly very interesting to see today simply because you get to see what the place used to look like. There were some shorts made about the Bowery and of course everyone knows The Bowery Boys but this here is just so much more. The best stuff is actually the editing of the picture, which is quite remarkable and among the best I've ever seen. The flawless way the film and characters just flow from one scene to the next is pretty amazing to watch. It certainly doesn't hurt that the cinematography is top-notch from start to finish and it really captures the mood of these men and the Bowery.",
         "A 60-minute semi-documentary (some scripting) of life on New York's notorious Bowery. Thanks TCM for reviving this slice of exotica for a general audience, and thanks fred3f for the edifying comments. Even now, so many years later, the film is still compelling. The faces, oh my, the faces! They're a road map of life in the raw, so unlike the cosmetics of Hollywood and Vine. So just grab a slab of sidewalk and sleep it off. Or spend the night blustering across a table with other drunks. But whatever you do, always guard your back. For a Midwestern geezer like me used to the Hollywood product of the 50's, a film like this comes from another planet. To think there was a guy (Rogosin) working hard in the upscale 50's on a look at the subterranean America everyone else ignored is astonishing. What he's left us with is a record of permanent insight. Nevertheless, I'm skipping that next glass of wine, and from now on, I'll be making my bed with loving care.",
         "As I read the admiring comments about this movie, I find myself confused. Yes, this is an excellent documentary -- and the question of whether some scenes may have been staged bothers me less than it does another commenter. Yet, good as it is, this sort of documentary did not spring newborn from the mind of Lionel Rogosian, like Athena from Zeus' brow. There are clear antecedents, like the photography of Walker Evans and even movies like Boris Kaufman's LES HALLES CENTRALES (1927). In many ways it is a remake of the 1941 Passing Parade short THIS IS THE BOWERY, without the voice over commentary. Instead, it reserves its commentary to its cinematic choices: the editing that cuts faster and faster as arguments rage and the uncredited photographer, who carefully composed and key lit portrait shots that scream \"This is a human being\", Film is a medium that can lie or tell the truth twenty-four times a second, but which lies or truths the film maker chooses to tell.... that's the real point. Having thus demonstrated my learnedness and balance as a film critic, let me turn again and note that such issues are irrelevant. A movie is made for an audience, and how would this movie strike its audience, who probably could not recall having ever seen anything like it before? Like a thunderbolt. This sort of cinema vérité film making was something usually seen in post-war Italian movies where the producer couldn't afford a studio. To see it applied to reality in the United States was devastating and changed documentary film-making permanently. At least, until the next new and greatest thing came along.",
         "On The Bowery is quite strange to watch, considering the odd feeling one gets when watching this film. Is it unscripted? Is this really what happens? In the end, the film feels like a confabulated lie, one that shouldn't have been identified as a certain extreme. As a piece of fictionalized reality, this film does feel rather decent in its context. Sadly, only history will dictate how this movie is percieved, and even then, it will still be a perception that is not quite correct.",
         "The film sells itself as a documentary. It is really a film of re-enactments and scripted moments. I do not deny that they used real \"bums\" in this film, but they are conscious of the camera and the words that they say seem to follow a specific storyline. The big giveaway that this is not a natural documentary are all the camera angles used...there are several different ways single scenes were shot that signifies a camera setup had to be changed during the filming of the scene. Of course, the biggest distraction were the inserted close-ups of the men...it meant that a camera was shoved right in front of their faces...they had to be quite aware that they were being filmed...and thus, a documentary filmaker would no longer get reality."
      ],
      "genres": [
         "Documentary",
         "Drama"
      ],
      "productionCompanies": ["Rogosin Films"],
      "summaries": [
         "At the time of this film, the Bowery was a neighborhood in New York City populated largely by the down and out, and largely by transients. Those that can work generally can only find short term employment on a day to day basis, their daily earnings which primarily go into booze. Those that can't or won't work generally sponge off whoever they can, especially for that next drink. New to the neighborhood is Ray, who most recently had been working the rails in New Jersey. He is one of those who can and still does work, but like the others spends what little money he has on booze, which means he usually sleeps on the streets in a drunken stupor. The only person he would probably consider a friend in the neighborhood is the elderly Gorman, who in turn takes advantage of his new friend at whatever opportunity. When he's sober, Ray understands that alcohol is ruining his life, and as such states that he will try to stop drinking. The questions become whether Ray has either the will or the support necessary to fulfill this goal, or whether he is destined to become another Gorman and the legions like Gorman in the Bowery.",
         "A mix of documentary and scripted footage on the Bowery, New York City's skid row. Against a backdrop of men (and a few women) drinking in bars, talking and arguing, and sleeping on sidewalks, we have the story of Ray. He is younger and more vigorous than most on the Bowery. He arrives in Manhattan with a suitcase and a little money in his pocket. On his first night, he drinks himself into a stupor, falls asleep on the sidewalk, and is robbed of his suitcase. Over the next two days, we follow both Ray and the thief, who befriends him. Is there any hope Ray can get out of town and restart a life of work and sobriety, or is he stuck on the Bowery? Can the good thief help?"
      ],
      "budget": 0
   },
   "movielensId": 154628,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-03-18",
      "dvdReleaseDate": null,
      "directors": ["Lionel Rogosin"],
      "runtime": 65,
      "movieId": 154628,
      "title": "On the Bowery",
      "mpaa": "",
      "actors": [
         "Gorman Hendricks",
         "Frank Matthews",
         "Ray Salyer"
      ],
      "imdbMovieId": "0050800",
      "originalTitle": "On the Bowery",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A mix of documentary and scripted footage on the Bowery, New York City's skid row. Against a backdrop of men (and a few women) drinking in bars, talking and arguing, and sleeping on sidewalks, we have the story of Ray.",
      "tmdbMovieId": 88051,
      "avgRating": 4.25,
      "releaseYear": "1957",
      "numRatings": 4,
      "posterPath": "/Au3bvrQlxcrJDlWMBlgRsf4IyXY.jpg"
   }
}