{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0000399",
      "video": false,
      "title": "Jack and the Beanstalk",
      "recommendations": [
         196293,
         190683,
         107261,
         106805,
         96186,
         107273,
         107272,
         189595,
         233913,
         106804,
         196628,
         190668,
         195954,
         196605,
         172121,
         190609,
         196286,
         168407,
         106038,
         172115
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Jack",
            "gender": 0,
            "credit_id": "52fe4b349251416c750fba4b",
            "name": "Thomas White",
            "profile_path": null,
            "id": 1120783,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54d28b7fc3a3686ac4000300",
               "name": "George S. Fleming",
               "profile_path": null,
               "id": 1074091,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b349251416c750fba47",
               "name": "Edwin S. Porter",
               "profile_path": "/a4SNGzbD9Fb8U82vJnSpFRGebbl.jpg",
               "id": 44866,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.310701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 144436,
      "vote_count": 5,
      "budget": 0,
      "overview": "Porter's sequential continuity editing links several shots to form a narrative of the famous fairy tale story of Jack and his magic beanstalk. Borrowing on cinematographic methods reminiscent of 'Georges Melies' , Porter uses animation, double exposure, and trick photography to illustrate the fairy's apparitions, Jack's dream, and the fast growing beanstalk.",
      "similar": [],
      "original_title": "Jack and the Beanstalk",
      "runtime": 10,
      "poster_path": "/iu8S71AJ385h0q9HgOEypZ2Sywl.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Edison Manufacturing Company",
         "id": 18758,
         "origin_country": ""
      }],
      "release_date": "1902-06-20",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "George S. Fleming",
         "Edwin S. Porter"
      ],
      "runtime": 10,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0000399/",
      "coverLink": null,
      "actors": ["Thomas White"],
      "reviews": [
         "I'd like to take this opportunity to salute Edwin S. Porter's Jack and the Beanstalk on its 100th birthday. This short film is one of America's earliest surviving narrative motion pictures. Perhaps it goes without saying that we're lucky this film can be viewed in the 21st century, seeing as how so many of its neglected contemporaries are gone forever. In watching this film today we have not only a rare opportunity to witness a great advance in cinematic storytelling, but also to peer into a lost world of Victorian theater, specifically children's theater. Where filmmaking is concerned, Jack and the Beanstalk does not represent the thrilling quantum leap forward that Porter's Great Train Robbery (made the following year) most certainly would, but it's a charming work in its own right, and can be viewed as a necessary step in the director's development towards his famous achievement. Strictly speaking, this film is a photographed stage play in which the special effects are stage effects, but that in itself was something of a novelty in 1902. Many of the earliest films of the 1890s and early 1900s consisted of only a single shot, representing what we would call 'actualities' filmed in natural locations: trains rolling past, ocean waves, street scenes, etc. The actors of Jack and the Beanstalk perform in full costume, and emote before painted backdrops as the familiar story is related in several lengthy shots presented in a methodical fashion. Although Porter's production lacks the verve that France's Georges Méliès was bringing to similar material around this same time, it does boast a moment or two of cinematic (as opposed to theatrical) wit. I like the early scene where Jack falls asleep and the Good Fairy 'directs' his dream, which is enacted for us, and includes such details as dancing bags of money and a woman hatching out of an egg. There's also a nice moment later when, after climbing the beanstalk, Jack takes another nap and the Good Fairy once more appears to him in a dream, this time treating him to a magic lantern show concerning the giant he's about to face. Someone who posted about this film previously called it \"pathetic,\" and asserted that the filmmakers lacked imagination. I suggest in return that a certain amount of imagination is required to appreciate exactly what filmmakers were dealing with in 1902 when this medium was brand new. We're all so accustomed to going to the movies and having TVs in our homes, popping in videos & DVDs whenever we like, but what about the people who made these first films? In 1902 most people had never seen a movie or a movie camera. This was an entirely new technology, and there must have been numerous problems for the filmmakers, e.g., simply moving those bulky cameras, loading the (incredibly flammable) film itself, technical difficulties with lab work, etc. Making motion pictures was still a brand new, experimental process. Mechanical breakdowns and disappointments must have been a common occurrence for the pioneer producers. But we should also consider how much fun it must have been to be present at the birth of a new art form, the thrill of making discoveries that advance that art form, and the great excitement experienced by the original audiences who saw these films when they were new. In short, it takes imagination simply to view and appreciate a film like Edwin S. Porter's Jack and the Beanstalk, and we should count ourselves as fortunate that we can still do that.",
         "One reviewer referred to this film as \"pathetic\" but I am not sure that this is really fair. Sure, by the standards of 2006, this is a pretty bad film. However, given when it was made, it's a truly exceptional film and should be compared to its contemporaries--not today's films with our great special effects and film techniques. In 1902, almost every film was less than five minutes long. Plus, sets were often pretty non-existent and the same could be said about writing. Often, actors just got up and gesticulated madly or seemed to have no idea what to do until the director yelled out instructions--and it was pretty obvious at times. Films where everything was planned and scripted and told a good complex story were a real rarity. Because of all this, I am very charitable towards JACK AND THE BEANSTALK. Sure, the backgrounds look like painted backdrops (which they were) and some of the props were less than stellar, but for 1902 it was a real marvel! The film told the story very well and was even better than such films as THE WONDERFUL WIZARD OF OZ or FRANKENSTEIN (both from 1910)--films which also had props, sets and were well-planned but were also made almost a decade later! So, this wonderful curio is a great piece of history that might just make many of you laugh at its production values, but I still thought the film was quite charming and we owe a lot to such monumental films--after all, the care and quality that went in to this film really encouraged other film makers to try harder.",
         "For its era, this was rather an ambitious and creative attempt to film the story of \"Jack and the Beanstalk\" with as much visual detail as possible. Certainly, few of the camera effects are going to impress anyone now, but they are not at all bad given the limitations. It's really a children's story, and any children who saw this in 1902 would probably have enjoyed it more than enough to justify the effort of making it. For all that the technical limitations are obvious, and the visual effects in the rudimentary stage, this version does clearly communicate the basic story in a generally entertaining fashion. To be sure, even in 1902 there were pioneers such as Méliès who were already doing more impressive things. But this one is by no means bad, and features like this, while their defects are obvious, still hold their appeal for those of us who enjoy seeing what the earliest movies were like.",
         "I'm writing a book about \"folding\" in film, a situation which in its simplest form is seen as a movie within a movie. This is the earliest example I know. The movie itself is about 12 minutes long. There are no dialog cards because presumably all viewers would know the story in detail already. Modern audiences will find the presentation pretty hokey. But there are two episodes within this that have an interesting effect. There is a fairy godmother which to my knowledge is not in the original story. She is invented just for the movie. She manipulates events somewhat. Among her interventions are the creation of visions for our hero. The first time is in a dream, and the second in \"real life\" (or perhaps a dream). Both illustrate what is to come. These are presented in the movie as a movie that the fairy \"projects\" onto the background. At the end she appears again to merge the two worlds. Ted's law of abstraction holds even in this early example: the distance between our world and the world of the movie is the same as that between the movie and the world of the movie within. Ted's Evaluation -- 4 of 3: Every cineliterate person should experience this.",
         "The Edison Company's \"Jack and the Beanstalk\" is another example of Georges Méliès's deep and widespread influence throughout the world of early cinema, but it's also remarkably innovative in itself for its time. Méliès largely introduced the story film to cinema with his adaptations of fairy tales, including \"Cinderella\" (1899), \"Bluebeard\" (1901), \"Little Red Riding Hood\" (1901) and other Féeries (fairy films). These films added narrative and new filmic storytelling devices to the editing and camera effects he had founded in his trick film attractions. For \"Jack and the Beanstalk\", Edwin S. Porter with George S. Fleming inserted an Anglo fairytale instead of the Charles Perrault stories used by Méliès, but otherwise almost exclusively imitate the style and techniques found in Méliès's Féeries. In England, Robert W. Paul and Walter R. Booth had already done essentially the same sort of Anglicization of Méliès with their film \"The Magic Sword\" (1901). One of the outcomes of this imitation is that the Edison Company produced what was probably the most advanced narrative film made in America as of then; certainly no other US film from before it that I've seen or heard of quite compares. Albeit, America at this time was lagging behind France and Britain in the development of the story film; and, as historian Charles Musser has pointed out (\"Before the Nickelodeon\"), for a few months between 1901 and 1902, Edison legally monopolized the production of motion pictures in the states. With 10 scenes (or tableaux) and 625 feet of film, running over 10 minutes, \"Jack and the Beanstalk\" is comparable in length to Méliès's early Féeries while being far ahead of any motion picture previously produced in the US. Technically, the use of dissolves as a transition between scenes and the substitution splices (stop-substitutions) and superimposition trick effects are all borrowed from Méliès. The superimposed vision/dream scene-within-a-scene conjured by the fairy in the fourth and seventh tableaux were based on similar scenes in Méliès's \"Cinderella\", \"Bluebeard\" and other films; notably, George Albert Smith, in England, was also an early pioneer of multiple-exposure photography and created scenes-within-scenes in his films as early as 1898, such as in \"Santa Claus\". Moreover, the interpolation of a fairy into the \"Jack and Beanstalk\" tale is straight from Méliès's Féeries, which generally feature a fairy godmother who manipulates the narrative and guides the hero—sometimes by projecting visions, serving as the filmmaker's on-screen surrogate by directing such films-within-the-film. The stagy, painted decors; the sudden, irrelevant appearance of dancing girls; and the theatrical final tableau pose were all classic Méliès trademarks, too. Additionally, the story seems to use Joseph Jacobs's non-moralizing version of the fairytale, so Jack simply intrudes on the giant's home, engages his wife against him, steals his wealth and kills him out of greed. Looking back at such an amoral narrative is rather refreshing, at least nowadays, when a moral seems to be incumbent upon most stories. The Edison Company catalogue, however—which may have served as a guide to live lecturers who would add further description for audiences back then, as was common practice—gives the Benjamin Tabart moral treatment by making the Giant the villain. Regardless of the demonstrative overriding influence of Méliès on \"Jack and the Beanstalk\", it remains a significant production for the time and place it was made. It's a mostly self-contained narrative and is more complex than were most films before it: linking scenes and achieving continuity of action across shots and between exteriors and interiors and, at least, having some production values. These early story films were an important advance; they claimed editorial control for producers and away from exhibitors, who had afore arranged the single shot-scene films into programs. From here, Porter made such other early story films as \"Life of an American Fireman\" and \"The Great Train Robbery\" (both 1903).",
         "This movie is great. Not only does it show the lengths to which narrative had increased at the time (and Edwin S. Porter's developing skill in creating such narratives), but it's actually a pretty good adaptation of a well known tale if I may say so myself. Early films often used adaptation as a way of telling a familiar story so that people would understand what's going on with aid of memory along with the general narrative structure. Since I have no idea how this film was regarded back then, I can't really say whether it was effective to that audience or not, but I think today, with our familiarity with cinematic devices, we don't need the help. This movie stands alone pretty well on its own. It's also very magical, which I enjoy. I love these early fantasy films like La Voyage dans la Lune and Jack and the Beanstalk. It seems fantasy film-making slowed down as film developed, mostly kept to science fiction, and only recently with CGI has been growing again. --PolarisDiB",
         "This early version of Jack and the Beanstalk may look, to the modern eye, as if it is a simple stage play, but it is hardly that. In reality it mixes grammars from three different forms of entertainment: the stage, Georges Melies' film grammar (which at this stage used a good deal of stage techniques, but also included stopping the camera to allow things to appear and disappear) and magic lantern grammar. Notice how the story is structured so that some of the visions appear as a circle in the center of the screen. That is straight out of standard magic lantern productions, which were still enormously popular in this period. Indeed, this particular bit of magic lantern grammar survives in occasional use today. I have noticed it most recently in Jeunet's A VERY LONG ENGAGEMENT, in which the main action appear over most of the screen, but thoughts of the lost love appear in the upper righthand corner. Films were just starting to find their way at this point. It was an enormously exciting period in the movies as many techniques were tried out.",
         "Jack and the Beanstalk (1902) *** (out of 4) Nice version of the famous story from Edison with direction by Edwin S. Porter who was close to making his landmark film THE GREAT TRAIN ROBBERY. The story is about as well-known as you can get but young Jack (Thomas White) trades his cow for some magic beans, which end up growing high into the sky. He ends up climbing up where he encounters the bad guy who he must destroy. If you're looking for anything ground-breaking then you're not going to find it here. I'm sure many people will look at this 1902 film and see it as hokey but it's doubtful these people would be overly interested in the history of film. Those who are interested will find this to be a pretty interesting version of the classic story. Porter does a very good job at telling the story, although without any title cards they're certainly expecting you to already know the story. I really loved the visual look of the film including the special effects of the beanstalk growing. The \"vine\" used for the stalk was even attempted to look realistic, which wasn't always the case in this early films. The cow in the story is a man in the outfit, a common practice for the day and I can't help but feel this adds a bit of surrealism today.",
         ". . . which I saw in a double feature today after seeing this original version--which is perhaps a technological advance for its time, but totally unacceptable from a moral standpoint. In this 1902 version of Jack's story, produced by the infamous robber baron Thomas Edison, Jack dresses like a girl, disobeys his mom to climb the beanstalk, spies on the Abraham Lincoln-sized \"giant,\" steals his valuables, and finally kills the taller than average crime victim as he's descending the beanstalk to recover his valuables. Jack is egged-on, aided & abetted at every turn by a magic wand-waving fairy godmother, who turns Jack & his mom into royalty at the close, heaping further riches upon this thief (not all that different from how Rockefeller, Carnegie, Ford, & Edison himself were able to loot America and lord it over everyone else at the turn of the 20th Century, before the U.S. enjoyed modern business regulations). JACK THE GIANT SLAYER, on the other hand, is about a nice boy who knows his place, only kills giants (actual ones, not a 6' 4\" guy!) to save humanity, and does not have a larcenous bone in his body. With no nudity, little swearing, & few scenes of graphic violence, the latest remake is perfect for the 8 to 80 demographic. Though JACK THE GIANT SLAYER runs 104 minutes longer than this cluttered original, it is much easier to sit through, and is NOT the hard-core homage to criminality that is the elephant-electrocuter's morally reprehensible 1902 mash-up.",
         "This representation of the popular children's story on film is pretty pathetic to watch. I know it is one of the earliest efforts at moviemaking, but this 15-minute picture is unimaginative and poorly shot. \"The Great Train Robbery\" (1903), which I also commented on, is much more creative and exciting to watch. We see little long-haired Jack trade a cow (2 men in a cow-suit) for a hatful of beans from a merchant and later a beanstalk grows from where his mom throws them in the yard (I guess poor Jack attained the wrong kind). Jack dreams of a goose (actually it seems to be a chicken) and golden egg and the next day climbs the stalk into heaven. There is no effort made to be creative in this film. The stalk looks like a rope with leaves on it, the giant is just a tall bearded guy in a home with nothing abnormally large in comparison to Jack and the climax to the film where Jack makes his escape with the goose-chicken and its golden egg is miserable as a stuffed dummy falls from out of screenshot in place of the giant and then the actor takes its place - rising up on his feet in a exaggerated death dance like in most early films. The beanstalk (leaf-covered rope) comes trailing down from above and coils neatly on the giants forehead. Watch something else."
      ],
      "genres": [
         "Short",
         "Fantasy"
      ],
      "productionCompanies": ["Edison Manufacturing Company"],
      "summaries": [
         "Porter's sequential continuity editing links several shots to form a narrative of the famous fairy tale story of Jack and his magic beanstalk. Borrowing on cinematographic methods reminiscent of 'Georges Melies', Porter uses animation, double exposure, and trick photography to illustrate the fairy's apparitions, Jack's dream, and the fast growing beanstalk.",
         "A fairy gives a penitent a hatful of magic beans. Jack soon passes by with the family's bouncy bovine, which he trades for the beans. Back home, Jack's mother throws the beans into the middle of the garden in disgust. That night, as Jack sleeps, the fairy causes the beanstalk to grow, visits Jack's room, and sends him sweet dreams. When he awakens, he sees the beanstalk and climbs toward -the sky as his mother, friends, and villagers cheer him on. At the top of the beanstalk, the fairy again guides him to the home of a wealthy giant, whose maid hides Jack. As the giant sleeps, Jack steals gold and a magic fowl; the giant wakes, grabs his cudgel, and gives chase. Chop chop, Jack.",
         "Scene 1. Trading the Cow. Scene 2. Jack returns with the beans. Scene 3. Growing of the Beanstalk. Scene 4. Jack's dream. Scene 5. Climbing the beanstalk. Scene 6. Jack above the clouds. Scene 7. Arrival at the top of the beanstalk. Scene 8. The giant's kitchen. Scene 9. Jack descending the beanstalk and death of the giant. Closing tableau."
      ],
      "budget": 0
   },
   "movielensId": 155162,
   "movielens": {
      "languages": [""],
      "releaseDate": "1902-06-20",
      "dvdReleaseDate": null,
      "directors": [
         "George S. Fleming",
         "Edwin S. Porter"
      ],
      "runtime": 10,
      "movieId": 155162,
      "title": "Jack and the Beanstalk",
      "mpaa": "",
      "actors": ["Thomas White"],
      "imdbMovieId": "0000399",
      "originalTitle": "Jack and the Beanstalk",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["Dggyir8Glno"],
      "plotSummary": "Porter's sequential continuity editing links several shots to form a narrative of the famous fairy tale story of Jack and his magic beanstalk. Borrowing on cinematographic methods reminiscent of 'Georges Melies' , Porter uses animation, double exposure, and trick photography to illustrate the fairy's apparitions, Jack's dream, and the fast growing beanstalk.",
      "tmdbMovieId": 144436,
      "avgRating": 2,
      "releaseYear": "1902",
      "numRatings": 3,
      "posterPath": "/iu8S71AJ385h0q9HgOEypZ2Sywl.jpg"
   }
}