{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "greece",
            "id": 1200
         },
         {
            "name": "village life",
            "id": 1842
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "celebration",
            "id": 33648
         },
         {
            "name": "teacher student relationship",
            "id": 41355
         },
         {
            "name": "junta",
            "id": 156885
         },
         {
            "name": "generation gap",
            "id": 164224
         },
         {
            "name": "graduate",
            "id": 171206
         }
      ],
      "imdb_id": "tt0164094",
      "video": false,
      "title": "Learn How to Read and Write, Son",
      "recommendations": [
         336062,
         374021,
         297316,
         332409,
         385418,
         46824,
         389136,
         368180,
         266255,
         378117,
         307702,
         220835,
         379114,
         332700,
         332304,
         367159,
         297330,
         332405,
         301492,
         297342
      ],
      "backdrop_path": "/yhJVgws5RXgw2vtXlAeMqFFFw6G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Periklis Papahristoforou",
               "gender": 0,
               "credit_id": "52fe4c62c3a36847f822b6cf",
               "name": "Vasilis Diamantopoulos",
               "profile_path": null,
               "id": 1144910,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elpida",
               "gender": 1,
               "credit_id": "52fe4c62c3a36847f822b6d3",
               "name": "Anna Matzourani",
               "profile_path": null,
               "id": 1119900,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sokratis",
               "gender": 2,
               "credit_id": "52fe4c62c3a36847f822b6d7",
               "name": "Nikos Kalogeropoulos",
               "profile_path": "/g2CpZVrqJxkuGUWcBQm5npKFNNK.jpg",
               "id": 490877,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kanabos",
               "gender": 0,
               "credit_id": "52fe4c62c3a36847f822b6db",
               "name": "Christos Kalavrouzos",
               "profile_path": null,
               "id": 1144911,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Hrysanthi",
               "gender": 0,
               "credit_id": "52fe4c62c3a36847f822b6df",
               "name": "Rena Kazakou",
               "profile_path": null,
               "id": 1144912,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dimosthenis",
               "gender": 0,
               "credit_id": "52fe4c62c3a36847f822b6e3",
               "name": "Kostas Tsakonas",
               "profile_path": null,
               "id": 1119990,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c62c3a36847f822b6e9",
               "name": "Thodoros Maragos",
               "profile_path": null,
               "id": 1120000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c62c3a36847f822b6ef",
               "name": "Thodoros Maragos",
               "profile_path": null,
               "id": 1120000,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.378284,
      "production_countries": [{
         "iso_3166_1": "GR",
         "name": "Greece"
      }],
      "id": 163018,
      "vote_count": 7,
      "budget": 0,
      "overview": "The most important political, post-military junta satire about the nation, the religion, the education, the family.",
      "similar": [
         52449,
         9529,
         27066,
         8457,
         22302,
         9276,
         10571,
         9451,
         1259,
         13466,
         9424,
         9777,
         20178,
         4226,
         1555,
         1791,
         8279,
         65496,
         46934,
         44754
      ],
      "original_title": "Μάθε Παιδί Μου Γράμματα",
      "runtime": 96,
      "poster_path": "/qSSFKMRS4B75LVL9syf6CoE5Kg1.jpg",
      "spoken_languages": [{
         "name": "ελληνικά",
         "iso_639_1": "el"
      }],
      "production_companies": [],
      "release_date": "1981-09-30",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "The most important political, post-military junta satire about the nation, the religion, the education, the family.",
      "adult": false,
      "homepage": "http://en.wikipedia.org/wiki/Learn_How_to_Read_and_Write,_Son",
      "status": "Released"
   },
   "imdb": {
      "country": "Greece",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thodoros Maragos"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Thodoros Maragos"],
      "originalLanguage": "Greek",
      "imdbLink": "http://www.imdb.com/title/tt0164094/",
      "coverLink": null,
      "actors": [
         "Vasilis Diamantopoulos",
         "Anna Matzourani",
         "Nikos Kalogeropoulos"
      ],
      "reviews": [
         "First of all i would like to bow to the genius of Nikos Kalogeropoulos. The whole story is seen from the point of view of the character he plays, an underprivileged teenager who is about to finish high school. He is in love with a very poor girl, that has to work in order to support her family, while studying. The problem is that his father is the very conservative schoolmaster, while she is the granddaughter of a Communist who was executed by the Germans. And during that historical period,even in the years of the reestablishment of Greek democracy, the core of Greek society (even more in villages like the one where the story is set) remained mainly really conservative.Furthermore, the arrival of his brother, after a lot of years of studying abroad, and his failure to find a suitable job, challenge his faith in the conservative social system that ruled Greece at the time. But the most revolutionary part of the film is the social commentary. Subjects that where considered taboo for the Greek cinema of the time (sexuality, political sectarianism, unemployment,the rule of the church,miss education, poverty and the negligence toward rural communities) are touched and challenged in a film that only looks like a coming-of-age story. Probably one of the most amazing scenes showing this is the scene where the kids, in the classroom, read their compositions about everyday life in town, and while they read, the camera takes a tour in town showing us what happens in their typical day,and what problems they face. That and the final scene, inside the courtroom.... Oh and it is worth seeing for the beautifully cinematic scenes showing the town of stemnitsa, where the film was shot.......",
         "Only six years after the dictatorship, this movie criticizes, with a clever and satiric way, the political situation of the last 50 years in Greece. For (probably) the first time a director had the carriage to say that the communists were not the `the bad guys' and the betrayers in the second World War, but they were people who they suffer the worse from the conservative greek governments. An excellent acting performance from all the actors and a fantastic funny scenario.",
         "The old fashioned school master, shows the new teacher around in a remote village and eagerly awaits his son's return \"the one with the curly hair\", after years of postgraduate study abroad. The arrival of his son's bald head is only the beginning... The director has a truckload of things to say, so there's no time to be subtle. His case is presented with (sometimes brutal) directness and always unbelievable, especially for that time, sarcasm. The change in the Hellenic language, the changes in ethos, the church, the communists, the attempts to rewrite history, everything is here. An extremely funny movie, unfortunately most of the movie's strong political message and boldness in dealing with the ultra-sensitive \"communist issue\" is lost unless you have a pretty good knowledge of modern Hellenic history.",
         "The theme: a windowed and old-fashioned School master is trying to survive by repeating the stories of glorious times of his nation. He represents the right-wing and faithful in the pre-1981 Greek state that find difficult to adjust and accept the failures of the representatives in achieving a well and democratically governed \"Politia\" (state). He tries to establish an idealized world to defend him from what is in reality a psychological wreck: he remarries a colleague and holds on the idea that his first son who studies in Europe will one day return and fulfill his dreams (the country recognizing his own values and ideology via the success of his first son). The conflict of the era, the suppressed (for almost 30 years) recognition of the left-wing supporters in the modern Greek history and the need for changes in the educational (and social) system are represented through two strong events: the love of his unsuccessful second son with a co-student of communist origin and the dramatic return of the well educated but unemployed first son. For a Greek viewer the story would have been more realistic if it had taken place a decade prior to the date that it was released. It is expected that this movie had played a different role at that time (1981: the same year that the socialists came in power in Greece)compared to the experiences of a modern young viewer. The film is in great part outdated and it requires very good knowledge of the Balkan and Greek political realities. It lacks in objectivity in many dialogs and it clearly uses generalizations for some historic events e.g. argues the role of the greekorthodox church (claiming a negative role) for the whole last 2 centuries based on individual experiences of the heroes etc. Good points for the modern and young Greek viewer: 1. The same questions are still not answered regarding the future of the qualified unemployed Greek scientists. 2. The traditional Greek anankastic and over-protective behavior of the father, who will go to extreme to provide education for his children but at the same time will go to extreme to save their \"face\", a social interpretation of his own \"face\" in the small Greek society."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Th. Marangos -M. Skourti"],
      "summaries": ["In a small Greek village, short time after the collapse of the Junta regime, a memorial of those who died in the German occupation of Greece brings in the surface the political differences of a conservative teacher and his two sons."],
      "budget": 0
   },
   "movielensId": 155671,
   "movielens": {
      "languages": ["ελληνικά"],
      "releaseDate": "1981-09-30",
      "dvdReleaseDate": null,
      "directors": ["Thodoros Maragos"],
      "runtime": 96,
      "movieId": 155671,
      "title": "Learn How to Read and Write, Son",
      "mpaa": null,
      "actors": [
         "Vasilis Diamantopoulos",
         "Anna Matzourani",
         "Nikos Kalogeropoulos",
         "Christos Kalavrouzos",
         "Rena Kazakou",
         "Kostas Tsakonas"
      ],
      "imdbMovieId": "0164094",
      "originalTitle": "Μάθε Παιδί Μου Γράμματα",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["bd7N_C2vM18"],
      "plotSummary": "The most important political, post-military junta satire about the nation, the religion, the education, the family.",
      "tmdbMovieId": 163018,
      "avgRating": 3.71429,
      "releaseYear": "1981",
      "numRatings": 7,
      "posterPath": "/qSSFKMRS4B75LVL9syf6CoE5Kg1.jpg"
   }
}