{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "magic",
         "id": 2343
      }],
      "imdb_id": "tt0113992",
      "video": false,
      "title": "Don't Die Without Telling Me Where You're Going",
      "recommendations": [],
      "backdrop_path": "/2iAJUXYjTQVsXL3H9TyB64k71ld.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Leopoldo",
               "gender": 2,
               "credit_id": "52fe4697c3a368484e098f3d",
               "name": "Darío Grandinetti",
               "profile_path": "/l5FNSMU0ZmEeeob71izhosfBzPb.jpg",
               "id": 3618,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Raquel",
               "gender": 0,
               "credit_id": "52fe4697c3a368484e098f41",
               "name": "Mariana Arias",
               "profile_path": null,
               "id": 236377,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4697c3a368484e098f39",
            "name": "Eliseo Subiela",
            "profile_path": "/VnJ7QQwEjNrLXC1rJBKXaZwxx8.jpg",
            "id": 81116,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.251742,
      "production_countries": [{
         "iso_3166_1": "AR",
         "name": "Argentina"
      }],
      "id": 63004,
      "vote_count": 2,
      "budget": 0,
      "overview": "It is the fantastic story of Leopoldo, a lonely film projectionist who has invented a machine to record his dreams. Through a series of odd events, Leopoldo discovers that he is the reincarnation of one of the inventors of cinema, and that a woman he sees in his dreams is his eternal companion on a trip through centuries.",
      "similar": [
         27022,
         37430,
         675,
         68735,
         9100,
         767,
         284052,
         57158,
         12445,
         672,
         674,
         290595,
         68728,
         321068,
         30144,
         10140,
         120,
         808,
         10882,
         121
      ],
      "original_title": "No te Mueras Sin Decirme Adonde Vas",
      "runtime": 130,
      "poster_path": "/lh7tw59GgRny3wNw6UeO9StMrW8.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "1995-05-04",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["Eliseo Subiela"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0113992/",
      "coverLink": null,
      "actors": [
         "Darío Grandinetti",
         "Mariana Arias",
         "Oscar Martínez"
      ],
      "reviews": [
         "Orthodox religion teaches that man has just one life in which to merit his eternal reward or damnation. Yet today approximately one in four Americans and many Eastern religions believe in reincarnation, the idea that repeated rebirth in human bodies continues until the soul has reached a state of perfection. In his 1995 film, Don't Die Without Telling Me Where You're Going, Argentine director Eliseo Subiela (Man Facing Southeast) uses the idea of reincarnation to tell a touching story about the enduring power of love. Adapted from a novel by Uruguayan writer Hermenegildo Sabat, the film is fantasy, but the emotions dealt with are very real. Leopoldo (Dario Grandinetti), like his father, is a projectionist at the local cinema. His dream, however, is to become an inventor. With the help of his friend Oscar (Oscar Martinez), who has invented a robot in the image of famous tango singer Carlos Gardel, Leopoldo creates a machine that can record a person's dreams and play them back later on a videotape. The film opens in New Jersey in the year 1885. Thomas Edison's assistant is saying good bye to his wife who has just passed away. We are then transported to modern day Buenos Aires where Leopoldo has recorded a dream in which he feels overwhelmed with love for a woman he does not know. He has been married to Susana (Monica Galin) for twenty years, but his love has become mechanical. Amazingly, the next day he sees the woman (Marianna Arias) in his dreams standing outside his theater. She explains that her name is Rachel and that she was married to Leopoldo, then named William, over one hundred years ago. She also tells the astonished projectionist that they have reincarnated together many times throughout the centuries in different roles. Like the angels in Wings of Desire, she is a spirit whom Leopoldo can see and talk with but cannot touch. He longs to hold and kiss her but the laws of the universe prevent this. Fears begin to arise about his mental health when he is seen talking to himself as though someone were standing next to him. Leopoldo's love for Rachel only deepens, however, and both must struggle to overcome their deepest fears, Rachel to accept life, Leopoldo to accept death. Enhanced by the music of Franz Schubert and a lovely original score by Pedro Aznar, Don't Die Without Telling Me Where You're Going is a deeply felt meditation on love, death, and spirituality. In lesser hands, it could have become mawkish and unconvincing, yet Mr. Subiela is a true poet, and in spite of some initial resistance, I was moved by this sensitive work.",
         "Leopoldo invents a rare stuff that he calls \"dreams machine\". Using that, he accidentally meets with his eternal love. This is the fantastic story of a couple able to love each other, even facing the death itself. Excellent photography and intelligent performings to demonstrate that reincarnation is more than a chance. Pedro Aznar's score goes deeper enough to create the timeless atmosphere for this tale. This film is one of Subiela's typical stories, and tries to find an answer to the human being's bigger question. Do not be afraid. Death is not the end. It's just the path between flesh and soul.",
         "This thought provoking movie was another surprise from talented Argentine director Eliseo Subiela, one of the most innovative men on the scene. Again, he has brought Dario Grandinetti, his best collaborator, and one would imagine, alter ego, to give life to a man who dares to question what if dreams can be recorded and then projected on a screen when the person is awake. Leopoldo, who works as a projectionist in a run down cinema in Buenos Aires, knows the end is near before the theater is sold by Don Mario to a some kind of religious group. What is he to do? His wife, who works at home as a beautician, doesn't make much. He is involved with a friend, Oscar, in the development of a robot they have called \"Carlitos\" after their idol, Carlos Gardel, the famous Argentine tango singer. It's at this time that an image begins to take shape in his mind. It's fuzzy at first, but then she appears to him in all her beauty. Rachel, the gorgeous ghost, can only be seen by Leopoldo. She reminds him that at one time he had been her beloved husband, William Dickson, a man that had worked closely with Thomas Edison in the invention of the movies. While William had taken human form, she has not been back, as she hasn't reincarnated, but she has come back because Leopoldo's dreams are always about her. Leopoldo falls deeply in love with Rachel's ghost, something his loving wife Susana, resents, although she has no clue of what's going on in her husband's mind. He gets more distant in his quest for bringing Rachel to life. Oscar is the only one that understands what is going on in his friend's mind and supports him. The only way that Leopoldo can have Rachel is if she would reincarnate, but then, their age difference would be too much. By the end, Susana, who has not been able to conceive a child, unexpectedly gets pregnant. It is at this time we know a miracle has occurred and since Leopoldo can't have Rachel, she will appear in his life in another form. Eliseo Subiela has created a film that makes us think, and at the same time, one can see where he is taking us. This is a joyful ride, because along the way we get Mr. Subiela to guide us in how he brings Leopoldo and Rachel back together, again. The director knows how humans are so deeply inter connected in ways one can't comprehend, yet one gets indication how the past keeps reuniting those souls that have mated for what appears to be eternity. Dario Grandinetti brings to his Leopoldo a mixture of doubt, at first, and then he rekindles the desire for his beloved Rachel. This actor is a natural and it's always a pleasure to watch him get inside his characters. Most of the best things he has done in the movies have been guided by Mr. Subiela, as it appears both men have reached the point that one knows what the other want and vice versa. The beautiful Mariana Arias, making her screen debut is perfect as Rachel who has been much more connected to Leopoldo than he thought possible. Ms. Arias projects intelligence in a role that with someone else might have not been as effective as she made it. Oscar Martinez is Leopoldo's partner, an inventor of great resources who never questions his friend about what his friend is going through. Monica Galan and Tincho Zabala play Susana and Don Mario. A film highly recommended for admirers of Eusebio Subiela and Dario Grandinetti.",
         "This is why I watch foreign films, because once in a while I can find a movie like this. This movie manages to take wistful and make en entire movie out of it. Even at that, I never knew what was coming next (always a good thing). The ending was not what I would have expected. And then it was the next day before I got what the entire movie was about. Oh, it already stood by itself, in my mind. But when it hit me, it was like, \"Oh, wow, yeah, NOW I get it!\" It's possible some may watch this and never get it - what I realized later - but I hope they do. Reincarnation is dear to my heart, which is why I put this in my Netflix queue and then moved it to the top. There is so much you can do with reincarnation themes. And this film treats it both respectfully (not totally necessary, but nice if it happens) and explores the implications and how it might work for some (maybe for all). Few films do the latter well. It treats love across the lifetimes warmly and at a soul level, never letting us forget that desire is part of it, but never letting that be the driver. Whether life goes on or it doesn't, our thoughts on it and the way we treat it in movies won't make any difference. But this film does present a love story/sci-fi version that is well worth it. I give it 10 stars, not because it is about reincarnation, but because the story is well told, has surprises, and allows our minds to get involved. We should all have an across-the-lifetimes love like Leopoldo and Rachel have in this film.",
         "Eliseo Subiela has created a movie which appeals to all audiences throughout the world. Everyone, no matter your race, age, background, can relate to the themes of life, death, and the unknown. He is trying to get across the idea that the life we live here on earth may not be as black and white as we believe or as dictated by religious ideals. Subiela uses visual imagery which the untrained eye may pass over, but at second glance, Subiela's vision is obvious. He uses the black and white tiled floor as an indicator into the psyche of his protagonist Leopoldo. As Leopoldo and Rachel are meeting for the first time, they end up in the lobby of the movie theater. The floor is a sea of black and white, starkly contrasted tiles. Subiela is showing us that Leopoldo, at this point, is stuck in the boxed ideal that nothing happens after death, we just cease to exist. He walks away from their conversation confused and watches as she walks across a crowded street, while cars drive through her body. Our eyes are drawn to the crosswalk which is black asphalt with white lines, but the lines are not complete and are not the same stark contrast of white and black; we begin to see some shades of gray. Leopoldo is open to his relationship with Rachel and learning more about where she came from and how she is able to be apart of his world as a spirit from another. Near the end of the movie, Leopoldo is visited by Pablo, again our eyes are drawn to the floor. The floor is the same black and white tile as the movie theater, but this tile is not brightly colored. The tile is dirty, broken, and is not the perfect black and white pattern. Subiela shows us through the use of color and pattern, how the protagonist is transformed through his encounters that will forever change his vision of the relationships in his life and how the cycle of life is so much more than birth, life, and death.",
         "Leopoldo, (Dario Grandinetti), is a timid man in his 40s who toils away in his spare time on unsuccessful inventions. His latest project: a machine to record dreams while people sleep for later playback. Leopoldo's life is not a happy one. The owner of a failing movie theater in Buenos Aires, he has trouble making ends meet and may soon lose his business. He long-suffering wife Susana, (Monica Galan), is unable to have children, which puts more pressure on an already strained marriage. And it doesn't help matters that Leopoldo behaves eccentrically in public places, conducting conversations with a potted plant carried everywhere as a companion. On day Rachel, (Mariana Arias), appears. Dressed in the styles of the 1880s, she tells Leopoldo \u0096 the only person who can see her -- that she is a reincarnated spirit and they have met and loved each other in different lives during the previous 300 years. The story that follows is an odd, sometimes slow, though rewarding fantasy about life, dreams, and reincarnation. Strongly recommended. 8/10",
         "There is every emotion possible found in this film. I cried, laughed, was sad, joyful, and so many other things, but most of all my soul was greatly touched. The subject of reincarnation is something very close to me and seeing it portrayed on the screen in this beautiful, emotional, magical and real way was just incredible. The story, the acting, the directing and the cinematography were so beautifully integrated. This is a masterpiece if ever I saw one. The part of the film that hit me the hardest was the scene in which Rachel encounters all the people going to be born. The fear of being born was portrayed so strongly by Mariana Arias - It is something I will never forget. As a beginning film student, this is the type of film I hope to one day make.",
         "i saw this film in october 96. and i just loved it. the cinema was filled up, i was there on my own, and as soon as the story began i didn't realize anything around me anymore, i was totally absorbed by the whole thing! but not only me, when the movie ended the audience slowly left, most singing and humming the music, was this magic? some kind of drugs??? don't wanna know it, just want to see it again!!!!",
         "No te Mueras sin Decirme Adónde Vas is a very interesting movie which deals with a lot of science fiction which is not really seen much in Argentine movies, which are most usually very realistic in nature. The fact that there is a robot in the movie, invented by one of the main characters, is not far-reaching compared to the appearances of ghosts, or spirits, which we also see throughout. The use of the technology invented in the movie seems to be the way by which the two inventors find love. On the one hand, Leopoldo clearly falls in love with the lady which he consistently begins to see from the moment she appears in his dream recorder machine. This love goes so far as to improve Leopoldo's relationship with his own wife. A similar occurrence is also observed in the life of Leopoldo's friend, Oscar. After seeing the girl once loved in a dream recorded by the recently invented machine, Oscar ends up reuniting with her. The movie ends up bringing up questions of reincarnation and the ability to become a new man or woman at different stages in one's life.",
         "what happens to us when we die? will we ever meet again? have we ever meet before? Eliseo delivers another Argentine Jewel. Now we see what the question of life and death is....... love?",
         "This movie had the potential to be truly intriguing with the intertwining of concepts like reincarnation, the afterlife, and the world of inventions. Instead, for the two agonizing hours that this movie runs, the characters fail to convey any sort of deep connection between one another—which could almost be considered a talent since they're already supposed to be connected on an extremely deep spiritual level as soul mates—and in turn leave the viewer apathetic toward the final outcome. That said, don't even get me started on the incest. Too late. I understand that this was done with the intention of going for the shock factor, but considering my lack of investment towards the relationships between the characters, you can count me unamused. What I do know is that after sitting through this entire movie I do not want to be left with the disturbing notion that a father is in love with his daughter while still married to his wife.",
         "This film was completely different for me than probably any other film I have seen. The whole odd premise was very difficult for me to get over, that of eternal love between two souls through reincarnation. This definitely takes the phrase \"soul mate\" to a whole new level--and not one I am quite sure I'm comfortable with. Obviously, a movie with a strange premise could still be enjoyable and well done but no other element of the movie impressed me in a way that helped me get over the oddity of it all. The ending did just the opposite of that, it grossed me out as it took the strange elements of the rest of the film to a whole new level."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Artear",
         "Instituto Nacional de Cine y Artes Audiovisuales (INCAA)"
      ],
      "summaries": [
         "This movie is a declaration of love to cinema that is used as a metaphor for the universe itself. We are the films and God is projecting them, including this one with Rachel and Leopoldo, who in a former life literally co-invented cinema as an assistant of Thomas A. Edison named William K.L. Dickson.",
         "It is the fantastic story of a couple that has the chance to live for centuries loving one another because of various reincarnations."
      ],
      "budget": 0
   },
   "movielensId": 155637,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1995-05-04",
      "dvdReleaseDate": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 130,
      "movieId": 155637,
      "title": "Don't Die Without Telling Me Where You're Going",
      "mpaa": "",
      "actors": [
         "Darío Grandinetti",
         "Mariana Arias"
      ],
      "imdbMovieId": "0113992",
      "originalTitle": "No te Mueras Sin Decirme Adonde Vas",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "It is the fantastic story of Leopoldo, a lonely film projectionist who has invented a machine to record his dreams. Through a series of odd events, Leopoldo discovers that he is the reincarnation of one of the inventors of cinema, and that a woman he sees in his dreams is his eternal companion on a trip through centuries.",
      "tmdbMovieId": 63004,
      "avgRating": 2.75,
      "releaseYear": "1995",
      "numRatings": 2,
      "posterPath": "/lh7tw59GgRny3wNw6UeO9StMrW8.jpg"
   }
}