{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0069974",
      "video": false,
      "title": "Digby, the Biggest Dog in the World",
      "recommendations": [
         49082,
         15506
      ],
      "backdrop_path": "/dfDhMfdakvY4QgIdnyc7dgYcpig.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jeff Eldon",
               "gender": 2,
               "credit_id": "52fe47669251416c75097f75",
               "name": "Jim Dale",
               "profile_path": "/uXRnV6La3Yg2brM46kijHoCNy9O.jpg",
               "id": 40945,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Harz",
               "gender": 2,
               "credit_id": "52fe47669251416c75097f79",
               "name": "Spike Milligan",
               "profile_path": "/gTKHCescSG0IZRG4tW7lFqgEOKU.jpg",
               "id": 29539,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Janine",
               "gender": 0,
               "credit_id": "58eae501c3a368731a082a8a",
               "name": "Angela Douglas",
               "profile_path": "/1BPgoMpn5ARlvTIwsiykuR93Ajo.jpg",
               "id": 40951,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "58eae50b9251414b2803b896",
               "name": "John Bluthal",
               "profile_path": "/6dJjtHZkMXoOpRrdF6TCA9BFMF.jpg",
               "id": 8398,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tom",
               "gender": 2,
               "credit_id": "58eae516c3a3684aa406d281",
               "name": "Norman Rossington",
               "profile_path": "/x0PIm3YWHGBimxmXMuvCuOn0LG2.jpg",
               "id": 10596,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Jameson",
               "gender": 2,
               "credit_id": "58eae525c3a368732607ae08",
               "name": "Milo O'Shea",
               "profile_path": "/axJwk4Mwj1ZBx09YE3Lu5qU0QkE.jpg",
               "id": 47137,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Billy White",
               "gender": 2,
               "credit_id": "58eae531c3a3687302077582",
               "name": "Richard Beaumont",
               "profile_path": null,
               "id": 1279359,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Col. Masters",
               "gender": 2,
               "credit_id": "58eae53dc3a368731a082ab7",
               "name": "Dinsdale Landen",
               "profile_path": null,
               "id": 95110,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Rogerson",
               "gender": 2,
               "credit_id": "58eae54d92514134eb0443b7",
               "name": "Garfield Morgan",
               "profile_path": "/hbCQsxjwJEjx7evHmIVX3No9WSM.jpg",
               "id": 170257,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Prof. Ribart",
               "gender": 2,
               "credit_id": "58eae55ec3a36872af0752f7",
               "name": "Victor Spinetti",
               "profile_path": "/iFJM6CnkJLFCVoLhRG0HA9R1RZr.jpg",
               "id": 10598,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Ringmaster",
               "gender": 2,
               "credit_id": "58eae56cc3a36872ee08273e",
               "name": "Harry Towb",
               "profile_path": null,
               "id": 116645,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Gen. Frank",
               "gender": 2,
               "credit_id": "58eae57a92514152ac0331fb",
               "name": "Kenneth J. Warren",
               "profile_path": null,
               "id": 97679,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "The Great Manzini",
               "gender": 0,
               "credit_id": "58eae588c3a3684aa406d2e2",
               "name": "Bob Todd",
               "profile_path": "/9K4XaMuhDZ2cOyPqpNWRwjTiKQj.jpg",
               "id": 112469,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Estate Agent",
               "gender": 2,
               "credit_id": "58eae59dc3a3684aa406d2f3",
               "name": "Frank Thornton",
               "profile_path": "/jxSVGa0aaEAQdzvhobSakqaDr9C.jpg",
               "id": 92042,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Control Operator",
               "gender": 0,
               "credit_id": "58eae5ac925141281907e18c",
               "name": "Sheila Steafel",
               "profile_path": null,
               "id": 96180,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "TV Announcer",
               "gender": 2,
               "credit_id": "58eae5bc9251413ce40216f5",
               "name": "Henry McGee",
               "profile_path": "/yRLtoZxH0avqRCIp2gLnYGkpETH.jpg",
               "id": 115706,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Soldier",
               "gender": 2,
               "credit_id": "58eae5c9925141354c042f9a",
               "name": "Richard Calder",
               "profile_path": null,
               "id": 1701061,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Digby",
               "gender": 2,
               "credit_id": "5a26c4a892514103240edc48",
               "name": "Fernville Lord Digby",
               "profile_path": null,
               "id": 1935584,
               "order": 17
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe47669251416c75097f71",
            "name": "Joseph McGrath",
            "profile_path": null,
            "id": 47792,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.362543,
      "production_countries": [],
      "id": 18188,
      "vote_count": 7,
      "budget": 0,
      "overview": "Digby consumes a bowl of Project X, a liquid growth formula. Soon, he becomes a sheepdog of gigantic size!",
      "similar": [],
      "original_title": "Digby, the Biggest Dog in the World",
      "runtime": 88,
      "poster_path": "/xkGcnsz72U3FhNARmhxcbZq9TJL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walter Shenson Films",
         "id": 3462,
         "origin_country": ""
      }],
      "release_date": "1973-12-01",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph McGrath"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Charles Isaacs",
         "Ted Key"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069974/",
      "coverLink": null,
      "actors": [
         "Jim Dale",
         "Spike Milligan",
         "Angela Douglas"
      ],
      "reviews": [
         "I remember seeing Digby- The Biggest Dog In the World as a child at a Saturday afternoon matinee. I loved this movie! Digby eats some experimental dog food and grows to a giant. I remember crying towards the end when they were going to bomb Digby for causing havoc across the British countryside. I cheered when he came running out of the smoke back to his normal size. For some reason this movie sticks with me after 30 years. Sure, the acting wasn't that great and the special effects were horrendous in retrospect but it sure was a great childhood movie for me",
         "This is one of those movies that evokes all the childhood memories. I still remember viewing this and as a kid and watching it recently it held its greatness. Sure it is a little silly. OK, a lot. That matters not though, big animals and the hysterics they cause may have been the stuff of 1950 B-Movies but it makes for a right old adventure as Digby becomes massive and wreaks havoc across the country. The special effects are obviously terrible but that all adds to the nostalgia, as does Spike Milligan. Above all else this is a slice of british history. Even from the subtleties of them eating breakfast in a british cafe, or the old cars. This is a hark back to a time when british were proud and the movies were innocent.",
         "There are FEW films that are just FUN for kids in the 1970's.... the most that we British had were the Carry on Movies... so seeing a nice little film with Jim Dale in is always a treat! The basic story is simple, the effects are childlike and ...well.. simple and the acting is also as you can guess SIMPLE. This does not make for a plain SIMPLE movie for kids though. It shows them the basic kindness of the human spirit and some of the darker sides of captured animals because they are different too! The jokes are inlayed in the movie together with basic 1970's British steriotypical images of the army, circus workers and the average Joe about the street, but it still holds together quite well. If nothing more this film is fun and carefree, it doesn't really leave you with anything after you have seen it apart from a lil warm glow!",
         "DIGBY is not exactly another doggie movie, but it's so out of sync that it just might work for a few cult movie crowds. So far, not many can top the KILLER TOMATOES for the most successful example of a movie that lives without a plot. This one comes very, very close! So close that even the humongous Digby gets lost in the focus throughout most of the time! The comedy relief is quite groovy, but has that special charm to make this a nearly appropriate \"family\" outing....EXCEPT for a couple of parts that aren't up to \"G\" standards, including the prescence of a bunny girl! (Yes, a bunny girl!) If all of that sounds groovy, then it wouldn't matter so much to enjoy this warped-out experience made to step out of the Kids & Family TV program! The nonsense is way out cracked, and laughable enough to actually make the kids feel safely entertained. Then the hippies who have seen this at the theater will have called this \"groovy!\". Oh, did I forget to mention Digby? After all, he became \"the biggest dog in the world\"! It's downright funny to watch a sheepdog tear up the screen of giant-sized proportions. The visuals look fairly clean on occasion, and other times, they're tacky. I bet the smaller kids would be thrilled by the fascination of things, but whoever wrote the script to this children's film (which was based on a book, by the way) was probably fired from the very beginning. Or maybe the director, having let the cops chase a speeding car? But when all is said and done, the senseless laughter is worth the price of admission. Now if you're a fan with desire over rare movies, I've supplied the IMDb handfuls of commentaries on these which probably had short runs in the theater. DIGBY is a special choice to make for your collection, and a commonly overlooked one. And by golly, rent it if you have to! I just hope your kids will accept the pain and agony they'll get out of this wacko comedy. The family-friendly 70s has never been this groovy!",
         "This is one film that seems to have no two reviewers who seem to agree on its merit or even classification totally. Oh, sure it has a cast that is led by Jim Dale, an actor who did quite well with the Disney crowd. It has a couple of young kids with a Big Hairy English Sheep Dog, how's that for surefire 'family appeal' and a coveted 'G' rating? And yet, we have the inclusion of Spike Milligan, brilliant British comedy pioneer and innovator. Either he was cast here to bring in some of the adults, or perhaps as a tribute to him just to be asked.His acceptance of the role and participation in any project would surely add to the credibility of a picture. Then we have the obvious Science Fiction set in the Cold War serving to make this a spoof of so many countless Saturday matinée 'Things', 'Creatures' and 'Attacks' that had been viewed ever since the end of WWII. You know, Science + the Military = Our World Saved. But one thing that a comedy/farce needs, be it a short,or a feature is to have a good ending, a fade out to leave the audience laughing, satisfied, but somehow wishing that the picture would go on. This was true of the Mack Sennett Keystones, Laurel & Hardy, the Marx Brothers, W.C. Fields and every funny man & comedy team before or after right down to the present day. \"Digby\" has this element and it was my then 3 year old Jennifer who pointed it out to me. At the end, when Digby has been returned to normal, and the Chimp from the Lab drinks some of the Growth Formula, then proceeds to chase his old antagonist,the Colonel, off the screen, it was greeted with a resounding roar of laughter from the audience. And then my little Daughter said laughing ,\"Look, Dad, the Monkey had his (Digby's) power!\" And to think, such wisdom coming from the mouths of babes.",
         "quite simply the finest comedy from either side of the Atlantic i have ever seen with a dog as a central character. it seems fashionable at the moment what with all the 'air bud' movies coming out year after year, but this is where it all started. Jim dale is simply comic genius as his usual hapless self, far better than his Dr Tinkle in the carry on movies , he's given loads more to do and shows off his talents in many memorable scenes, including the legendary one where he faints at the size of Digby's doggie bowl!!!! unbelievable. Not having seen this movie for some years , i recently got hold of a copy out of a supermarket bargain basket for an incredible price and it is the best money I've ever spent. I've loaned it out to all my friends and family and we all agree that it is a truly magical film for all ages and most definitely a must see for everyone who loves laughing at dogs.",
         "I remember first seeing Digby, the Biggest Dog in the World when I was about 8 or so, and I loved it. Rewatching it 10 years later, it isn't as good as I remembered it being, but it is fun besides. I do agree with everyone about the special effects, they aren't that great at all. In fact, even by 1970s standard, they are actually pretty bad. I also agree about Spike Milligan, with someone of his calibre he deserved more screen time and perhaps better material too, he wasn't bad as such, he just deserved more. Coming onto the script and storyline, the script does have a lot of funny moments but there are some grey areas as well, while the story has its predictable spots. However, there is also some funny dialogue and some inspired sight gags. Also, I loved the concept, and the film worked fairly well with it. While the special effects aren't great, the cinematography and scenery are still pretty good, and the direction is at least okay. The acting is decent, Jim Dale especially is a lot of fun, however it is the big dog Digby who steals the show, he is very endearing. And I liked the characters, yes one or two of them are stereotypes, but they are at least likable and funny. In conclusion, a decent film without being outstanding. 6/10 Bethany Cox",
         "Digby is a dog that accidentally is fed with some plant growth boosting chemicals developed by the British military to be used on interplanetary cruises, and about the young boy, Bill, who owns Digby. Digby is given to Bill by a friendly vet, but as Bill's grand-dad doesn't like to have an Old English sheepdog in his house, Bill is forced to give him away. He gives anonymously Digby to a guy who works in a defence lab, that makes experiments with animals and plants for coming space travel. A growth-boosting chemical is made in the lab, and the animal trainer steals some to boost his own tomato crop. Accidentally the dog is fed some, and as a result is growing all the time, eventually he's the size of an ocean liner. As weird animals are attractions Digby is stolen by two well-dressed (mafia-style) hoods and sold to a circus, from which Digby escapes, hunted by the military, both army and air force! The tone of the film is friendly, where all the evil guys are bumbling fools - the British Army lads, as well the Mafioso, and everyone is polite and no swearing! Typical for a family film, I guess! That it keeps its pace, without much of a plot, and that the trick filming usually is pretty good (outstanding for its time, I'd say - most of it), and that it makes you laugh is worth much in my book - that it is 100% 70's (music, dressing, hairstyle, et cetera) makes it very, very camp! A good family film with a lot of slapstick scenes! A perfect feel-good film! Compared to Stuart Little 1 it wins hands down! Available on DVD, by the way!",
         "Military scientist Jeff Eldon works with animals in their labs. He also has a crush on fellow doctor Janine, who is working on growth hormone Project X. To help his roses Jeff `borrows' a little of project X but it is inadvertently fed to a lost dog, Digby. Whilst trying to hide the rapidly growing pooch, Jeff attracts the attentions of a couple of criminals who try to kidnap Digby for a circus attraction. Very much a cult family classic of the 70's this is better when remembered instead of watched. We all remember it as a great film when we talk about it in a pub 20 years on, but it isn't really that good. The story itself is not inspiring and is a rather easy story. What makes it better is that the director has made some nice set pieces and adult jokes in the mix. He also fashions it as a sort of King Kong spoof making it cine-literate \u0096 sort of! But when the chips come down it a lame story held up by distracting laughs. The direction is OK but the effects are bad \u0096 even by 1970's standards. The back project is awful and the use of people dressing in big dog (horse) costumes doesn't work at all. It's a minor complaint because the film avoids putting Digby and humans in the same shot \u0096 preferring to use the real dog and small furniture instead. The cast are good value. Jim Dale (with Carry On partner Angela Douglas) is always good and clowns well here. The support cast comprise many many well known faces from 1970's TV but I have one major let down. One of the UK's best and most influential comedians - Spike Milligan \u0096 is in this film. He's sadly dead now, but he was a genius that sometimes was years ahead of his audience. Here he has some nice touches but he is not allowed to adlib very much and he has very little screen time. I felt that if you had Spike in a film and he was funny that you would edit it to give him as much time as possible \u0096 it's a bit of a waste. Overall this has some funny moments but is nothing more than a kids movie with bad effects. If you have fond memories of this as a child then don't watch it \u0096 you'll only sully your memory.",
         "Digby is a children's film, originating from Britain and made in 1973. I'm an adult and I loved it, it's great to watch at any age! Billy is given a lovable Old English Sheepdog one day, but is forced to give him away. He chooses a kind but absentminded scientist from a military laboratory, and offers him Digby. Somehow Digby gets into the Project X, a secret growth formula from the lab, and becomes a friendly and docile but very enormous dog. Now the army wants Digby gone, and Billy and his adult friends have to keep Digby from suffering a terrible fate. Digby is no sci-fi monster horror film, it's a hilarious comedy with great soundtrack, wonderful performances (including a brief one from Frank Thorton, who played Captain Peacock in Are You Being Served?) and a plot that is certainly original. It's a great movie for all ages, and Digby is definitely a character who will be loved by anyone who watches this.",
         "I did not see this film in theaters when it was first released. But after it became syndicated for television. I would watch it every time one of the local independent stations aired it. I got so caught up in the story every time. But times have changed. Looking back, I am amazed at how easy to please I was back then. The newspaper we took in those days included a TV supplement. It printed a capsule review for this film. I think it says it all: \"If it's a dog, why does it go gobble gobble gobble?\" It is harmless enough for your children to watch, and they may even be entertained. Just don't expect them to be any too much richer from the experience."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "City Investing Company",
         "Walter Shenson Films"
      ],
      "summaries": [
         "Before his adventure begins, Digby is given to Bill by a friendly vet, but as Bill's grandfather doesn't like to have an English sheepdog in his house, Bill is forced to give him away. He gives Digby to a guy who works in a defense lab that experiments with animals and plants for space travel. A growth-boosting chemical is made in the lab, and the animal trainer steals some to boost his own tomato crop. Accidentally, the dog is fed some and, as a result, is growing all the time; eventually, he's the size of an ocean liner. As weird animals are attractions, Digby is stolen by two well-dressed hoods and sold to a circus, from which Digby escapes, hunted by the military, both Army and Air Force!",
         "Digby consumes a bowl of Project X, a liquid growth formula. Soon, he becomes a sheepdog of gigantic size!"
      ],
      "budget": 0
   },
   "movielensId": 155786,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-12-01",
      "dvdReleaseDate": null,
      "directors": ["Joseph McGrath"],
      "runtime": 88,
      "movieId": 155786,
      "title": "Digby, the Biggest Dog in the World",
      "mpaa": "",
      "actors": [
         "Jim Dale",
         "Spike Milligan",
         "Angela Douglas",
         "John Bluthal",
         "Norman Rossington",
         "Milo O'Shea",
         "Richard Beaumont",
         "Dinsdale Landen",
         "Garfield Morgan",
         "Victor Spinetti",
         "Harry Towb",
         "Kenneth J. Warren",
         "Bob Todd",
         "Frank Thornton",
         "Sheila Steafel",
         "Henry McGee",
         "Richard Calder",
         "Fernville Lord Digby"
      ],
      "imdbMovieId": "0069974",
      "originalTitle": "Digby, the Biggest Dog in the World",
      "genres": [""],
      "youtubeTrailerIds": ["Qam-dEKjB1c"],
      "plotSummary": "Digby consumes a bowl of Project X, a liquid growth formula. Soon, he becomes a sheepdog of gigantic size!",
      "tmdbMovieId": 18188,
      "avgRating": 3,
      "releaseYear": "1973",
      "numRatings": 1,
      "posterPath": "/xkGcnsz72U3FhNARmhxcbZq9TJL.jpg"
   }
}