{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "warsaw ghetto",
            "id": 2435
         },
         {
            "name": "children",
            "id": 10103
         }
      ],
      "imdb_id": "tt1608516",
      "video": false,
      "title": "Run Boy Run",
      "recommendations": [
         388899,
         339258,
         298081,
         344039,
         199615
      ],
      "backdrop_path": "/xwNzJUAQchX3XRVuKyOmJpvW8B0.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "5935d36992514166240000ae",
         "content": "**The war had no mercy on this innocent child.**\r\n\r\nAnyone who lived in the early 1940s Europe would tell you their version of the horrific story. Many people fought for their survival each day, every minute. That's when they all would have thought the paradise (earth) turned into hell. This was adapted from the recent book of the same name, which was originally based on the real about an eight year old Jewish boy. You could say it is the kid version of 'The Pianist' or exactly opposite of 'The Diary of Anne Frank' as if Anne did not take shelter, she would have done something like. Very emotional film from the very first scene to the last. They have produced some of the finest World War II films in the recent time, but I haven't felt like I did for this. Totally heartbroken!\r\n\r\nThe saddest part is this film was underrated and under-noticed despite it was released just a couple of years ago. The reason might be, it was not a big production house film or internationally recognisable actors in it. Though I recognised a couple of German, Polish actors who were on the small roles. It was jointly produced by Poland, Germany and France, but should have been in the English language for the wider audience reach. Anyway, being true, including languages, which were multiple and locations would always give a perfect depiction of the event and I liked it that way. It was also good to see the Russians are not the bad guys or the roughest- toughest one we'd seen in other WWII films.\r\n\r\nThe opening was very strong. We won't know what's going on like who is this kid, where he'd come from and heading to, but surely understandable the boy is fighting for survival against the odds. Soon a small flashback of his recent past shown, but nothing deeper beyond like his home and parents were revealed. In the ending, there's a little information about that which will get you emotionally for sure. He was very young to understand all this, yet developed a survival skill. Like they say, 'all is fair in love and war', he wasn't a warrior, but what he did has to be done and it was impressive for that age. Some people helped him through, though some did not. It's all about running, running, running, like a herbivorous in the wild, not knowing when he'll become a prey to a predator.\r\n\r\n> ❝Keep moving. To the east, where the sun rises.❞\r\n\r\nThe journey of three years of his life was like eternal. He has to sacrifice many things, including his innocent childhood that war had no mercy on it. In one of the scenes where he seriously met with an accident, I was unable to bear it. In a film, it's all compressed for just two hours of what took years in the real life. Only Yoran Fridman knows his real experience. He can be seen in the final scene of the film. This was like a coming-of-age, but no kids should go through it.\r\n\r\nI know it was only a film version, but that smile, that sobbing, that fear and that strategy of survival in that age, you will lose yourself in your watch. But the entire film was only the war portion of his story. There's no earlier event, like with his parents or the post war, except at the end it skipped too far for a brief detail as any film does in that section.\r\n\r\nIt was a fine casting. The kid in the lead was in fact played by the twin brothers. I think they switched and performed well the role they have represented. It was a great screenplay and direction. Wonderful locations, especially creating those war like atmosphere. A fitting background score, it was a perfect film that brought back to us on the screen of the 75 years ago Poland when the Nazis army roamed. But I had zero idea of the film, not even knew it was a war film. It was a last minute decision to check it out and I made the right one. Like this way I'd found many hidden gems, that's what I love to do and spread the word.\r\n\r\nFilms like this usually have more unpleasant events. But involving a kid in such circumstances were even more painful to watch if you are a light hearted. Though a film like this should not be missed. This is a must watch film among WWII themes. I don't think so, I would forget everything I just saw in this film, not for anytime soon and I definitely recommend it to those who are seeking a title, but not sure which one to opt. Mainstream world should know this film and I hope my this review contributes a little for that. So, go guys go, watch it now if you haven't.\r\n\r\n_9/10_",
         "url": "https://www.themoviedb.org/review/5935d36992514166240000ae"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Srulik/Jurek",
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c17",
               "name": "Kamil Tkacz",
               "profile_path": "/iy3oYRHA7Nu8Mu7BVD03HJf9Qd8.jpg",
               "id": 1273917,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Magda Janczyk",
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c1b",
               "name": "Elisabeth Duda",
               "profile_path": "/1oQ1SuckZlGvCcIeB9pkgvZDD4e.jpg",
               "id": 1273918,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Mrs. Herman",
               "gender": 1,
               "credit_id": "52fe4e8cc3a36847f8297c1f",
               "name": "Jeanette Hain",
               "profile_path": "/icET9X1pV73INdR7YYZcYXJeCDU.jpg",
               "id": 49018,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Mosche",
               "gender": 2,
               "credit_id": "52fe4e8cc3a36847f8297c23",
               "name": "Itay Tiran",
               "profile_path": "/3xOPPaKVKHVyFRTuIKvnXALwTkZ.jpg",
               "id": 110364,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Riwa Fridman",
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c27",
               "name": "Katarzyna Bargiełowska",
               "profile_path": "/bBLQsA6BMXq7erMyRDDuriSeyeb.jpg",
               "id": 1076083,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "SS-Offizier",
               "gender": 2,
               "credit_id": "54143f8c0e0a2619a1001ae1",
               "name": "Rainer Bock",
               "profile_path": "/ebmPZimivfRFKYnKp2ygazkJO9r.jpg",
               "id": 65054,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Ewa Staniak",
               "gender": 0,
               "credit_id": "59031035c3a36828b8007afc",
               "name": "Grażyna Szapołowska",
               "profile_path": "/mtLDJgOzTDbuWDMIm0LwQlyDO4h.jpg",
               "id": 1384,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297bef",
               "name": "Heinrich Hadding",
               "profile_path": null,
               "id": 57752,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4e8cc3a36847f8297bf5",
               "name": "Daniel Gottschalk",
               "profile_path": null,
               "id": 5194,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4e8cc3a36847f8297bfb",
               "name": "Richard Marizy",
               "profile_path": null,
               "id": 16931,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c01",
               "name": "Stéphane Moucha",
               "profile_path": null,
               "id": 8195,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c07",
               "name": "Susa Kusche",
               "profile_path": null,
               "id": 1273915,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e8cc3a36847f8297c13",
               "name": "Uwe Spiller",
               "profile_path": null,
               "id": 1273916,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54a72e159251414d6d000218",
               "name": "Pepe Danquart",
               "profile_path": "/e7vUZzMdmfbgmiSXNr8xEpyTv3K.jpg",
               "id": 36417,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54a72e25c3a3680c1c000212",
               "name": "Pepe Danquart",
               "profile_path": "/e7vUZzMdmfbgmiSXNr8xEpyTv3K.jpg",
               "id": 36417,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 4.497303,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         }
      ],
      "id": 239103,
      "vote_count": 56,
      "budget": 0,
      "overview": "Run Boy Run is the true story of Jurek, an eight-year-old boy, who escapes from the Warsaw ghetto, then manages to survive in the woods and working as a farmhand, disguising himself as a Polish orphan. He encounters people who will betray him for a reward, who will beat him up or try to kill him, and he meets those, who will do and risk almost everything to help him. Jurek’s resilience is put to the ultimate test, when an accident cripples him, making it harder to find work. But he struggles on against all odds. Eventually the Russians reach his area and Jurek even finds a family where he could stay. Yet he is betrayed again, and a young man from a Jewish orphanage forcefully tries to bring Jurek back to his people and his faith.",
      "similar": [
         423,
         424,
         9045,
         5925,
         637,
         14574,
         228150,
         289222,
         15764,
         369885,
         21876,
         399790,
         803,
         821,
         1771,
         16869,
         853,
         2253,
         289,
         613
      ],
      "original_title": "Lauf Junge lauf",
      "runtime": 108,
      "poster_path": "/8ennQZOiQRzdMNV5jDPmwUj5Wi5.jpg",
      "spoken_languages": [
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [],
      "release_date": "2013-11-12",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pepe Danquart"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Heinrich Hadding",
         "Pepe Danquart"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt1608516/",
      "coverLink": null,
      "actors": [
         "Andrzej Tkacz",
         "Kamil Tkacz",
         "Elisabeth Duda"
      ],
      "reviews": [
         "Lauf Junge lauf (2013) is a German/Polish film shown in the US with the title \"Run Boy Run.\" It was directed by Pepe Danquart. The movie tells the harrowing story of Srulik, a Jewish boy who escapes the Warsaw ghetto and survives--by using his wits and his courage--in rural Poland. Kamil Tkacz brilliantly plays Srulik. (Srulik changes his name to Jurek Staniak in order to pass as a Gentile.) There really was a Srulik, so this film is partially a documentary. It's not an easy film to watch, because Srulik's life is horribly difficult, and every respite is followed by yet another near-death experience. The Poles Srulik meets range from evil (turning him over to the Germans for a reward) to neutral, to wonderful. In fact, the actions of the Polish people Surlik encounters make up the bulk of the story. However, ever present, even off-screen, is the huge evil of the Holocaust. It's hard to believe that the occupying Germans would spend so much time and energy trying to catch one young Jewish boy, but that was the reality. Srulik was never safe. He was safer or less safe, but never truly safe. I think this extraordinary film is worth seeking out and watching. It will work well on DVD, but we were fortunate enough to see it at the excellent Dryden Theatre, as part of the superb Rochester Jewish Film Festival. P.S. As I write this review, Run Boy Run carries a dismal 6.5 IMDb rating. I think that's because the film has so many bad moments, and so few truly happy ones. Still, it's an excellent movie, and, in my opinion, deserves a much higher rating.",
         "\"Run, Boy, Run\" (2013 release from Germany/Poland; 113 min.; original title \"Lauf, Junge, Lauf\") brings the fictional story of a young Jewish boy in Poland. As the movie opens, we are told that it is \"Winter 1942/43\" and we see a boy wondering the harsh and snowy countryside, barely surviving. Eventually he gets taken in by a catholic woman, who decides that in order for the boy to survive, he needs to assimilate into becoming a 'regular' Polish (read: catholic) boy, sporting a Polish name (Jurek, instead of Srulik). When things eventually gets too risky, with the German occupation forces becoming ever more intrusive, she has no choice but to send the boy away, and he must look for new shelter. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: first, the movie is based on the acclaimed (and prize winning) novel of the same name by Uri Orlev in the early 2000s. Given the topic of the novel, and the acclaim it got, it's surprising in a way that it took this long for it to be adapted for the big screen. Second, this is not an easy movie to watch, as the young boy encounters his share of troubles, and then some. Just when you think it can't get any more challenging, it does! Of course it makes for dramatic cinema. Third, apart the immediate challenges of the day-to-say survival of the boy, there are some further serious undertones as to the boy's Jewish identity: if you 'study' to act like a catholic in order to survive, and you live and breathe Catholicism, does a person's Jewish identity become endangered at some point? Fourth, special kudos to the movie's photography, as the forests and countryside look absolutely beautiful, both in winter and in summer time. Last but not least, the movie features a gorgeous orchestral soundtrack, composed by Stéphane Moucha. Bottom line: \"Run, Boy, Run\" is not exactly the type of movie that makes you think 'that was a jolly good time!\" as you leave the theater. But it IS a movie that will stay with you long afterwards. And the young boy who plays the Srulik/Jurek character is fantastic. I saw this movie recently at the 2014 Jewish & Israeli Film Festival (Summer Series) here in Cincinnati, and the screening was very well attended. I certainly hope that this will get a proper DVD release in the US. \"Run, Boy, Run\" is HIGHLY RECOMMENDED!",
         "I didn't know what to expect when I got tickets to see this flick at the Scottsdale Film Festival in October, 2014, but I was overwhelmingly surprised at how powerful of a film this was. I gave it five stars (5/5) at the festival. This story is one of moral courage and sheer survival of a young Polish Jew during WWII. By chance and cleverness he escapes the Nazi camps and purges, but not without great cost and sacrifice. Along the way he learns there are some people who cared enough about doing what was right to stand against the evil German juggernaut, and risk their own lives to help those in desperate need. It has now been 70 years since the world was immersed in a terrific battle of good versus evil, and films like this help us to remember how it was back then, lest we forget, and think it never really happened, or could never happen again.",
         "This film is available on Netflix, it does have subtitles, but that makes this story that much better. The young actors who play Srulik/Jurek did an absolutely amazing job and perfectly captured the raw emotion, pain and suffering that Yoram Friedman must have felt during the 3 years spent fleeing Germans in the Polish countryside. If not mentioned above, this film is based on a true story and is said to be 90% accurate, the end of the film features a clip from Yoram himself. I highly recommend this film as it portrays war and the suffering of Jews during WWII from a child's perspective. I was left in tears and just wanting to hug Srulik at the end, this film will definitely stay with me for a very long time.",
         "I starting watching this film on Netflix and was about to turn it off when I saw the sub-titles. I really don't like to have to read them. I prefer movies I watch to be in English but I just couldn't turn it off. I was immediately drawn in and didn't mind the sub-titles at all. There wasn't not a lot of dialog anyway. This film is so beautifully done, the story, the music and the time period in history. It is a heartbreaking series of events. The young boy's acting is superb and you feel as if you are right there with him as he struggles to survive in the cruel world of the Holocaust. It is far from happy but definitely worth watching. I recommend this movie. It will stay with me for a long time.",
         "I just recently came across this on you know one of those streaming sites. Normally I ignore movies and shows that don't have a certain rating level here but this time I watched the movie and then checked how others saw it. Wow, most underrated movie I've seen. There are a lot of movies about the holocaust but this is a very unusual film and story. Unlike Hollywood, foreign films like this one typically show the paradox of people with regard to evil. That is, what makes people good or bad? Can they be both? If the character wasn't a young boy how different would the story be. With regard to the storytelling and the acting I'd put this movie above most holocaust movies including schindler's list. If you can't feel anything while watching this then maybe you should evaluate yourself and your life.",
         "Half a year after the movie premiered in Cottbus, it got a wide release all throughout Germany. The director is Pepe Danquart, who won an Academy Short Film Award over 20 years ago. And even now, it has been almost 10 years between \"Lauf Junge lauf\" and his last non-documentary movie. I would not say that this movie had any moments of true greatness, but it was 2 entertaining hours at the theater. This is quite an achievement as there have been so many films taking place during the Nazi years or World War II and it is always nice to see one that comes up with a story that does not feel repetitive. The little boy who played the main character did not have to act that much. the script was really written intelligently in a way, in which being there was enough in most situations to see him disappear in his role. Still he wasn't bad at all. Basically, all the supporting characters make this movie so interesting: the Nazi officers, those who help the boy (especially the woman who lives alone in the house), the doctors etc. Of course the kid being a Jew gives the film great significance, but it never felt like this was the key point here. The scenes, in which the boy interacts with different character rarely put any emphasis on that, and that made them so interesting. the chase scenes worked well and I also liked the camera shots and cinematography (which got nominated at the German Film Awards). And rightfully so. It is very much responsible for all the scenes that have you on the edge of your seat. Let me emphasize though that this is no film for children, despite a child playing the main character. Here and there you find children's films that take place during World War II, but this is not one of them. There is one scene with a severed arm which is particularly brutal. All in all, I'd recommend this movie. It features some of Poland most notable actors right now and maybe it can be a platform for one or two of them to have a bigger career in European movies outside their country. We'll see. Despite the dark times and heavy topic, the film occasionally manages to put a smile on your lips, which is always good as you don't want to be too depressed when the ending credits roll in. I always like when they manage to put in some comic relief, not too much though as otherwise it becomes a bit ridiculous, and they managed the right amount here.",
         "Anyone who lived in the early 1940s Europe would tell you their version of the horrific story. Many people fought for their survival each day, every minute. That's when they all would have thought the paradise (earth) turned into hell. This was adapted from the recent book of the same name, which was originally based on the real about an eight year old Jewish boy. You could say it is the kid version of 'The Pianist' or exactly opposite of 'The Diary of Anne Frank' as if Anne did not take shelter, she would have done something like. Very emotional film from the very first scene to the last. They have produced some of the finest World War II films in the recent time, but I haven't felt like I did for this. Totally heartbroken! The saddest part is this film was underrated and under-noticed despite it was released just a couple of years ago. The reason might be, it was not a big production house film or internationally recognisable actors in it. Though I recognised a couple of German, Polish actors who were on the small roles. It was jointly produced by Poland, Germany and France, but should have been in the English language for the wider audience reach. Anyway, being true, including languages, which were multiple and locations would always give a perfect depiction of the event and I liked it that way. It was also good to see the Russians are not the bad guys or the roughest- toughest one we'd seen in other WWII films. The opening was very strong. We won't know what's going on like who is this kid, where he'd come from and heading to, but surely understandable the boy is fighting for survival against the odds. Soon a small flashback of his recent past shown, but nothing deeper beyond like his home and parents were revealed. In the ending, there's a little information about that which will get you emotionally for sure. He was very young to understand all this, yet developed a survival skill. Like they say, 'all is fair in love and war', he wasn't a warrior, but what he did has to be done and it was impressive for that age. Some people helped him through, though some did not. It's all about running, running, running, like a herbivorous in the wild, not knowing when he'll become a prey to a predator. ❝Keep moving. To the east, where the sun rises.❞ The journey of three years of his life was like eternal. He has to sacrifice many things, including his innocent childhood that war had no mercy on it. In one of the scenes where he seriously met with an accident, I was unable to bear it. In a film, it's all compressed for just two hours of what took years in the real life. Only Yoran Fridman knows his real experience. He can be seen in the final scene of the film. This was like a coming-of-age, but no kids should go through it. I know it was only a film version, but that smile, that sobbing, that fear and that strategy of survival in that age, you will lose yourself in your watch. But the entire film was only the war portion of his story. There's no earlier event, like with his parents or the post war, except at the end it skipped too far for a brief detail as any film does in that section. It was a fine casting. The kid in the lead was in fact played by the twin brothers. I think they switched and performed well the role they have represented. It was a great screenplay and direction. Wonderful locations, especially creating those war like atmosphere. A fitting background score, it was a perfect film that brought back to us on the screen of the 75 years ago Poland when the Nazis army roamed. But I had zero idea of the film, not even knew it was a war film. It was a last minute decision to check it out and I made the right one. Like this way I'd found many hidden gems, that's what I love to do and spread the word. Films like this usually have more unpleasant events. But involving a kid in such circumstances were even more painful to watch if you are a light hearted. Though a film like this should not be missed. This is a must watch film among WWII themes. I don't think so, I would forget everything I just saw in this film, not for anytime soon and I definitely recommend it to those who are seeking a title, but not sure which one to opt. Mainstream world should know this film and I hope my this review contributes a little for that. So, go guys go, watch it now if you haven't. 9/10",
         "Srulik is eight years old when in 1942 the German war machine tightens its grip on the Warsaw Ghetto. His father knows that to stay means death and so tries to get his family out. In the fog of war Srulik ends up alone and flees to the forests of Poland. He soon finds that being the boy he was born to be will not help him survive and so takes on a mantle that will help him. To sat any more runs the risk of ruining the story. This is based on a true story and to think that someone could have come through such tortures is both saddening and encouraging. It had me moved to tears on more than one occasion and to say the acting is superb is an understatement. This is not a war film as such, but is based in one and the terrible things that such brings. It is in Polish and German with good sub titles and is a film I shall be recommending for some time to come.",
         "I came across this movie by pure chance. Browsing through DVDs in the supermarket I bought it on a whim. Boy, am I glad I did. Given the subject matter it is grim in places (and if you don't shed a tear at times you have no heart!) but please do not let this put you off viewing what is in the end a truly inspiring tale of courage and fortitude overcoming the horrors of The Holocaust. I viewed it under the title 'Escape From Warsaw' and struggled to find it under this name on IMDb. And when I did find it, I was amazed to find it only had a rating of 7/10. Not bad of course, but this movie for me deserves a 10. The little boy who plays the lead is totally convincing and acts way beyond his years. The rest of the cast is also excellent and the Polish countryside and forests are seen in all their glory throughout. I cannot recommend this movie highly enough.",
         "Dramatic and powerful true story about human evil and human love. This film tells the story of one young Jewish boy's flight from the Warsaw Ghetto early in World War Two. This film takes a very balanced view of Poland during WW2, and shows that great compassion is possible during great trial. Stunningly presented from the viewpoint of a Jewish boy, who is eight years old at the start of the story, the piece swings dramatically from hope to heartache, and back to hope. Well directed and written, and starkly photographed, this piece is very ably handled by Kamil Tkacz, in a strong, vibrant, performance in the central role, Jurak.",
         "I think this is a film on a difficult time in history that through the innocent eyes of Jurek the brave protagonist a young Jewish male trying to survive persecution from the Nazi regime. I liked how developed the story lines and characters were and how it all tied together at the end. The story was incredulous and you just feel yourself drawn in its a story of how ordinary people go through war and ethnic \"cleansing\". The movie remained true to the Ww2 time but did not seem corny or dated and there were really timeless ageless topic in this film. This film convinced me how we need to protect young people from the terrors of war and antisemitism and racism. The film of the polish nature and countryside is quite beautiful in itself."
      ],
      "genres": [
         "Action",
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Bittersuess Pictures",
         "Ciné-Sud Promotion",
         "A Company Filmproduktionsgesellschaft"
      ],
      "summaries": [
         "Srulik, an eight-year-old boy, flees from the Warsaw ghetto in 1942. He attempts to survive, at first alone in the forest, and then as a Christian orphan named Jurek on a Polish farm. Throughout his ordeal, his Jewish identity is in danger of being lost. The story is based on the bestseller by Uri Orlev.",
         "*Jewish Polish village baker's son Srulik Staniak (nine) is separated from his family, to escape from the Warshaw ghetto into the forest and farmland. He must survive mostly alone, surviving from the wild, chores or petty theft, for when he joins a band of orphans kids, they driven apart, and when life becomes good virtually adopted by a farmer, a playmate spots his circumcision, so he must flee before the Nazis arrive. Partisan wife and mother Magda Janczyk takes him in, nearly frozen to dead, and teaches him to pose as Jurek, a Catholic orphan. Chased by another Nazi threat, he's sold for bounty, escapes from the HQ due to the games-addicted amused CO, who lets him alone when spotted on the estate of German widow Hermann, his lover. Foreman Pawel takes him under his wing, even after a horrible accident crushes his hand, requiring hospitalization, where his circumcision is noticed, so he must run again into the worst war winter. Having been 'adopted' by the Kowalski farmer family, the Soviet invasion and a Jewish orphan spotter offer him a hard choice."
      ],
      "budget": 0
   },
   "movielensId": 155834,
   "movielens": {
      "languages": [
         "עִבְרִית",
         "Deutsch",
         "Polski",
         ""
      ],
      "releaseDate": "2013-11-12",
      "dvdReleaseDate": null,
      "directors": ["Pepe Danquart"],
      "runtime": 108,
      "movieId": 155834,
      "title": "Run Boy Run",
      "mpaa": null,
      "actors": [
         "Kamil Tkacz",
         "Elisabeth Duda",
         "Jeanette Hain",
         "Itay Tiran",
         "Katarzyna Bargiełowska",
         "Rainer Bock",
         "Grażyna Szapołowska"
      ],
      "imdbMovieId": "1608516",
      "originalTitle": "Lauf Junge lauf",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Run Boy Run is the true story of Jurek, an eight-year-old boy, who escapes from the Warsaw ghetto, then manages to survive in the woods and working as a farmhand, disguising himself as a Polish orphan. He encounters people who will betray him for a reward, who will beat him up or try to kill him, and he meets those, who will do and risk almost everything to help him. Jurek’s resilience is put to the ultimate test, when an accident cripples him, making it harder to find work. But he struggles on against all odds. Eventually the Russians reach his area and Jurek even finds a family where he could stay. Yet he is betrayed again, and a young man from a Jewish orphanage forcefully tries to bring Jurek back to his people and his faith.",
      "tmdbMovieId": 239103,
      "avgRating": 3.9375,
      "releaseYear": "2013",
      "numRatings": 8,
      "posterPath": "/8ennQZOiQRzdMNV5jDPmwUj5Wi5.jpg"
   }
}