{
   "tmdb": {
      "original_language": "ka",
      "keywords": [],
      "imdb_id": "tt0247184",
      "video": false,
      "title": "April",
      "recommendations": [
         4962,
         148782,
         146521,
         47450,
         46851,
         212596,
         163890,
         211879,
         85924,
         46750,
         108759,
         46994,
         216658,
         339675,
         83909,
         160004,
         49104,
         216729,
         42237,
         277866
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Mtsiya",
               "gender": 0,
               "credit_id": "55afebb0c3a368300200c899",
               "name": "Tatyana Chanturia",
               "profile_path": null,
               "id": 1489467,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Vadzha",
               "gender": 0,
               "credit_id": "55afebba9251411e1100cf08",
               "name": "Gia Chiraqadze",
               "profile_path": null,
               "id": 1489468,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Sosed",
               "gender": 0,
               "credit_id": "55afebc4c3a3682ffc00ca6a",
               "name": "Akakiy Chikvaidze",
               "profile_path": null,
               "id": 1489469,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "55afebcac3a3682d63009c95",
               "name": "V. Maisuradze",
               "profile_path": null,
               "id": 1489470,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "55afebd09251411e0f00cb9c",
               "name": "A. Jorbenadze",
               "profile_path": null,
               "id": 1489471,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48949251416c910916eb",
               "name": "Otar Iosseliani",
               "profile_path": "/ekjebgvM1ww14ZMQAZTAAmz0THf.jpg",
               "id": 40260,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55afeb32c3a368246c006f8a",
               "name": "Erlom Akhvlediani",
               "profile_path": "/70PI24CtT2iY7INWQV7DUB7LBnm.jpg",
               "id": 1489457,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55afeb3b9251411e0b00c90c",
               "name": "Otar Iosseliani",
               "profile_path": "/ekjebgvM1ww14ZMQAZTAAmz0THf.jpg",
               "id": 40260,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55afeb4b9251411e0f00cb82",
               "name": "G. Shariqadze",
               "profile_path": null,
               "id": 1489458,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55afeb559251411e0f00cb88",
               "name": "Sulkhan Nasidze",
               "profile_path": null,
               "id": 1489459,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "55afeb5f92514172ef00aae7",
               "name": "Yuri Fednev",
               "profile_path": null,
               "id": 1489460,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55afeb689251411e1800c4e9",
               "name": "Eduard Lapkovski",
               "profile_path": null,
               "id": 1489461,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55afeb759251411e0b00c912",
               "name": "V. Bebiashvili",
               "profile_path": null,
               "id": 1489462,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "55afeb7e9251411e0f00cb90",
               "name": "L. Mjavia",
               "profile_path": null,
               "id": 1489463,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "55afeb899251411e0f00cb96",
               "name": "Vaja Machaidze",
               "profile_path": null,
               "id": 1489464,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "55afeb92c3a368300200c893",
               "name": "Gogi Kasradze",
               "profile_path": null,
               "id": 1489465,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "55afeb9dc3a36872650066ef",
               "name": "E. Nujniakovi",
               "profile_path": null,
               "id": 1489466,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.34958,
      "production_countries": [{
         "iso_3166_1": "GE",
         "name": "Georgia"
      }],
      "id": 83234,
      "vote_count": 6,
      "budget": 0,
      "overview": "A critique of materialism, the film is about a young couple who live in a rundown empty apartment. Their love is so strong that it makes the water flow and the electricity work, but when they start purchasing furniture and knickknacks, they fight and grow apart",
      "similar": [],
      "original_title": "აპრილი",
      "runtime": 45,
      "poster_path": "/BMm3KepJrT3DBCXfWU60uEInv2.jpg",
      "spoken_languages": [{
         "name": "ქართული",
         "iso_639_1": "ka"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Qartuli Pilmi",
         "id": 15406,
         "origin_country": ""
      }],
      "release_date": "1961-01-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Otar Iosseliani"],
      "runtime": 46,
      "synopsis": null,
      "writers": [
         "Erlom Akhvlediani",
         "Otar Iosseliani"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0247184/",
      "coverLink": null,
      "actors": [
         "Tatyana Chanturia",
         "Gia Chiraqadze",
         "Akakiy Chikvaidze"
      ],
      "reviews": [
         "This short film, from Iosseliani's apprentice years during the Soviet era in his native Georgia, is a charming, humorous, yet barbed, contemporary fable of modern life and traditional values. It shows the age-old tension between the tender intimacy of young love and the blundering officiousness of serious adult society. Along the way it shows the public mobilization of Labour in conflict with the private need for space in which to cultivate the personal, be it physical or musical culture, or the mutual rapture of intimacy. Indeed, the film may be said to deplore the increasing 'meuble-isation' of Soviet society, as its 'embourgement' proceeds apace to stuff the clean modern apartments of the new worker's housing development with heavy black furniture and fragile glass ornaments. As little old men dressed in dingy black overalls and flat caps begin to infest the streets and corridors of the lover's home town with the increasingly distracting noise and bustle of unwanted deliveries of unwanted, ugly, old-fashioned, furniture, Iosselliani's whimsical yet shrewd penchant for Tati-esquire comedy is given much scope. But there is a native Georgian poetry in his heart, also. The young couple move into one of the new apartments, and are delighted with its clean, uncluttered modernity: All the modern conveniences of daily living, such as the running water on tap in the kitchen, the large gas-range, and the electric light are welcomed with the same innocent wonder as the traditional beauties of Georgian nature, in which the lovers originally had their tryst. Indeed, so magical are these socialist goods, that the bulb lights, the water flows, and the gas rings leap with flame merely in sympathetic response to the lover's desire! But all soon goes wrong, as the couple sit, alienated from each other, in their now hopelessly cluttered flat, by the obstacle of possessions, with a jail-like array of locks and padlocks and chains and bolts on the entrance to secure the imposed paranoia of this materialist burden. No longer do the bulb, the gas, and the water glow and dance and sparkle at will for them! Sadly, the ancient tree, where lovers must have met for generations before ours were born and came to meet there themselves in happier days, is chopped down by the little, Kafkaesque, human furniture-beetles, in order to inflict yet more hideous appurtenances of an uncomfortable existence on the already cramped lives of the people. However, in a joyous rebellion against all such pointless and restricting formalism, whereby the most trivial details of private life have somehow been unsympathetically dictated without any prior consultation, the inhabitants begin throwing their furniture out of the windows, satisfactorily reducing it to matchwood below! (The Soviet censors took a dim view of such anti-social waste.) Even the young Iosselliani has a wonderfully keen eye, and there are wonderful scenes, both comic and piquant. He also possesses a remarkable cinematic intelligence, demonstrating here a superb technical finesse in the construction and cinematography of his film. The use of sound, in what is essentially an example of 'Cinema muto,' is particularly brilliant, and orchestrated to a degree that again puts us in mind of Tati. The use of people as mimes of the director's intentions, rather than as actors in their own right, is also reminiscent of Tati's approach to film performance. The whole effect is dreamlike and magical, leaving one with the sense only folk-tales can give, of having recollected the story from somewhere - perhaps one's earliest years - and never really forgotten it. I had the strange feeling that I had seen it somewhere before, long ago ... and yet I know this cannot be possible. There is a timelessness in the world Iosselliani has conjured up here which has been patiently awaiting our return to consciousness of it. And thanks to Cahiers du Cinema and 'blaq out' it awaits anyone who wishes to have it, since it has been issued in France as part of a wonderful boxed set of 7 DVD recordings of a lifetime of Iosseliani films.",
         "This early Soviet-era short from Georgian film-making master Otar Iosseliani is a beautiful, thoroughly enjoyable, and affecting comedy/drama. Iosseliani hasn't quite perfected his craft yet, but compared to early efforts from similarly talented directors, his work is comparatively distinctive. This short still contains the combination of playfulness and meaningful, yet not preachy or overbearing, commentary that would become key to his eventually fully developed style. The story is simple but involving, and revolves around a young couple who are initially delighted about the apartment and services that have been provided for by the Soviet state, then slowly the things they love begin to crumble around them, with the couple becoming increasingly alienated, culminating in a symbol of their love, an ancient tree, being chopped down in order to build more of the furniture etc. that is tearing them apart. The end of the film sees the tenants of the building throwing all their furniture out of their windows, disposing of their problems. Iosseliani has a simple, beautiful sense of storytelling, and though this short is a tad rough around the edges, it is still impressive both in terms of writing (the film does not include any dialogue, incidentally, bar the odd whisper), and in technical terms, as the young Iosseliani clearly understands the art well already and expertly uses elements such as sound to his advantage. 7.5/10"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Qartuli Pilmi"],
      "summaries": ["A young happy couple moves from a poor district to a new housing estate. Their relationship gets progressively worse as their comfort and possessions increase."],
      "budget": 0
   },
   "movielensId": 156079,
   "movielens": {
      "languages": ["ქართული"],
      "releaseDate": "1961-01-01",
      "dvdReleaseDate": null,
      "directors": ["Otar Iosseliani"],
      "runtime": 45,
      "movieId": 156079,
      "title": "April",
      "mpaa": null,
      "actors": [
         "Tatyana Chanturia",
         "Gia Chiraqadze",
         "Akakiy Chikvaidze",
         "V. Maisuradze",
         "A. Jorbenadze"
      ],
      "imdbMovieId": "0247184",
      "originalTitle": "აპრილი",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A critique of materialism, the film is about a young couple who live in a rundown empty apartment. Their love is so strong that it makes the water flow and the electricity work, but when they start purchasing furniture and knickknacks, they fight and grow apart",
      "tmdbMovieId": 83234,
      "avgRating": 3.25,
      "releaseYear": "1961",
      "numRatings": 4,
      "posterPath": "/BMm3KepJrT3DBCXfWU60uEInv2.jpg"
   }
}