{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0420225",
      "video": false,
      "title": "Path of Destruction",
      "recommendations": [
         53850,
         27896,
         30781,
         28506,
         26289,
         43085,
         97903,
         95609,
         111438,
         30402,
         33826,
         105772,
         37035,
         1693,
         30780,
         14105,
         59229,
         102758,
         69075,
         34585
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Katherine Stern",
               "gender": 1,
               "credit_id": "52fe4e9ac3a36847f829bd07",
               "name": "Danica McKellar",
               "profile_path": "/kznd1dtsDGuPddD9N03JvbFN4L9.jpg",
               "id": 65220,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nathan McCain",
               "gender": 2,
               "credit_id": "52fe4e9ac3a36847f829bd0b",
               "name": "Chris Pratt",
               "profile_path": "/n4DD1AYU7WEMNPLga1TxqnHivn1.jpg",
               "id": 73457,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Terry",
               "gender": 2,
               "credit_id": "52fe4e9ac3a36847f829bd0f",
               "name": "Stephen Furst",
               "profile_path": "/6b5XXJCGZCnzSJxMGr8mk3iCf62.jpg",
               "id": 52304,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Colonel Thomas Miller",
               "gender": 2,
               "credit_id": "52fe4e9ac3a36847f829bd13",
               "name": "Franklin Dennis Jones",
               "profile_path": null,
               "id": 86187,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Roy Stark",
               "gender": 2,
               "credit_id": "52fe4e9ac3a36847f829bd1d",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4e9ac3a36847f829bd19",
            "name": "Stephen Furst",
            "profile_path": "/6b5XXJCGZCnzSJxMGr8mk3iCf62.jpg",
            "id": 52304,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.686626,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 239804,
      "vote_count": 7,
      "budget": 0,
      "overview": "The movie opens with a faulty nanotechnology experiment that results in a massive, deadly explosion. The company's CEO manages to sidestep blame by framing a meddling young reporter (Katherine), who now holds the only surviving evidence needed to expose the truth. All the while, the dangerous nanoparticles - having escaped from the explosion into the stratosphere - threaten to destroy nearby cities with wildly destructive weather patterns. Among the chaos of the storms, and on the run from the authorities, Katherine must - with the help of a young scientist - get the evidence to the government to enlist their help before it's too late...and the deadly disaster turns worldwide.",
      "similar": [],
      "original_title": "Path of Destruction",
      "runtime": 120,
      "poster_path": "/atR0pi72y9BQUO6uxTy8FJIul2A.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Armored Productions",
            "id": 50453,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Filmmakers Organisation (UFO)",
            "id": 44177,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sci Fi Pictures",
            "id": 4774,
            "origin_country": ""
         }
      ],
      "release_date": "2005-09-24",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Furst"],
      "runtime": 120,
      "synopsis": "Based on the late Michael Crichtons \"Prey\" novel it explores the use of nano robotics to badly wipe all good traights of poorly supervised and over freedomised technology. As always Crichton embraces technology but fore warns individual thinking over following the flow and the dangers of lack of questioning involved perceptions.",
      "writers": ["Chase Parker"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0420225/",
      "coverLink": null,
      "actors": [
         "Danica McKellar",
         "David Keith",
         "Chris Pratt"
      ],
      "reviews": [
         "Some weird things that look like a swarm of black CGI marks try to take over the world. An accident releases them at some off-shore drilling place which they wreck, and then they wander off to destroy more things. Beautiful Danika McKellar is the most memorable part of the movie. Not only is she incredibly cute, but her acting is top notch in spite of the plot-hole ridden script. She's a journalist who happened to be at the site of the first accident, and apparently there's some icky evil government plot behind the creatures, so a bunch of thugs everywhere are after her. There are numerous clichés of this kind thrown around, but there are a few spots of action that almost make sense in this thing. The science is whack. The things destroy stuff in ways that are bizarre and inconsistent. The way the heroes try to combat the things is almost comical. If you watch this as a joke in an MST3K sort of way, it can be entertaining on that basis. I just hope Danika gets some better roles in the future.",
         "Poor acting, mediocre CGI and technical ignorance abound in this time filler. Some of the plot points don't hold up to even the barest scrutiny. They draft a bimbo reporter to serve as bombardier when they have an entire base of Air Force personnel to pick from? They push for an EMP bomb over a nuclear blast (the biggest EMP bomb there is, BTW) because radiation is too non-directional like shotgun pellets? Dental braces attract lightning? Come on. And why are molecular disassemblers causing storms and hail anyway? Even the bad acting and video game quality CGI could be tolerated with a little technical competence. The underlying concept is OK but the execution is pretty bad. Trying to guess which eastern European country is substituting for Alaska (and the winner is...... Bulgaria!) was fun. And David Keith and Stephen Furst chew the scenery in amusing if one-note performances. Any time you can completely and totally describe a character with two words, like horny yokel or corporate greedhead, you're in trouble. I've watched worse, though. And can't David Keith get any better roles than these second rate Sci-fi channel crapfests? Every month he's in at least one (two this month) of these celluloid WMD's. He used to be somebody. Maybe he figured, \"Hell, I'm already in Bulgaria filming Epoch 2, I'll just knock another one off while I'm over here\". Maybe the beer's cheap. Who knows.",
         "This movie is hilariously bad. From the very beginning, you know you're in for a gut busting ride of bad script writing, acting, directing and gaping plot holes that boggle the mind. If you enjoy laughing at poorly made tripe, than this is your type of movie. If you want to watch a movie with a somewhat believable plot and some point, then you might want to rent something more mainstream. I watched this with my brother last night at 1am on sci fi. We knew what we were getting into. From the absurd dialogue to sheer convenience of certain events, you will get your fair share of 'writing class no-no's'. Anyways, this movie, taken for what it's worth (production value, acting and sheer lunacy), can be tolerated and watched. Once only though. NO ONE has that much time.",
         "\"Path of Destruction\" could have been a first rate suspense disaster movie. Too bad, the SciFi channel threw this one away with cheap theatrics and ludicrous plotting. From her IMDb biography, it is clear Danica McKellar's a genius mathematician. Why not have Danica play the scientist and Chris Pratt play the crusading reporter? Then, at least, including her in the Icarus flight crew would have made sense (What is Icarus? Ah, that requires spoilers). WARNING: SPOILERS Icarus is a prototype EMP-hardened, stealth heavy bomber. Actually, all military aircraft, particularly the stealth variety, are EMP-hardened; but, then we wouldn't have a story, would we? Actually, we would, but not the kind to which the junk food addicted audience of the SciFi channel is usually accustomed. Deleting a few minutes of mindless chase footage would have allowed Danica to dazzle us with her brilliance as she calculated and presented data of the precise trajectory for which the Icarus to deliver the EMP device. This would have also explained why the Titan missile could not have been modified to deliver such a warhead. END OF SPOILERS Instead, most of the two hours consisted of trite, unbelievable situations (Just what is Danica doing on that oil rig?), stock characters, tired exposition, and unconvincing perils. Oh well, at least we get to see Danica bare midriff, in tight jeans and flashing a little cleavage. All we lost is the chance to witness a thought provoking movie about a very serious (and, potentially, very dangerous) subject. I give \"Path of Destruction\" a \"4\".",
         "Although it looks like he did only 2 or 3 days of work on this utter shlockfest of a Sci-Fi Channel piece of junk, poor David Keith has his name attached to this garbage. At least he's working and drawing a check, but it's a long way from the Brubaker days ... This sci-fi mess should be required viewing for all films students: as an example of what a film looks like when things go completely wrong. The production design is all but nonexistent, the direction is sloppy and terrible at the same time, the acting is as bad as it gets, and the script sounds like an 11th grade English class did it as a week-long project, an hour at a time over five days. I'm still waiting for the David Keith / Keith David co-starrer. These are two good actors when they get good material, and they've suffered long enough in the B-movie realm. Tarantino, are you listening?",
         "Path of Destruction was entertaining and had a plot that made sense within itself, so there's not much more you can ask for in a television movie. The nanobots idea is far-fetched, but it is loosely based on stuff I've seen in Scientific American. And isn't that what a sci-fi movie is all about? Making up a story that's not real and then taking it seriously? If you don't like that then don't watch sci-fi. I'm a big Star Trek and Stargate fan, so I accept far-fetched stories quite easily. My measure is if the far-fetched premise is true to itself. In Path of Destruction, the premise was true to itself. Also, Danica is beautiful and gave it her all, Chris Pratt was very good, and Stephen Furst provided the levity. A fun movie to get on DVD or check out on television. Not perfect due to the budget, but not bad at all either.",
         "\"Path of Destruction\" seems to gently mock sci-fi horror movies, although it took nearly an hour of the movie for me to discover this. The characters are generally almost caricatures: the geeky scientist who can't talk to women with his boozing, unreliable (except when it comes to danger) assistant; the Army personnel not listening to the experts but coming through in the end; the wanna-be reporter who (somehow) ends up as both a suspect (framed, of course) and as a hard-hitting network reporter. The special effects were mediocre, apart from the last shot and line of the Colonel(?), and the writers/directors certainly glossed over distances and how access (for instance, Seattle's Space Needle is not downtown, and I doubt that a civilian could just walk into a tent holding the dead with no one questioning her). Further, finding a ride out of the chaos of destruction might not be so easy. The many deaths and destruction are also glossed over\u0097mentioned but not labored over (except for the death of the protagonist's friend). And the two protagonists are remarkably lucky, despite being in danger frequently. Still, it's a fun film, if only to see Chris Pratt play the opposite of his character on \"Everwood\"!",
         "Okay, okay...I know my summary says it all. Another Sci Fi Channel \"original.\" Well, wait just a minute folks; this one actually seems to have a grain of originality. I'm afraid the nanotechnology concept is where it ends, though. Bad acting. Horrible CGI. Ridiculous plot twists. Starring Winnie and directed by Flounder. But this one is so horribly bad, folks, that it's entertaining. We're not talking PLAN 9 bad, but pretty close. Another reviewer indicated that this may have been intentional, but I'm not buying it. For those of you that enjoy this kind of thing, buy some beer, turn off your mind, relax and float down stream.",
         "I thought this movie was a hoot. Seriously. I couldn't stop watching it. I'm not sure if it was because I wanted to hear someone say \"nanobots\" again, or if it was to see Danica McKellar's bare mid-drift and cleavage, who by the way, has seriously grown up since her \"Wonder Years\" days. (Not that anyone who saw her July spread in \"Stuff\" couldn't attest to that already!) I thought that she and Stephen Furst were great. She provided one of the only \"ties to realism\" with a very real and compelling performance, and Stephen Furst provided, you guessed it, comic relief. He hasn't lost his touch since \"Animal House.\" It's a fun movie that thankfully doesn't take itself too seriously, and I recommend it- I had a great time.",
         "I have to wonder if the people that produced this movie, were the same ones that made Steven Segal's \"On Deadly Ground.\" Neither group seems capable of reading a map. They manage to \"crunch\" the 700 miles from Palmer, Alaska to Juneau, Alaska down to an afternoon drive -- and got there driving! At one point, the protagonists say they are \"a few miles outside of Juneau.\" Cute trick; Juneau is landlocked!! There are only two ways in, by boat or plane. Driving there is not a possibility. And I am not going to even get into the numerous other areas involving locations that showed the makers of this movie never bothered to do their homework.",
         "I came across this on Netflix by accident and thought it looked like a decent enough movie. I thought it would be an entertaining way to kill some time on a rainy afternoon. It looked to me like a good enough Sci-Fi disaster-adventure movie. I was wrong. It's waste of your time and a movie so bad it does't even qualify as so bad it's good, but might just crack so bad it's funny. The story -- just kidding -- there isn't one! We have something half resembling a story as some tiny black things escape an oil rig and start killing people in inconsistent ways with no real reasoning behind it. We have an evil corporation responsible who decide to blame the stereotypical clichéd reporter for the black things getting loose. We also have the scientist she teams up with despite her being a fugitive with her face on every news station. That fact is ignored when she sees some unspecified security types and gets past them by... wearing a hat. The film (for want of a better word; calling this a film is an insult to the movie industry) opens with our heroic reporter talking to her friend about his family. Alarm bells should start ringing at this point since that almost certainly means he'll be dead in five minutes. It actually takes less than that time for him to die. The film (or whatever this is) ends with the reporter and scientist flying an EMP to destroy the black things with a colonel. It's already established that there's more than one soldier under his command so why does he take these two non-military individuals with him on a mission that could prove deadly, with the fate of mankind in the balance?! This is exactly the sort of logical failure this (supposed) film expects us to accept as Gospel Truth and believe it would be done like this, which it wouldn't. What is the worst movie of all time? It's hard to say for sure, but this is a definite contender. With extremely poor special effects, scenery chewing overacting \"performances\" and every cliché in the book it is hard to think of many movies worse than this.",
         "On a large oil rig platform, worth $14 million, many important people work. Attractive investigative reporter Danica McKellar (as Katherine Stern) is there, looking to prove oil companies dump chemical wastes. She is close to cracking the case when a horrible incident releases a black fuzz. The black fuzz begins killing workers and triggers a fire. Although she is hit hard on the forehead by a hook, Ms. McKellar is one of the few survivors. In the hospital with a white bandage on her forehead, McKellar realizes the black fuzz was a shady incident; it soon becomes a huge black cloud. Due to being so smart, McKellar is now hunted by oil executives... McKellar escapes from the hospital and seeks help from attractive blond Chris Pratt (as Nathan S. McCain). The duo must try to escape from the clutches of oil executive David Keith (as Roy Stark) and save the world from the black cloud, which is causing weather to run amok all over the planet. Director Stephen Furst (as Louie Myman) serves double duty as Mr. Pratt's unlikely playboy pal. Direction and quick editing provide a little TV Movie excitement during the times when our heroine is on the run, but the nasty cloud is not exciting. There isn't much you can do when your monster special effects are a fuzzy black cloud and a shaky camera. *** Path of Destruction (9/24/05) Stephen Furst ~ Danica McKellar, Chris Pratt, David Keith, Stephen Furst",
         "Most of what I was going to say has already been covered repeatedly. I just had to add the on the nose scenes were too much to bear. For example, a dad trying to get his two sons into nature while they ignored him and played computer games. Seriously you just plonked that there like that without even trying? \"Hey we need a hackneyed cliché for this scene do we have any of those in stock?\" Lets not try to set a scene, lets just straight up tell the viewer like we're the narrator in a kids play. The bad acting, slow deliberate actions and blurting stuff out, it was a waste of time that only Danica made bearable.",
         "The comments from the honorable member from California pretty much sum this movie up, except he missed the most important factor, Danica McKellar. With Danica in the movie, it made it all worthwhile. Heck, I have seen far worse movies with worse actors than this movie. B_Movies are just that, b movies and should be taken with a grain of salt, not torn apart for the lack of technical goodies. Heaven knows we have enough of those already. As for me, I hope it makes it to DVD. The last time I checked Amazon, it wasn't there, not yet anyway. Fans of Danica, let your voices be heard, demand this one make it to DVD. To be fair, it does fall a little short in areas, but good old David is making an effort, but he seems to be doing a lot of bad films, also playing the bad guy way too much. Michael Cory Davis does a good job with what he was handed to work with. Watch with an open mind is all I can.",
         "On one hand I want to actually congratulate the Scifi Channel for making a movie containing a new idea. A giant cloud of flying man-eating nanobots. Dumb but at least it wasn't dragons or giant snakes or man-eating fish which I believe have been featured in every movie made by the Scifi Channel up til now. On the other hand that was the only original thing in it. As pointed out previously, all and I do mean all characters were taken direct from science fiction cliché HQ. Spunky girl reporter, jive talking black guy, corporate baddie, etc. FX were mediocre. Acting as always was atrocious. Basically the usual garbage that Scifi Channel puts out but leaving us with that one glimmer of hope that someday the Scifi Channel will embrace the concepts of originality, imagination, and quality. PS is there a rule that ALL Scifi Channel movies must feature either David Keith or Dean Cain?",
         "This movie is just very fun to watch. The acting is excellent, there is a lot of action, and I enjoyed the humor. The storyline is very interesting, dealing with nano-technology (and thereby weather) gone awry. I had never seen a science fiction film dealing with that subject before. I believe, however, that the actual script could have been better. There are some stock elements in the script that I have seen before, and the stock elements aren't done very well here. But for all that, I was quite entertained by the film. The production values are quite good, particularly for a TV movie. The film locations are at once scenic and foreboding; I was most impressed by the Alaska locales. The acting is first rate and brings a freshness even to the less original scenes.",
         "You can tell where this movie is heading from and its quality right from the opening . A go getting female reporter finds herself on an oil rig and stumbles upon illegal practises by the oil company . The person who gives her this info is black and mentions his wife is pregnant so in the best tried tested and turgid cinematic convention he should expect to die before the end credits . Low and behold he dies in the next scene and this rapid writing out of the character is the only surprise in the entire movie Right away your reminded of several other movies in general and Steven Seagal movies in particular . Just in case you've forgotten all about Mr Seagal and his eco-friendly wastes of celluloid the action cuts to the office of an oil company where executive directors discuss how to maximise their profits and bump off everyone who knows to much . Possibly you might mistake this scene from a fly on the wall reality series called WHEN OIL EXECUTIVE DIRECTORS ATTACK but it's doubtful the meanest mind will buy in to this . The story becomes conspiracy thriller meets disaster movie with a subplot about nanotechnology endangering the human race This is a highly derivative thriller , so much so you do wonder why Michael Chrichton didn't contact his lawyers . That said it's by any means worse than anything else you'll find on the SyFy Channel and Danicia McKeller as go getting reporter Katherine Stern is much easier on the eye than Steven Seagal",
         "I was intrigued by Path of Destruction's concept and felt it had a lot going for it. But it was let down by mediocre execution. The Sci-Fi/SyFy channel have definitely done much worse, at least Paths of Destruction had some better than choppy editing and a good performance from the lovely Danika McKellar. The rest didn't really do all that much for me. The rest of the cast are not as terrible as casts for SyFy have been since, but they do lack McKellar's enthusiasm. David Keith especially seems to be going through the motions. The special effects have also been worse in design, but they do still look cheap and not very easy to tell what they were supposed to be. Not to mention they are poorly-utilized, made to do countless absurd things that only further amplifies SyFy's technical and scientific ignorance. The script is rather thin in structure and doesn't leave the actors much to work with, the story was fine in concept but rather trite and contrived in terms of the finished product and while the characters don't make the mistake of being irritating(like various character from SyFy creature movies, especially, have been) they are clichéd and we don't learn very much about them. On the whole, better than anticipated but didn't deliver much other than three or so things, most of the time SyFy is lucky to get even that so they're lucky this time. 4/10 Bethany Cox",
         "With one exception (the movie \"Lost Voyage\"), the Unified Film Organization film company has not exactly been churning out quality B films. Neither has the film division of the Sci-Fi network. \"Path Of Destruction\" was made both by UFO and the Sci-Fi network! So my expectations weren't exactly high when I sat down to watch it. Actually, it was a bit better than I expected. The special effects were above average, for one thing. True, there are some shoddy CGI shots, but there are also some that are pretty impressive for a low budget. Some non-CGI effects are also pretty good, such as depiciting the bad weather and the destruction it causes. The movie also starts off in an intriguing way... but soon things collapse due to a poorly written script. Among other implausible things, the heroine never goes to the press with the information she has on CD, nor gives it to the military later on. The script has clichéd characters like hard-to-convince authority figures, sneaky corporate types. It also has a character who is killed but miraculously turns up alive later. Nothing new here, either script-wise or film company quality.",
         "She has a few good scenes in the opening and in the train station escaping from the baddies and that's just about it. Everyone else comes off as someone from writing characters 101. The cloud's special effect is ho-hum. There's blatant inconsistencies here that I can't excuse. Her weatherman love interest's skirt chasing co-worker is appears atttacked by the nanites ergo I presume he's dead for most of the film, but no he's not even bruised. Another one is the vicious nanites only eat half of Seattle's buildings. But the most galling of all is the ending where Danica's inexpirenced civilian character is serving as airforce co-pilot to the base chief who's just as inexperienced manning a dangerous mission. 11,000,000 people in California are in danger HELLO?? Hello?? I give it a worth see due to Danica's upbeat performance."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Armored Productions",
         "Curmudgeon Films",
         "Sci Fi Pictures"
      ],
      "summaries": ["The movie opens with a faulty nanotechnology experiment that results in a massive, deadly explosion. The company's CEO manages to sidestep blame by framing a meddling young reporter (Katherine), who now holds the only surviving evidence needed to expose the truth. All the while, the dangerous nanoparticles - having escaped from the explosion into the stratosphere - threaten to destroy nearby cities with wildly destructive weather patterns. Among the chaos of the storms, and on the run from the authorities, Katherine must - with the help of a young scientist - get the evidence to the government to enlist their help before it's too late...and the deadly disaster turns worldwide."],
      "budget": 1800000
   },
   "movielensId": 156083,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-09-24",
      "dvdReleaseDate": null,
      "directors": ["Stephen Furst"],
      "runtime": 120,
      "movieId": 156083,
      "title": "Path of Destruction",
      "mpaa": "",
      "actors": [
         "Danica McKellar",
         "Chris Pratt",
         "Stephen Furst",
         "Franklin Dennis Jones",
         "David Keith"
      ],
      "imdbMovieId": "0420225",
      "originalTitle": "Path of Destruction",
      "genres": [
         "TV Movie",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The movie opens with a faulty nanotechnology experiment that results in a massive, deadly explosion. The company's CEO manages to sidestep blame by framing a meddling young reporter (Katherine), who now holds the only surviving evidence needed to expose the truth. All the while, the dangerous nanoparticles - having escaped from the explosion into the stratosphere - threaten to destroy nearby cities with wildly destructive weather patterns. Among the chaos of the storms, and on the run from the authorities, Katherine must - with the help of a young scientist - get the evidence to the government to enlist their help before it's too late...and the deadly disaster turns worldwide.",
      "tmdbMovieId": 239804,
      "avgRating": 2.5,
      "releaseYear": "2005",
      "numRatings": 1,
      "posterPath": "/atR0pi72y9BQUO6uxTy8FJIul2A.jpg"
   }
}