{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1822239",
      "video": false,
      "title": "Jock of the Bushveld",
      "recommendations": [],
      "backdrop_path": "/6muNYHCvORDlDT3GKqQC3qyCRJc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jock (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c9108171d",
               "name": "Bryan Adams",
               "profile_path": "/exOjr77iCikhWMG46IjGGStmbAG.jpg",
               "id": 56683,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Boatman (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c91081721",
               "name": "William Baldwin",
               "profile_path": "/1G9Y076nnZaobTAtzRefZd8rFNN.jpg",
               "id": 13021,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "George (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c91081725",
               "name": "Anthony Bishop",
               "profile_path": "/iYp4fWIhKufBlnVlcalLDbuM4MO.jpg",
               "id": 203421,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pezulu (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c91081729",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jess (voice)",
               "gender": 1,
               "credit_id": "52fe48229251416c9108172d",
               "name": "Helen Hunt",
               "profile_path": "/ws1ClG9BBUIVLZRYTNKconJn9Sy.jpg",
               "id": 9994,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Young Jock (voice)",
               "gender": 0,
               "credit_id": "52fe48229251416c91081731",
               "name": "Makenzie Hart",
               "profile_path": null,
               "id": 592211,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Basil (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c91081735",
               "name": "Mandy Patinkin",
               "profile_path": "/4yUgIErXR9G70fj6V38YVfzJ4Tv.jpg",
               "id": 25503,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Narrator / Sir Percy Fitzpatrick",
               "gender": 2,
               "credit_id": "52fe48229251416c91081739",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Snarly (voice)",
               "gender": 2,
               "credit_id": "52fe48229251416c91081779",
               "name": "Jason Kennett",
               "profile_path": null,
               "id": 951899,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Claude (voice)",
               "gender": 0,
               "credit_id": "52fe48229251416c9108177d",
               "name": "De Pinna Michael",
               "profile_path": null,
               "id": 1056661,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48229251416c9108173f",
               "name": "Duncan MacNeillie",
               "profile_path": null,
               "id": 592212,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081745",
               "name": "Jim Cox",
               "profile_path": null,
               "id": 71793,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c9108174b",
               "name": "Duncan MacNeillie",
               "profile_path": null,
               "id": 544343,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081751",
               "name": "Duncan MacNeillie",
               "profile_path": null,
               "id": 544343,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081757",
               "name": "Fred L. Smithson",
               "profile_path": null,
               "id": 1056656,
               "department": "Crew",
               "job": "Post-Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "52fe48229251416c9108175d",
               "name": "Klaus Badelt",
               "profile_path": "/j4BGxQq5klTT7hiojMjbcX0hlNU.jpg",
               "id": 122,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081763",
               "name": "Gregg Baxter",
               "profile_path": null,
               "id": 1056657,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081769",
               "name": "Michor Lu",
               "profile_path": null,
               "id": 1056658,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c9108176f",
               "name": "Ric Capecchi",
               "profile_path": null,
               "id": 1056659,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe48229251416c91081775",
               "name": "Dennis Rice",
               "profile_path": null,
               "id": 1056660,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.451038,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         }
      ],
      "id": 81670,
      "vote_count": 5,
      "budget": 0,
      "overview": "Animated-family adventure based on a true story that tells the heart-warming, coming-of-age story of a man and his best-friend, a lovable and fearless dog named, Jock. Set in the Bushveld near what is today the world famous Kruger National Park, this animated family tale is about Jock's adventures with Fritz, his master. Jock escapes death, builds crazy friendships and displays his unrivalled loyalty to Fritz. The story is set in the late 1880s when Africa's mineral richness, teeming animal life and incomparable natural beauty drew and captivated explorers and adventurers from all over the world. A place where big game roamed in their thousands and the wildest tales were true! Jock Of The Bushveld is a great story and the only animal classic to come out of Africa.",
      "similar": [
         56288,
         32147,
         9728,
         40978,
         75421,
         67675,
         103977,
         103968,
         19492,
         63333,
         22559,
         40534,
         81914,
         18735,
         33627,
         51322,
         77485,
         65695,
         68758,
         73303
      ],
      "original_title": "Jock of the Bushveld",
      "runtime": 89,
      "poster_path": "/pWs486QjGRp6Nnjk039XhU12yrw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-07-29",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Four short legs, one huge heart",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Duncan MacNeillie"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Jim Cox",
         "Percy Fitzpatrick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1822239/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ4NzQ4NjU0MV5BMl5BanBnXkFtZTcwOTM2NTk3Nw@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Bryan Adams",
         "Donald Sutherland",
         "Helen Hunt"
      ],
      "reviews": [
         "Assuming that this film was aimed at children and seeing the vitriolic bile that others have used to review this film I felt that I should give a brief defence of this film. Animation was at times basic in parts yes but beautiful in others the human characters were better than the animals for the most part, there the criticism ends while not my cup of tea meaning its south African content of which I am not that knowledgeable I took the film for what it was a children's adventure as for the morals that it teaches that those other critics deem so important I thought there were only two good beats evil and the little guy can sometimes beat the big one. As for a critique of the film I asked my children 4,6,9 and 12 years old who were all glued to the film throughout. Consensus, they all enjoyed the film with no criticism at all. My two year old son was a little scared of George the Baboon, not Gorilla as he was wrongly called by the first critic. It was in keeping with a children's film when there were some fighting scenes with some violence I thought it was tastefully done with blood and gore completely avoided so as not to distress a young audience. All in all you have to be young at heart to critique a children's film or flaws become chasms. My wife and children spoke I listened and observed mixed their opinions with mine and rate the movie at 6 out of 10. My opinion don't expect the earth but don't be afraid to get the sweets and popcorn out and watch it with the children on DVD.",
         "After reading an extensive amount of reviews which largely reflects \"Jock of the bushveld\" in a negative light, I decided to finally make some time to watch it for myself to formulate my own opinion. To my surprise I had to dig deep within to try to endure watching more than 10 minutes of this \"movie\" at a time. I write this review with the intention of briefly discussing the failures of this movie, hence if all you seek is an answer to the question \"Should I even bother watching this movie\" then there is no need to read further, the simple answer is \"NO\". With that being said, I cannot for the life of me begin to understand how such a movie was released \"on the big screen\". Everybody that paid to watch this movie should rightfully be given their money back. This movie was an absolute disgrace to our South African Animation Industry. In all honesty, I have seen far better animation in low budget daytime kiddies shows. It seems as if the creators of this movie were so hell bent on making money from people actually paying to watch it that they didn't even care about the quality of this film. I find it extremely hard to believe that it took them 5 years to come up with THIS. The character designs were extremely and painfully weak and I found it impossible to create a connection with any of the characters, the emotions that the characters displayed lacked any sort of actual human qualities. I can only laugh at the poor character models in this movie. The facial expressions could be described as mediocre at best as they were highly unconvincing, poorly timed and extremely amateur. To my absolute astonishment, there were scenes in the movie where the characters clashed with the props. For example there was a scene where Fitz's hand went right through the bar stool. This is probably the most unacceptable error which an animator can make. Why didn't anybody on the team spot these errors and take a few minutes to fix it. There was also a scene where the chicken's feet were floating. Once again, a few minutes are all it would have taken to fix these small but detrimental errors. The animation was disappointing in every sense of the word. However the award for worst animated character ever goes to the movie's main human character, Fitz. His motions and reactions were so unnatural throughout the entire movie. Let's take one scene out of the movie. Let's use the scene where they are crossing the river and Fitz shoots the crocodile. It is almost as if his body parts are fighting with each other. His reaction and movement is completely unnatural, unrealistic and so poorly timed. I have never in my entire life seen a human move or react like this guy. There is absolutely no fluidity in the animation. I would love to know how much reference was actually used in this film. The way in which he handles his pistol and his recovery after he shoots the crocodile is completely unbelievable and appears to have been animated by a person or multiple people that have minimal(if any) knowledge on animation. There were a few scenes were the camera angles were chosen correctly to give the audience that dramatic effect. However majority of the film the camera seems to be telling a completely different story as it should have. Everything needs to blend together in a scene to give the audience the desired effect and to get that part of the story across. Unfortunately a good camera angle mixed with bad animation (for example) completely ruins everything. 5 years? Really? The supposedly \"dramatic\" fight scene between Jock, his mother and the leopard could have been so much better and so much more effective. Here's what you (the creators) should have done. You'll (the creators) should have taken 10 minutes out of your \"busy\" day and watched the scene from The Lion King where Simba fights Scar and reclaims what is rightfully his. And I can guarantee you that watching those 10 minutes would have highly increased the value of this scene. While I am on the topic of reference, you'll should have also taken some time to watch the part where Mufasa dies and Simba is all alone with nobody to hear his desperate cries for help. Had you'll examined this scene and question as to why this scene evoked so much empathy in the audience and used that knowledge to better the Jocks Mother Dies scene, perhaps it wouldn't have been so easy for the audience to brush off such a vital moment in Jock's life. These are just 2 examples from a single movie that could have highly increased the overall quality of Jock. Can you'll (the creators) imagine the possibility had you'll taken a little more time in those 5 years to focus on the audience and how reaction to the film. We have all come to know who Bryan Adams is, especially due to his brilliant music in animated films. However just because his music or voice is featured in a movie isn't enough to make the movie good. Sadly not even the voice of Bryan Adams could save this train from derailing. There is something that could have been changed in every scene of this movie, be it minor or major, that would have made this movie a part of South African history and not a part that we'd rather forget. This movie could be compared to Apartheid, it happened, it was extremely horrible, now let's all try to put it behind us and move on with our lives.",
         "JOCK (2.4/10) Horrible, amateurish animation makes this a major disappointment. The animation looks like the cut scene animation from an elderly computer game, and any subtlety of lighting or background animation is nearly entirely absent. The motion is often jittery and jerky, and the facial animation of characters can be called basic, to be charitable. The direction of the voice acting often misfires as well, letting down the pace of the story. The story is aimed to be young audience friendly, but it lacks any real emotional involvement with its characters, and the funny bits are, well, not very funny, so little ones are likely to get antsy. As for adults, it is barely survivable. The lyrics are surprisingly bad, coming as they do from Tim Rice, and the songs are just average at best, seeming like first draft efforts that should have been rejected. Come to think of it, the whole film feels like a rough draft, with the voice actors reading through their lines while looking at unfinished animation. The life lessons are suspect as well: we are told that Jock has a big heart, but in almost every situation he finds himself in, he survives because of luck, or the actions of another character, not because of his determination or courage. This has to be one of the biggest letdowns in South African film history, and must have set back the reputation of its film industry globally, which is a grave disservice to the many talented people who do work in the South African film industry. There is no excuse for making a movie this lazy and sloppy other than either arrogance or greed: this level of ineptitude cannot be explained in any other way. Only the ghost of the source material occasionally shining through, and the fact that animals are generally cute saved this from being a 1, but that is no credit to the filmmakers.",
         "Funny, especially a monkey named Basil and a rooster like friend of Jock's. This storyline is more for adults. The narrator of the story sounds really old with a not so good voice. A lot of cruelty in the story, death of dogs mother, fighting between animals and George a very mean gorilla who takes orders from his-\"master\" who owns a store. Most characters are mean and aggressive, too much like real life. The animation is great and goes really well with the singing and dancing of the characters. The music and singing is great too, especially an act by Basil the monkey who used to work in a club with George the gorilla who played the piano. I found some scenes hard to understand at times with conversations going on in the background and other characters talking. The story has a good ending. Story tells of doing the right thing under difficult circumstances. It uses animals and people in different times of their lives. The writers do this with Jock and his owner who is honest, hard working and upstanding in character.",
         "As a masters student in animation, it pains me to watch this film. I loved the original storyline and the renditions told to me as a child but this is missing the essence of the story: the companionship between a man and animal, their adventures in the bush and how the underdog triumphs above all. The Jungle Book, done in 1967 achieves this far and beyond this movie. Story is king, the animation is bad but if the story was any good then they could have gotten away from it- an example of this being \"Hoodwinkd\". The character design and models are poor and unappealing and there so many supporting, useless characters, such as the rooster. The animation is floaty and cringe-worthy, none of the 10 principles seem to be taken into account which places this movie technically behind Snow White, done in 1937. Fitzgerald is possibly the most unappealing animated character I have ever seen, worse than Gurgi in the Black Cauldron. The pitiful voice acting makes me sad, for something that is so 'proudly South African', they literally chose every other accent to be the voices of the characters (including a put-on French accent??). The sad thing is that the emphasis of this production is completely wrong: hair, fabric and other simulations should be the last added extras, and redoing the whole film because Stereoscopic films were starting to become trendy is a terrible waste of money and time. To say \"but my kids enjoyed it\" is a sad excuse for this film, they probably enjoyed the TV-watching experience more than anything else and with so many fantastic 3D animated features done before this production even began (The Incredibles, Finding Nemo, Ratatouille), there are far better things to take your kids to see where you don't have to suffer through in the process. The creators say that the success of this movie depended on the distribution and marketing of the film, which was difficult coming from SA and out of their hands but the real reason why this movie failed was due to the lack of skill, reference and focus. For how could they have taken the most loved South African classic and failed so badly?",
         "This was the worst movie that I have seen in 2011, how could this movie be named \"Jock\". Not only is the animation totally crap but the story is completely different from the novel. This novel is based on a true story and even the 1992 movie was closer to the truth than this movie. I was totally disappointed at this movie that starred the voices of people like Donald Sutherland, Helen Hunt and Arch Bishop Desmond Tutu. The best version of this movie is a South African production that was made in the 80's, based most accurately on the true story. Please find the novel and read it to see the real story, this is one of the best South African legends written.",
         "Jock is an iconic South African story. It has all the right values of courage, bravery, loyalty and adventure to make it a must watch for young kids. Set in the bushveld of South Africa in the time of the Gold Rush in the late 1800's, the characters are from all over the world. They were in a strange land with wild animals and other adversities , seeking their fame and fortune. the story picks up on the adventures of Jock, the runt of the litter and the Transport rider who is gifted him by the local Zulu Chief. The technical quality is not as consistent as it might be but children are not critical like adults and so almost universally seem to enjoy watching this heart warming film. There is good music and the voices of Bryan Adams, Donald Sutherland, Bishop Tutu and Helen Hunt make for a good enough movie for all to watch.",
         "This is the retelling of a well known South African story in 3D animated format and a change of focus to younger viewers. If one expects this to be a faithful retelling of the classic story of Jock of the Bushveld, then one is likely to be disappointed. Unlike the original story, which has Percy Fitzpatrick as the narrator, this is a fresh take on the story told from the point of view the young dog Jock. In essence, this is the story of a young dog coming of age whilst his owner is making his own journey of discovery in the wilderness of early South African. It is a journey of discovery and of overcoming some of the hardships of the environment and the characters that inhabited it. Given that much of the story unfolds against the backdrop of a gold-rush mad, but essentially unspoilt area of South Africa, it is wonderful to see that the feel of the wild game rich savanna and the vibrancy of the early mining towns of that time are so well captured. The animation is not world class - but it does not need to be. The story is well told and the acting is first class. It is particularly heartening to hear the voices of Ted Danson, Helen Hunt and Donald Sutherland in this format. Brian Adams also did a sterling performance of giving the lead character a voice. A cameo by Nobel laureate Archbishop Desmond Tutu is also interesting. This is a movie made to be enjoyed by kids - it achieves this purpose easily.",
         "\"Jock\" is not all that impressive for an animated movie. You'd think that this was a kids movie, but given the storyline, it sort of intended for a more grown up, if not mature, audience, because the storyline is far from a cheerful and silly one that is usually seen in animated movies. Personally I didn't really find the movie all that interesting, because the characters in the movie were fairly plain and sort of one-dimensional. It wasn't really characters that you really got to love and have any type of relationship with. I will say that the CGI animation and the visuals were quite good though, and that is what really works in favor for the movie. If you have smaller kids in the household, you might want to go for a different animated movie, as there is something underlying more sinister to this storyline, which may not be suitable for just anyone. Also the names billed on the voice cast list does impress as there are some nice names here; Donald Sutherland, Helen Hunt, Ted Danson and William Baldwin. More impressively, then they got Desmond Tutu to add his voice to this as well. As for Bryan Adams, well I will leave that untouched, as I have no personal liking or disliking for him or his work in any way. In this day and age, \"Jock\" is nothing impressive and doesn't really move the bar for CGI animated movies in any way."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Jock Animation",
         "Motion Sound & Picture"
      ],
      "summaries": ["3-D animated-family adventure that tells the heart-warming, coming-of-age story of a man and his best-friend, a lovable and fearless dog named, Jock."],
      "budget": 0
   },
   "movielensId": 156137,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-07-29",
      "dvdReleaseDate": null,
      "directors": ["Duncan MacNeillie"],
      "runtime": 89,
      "movieId": 156137,
      "title": "Jock of the Bushveld",
      "mpaa": "G",
      "actors": [
         "Bryan Adams",
         "William Baldwin",
         "Anthony Bishop",
         "Ted Danson",
         "Helen Hunt",
         "Makenzie Hart",
         "Mandy Patinkin",
         "Donald Sutherland",
         "Jason Kennett",
         "De Pinna Michael"
      ],
      "imdbMovieId": "1822239",
      "originalTitle": "Jock of the Bushveld",
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "SWNB0DCIgJk",
         "bEpuiVvY_2A"
      ],
      "plotSummary": "Animated-family adventure based on a true story that tells the heart-warming, coming-of-age story of a man and his best-friend, a lovable and fearless dog named, Jock. Set in the Bushveld near what is today the world famous Kruger National Park, this animated family tale is about Jock's adventures with Fritz, his master. Jock escapes death, builds crazy friendships and displays his unrivalled loyalty to Fritz. The story is set in the late 1880s when Africa's mineral richness, teeming animal life and incomparable natural beauty drew and captivated explorers and adventurers from all over the world. A place where big game roamed in their thousands and the wildest tales were true! Jock Of The Bushveld is a great story and the only animal classic to come out of Africa.",
      "tmdbMovieId": 81670,
      "avgRating": 0.5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/pWs486QjGRp6Nnjk039XhU12yrw.jpg"
   }
}