{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "tap dancing",
            "id": 4345
         },
         {
            "name": "three stooges",
            "id": 10990
         }
      ],
      "imdb_id": "tt0034296",
      "video": false,
      "title": "Time Out for Rhythm",
      "recommendations": [],
      "backdrop_path": "/h9fk3PCXXkeQ5ng3GtPwgwj742H.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Daniel 'Danny' Collins",
               "gender": 2,
               "credit_id": "52fe49749251416c750c8897",
               "name": "Rudy Vallee",
               "profile_path": "/9UOy4lgEt3i9WYByuNXp8CCemro.jpg",
               "id": 83452,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Kitty Brown",
               "gender": 1,
               "credit_id": "52fe49749251416c750c889b",
               "name": "Ann Miller",
               "profile_path": "/b2NSm6PsPXP9KyKts5ElUVOUoVe.jpg",
               "id": 15008,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Frances Lewis",
               "gender": 1,
               "credit_id": "52fe49749251416c750c889f",
               "name": "Rosemary Lane",
               "profile_path": "/1zqL28UQdY7tU9BgYBTIhBE12qB.jpg",
               "id": 33021,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Off-Beat Davis",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88a3",
               "name": "Allen Jenkins",
               "profile_path": "/t2ZumhV1ztWifv0uJHLfSztdUsM.jpg",
               "id": 30005,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Joan",
               "gender": 0,
               "credit_id": "52fe49749251416c750c88a7",
               "name": "Joan Merrill",
               "profile_path": "/ld3wqJ8fFJ0ama5mHHfn55Snpnl.jpg",
               "id": 1130965,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mike Armstrong",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88ab",
               "name": "Richard Lane",
               "profile_path": "/fXoJBOosoQ3zDZPaTN01hKwTQ1h.jpg",
               "id": 111464,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "James Anderson",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88af",
               "name": "Stanley Andrews",
               "profile_path": "/hIAbQZNudj84m4c10AIjUIZgHUr.jpg",
               "id": 34505,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Stooge Moe",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88b3",
               "name": "Moe Howard",
               "profile_path": "/cbPeJ2fIRHEghTWbzeBVGsyyaY.jpg",
               "id": 6777,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Stooge Larry",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88b7",
               "name": "Larry Fine",
               "profile_path": "/6XnCgoRkWEVaFulFUZykMpCyDr9.jpg",
               "id": 89613,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Stooge Curly",
               "gender": 2,
               "credit_id": "52fe49749251416c750c88bb",
               "name": "Curly Howard",
               "profile_path": "/yVhNdlDT8ERAYKUJ9Yh7wWXa7Z2.jpg",
               "id": 89614,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Brenda",
               "gender": 0,
               "credit_id": "52fe49749251416c750c88bf",
               "name": "Blanche Stewart",
               "profile_path": null,
               "id": 1130966,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Cobrina",
               "gender": 1,
               "credit_id": "52fe49749251416c750c88c3",
               "name": "Elvia Allman",
               "profile_path": "/nHTxHcykh8mjEUq2xv7ce2KIzx.jpg",
               "id": 1949,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49749251416c750c8887",
               "name": "Sidney Salkow",
               "profile_path": "/fWUNePRsd1STYmjuucTvjK0xcqz.jpg",
               "id": 91789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49749251416c750c888d",
               "name": "Edmund L. Hartmann",
               "profile_path": null,
               "id": 85841,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49749251416c750c8893",
               "name": "Bert Lawrence",
               "profile_path": null,
               "id": 1127491,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.160885,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 95037,
      "vote_count": 2,
      "budget": 0,
      "overview": "A producer (Rudy Vallee) and his partner clash over two women (Ann Miller, Rosemary Lane) in show business.",
      "similar": [
         872,
         224141,
         11224,
         3933,
         11631,
         134,
         18947,
         46195,
         194662,
         196867,
         11970,
         10020,
         19404,
         254470,
         342473,
         9836,
         114,
         252,
         703,
         812
      ],
      "original_title": "Time Out for Rhythm",
      "runtime": 75,
      "poster_path": "/169Muqa26lTLVA1lRErmx62zEDd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1941-06-05",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A Stage Show and Love Story Too Big for Any Stage... Only Screen could Bring Them To You!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sidney Salkow"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Edmund L. Hartmann",
         "Bert Lawrence"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034296/",
      "coverLink": null,
      "actors": [
         "Rudy Vallee",
         "Ann Miller",
         "Rosemary Lane"
      ],
      "reviews": [
         "This little known Columbia musical stars Rudy Vallee and Ann Miller, but is of great interest due to the appearance of Moe Howard, Larry Fine, and Curly Howard (aka The Three Stooges). Although they are not starred and have nothing to do with the nonexistent plot of the film, the Stooges have a good amount of screen time and what they have is stellar. In this film, they perform their trademark set piece \"Maharajah\". Compare this version to the 1946 version with a sick Curly. Here Curly is high energy and the piece is full of life. It is also superior to their television versions with Shemp and Curly Joe. The Stooges show up often in the film for a handful of gags and they participate in a group of musical numbers. The finale with the Stooges \"au natural\" is priceless. Vallee had developed into a fine character comedian as well and Miller's dancing is always welcome. This is a light, fun budget musical comedy.",
         "Here's another solid 'B' musical, this time not from Universal but Columbia. Universal has bunches of these which have never been released on VHS or DVD (e.g., \"The Merry Monahans(1944), but Columbia is somewhat more liberal with their product. Here is one that could go over well in release. It stars, principally, Rudy Vallee and Richard Lane as theatrical agent partners who butt heads over egotistical chanteuse Rosemary Lane. Lane likes her, Vallee does not - he finds Ms. Lane irritating and is taken with Ann Miller. This picture marks a departure for Vallee, whose character has more depth than most of his other movie appearances, and a meatier role for Richard Lane than at any other time in his career. Though not top-billed, he is the male lead and he is quite good. There are several good musical numbers sung by Joan Merrill, and couple of song-and-dance numbers by Ann Miller, including one with Allen Jenkins (I'll bet you've never seen him sing and dance - and he's pretty good!). Throw in the Three Stooges with some comic routines and you have a pretty fair movie. The music is from the 40's, of the jive and swing variety. Just the right mix of comedy, romance and music to earn a rating of 7. A quality production in all departments.",
         "This hilarious and very hep B grade Columbia musical turns up often on Australian Television, so someone at Channel 9 besides me likes to see it programmed a lot. Good swing/jive music, great Ann Miller tap numbers, some spooky boogie woogie, Allen Jenkins being obnoxious and a lot of very funny 3 stooges routines.....and Brenda and Corvina....yikes! Two female stooges! I would never have believed it. Must have been great fun to see in the 40s in a 2000 seater and a full house. The \"Twiddling My Thumbs Number\" is a lot like the Jesse Matthews \"Dancing On The Ceiling\" number from Evergreen but here its a real toe tapper from Ms Miller.",
         "When Sony/Columbia announced they were going to put their library on DVD, I thought it would probably be a cold day in you-know-where before they issued any of Ann Miller's films. But they have indeed released this film, and not only that, it's digitally remastered so the quality is pristine. No more bootleg copies made from wonky TV broadcasts. This is the film Miller made for Columbia before she got her long-term contract with that studio and it was her performance here that assured the outcome. She got top billing over veterans Rudy Vallee and Rosemary Lane, which must indicate that Columbia already thought highly of her. In this film, Miller dances more than in any of her other Columbia films. So if you're a Miller fan, you will be satisfied with acquiring a copy.",
         "I finally got a copy of this recently thanks to a fellow Stooge fan online. Wow, this was a great movie! This has to be one of the best movies they did when Curly was with the group. For being in a supporting role here the Stooges get a lot of great screen time and they make the most of it. All the stuff they do in this movie is freaking hilarious. Seeing a healthy Curly do the \"Maharajah\" Routine is worth it alone, it makes the one a few years later in \"Three Little Pirates\" with a sick Curly pale in comparison. But that's just the begging of the fun with their gangster impression, the Telegram messengers bit and they even bring back the Melodrama bit they did back in vaudeville with Ted Healy. Then they hit another home run with their Conga Dance at the end with Brenda and Cobina performing with them. Curly was awesome trying to be like Carmen Miranda! I was laughing out loud several times while watching them. I also enjoyed the main storyline because the actors did a great job. Ann Miller was amazing, now that's how you dance! She was something else. All in all, a good, fun movie that doesn't deserve its rare and obscure status. This should have been put on DVD ages ago! If you can catch it on cable or get a copy from someone like I did its worth it.",
         "Before sitting down to watch this film I did remember it vaguely from seeing it on television as a kid in the early sixties. At that time the Three Stooges were in a comeback via television and they were who I knew and remembered. As an adult I saw that Time Out For Rhythm starred Rudy Vallee and Ann Miller. Well we sure saw a lot of Ann Miller dancing in fact she carries the film when the Stooges aren't there. But I was amazed that Rudy Vallee sang not a note and he was first billed. His stuff had to end up on the cutting room floor. Vallee with his stuffy personality was a hard sell as a musical film star. It was right after this film that Preston Sturges cast him in The Palm Beach Story recognizes how his type could be played for laughs and successfully. But the Stooges with their special brand of nonsense really dominate things, especially Curly doing a swami routine. They are equally aided and abetted by Brenda&Cobina a female comedy team that were regulars on Bob Hope's Pepsodent Radio Show. They were a pair of brain dead plain Jane switchboard operators and using them with Moe, Larry, and Curly was a stroke of genius for Columbia. The rather thin plot involved a talent agency headed by Rudy Vallee, Richard Lane, and Allen Jenkins trying to give a break to Ann Miller who is the maid of star Rosemary Lane. Lane has forbidden Miller to seek a career of her own. I think you know where this is going. This is Columbia and not MGM so the production values on this musical are paper thin. But the film is definitely a must for Three Stooges fans.",
         "Time Out for Rhythm (1941) ** 1/2 (out of 4) A great cast elevates this musical-comedy but it can't quite reach a good level. The story itself is pretty simple as business partners (Richard Lane, Rudy Vallee) try to get Frances Lewis (Rosemary Lane) into the big time. The duo eventually break up so the Lane character tries to make Kitty Brown (Ann Miller) a superstar. TIME OUT FOR Rhythm features a pretty good cast full of familiar faces but the plot is just so routine and predictable that the film never manages to be more than a decent \"B\" picture. I think the best thing the film has going for it is the cast, which is certainly good enough to keep film buffs entertained throughout the short running time. Lane is actually pretty good and believable in his role here and Vallee makes for a nice rival. Allen Jenkins is also good in his supporting bit as a piano player and there's no question that Lane is good. Ann Miller easily steals the film in her role and her dancing is certainly the highlight. THe Three Stooges appear throughout the film in brief skits as they are constantly trying to break into show business. I found their skits to be decent but at the same time they take away from the main focus of the story. As I said, there are some problems here with the screenplay being the biggest issue. There's a love conflict that's thrown in but just adds a bunch of boring scenes and you know where they're going to go. The musical numbers are fairly good considering the budget. TIME OUT FOR Rhythm isn't a classic but if you're a fan of the cast then it's certainly worth sitting through.",
         "The good news is for movie buffs who aren't necessarily fans of the Three Stooges; Their running time in this film is similar to the length of one of their shorts. The bad news is for Three Stooges fans expecting them to be the stars. They aren't. And for me, it's the first. The good news for both parties is that what they do here is more than tolerable for the non-fans and obviously some of their funniest gags, which is also good news for their fans who might be disappointed by their lack of screen time. The plot surrounds three partners in a talent agency who disagree about how the business should be run and the interest of agent Richard Lane (in control of the business end) in fickle singer Rosemary Lane. She leaves the business to become the wife of a wealthy man and upon her divorce, aspires to return, making Lane think that they have a future together. This brings conflict because the other partners Rudy Vallee (in control of the artistic end) and Allen Jenkins (the unofficial \"silent partner\") find her unreliable. They find a genuine talent in Rosemary's perky maid (a very young Ann Miller) and the more reliable singer Joan Merrill (as herself) and try to get Richard to see the truth. But as she continues to play passive/aggressive games with him, Richard gets more caught in her seemingly innocent web and the partners have another falling out which can only be resolved by Vallee and Jenkins putting a big show on in Richard's nightclub where the Stooges, who have been interrupting things periodically throughout the film, finally get their big break, and like Ruby Keeler in \"42nd Street\", Miller gets to show off her tap dancing skills to an appreciative audience. In a reverse plot twist similar to \"Kiss Me Kate\", the Stooges hold Rosemary hostage so she can't go on, much like the gangsters in \"Kiss Me Kate\" did to ensure that the leading diva would go on. The Stooges are first seen performing a knife throwing act (with Curley practically blind and creating all sorts of havoc as he trips all over a nightclub setting) while the future \"Sugar Baby\" is first seen, legs only, tapping out on a balcony. Joan Merrill does most of the singing, with Miller providing the dance, including a number with Jenkins. As for Rosemary Lane, her character isn't the bitch of usual such roles (like Bebe Daniels in \"42nd Street\" and sister Lola Lane's in \"Hollywood Hotel\"), but quietly selfish and subtly manipulative. Miller is sweet and likable, and while you long for her to confront her former employer towards the end, she remains every inch the lady. Perennial T.V. sitcom guest-star Elvia Allman and Blanche Stewart are hysterically funny as the man-crazy secretaries in the agency. The songs by Sammy Cahn and Saul Chaplin are enjoyable, if not classics, and are given a bit more rhythm by the presence of Six Hits and a Miss. \"The Boogie Woogie Man\" has some neat photographic effects (similar to Miller's later \"I Gotta Hear That Beat\" from \"Small Town Girl\"). I would have to rank this as the highlight of the Three Stooges Collection released from Millcreek Video, and hope that they continue to release some rarely seen classics that are sleepers seldom seen except by devoted collectors.",
         "I first read of this rare Three Stooges-Moe, Larry, and Curly-feature when reading the book \"The Stooges' Lost Episodes\" which loved the Stooges' routines here especially the \"Maharraja of Vulgaria\" one when Curly hadn't yet suffered his stroke as they say was evidenced when he later performed that in the Three Little Pirates short. Anyway, the Stooges aren't the only highlights here, tap dancer Ann Miller is introed by her glamorous legs first before we then see the rest of her in her maid outfit. No wonder Columbia gave her a long-term contract after she performed in this. Character actor Allen Jenkins Is also on hand doing fine comedy takes as well as occasionally doing a musical number as he does with Ms. Miller here. Crooner Rudy Vallee does occasionally sing with one of the numbers being with Joan Merrill who warbles a couple more solo. Besides the Stooges, Blanche Stewart and Elvira Allman also provide comic relief as secretaries Brenda and Cobina. Watch both teams during the rumba number near the end, what laughs! So on that note, I highly recommend Time Out for Rhythm for all the Stooges fans out there.",
         "With a cast that included Rudy Vallee, Ann Miller, Allen Jenkins and The Three Stooges, this looked like being quite an enticing movie. Unfortunately, however, it turned out to be as dull as ditchwater. The only good thing about it was, in fact, the presence of the extremely talented dancer Ann Miller, who acquitted herself admirably in this, her debut in movies as a dancer. I'm usually quite fond of The Three Stooges, just as long as Shemp Howard was part of the trio. Those others (Curly Howard, Joe Besser and Joe DeRita) hardly ever made me smile, let alone laugh. In this movie it was the unfunny Curly Howard who appeared, and most of the schticks they performed have been seen before in their short subjects. I found Blanche Stewart and Eliva Allman (I've never heard of either of them) as Brenda and Cabrina respectively, most unamusing. With a terrible plot, about two constantly quarreling agents, the movie gave me little watching pleasure. The five stars are strictly for Ann Miller."
      ],
      "genres": [
         "Comedy",
         "Music"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": ["Kitty Brown, the maid of Frances Lewis, a nightclub star, gets a Hollywood contract after Frances' fiance forbids her to appear in the club."],
      "budget": 0
   },
   "movielensId": 156296,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1941-06-05",
      "dvdReleaseDate": null,
      "directors": ["Sidney Salkow"],
      "runtime": 75,
      "movieId": 156296,
      "title": "Time Out for Rhythm",
      "mpaa": "",
      "actors": [
         "Rudy Vallee",
         "Ann Miller",
         "Rosemary Lane",
         "Allen Jenkins",
         "Joan Merrill",
         "Richard Lane",
         "Stanley Andrews",
         "Moe Howard",
         "Larry Fine",
         "Curly Howard",
         "Blanche Stewart",
         "Elvia Allman"
      ],
      "imdbMovieId": "0034296",
      "originalTitle": "Time Out for Rhythm",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A producer (Rudy Vallee) and his partner clash over two women (Ann Miller, Rosemary Lane) in show business.",
      "tmdbMovieId": 95037,
      "avgRating": 0,
      "releaseYear": "1941",
      "numRatings": 0,
      "posterPath": "/169Muqa26lTLVA1lRErmx62zEDd.jpg"
   }
}