{
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 60,
      "synopsis": "Go Mi Nyu is a girl who wants to be a nun, for she has lived in a convent since she was abandoned there with her twin brother Go Mi Nam - whose dream is to become a singer so he can meet their mother - after their father died. One day, a stranger gets in contact with Go Mi Nyu and asks her to impersonate her brother while he recovers from a surgery because he has been chosen to be a part of Korea's famous kpop boy band, A.N.JELL. It becomes a difficult task when she is taken to live with the other three guys from the band and even more difficult because the leader and vocalist, Hwang Tae Kyung is mean to her. However, when he discovers the truth about Go Mi Nyu - along with the guitarist, Shin Woo, though each of them think they're the only ones who know the secret - Tae Kyung tries to protect her, and feelings are born between him and Mi Nyu. A secret binds the fates of the two people, a truth that will test those feelings between them and can bring them apart.",
      "writers": [],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt2074131/",
      "coverLink": null,
      "actors": [
         "Shin-hye Park",
         "Keun-Suk Jang",
         "Yong-hwa Jung"
      ],
      "reviews": [
         "I've only seen the first 5 episodes, having binge watched the entire disc 1 in one night, but I couldn't contain myself. This is a great show. As my title implies, I'm an old school (and old) rocker from the prior century. The concept of the boy band, when it first appeared in the 80s with the likes of New Kids on the Block, was an affront to my existence. And I was also somewhat skeptical of the K-pop and J-pop scenes, and I couldn't imagine that a prettyboy band could be nearly as funny as \"Spinal Tap\" with its raw, ridiculous, flat out nuts musicians. But read on... \"You're Beautiful\", despite its less-than-sensational title, has some of the weirdest characters imaginable. And that's what makes it hilariously entertaining for musicians and non-musicians alike. My favorite character is \"Kang\", the creepy gothboy lead singer who is a germophobe (fear of dirt), agoraphobe (fear of crowds), haphephobe (fear of being touched), ataxophobe (fear of disorder), and on top of it all he's afraid of the dark, too. Despite all this, he maintains a facade of \"cool\" and absolute control which he asserts in a most tyrannical way over the others. Second in command is \"Hwang\" the lead guitarist who is the antithesis of the singer. He is a gentle, wise, friendly Buddha type person who seems better suited for monkhood than a pop band. Bringing up the bottom is \"Jeremy\" the drummer. Alas, poor drummers. They are always portrayed as the dimmest tube in the amp, and Jeremy is no exception. So thick that he can barely count to 4 to bring in the band, Jeremy is a refreshing gust of pure comic relief who balances out the moments of heavy drama (and despite this being a breezy comedy, there can be some heavy moments). And of course there's our hero/heroine \"Go Mi Nam\" who is exactly the way you'd expect a teenage nun to be, having been forced to masquerade as a boy in the nation's top pop band. That brings me to the plot which you probably know already, but I'll recap: A teenage nun ends up masquerading as a boy in the nation's top pop band. But don't let the simplicity of that premise fool you. At times it gets surprisingly complicated and suspenseful, bringing to mind classic tales like Shakespeare's \"Twelfth Night\" which revolve around the hilarity and complexity of cross-dressing. And just as powerful as the funny moments, there are also deeply emotional moments which might elicit a tear from even the most hardened heavy metal rocker. OK, I admit I bawled like a baby twice in 5 episodes. Stop smirking. The overall presentation is cute and family-friendly. But at the same time there are gags that appeal to the adults amongst us. In one episode there's a scene involving the girl using ping pong balls to, how do I say... simulate manhood, and it had me choking with laughter for a solid 2 minutes. I also must say a word about the actual music. I really like it. It's infectious, played well, and the actors even look like they're really playing their instruments. If you're like me, you might be sick of TV & movies where the actors look like they're holding a limp squid rather than a guitar. Well these actors are good enough to fool me. So there you have it, nothing but high praise from me. I'm already sad that it's going to end, but at the same time I imagine this is the kind of show I'd want to watch over & over. Other band based comedies I highly recommend are \"Swing Girls\" (Japanese) about a group of misfits teen girls trying to play jazz, \"A Mighty Wind\" about a hilarious bunch of freaks playing folk music, \"Music & Lyrics\" starring Hugh Grant & Drew Barrymore with some riotous references to 80s pop, and the aforementioned mofo of all musical movies, \"This Is Spinal Tap\". See them all, and consider it the best music education you'll ever receive.",
         "You are Beautiful is a cute 2009 kdrama rom-com worth watching. The story: a twin sister joins a pop band A.N.JELL to cover for her twin brother was set to join the pop band but is recovering from botched plastic surgery. The twin sister reluctantly takes a break from becoming a nun to support her brother's dream of fame which he believes will make it easier to look for their mystery mother. What I liked: a) Pop band lead Hwang Tae Kyung (Jang Geun Suk) is smart, selfish, blunt, and precise. Great facial expressions! Pig-Rabbit was darling. I loved watching this character grow into love and move away from me to we. b) Female lead Go Mi Nam (Park Shin Hye) has her own forthright charm (pig nose when feeling love) but is manipulated due to her love for others and the need to protect. c) Masquerade as a boy is known early to key characters, so the love interests are aware of the situation. This is not Coffee Prince. d) Catchy pop tunes. e) Final declaration of love is satisfying. What I didn't like: a) Villains' manipulations went on too long from the characters Yoo He Yi (Uee) and Tae Kyung's mother (Kim Sung Ryung). I wish these characters had been defanged earlier in the series. b) Go Mi Nam's aunt (Choi Ran) did not appeal to me. I could delete this character. c) Search for the mystery mother got bogged down mid-way, it does come to a conclusion. d) Masquerade as a boy could have been resolved earlier, the rationale felt flimsy after mid-way in the series.",
         "\"You're Beautiful\" is a story about a woman who gets integrated into an idol group after her twin member becomes indisposed due to an injury. It presents 16 episodes about life in the entertainment industry, their struggles with being a celebrity, the main character's adjustment from being a religious member to becoming a singer, family intrigue and romance between the female member and the male group member/s. The drama is said to have a cult following in Asia. Does it live into its hype? Yes,it does. The plot alone is reasonable enough to live into it. IT IS ONE OF THE MOST ROMANTIC Asian DRAMAS EVER MADE!!!Although it does have some similarities with another great drama entitled,\"The First Shop Of The Coffee Prince\", the story is fresh, original and one-of-a- kind. The acting of the cast was good but special mention must be given to both Jang Geun Suk and Uee for their splendid performances as Go Mi Nam/Go Mi Nyo and Yo Hi Yee respectively. Finally, the music was simply spectacular. This drama deserves a 10 out of 10!!!!! It is one of best dramas ever made. A must-see!!!!!",
         "You're beautiful is the drama that got me into dramas. Its a favorite of mine and I've watched it more than once. The characters in this show are well written and well acted. Go Mi-Nyu / Go Mi-Nam: Park Shin-Hye did a great job acting as Mi- Nyu Though it bothered me greatly how weak the character was in personality. Go Mi-Nyu / nam, was quite a nervous wreck for parts of the show but who wouldn't be in that kind of situation? I really loved the chemistry between Mi-Nyu and Tae-Kyeong. I was in suspense throughout the show wondering when Go Mi-nyu's secret was going to be revealed. Hwang Tae-Kyeong: Jang Keun Suk is an amazing actor, he pulled off the arrogant, cold, emotionally wounded germophobe leader very well. Tae-Keyong has many different phobias like the fear of being touched, fear of the dark. Tae-Kyeong can be quite the jerk but hes got some sweet moments too. Jeremy: Lee Hong-Ki did a good job as Jeremy the bubbly playful fun loving best friend type of guy in the group. There is never a dull moment with Jeremy on screen. Unfortunately for Jeremy hes not the brightest. Jeremy is a relief during the heavier parts of the drama. Yes there is some kind of heavy parts. Though the drama is balanced out well with emotions. Kang Shin-woo: Jung Yong-Hwa killed me playing Shin-woo. I fell head over heels for his character. Shin-woo is a very mature, wise, kind, sweet and caring character always supporting Go Mi-Nyu / Nam. The actor does a killer \"you just kicked a puppy infront of me\" face the feels from that is just too much for me. He has some pretty killer outfits in the show too. It came as a surprise to me that Jung Yong- Hwa wasn't just a good singer but also a good actor too. You don't really need me to summarize the story again so I'll just give my thoughts instead. Now you may think it would be a pretty teen centered fangirling drama as its a teenage nun in a all male pop band but You're beautiful has its own special charm. Its got a lot of jokes in it but has heartbreaking moments as well. The storyline stays on a straight path, it doesn't go to a giant mess like some dramas I've watched they stay true to their story. I cried a few times with this show, I bawled like a baby at how romantic the last episode was. I ended up shouting at my screen a few times as well even though I know the characters can't hear me. I got so into it that the drama become lodged deep in the depths of my heart and I reacted out loud without realizing half the time. I thought it'd just appeal to fangirls / boy crazy teens when I went to watch it. But I honestly don't think that way after watching it. Its a drama that sucks you in and you want to watch episode after episode. Though there is a bit of fanservice for the girls (mmm shirtless shin woo) I mean what? I said nothing shh don't tell anyone I know. I think if it was us in Mi-Nyu's shoes we'd have a hard time picking with how amazing all three guys personalities are. (even though Tae- Kyeong can be a jerk he can win a girls heart when hes not so cold.) Honestly I doubt Mi-Nyu could of picked if it was real life and not a show, because they are all wonderful. (I probably would be swayed to shin-woo though) This show I think is perfect for lonely people or maybe just me but it lifted my spirits when I was down I think that has got to count for something right? The music in this show is wonderful, the music always fits with the scenes perfectly. When it comes to the actors actually playing instruments it looks real. Well real enough to fool the average person I don't know if it'd fool someone who knows instruments well. Anyway that ends my first IMDb review. Though I'm not good with reviewing stuff at least I tried? This show has a high rating from me and will always be close to my heart. (I put it as contains spoiler because I'm unsure if any of this is even a tiny spoiler)",
         "One of the classics to watch when you are into K drama, You're beautiful is the story of a nun, who disguises into her twin brother and joins a popular boy group until her brother gets back from the USA. Needless to say, her fellow members fall for her. Though the romance is the main theme, the back stories are okay too and keep the interest high till the end. Plus the whole girl dresses up as a boy is very interesting and common theme for many dramas, as it makes it entertaining for the audience with the thrill of finding her out and all the goofiness that follows her tries to keep her identity hidden. The awkward moments were too many, especially in the beginning, with the lead actress making a total fool of her self in any way possible. The weakest points of this drama, however, was the music, as the same songs were being repeated over and over (the drama the entertainer did the same, though it contained more songs in its soundtrack). Plus, the whole illusion of Gemma's nun mother was simply unnecessary and a little childish. But all in all an okay drama, so 5 out of 10."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["Seoul Broadcasting System (SBS)"],
      "summaries": ["Go Mi-Nyu, a girl about to become a nun, is asked to cover for her indisposed twin brother, Mi-Nam, who's on the verge of becoming a k-idol. To do so, she disguises herself as a boy and joins A.N.Jell, a really popular boy band."],
      "budget": 0
   },
   "movielensId": 156385,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2009-10-07",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 156385,
      "title": "He's Beautiful!",
      "mpaa": null,
      "actors": [
         "Park Shin-hye",
         "Jang Keun-suk",
         "Lee Hong-ki",
         "Uee"
      ],
      "imdbMovieId": "2074131",
      "originalTitle": "美男이시네요",
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ko Mi-Nyeo &amp; Ko Mi-Nam (both played by Park Shin-Hye) are twin brother and sisters. They grew up in an orphanage and never knew their parents.  As a young adult, Ko Mi-Nyeo is set to become a nun. On her way to pick up a ticket for Rome a strange man catches up to her. The man's name is Ma Hoon-Lee (Kim In-Kwon) and he explains that he's the manager for popular boy band \"A.N.JELL\". He also explains that her twin brother Ko Min-Nam, who just joined the band, was seriously injured and sent to America to recover. Ma Hoon-Lee then pleads to Ko Mi-Nyeo to impersonate her brother until he recovers. For her brother's sake, Ko Mi-Nyeo reluctantly agrees to play her brother.",
      "tmdbMovieId": 109346,
      "avgRating": 3.6,
      "releaseYear": "2009",
      "numRatings": 5,
      "posterPath": "/c9MHPosF1AHDbNNihH4ZRbDYwh7.jpg"
   }
}