{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "bowery boys",
         "id": 190483
      }],
      "imdb_id": "tt0047331",
      "video": false,
      "title": "Paris Playboys",
      "recommendations": [],
      "backdrop_path": "/7N9EfADLDX1mfRHDmaTluBoQCGM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Terence Aloysius 'Slip' Mahoney",
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8207ff9",
               "name": "Leo Gorcey",
               "profile_path": "/ntzfWLKlvtMuem9knh5Omx6mkcP.jpg",
               "id": 89989,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Horace Debussy 'Sach' Jones / Prof. Maurice Gaston Le Beau",
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8207ffd",
               "name": "Huntz Hall",
               "profile_path": "/wR3Rlmbwu5gfISwljC1Z0VRSvp4.jpg",
               "id": 33024,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Mimi Du Bois",
               "gender": 1,
               "credit_id": "52fe4b86c3a36847f8208001",
               "name": "Veola Vonn",
               "profile_path": "/2TvPsNwau6nw9EbBWvyVIxJ7lld.jpg",
               "id": 117699,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dr. Gaspard",
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8208005",
               "name": "Steven Geray",
               "profile_path": "/bYHgnE8wv3zXhMoZAAmZjNes7in.jpg",
               "id": 30847,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Vidal",
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8208009",
               "name": "John Wengraf",
               "profile_path": "/ccb8ViZsmwCNogQspG2MfA8WCLl.jpg",
               "id": 12157,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Celeste Gambon",
               "gender": 0,
               "credit_id": "52fe4b86c3a36847f820800d",
               "name": "Mari Lynn",
               "profile_path": null,
               "id": 153456,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Louie Dumbrowsky",
               "gender": 0,
               "credit_id": "52fe4b86c3a36847f8208011",
               "name": "Bernard Gorcey",
               "profile_path": "/3QbC072V9ZXCqO4q1JZ4uvlUSjl.jpg",
               "id": 14034,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8207fdd",
               "name": "William Beaudine",
               "profile_path": "/krWEsV2QBljRm98l2DxtkCPHxjI.jpg",
               "id": 30833,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b86c3a36847f8207fe3",
               "name": "Ben Schwalb",
               "profile_path": null,
               "id": 133434,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8207fe9",
               "name": "Edward Bernds",
               "profile_path": "/n061MNq2CTLDyuxxy24jh8sthFk.jpg",
               "id": 34402,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b86c3a36847f8207fef",
               "name": "Elwood Ullman",
               "profile_path": null,
               "id": 105735,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b86c3a36847f8207ff5",
               "name": "Harry Neumann",
               "profile_path": null,
               "id": 98161,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.001446,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 116190,
      "vote_count": 0,
      "budget": 0,
      "overview": "Sach is the exact double of a famous French scientist who has invented a powerful rocket fuel. Enemy agents, mistaking Sach for the scientist, attempt to kidnap him and get the formula for the fuel.",
      "similar": [
         177252,
         111461,
         94070,
         4011,
         49524,
         166426,
         620,
         62213,
         43074,
         8839,
         77174,
         219,
         10756,
         745,
         122,
         91586,
         201085,
         396422,
         138843,
         242512
      ],
      "original_title": "Paris Playboys",
      "runtime": 62,
      "poster_path": "/AsTOETNGPFENfAhhTXSh6MrPcQl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Allied Artists Pictures",
         "id": 4928,
         "origin_country": ""
      }],
      "release_date": "1954-03-07",
      "vote_average": 0,
      "belongs_to_collection": {
         "backdrop_path": "/foe3kuiJmg5AklhtD3skWbaTMf2.jpg",
         "name": "The Bowery Boys",
         "id": 415931,
         "poster_path": "/q6sA4bzMT9cK7EEmXYwt7PNrL5h.jpg"
      },
      "tagline": "A Zany Laff Spree IN GAY PAREE!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William Beaudine"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "Edward Bernds",
         "Elwood Ullman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047331/",
      "coverLink": null,
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Bernard Gorcey"
      ],
      "reviews": [
         "Paris Playboys finds Leo Gorcey and Huntz Hall off to Gay Paree for the life of a pair on bon vivants. I doubt either could spell that and Gorcey was sure to misinterpret the words. It's all a case of 'mistaken indemnity' as a quartet of continental gentlemen enter Louie's Sweet Shop on the Bowery and are sure that Hall is a famous French rocket scientist who disappeared as he was working on a new fuel formula. As the scientist was known for being quite the ladies man as well as a brilliant researcher, it ain't rocket science to figure out Horace DeBussy Jones isn't him even if he does look alike. Still in a scheme to aid the free world, Hall, Gorcey, and Bernard Gorcey head to Paris in the hope that the ringer Hall might lure out those who are trying to disrupt his work one way or another. Despite Leo Gorcey's usual command of the English language this Bowery Boy film belongs to Huntz Hall in his dual role as the simple minded Satch and the playboy scientist. For Huntz Hall's fans.",
         "Huntz Hall fans will glory in \"Paris Playboys\" (1954), one of the funnier Bowery Boys movies, as their beloved Horace Debussy Jones, better known as \"Sach,\" dominates the story and even puts the abusive Slip Mahoney (Leo Gorcey) in his place a few times. The clever premise has Sach recruited by a team of U.N. scientists to take the place of a missing French scientist, Maurice Gaston Le Beau, who looks just like him. An all-expenses-paid trip to Paris follows, with Slip and soda shop proprietor Louie Dumbrowsky (Bernard Gorcey) going along for the ride (leaving the rest of the \"Bowery Boys\" in nothing more than walk-on roles). Once in Paris, the U.N. team disappears from the film, leaving poor Sach at the mercy of a corrupt pair (Steven Geray and John Wengraf) who've been told Le Beau has amnesia and who spend much of the film trying to jog his memory enough to recall the high-powered rocket fuel formula he'd invented. Sach has the time of his life, adopting a broad French accent and making comic attempts to fit in with the high life Le Beau enjoyed, including fancy French cuisine (\"Finger bowl? My favorite soup!\"); kisses from Le Beau's attractive fiancée, Mimi (Veola Vonn); the attentions of a gaggle of Le Beau's female admirers; alcoholic concoctions at a sidewalk café (with Fritz Feld as the waiter!); and even putting on a beret, sitting at an easel and attempting a painting. The diminutive Louie even gets into the act and dresses up as \"TouLouie-Lautrec.\" Even though the material is never as funny as it ought to be (a frequent problem with Bowery Boys comedies), Hall just runs with it and gives it his all, making for a very entertaining 62 minutes. Things get even better when the real Dr. Le Beau (also played by Hall, of course) shows up after a South Seas vacation spent with a flock of \"native\" girls (who oblige him every time he says, \"You may kiss me\") and confronts all these strangers in his house. Some great farcical situations play out as Sach and Le Beau pop in and out of rooms without knowing the other is there and poor Louie and Slip are ordered about by the outraged Dr. Le Beau, followed by Sach coming in and gently asking what the matter is. Le Beau finally challenges Slip to a sword duel, broken up only when Sach enters and the truth is revealed. Eventually they all have to take on the bad guys who want the rocket fuel. Hall is hilarious in these scenes as he plays grandly against type as the womanizing French scientist who is quite aggressive and quite put out by all the \"foreigners\" in his house, mixing French words with his English in a way that Sach could never hope to have achieved. Hall must have had a ball filming the scenes where he plays the real doctor. He was an actor with great comic gifts that were never fully utilized by his role as second banana to Gorcey in the East Side Kids and Bowery Boys series. He may have reveled in sharing top dog status with Gorcey at Monogram Pictures throughout the 1940s and '50s and he may have lived comfortably off of it (until it all ended), but I can't help but wonder how Hall's career might have turned out had he gotten the chance to work with some great comedy directors along the lines of Preston Sturges or Frank Tashlin, or any of the old hands who guided Bob Hope's comedies at Paramount during Hope's peak years. Don't get me wrong, I love Hall's work in these films and am grateful to have been exposed to so many of them on TV while growing up. It's just that he might have done even greater work under other circumstances.",
         "I was thinking about the opening theme song - 'Hail, Hail, The Gang's All Here' - as the picture got under way. In this one, the gang is basically down to Slip (Leo Gorcey) and Sach (Huntz Hall), with an assist from Louie (Bernard Gorcey), as David Gorcey and Bennie Bartlett never make it past the opening sweet shop scene. With the Bowery Boys series of films nearly at an end, Gorcey and Hall carried almost all the weight in stories that were all too predictable by this time. In this one, Sach is mistaken for a French science professor, Maurice Gaston Le Beau, who's disappeared some months earlier while working on a secret new rocket fuel. The set up allows a couple of United Nations execs from the General Intelligence Agency to whisk Sach back to Paris to finish his invention, while underworld figures attempt to steal the formula. Hall is up for some double exposure in the flick, as he appears in both guises while confounding Slip and Louie as his own alter-ego. Along the way, he's served up a lot of face time with Le Beau's fiancé Mimi (Veola Vonn), and a retinue of girls with no purpose other than to go gaga over Le Beau's reappearance. Even the exiled 'real' LeBeau, stranded on a Pacific Island, is seen calling up kisses from the native girls as they tend to his every need. With the series winding down and the routines having run their course, this one entertains about as well as most, but that's about it. Gorcey's one-liners and malapropisms are sparser here than in earlier films, and he's giving it his best shot. But after all those films together, I wonder why it took so long for Slip to come up with 'Sachula'.",
         "When the film begins, you learn that one of the smartest men in the world, the Frenchman Professor Gaston Le Beau, is missing. However, he turns out to be an exact double of Sach...and soon some UN officials see Sach and think he's the brilliant guy. Well, even when they soon realize it isn't Le Beau, they decide to bring him as well as Slip and Louie to Paris and pretend they've found the Professor. Not surprisingly, Sach behaves like a cretin and his goofiness is explained away by saying Le Beau has amnesia. Unfortunately, there are some killers who are planning on doing away with the Professor...and soon the real Le Beau shows up as well. This installment of the Bowery Boys is typical in some ways for the later films in the series in that it's really all about Sach (Huntz Hall), Slip (Leo Gorcey) and Louie (Bernard Gorcey)...plus calling these middle-aged men 'boys' is a bit ridiculous! It's not so typical because the film is a bit goofier than usual, such as the stupid scene involving the Professor's favorite drink (not one of cinema's finer moments). Plus, while Hall playing Sach is ridiculous, his playing the real Frenchman is REALLY over the top! Of course, folks don't expect Shakespeare or an art film when they see the Bowery Boys!! By the way, I was curious after hearing one of the characters say 'sacre bleu' in the film and I looked up this curse. Apparently, real French folks never say this and it's something foreign films show supposedly French people saying!",
         "The thirty-third Bowery Boys movie has Sach impersonating his doppelganger, a missing French scientist. Of course, Slip and Sach must head to France and we get the usual \"fish out of water\" story that the series had beaten into the ground by this point. Still, the stories were never the strong suit of this series so give it a look if you like Leo Gorcey, Huntz Hall, and Bernard Gorcey doing what they do best, malapropisms and rubberfacing and so on. The other two members of the gang, Chuck and Butch, are left behind when the others go to Paris. This is no big loss since all they usually do is stand around anyway, waiting on their one line per movie (if they even get one). Ultimately, this is a fairly lame picture but it'll pass an hour and change if you're desperate.",
         "***SPOILERS*** We get two Sach's for the price of one in Hurtz Hall playing a duel royal in \"Paris Playboys\" as both the klutzy Sach known formally as Horace Debussy Jones and French rocket scientist and Nobel Prize winning chemist Prof. Maurice Gaston Le Beaue. It's when members of the United Nation Scientific Agency spotted Sach playing with his spoon & fork at Louie Dumbrowsky's Sweet Shop on the Bowery that they mistook him for the missing Prof.Le Beau who disappeared without a trace from his Paris mansion some six months ago. Soon realizing that Sach is really Sach not the professor the agency members talked him into impersonating the missing professor in order throw off a bunch of commie agents who want to kidnap him and get his super secret formula for rocket fuel that he's been working on for the French Government. It's not that long after Sach together with his friends Slip & Louie land in France that the real Prof. La Beaue in far of Tahiti gets the news from a two month old newspaper that he's being impersonated by this impostor Sach who's engaged to marry his sweetheart back in \"The City of Lights\" the sexy Mimi Du Bois! Meanwhile Prof. La Beau's personal physician Dr. Gaspard and his commie agent controller Vidal are planning to kidnap the fake Prof. Le Beau, Sach, and forced him to reveal the secret rocket fuel formula! This all leads to a major explosion when Sach forced to come up with what his kidnappers want added, from the top of his head, the secret ingredient that in fact gives the rocket fuel the kick that it needs: sour cream! Something that even the great Prof. Maurice Gaston Le Beau couldn't come up with! Laugh a minute final with Prof. Le Beau getting back home and being mistaken for Sach by not only Slip & Louie but by his fiancée Mimi Du Bois as well! This all leads to Slip getting his clock cleaned by the professor when he tries to push him around like he does to Sach with the mad as hell Prof.Le Beau turning the tables on him. The best is saved for last with Sach using the secret rocket formula to put Dr.Gaspard commie agent Vadil and their goons squad away when he sets off a toy rocket that he loaded the rocket fuel into. It not only put them away for good but gave the good guys, the French and US Government, the punch that they needed to get ahead in the space race with the Evil Empire the Soviet Union!",
         "Paris Playboys (1954) ** (out of 4) Weak entry in the series has a few good ideas but the execution is rather poor. In the film Slip (Leo Gorcey) and Sach (Huntz Hall) head to Paris after some French scientist mistake Sach for a brilliant professor who has disappeared. Their hopes is that the real professor will see the impersonator, get jealous and come back home but sure enough some bad guys mistake Sach for the real thing. One-Shot Beaudine returned to the director's chair for this thirty-third entry and you can tell due to the slower pacing compared to the previous few films. Once again we're treated to some rather good things but the majority of the film is just deja vu as we've seen this stuff countless times before. It's amazing how little the series has changed even after thirty films as we get the same basic set up and then the familiar conclusion as a group of bad guys get involved and mess everything up. The bad guys here are all poorly written and appear to be rejects from countless other movies that we've all watched. Another problem is that nothing really goes on here until the very end of the film when things finally pick up. When the \"professor\", also played by Hall, shows up the film goes into overdrive and we actually get several laughs because the professor is an insane jerk who is constantly slapping Gorcey around and even Bernard Gorcey is brought to tears by his meanness. Hall finally got his name above the title and next to Gorcey and it was about time as the series is certainly going into his direction. Hall handles Sach with ease but the really impressive bits come from him playing the professor. The French accent is fun but seeing him playing a passionate lover and tough guy was great fun and he pulled it off nicely. It's just too bad they saved this until the end of the movie. Gorcey goes through the motions but is fine and good old Bernard gets some funny moments as well. In the end, Paris PLAYBOYS is pretty much what you'd expect.",
         "United Nations dignitaries spot habitually hapless Huntz Hall (as Horace Debussy \"Sach\" Jones) in the \"Sweet Shop\" and mistake him for a missing French scientist. Before you can say \"Jacques Robinson,\" Mr. Hall is off to Paris with \"Bowery Boys\" leader Leo Gorcey (as Terrence Aloysius \"Slip\" Mahoney) and father Bernard Gorcey (as Louie Dumbrowsky). Abroad, Hall poses as the amnesiac \"Professor Maurice Gaston Le Beau\" and gets to court busty fiancée Veola Vonn (as Mimi Du Bois). Oui, oui! The elder Gorcey has a faulty memory, forgetting the gang's \"Loose in London\" (1953) trip by asserting Hall had never been out of the United States. Hall, now billed equally with Gorcey in the opening credits, continues to dominate the comedy; his \"dual role\" performance and the \"special effects\" give this entry its better moments. Regulars David Gorcey and Benny Bartlett are briefly glimpsed extras. \"Paris Playboys\" is otherwise routine. The next two 1954 films showed they could do better\u0085 and worse. **** Paris Playboys (3/7/54) William Beaudine ~ Huntz Hall, Leo Gorcey, Bernard Gorcey, Veola Vonn",
         "When Horace Debussy Jones comes to believe that he's an amnesiac French painter, he instantly takes on a bad Boyer/Chevalier accent and turns into even more of an idiot than he was with a Bowery accent. Even Louis gets into the act as a new version of Toulouse LaTrec with statuesque beauties on his arm. The result is a silly farce that is perhaps a bit more sophisticated than the others in the series, but that's still not saying much. With French bad guys out trying to prove that he's a fraud, it's obvious where this is going. But I found myself laughing more than normal, and while I do in general have a soft spot for the team of Gorcey and Hall, I have to admit that this is a mediocre series. Of course, the famous French lip popper Fritz Feld appears, but even he can't make a silk beret out of a sow's ear."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Allied Artists Pictures"],
      "summaries": ["Sach is the exact double of a famous French scientist who has invented a powerful rocket fuel. Enemy agents, mistaking Sach for the scientist, attempt to kidnap him and get the formula for the fuel."],
      "budget": 0
   },
   "movielensId": 156527,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-03-07",
      "dvdReleaseDate": null,
      "directors": ["William Beaudine"],
      "runtime": 62,
      "movieId": 156527,
      "title": "Paris Playboys",
      "mpaa": "",
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Veola Vonn",
         "Steven Geray",
         "John Wengraf",
         "Mari Lynn",
         "Bernard Gorcey"
      ],
      "imdbMovieId": "0047331",
      "originalTitle": "Paris Playboys",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Sach is the exact double of a famous French scientist who has invented a powerful rocket fuel. Enemy agents, mistaking Sach for the scientist, attempt to kidnap him and get the formula for the fuel.",
      "tmdbMovieId": 116190,
      "avgRating": 0,
      "releaseYear": "1954",
      "numRatings": 0,
      "posterPath": "/AsTOETNGPFENfAhhTXSh6MrPcQl.jpg"
   }
}