{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "las vegas",
            "id": 14570
         },
         {
            "name": "bowery boys",
            "id": 190483
         }
      ],
      "imdb_id": "tt0049101",
      "video": false,
      "title": "Crashing Las Vegas",
      "recommendations": [],
      "backdrop_path": "/becT0AYWujivqeZrVGyndliH3M6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Terence Aloysius 'Slip' Mahoney",
               "gender": 2,
               "credit_id": "52fe4dd1c3a36847f826f71d",
               "name": "Leo Gorcey",
               "profile_path": "/ntzfWLKlvtMuem9knh5Omx6mkcP.jpg",
               "id": 89989,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Horace Debussy 'Sach' Jones",
               "gender": 2,
               "credit_id": "52fe4dd1c3a36847f826f721",
               "name": "Huntz Hall",
               "profile_path": "/wR3Rlmbwu5gfISwljC1Z0VRSvp4.jpg",
               "id": 33024,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carol LaRue",
               "gender": 1,
               "credit_id": "52fe4dd1c3a36847f826f725",
               "name": "Mary Castle",
               "profile_path": "/kd4abEQyeWqJst6fuvEz64OEWeR.jpg",
               "id": 131619,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tony Murlock",
               "gender": 2,
               "credit_id": "52fe4dd1c3a36847f826f729",
               "name": "Don Haggerty",
               "profile_path": "/f3Oz3fwnZMruux7KMiZw9C6t61j.jpg",
               "id": 40221,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Chuck (as David Condon)",
               "gender": 0,
               "credit_id": "57dc2575c3a368416f000383",
               "name": "David Gorcey",
               "profile_path": "/dcwpRQn8y1x88LrvzclFJ0wUjzr.jpg",
               "id": 120211,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Police Sgt. Kelly",
               "gender": 0,
               "credit_id": "57dc2592c3a368416c00038d",
               "name": "Terry Frost",
               "profile_path": "/icYVIm2FnFJirB4r2cyBnJy8TMu.jpg",
               "id": 121207,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Myron",
               "gender": 2,
               "credit_id": "57dc259ec3a368417b000427",
               "name": "Jimmy Murphy",
               "profile_path": null,
               "id": 165721,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Oggy",
               "gender": 2,
               "credit_id": "57dc25aa9251412ee10003c9",
               "name": "Mort Mills",
               "profile_path": "/1KmPkFX992nBkDBPzg5QoWB8v4K.jpg",
               "id": 45525,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dd1c3a36847f826f72f",
               "name": "Jean Yarbrough",
               "profile_path": "/mggQ51vYqvl78YRdb7DZYRvRpec.jpg",
               "id": 89745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56a7b2b59251413c290014f8",
               "name": "Jack Townley",
               "profile_path": null,
               "id": 196124,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56a7b2ba9251413c2b0014b1",
               "name": "Jack Townley",
               "profile_path": null,
               "id": 196124,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.309284,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 230182,
      "vote_count": 1,
      "budget": 0,
      "overview": "An electric shock enables Sach to predict numbers.",
      "similar": [
         9029,
         3179,
         137093,
         8065,
         298,
         451,
         68716,
         36557,
         1701,
         646,
         681,
         18785,
         104,
         44896,
         256961,
         12208,
         345914,
         124459,
         2453,
         10337
      ],
      "original_title": "Crashing Las Vegas",
      "runtime": 62,
      "poster_path": "/k4At8pWcJWkPie50nzn5hOaFTT6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Allied Artists Pictures",
         "id": 4928,
         "origin_country": ""
      }],
      "release_date": "1956-04-27",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": "/foe3kuiJmg5AklhtD3skWbaTMf2.jpg",
         "name": "The Bowery Boys",
         "id": 415931,
         "poster_path": "/q6sA4bzMT9cK7EEmXYwt7PNrL5h.jpg"
      },
      "tagline": "FRANTIC FUN IN FABULOUS LAS VEGAS! Stacked and Packed with LAFFS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jean Yarbrough"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "Jack Townley",
         "Jack Townley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049101/",
      "coverLink": null,
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Mary Castle"
      ],
      "reviews": [
         "This was the first and last Bowery Boys comedy Leo Gorcey made after the death of his father, Bernard. While it can be seen that he is intoxicated during most of the filming, this film is hysterical. Leo and Huntz recite the old wheezy jokes as if they were brand new. The supporting players are poor, but their ineptitude adds to the comedy. This is the first film with Jimmy \"Myron\" Murphy replacing Bennie \"Butch\" Bartlett. Murphy and David Gorcey actually get to do more than usual and they even get some good punch lines. True, the story revolves around Huntz Hall, but Gorcey has a lot of funny comments to make during the 63 minutes. It is surprising that the film is so funny since neither Ed Bernds nor Elwood Ullman have anything to do with it. Jean Yarbrough directs this time and he makes it look like his work with Abbott and Costello. The Bowery Boys series was never the same after Leo Gorcey left. He was replaced by that \"other guy\", Stanley Clements. Clements is OK, but it's like Joe Besser replacing Shemp (not to mention Shemp replacing Curly) in the Three Stooges. Besser and Clements are good performers, but they just don't have the spark of their predecessors. I always wondered why David Gorcey just didn't get promoted; \"Chuck\" could have been the new chief of the Bowery Boys. Why not?",
         "Crashing Las Vegas marked the end of the line for Leo Gorcey and really the end of the line for the Bowery Boys. When Stanley Clements came on to replace Gorcey he was not really a good foil for Huntz Hall to play off. With the death of Bernard Gorcey the year before who played lovable little Louis Dumbrowsky, a whole lot was taken out of the series as well as out of Gorcey who can't quite get animated enough in this film. The rehashed plot line didn't help either, Allied Artists was plain running out of ideas for the Bowery Boys. An electric shock gives Huntz Hall psychic powers he can pick numbers out of anywhere. Where else to put this power to good use but in Las Vegas. So it's off to Vegas where Frank Sinatra and the rest of the developing Rat Pack were getting started. The film could have used the Rat Pack. Not much to say about Leaving Las Vegas. Slinky Mary Castle becomes the latest in a long line of women to vamp a secret out of Satch. The old badger game is tried on him as well. Only Huntz Hall could be fooled into thinking the first floor is the 21st floor, that was a gag more silly than funny. Sad to say The Bowery Boys were running out of gas.",
         "The Bowery Boys used the mind reading gimmick before (1949's \"Master Minds\"), as well as the gambling theme (1950's \"Lucky Losers\"). This story sort of blends the two as Sach (Huntz Hall) 'electrifies' his brain and suddenly has the ability to see lucky numbers swimming around inside his head. Ever the entrepreneur to cash in on one of Sach's gimmicks, Slip (Leo Gorcey) finagles a one week stay in Las Vegas for himself and the boys to win some big money, and as an aside, help their boarding house lady keep her home. Funny, but I don't recall ever having seen it mentioned where the Bowery Boys lived, so this one might be a trivia treasure - it was Kate Kelly's Furnished Rooms. There's a bit of a sit up and take notice comment made by the Grin Tooth Paste 'Live Like a King' game show host (that's a mouthful), after he describes the three flavors available - vanilla, chocolate and strawberry. Using Grin Tooth Paste will make your teeth come out 'whiter than you'! It came across more as an inadvertent commercial slogan than a racial statement, but a scan of the audience showed an all white audience. Hmmm. There's almost always a slippery female in these stories teaming up with the bad guys, and Mary Castle does the honors here as Carol LaRue. Castle had a recurring role in one of TV's earliest series, 1954's 'Stories of the Century'. She portrayed a government agent who helped railroad detective Matt Clark (Jim Davis) track down infamous outlaws of the Old West. In this picture, she attempts to romance Sach to learn his 'system' for winning at the roulette table, but it backfires, as whenever she's around, Sach's ability goes away. Fans of the Bowery Boys will know that this was Leo Gorcey's last appearance in the franchise, just one film following the accidental death of his father Bernard who portrayed Sweet Shop owner Louie Dumbrowsky. For Leo, it doesn't feel like the same old Slip, as the one liner malapropisms are practically non-existent. Huntz Hall would carry on as Sach for a few more Bowery escapades, and wound up with a fairly long run appearing in TV guest spots and the occasional movie well into the early 1990's.",
         "In a plot rehash, an electrical jolt gives Huntz Hall (as Horace Debussy \"Sach\" Jones) psychic powers, so luckless Leo Gorcey (as Terrence Aloysius \"Slip\" Mahoney) decides to take his pal and fellow \"Bowery Boys\" David \"Condon\" Gorcey (as Chuck) and Jimmy Murphy (as Myron) to Las Vegas. This film featured the last appearance of Mr. (Leo) Gorcey, who had been with the troupe since \"Dead End\" (1937). Gorcey had already become somewhat secondary to Mr. Hall, who would become the series' credited \"star\" with the next film (\"Fighting Trouble\"). Sadly, the noticeably absent \"Sweet Shop\" owner Bernard Gorcey (who played \"Louie\" in the series) had just passed away, following a car accident; he was the father of \"Bowery Boys\" Leo and David Gorcey. In this film, Bowery leader Leo Gorcey is clearly drowning his sorrows, and appears unwell much of the time. In an unrelated milestone, \"Crashing Las Vegas\" featured the first appearance of a new \"Bowery Boy\", with Jimmy Murphy's \"Myron\" replacing Benny Bartlett's departed \"Butch\". Even without the off-screen drama, this is a less than mediocre series entry. ** Crashing Las Vegas (4/22/56) Jean Yarbrough ~ Huntz Hall, Leo Gorcey, Jimmy Murphy",
         "Crashing Las Vegas (1956) ** (out of 4) The forty-first and final Bowery Boys film to feature Leo Gorcey as he's walk from the series after this entry due to a dispute with the studio as well as fighting his own personal demons after the death of his father Bernard who played Louis in the series. In the film Sach (Huntz Hall) gets electrocuted and begins to see numbers in his head. After winning a trip to Las Vegas Slip (Gorcey) decides to use his dumb friend to make a killing but a couple small-time hoods find out about his talents and kidnap him. CRASHING LAS VEGAS is far from the disaster that its reputation would have you believe but at the same time there's no question that the series was running out of gas. It seems this movie is best remembered for the antics of Leo Gorcey, which apparently had him constantly drunk throughout the making of the flick and apparently he destroyed several props and sets. I'm not sure how much of this leaked over into people judging his performance here but many reviews state that it's obvious he's drunk and I really wouldn't say that. There's a sequence towards the end where his foot is up on a bed while he's questioning Hall and he's shaking during this period but outside of this he really didn't act any different from previous films (where he was drinking as well). At times his eyes are obviously bloating but again, you can see this in previous films. In his final appearance he certainly doesn't have enough energy to carry the picture but he is a step up from the previous film. Hall is also apparently bored and he doesn't add any life to the picture either. None of the supporting players are all that memorable and this includes Doris Kemper who is obviously filling in for Bernard Gorcey. CRASHING LAS VEGAS really doesn't feel like a Bowery Boys picture for several reason. One, of course, is the fact that Bernard and his sweet shop aren't here. Another is that director Yarbrough is obviously not too interested in anything going on and the constant long shots really make you feel apart from the film. There's a game show sequence early in the film that isn't too badly done but at the same time it feels as if it belongs in a different film. There's a prison sequence that contains a couple laughs but that's pretty much it. CRASHING LAS VEGAS said goodbye to Gorcey and while it's not a good film to go out on you can at least respect that he did make it to forty-one films, which isn't something very many actors could do.",
         "Leo Gorcey's final Bowery Boys movie (the forty-first in the series!) is a middling affair with a sad story behind it. Between the last film and this one, Leo's father Bernard Gorcey had been killed in a car accident. Bernard, of course, played the lovable Louie the Sweet Shop owner in the series and often stole the scenery from his younger co-stars. But business is business and \"the show must go on,\" so the next Bowery Boys movie went into production. Unfortunately, poor Leo was still reeling from his father's death and perhaps should have been allowed more time to grieve. Throughout the picture, Leo seems 'off.' This is reportedly due to his drinking. He does look rough and seems tipsy, often grinning and shouting his lines for no apparent reason. Behind-the-scenes drama aside, the picture has a tired plot about Sach gaining mental powers which Slip and the boys use to get money for their previously unseen landlady Mrs. Kelly. She was meant to replace Louie but she isn't funny and brings nothing to the films like Louie did. There's little reason to see this unless you're a fan who wants to see all the Bowery Boys movies. There are some laughs here and there but they are few and far between. Mary Castle provides a bit of welcome eye candy. Louie is missed and the movie suffers from his absence. Things would get a lot worse with Leo gone, though. He was one of the original Dead End Kids and really the glue that held the different groups of \"kids\" together (no offense to Huntz Hall). Starting with the next picture, Hall would become the star and Stanley Clements would join the gang. The series would limp along for another two years but would never recover from the loss of Leo Gorcey's Slip Mahoney.",
         "***SPOILERS*** \"Bowery Boy\" Sach suddenly develops supernatural powers by getting himself electrocuted in being able to predict numbers on, among other places, a roulette wheel. it's then off to the races or Las Vegas for the boys to get enough money to keep their sweet and kindly Irish landlady Miss. Kate Kelly from getting evicted from her own rooming house! Winning a free one week vacation, due to Sach's powers of numerology, at Las Vega's swanky Pelican Hotel Sach becomes such a sensation on the roulette tables to the point where he's almost kicked out of the place! That's because he's driving, with his winning streak on the gambling tables, the hotel into bankruptcy. It's when pretty Carol LaRue makes a play for Sach, not because of his looks but his winnings, that his powers of predicting numbers before they come out suddenly disappear! It's when Sach and his \"Bowery Boy\" pals Slip Chuck & Myron realize that Carol was distracting Sach from predicting the outcome of numbers on the roulette table by concentrating on her not the bouncing little white ball that he goes back into action. Hot as ever Sach just about breaks the, by winning an unprecedented 12 spins in a row of the wheel, the bank at the hotel/casino without even breaking a sweat. Of course Carol and her gangster friends Oggy Wiley & Tony have no idea that Sach's powers comes from beyond that of human understanding, the world of the supernatural, and think that Sach had developed a system that they want,if necessary, to beat out of him. As it soon turns out the only persons who get beaten is Carol & Co. who overestimated Sach's mental ability and underestimated his phenomenal luck! ****SPOILERS**** That luck ran out on Sach & the \"Boys\" after breaking the bank at the Pelican hotel/casino. Sach not only lost his powers of predicting numbers, by getting himself re-electrocuted, but lost all his all his winnings, a cool million smackers, as well by turning the fan in his hotel room on! Which ended up blowing the money Sach won away together with the hot & dry desert winds. P.S This was the last appearance in the \"Bowery Boys\" series of Leo Gorcey who played Slip. Gorcey couldn't get over his father Bernard Gorcey's, who played Bowery Sweet shop owner Louie Dumbrowaky, death from the result of injuries he suffered in a traffic accident three months before the movie \"Crashing Las Vegas\" started filming. Hitting the bottle Grocey's health quickly deteriorated to the point where he became a hapless alcoholic and eventually died from cirrhosis of the liver on June 2, 1969; just a day before his 52nd birthday!",
         "At the beginning of the episode, Satch (Huntz Hall) gets electrocuted. But instead of dying, this is a Bowery Boys comedy and so that means that he's suddenly endowed with amazing computational skills. When he and Slip go to see a game show, Satch instantly knows who will be picked each time. After seeing him demonstrate this, Slip insists they head to Vegas to win a fortune in order to help a nice old lady they all know. However, Satch keeps finding ways to win huge fortunate...and then lose it. The second time is to a group of crooks who also convince Satch that he's killed someone--and if he just gives them the money, they'll tell the cops it was all an accident!! By now you've clearly noticed that although Satch's brain is changed, when it comes to common sense he's the same old dope he always was!! And, once they get the money back, once again Satch figures out a way to lose it! Will they ever be able to get the money for the old lady? And, will Satch continue to possess extraordinary computational skills? Overall, this is a very entertaining entry--much more than normal. My only complaint is that the Boys are getting pretty long in the tooth here...and it's no wonder as it came out towards the end of this VERY long series of B-films."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Crime"
      ],
      "productionCompanies": ["Allied Artists Pictures"],
      "summaries": [
         "A shock gives \"Sach\" Jones the ability to visualize numbers before they come up and he and the other Bowery Boys, \"Slip\" Mahoney, Chuck and Myron, head for Las Vegas to win some money for their landlady. There, \"Sach\" wins a fortune at roulette, which convinces crooks Tony Murlock, Sam, and Oggy that he has a system. Using Carol LaRue as bait, they try to get his system and failing, they frame him on a phony-murder charge to blackmail him.",
         "An electric shock enables Sach to predict numbers."
      ],
      "budget": 0
   },
   "movielensId": 156541,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-04-27",
      "dvdReleaseDate": null,
      "directors": ["Jean Yarbrough"],
      "runtime": 62,
      "movieId": 156541,
      "title": "Crashing Las Vegas",
      "mpaa": "",
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Mary Castle",
         "Don Haggerty",
         "David Gorcey",
         "Terry Frost",
         "Jimmy Murphy",
         "Mort Mills"
      ],
      "imdbMovieId": "0049101",
      "originalTitle": "Crashing Las Vegas",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An electric shock enables Sach to predict numbers.",
      "tmdbMovieId": 230182,
      "avgRating": 0,
      "releaseYear": "1956",
      "numRatings": 0,
      "posterPath": "/k4At8pWcJWkPie50nzn5hOaFTT6.jpg"
   }
}