{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "bowery boys",
         "id": 190483
      }],
      "imdb_id": "tt0045926",
      "video": false,
      "title": "Jalopy",
      "recommendations": [],
      "backdrop_path": "/gzieg0b3VZeJfGtwrc4SYjmrUyR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Terrence Aloysius 'Slip' Mahoney",
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207cf5",
               "name": "Leo Gorcey",
               "profile_path": "/ntzfWLKlvtMuem9knh5Omx6mkcP.jpg",
               "id": 89989,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Horace Debussy 'Sach' Jones",
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207cf9",
               "name": "Huntz Hall",
               "profile_path": "/wR3Rlmbwu5gfISwljC1Z0VRSvp4.jpg",
               "id": 33024,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Louie Dumbrowsky",
               "gender": 0,
               "credit_id": "52fe4b85c3a36847f8207d09",
               "name": "Bernard Gorcey",
               "profile_path": "/3QbC072V9ZXCqO4q1JZ4uvlUSjl.jpg",
               "id": 14034,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Skid Wilson",
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207cfd",
               "name": "Robert Lowery",
               "profile_path": "/r65u9YC65MWPw0Ni5nYf651iyOU.jpg",
               "id": 34117,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Prof. Bosgood Elrod",
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207d01",
               "name": "Leon Belasco",
               "profile_path": "/f5zHwIwjSqsyWuia82cDUcocd6N.jpg",
               "id": 95054,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Tony Lango",
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207d05",
               "name": "Richard Benedict",
               "profile_path": "/eEXhzpiIDoZl4QrSYWoyWvRXbJX.jpg",
               "id": 93623,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207cdf",
               "name": "William Beaudine",
               "profile_path": "/krWEsV2QBljRm98l2DxtkCPHxjI.jpg",
               "id": 30833,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b85c3a36847f8207ce5",
               "name": "Jack Crutcher",
               "profile_path": null,
               "id": 1062874,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b85c3a36847f8207ceb",
               "name": "Tim Ryan",
               "profile_path": "/1aLbG01i86jib8tATnC0DyJPrOC.jpg",
               "id": 85996,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b85c3a36847f8207cf1",
               "name": "Ben Schwalb",
               "profile_path": null,
               "id": 133434,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.406346,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 116160,
      "vote_count": 2,
      "budget": 0,
      "overview": "Those wacky Bowery Boys invent a superfast fuel, which will help them win an auto race (isn't this cheating?). However, the fuel is stolen by the bad guys just before the big race...",
      "similar": [
         177252,
         111461,
         94070,
         620,
         4011,
         166426,
         43074,
         62213,
         49524,
         8839,
         77174,
         219,
         10756,
         745,
         122,
         91586,
         138843,
         201085,
         242512,
         396422
      ],
      "original_title": "Jalopy",
      "runtime": 62,
      "poster_path": "/2PNtEsOwg7FFFe9Hq5VrSpKMuS3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1953-02-15",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/foe3kuiJmg5AklhtD3skWbaTMf2.jpg",
         "name": "The Bowery Boys",
         "id": 415931,
         "poster_path": "/q6sA4bzMT9cK7EEmXYwt7PNrL5h.jpg"
      },
      "tagline": "You'll Blow Your Gasket howling at these dizzy whizzes of the racing world!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William Beaudine"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "Jack Crutcher",
         "Jack Crutcher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045926/",
      "coverLink": null,
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Bernard Gorcey"
      ],
      "reviews": [
         "Way back when I used to see the Bowery Boys every Saturday afternoon during my teen years one of my best memories is this particular film and how the boys won a stock car race event driving backwards. Now that may have spoiled it for some, but I think this film may create new legions of fans for them when they see the hilarious climax. Of course you will have to swallow the premise that Huntz Hall has become the laboratory assistant to wacky professor Leon Belasco, but Belasco himself looks like he's enjoying being with the boys. They invent a fuel mix which when Leo Gorcey puts in the car it attains speed that approaches what jets do. And of course villain Robert Lowery would like to get his hands on the speed juice. Gorcey's driving an old Model T which by 1953 would have seen better days by anyone's standards. Where he got the spare parts for it is anyone's guess. But that fuel mix would make any race driver on the NASCAR circuit envious. This is one of the more memorable Bowery Boys flicks, enjoy.",
         "Twenty-ninth entry in the Bowery Boys series and first released after Monogram \"retired\" and began producing pictures exclusively under the Allied Artists name. This one starts off with the Boys once again trying to help Louie out with his bills and, once again, causing more problems than they solve. Slip is working on an old jalopy to enter into a race so he can win the prize money. Things aren't looking so hot until Sach accidentally invents a new kind of fuel that makes the car go faster. So no, this is not the movie that finally earned the Bowery Boys an Oscar nod. But it is fun for what it is, with Leo Gorcey and Huntz Hall having a good time and Bernard Gorcey stealing scenes as Louie the Sweet Shop owner. David Gorcey and Bennie Bartlett are the other members of the gang. Neither does anything to brag about. Jane Easton is the obligatory eye candy. Robert Lowery (looking a little rough for his 39 years) is the bad guy. Leon Belasco is amusing as a tacked-on 'nutty professor' character. It's not one of the best in the series but it is solid. I liked all the old car stuff, even if some of it is reused footage from another film. Funniest scene is probably Sach chasing after his hat and causing turmoil on the racetrack.",
         "This has got to be one of the more rambling, moronic stories in the Bowery Boys lineup, which is saying something because almost all of them had that rambling, moronic thing going for them. On top of that, I kept getting distracted by the movie's main villain Skid Wilson, because whenever actor Robert Lowery appeared on screen, I kept mistaking him for Clark Gable. I'm pretty certain Clark Gable would never be caught dead anywhere near a Bowery Boys flick. One other thing, up until now I presumed the most mathematically challenged film I ever saw was Joe E. Brown's baseball movie \"Elmer, the Great\", but this one gives it a run for the money during the first auto race. Right after the race announcer states that there are eight cars in the race for ten laps (seven cars for sure discounting Slip Mahoney's Meteor #13), a quick count of the cars entering the track shows there are actually eleven in the race. After Slip (Leo Gorcey) runs into a wall with his jalopy, four other cars flip over, one other is disabled, and three collide all at once slamming into a wall. That would be nine right there, but then, a view of discontented drivers about to chase Sach on the race track shows eight cars stranded together on the track! So you figure it out! With all that then, it's not surprising that Slip goes on to win the final race using an impossible to duplicate secret racing formula concocted by Sach (Huntz Hall) and a professor (Leon Belasco) who's screen identity is revealed only on the IMDb credits page for this flick. If it was mentioned in the story I never caught it, but what the heck, re-read my first paragraph. Probably the most dubious pleasure I got out of this one was studying the prices on the wall of Louie's Sweet Shop - Hot Chocolate 10 cents, Any Sundae 15 cents (there's a bargain!), Giant Malt 20 cents, a Cherry Flip or a Strawberry Wonder 20 cents, and if in the mood for lunch, a hot sandwich for 35 cents! Personally, I can remember buying an ice cream cone for a dime back in the Fifties, so I'm pretty sure those prices were right on the mark. Sure beats four bucks for a vanilla cone today, and that's before we even think about sprinkles!",
         "This entry in the long running Bowery Boys series has the boys so dumb that they could barely cross the street let alone drive a race car. But somehow, they manage to get in on the race, with the help of a secret formula that speeds up this jumbled pile of metal posing as a car. Along the way, they of course find themselves involved with shady characters determined to get their hands on the formula including a seductive femme fatale who simply has to wiggle to distract the brains that weren't fully charged. Leo Gorcey Huntz Hall seem determined to outdo the stupidity of previous entries, while Jane Easton isn't the ideal moll. A slim amount of laughs makes it just so-so, and even the usual malapropisms seem to be just laying there like the heap of junk that would not even be worth much as scrap metal.",
         "Jalopy jockey Leo Gorcey (as Terrence Aloysius \"Slip\" Mahoney) hopes to win some much-needed money, in a derby; but, his so-called \"Mahoney Meteor\" slowly crashes into last place. When mugging sidekick Huntz Hall (as Horace Debussy \"Sach\" Jones) accidentally invents a super fuel, \"The Bowery Boys\" think they have what it takes to win the big race. Of course, rival racer Robert Lowery (as \"Skid\" Wilson) wants to steal the secret formula. Regulars Bernard Gorcey (as Louie Dumbrowsky), David \"Condon\" Gorcey (as Chuck), Benny \"Bennie\" Bartlett (as Butch) have more to do than usual - but, with the film series in a tired, repetitive rut, it doesn't mean much. Busty model Jane Easton (as Bobbie Lane) carries the film's main attractions. *** Jalopy (2/15/53) William Beaudine ~ Leo Gorcey, Huntz Hall, Bernard Gorcey, Robert Lowery",
         "Jalopy (1953) * 1/2 (out of 4) Weak entry in the Bowery Boys series has Slip (Leo Gorcey) pretending to be a race car driver but their jalopy isn't going to win them any races. In steps a nutty scientist and Sach (Huntz Hall) who accidentally create a potion that allows their car to fly but soon crooked men are after the formula. It's too bad Sach didn't try to come up with some sort of original formula for this film to follow because this twenty-ninth film is pretty much dead on arrival and never picks up any steam. Once again we're treated to an incredibly boring story that has the boy discovering something that bad people want and sure enough the bad people come looking for it. Towards the end of the film we're greeted with a nearly twenty-minute sequence where nothing happens except for the bad guys to show up and try to force the boys into giving them the formula. This entire sequence doesn't contain a single laugh and it seems as if everything was just being made up as they went along. It's poorly directed, the acting is poor and you can't even see any attempt at them trying to be fresh. It really seems as if everyone involved wished to be somewhere else and they were just flying through the production to get the film in theaters. Even worse is the fact that Gorcey has pretty much disappeared in terms of entertainment. The previous few films had him doing less and less but here he just seems completely out of it and never really seems to be in the mix of things. Hall is pretty much himself but the screenplay does him no justice including a horrible sequence where the idiot Sach walk onto a racetrack and being walking around with all the cars speeding around him. All the films in this series were \"B\" movies but this one here seems a lot cheaper than any of the previous ones. I'm not sure why they decided to cut the budgets or if this trend will continue but hopefully things pick up.",
         "***SPOILERS*** The \"Bowery Boys\" started the year 1953 with a new movie distributer Allied Artists,leaving the bottom basement Monogram Pictures, and on the right track the race track in \"Jolapy\": A movie about speed as in both fast cars and fast women. It's when Slip is entered in a major jalopy race that the person who's jalopy is favorite to win it Skid Wilson gets a bit scared in not knowing just what Slip and his jalopy could do on the race track. Sure enough Skid with the help of his gorgeous girlfriend Bobbie, whom he uses to spy on Slip, finds out that his jalopy \"The Meteor\" is nothing but a pile of junk on wheels. It's not until Slip's friend car mechanic Sach with the help of the nutty Professor Bosgood Elroy accidentally come up with this concoction of what looks like a combination of cranberry juice and seltzer water, from Louie Dumbrowsky's Sweet Shop, is put in Slip's jalopy gas-tank that \"The Meteor\" takes off like a meteorite whenever Slip steps on the gas peddle! What also happens when this strange substance is accidentally spilled on the ground the girl of yours dreams suddenly materializes! Which in Slip's case is the drop dead gorgeous Bobbie Lane! Pretty good race car scenes with Slip behind the wheel driving backwards, or in reverse, in the big race against Skid Wilson's Jalopy, driven by Tony Lango, as the race goes down to the wire with Slip making up at least 20 laps in the last five or so minutes in the movie. It's when the seltzer water, the secret fuels major component, fizzled out it caused Slip's jalopy to go backwards instead of forwards on the race track. With Sach hanging on for dear life on Slip's jalopy it crossed the checkered flag before Tony, who's car was in front for almost the entire race, ever knew what hit him. And it was later at Louie Dumbrowsky's Sweet Shop where the \"Bowery Boys\" were celebrating Slip's victory and the $1,500.00 in prize money that he gave to Louie that Professor Elroy with the help of the secret fuel finally got his wish come true: the girl of his dreams! A mosey looking and skinny bespectacled brunette that he always dreamed about!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Monogram Pictures"],
      "summaries": ["Those wacky Bowery Boys invent a super fast fuel, which will help them win an auto race (isn't this cheating?). However, the fuel is stolen by the bad guys just before the big race."],
      "budget": 0
   },
   "movielensId": 156521,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-02-15",
      "dvdReleaseDate": null,
      "directors": ["William Beaudine"],
      "runtime": 62,
      "movieId": 156521,
      "title": "Jalopy",
      "mpaa": "",
      "actors": [
         "Leo Gorcey",
         "Huntz Hall",
         "Bernard Gorcey",
         "Robert Lowery",
         "Leon Belasco",
         "Richard Benedict"
      ],
      "imdbMovieId": "0045926",
      "originalTitle": "Jalopy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Those wacky Bowery Boys invent a superfast fuel, which will help them win an auto race (isn't this cheating?). However, the fuel is stolen by the bad guys just before the big race...",
      "tmdbMovieId": 116160,
      "avgRating": 0,
      "releaseYear": "1953",
      "numRatings": 0,
      "posterPath": "/2PNtEsOwg7FFFe9Hq5VrSpKMuS3.jpg"
   }
}