{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "new yorker",
            "id": 197574
         },
         {
            "name": "cartoonist",
            "id": 202399
         }
      ],
      "imdb_id": "tt4677300",
      "video": false,
      "title": "Very Semi-Serious",
      "recommendations": [],
      "backdrop_path": "/8MtwhHy1EhB3RpR51kgjVS4YERj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "56482e9a9251413ad5006500",
            "name": "Bob Mankoff",
            "profile_path": null,
            "id": 1536356,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "560dbcacc3a368681700a650",
            "name": "Leah Wolchok",
            "profile_path": null,
            "id": 1517242,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.518846,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 332748,
      "vote_count": 5,
      "budget": 0,
      "overview": "The New Yorker is the benchmark for the single-panel cartoon. This light-hearted and sometimes poignant look at the art and humor of the iconic drawings shows why they have inspired and even baffled us for decades. Very Semi-Serious is a window into the minds of cartooning legends and hopefuls, including editor Bob Mankoff, shedding light onto how their humor evolves.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Very Semi-Serious",
      "runtime": 83,
      "poster_path": "/1HO8H2Gs9AiuxaJrz8Lym2cAybf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American Ninth Art Studios",
         "id": 67912,
         "origin_country": ""
      }],
      "release_date": "2015-04-19",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "A partially thorough portrait of New Yorker cartoonists",
      "adult": false,
      "homepage": "http://www.verysemiserious.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leah Wolchok"],
      "runtime": 83,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4677300/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTcwMTQ0Njg3OF5BMl5BanBnXkFtZTgwODE1MzYyNzE@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": ["Bob Mankoff"],
      "reviews": [
         "To me it's absolutely ridiculous that one man has so much power at The New Yorker to control the content. Yes, I understand that it goes through David Remnick, but if they really want diversity, as they go through pains to show you, then that job should rotate. I also understand that this was made partly to promote Mankoff's book, but they didn't spend enough time with the other cartoonists. Of all the cartoonists, clearly the one they didn't spend enough time with was George Booth. Mr. Booth is in a special class of cartoonists. With a lot of cartoons, it's just about illustrating a punch line. They could be drawn by anyone. Like Mankoff. With Booth, George Price, Edward Steed, and quite a few others the image is funny even before they've written the caption. But George Booth also represents the history of the magazine. Which would be very interesting to hear. And then there is that hierarchy that they insist on displaying before their name. \"This is Joe, and he only has 5 cartoons published. What a loser.\" In general that is the tone of The New Yorker. \"We are the elite. If you don't get our jokes, then you're not smart enough.\" In the end you could see that Mankoff's wife knew that he was full of himself, and wanted to show off for the women.",
         "I know it's trite, but I'll go to my grave believing it's absolutely true: Comedy and the people who do it come from pain. The more, as the say, apparently the merrier. After hanging around comedians during my early days in Hollywood, including \"the Carson people\" and various hangers-on on \"The Tonight Show,\" after writing a package of newspaper stories on what makes comedians comedians, after sitting across from comedians ranging from Bob Hope to Jerry Seinfeld, I'm as sure of it as I can be. (My ultimate assurance on this score came after profiling a psychologist who owned a comedy club _ a working psychologist, not just a guy with a degree or two, who also did stand-up; I'm assuming there was a spillover effect into his therapy sessions.) So, along comes \"Very Semi-Serious: A Partially Thorough Portrait of New Yorker Cartoonists,\" an offbeat documentary now airing on HBO, to totally convince me. Cartoons that run in The New Yorker magazine are, at least in my opinion, really funny. And really what good, effective humor is all about _ registering with people because of a shared understanding, told almost in kind of a code, giving credit to the reader as intelligent beings who can fill in the blanks, which they usually do. This documentary directed by Leah Wolchok, which opened recently in New for an Oscar-nomination qualifying run before airing on HBO, is at once hilarious and sobering, even sad. In a word, exactly like the people who bring us these wonderfully crazy cartoons. Sealing the relationship between humor and pain is the character at the center of this documentary, the magazine's cartoon editor, Bob Mankoff. He leads us through the process, including interviews with wannabe New Yorker cartoonists, getting in some brilliant zingers under his breath (his humor, he acknowledges, like a professional boxer's fists, are a kind of lethal weapon), and only deep into the film do we learn that a year and a half before his son died. We even are allowed to sit in on a cartoon-selection meeting with the magazine's editor-in- chief, David Remnick, sessions which show _ and I speak here as a former journalist _ of how seat-of-the-pants the entire publication process is at root, and what the long odds are of getting cartoons into this iconic magazine. Throughout the documentary, we meet an incredible range of personalities whose cartoons have graced the New Yorker pages. Most must have separate careers to sustain them, thanks in large part to the demise of so many magazines, and most seem to draw their humor from pain and occasionally anger. One woman cartoonist, who hates going outdoors for almost every reason imaginable, recalls that as a child she dealt with her abusive mother by agreeing with her person-to-person but withdrawing to her bedroom to draw sharp (and wicked) responses. Mankoff and Remnick fall head-over-heels in love with the art work of one young cartoonist, who is jarringly revealed as a feather of a man, a whispering blond willow whose favorite color is gray and apparently discovered the magazine while traveling in Vietnam a very few years before, deciding, bang, that's what he wanted to do with his life. Through it all, the laughs, strangely, oddly _ and thankfully _ never subside. It's enough to make you cry. And laugh. A lot. The film, which runs 1 hour and 21 minutes, goes fast, even when it stops to be sad. Great comedy does that."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["American Ninth Art Studios"],
      "summaries": ["The iconic cartoons of The New Yorker have become an instantly recognizable cultural touchstone over the past 90 years, and Leah Wolchock's intimate documentary offers an unprecedented glimpse into the process behind the cartoons. The film follows cartoon editor Bob Mankoff as he sifts through hundreds of submissions and pitches every week to bring readers a carefully curated selection of insightful and humorous work."],
      "budget": 0
   },
   "movielensId": 156704,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-04-19",
      "dvdReleaseDate": null,
      "directors": ["Leah Wolchok"],
      "runtime": 83,
      "movieId": 156704,
      "title": "Very Semi-Serious",
      "mpaa": "",
      "actors": ["Bob Mankoff"],
      "imdbMovieId": "4677300",
      "originalTitle": "Very Semi-Serious",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The New Yorker is the benchmark for the single-panel cartoon. This light-hearted and sometimes poignant look at the art and humor of the iconic drawings shows why they have inspired and even baffled us for decades. Very Semi-Serious is a window into the minds of cartooning legends and hopefuls, including editor Bob Mankoff, shedding light onto how their humor evolves.",
      "tmdbMovieId": 332748,
      "avgRating": 3.83333,
      "releaseYear": "2015",
      "numRatings": 3,
      "posterPath": "/1HO8H2Gs9AiuxaJrz8Lym2cAybf.jpg"
   }
}