{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "russian peasant",
            "id": 193720
         }
      ],
      "imdb_id": "tt0037325",
      "video": false,
      "title": "Summer Storm",
      "recommendations": [],
      "backdrop_path": "/tOh8qN8zmUWvVO8TQEoRviCDwhj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Olga",
               "gender": 1,
               "credit_id": "52fe47f19251416c9107ae07",
               "name": "Linda Darnell",
               "profile_path": "/pdRWFwOAjFKMnw8ErJplqmlhpG8.jpg",
               "id": 30289,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Fedja Michailovitch Petroff",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae0b",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Nadina Kalenin",
               "gender": 1,
               "credit_id": "52fe47f19251416c9107ae0f",
               "name": "Anna Lee",
               "profile_path": "/1dXmlKmat1EI3K5UWItYopiMLJA.jpg",
               "id": 88460,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Urbenin",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae13",
               "name": "Hugo Haas",
               "profile_path": "/viHqjwq8xtYmeDP3z5Dj3YbRCIX.jpg",
               "id": 94198,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Clara",
               "gender": 0,
               "credit_id": "52fe47f19251416c9107ae17",
               "name": "Lori Lahner",
               "profile_path": null,
               "id": 590955,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Kuzma",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae1b",
               "name": "Sig Ruman",
               "profile_path": "/k6w5OsiP6ijrBDACgVn9CzzMri4.jpg",
               "id": 2497,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Polycarp",
               "gender": 0,
               "credit_id": "52fe47f19251416c9107ae1f",
               "name": "John Philliber",
               "profile_path": null,
               "id": 14980,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Lunin",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae23",
               "name": "John Abbott",
               "profile_path": "/lNF9KUxNbriSVl24rUaswangRSs.jpg",
               "id": 24826,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Mrs. Kalenin",
               "gender": 1,
               "credit_id": "52fe47f19251416c9107ae27",
               "name": "Mary Servoss",
               "profile_path": null,
               "id": 106554,
               "order": 8
            },
            {
               "cast_id": 28,
               "character": "Anton Kalenin",
               "gender": 0,
               "credit_id": "570b2c589251410ebf002162",
               "name": "André Charlot",
               "profile_path": null,
               "id": 130222,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Count Alexander Volsky",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae2f",
               "name": "Edward Everett Horton",
               "profile_path": "/yf4MoiK7wnb2dafruUvnVgtuxSN.jpg",
               "id": 2437,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Gregory",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae33",
               "name": "Robert Greig",
               "profile_path": "/ze6PfVLC0AaaoKkwtrJtOLuZkWa.jpg",
               "id": 30262,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Orloff",
               "gender": 0,
               "credit_id": "52fe47f19251416c9107ae37",
               "name": "Paul Hurst",
               "profile_path": "/yVgjaZvnrIJZ6jWzkkkPw3NKvRk.jpg",
               "id": 14664,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe47f19251416c9107ae3b",
               "name": "Charles Trowbridge",
               "profile_path": "/70CRYTOSQWiIgGQsOqN8JKItssK.jpg",
               "id": 96721,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f19251416c9107adbb",
               "name": "Douglas Sirk",
               "profile_path": "/8DugkBzRKKNDcspnZRCd10wlXn7.jpg",
               "id": 46712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f19251416c9107adc1",
               "name": "Douglas Sirk",
               "profile_path": "/8DugkBzRKKNDcspnZRCd10wlXn7.jpg",
               "id": 46712,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107adcd",
               "name": "Rowland Leigh",
               "profile_path": null,
               "id": 31967,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107add3",
               "name": "Robert Thoeren",
               "profile_path": null,
               "id": 3157,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107add9",
               "name": "Seymour Nebenzal",
               "profile_path": null,
               "id": 13902,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f19251416c9107addf",
               "name": "Karl Hajos",
               "profile_path": null,
               "id": 134806,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107ade5",
               "name": "Rudi Feld",
               "profile_path": null,
               "id": 118314,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107adeb",
               "name": "Max Pretzfelder",
               "profile_path": null,
               "id": 32001,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107adf1",
               "name": "Lon Anthony",
               "profile_path": null,
               "id": 590953,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f19251416c9107adf7",
               "name": "Emile Kuri",
               "profile_path": null,
               "id": 17670,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107adfd",
               "name": "Richard de Wesse",
               "profile_path": null,
               "id": 590954,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c9107ae03",
               "name": "Walter Mayo",
               "profile_path": null,
               "id": 31974,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.693582,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 81030,
      "vote_count": 3,
      "budget": 0,
      "overview": "Linda Darnell plays a beautiful Russian peasant in this moody Sirk melodrama, based on Chekhov's \"The Shooting Party.\" Trying to pull herself out of serf-ish poverty, she works her charms on an engaged aristocrat (George Sanders) with tragic results.",
      "similar": [
         421044,
         435126,
         62206,
         37247,
         1538,
         4982,
         9798,
         50620,
         210577,
         2118,
         10530,
         67308,
         75780,
         272,
         238,
         240,
         289,
         947,
         372058,
         329865
      ],
      "original_title": "Summer Storm",
      "runtime": 106,
      "poster_path": "/96OGC3heM32J8BSEhIpHjjqnp41.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Angelus Productions",
         "id": 8232,
         "origin_country": ""
      }],
      "release_date": "1944-07-14",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Douglas Sirk"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Rowland Leigh",
         "Douglas Sirk"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037325/",
      "coverLink": null,
      "actors": [
         "Linda Darnell",
         "George Sanders",
         "Anna Lee"
      ],
      "reviews": [
         "SUMMER STORM is Douglas Sirk's 1944 filming of Chekhov's 'The Shooting Party.' Why this literate, mature and well acted film isn't better known is a mystery to me. Set in Russia just before the revolution, it stars dark and lovely young Linda Darnell as a peasant beauty who's quest for wealth and position leads to tragedy and death. Linda Darnell has one of the best roles of her film career, and she's never been better then she is here. She gives a sensual and sexy performance as the vain and greedy girl who plays several lovers against each other in order get all she can out of each of them. I think Linda Darnell's beauty hardened rather early, and even by A LETTER TO THREE WIVES in 1949, she was already rather sharp and cold looking. But in 1944 and SUMMER STORM, she was still soft and lovely, and one of the most remarkably beautiful brunettes of the era. George Sanders gives another fine performance, in a rather typical George Sanders part, as a snobbish, aristocratic judge who's obsession with the girl ruins his career and his engagement to lovely Anna Lee. His loves scenes with Darnell are quite frank and passionate for their day, and both stars are excellent together. And Edward Everette Horton gives what has to be one of the best performances of his career, in a role quite unlike his usual, as a spoiled, lecherous Russian count. A top notch adult drama in every way.",
         "In 1919, in Russia, the former Count 'Piggy' Volsky (Edward Everett Horton) visits the publisher of the Times Nadena Kalenin (Anna Lee) and brings a manuscript that he had stolen from his friend Fedor Mikhailovich Petroff (George Sanders) to be published. Nadena gives some money in advance and reads the document. In the summer of 1912, the aristocratic and handsome Petroff is the examining magistrate in the summer resort in Chienova in the District Haircker in the Imperial Russia. His fiancée Nadena is spending the summer vacation in Chienova with her parents that own a publishing house. When Petroff visits his friend Volsky, he meets the gorgeous peasant Olga Kuzminichna Urbenin (Linda Darnell) and he falls in love for her. Olga is an ambitious woman engaged to be married with the peasant Anton Urbenin (Hugo Haas) and she flirts with Petroff. When Nadena witness Petroff and Olga together, she calls off her engagement with Petroff. But sooner Petroff learns that the gold-digger Olga is having a love affair with Volsky, cheating not only her husband but also him. When Olga tells to Petroff that she will marry Volsky, a tragedy happens. \"Summer Storm\" is a melodramatic love story based on the novel \"The Shooting Party\" of Anton Chekhov. It is strange to see George Sanders and Linda Darnell in the role of Russian characters and Petroff singing in Russian is funny. The tone of Douglas Sirk's adaptation of this tragic story has exaggerations in the melodrama but is not bad. My vote is seven. Title (Brazil): \"Summer Storm – O Que Matou Por Amor\" (\"Summer Storm – The One Who Killed for Love\")",
         "Count Volsky (Edward Everett Horton) submits a book to be published at the publishing house owned by a former acquaintance, Nadena (Anna Lee). It is an account of the life of his friend and Nadena's one-time boyfriend, Judge Fedor (George Sanders) and it takes place over the summer months. Nadeena reads the manuscript and the story unfolds in flashback as we are introduced to a peasant girl, Olga (Linda Darnell). We follow her journey to obtain wealth and power and the lovers that she cheats in order to obtain her goals. The account is written by Fedor and he does not know that his friend Volsky has sold it for money. How will he react....especially given the contents.....? The film is set in Russia where there is a definite class split. We see Olga climb her way to the top at the expense of those who fall in love with her. Then, there is a dramatic twist - a murder. Who is the killer? The cast are good - Horton is funny, Sanders is both suave and desperate, Darnell is ruthless while Sig Ruman is particularly good as Kuzma, Darnell's husband. The film is a love story that is particularly tense and dramatic at the end. There is a terrible substitute for the word \"lightning\" that is repeated a few times in the film, an attempt to draw in the viewer to sympathize with those that utter it. It fails. If anyone said \"heavenly electricity\" to me, I'd tell them to talk properly. Nevertheless, it's a good film and worth seeing again.",
         "This movie is a stagy Hollywoodish interpretation of a story by Anton Chekhov. While the story itself is good, the problem is that Hollywood converts the story into melodramatic pulp. George Sanders was a great actor but here he is entirely miscast. Playing starstruck was not Mr. Sander's forte. Linda Darnell was beautiful and was also a great actress but casting her as a Russian Russian peasant woman, and a self-centered, illiterate one at that, was a bit of a stretch. Her manipulations were laughable. The idea of her character actually getting over George Sander's character tested the limits of plausibility. Some of the supporting cast were more believable, something however that cannot be said for Edward Everett Horton. One was hard pressed to ignore Mr. Horton's jocular Americanese inflection suggesting a character who might have been more at home at a baseball game anywhere in the United States. All this notwithstanding, it's still a good movie and worth watching because despite the aforementioned flaws, Mr. Sanders is dashing, Ms. Darnell is ravishing, Mr. Horton is amusing, the rest of the cast is wonderful and the movie overall is entertaining, which is the ultimate bottom line.",
         "Early American Sirk film is a little slow but still interesting version of Chekov's The Shooting Party. His signature stylistic elements are not wholly in evidence yet although he uses shadows effectively and he gets excellent work from his cast particularly Edward Everett Horton playing a more complex part then usual. Linda Darnell is most impressive in the first of the bad girl roles in which she excelled. Sirk selected her personally for the film sensing more to her than the feather weight beauties she had been assigned up to that point, although she is almost supernaturally beautiful. She digs deep into Olga's conflicted nature and offers up a passionate portrait of an impulsive girl who causes damage to all that surround her including herself. Unfortunately 20th Century Fox didn't take advantage of the talent she showed and returned her for the most part to films not worthy of her.",
         "This is a film that probably would not have been made or would have been drastically re-worked had it been made earlier or later in history. As the film, at least in part, is based in Soviet Russia and was written by Chekhov (not the \"Star Trek\" one), it's NOT the sort of film Hollywood would have made in the 1930s or after the Cold War began. But, because the Soviet Union was TEMPORARILY an ally of the United States (due to WWII), Hollywood felt comfortable making films showing modern Russia. George Sanders plays a judge living in pre-revolutionary Russia. He eventually meets up with a gorgeous peasant girl (Linda Darnell) and he is absolutely smitten with her. However, what he doesn't know is that she turns out to be a heartless...um....lady. Eventually, after throwing away another woman who would have been a great match, he learns that she is NOT a nice lady. She'd used him and was simply a conniver. What happens next, well, I don't want to spoil the film so I'll say no more. All in all, the biggest star of this film is the very intelligent and interesting script. Also, while Sanders and Darnell (along with Edward Everett Horton) were not big stars, they were all very good actors and more than carried the film--especially Sanders. Well done and worth seeing.",
         "This had to come my way by accident. I must have wanted the 2006 film of the same name, and clicked this by mistake. It's the only reason I can imagine I have it. Well, have it I do, and lets see what we have. Linda Darnell (The Mark of Zorro) was excellent as a gold-digger, and George Sanders (All About Eve) outstanding as the object of her love. Edward Everett Horton was amazingly funny as a Count who was to lose it all in the impending Russian Revolution. Lori Lahner was also a scene stealer in her only film. A tragic love story that makes me glad I got it in error.",
         "Darnell (Olga) does a bang-up job posing seductively as she works her destructive way up the social ladder in czarist Russia. Still, the movie lacks persuasiveness. Now, few actors are better at being both snide and dashing than Sanders (Fedor) who is expert at both, especially in that spiffy uniform. The trouble is this melodrama hinges on soft emotions made intense, and frankly neither Darnell nor Sanders excel at being lovelorn—at least in this movie (contrast with Anna Lee's Nadeena who brings it off nicely). So, we listen to the words and watch the clinches, but it's all minus the inner conviction. Thus, the tragic upshot fails to impact the way it should, despite the touching very last frame. Nonetheless, Horton (Volsky) gets a showcase role as the decadent, yet likable, aristocrat who also manages to steal the show. At the same time, I don't know who plays the petite maid, but she has a look and manner that's quite distinctive. Also, I don't know who the production company, Angelus, is, but they're clearly a cheap-jack outfit. The sets for the shooting party are bare-bones and obvious; at the same time, the entire film has an extremely drab look that cuts against its manorial setting. This is a movie- subject that needs generous, if not lavish, production values as a background, especially to justify Olga's aspirations. Instead, we get the economy version, to put it politely. Too bad a prestige studio like TCF didn't take on the project. Anyway, I agree with another reviewer that the movie is basically for fans of Sanders and Darnell, with Horton as an amusing bonus. (In passing—note the photo of Lenin in the publisher's office. It may be the only Hollywood appearance of the Bolshevik revolutionary outside of Cold War contexts.)",
         "There are many remarkable circumstances in this film. Anton Tchekhov died in 1904. The film starts in 1919 and then goes back to 1912, not any earlier. It's a Tchekhov story all right, all the melancholy and deep knowledge of human nature is there, all characters are in style and very Tchekhovian, in fact, the film couldn't be more Tchekhovian, and yet it goes far beyond what Tchekhov ever could imagine, as if it was written by Tchekhov after the revolution. It's a very sad story framed by typical hilarious Tchekhovian human comedy. Both Edward Everett's priceless character of an old befuddled aristocrat and Linda Darnell's scandal beauty are thoroughly comedians, like also her hilarious father (Sig Ruman, in one of HIS best performances,) and all the local people around them. The only tragic character is George Sanders as judge Petrov, and, to some degree, his fiancée Anna Lee, who sees the tragedy but can't do anything about it, the only one to get out of it whole. George Sanders was an exiled Russian aristocrat himself, and this is one of the few films in which he gives his original character away. He later learned such perfect English that no one could suspect he had been anything but an English snob, but to his misfortune he got out of the Russian revolution alive. All his characters were generally bitter frustrated superior losers usually digging their own graves by pride and conceit, with a few exceptions, like in Hitchcock's \"The Foreign Correspondent\". Here he is the victim of his own uncontrollable destiny, as he finds himself unable to rule his own passion. This film is his tragedy, he actually gives a song in Russian at one point, while the other characters, above all Linda Darnell and Edward Everett Horton, take over the film. You must accept her irresistible beauty, and you must understand how both Horton and Sanders had to give in to it. She is simply shamelessly, outrageously and overbearingly beautiful, such a career just has to come to a dreadful end, while poor befuddled Horton just can't understand anything of what is happening. In spite of his own tragedy, which doesn't seem to become him much, as he is incorrigible in his own way, he remains the one surviving comedian of this ludicrous but very melancholy tragedy, like in fact a human epitaph on the fallen old Russia.",
         "This movie pretends to be an adaptation of The Shooting Pary by Tchehov. However it begins and ends after the 1916 revolution. This political twist -the States and Russia were allies against Germany- it is really amazing. On the other hand, the settings are really very poor and Douglas Sirk tries hards but what he and his collaborators give us is really poor. Miss Darnell is an agreeable actress but her Russian peasant is our of her possibilities. As for Mr Sanders singing in Russian, well, how can you take him seriously. The odd thing is that these two actors were employees of Fox but this is not the company producing the film. What it is logical to suppose is that this artifact was in the line of propaganda about an ally in that year."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Romance"
      ],
      "productionCompanies": [
         "Angelus Pictures",
         "Angelus Productions",
         "Nero Films"
      ],
      "summaries": [
         "In this filmed Chekhov adaptation, Olga is an alluring peasant woman who lures cynical aristocrat Fedor away from his milquetoast fiancée, with tragic consequences.",
         "In 1919, in Russia, the former Count 'Piggy' Volsky visits the publisher of the Times Nadena Kalenin and brings a manuscript that he had stolen from his friend Fedor Mikhailovich Petroff to be published. Nadena gives some money in advance and reads the document. In the summer of 1912, the aristocratic and handsome Petroff is the examining magistrate in the summer resort in Chienova in the District Haircker in the Imperial Russia. His fiancée Nadena is spending the summer vacation in Chienova with her parents that own a publishing house. When Petroff visits his friend Volsky, he meets the gorgeous peasant Olga Kuzminichna Urbenin and he falls in love for her. Olga is an ambitious woman engaged to be married with the peasant Anton Urbenin and she flirts with Petroff. When Nadena witness Petroff and Olga together, she calls off her engagement with Petroff. But sooner Petroff learns that the gold-digger Olga is having a love affair with Volsky, cheating not only her husband but also him. When Olga tells to Petroff that she will marry Volsky, a tragedy happens."
      ],
      "budget": 0
   },
   "movielensId": 156714,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-07-14",
      "dvdReleaseDate": null,
      "directors": ["Douglas Sirk"],
      "runtime": 106,
      "movieId": 156714,
      "title": "Summer Storm",
      "mpaa": "",
      "actors": [
         "Linda Darnell",
         "George Sanders",
         "Anna Lee",
         "Hugo Haas",
         "Lori Lahner",
         "Sig Ruman",
         "John Philliber",
         "John Abbott",
         "Mary Servoss",
         "André Charlot",
         "Edward Everett Horton",
         "Robert Greig",
         "Paul Hurst",
         "Charles Trowbridge"
      ],
      "imdbMovieId": "0037325",
      "originalTitle": "Summer Storm",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["BCkE7zp9MiU"],
      "plotSummary": "Linda Darnell plays a beautiful Russian peasant in this moody Sirk melodrama, based on Chekhov's \"The Shooting Party.\" Trying to pull herself out of serf-ish poverty, she works her charms on an engaged aristocrat (George Sanders) with tragic results.",
      "tmdbMovieId": 81030,
      "avgRating": 3.5,
      "releaseYear": "1944",
      "numRatings": 1,
      "posterPath": "/96OGC3heM32J8BSEhIpHjjqnp41.jpg"
   }
}