{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0365914",
      "video": false,
      "title": "A Way of Life",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4acfc3a36847f81e2f21",
               "name": "Amma Asante",
               "profile_path": "/uG9m8jQHTQXDV6HSeFnbo4f7C9z.jpg",
               "id": 1193597,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "58bef2bfc3a36866a5061927",
               "name": "Amma Asante",
               "profile_path": "/uG9m8jQHTQXDV6HSeFnbo4f7C9z.jpg",
               "id": 1193597,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.077325,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 110282,
      "vote_count": 2,
      "budget": 0,
      "overview": "At 17 LeighAnne Williams has a six month old baby to look after, with only the help of three teenage squatters who flog stolen gear to make ends meet. A neighbour (actually from Turkey) across the street becomes target to her growing paranoia that Social Services are going to take her daughter, Rebecca, away from her. Her behavior becoming increasingly desperate as her delusions over her neighbor grow.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "A Way of Life",
      "runtime": 91,
      "poster_path": "/tCEfGtXpz5lzU2eZequXnzLXOeH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2004-11-12",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amma Asante"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Amma Asante"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0365914/",
      "coverLink": null,
      "actors": [
         "Stephanie James",
         "Gary Sheppeard",
         "Nathan Jones"
      ],
      "reviews": [
         "A Way of Life I was not prepared for what I seen in this film. I went into this with the impression that it was going to be some movie about struggling teenagers who turn out alright in the end. I thought that I would leave the cinema saying, 'well\u0085that was nothing special.' I was completely wrong. It was one of the best films I've seen all year. Directed by first timer Amma Asante, it is the harsh truth of the state of lower class citizens, one of the most important messages ever sent out of a film. You will leave more determined to be a better parent in the future. The film draws you in straight away as it begins with a gang of teenagers physically assaulting a middle aged man in the middle of the street. The ferociousness of the beating their giving out made me sit up straight away and take notice. The film then travels back to the events leading up to this attack. At the beginning we are introduced to Leigh-Anne (Stephanie James). Leigh-Anne is a frustrated, angry teenage mother living in a council flat with no electricity. Her mother killed herself when Leigh was just a child and she also, along with her brother, suffered constant abuse form her father. So with only her brother and his two friends to support her, and with very little income coming in, times are hard for Leigh. Her only reason for living is her daughter Rebecca, and she will do anything, literally, to protect her. Her Grandmother Annette (Brenda Blethyn) feels that she would be more suited to look after Rebecca, which leads to several run ins between the two. Annette isn't the only person she has trouble with, due to her jealousy and racist standpoint, Leigh is involved in constant confrontations with Turk Hassan Osman (Oliver Haden). Another reason for this hatred towards Osman is Leigh is jealous of the relationship he has with his daughter Julie (Sara Gregory). In one scene we see an example of the lengths Rebecca will go to help her daughter- no matter how brutal. She acts as a pimp to gain £30 off a man who comes looking for sexual service. Rather than have sex with the man herself, she convinces a girl younger than herself, to seal the deal. \"Just open your legs and let him do the rest'. It is one of the most startling and shocking scenes of the film. Leigh's brother Gavin (Nathan Jones), and his two friends Robbie (Gary Sheppeard) and Stephen (Dean Wong), are always there for Leigh. But that usually involves crime and anti-social behaviour. The four of them as a group run riot and it's when they are together we see that despite being a committed mother, Leigh is far from an innocent little girl. Leigh is regularly visited by a social worker (Marged Esli), and after seeing her chatting to hated neighbour Hassan, she is convinced that Osman is plotting to get her baby taken away from her. One of the most significant parts of the film is when baby Julie is burned by a candle at home. This leads to a string of events that leads to the tragedy that we caught a glimpse of at the start. The aftermath of this is even more tragic. This is a film that will leave you thinking of the youth out there today and have you deciding whether or not you sympathies with Leigh Anne. I didn't. All the cast in this film played their roles very well but for me Stephanie James, in the role of Leigh-Anne, stood out for me. Not because she was the lead character but due to the fact that for someone making her on-screen debut and performing so well, I feel that that takes a lot and I'm pretty sure this will not be the last we see of her. Overall I feel that this is a must see film for all ages of 15 and up, I felt that it should have had an 18 certificate, if not for its stance as a very good movie, but for it's importance.",
         "A Way of Life is an extraordinary and disturbing film.It seems scarcely credible that the director is making her debut and the performances of the largely unknown cast so powerful and totally convincing.I would feel confident in asserting,for example, that the performance of Stephanie James in the central role of Leigh-Anne will stand comparison with those who will be honoured at the Oscar ceremony next month.Her portrayal of an attractive and intelligent young woman smouldering with racial hatred and frustration is one that will live in the memory .It is a film that gets under your skin and forces you to ask yourself some fundamental questions.How did these young people get to be the way they are? Is the connection between poverty and deprivation on the one hand and violence and cruelty on the other too facile,although it should be said that the film itself makes no such facile connection.The whole thing is unsettling and uncomfortable and you cannot take your eyes from the unfolding tragedy. By chance I had seen Clint Eastwood's accomplished Million Dollar Baby a couple of days before.Of the latter The Guardian's film critic,Peter Bradshaw, rightly remarked that,three-quarters of the way through, it delivers to the audience a right hook like Jack Dempsey.A Way of Life delivers a barrage of right and left hooks that leave one bruised and soul-searching as one emerges from the cinema.",
         "It never ceases to amaze me how many times we see new film makers trying to make gritty films about people in the lower echelons of society. Problem is - Middle-class film makers haven't a clue about these people. This film was all about trying to shock the audience into submission. It may well shock your average middle-class viewer, for everyone else it was weak. Come on a couple of 8 stone kids killing an adult, and then not getting out of their blood stained clothes....Really? Crap! How this got a Bafta i'll never know. Must have been the middle-class judging panel. This is the problem with the British film industry. If its not a costume drama its about the lower classes. Film makers haven't a clue, so decide to make it up - and very poorly at that. It would have paid dividends if the film maker spent some time in a deprived area or estate in the present day - not claim they were brought up in one.",
         "This film blindsided me with it's authentic and powerful portrayal of life lived on the fringes of society. I recently saw this film at the Toronto International Film Festival and I was in awe of just how real and raw the performances were, by essentially first time actors. This was also the director's first feature film and it was as assured a piece of film making as I've seen. The story and direction reminded me very much of a Mike Leigh film. The story follows a young single mother struggling to survive in a society that has all but forgotten her. Along with her brother and his hooligan friends, they continue to make one bad decision after another. Their attempt to break the vicious cycle seems a near impossible task, but, director Amma Assante finds a way to empathize with her characters so that we see that ultimately we all have choices in our lives and must try to battle through the harsh and cruel realities that life throws our way. This story of tough street kids struggling to overcome both their environment and the people they have become is a harrowing and ultimately tragic story of forgotten youth.",
         "This film certainly had a lot of potential. The film certainly pulls no punches when it comes to portraying the main characters. We are shown their violence, racism and bigotry in depth. Not that they are averse to exploiting their own, as several episodes show. Whilst the main characters certainly have many unsavoury characteristics the film does allow time to explore what made them what they are. Many factors are highlighted, lack of stable partnerships, low self-esteem, lack of commitment, lack of parenting skills, drugs, unstable violent backgrounds, unemployment, discrimination and lack of opportunities. My main criticism of the film is not that it isn't well researched. The problem is in the production. The direction is so leaden and obvious. The characters have no space to develop and the director rams their points into your face. You could almost imagine that this was produced as a course material for a school sociology program. The camera-work and sound tract only reinforce this. The angles and shots are all so daytime TV, zooming into faces for close ups in those confrontation moments, giving the obligatory 2 second scenic scene setting shots at all the appropriate moments. Need I say that the soundtrack is hardly subtly or seamlessly enmeshed. All in all whilst this film has good intentions, good material and some good acting the whole thing feels poorly put together and ends up loosing a lot of its impact between the cracks in the production.",
         "The tag line for this film is \"In real life there are no happy endings\" but to be honest you don't need to wait till the end of the film to find a lack of happiness because it is all through this story. In a coastal Welsh town, Leigh-Anne lives below the poverty line with her new baby. Her \"partner\" is around but not contributing and her day-to-day life involves hanging around with her equally jobless friends and trying to get enough money to afford the basics. As she hangs round with her friends, her frustration at her situation spills over into hatred and aggression at those around her. I'm not quite sure what she is doing now but when this film came out a few years ago Amma Asante was hailed as part of a new wave of British talent. Eventually getting to see this film for myself I can understand why because it is an excellent piece of work with only a few weaknesses that bugged me. The plot does have a narrative flow but ultimately it is about the characters and, as such it is a convincing and engaging film because the characters are very well written. It is not a happy watch of course because it does pain a depressing picture of those on the lowest rungs of society \u0096 full of anger looking for an outlet and frustrated to the point where they seem unable to even aspire to more than their lot. It is very convincing for the most part although at times some of the touches or detail did have the ring of \"film reality\" rather than reality because although Asante does seem to understand her characters, she does occasionally give them moments of self-awareness that I wasn't convinced by. As director she is also good but with a few issues. The opening beating is intense for one example \u0096 the camera gliding round the library was also well done and increased the tension later in the film. Outside of moments like these, the direction is still very good, with strong cinematography but ye intimately shot. I wasn't sure about the score though. I've nothing against the use of David Gray because it did work quite well at times but it was rather overused I thought. Asante's direction of her cast is good and she is rewarded by good performances. James is excellent in the lead and makes a very convincing character. Her self-pity is there but she keeps it from being useful and instead did a good job of showing her frustrations at her self being turned outwards. To me she is the film and again it is impressive that she carries it so well. Support is good from the rest of the cast though, all of whom fit into this world convincingly with turns from Haden, Wong, Sheppeard, Gregory and Blethyn (who's character may not be big but I suspect she was important in regards funding and distribution, so credit to her for that support). Overall then a very strong and engaging film. It is not cheerful and it is not perfect but Asante's writing shows she understands her characters and can translate that into words and actions that mostly ring true. As director she produces some great shots but also creates an intimacy without losing the effect of being cinematic. A very good British film that deserves an audience bigger than it has so far been given.",
         "This is one of the most depressing, cynical and downright prejudiced films it has ever been my misfortune to sit through. While the intentions of Amma Asante to depict a true-to-life gritty slice of working class Welsh life may have been admirable, the clumsy way she goes about executing her project made me doubt her own belief in her work. While appalling racism and poverty may indeed be an element of modern urban Wales (and indeed the rest of the world), I was utterly unmoved by the apparent ubiquitousness of these horrendous beliefs within almost EVERY character in this messy pseudo-drama. My own experiences with people in similar (and worse) situations made me angry at the short-sightedness of this thoroughly middle class generalising. While I am positive I was supposed to sympathise with the reprehensible lead character, I found her negligence as a mother, her cruelty and manipulation of her family and friends, and her hateful nature utterly disgusting, and cheered when her baby was taken from her, as she clearly was no kind of mother. I KNOW this kind of thing happens in real life, but in real life people SMILE, people GET ON WITH IT, people try to MAKE THE BEST OF THEIR SITUATIONS. I cannot sympathise if a baby is taken away from a mother that allows her to scorch her arms with candles, and happily abandons her child in order to have sex on a whim. The message I felt this film delivered, was that poverty was a situation in which nobody could be human. The middle classes (represented by Brenda Blethyn) are celebrated as if they have some sort of enlightened outlook, completely non-racist and unprejudiced in their suburban Utopia. I think many people would agree this is a distance from the truth. Violent, gratuitous, unbelievable, unpleasant and an insult to working class life, this film works only to cement the vastly misguided belief that the working classes and people on benefits constitute some kind of inhuman subculture. I would never deny that their are grains of fact which surface in this movie, but its refusal to acknowledge that those at the bottom might have something worth living for (other than making the life of a child an utterly miserable one) is something I cannot accept. All good points in this film (the occasionally inspiring cinematography, and a smattering of interesting performances), were swept aside by the avalanche of pessimism which Asante obviously feels audiences need. Ken Loach and Mike Leigh get it right. Take Raining Stones, remove all humour, humanity and respect for others, and you'll approach the dross of A Way of Life.",
         "British screenwriter, director and former actress Amma Asante's feature film debut which she wrote, was screened in the Discovery section at the 29th Toronto International Film Festival in 2004, the Zabaltegi New Directors section at the 52nd San Sebastián International Film Festival in 2004 and in the New British Cinema section at the 48th London Film Festival in 2004. It is a UK production which was shot on locations in Swansea and Cardiff in South Wales, UK and produced by producer and director Peter Edwards, producer and director Charlie Hanson and producer Patrick Cassavetti. It tells the story about a seventeen-year-old single mother named Leigh-Anne Williams who lives in a deteriorated council flat in a harsh area in Cardiff with her daughter named Rebecca and who is in an ongoing argument with a Turkish immigrant in her neighbourhood, frequently visited by a social worker and who spends most of her time with her brother and his two friends who are juvenile delinquents. Finely and engagingly directed by British filmmaker Amma Asante, this quietly paced fictional tale which is narrated mostly from the protagonist's point of view, draws a moving portrayal of an adolescent girl with a harrowing background story who is struggling to survive and raise her daughter in a loveless place. While notable for its distinct and realistic milieu depictions, the fine production design by production designer and art director Hayden Pearce and cinematography by English cinematographer Ian Wilson, this character-driven, compelling and at times violent story regarding a girl in the adolescence-adulthood transition with no real options and no reliable friends or family members who are looking out for her best interest, which was made three years after the Bradford riots in 2001 and which is inspired by the director becoming interest in girl-led gang crime after learning the story about an eighteen-year-old girl who had been involved in a gang rape in London, England and her interest in poverty and race in the UK, examines themes like family relations, identity, racism, urban decay, youth criminality and survival, depicts a multidimensional study of character and contains a profound score by British musician David Gray. This bleak and distinct social-realist drama regarding a person who all though knowing that it might lead to the person that she loves the most in the world will be taken away from her, participates in her friends' criminal activities and disregards the mother of the father of her daughter who wants Rebecca to live with her, is impelled and reinforced by its interweaving stories, various characters, raw and unrestrained dialog, cogent narrative structure and the prominent and expressive acting performance by Welsh actress Stephanie James in her first feature film role, which earned her the Best Actress Award at the 7th International Bratislava Film Festival in 2005. A powerful and unsentimental directorial debut which gained the Alfred Dunhill UK Film Talent Award at the 48th BFI London Film Festival in 2004 and the Carl Foreman Award for special achievement by a British Director/Producer or Writer in their first feature film Amma Asante at the 58th British Academy Film Awards in 2005.",
         "Whoever stated this movie was the worst they had seen and was utter poo doesn't know much about movies and maybe the fact the characters are so racist touched a nerve with them. It is brilliant - much like 'Ladybird, Ladybird' and 'Secrets and Lies' with thought-provoking themes and a depth of study of prejudice and racism that we need to be aware of. Miscommunication, misunderstanding...you name it. Great acting and the accents generally good. Good script, good subject matter and something we all need to see in a multicultural society. It is in fact very realistic - anyone who has lived or worked in estates and community situations such as portrayed would agree. Only those with their heads buried in sand would rate the movie negatively. Great work - well done.",
         "Saw this film on BBC2 late last night, and found it eminently watchable.The only obvious weak point for me was the casting of Brenda Blethyn-why oh why? I know what hits home for me, but do not fully understand the harsh criticisms of many. I wish I could understand these better, and I welcome a flood of response as to why this film does not hit the mark. It seemed to for me. Yes, I am a member of the middle classes, so I no doubt am out of touch with the realities of day to day life. I am admittedly quite ignorant of points of style etc...-so please , detractors, further explain in detail where this film falls short.It seems to me that the lack of redeeming features, and one dimensional aspect of the characters is a strength.I am all for somebody who follows Hamlet's advice to 'Hold the mirror up to nature.'Let there be more portrayal of things that are bleak.",
         "Leigh-Anne is 17, and the mother of a 6-month old baby, Rebecca. She lives in a run-down council flat in Cardiff and her life is filled with bleakness and insecurity. She is convinced her neighbour Osman is trying to get Social Services to take her daughter away. Enlisting the help of three friends she aims to ensure Osman does not undermine her. Little does she realise the consequences of her actions. Incredibly powerful and emotional story. Harrowing ordeal, showing the lives of people in poorer echelons of society, and how they live their lives. Shows the traps and cycles they fall into, as well as how their situation shapes their behaviour. Also explores themes like racism and paranoia. Superb movie.",
         "Makes some trenchant and powerful points about racism, and the way the poor are often turned against each other. Nicely shot, and mostly well acted. That said, it's become a fairly familiar story, and this reminded me of a lot of other films. Also, as good as the performances often were, I kept being naggingly aware I was watching actors doing a very good job 'acting like' poor, uneducated people. Especially with the young lead, -- I felt just the slightest hint she was playing 'down' to her character. I did appreciate the lack of softening the edges of these characters to make them 'likable'. I'll still take this kind of socially aware, intense film over 99% of what's out there, even with any flaws.",
         "This is an extremely bad movie. I know that many people will argue that the movie is poor because of the low budget, but I strongly disagree. Several problems with the movie may have something to do with the low budget: a cinematography that simply does not let you see what is going on, terrible sound, extremely dis-articulate editing, no soundtrack, etc. However, my really big concern with this movie has to do with the things which, by themselves, don't necessarily require more money. I simply refuse to believe that among the young newcomers in the British cinema there is nobody better than the people that were \"acting\" here. The over-acting is extreme, the changes of mood are simply unbelievable and even B. Blethyn is terrible here. The script is a pile of oversimplified clichés which we have watched one thousand times before in TV movies, TV series and bad commercials FROM THE SIXTIES AND SEVENTIES. There is no sense of rhythm, no suspense, no interest or development of the characters. I am serious here: this movie has absolutely nothing to offer and I really want to know who provided the money to make it.",
         "leigh-anne is a single mother, on benefit, living in dark, damp house, with sick baby from this cheerful start the film spirals down to its tragic ending well thats the review over with, now for some comments +++SPOILERS+++ movies that portray people from the arse end of society are not uncommon, what distinguishes a way of life from the plethora of sentimental portrayals of plucky and lovable characters, is that the main characters in a way of life are completely lacking in redeeming features and the film itself is about as unsentimental as it is possible to get the central character, leigh-anne, is portrayed as an twisted evil bitch, who is surrounded by friends who are not really her friends this is an example of how bad leigh-anne is: a middle aged man comes up to her in a pub, obviously wanting to purchase her sexual services, to which she responds: \"ain't you gonna buy me a drink first\" she starts a conversation with a girl a pub, who tells her: \"me mam wont let me have a boyfriend till I'm 15\" leigh-anne responds with fake astonishment: \"well thats ages away, pity you could have any boy in this place\" so she takes the girl out of the pub, and is followed by the middle aged man, who asks her how much? she says £30, he says he can get it for half that elsewhere, to which she says: \"yeah but she ain't been had before\" she takes his money and says to the girl: \"just open your legs and let him do the rest\" we see a parting shot of rough sex and the girl in pain",
         "This film is so bad I watched it again with a friends so we could laugh together at some awful moments. The way the characters develop is so poor it's untrue. through the film they are doing what ever then bang! they are racists. The DOP should never work again, it looked like an episode of Property Ladder or Wife Swap. Utter poo. Everyone should watch this film as a comedy. The fact that this director had Bafta recognition has much to do with sex and ethic background rather than ability. With nobody financing anymore of her work is proof in the pudding. Shocking shocking film.",
         "A deliberately harsh,pessimistic,unrelenting look at the underclass in 21st Century Britain (namely South Wales),A WAY OF LIFE is a decently made kitchen sink slice of realism,with convincing performances (from a predominately teenage cast,with Brenda Blethyn the only well-known name on view) all round,but it's most severe problem is that it has zero entertainment value,not surprising the dismal and squalid settings that are on show,plus the deeply unpleasant characters. The story of a teenage mum (well played by Stephanie James) who has had the most difficult of lives (mother committing suicide,abusive father,no job,poor education,etc.) ,and subsequently hurling appalling racist abuse at an Asian neighbour along with other similarly repellent teenage boys, making him the scapegoat for all her problems,is overly glum,humourless and even melodramatic;even the grandmother of her infant child (Blethyn) is subject to similarly aggressive rants. It becomes a considerable strain to watch the film because of the sheer nastiness of the characters and incident depicted.Granted,this may now be a fairly accurate presentation of the desperate condition of many council estates in Britain today,with years of neglect and ignorance by national and local government alike.The film does succeed in this sense,but you get the considerable feeling that it is pointless in trying to dramatise such events for a motion picture,as it is odds-on that very few people would want to pay money not to be entertained,which A WAY OF LIFE also succeeds achieving in spades.With no sympathetic or likable people around,it's no wonder. Not surprisingly,A WAY OF LIFE was barely seen in a few art-houses before it's departure from cinemas.It is possible to do social realism with a dash of humour,nonchalance and charm,which would ensure a decent number of people watching it;Ken Loach,Mike Leigh and Shane Meadows have managed this over the years with their efforts;had the director here followed this example,the technical competence and decent acting on view may not have been the only aspect worth complementing;as it is,you respect A WAY OF LIFE,but in no way end up liking the finished product,or remembering it with any satisfaction or enthusiasm. RATING:4 and a half out of 10."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "AWOL Films Ltd.",
         "Tantrum Films Ltd."
      ],
      "summaries": [
         "At 17 LeighAnne Williams has a six month old baby to look after, with only the help of three teenage squatters who flog stolen gear to make ends meet. A neighbour (actually from Turkey) across the street becomes target to her growing paranoia that Social Services are going to take her daughter, Rebecca, away from her. Her behavior becoming increasingly desperate as her delusions over her neighbor grow. She convinces Steven, Gavin, and Robbie he needs a lesson.",
         "Leigh-Anne is 17, and the mother of a 6-month old baby, Rebecca. She lives in a run-down council flat in Cardiff and her life is filled with bleakness and insecurity. She is convinced her neighbour Osman is trying to get Social Services to take her daughter away. Enlisting the help of three friends she aims to ensure Osman does not undermine her. Little does she realise the consequences of her actions."
      ],
      "budget": 0
   },
   "movielensId": 156894,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-11-12",
      "dvdReleaseDate": null,
      "directors": ["Amma Asante"],
      "runtime": 91,
      "movieId": 156894,
      "title": "A Way of Life",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0365914",
      "originalTitle": "A Way of Life",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "At 17 LeighAnne Williams has a six month old baby to look after, with only the help of three teenage squatters who flog stolen gear to make ends meet. A neighbour (actually from Turkey) across the street becomes target to her growing paranoia that Social Services are going to take her daughter, Rebecca, away from her. Her behavior becoming increasingly desperate as her delusions over her neighbor grow.",
      "tmdbMovieId": 110282,
      "avgRating": 2.33333,
      "releaseYear": "2004",
      "numRatings": 3,
      "posterPath": "/tCEfGtXpz5lzU2eZequXnzLXOeH.jpg"
   }
}