{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0067677",
      "video": false,
      "title": "Rio das Mortes",
      "recommendations": [],
      "backdrop_path": "/be1I6YK7abIsrr68svcKJKlxs0T.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hanna",
               "gender": 1,
               "credit_id": "52fe4d4b9251416c911111b9",
               "name": "Hanna Schygulla",
               "profile_path": "/rlM0TCA5NNLQ9SwP4Cn4PhmaGgy.jpg",
               "id": 3734,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Günther",
               "gender": 0,
               "credit_id": "52fe4d4b9251416c911111bd",
               "name": "Günther Kaufmann",
               "profile_path": "/9TRdpzdK7eb3rhaRtQOVeiS1yRO.jpg",
               "id": 32863,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Michel",
               "gender": 2,
               "credit_id": "52fe4d4b9251416c911111c1",
               "name": "Michael König",
               "profile_path": "/wbXB2dAxOmDYMOEXNzVLM3qNWrc.jpg",
               "id": 38907,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Michels Kollege",
               "gender": 2,
               "credit_id": "52fe4d4b9251416c911111c5",
               "name": "Harry Baer",
               "profile_path": "/hSEFn3qQ1ldC9IQoysxuol8YCYi.jpg",
               "id": 23668,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Katrin",
               "gender": 0,
               "credit_id": "52fe4d4b9251416c911111c9",
               "name": "Katrin Schaake",
               "profile_path": "/xKsoV6d4KXWr0jwkiFO7ozCqL9m.jpg",
               "id": 26330,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Autohändler",
               "gender": 2,
               "credit_id": "52fe4d4b9251416c911111cd",
               "name": "Ulli Lommel",
               "profile_path": "/ngstgeahshDgcBGwmtHhCpuNj22.jpg",
               "id": 10620,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Hannas Kollegin",
               "gender": 1,
               "credit_id": "52fe4d4b9251416c911111d1",
               "name": "Ingrid Caven",
               "profile_path": "/lTgtHMJoUVYd9zmak0WvhzeGHOE.jpg",
               "id": 45195,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Günthers Mutter",
               "gender": 1,
               "credit_id": "52fe4d4b9251416c911111d5",
               "name": "Lilo Pempeit",
               "profile_path": "/6x2TXUeJvyiaVuKuvUCSdscDF3Z.jpg",
               "id": 2740,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sekretär",
               "gender": 0,
               "credit_id": "535ff8e50e0a264fe5008760",
               "name": "Walter Sedlmayr",
               "profile_path": "/9cESnCVgyYbWnJzLEMkyyqm6G1U.jpg",
               "id": 2741,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d4b9251416c911111b5",
               "name": "Rainer Werner Fassbinder",
               "profile_path": "/27Zgw5CeRiPR2yTyoXVvWYvarLV.jpg",
               "id": 2725,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53e0cd0c0e0a265a8d006f9b",
               "name": "Rainer Werner Fassbinder",
               "profile_path": "/27Zgw5CeRiPR2yTyoXVvWYvarLV.jpg",
               "id": 2725,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.634264,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 197175,
      "vote_count": 3,
      "budget": 0,
      "overview": "Michel and Guenther, working in dead-end jobs, are obsessed with going to Peru to find buried treasure, using a map of the Rio das Mortes. Michel's girlfriend, Hanna, humors their plan, but really just wants to get married.",
      "similar": [],
      "original_title": "Rio das Mortes",
      "runtime": 84,
      "poster_path": "/9SHNRi10spOfum7pjuviLd3yDLU.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Janus Film und Fernsehen",
            "id": 4497,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Antiteater-X-Film",
            "id": 2277,
            "origin_country": ""
         }
      ],
      "release_date": "1971-02-15",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": "DEM ",
      "directors": ["Rainer Werner Fassbinder"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Rainer Werner Fassbinder"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0067677/",
      "coverLink": null,
      "actors": [
         "Hanna Schygulla",
         "Michael König",
         "Günther Kaufmann"
      ],
      "reviews": [
         "Excellent early Fassbinder about two shiftless young men who decide, seemingly on the spur of a moment, that the next big step in their lives will be an extended expedition for treasure in Peru's Rio das Mortes region. One of their fiancées (Hanna Schygulla, as gorgeous and as great as ever) finds the notion stupid and wants to put a stop to it. It's a droll comedy and has a ton of great sequences. This is the first film in a Fassbinder bender I'm going on. I'm planning on seeing all of the films of his that have recently been released on DVD. I've been thinking a lot about this particular auteur lately. I don't think that enough time has passed since his untimely death to allow his career to be taken into proper perspective. Fassbinder reminds me a lot of Rohmer, Ozu, Godard and Bresson. He's in his own little world in his films (a world which changed a lot in the 13 or so years during which he was active), and a lot of people are still misunderstanding it as overly theatrical, or stilted, or otherwise. The more films one sees by him, the more one gets adjusted to this universe. I think Rio das Mortes is best appreciated by Fassbinder's fans, and is unlikely to make any new converts (start with Ali: Fear Eats the Soul, Fox and His Friends, and The Marriage of Maria Braun).",
         "After the heavy-handed Brechtian devices of a number of his early films, Fassbinder really begins to get going in this made-for-TV piece about a couple of working class men who share a boyhood dream to search for treasure in Rio das Mortes in Peru. The dream they share is a typical storytelling \"call to adventure\" and the film delineates their deadbeat and usually hopeless attempts to raise the money for the venture - their economic situation is too hopeless for them to save, selling their possessions and cashing in their inheritances doesn't add up to much and attempts to finance the trip as a business venture and a research expedition fail due to their hopeless inabilities. But luck arrives in the form of a widow with more money than sense, who stumps up the finance and so off they go. What we've seen of them doesn't inspire much hope for their adventure... All the while, their male story is ironically counterpointed with the hopes, dreams and aspirations of the live-in girlfriend of one of the men, played by the extraordinary Hanna Schygulla. She goes to college and takes part in a feminist theatre-piece (the conclusion of which is \"women's own behaviour is the best evidence of their oppression\") but learns little, as she dreams of placating her nagging mother by marrying and having lots of kids. All of that is made nonsense of by the dream-journey of the men, which she almost kiboshes by nearly shooting them at the end, a quirk of fate saving them. Fassbinder, to my mind for the first time successfully, moulds his early obsession with the homo-social exclusion of the female in male friendships into a contemporary melodrama of some verve and wit. His story, a classic \"quest myth\", is ironically set in a society seething with casual misogyny, violence, class contempt, economic want and ignorance. Gritty realism is used to undermine the high-falutin dreams of the men, but the film suggests that lucky twists of fate might save a dream - all Fassbinder leaves men with is faith in turns of a friendly card; all he leaves women with is incompatible hopes of settling down with their menfolk, who shaped the patriarchal world in which they're subservient to ideals to which men's inmost dreams are opposed.",
         "This is a good film which will appeal to the realist Fassbinder fans but does not in any way rank with his best gritty works (Merchant, Herr R., Ali)perhaps because of its unrealistic proceedings: The story develops somewhat slowly and predictably, and none of the characters have much development. The acting is good yet primitive, and definitely has an repertory feel to it--one of the beauties of RWF's movies: it was almost comforting to see Gunther Kaufmann, Hanna Schygulla, and Harry Baer together. Michael Konig also puts in a good role as Michel. I thought the best scenes of the movie are when Gunther and Michel seek financial assistance from Hanna's relative.",
         "In Fassbinder's published manuscripts, interviews, notes and his own work as a playwright, poet, film critique, including philosophical writings, there is practically nothing to be found about the possibly highly interesting relationship between Fassbinder and Herbert Achternbusch (in 1971, Achternbusch's first big novel had appeared). Achternbusch must have taken up \"Rio Das Mortes\" thematically in his film \"Das Letzte Loch\" (1982) and in the novel \"Das Haus Am Nil\" (1981), respectively. Thereby, it does not matter if the Nil is in Egypt or not - the Nil is the protagonist, best a personification of an abstract concept \"Nil\" - and like is bearer basically unbound. And so is the Rio Das Mortes - by the way, it is not in Peru, but in the state of Minas Gerais in Brazil. Nietzsche wrote his famous passage about Mexican Oaxaca - needless to say the had never been there and the name and his concept have not much more than a phonetic reality. Such use of landscapes, cities, rivers, etc. have a good and long tradition in German literature, going back at least down to Goethe's Arcadia: Et in Arcadia ego.",
         "Rainer Werner Fassbinder is a writer/director whose body of work varies more widely than just about any other. Some of his films, such as \"Mother Küsters Goes to Heaven\", are brilliant and some are absolutely terrible and self-indulgent (\"Querelle\" comes to mind). There just is no categorizing of this enigmatic man's work. Yet, oddly, there are also some disciples of the man who talk about his films like they are ALL brilliant works of art--even though the average viewer would never sit through many of his films. Imagine Joe Average watching AND ENJOYING such Fassbinder films as \"The Bitter Tears of Petra von Kant\"--it just isn't going to happen! And, because practically every film he made is adored by a small but loyal crowd, I am reminded of the tale of the Emperor's New Clothes! In the case of \"Rio das Mortes\", it's official--Fassbinder is, so to speak, absolutely naked! While I realize that the production quality of Fassbinder's films are not usually up to Hollywood standards (partly, I think, because he made so many, many films so rapidly in succession), even by Fassbinder standards \"Rio das Mortes\" looks cheap. The print is ultra-grainy and the film looks as if it was filmed with an 8 or 16mm camera. It was steady (fortunately), but it just had poor resolution. As for the acting and story, unfortunately, they were actually much worse than the poor camera-work. The acting, in many cases, was terrible--with actors doing about as well as you'd expect from community theater--but no better. There also was a pretty meaningless fistfight that made me laugh--as the blow obviously never connected! As for the plot, it never engaged, as you really never cared about these two fist fighting friends. Part of it was the script and part of you just wondered why these two flakes with absolutely no training wanted to sell everything to move to Peru to try to find some Incan treasure (though sometimes the idiots referred to it as 'Mayan'!). As for the film's ending involving the Robert Plant-like leading man and his sexy but screwy girlfriend with a gun, it just made my brain hurt. Frankly, there's nothing to like about the film. Nothing.",
         "\"Rio das Mortes\" is a West German film from 1971, so this one has its 45th anniversary already this year. It is a fairly early career effort by German writer and director Rainer Werner Fassbinder (in his mid-20s) and, at the same time, also one of his earliest color films as he started it all in black-and-white. This is a television production that stays comfortably under 90 minutes, so nowhere near Fassbinder's longest works. It is basically the story of two men who plan a journey to Peru, while the girlfriend of one of the two rather wants her man to stay and marry her. What's going to happen. Or will none of them get their wish? Watch for yourself. Or maybe don't as I personally did not find it a good watch. Fassbinder succeeds the most with drama in my opinion and there he includes occasionally subtle humor as well besides the character studies. And I would not call this film here a comedy film either, even if there is certainly more comedy than Fassbinder usually does. The title actually sounds like one of these jungle-themed films starring Kinski that were made by Herzog, but that's just a side-note. Anyway, the cast here includes many of Fassbinder's regular actors. Michael König has not worked with him that often, but the likes of Schygulla, Kaufmann, Brem, Lommel, Baer, Sedlmayr and Schaake have played in a lot of his films. This one here may not be their best, but I personally also must say I never really developed much interest in the story. The scene with the gun at the very end looks a bit clumsy as if Fassbinder tried to rush in some dramatic tension at the very end as it may have become visible to himself too that this film lacked relevance, especially to most of the works he has done later in his tragically short-lived career. I don't recommend the watch. Check out something else from this truly gifted filmmaker instead."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Antiteater-X-Film",
         "Janus Film und Fernsehen"
      ],
      "summaries": ["Michel and Guenther, working in dead-end jobs, are obsessed with going to Peru to find buried treasure, using a map of the Rio das Mortes. Michel's girlfriend, Hanna, humors their plan, but really just wants to get married."],
      "budget": 125000
   },
   "movielensId": 156962,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1971-02-15",
      "dvdReleaseDate": null,
      "directors": ["Rainer Werner Fassbinder"],
      "runtime": 84,
      "movieId": 156962,
      "title": "Rio das Mortes",
      "mpaa": null,
      "actors": [
         "Hanna Schygulla",
         "Günther Kaufmann",
         "Michael König",
         "Harry Baer",
         "Katrin Schaake",
         "Ulli Lommel",
         "Ingrid Caven",
         "Lilo Pempeit",
         "Walter Sedlmayr"
      ],
      "imdbMovieId": "0067677",
      "originalTitle": "Rio das Mortes",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Michel and Guenther, working in dead-end jobs, are obsessed with going to Peru to find buried treasure, using a map of the Rio das Mortes. Michel's girlfriend, Hanna, humors their plan, but really just wants to get married.",
      "tmdbMovieId": 197175,
      "avgRating": 2.83333,
      "releaseYear": "1971",
      "numRatings": 3,
      "posterPath": "/9SHNRi10spOfum7pjuviLd3yDLU.jpg"
   }
}