{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "passion",
            "id": 2983
         },
         {
            "name": "childhood memory",
            "id": 3321
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "immortality",
            "id": 4978
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "based on short story",
            "id": 156866
         },
         {
            "name": "aunt nephew relationship",
            "id": 158199
         },
         {
            "name": "childhood friends",
            "id": 160246
         },
         {
            "name": "uncle nephew relationship",
            "id": 164193
         },
         {
            "name": "1920s",
            "id": 207876
         },
         {
            "name": "warsaw",
            "id": 212914
         }
      ],
      "imdb_id": "tt0079696",
      "video": false,
      "title": "Young Girls of Wilko",
      "recommendations": [],
      "backdrop_path": "/loDV0HC1Siwr8Wn6Li1JogrjtyD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Wiktor Ruben",
               "gender": 2,
               "credit_id": "55397d1f9251412d9100639f",
               "name": "Daniel Olbrychski",
               "profile_path": "/nfqJ8xiVNyBQQhnYRkwJzl3iS7s.jpg",
               "id": 7107,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Julcia",
               "gender": 1,
               "credit_id": "55397d3a92514140810029a0",
               "name": "Anna Seniuk",
               "profile_path": "/3fxxk5UCgM9CTCUaVXe3zzZFnGr.jpg",
               "id": 236453,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jola",
               "gender": 1,
               "credit_id": "55397d559251413f5a00290c",
               "name": "Maja Komorowska",
               "profile_path": "/fzF28UJIvqbyiu0PDfanwTEvZKK.jpg",
               "id": 2832,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Zosia",
               "gender": 1,
               "credit_id": "55397d78c3a36878fd006413",
               "name": "Stanislawa Celinska",
               "profile_path": null,
               "id": 238405,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Kazia",
               "gender": 0,
               "credit_id": "55397d9bc3a36878fd006415",
               "name": "Krystyna Zachwatowicz",
               "profile_path": null,
               "id": 2817,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Tunia",
               "gender": 1,
               "credit_id": "55397db4c3a3685f9b002c95",
               "name": "Christine Pascal",
               "profile_path": "/2GwQs5zZqBYEfVnaJJmqGGxqyJ0.jpg",
               "id": 3200,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Julcia's Husband",
               "gender": 2,
               "credit_id": "55397dd0c3a36815ac00a32f",
               "name": "Zbigniew Zapasiewicz",
               "profile_path": "/lJOImB56KclzTlst5HMVqpQCR4p.jpg",
               "id": 1405,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Wiktor's Aunt",
               "gender": 0,
               "credit_id": "55397dea9251416518009ff5",
               "name": "Zofia Jaroszewska",
               "profile_path": null,
               "id": 1458354,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Wiktor's Uncle",
               "gender": 0,
               "credit_id": "55397e02c3a36878fd00641c",
               "name": "Tadeusz Białoszczyński",
               "profile_path": "/c0a0gJJsuKN47KBvmdw4hYOe9k1.jpg",
               "id": 7118,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Jola's Husband",
               "gender": 0,
               "credit_id": "55397e1fc3a36878fd006420",
               "name": "Paul Guers",
               "profile_path": "/jYMiuXJVNreIZUnFaERl0turMYj.jpg",
               "id": 24905,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Butler",
               "gender": 0,
               "credit_id": "55397e38c3a3681be4005810",
               "name": "Kazimierz Brodzikowski",
               "profile_path": null,
               "id": 1458355,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "55397e4492514140810029b6",
               "name": "Andrzej Grzybowski",
               "profile_path": null,
               "id": 1458356,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 0,
               "credit_id": "55397e98c3a36815ac00a349",
               "name": "Jaroslaw Iwaszkiewicz",
               "profile_path": null,
               "id": 1065678,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Kazia's Son",
               "gender": 0,
               "credit_id": "55397ead92514138a9003255",
               "name": "Filip Jasienski",
               "profile_path": null,
               "id": 1458359,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Coachman",
               "gender": 0,
               "credit_id": "55397ec2c3a3685f9b002ca2",
               "name": "Witold Kaluski",
               "profile_path": null,
               "id": 1458360,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bb6c3a36847f8210ccd",
               "name": "Andrzej Wajda",
               "profile_path": "/5qXVjs0C7EUye57zBFV5lZVN73w.jpg",
               "id": 2801,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb6c3a36847f8210cd3",
               "name": "Jaroslaw Iwaszkiewicz",
               "profile_path": null,
               "id": 1065678,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb6c3a36847f8210cd9",
               "name": "Zbigniew Kaminski",
               "profile_path": null,
               "id": 1065679,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.980846,
      "production_countries": [],
      "id": 117483,
      "vote_count": 4,
      "budget": 0,
      "overview": "Set in the late '20s. A thirtyish young man, who heads a small factory, faints at the funeral of a close friend. He decides to go home to his aunt and uncle for a while, but gets involved with a family of five women who had been in love with him at one time though he had apparently loved only one, who, unknown to him, has died since his departure. The women are mainly disillusioned with life or estranged from husbands while the youngest has a crush on him.",
      "similar": [
         1213,
         13,
         311,
         28178,
         509,
         2675,
         394117,
         13523,
         862,
         298312,
         705,
         888,
         193687,
         332872,
         82703,
         2575,
         89492,
         902,
         1628,
         80035
      ],
      "original_title": "Panny z Wilka",
      "runtime": 118,
      "poster_path": "/e8XM6OG216Kix6GU30GUmVyojHT.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [],
      "release_date": "1979-09-04",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Jaroslaw Iwaszkiewicz",
         "Zbigniew Kaminski"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0079696/",
      "coverLink": null,
      "actors": [
         "Daniel Olbrychski",
         "Anna Seniuk",
         "Maja Komorowska"
      ],
      "reviews": [
         "The male lead in this movie is handsome, accomplished, kind and well meaning, but he does not comprehend the harm he has caused his female friends (and lovers)in his country town 15 years ago. He suffers the loss of a good friend in his new surroundings and returns to his old town for comfort and rest. But he has learned nothing about his lack of understanding of the depth of love he can inspire. Even when he discovers that a previous lover had lost her life to pain, he begins again, unknowingly, to hurt a girl of a younger generation. There is not a wasted word or movement in the movie. Everything is important. I loved the movie and will buy it and watch it over and over. This movie is a super-ten. It is as good as any Ibsen play.",
         "Polish filmmaker Andrzej Wajda's 1979 film Maids Of Wilko (Panny Z Wilka- also translated as Young Girls Of Wilko) shows that, like such filmmakers as Ingmar Bergman, Robert Bresson, and Yasujiro Ozu, he is an artist more interested in endurances than mere 'scenes.' His characters speak as if philosophers, but in a naturalistic style. They are not the hyper-educated bourgeoisie of Bergman, the spiritual elitists of Bresson, nor the everyday philosophes of Ozu. Yet, there's something more to them, and Wajda, than what is on the screen, even if the film, as a whole, fails to reach great heights. His two most famous Polish descendents in cinema, Roman Polanski and Krzysztof Kieslowski, are filmmakers who believe in indulgence. This is not a comment on the success of their indulgences, merely a recognition of them. Polanski, for example, has a predilection for the Grand Guignol, and would have been perfectly at home in the 1920s, making silent films alongside the great German Expressionists. Kieslowski, on the other hand, grew into a filmmaker who heaped visual razzle-dazzle with spiritual symbolism, almost to the point of surfeit. By contrast, Wajda's film is a Chekhovian chamber play, although most of it is set outdoors. It is one of those works of art in which, in answer to a query such as, 'What is it about?', the only answer is nothing and everything. It is, in a sense, akin to Betty Smith's fantastic novel of female maturation in early Twentieth Century America, A Tree Grows In Brooklyn, save that much of the basics are inverted. The lead in Maids Of Wilko- despite its title, is a thirtysomething veteran of war. Instead of his eventual departure from his youthful stomping grounds, he is returning to them after fifteen years away, in the late 1920s (since 1922 and '23 are mentioned as being some time ago), in which time he was in World War One, and ended up a farm manager outside of a big city. The interwar years make this film a historical period piece, unlike most of the films of Polanski and Kieslowski, which are set in contemporary times, and it's interesting to note how similar the characters are to their counterparts in films set in other countries at the same period of time, rather than their differences\u0085. Maids Of Wilko was nominated for the Best Foreign Language Film Academy Award in 1980, but while it's a very good film, it's not a great one, and never really soars into the stratosphere. The three other sisters in the film, Julia (Anna Seniuk), Jola (Maja Komorowska), and Zosia (Stanislawa Celinska) are not as well defined as Tunia nor Kazia, to the point of their being almost interchangeable, yet the situations sketched, and the actors who play the three other main characters are wonderful. The only semi-memorable moment for Jola- a blond with a facial mole, is when she lectures Wiktor that, 'Moral authority is invoked by those who live immoral lives.' By contrast, there is one standout scene, when Kazia comes to a party in a dress she borrows, dances with Wiktor, and takes off her eyeglasses, that defines her character and the futility of mere words in capturing emotion. It is almost 'pure cinema.' She tips her head backward so he can kiss her, but when he does not, the look of disappointment on her face is palpable enough to be felt by every viewer. It is a moment no novel nor poem could capture, for it forces all the viewers into the same position, as they reflect on their own disappointments. It is in moments like this, that do not go wasted, that Wajda proves he is a great film director, even if his overall film falls shy of that claim. Everything in Maids Of Wilko has import, if not to a character than to the viewer, and that is a rarity. The film is complex without being overly complicated. It plays out like a Brontë or Dickens novel with more depth. The same is true for the handsome yet deep Wiktor, who never quite learns the power of the word, even if I do. It is: \u0085.",
         "I did enjoy this film - it's reflective, not too melancholy, not too taxing. It is a pleasant film. It seems to me like this film inspired Utomlennoe Solntzem too, so that's a good enough reason to watch it as any. Like that other film, Panny z Wilco paints a convincing and pretty picture of the life of a large family and the theme of a man returning to such a place after many years to confront a romance which was left unfinished is mirrored. 'Burnt By the Sun' does owe a lot to Mikhailkov's earlier 'An Unfinished Piece for the Mechanical Piano' as well. Based on a Chekhovian play, (this film also features a scene were the mystery of a past romance is revealed to all present through the telling of a story.) (In fact a tango is played, in Panny z Wilco, on the gramophone at one point that sounds suspiciously similar to the song of the title of that other film...) Jola, one of the four sisters at Wilko, keeps breaking into lovely spontaneous laughter (I'm not sure why I mention this, it's just that, it seems to me, spontaneous laughter deserves a mention).",
         "A Man returns to the place he was grown. He meets his female friends from his \"younghood\" in the villa nearby, and the movie starts to solve the history of relationships between the man and those women (which are sisters). In the film there should've been more cutting. It is nice when public has time to think during the movie and solve by themselves the history of this relationshipweb, but the scenes are too long. However some secenes are so beautiful that they are like paintings. For my generation (i have borned in the 1980's) this movie can be too difficult to process. The matters which the movie handled, didnt touch me, and it was hard to catch the viewpoint of the characters. Five stars out of ten.",
         "Chekhovian drama of simmering but subtle sexual politics as a rural household of ladies post WWI is thrown into emotional turmoil at the reappearance after a number of years of an eligible friend and neighbour. The women, with one exception, are not young but at that touchy, tragic age when they are clinging to the last traces of their good looks. There are five of them, apparently sisters, several with failed marriages, now with nothing to do but laze around their fine country home. The film works quite well as a study of such women, but it's really about Victor, a man in failing health and with intimations of mortality, who is on a solemn Tolstoyan quest for meaning. His emptiness is clearly linked to failed opportunities with women - they begin to suspect there is a particular reason. Walled in by his own weakness, regret, and resignation, the sudden attentions of all the women only throws him into more confusion. Comprised largely of social visits, there's a nice period atmosphere and the whole thing is understated, sombre and faintly tragic. Quite a fine film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films Molière",
         "Pierson Productions",
         "Polish Corporation for Film Production"
      ],
      "summaries": ["Set in the late '20s. A thirtyish young man, who heads a small factory, faints at the funeral of a close friend. He decides to go home to his aunt and uncle for a while, but gets involved with a family of five women who had been in love with him at one time though he had apparently loved only one, who, unknown to him, has died since his departure. The women are mainly disillusioned with life or estranged from husbands while the youngest has a crush on him."],
      "budget": 0
   },
   "movielensId": 156958,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "1979-09-04",
      "dvdReleaseDate": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 118,
      "movieId": 156958,
      "title": "Young Girls of Wilko",
      "mpaa": null,
      "actors": [
         "Daniel Olbrychski",
         "Anna Seniuk",
         "Maja Komorowska",
         "Stanislawa Celinska",
         "Krystyna Zachwatowicz",
         "Christine Pascal",
         "Zbigniew Zapasiewicz",
         "Zofia Jaroszewska",
         "Tadeusz Białoszczyński",
         "Paul Guers",
         "Kazimierz Brodzikowski",
         "Andrzej Grzybowski",
         "Jaroslaw Iwaszkiewicz",
         "Filip Jasienski",
         "Witold Kaluski"
      ],
      "imdbMovieId": "0079696",
      "originalTitle": "Panny z Wilka",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["n_-bZLKr7a0"],
      "plotSummary": "Set in the late '20s. A thirtyish young man, who heads a small factory, faints at the funeral of a close friend. He decides to go home to his aunt and uncle for a while, but gets involved with a family of five women who had been in love with him at one time though he had apparently loved only one, who, unknown to him, has died since his departure. The women are mainly disillusioned with life or estranged from husbands while the youngest has a crush on him.",
      "tmdbMovieId": 117483,
      "avgRating": 3.5,
      "releaseYear": "1979",
      "numRatings": 2,
      "posterPath": "/e8XM6OG216Kix6GU30GUmVyojHT.jpg"
   }
}