{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0163777",
      "video": false,
      "title": "Onimasa: A Japanese Godfather",
      "recommendations": [63411],
      "backdrop_path": "/gCSlpfZMvPwELC0Qg83f75rERKF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Masagoro Kiryuin - Onimasa",
               "gender": 2,
               "credit_id": "52fe4a84c3a36847f81d2783",
               "name": "Tatsuya Nakadai",
               "profile_path": "/aVwl2VgqRFaFLWlcGx2fSweZ24d.jpg",
               "id": 70131,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "54b15eafc3a368094e00265a",
               "name": "Masako Natsume",
               "profile_path": "/qVasAZInx90bjIechJdE4yNSwzS.jpg",
               "id": 82967,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "54b15ebf925141747e002188",
               "name": "Shima Iwashita",
               "profile_path": "/i5TqW7bMzMvfR6RZQ04ApKF0Jjz.jpg",
               "id": 76976,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "54b15ecdc3a3684138001c52",
               "name": "Tetsurō Tamba",
               "profile_path": "/lrWc0QjdAaP1VOWhwzczakdaEq.jpg",
               "id": 10071,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "54b15ede9251416fe10019b6",
               "name": "Akiko Kana",
               "profile_path": null,
               "id": 539107,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "54b15f47c3a368094e002665",
               "name": "Emi Shindo",
               "profile_path": null,
               "id": 140299,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "54b15f66925141746c002109",
               "name": "Akiko Nakamura",
               "profile_path": null,
               "id": 1113464,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "54b15f72c3a3680940002378",
               "name": "Mari Natsuki",
               "profile_path": "/oPCV2XYAJ4D1tK0OdJ2PPQbug5I.jpg",
               "id": 19589,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "54b15f8cc3a3680939002611",
               "name": "Mikio Narita",
               "profile_path": "/g9PEmxv4F0GxKjTx7ARwGLcxSOo.jpg",
               "id": 81277,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "54b15f97c3a3684138001c7f",
               "name": "Tatsuo Umemiya",
               "profile_path": "/anwRwO6z8JvkucVz8JuVaJuXU8Y.jpg",
               "id": 118703,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "54b15fa6c3a3684138001c81",
               "name": "Eitarô Ozawa",
               "profile_path": "/xWAn0r6pD2nbw3h7gcue9lmWvUI.jpg",
               "id": 97203,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "54b15fb1c3a3684012001ce1",
               "name": "Isao Natsuyagi",
               "profile_path": "/u2awlG2E2Py61MrIrjoLDUhdbPE.jpg",
               "id": 236090,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "54b15fca9251416fe10019d5",
               "name": "Hideo Murota",
               "profile_path": "/vDoABc3QM8MYOrxQLn0xfUl3vs5.jpg",
               "id": 120348,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "54b15fe1c3a3684138001c8d",
               "name": "Ryôhei Uchida",
               "profile_path": "/y9UbgObo6wBByMuoHayoU7UW3mW.jpg",
               "id": 226747,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "54b15ff2c3a3684138001c8f",
               "name": "Kei Yamamoto",
               "profile_path": "/gZHYOeYuzdA2syDbsM6lWbikwyG.jpg",
               "id": 123857,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "54b160269251412ae700158d",
               "name": "Katsuhiko Watabiki",
               "profile_path": null,
               "id": 1411892,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "54b1603192514107e0000c5d",
               "name": "Naoya Makoto",
               "profile_path": null,
               "id": 127835,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "54b1603b9251416fe10019df",
               "name": "Isamu Ago",
               "profile_path": null,
               "id": 1147132,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 2,
               "credit_id": "54b160409251412ae7001593",
               "name": "Koji Yakusho",
               "profile_path": "/mG4niNLZbyKHEfCA7EJP8vsi7rV.jpg",
               "id": 18056,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "54b16069c3a3680951002278",
               "name": "Kinzou Sakura",
               "profile_path": null,
               "id": 1411893,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a84c3a36847f81d276d",
               "name": "Hideo Gosha",
               "profile_path": "/hNOrJi1ApoBS9DOC5SyEKAvzSXx.jpg",
               "id": 125085,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a84c3a36847f81d2773",
               "name": "Hideo Gosha",
               "profile_path": "/hNOrJi1ApoBS9DOC5SyEKAvzSXx.jpg",
               "id": 125085,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a84c3a36847f81d2779",
               "name": "Kōji Takada",
               "profile_path": null,
               "id": 127388,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a84c3a36847f81d277f",
               "name": "Tomiko Miyao",
               "profile_path": null,
               "id": 1042157,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.695002,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 107641,
      "vote_count": 3,
      "budget": 0,
      "overview": "Onimasa is the egocentric boss of a small yakuza clan on Shikoku Island, whose criminal duties conflict with his self-image as a chivalrous samurai. His struggles with his boss, the Shikoku Godfather, and the tumultuous life of his adopted daughter, Matsue, form the backdrop of this epic tale of justice, obedience, and bloody vengeance.",
      "similar": [],
      "original_title": "鬼龍院花子の生涯",
      "runtime": 146,
      "poster_path": "/r2H27xVpxo2TZs4f8t5wyllOTdT.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toei Company",
         "id": 9255,
         "origin_country": ""
      }],
      "release_date": "1982-06-05",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hideo Gosha"],
      "runtime": 146,
      "synopsis": "Matsue is the adoptive daughter of the Kiryuin House, a small yakuza clan in Shikoku. Onimasa, their leader, is the last heir to a family of samurai. He is hard in business but respected by the poor because of his fairness. Matsue lives in the middle of this society, between gang wars and rivalries among the chief's mistresses. But when Onimasa takes a chivalrous attitude and finds himself on the side of train workers on strike, it annoys the Great Godfather of the island. The story starts in 1918, ends with the nearing of the Second World War.",
      "writers": [
         "Hideo Gosha",
         "Tomiko Miyao"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0163777/",
      "coverLink": null,
      "actors": [
         "Tatsuya Nakadai",
         "Masako Natsume",
         "Akiko Nakamura"
      ],
      "reviews": [
         "I just finished watching Hideo Gosha's masterpiece Onimasa for the second time in six months and I was simply blown away as much as I was when I first saw it. I've seen over 500 Japanese films and this is easily on my top five 5. I never understood the Japanese title which basically said \"The Life Of Hanako\". Onimasa and Matsue are the main characters of the film and Hanako is more of a secondary character. SPOILERS!!!! This is where the SPOILERS are located so don't read if you don't want to know anything. Basically the film is about Onimasa, a Yakuza boss with Samurai ethics and the film is told through the eyes of Matsue his adoptive daughter. We see their lives transpire and we watch the relationship the two of the them have. From the initial confusion, to Onimasa not wanting to give Matsue to any man, we see their bond as father/daughter build. The film main theme centers around these two characters, but there is of course a conflict. Onimasa eventually has a daughter with one of his many women and they name her Hanako. As the film continues we see that Hanako is more of an embarrassment to Onimasa, but he still loves her all the same. Hanako betrays Onimasa by joining Suenaga (the arch rival) and pretty much everyone around Onimasa dies because of it. Her betrayal leads Onimasa to jail, where he dies a shattered man with a broken spirit. All of this is observed by Matsue who at heart is the real daughter of Onimasa. End Of SPOILERS! Tatsuya Nakadai presents one of his best performances as Onimasa in this film. I have seen around 30 of his works and he is in top form in this film. Only in Harakiri and The Human Condition Trilogy does he excel even more. Onimasa is a Yakuza boss with noble intentions, but every so often we are reminded that even though he may have a good heart he still is a Yakuza boss. Hideo Gosha is a masterful director who made many great films in his career and I believe Onimasa is one of his most subtle. Don't expect much violence in this film until the end as this in not your usual Yakuza flick. This is more of a character piece, but it's two and half hour runtime blows right by you. If you like Japanese films, check it out. If you like Tatsuya Nakadai, check it out. If you simply like the medium of film check it out. You won't be disappointed.",
         "This movie is somewhat famous amongst Masako Natsume fans, and more than half the value of seeing this movie is in seeing beautiful Masako Natsume in her prime before she met her untimely death. Based on a novel by Sumiko Miyao, this movie tells the story of 50 years of human tapestry that is woven my the people of Masagoro Kiryuin's (Onimasa) clan seen from the vantage point of Matsue (Masako Natsume) who were adopted into this family when she was 12. Matsue witnesses the entire history of this family to its very end. The movie's character Onimasa is actually a former yakuza, and he's a merchant selling dried goods but his old habits die hard, and him and his clan is almost a clan of yakuza. But the focus is more on the women of this yakuza family, set in late Taisho to early Showa period of Japan in Kochi prefecture. The entire meaning of this movie is vague, since Hanako Kiryuin who is the title of this movie (in Japan) is just a spoiled girl, and does almost nothing. There are many good looking actresses in this movie asides from Masako Natsume, such as Emi Shindo, and Akiko Nakamura. A very young Nobuko Sendo makes her debut in the role of young Matsue. The one liner Mastue says towards the end of the movie \"Nametara ikanzeyo !!\" (Don't underestimate us !) was a famous one liner that remains in the annals of Japanese movie history. To be honest, the only reason to watch this film for me was to watch the beautiful Masako Natsume in action. She is that great in this movie. Thank you to director Hideo Gosha for changing the cast from Shinobu Ootake to Masako Natsume at the last minute.",
         "Hideo Gosha's Onimasa (1982) comes across as Japan's answer to The Godfather, while it doesn't quite live up to that billing-it was a very interesting film. Tatusya Nakadai always puts in a lively performance-this time as a chivalrous yakuza boss with several mistresses and the focus of this film is a girl he take sin as a daughter from a poor family. She has a very strong will and soon becomes his favorite because of her grit and strong will. She insists on being educated and becomes a teacher and eventually takes up with an intellectual and is the de facto narrator of the story of the rise and fall of Onimasa. The story is set in the Taisho era and the set designs ad to the overall impression of the film. I can't help but think the dog fighting scenes earlier in the film would have caused a certain amount of controversy in America. Overall it was a entertaining film.",
         "Shown in the Film Forum's 28-film Tatsuya Nakadai retrospective (NYC, Summer 2008) under the title \"Onimasa,\" Hideo Gosha's 1982 gangster family epic \"Kiryûin Hanako no shôgai\" fully qualifies as \"The Japanese Godfather.\" Is there any doubt that Gosha hoped to cash in on the box office and Academy Award successes of its U.S.-made predecessors, \"The Godfather\" (1972) and \"The Godfather Part II\" (1974)? For me, at least, and, I suspect, for others who are not charmed by Scorsese-style glamorized gangsters and their macho excesses and despite its two awards and nine Japanese Academy nominations, this multi-decade saga of the Kiryûin clan — patriarch Masagaro (aka Onimasa), wife Uta, adopted daughter Matsue, biological daughter Hanako and Onimasa's household staff of bully boys, servants and concubines — and its enemies amounts to a colossal waste of time, treasure and talent. This is not to say that Nakadai and company did not turn in highly skilled and memorable performances. They certainly did that and, in the process, reached every step on an actor's emotive ladder from extreme subtlety to massive scenery-chewing. Nevertheless, the great Nakadai's frequent full-circle mood changes were not always fully convincing, drawing attention to the actor and away from the character. (Was the director to blame for these lapses?) The dreadful music by Mitsuaki Kanno left this reviewer wondering whether or not it was intentionally ugly. An underlying theme of \"Onimasa\" was its portrayal of 20th century Japanese gangsters as cartoonish reincarnations of the ancient samurai caste (the armed enforcers of feudal rule) in the era of modern capitalism. This leitmotif could have been the basis for significant socio-historical observations but the film does not pursue such lofty aims. Instead, while Gosha does not ignore Japan's tumultuous labor struggles of the 1930s, his approach is the all-too-familiar one of market-oriented filmmakers: subdued sympathy mixed with trivialization. Thus, at the behest of his Big Boss, Suda, (who is seen getting his orders from the railroad owner), Onimasa tries to intimidate the leaders of a railway strike into submission. But the forthright and courageous behavior of one of these men, Tanabe, (which includes taking a vicious beating without saying \"uncle\") causes Onimasa to undergo a change of heart. (The word \"capitalism\" actually appears in this sequence!) The gangster then risks his position by defying the Big Boss and, even more unbelievably, invites Tanabe to become his son-in-law! But it is one thing to sentimentalize a gangster and quite another to show more than a modest degree of sympathy for a \"red.\" Subsequently, the politically-demoralized Tanabe describes himself as \"too weak.\" To avoid interfering with their glamorization, we are not shown the sordid details of the means by which the gangsters extract their income. Even the English subtitles conspire in this effort. Inexplicably, the word \"yakuza\" (gangster) is rendered repeatedly as the much tamer \"gambler.\" For me, the only rewarding aspect of this gangster soap was its female component. Several of the women and girls in this epic not only inhabited meaty and pivotal roles but acquitted themselves admirably, with power and guts. The character of adopted daughter Matsue was an especially compelling one, both played as a girl by Nobuko Sendo and as a woman by Masako Natsume. Growing up under the unfeeling \"care\" of Onimasa's unloved wife, the tough-as-nails Uta (played by Shima Iwashita), the girl becomes beloved and protected by the gang of ruffians that also inhabits the house, in a relationship reminiscent of Donizetti's opera \"La Fille du Regiment.\" Among the daily domestic chores of young Matsue is that of conveying to his concubines which one (or two) Onimasa has chosen for the night. Despite all efforts by her \"family\" to reduce her to servant status, Matsue insists on attending primary school and, after she secretly passes her examinations, high school. When \"father\" Onimasa vigorously objects that girls don't need high school, the willful Matsue prevails anyway. (There is more than a taste here of the oppression and degradation of women in male-dominated society and Gosha certainly deserves credit for making it unmistakable.) Maturing into an educated, perceptive and courageous woman, Matsue was, for me, a symbol of what this film could have been. Also powerful was Uta's death scene, in which she achingly recalls her husband's original love for her. These humane touches, however, were not sufficient to counteract the film's many repugnant qualities. It is unfortunate that Gosha's evident compassion for human suffering did not fully inform his understanding of society in general. Barry Freed"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Haiyuza Eiga Hoso Company",
         "Toei Company"
      ],
      "summaries": ["A yakuza melodrama, covering decades in the lives of Boss Onimasa, his adopted daughter Matsue, and his biological daughter Hanako."],
      "budget": 0
   },
   "movielensId": 156972,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1982-06-05",
      "dvdReleaseDate": null,
      "directors": ["Hideo Gosha"],
      "runtime": 146,
      "movieId": 156972,
      "title": "Onimasa: A Japanese Godfather",
      "mpaa": null,
      "actors": [
         "Tatsuya Nakadai",
         "Masako Natsume",
         "Shima Iwashita",
         "Tetsurō Tamba",
         "Akiko Kana",
         "Emi Shindo",
         "Akiko Nakamura",
         "Mari Natsuki",
         "Mikio Narita",
         "Tatsuo Umemiya",
         "Eitarô Ozawa",
         "Isao Natsuyagi",
         "Hideo Murota",
         "Ryôhei Uchida",
         "Kei Yamamoto",
         "Katsuhiko Watabiki",
         "Naoya Makoto",
         "Isamu Ago",
         "Koji Yakusho",
         "Kinzou Sakura"
      ],
      "imdbMovieId": "0163777",
      "originalTitle": "鬼龍院花子の生涯",
      "genres": [
         "Action",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Onimasa is the egocentric boss of a small yakuza clan on Shikoku Island, whose criminal duties conflict with his self-image as a chivalrous samurai. His struggles with his boss, the Shikoku Godfather, and the tumultuous life of his adopted daughter, Matsue, form the backdrop of this epic tale of justice, obedience, and bloody vengeance.",
      "tmdbMovieId": 107641,
      "avgRating": 3.5,
      "releaseYear": "1982",
      "numRatings": 2,
      "posterPath": "/r2H27xVpxo2TZs4f8t5wyllOTdT.jpg"
   }
}