{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "cyberpunk",
         "id": 12190
      }],
      "imdb_id": "tt3975556",
      "video": false,
      "title": "Jackrabbit",
      "recommendations": [
         203552,
         197631
      ],
      "backdrop_path": "/dPxKyhOudIEezV7FfUUtFcmDTa3.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Screen-Space",
         "id": "5656132d925141018f00512b",
         "content": "\"Ranney and co-writer Destin Douglas have honoured the non-conformist stance of their protagonists and delivered a dark, thoughtful take on small-scale insurgent destabilisation...\"\r\n\r\nFull review here: http://screen-space.squarespace.com/reviews/2015/10/27/jackrabbit.html",
         "url": "https://www.themoviedb.org/review/5656132d925141018f00512b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Simon",
               "gender": 0,
               "credit_id": "5726b479c3a368384100382a",
               "name": "Josh Caras",
               "profile_path": "/9OjmgrBp3TDE4OBUuqtXrWkdws5.jpg",
               "id": 96529,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Max",
               "gender": 0,
               "credit_id": "5726b489c3a368549e000b11",
               "name": "Ian Christopher Noel",
               "profile_path": null,
               "id": 1613971,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Grace",
               "gender": 0,
               "credit_id": "5726b4979251417782004773",
               "name": "Joslyn Jensen",
               "profile_path": "/d8NoRFjkx84tErXX8RJIV97GZVH.jpg",
               "id": 931594,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Paul Bateson",
               "gender": 2,
               "credit_id": "5726b46992514177440047f2",
               "name": "Reed Birney",
               "profile_path": "/yvfIKYv4B3enSxNXTiOoMiLTXUM.jpg",
               "id": 163774,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Simon's Father",
               "gender": 0,
               "credit_id": "5726b4a8c3a368549e000b1e",
               "name": "Robert Ansley",
               "profile_path": null,
               "id": 1613972,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dream Girl",
               "gender": 0,
               "credit_id": "5726b4b992514154430015da",
               "name": "Cameron Covert",
               "profile_path": null,
               "id": 1613973,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Patrol Woman",
               "gender": 0,
               "credit_id": "5726b4c6c3a368549e000b28",
               "name": "Regina Ting Chen",
               "profile_path": null,
               "id": 1613974,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Stephen Greyerson",
               "gender": 0,
               "credit_id": "5726b4d8c3a36851e500158b",
               "name": "Graham Cumberbatch",
               "profile_path": null,
               "id": 1613975,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Cynthia Gryerson",
               "gender": 0,
               "credit_id": "5726b4e6c3a3683c8500020c",
               "name": "Jennifer Cumberbatch",
               "profile_path": null,
               "id": 1613976,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Samantha Ross",
               "gender": 0,
               "credit_id": "5726b4f5c3a36851e5001594",
               "name": "Cinda Donovan",
               "profile_path": null,
               "id": 1613977,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Laura",
               "gender": 0,
               "credit_id": "5726b509c3a3685bd9000b50",
               "name": "Alexandria Payne",
               "profile_path": null,
               "id": 1552462,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Max's Neighbor",
               "gender": 0,
               "credit_id": "5726b521c3a36854ff0013af",
               "name": "Sarah Coltman",
               "profile_path": null,
               "id": 1613978,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5516e55dc3a36862f900092e",
               "name": "Carleton Ranney",
               "profile_path": null,
               "id": 1446709,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5726b55ec3a3683c85000226",
               "name": "Carleton Ranney",
               "profile_path": null,
               "id": 1446709,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5726b56ac3a3685871001456",
               "name": "Destin Douglas",
               "profile_path": null,
               "id": 1613979,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5726b5869251415443001608",
               "name": "Will Berman",
               "profile_path": null,
               "id": 1116726,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5726b5a49251411a14007256",
               "name": "Olivia Peebles",
               "profile_path": null,
               "id": 1613980,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "586b7e639251415d31004489",
               "name": "Ashley Connor",
               "profile_path": null,
               "id": 1326012,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.04736,
      "production_countries": [],
      "id": 333123,
      "vote_count": 7,
      "budget": 0,
      "overview": "Following a worldwide event known as The Reset, humanity rebuilds a society with aging mechanics where gleaming technology once stood. Surveillance now the status quo, society is slowly putting its shattered pieces back together under a watchful eye. After a friend’s suicide leaves behind a mysterious computer drive, a young computer prodigy and a shadowy hacker join together to decipher the clues that he’s left behind. The youthful creators of Jackrabbit have successfully constructed a world, which we haven’t previously seen on film. Mixing retro production design with slick storytelling, they deliver a cinematic dissonance that will result in a shock to the senses.",
      "similar": [
         605,
         604,
         9323,
         603,
         2048,
         296,
         5548,
         335984,
         87101,
         5550,
         11633,
         218,
         534,
         19,
         78,
         281,
         17431,
         262543,
         263115,
         157336
      ],
      "original_title": "Jackrabbit",
      "runtime": 101,
      "poster_path": "/MmPnrZ3AJtvRlCLFYTovGztogn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2015-04-18",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.jackrabbitfilm.net/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carleton Ranney"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Destin Douglas",
         "Carleton Ranney"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3975556/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNmQ3YTM1NzItMTcwZC00ODA0LWEzZjAtMGY1YTg5Y2NlZDYzXkEyXkFqcGdeQXVyNDMxMjgwOA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Reed Birney",
         "Josh Caras",
         "Ian Christopher Noel"
      ],
      "reviews": [
         "8.1 of 10. As science fiction or cyberpunk, this would have been better timed during the late 1980s or early 1990s. Nonetheless, it's an entertaining and insightful look at one possibility if the wi-fi and other elements that enable current computer and mobile phone technology no longer function. The world is essentially now less the mobile tech and massive media structure. Broadcasting is limited to radio-like communication and there remains a slow, phone modem like Internet. Beyond that it's essentially another variation of a smart but naive young adult driven by success discovering himself and the world. Despite the lack of major studio money and actors, it is well cast and acted enough not to get in the way of the film's flow.",
         "This film achieves a lot with limited sets, low tech, and a handful of unknown actors. The dystopian mood is well-maintained through not only the soundtrack but with camera angles, colour palette and lighting; all of these speak to both technical skill and consistency of directorial vision. The lead characters are bare-bones but not stereotypical. They appear genuinely vulnerable, in keeping with their surroundings. The plot is not unique - self-serving and ostensibly socially-protective corporation versus the ordinary man - but the psychological aspects are well done. There are moral choices to be made. A surprisingly good low-budget indie SF film.",
         "I gave this a 10/10. For me this movie had small slices of nostalgia from my childhood, mixed with my adult interests in cyberpunk and tech. There was so many amazing qualities about this movie that hit you somewhere deep in your brain and really pull you into the atmosphere of the film. If you are at all into the cyberpunk genre, please watch this film because they got it right. This movie is one that I'm going to be watching over and over again. I love coming on IMDb and seeing that only a handful of people have reviewed a movie and I was one of them. But I really like to see more people get stoked off this film. Big thanks to everyone who helped make it, you've all inspired me.",
         "Good Idea, Probably not enough money ! I watched the whole thing, Something was missing!Low budget somewhere out In the dessert, Good acting newbies although the screenplay could have Included a little more Intensity . Although It had a great story line, It lacked In some of that Hollywood Intensity !It's almost a documentary , because It doesn't Incorporate the luster and Intensity Of an actual movie,with all the action and Drama!, perhaps a little Exaggeration,. It's a good movie, It contains a lot of drama although It seems to drag on as It has nothing else ! As I said I watched the whole thing, and the whole time I was waiting for something Exciting, It never happened!",
         "The film takes place in Austin, Texas now known as \"City 6\" twenty-five years after \"the reset.\" The reset was never fully explained and provided one of those mystery aspects that was unnecessary. The world lost most of its modern electronics (we see VHS and record players) and there is a constant cloud cover over City 6. Announcements about the dangers of airborne radioactive contamination that is present is made daily. People take iodine pills. The story centers on Simon (Josh Caras) an electronic geek who recently got a job with VODO, a corporation that are the benign rulers of the city. Currency is all electronic bits. Food and gas is available in supply, enough to prevent a Mad Max world. After the suicide of Eric, Simon meets Max (Ian Christopher Noel) an anarchist type electronic wizard who wants out of the city. He gets a coded message that sends him and Simon out to look for the mysterious answers following obscure clues. THEME PLOT SPOILER: The film asks the question of security vs. freedom. VODO provides for the people and keeps them alive. \"Technology maintains stability.\" They don't want more people to come in and overload their capacity to produce. Nor do they want people to leave and risk telling people about the City. There is something else out there, but what? Other cities? Desert? Radiation? Note: Iodine pills would no longer be needed after 25 years. The question would be was there something else in the pill, or was this something the script writers flubbed on their research? Guide: F-word. No sex or nudity. The back of Joslyn Jensen neck was the only eye candy",
         "Watched the screening last in Texas Theater with Writers and Director. Carleton Ranney is very talented and has lot of potential. The movie has a very thrilling premise and at points it shows directional excellence. Music score is pretty kick ass, very engaging and goes completely in sync with situation. After the movie Carleton Ranney and Destin Douglas answered the questions and described the writing and direction process. This type of talent should be supported and encouraged. The movie has a very edgy feelings. It is lot better than other indie thrillers. It has repeat value as you will discover something new during next watch. Overall a very entertaining and engaging film. Would specially appeal to young moviegoers. Strong acting specially by Ian Christopher Noel .",
         "Don't expect explosions, aliens or CGI of any sort. It isn't even too plot driven and none of the twists are too surprising. What is surprising are the sophisticated cinematic techniques that create a film reminiscent of Altman, Aldridge or Hal Hartley. Background conversations, radio broadcasts, meticulously constructed sets, and a naturalistic, somewhat flat acting style create a palpable world with believable characters. All sorts of objects turn out to have significance and there is a door that practically becomes a character. All sorts of weird stuff turns out to have reasonable explanations by the end. Like the similar film \"Advantageous\" it explores themes of courage, honor and love. The recent news story about the nuclear weapon systems being run by ancient code had me remembering my days programming for Lockheed in the '80's and this film gets that world. When one of the characters talks about going to a city in the desert where you could make a lot of money, I thought he meant relocating his company to Austin, but that turns out to be where the director was born and this was filmed. It was tapped to be the new silicon Valley during the Reagan administration, and, according to this movie, the dress code didn't change much.",
         "After watching this film I must admit I have no idea what the heck it was about!! Yet I must say that the sound track was probably one of the best sound tracks I have ever heard! OK I did understand this film a little but again the sound track was an absolutely amazing listen! The mood was set perfectly through out and it kept me wanting to keep on watching! I am a person that needs music to keep me going with a film and this film was exceptionally well sounded! The mood was well rounded towards each scene and the seemingly \"bad\" lighting was absolutely perfect! I would recommend watching this if you are a sound track person!"
      ],
      "genres": [
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Vopo Technologies"],
      "summaries": ["When a friend's suicide leaves behind a mysterious computer drive, a fringe hacker and an accomplished computer technician come together to decipher the message left in his wake."],
      "budget": 0
   },
   "movielensId": 157098,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-04-18",
      "dvdReleaseDate": null,
      "directors": ["Carleton Ranney"],
      "runtime": 101,
      "movieId": 157098,
      "title": "Jackrabbit",
      "mpaa": "",
      "actors": [
         "Josh Caras",
         "Ian Christopher Noel",
         "Joslyn Jensen",
         "Reed Birney",
         "Robert Ansley",
         "Cameron Covert",
         "Regina Ting Chen",
         "Graham Cumberbatch",
         "Jennifer Cumberbatch",
         "Cinda Donovan",
         "Alexandria Payne",
         "Sarah Coltman"
      ],
      "imdbMovieId": "3975556",
      "originalTitle": "Jackrabbit",
      "genres": [
         "Drama",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["8HO5soEUvZE"],
      "plotSummary": "Following a worldwide event known as The Reset, humanity rebuilds a society with aging mechanics where gleaming technology once stood. Surveillance now the status quo, society is slowly putting its shattered pieces back together under a watchful eye. After a friend’s suicide leaves behind a mysterious computer drive, a young computer prodigy and a shadowy hacker join together to decipher the clues that he’s left behind. The youthful creators of Jackrabbit have successfully constructed a world, which we haven’t previously seen on film. Mixing retro production design with slick storytelling, they deliver a cinematic dissonance that will result in a shock to the senses.",
      "tmdbMovieId": 333123,
      "avgRating": 2,
      "releaseYear": "2015",
      "numRatings": 6,
      "posterPath": "/MmPnrZ3AJtvRlCLFYTovGztogn.jpg"
   }
}