{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "despair",
            "id": 2300
         },
         {
            "name": "car crash",
            "id": 9844
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "embezzlement",
            "id": 163072
         },
         {
            "name": "co-signer",
            "id": 237925
         },
         {
            "name": "imminent scandal",
            "id": 237926
         },
         {
            "name": "missing money",
            "id": 237927
         },
         {
            "name": "adult children",
            "id": 237928
         }
      ],
      "imdb_id": "tt0025883",
      "video": false,
      "title": "This Side of Heaven",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martin Turner",
               "gender": 2,
               "credit_id": "533577c59251414463004387",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Francene Turner",
               "gender": 1,
               "credit_id": "533577d6925141445a0043af",
               "name": "Fay Bainter",
               "profile_path": "/22FE8P03vu4XDNqDBatWjiX2uVC.jpg",
               "id": 20366,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Jane Turner",
               "gender": 1,
               "credit_id": "533577ec92514144540043e5",
               "name": "Mae Clarke",
               "profile_path": "/9u2HttpMOejKjrF61eOdjE9uw8c.jpg",
               "id": 29814,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Birdie",
               "gender": 1,
               "credit_id": "533577fc9251414457004306",
               "name": "Una Merkel",
               "profile_path": "/hBDjQyU2xJ9vELw0H63igS7ugSD.jpg",
               "id": 13963,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Seth Turner",
               "gender": 2,
               "credit_id": "53357814925141445d004452",
               "name": "Tom Brown",
               "profile_path": "/gHteMYdsKoKLKGgY9cA65WjPEjg.jpg",
               "id": 89687,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Peggy Turner",
               "gender": 1,
               "credit_id": "5335783092514144600043ca",
               "name": "Mary Carlisle",
               "profile_path": "/daePfBGgJVEdLQIW1TBRhresG3Y.jpg",
               "id": 103498,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Walter",
               "gender": 2,
               "credit_id": "53357847925141445700430a",
               "name": "Onslow Stevens",
               "profile_path": "/giCw0flQnjJfTdlkH2A9yRD48Tg.jpg",
               "id": 89091,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Freddie",
               "gender": 2,
               "credit_id": "5335785692514144540043eb",
               "name": "Dickie Moore",
               "profile_path": "/6FM8aoifzR8ByjqTH8mxy6wtkzE.jpg",
               "id": 10165,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Vance",
               "gender": 2,
               "credit_id": "53357867925141445a0043b5",
               "name": "Edward Nugent",
               "profile_path": "/qurCHN7gLek8HhEHJt567nE8MU1.jpg",
               "id": 30006,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Hal",
               "gender": 0,
               "credit_id": "5335787792514144540043ee",
               "name": "Henry Wadsworth",
               "profile_path": "/zscoJsbwvqF0omgwBXddn8Pc6AR.jpg",
               "id": 32433,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "William Barnes",
               "gender": 2,
               "credit_id": "5335788a925141444e0042c4",
               "name": "C. Henry Gordon",
               "profile_path": "/pl6TAmN7tpmfvrXeSy5lGtalPT1.jpg",
               "id": 13356,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Nurse Healy (uncredited)",
               "gender": 1,
               "credit_id": "53da302b0e0a2652f0002020",
               "name": "Geneva Mitchell",
               "profile_path": "/9VJaEzdDuT5HUCStkLiJnT0ihcE.jpg",
               "id": 233114,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "533577ad92514144600043c0",
               "name": "William K. Howard",
               "profile_path": "/5VqAzpksHV85oXFjWGw1E7GYv0T.jpg",
               "id": 89632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53da2f500e0a2652e5001f2e",
               "name": "Edgar Allan Woolf",
               "profile_path": null,
               "id": 1505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "53da2f620e0a2652d900203f",
               "name": "Florence Ryerson",
               "profile_path": null,
               "id": 9053,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "53da2f730e0a2652dc001f06",
               "name": "Zelda Sears",
               "profile_path": "/ddj3EwdzAWm4zQLuZQ57rpg4v0A.jpg",
               "id": 590253,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "53da2f840e0a2652dc001f08",
               "name": "Eve Greene",
               "profile_path": null,
               "id": 111434,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "53da2f950e0a2652d9002047",
               "name": "Marjorie Bartholomew Paradis",
               "profile_path": null,
               "id": 1348059,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "53da2faf0e0a2652df001f9b",
               "name": "John W. Considine Jr.",
               "profile_path": "/geUMaMJP81K4lrL6HsJcWWkOpuS.jpg",
               "id": 126676,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53da2ff00e0a2652e800214e",
               "name": "Frank E. Hull",
               "profile_path": null,
               "id": 70982,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53da30040e0a2652e8002152",
               "name": "Fredric Hope",
               "profile_path": null,
               "id": 1348060,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54f9e0bb9251414390001d43",
               "name": "Harold Rosson",
               "profile_path": "/iaCiQJnVexTWFyfcvnamRICx8XQ.jpg",
               "id": 9057,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54f9e0c89251416fab0019a4",
               "name": "William Axt",
               "profile_path": "/uMpiKUoeCI9iwV0gVbPuXBIwirR.jpg",
               "id": 29967,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.364915,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 261684,
      "vote_count": 2,
      "budget": 0,
      "overview": "Lionel Barrymore stars in this 1934 drama about a man contending with personal and family problems.",
      "similar": [
         858,
         334,
         2288,
         401,
         470,
         13,
         112160,
         293768,
         1365,
         319,
         425,
         527,
         337,
         10054,
         303991,
         4599,
         687,
         11012,
         13205,
         15584
      ],
      "original_title": "This Side of Heaven",
      "runtime": 77,
      "poster_path": "/yqEWVvU0JbSYpVN1hUixMvRtLPo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1934-02-02",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William K. Howard"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Zelda Sears",
         "Eve Greene"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025883/",
      "coverLink": null,
      "actors": [
         "Lionel Barrymore",
         "Fay Bainter",
         "Mae Clarke"
      ],
      "reviews": [
         "The Turner Classic Network showed this film this evening, and it is well acted if a bit pat. Lionel Barrymore plays a company director who has been co-signing a series of checks that Edwin Maxwell (one of his partners) has been pushing on him as part of a scheme to save the firm during the depression. But he announces that the scheme is not working, and that it is a matter of time that the auditors (who are coming in a day) will uncover the defalcation that has occurred. Barrymore goes home worrying about the future. His home-life is usually a happy one, but he is aware of changes threatening his family's unity. His son (Tom Brown)is going to college, and trying to get into a prestigious fraternity. His younger daughter is also beginning a college career, but has fallen for one of the son's friends. His older daughter has two competing boyfriends, a reporter (Onslow Stevens) and an accountant (Edward Nugent), and has just announced the engagement to the accountant. And his wife (Fay Bainter) has written a novel that a Hollywood studio has optioned. Barrymore decides to commit suicide, after making certain that everything is set up for his family to continue. The defalcation is discovered by his potential son-in-law, who warns him and \"gives him a chance\" to flee before it is revealed (Maxwell has fled). In the meantime his younger daughter has almost gotten married, but stopped when she finds a cryptic note from Barrymore, and the son suffers a social disappointment and an automobile accident. But Barrymore returns home to commit suicide. Will he succeed or will he pull himself together to save his family. In some ways his performance here as Martin Turner, the businessman facing ruin and disgrace, is similar to his shipping tycoon in DINNER AT EIGHT, also facing business reverses. But Oliver, the shipping tycoon, never planned to kill himself (he had a serious heart condition that the pressures of his situation was worsening). His family is smaller (just the socially pretentious Billie Burke and his daughter). Martin Turner has a larger family with more individual problems that pull them apart. But in both films, when his physical situation and his social position are threatened, his family does reunite to save him. But while circumstances in DINNER AT EIGHT help force Oliver's wife and daughter to come back to their senses, it is the seriousness of Martin's problems that cause the Turners to circle their wagons around their family head. Barrymore was a fine actor, but he frequently had a tendency to hamminess (as did his brother John), but here he shows great restraint due to the circumstances of the story. As a result his performance here is pretty solid - one of his best. As for Bainter and the others they give good support. A soap opera tale, but it is a first rate production well worth watching.",
         "The mother of three young adults, first time novelist Fay Bainter (as Francene E. Turner) has just sold her story to a Hollywood studio. Citing his mom as a famous writer, handsome son Tom Brown (as Seth) hopes to join a college fraternity. Eldest daughter Mae Clarke (as Jane) is a young schoolteacher courted by newspaperman Eddie Nugent (as Vance Patterson), although she plans to marry auditor Onslow Stevens (as Walter Hamilton). Youngest daughter Mary Carlisle (as Peggy) is old enough to go out to the movies with date Henry Wadsworth (as Hal Jennings), and think about eloping... The excitement and happiness in the family is threatened when father Lionel Barrymore (as Martin Turner) is accused of embezzlement. To prevent both scandal and financial ruin awaiting his family, Mr. Barrymore decides to take drastic action... This story starts out slow and builds, due to a good cast presented nicely by director William K. Howard. In her search for an ice pick, comic relief maid Una Merkel (as Birdie) manages to be more amusing than annoying. Likewise the stereotypical interior decorator Bobby Watson (as Mr. Worthington) who agrees drapes are \"too gay.\" There is especially fine work from Barrymore, who can sometimes upstage his co-stars. Handing their dramatics especially well are Ms. Bainter and Mr. Brown, who are good with and without Barrymore sharing the screen. This was the first film for Bainter, a stage veteran. ******* This Side of Heaven (2/2/34) William K. Howard ~ Lionel Barrymore, Fay Bainter, Tom Brown, Mae Clarke",
         "Compelling hokum. Lionel Barrymore, in a variation of his trod-upon tycoon from \"Dinner at Eight,\" plays the doting, selfless head of an insensitive, selfish family. Wife Fay Bainter, having just sold a novel to the movies, is on a spending spree before heading to Hollywood; son Tom Brown has his heart set on joining a college fraternity; elder daughter Mae Clark is torn between two lovers; dithery sister Mary Carlisle has thoughts of eloping with her nitwit boyfriend. Meanwhile, Barrymore is facing scandal and prison on a trumped-up embezzlement charge, a crisis he withholds from his self-absorbed brood. Will the family rally to his side before he ends it all in suicide? The film is so cunningly constructed that we squirm in suspense in spite of our conviction that all must end well. It's the kind of skillful schmaltz that leaves you feeling at once satisfied and foolish. With Una Merkel as a knuckleheaded maid, saving Louise Beavers and Hattie MacDaniel the indignity of demeaning themselves.",
         "Fay Bainter was always a favourite aunt or the nicest neighbour on the block, the older person who is always a hit with the youngsters (ie \"Babes on Broadway\") and when, in her first film \"This Side of Heaven\", she played a lovely up to date mother she was just about perfect. Even though she was in her forties she had been on the stage since her childhood. Her complete naturalness and lack of artifice made her performances standout and she sometimes overshadowed the main performers (Katharine Hepburn in \"Quality Street\"). She had already made \"This Side of Heaven\" when she opened on Broadway in \"Dodsworth\" and she wasn't really impressed with movies but, fortunately, she gave them another try. This is the sort of \"feel good\" movie I really like. It is a lonely dinner for Martin Turner (Lionel Barrymore), the rest of the family seems to have previous engagements - Seth (Tom Brown) is trying his best to get accepted into his college fraternity (Edward Norris and Mickey Daniels) through bragging and big noting himself. Younger and very modern daughter Peggy (gorgeous Mary Carlisle) is determined to assert her independence after seeing \"Another Language\" at the cinema - while driving to college she and her nervous boyfriend (Henry Wadsworth) almost end up as Mr. and Mrs.!!! Jane (Mae Clarke) can't decide between stuffy dependable Walter (Onslow Stevens) and head in the clouds Vance (Eddie Nugent, whatever happened to him??) - I wonder who will win?? Oh, and mother Francene (Fay Bainter) has just sold the novel she has been writing (\"The Family\") to a Hollywood studio. Martin has a lot on his mind - he has been made an innocent dupe in his manager's (Edwin Maxwell, who else!!) $40,000 embezzlement of company funds. The auditors are in, the manager has absconded leaving Martin, as co-signer of the cheque, to bear the blame alone. And Walter has so little faith in him that he is organising for Martin to leave the country to lessen the family's shame. Martin cannot bear to spoil Francene's happiness - she has come home with a Hollywood contract and brimming with enthusiasm. In fact everybody is so involved in their own little lives that they can't see anything wrong with Martin's behaviour. Francene can but she thinks his nervousness is due to the separation they will face when she goes to Hollywood for a few weeks. Of course the next day everything comes unstuck but once Francene realises the enormity of the situation she behaves like a typical MGM mother of the mid to late 30s, stoical but caring and loving. Lionel Barrymore put his stamp on these kind of roles - the sensible, wise parent that everyone looks up to. He really comes into his own during the last half. He has decided the best way for his family to deal with the shame is for him to end it all. He does take pills but suddenly the police are at the door - it seems his son has been involved in a car accident, driving home from college upset by the fact that he hadn't made the Fraternity. Groggily Martin rushes to the hospital, Seth is okay but now it is touch and go whether Martin will make it - now he realises how much his family need and depend on his support. The cast seems to have a lot of chemistry - Seth and his dad especially, kidding about hats, the hospital scene and different issues that arose in those lovely innocent days. Not forgetting Una Merkel as the laconic cook Birdie - \"Have you seen my ice pick\" - wow, she did everything the studio threw at her and did it excellently. Even little Dickie Moore has a cute bit as a little boy kept in after class \" that was the apple I gave the teacher, I fished it out of the gutter\"!! Mary Carlisle proved she was more than just a pretty face with her portrayal of the very modern Peggy, who is determined to be a new woman. Big things had been expected for Mae Clarke once, her friend Barbara Stanwyck had a lot of faith in her talent but after 1934 most of her work was to be found in programmers. MGM may have remembered Barrymore's performance in films like this when they were casting \"A Family Affair\" which was the debut of the Hardy family. Unfortunately when the series finally got under way, Barrymore had had a serious accident and Lewis Stone inherited his role.",
         "This is a bit of an odd film. Although the wonderful Lionel Barrymore is the star here, he doesn't show up in the early minutes of the film at all. I thought -- what kind of film is this. It starts off so frivolously. But that is exactly what makes it an ultimately strong film. You might say that the theme of the film is that a family member can be hiding a terrible secret that could destroy him. Meanwhile, not knowing of the tragedy facing the family member, the rest of the family goes on with their lives, seriously bemoaning comparatively frivolous problems. It isn't that they're being selfish...just oblivious. Here, Lionel Barrymore (the father) is the family member in crisis -- about to be accused of embezzlement for something that was not his fault (although he knew of the indiscretion). His wife is abuzz with her sudden success as an author and screenwriter, and the young adult kids are wrapped up in fraternities and possible elopements. It's quite good, but the problem with this film is that the film comes to its high point and things are all resolved way to quickly. Why? Well, this film was made in the days of double features, so a film like this came in at under 80 minutes, where extending it to just another 10-15 minutes -- 90 minutes -- would have allowed for a tremendous improvement of the conclusion of the film. Instead, we see the buildup to crisis that seems to suddenly descend into an all too common \"they all lived happily ever\" after scenario that seems very weak. I almost always find Lionel Barrymore to be a very interesting actor, and I did again here. This was the wonderful Fay Bainter's first film role, and, as always, she's a gem. While the remainder of the cast are supporting actors who do their job, no one stands out, perhaps because the characters are not developed sufficiently. Perhaps the primary supporting actor was the young Tom Brown, who does fairly well as the son in this very old-fashioned film. Una Merkel is rather wasted in this film. Despite these criticisms, this film is worth watching because of its two stars -- Barrymore and Bainter -- a classic pairing. And, this is that unusual early film that dealt with attempted suicide. Maybe with the limitations of 1934, it's pretty decent.",
         "Lionel Barrymore often drives me nuts--the same gestures and vocal inflections, playing so many similar roles so similarly. But in this little MGM soap opera, playing a good family man caught up in a potentially devastating financial crisis at work (it's almost like a warmup for \"It's a Wonderful Life,\" with him as George instead of Potter), he's quiet and unhammy and very moving. He's well supported by a similarly restrained Fay Bainter as his wife, and the whole family is convincing--Mae Clarke as the sensible daughter, Tom Powers as the status-conscious son, Una Merkel as the gossipy maid. No surprises, and the plot is resolved by a deus ex machina one doesn't believe for a minute, but it's a simple story well told. And it shows how good Lionel could be when he held back; he's just as good the following year in \"Ah, Wilderness!\", in a not-that-different part.",
         "I've got to tell you that this is a film that you'll either love or hate. If you are looking for realism, this movie is NOT a good bet for you. The way the plot works out in the end is ridiculously impossible...but, it's also grandly entertaining and worth seeing--particularly if you are a softy for a good old fashioned melodrama. The story begins with Fay Bainter being offered a lucrative contract with Hollywood to work as a screenwriter, as the studio executives love her recent book about a fictionalized family...that actually was based on her own. This idyllic family, however, is not so idyllic after all as you soon see. The husband (Lionel Barrymore) has been duped by an evil business partner and, as a result, could be arrested for embezzlement. The daughters are both involved with men and both seem to be going in the wrong direction. And the son is brash and a bit obnoxious--and heading for a fall at college. All these stories converge for a truly exciting ending--one that, while contrived, is dynamite. Exciting, extremely well acted and entertaining, I'd recommend this just for Barrymore's fine performance but there's so much more to this worth seeing. By the way, look for a small but interesting scene about an obviously gay decorator. Up to the time when the Production Code was updated and enforced in 1934, such over the top characters were relatively common in films. While not the most complimentary portrayal, starting soon after \"This Side of Heaven\", gay characters would disappear in films for the next few decades."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["A family man. (Lionel Barrymore) becomes innocently involved in an embezzlement."],
      "budget": 0
   },
   "movielensId": 157017,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-02-02",
      "dvdReleaseDate": null,
      "directors": ["William K. Howard"],
      "runtime": 77,
      "movieId": 157017,
      "title": "This Side of Heaven",
      "mpaa": "",
      "actors": [
         "Lionel Barrymore",
         "Fay Bainter",
         "Mae Clarke",
         "Una Merkel",
         "Tom Brown",
         "Mary Carlisle",
         "Onslow Stevens",
         "Dickie Moore",
         "Edward Nugent",
         "Henry Wadsworth",
         "C. Henry Gordon",
         "Geneva Mitchell"
      ],
      "imdbMovieId": "0025883",
      "originalTitle": "This Side of Heaven",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Lionel Barrymore stars in this 1934 drama about a man contending with personal and family problems.",
      "tmdbMovieId": 261684,
      "avgRating": 4,
      "releaseYear": "1934",
      "numRatings": 1,
      "posterPath": "/yqEWVvU0JbSYpVN1hUixMvRtLPo.jpg"
   }
}