{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "doctor",
            "id": 13005
         }
      ],
      "imdb_id": "tt0024411",
      "video": false,
      "title": "One Man's Journey",
      "recommendations": [],
      "backdrop_path": "/pBkmgni0S9hc6NSbd8UL9CfgdJs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Eli Watt",
               "gender": 2,
               "credit_id": "52fe4dd4c3a36847f826fe51",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Sarah",
               "gender": 0,
               "credit_id": "52fe4dd4c3a36847f826fe59",
               "name": "May Robson",
               "profile_path": "/gdefOJA7rBFFuJg5PPaTGS6izH8.jpg",
               "id": 13816,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Letty McGinnis",
               "gender": 1,
               "credit_id": "52fe4dd4c3a36847f826fe5d",
               "name": "Dorothy Jordan",
               "profile_path": "/AwmgQVCqSlVyLkHSImvKpaKHEnf.jpg",
               "id": 30558,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jimmy Watt",
               "gender": 2,
               "credit_id": "52fe4dd4c3a36847f826fe55",
               "name": "Joel McCrea",
               "profile_path": "/v2CgGPUo0BMs8Iiz2T4hU09glwf.jpg",
               "id": 20501,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Joan Stockton",
               "gender": 1,
               "credit_id": "5322cd87c3a3685745004e16",
               "name": "Frances Dee",
               "profile_path": "/qXYfQyUa83g4tkdFMIU3VLBsDao.jpg",
               "id": 95117,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "McGinnis",
               "gender": 2,
               "credit_id": "53238122c3a36828ba004452",
               "name": "David Landau",
               "profile_path": "/2NNjWKbeIdibyXcPrzRn5JKCVlF.jpg",
               "id": 131813,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Jimmy Watt - Age 6",
               "gender": 0,
               "credit_id": "5323813ac3a3685745005da7",
               "name": "Buster Phelps",
               "profile_path": "/64VuZSYUs8Pl4fhkym4RXK0acHc.jpg",
               "id": 1044770,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "May Radford",
               "gender": 1,
               "credit_id": "53238163c3a368573c005c58",
               "name": "June Filmer",
               "profile_path": null,
               "id": 1033448,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Bill Radford",
               "gender": 0,
               "credit_id": "53238176c3a368572e005c9b",
               "name": "James Bush",
               "profile_path": "/sSnb6rCTmMrV5jhJItEwYroLDcQ.jpg",
               "id": 101882,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "John Radford",
               "gender": 2,
               "credit_id": "5323819fc3a3685725005ccc",
               "name": "Oscar Apfel",
               "profile_path": "/ztHtc1bfV7whJ21lsvzPV9lT1zI.jpg",
               "id": 128401,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Dr. Babcock",
               "gender": 0,
               "credit_id": "532381b5c3a36824b5004c85",
               "name": "Samuel S. Hinds",
               "profile_path": "/3VrGfCOsIdEvsbJPodAEqHRsmp1.jpg",
               "id": 17756,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Dr. Tillinghast",
               "gender": 0,
               "credit_id": "532381ccc3a368573c005c65",
               "name": "Hale Hamilton",
               "profile_path": "/5L4Z2sUbc5M4pso9ZmBh1Hb3asM.jpg",
               "id": 233118,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Doctor at Banquet",
               "gender": 2,
               "credit_id": "532381ddc3a3685745005dc8",
               "name": "Colin Kenny",
               "profile_path": null,
               "id": 120445,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Dance Extra (uncredited)",
               "gender": 2,
               "credit_id": "5323823ec3a3685745005dd0",
               "name": "Dave O'Brien",
               "profile_path": "/2LVRGnrd1vHwgrJxCaJCvMliduy.jpg",
               "id": 118633,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dd4c3a36847f826fe41",
               "name": "John S. Robertson",
               "profile_path": null,
               "id": 29571,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd4c3a36847f826fe47",
               "name": "Lester Cohen",
               "profile_path": null,
               "id": 1265280,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd4c3a36847f826fe4d",
               "name": "Samuel Ornitz",
               "profile_path": null,
               "id": 127777,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5322cd3ac3a368574d004fa9",
               "name": "Katharine Havilland-Taylor",
               "profile_path": null,
               "id": 1300894,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.321308,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 230284,
      "vote_count": 1,
      "budget": 0,
      "overview": "Dr. Eli Watt, a widower, comes to a small town, considering himself a failure in his attempt to have a meaningful career in New York. He raises his son Jimmy as well as Letty, a baby whose mother has died in childbirth and whose father blames Watt and abandons the child. Watt dreams of returning to do research studies, but always something gets in the way: an epidemic, his children's needs, or the needs of his generally ungrateful patients. Only with the passing years does he come to find that his future isn't over and his past isn't quite the failure he believed.",
      "similar": [
         334,
         40807,
         88,
         4347,
         277216,
         7972,
         907,
         931,
         2024,
         8967,
         112160,
         858,
         13,
         59,
         39254,
         244772,
         142,
         634,
         111,
         510
      ],
      "original_title": "One Man's Journey",
      "runtime": 72,
      "poster_path": "/sUWSz5M44H6OGGtWLpdzwCQi9YQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1933-08-31",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John S. Robertson"],
      "runtime": 72,
      "synopsis": null,
      "writers": [
         "Lester Cohen",
         "Samuel Ornitz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024411/",
      "coverLink": null,
      "actors": [
         "Lionel Barrymore",
         "May Robson",
         "Dorothy Jordan"
      ],
      "reviews": [
         "This is one of the \"lost but found\" films shown on TCM on 4/4/07. Apparently this and two other films shown that night were held out of public release due to litigation concerning royalties and now the powers that be at Turner Classic Movies have taken care of the licensing issues. Of the three films shown that night, none of them were great treasures but all three were excellent--very solid examples of the type of films RKO made during the era. Normally, when you think of RKO in 1933, you think KING KONG or Astaire and Rogers as a team, but there were other good films that might rank just below them in quality and entertainment. This film is rather reminiscent of several other doctor dramas from the era (such as THE CITADEL and ARROWSMITH) where the doctor's nobility and sacrifice are celebrated. A younger Lionel Barrymore (sporting a dark doo thanks to hair dye) comes to a rural area to set up a medical practice. However, at first, he is unsuccessful and only begins to get patients when he agrees to use the barter system. Because of this, he is constantly in financial straits, but because he is so noble and decent, he doesn't give up and is eventually accepted and loved by the community. While all this could have been VERY syrupy, thanks to good writing and a terrific performance by Barrymore it is not. There is certainly a lot more to the movie than this--including an excellent (as usual) performance by May Robson and an early performance by Joel McCrea. See this film and see a \"small\" film that really packs an excellent punch.",
         "Lionel Barrymore got to play a nice guy for a change in this sentimental drama. In an unusually subdued performance, Barrymore plays a widowed family doctor starting a new life with his young son in a small town. The locals are leery of the outsider and the few cases that come his way are paid for with potatoes and eggs. When one of his patients dies in childbirth, the angry husband wants nothing to do with his infant daughter, so the kind doctor takes her in. Soon feisty May Robson comes aboard as a volunteer housekeeper. The story fast-forwards twenty years to find the son (Joel McCrea) a hotshot Type-A doctor with little time for his beautiful and long-suffering fiancée Frances Dee. At the end of course, everyone realizes how fortunate they really are. It was nice to see the luminescent Miss Dee on the big screen only two days before she died at age 94. Screened at Cinefest in Syracuse New York, March 2004.",
         "Lionel Barrymore gave a memorably restrained performance in this 1933 film. It stands as a precursor to films such as 1959's \"The Last Angry Man\" with Paul Muni. The setting takes place in rural America circa 1910. Having lost his wife in childbirth, Barrymore returns to his roots only to lose his first patient there as well to child-birth. The embittered husband is ready to take the baby to the poor house but Barrymore takes the little baby girl in along with his young son. Just on the girl's 4th birthday, the father returns and seems much reformed. Barrymore gives the girl, Letty, back to him. Letty maintains a father-like relationship with Barrymore through the years. As the years pass, Barrymore wins the hearts of the town with his dedication and free services for the impoverished. He lets opportunities pass which could have gotten him out of the town. Some how we know this from the George Bailey effect of 1946's \"It's A Wonderful Life.\" Like George Bailey, this doctor is going nowhere. May Robson costars as a beloved housekeeper who enters the Barrymore home at precisely the right time. This is a nicely done heartwarming story of rural America from 1910 through 1933.",
         "This was the third of the rediscovered films that Meriam Cooper had taken out of circulation in a business deal with RKO back in the 1940s, that Turner Classic Movies showed on Wednesday, April 4, 2006. Of the three it is the best, mostly due to a strong story about a country doctor over the years who discovers in the end that he was not the failure he felt he was, but that he gained the love and respect of the people of his town and of highly regarded medical specialists in New York City. Lionel Barrymore was the first of the famous trio of siblings to gain an Academy Award (for A FREE SOUL in 1930 - 31) wherein he gave a terrific performance as a hard drinking criminal attorney who pulls himself together to save his daughter (Norma Shearer) from the gallows. His character in that screenplay had been based on the celebrated California attorney Earl Rogers, father of screenwriter Adele Rogers St. John. It remains one of the best of the early male Oscars. And he would fill the screen with other performances, frequently of crusty old gents with plenty of wisdom, in films like CAPTAIN'S COURAGEOUS and ON BORROWED TIME and YOU CAN'T TAKE IT WITH YOU. All too frequently his detractors note a hammy tendency that got into his acting, it's true, but even when he is hammy Lionel can produce interest in whatever he's doing on stage or screen. Here he is Eli Watt, a doctor who is returning to his native town with his six year old son Jimmy in tow. He tells the local banker (Oscar Apfel) that he could not make a real go of it in the big city, so he felt he should set up practice back in his home town. After getting a smaller mortgage than he would like (ironically he asks if the ink in his pen that he needs to sign the mortgage is free!) he sets up shop. Soon he is having his first customer. David Landau (the President of Darwin College in HORSE FEATHERS) is a farmer whose wife is pregnant. They don't have money, but can pay Watt in two bushels of potatoes. Watt (taking his son along) goes to Landau's farm. Unfortunately, while he saves the baby daughter that the wife gave birth to, complications killed the wife. A bitter Landau refuses to listen to Barrymore's attempts to get him to accept the little girl, and throws Barrymore, the baby and Barrymore's medical bag out. The little girl is named Lettie by Barrymore. With the assistance of a housekeeper/old friend named Sarah (May Robson, in a typically great performance), Barrymore raises Lettie with his own son. However, four years later a reformed and penitent Landau returns, and convinces Barrymore to let him raise daughter again. As it turns out Landau really does reform, and Lettie grows up (as Dorothy Jordan) to be a decent person. The film actually follows the odd situation Barrymore faces in the small town. He is the man the locals all go to for medical advice, and he is willing to take produce for it (much to the amazement of Apfel, who has to keep giving extensions on that mortgage to Barrymore as a result). We also see Jimmie grow into Joel Mcrae, and assist his father, until he is ready to study medicine too for a career as a doctor. Barrymore's moments of glory are mostly quiet ones. In the 1930s it was more common for doctors to do \"house calls\" than today - unfortunately - and Barrymore is seen going in all kinds of weather, even being upset in a sled (by the snow) on a call. Then he successfully fights a small pox epidemic among the poorer farmers when the local county medical group are busy with a typhoid epidemic. His success there is the first time his activities gain state wide attention. Lettie assists in the small pox epidemic, and later she and her boyfriend Bill (James Rush) are in a car accident, that Barrymore again shows himself at his best in. He saves Bill's broken arm by fast emergency service, before Bill is taken to New York for final surgery. Mcrae is one of the surgeons with Barrymore in this event, and a leading New York specialist (Hale Hamilton) suggests that Barrymore could still make a first rate career in the city's leading research complex. And here is the interesting point of the film - wherein I will cease further comments on the plot in specifics, except to say Barrymore does have his day of glory. It seems that the plot of this film looks (remarkably so) like IT'S A WONDERFUL LIFE. I realize that IT'S A WONDERFUL LIFE was supposed to be based on a story by Philip Van Doren Stern called \"THE GREATEST GIFT\". But the whole spirit of that film is that George Bailey wants to leave Bedford Falls and win his fortune outside in the great world. Every time he is about to do so he is prevented by the death of his father (oddly enough Samuel Hinds, who appears in a small role in this film), or by the actions of Potter, or the timidity and selfishness of the townspeople. The same thing happens here to Dr. Watt. He is in the position to leave, and comes close once to do so, but the illness of a friend prevents him. He never has his chance to show what he can do. Of course, Watt (like George Bailey) does discover he was a great success because he helped his neighbors despite everything (as George did in the later film). But isn't it really ironic that the hero in this film is played by Lionel Barrymore, who was the devil incarnate villain Potter in the later film?",
         "Soap opera spanning from the horse and buggy through to the current day, 1933, following the career of Eli Watt (played by Lionel Barrymore), a widower who has come back to his rural hometown where he fixes up \"the old place\" and sets himself up as town doctor (and mostly gets paid by the locals with sacks of potatoes). On his very first doctoring job, a mother giving birth dies, the angry, heartbroken dad wants nothing to do with his new baby daughter, so Doctor takes the baby home to raise along with his own young son. After four years the angry dad now regrets his decision and takes the girl back - then the years progress as Eli's son grows up and is training to be a doctor himself, and Eli becomes a hero during a local smallpox epidemic. This is a warmhearted, interesting film boosted up by a very well done performance given by Lionel Barrymore who plays the kindly doctor with a lot of charm. May Robson is appealing here playing a plucky local woman who comes to live with the doctor and help care for the household and baby alike. Joel McCrea also appears in this as the doctor's son - he gives a nice performance but isn't really given that much to do. All in all, a quite entertaining film.",
         "Lionel Barrymore played a country Doctor who healed bodies as well as hearts. He helps Dorothy Jordan and James Bush and than later, Joe McCrea ( as his son) and Frances Dee. He played a character who was good hearted & hard working & was often only paid with potatoes as recompense. Sentimental, up-lifting, self-sacrifice & nobility all figure into the picture. It was remade in 1938 as A Man to Remember with Edward Ellis in the Barrymore role. The roles of Dee & Bush were dropped & in this case the son ( lee Bowman) falls in love with Anne Shirley--as the Jordan character. Acting was good all around. Jordan is pretty much forgotten today. She made several films in the early '30's and then married Merian C.Cooper. McCrea & Dee married shortly after making this picture. James Bush was in many films up to the early '50's, mostly in small, uncredited roles.",
         "Just discovered on Mark Evanier's blog that Turner Classic Movies-on their blog-are running a feature every month. One Man's Journey is for June. This just-rediscovered RKO release from 1933 stars Lionel Barrymore as Dr. Eli Watt, a widowed man with 6-year old son Jimmy (Buster Phelps) coming back to his old country roots. Since many of the townspeople are nearly poor, Dr. Watt accepts payment in potatoes or other foods. That's what the husband of his first patient offers to him. This husband-a McGinnis (David Landau)-gets some good news and bad news. Good: He has a healthy baby girl. Bad: The mother died giving birth. McGinnis wants no part of his girl's life and threatens to kill Eli. For four years, Eli helps raise the girl with Jimmy, a dog, and their housekeeper Sarah (May Robson). Then McGinnis, having rehabilitated himself, wants her back. We then flash-forward about 15 or so years with that daughter Letty (Dorothy Jordan) grown up and helping Dr. Watt care for several children with smallpox. Son Jimmy (now played by Joel McCrea) is becoming a doctor himself. I'll stop here and mention some other players: James Bush as Bill Radford-Letty's eventual husband, Frances Dee as Joan Stockton-Jimmy's fiancée (and later McCrea's real-life wife), Dorothy Gray as Letty's daughter who has a heart-tugging scene with Barrymore when he's carrying her, and Samuel S. Hinds (or Sam Hinds as he's credited here) as Dr. Roger Babcock who pays Eli a very high compliment at the end that makes a marked contrast to me when I remember their later roles on It's a Wonderful Life as-respectively-Peter Bailey and Henry F. Potter-fighting over foreclosures in front of Bailey's son George. All of them give wonderful performances with Mr. Lionel Barrymore at his most heartwarming throughout. There's also some stirring yet underplayed musical scoring by Max Steiner. In summation, One Man's Journey is one of those \"they-don't-make-them-like-they-used-to\" pictures that makes you wish they still did!",
         "One Man's Journey is the sentimental filmed tale of the life of a country doctor as played by Lionel Barrymore. It's a nice, but very dated story, doctors like Barrymore are sadly a thing of the past. Barrymore arrives back in his hometown, a widower with a small son who later grows up to be Joel McCrea and follows in his father's footsteps as a physician. In fact he starts off on the wrong foot by losing the mother during a difficult pregnancy. The daughter from that pregnancy grows up to be Dorothy Jordan and she's more Barrymore's child than she is of David Landau. May Robson's in this film also as Barrymore's feisty housekeeper who brings an aged feminine touch to his household as well as a streak of practicality. She's probably the best one in the film. One Man's Journey bears a lot of resemblance to Goodbye Mr. Chips. Like Chips the schoolmaster in Great Britain, Barrymore's Doctor Eli Watt affects literally hundreds of lives during the course of his time on earth. Like his son Joel McCrea said in a much later picture, Eli Watt enters his house justified. It's a nice film, terribly dated though and that's not a good thing.",
         "(Some Spoilers) Forerunner to his later role as the wise old and all knowing, in his patients illnesses, Dr. Leonard Gillespie actor Lionel Barrymore, minus his wheelchair and some 30 to 50 pounds, plays country doctor Eli Watt. A man who just can't say no to anyone who needs his help even if they don't have money of medical insurance to pay him for it. Arriving at his home town of Willow Springs Dr. Watt plans to set up practice there but needs a loan of $500.00 to do it. It's then when he encounters local banker John Radford, Oscar Apfel, who drives a hard bargain for Watt to even get half of what he needs. It's later in the movie that an unselfish and saint-like Dr. Watts saves Radford's son Bill's, James Bush, limb if not life when he preforms a delicate operation on him-totally free of charge-after Bill barley survived with his life in a car smash-up! All throughout the movie we see kind and feeling, for those less fortunate then himself, Dr. Watt sacrifice his career as a big money and respected, by the \"In Crowd\" who can pay for his services, Park Avenue physician for those who can barley afford to pay their rent and food bills. We also see the kind and feeling doctor take a lot of guff from the very people whom he treats like the crude and load mouth Mr. McGinnis, David Landau, who's wife he was unable to save when she gave birth to baby girl that Watt later named Letty, Dorothy Jordan. Not wanting to have anything to do with his new born child, as if she was knowingly responsible for his wife's death, Dr. Watt took her off McGinnis' hands instead of having her given over to a state run orphanage. It's later in the film that McGinnis realized what a first class jerk he was and wanted Letty back only to have her who was four years old at the time say to him-her natural father-\"Who's that strange looking man over there\"? What was by far the biggest obstacle for Dr. Watt to overcome was his own son Jimmy, Joel McCrea. After saving every cent he had to send Jimmy through medical school, in far off Vienna, Jimmy now a big shot doctor was only after the big bucks he could make and not at all caring for those, who couldn't afford to pay him, who desperately needed his care. ***SPOILER*** Trying to get Jimmy back on the right track as a caring physician, that he always hoped he would be, Dr.Watt by his long years of self-sacrifice for his many patients has Jimmy finally see the light. Not on his dad's Dr. Watt's account but on those whom he treated over the years who never forget him. And , to his great surprise, let Dr. Watt as well as Jimmy know about it in the movie's heart-warming final scene.",
         "One Man's Journey (1933) ** 1/2 (out of 4) Standard drama from RKO about a country doctor (Lionel Barrymore) who could have had anything in life but he gave it all up to help others. This is the same role that Barrymore played in D.W. Griffith's The Country Doctor and he pretty much nails it. I guess there could be debate on whether John or Lionel were better actors but I think I'd give my vote to Lionel for being able to be more calm and deliver performances that aren't just over the top. He's very caring and stern here and the strong supporting cast including May Robson, Dorothy Jordan, Joel McCrea and Frances Dee do fine work as well. The one problem is that it's all very familiar and there aren't any surprises along the way.",
         "This 1933 film starring Lionel Barrymore was lost for many years in the RKO vault and was finally released and is a gem of a film to view. Dr. Eli Watt is played by Lionel who returns to his home town in farm country and starts up practice after not being successful and returns with his son, Joel McCrea,(Jimmy Watt). Eli Watt finds that the local people in town cannot afford to pay a doctor and bargain with potatoes, squash and everything else but money. There is a patient who gives birth to a baby girl, however, the mother dies and the husband does not want his baby girl and threatens to kill the doctor. So Eli Watt decides to raise the baby girl who is later played by Frances Dee,(Joan Stockton). In real life Joe McCrea and Frances Dee became husband and wife and had a long marriage together. This is a very enjoyable film showing how country doctors operated years and years ago. Enjoy.",
         "Wonderful film. Saw it last night on TCM and it made me pine for more feel-good films just like it. That's not to say it's sappy, just a refreshing break from all the cultural downers that remind us constantly how screwed-up we are. I like it when a film tries to put a spotlight on virtues like generosity and selflessness. Moreover, Lionel Barrymore is always wonderful to watch, very, very convincing, and the little song near the end (I won't spoilt it!) almost had me in tears. With regard to the depiction of virtue, other films that come to mind are \"City for Conquest,\" \"Angels with Dirty Faces\" (that ending!)and of course \"Casablanca.\" It's especially satisfying when a character of questionable virtue steps-up when the chips are down.",
         "Lovely movie from an earlier time. Incredibly well-acted by most concerned. Except for McCrea, who, it seems to me, is as stiff as a board. While I realize he was supposed to exude a sort of heartless diffidence, I don't think that's the problem; I just don't think he had really come into his own yet. Of course he was a tall, handsome guy with a good voice and, with time, he became a solid actor -- but it's interesting to see him upstaged by almost everyone in this early entry. And while the film can feel \"dated,\" what is one to expect from a bit of art that was made so long ago? Perhaps that sense of \"datedness\" comes from the fact that today we are just so \"aware\" and cynical. Personally, I like the tone of the film....",
         "Lionel Barrymore was fantastic in this role as the good guy. It's a heart warming film, and shows how a lot of directors and producers should go back to the 1930's and learn how to do it right. I don't feel that this picture was dated at all, considering the period for which it was made. Horse and buggies in the early 1900's were not that unusual. Dr. Eli eventually owns a car, but it's nothing fancy. For a film released in 1933, it's perfectly fine. Remember that the Great Depression was determining the fate of millions in this country at this time, and a film about a selfless country doctor probably raised quite a few spirits at the time. Barrymore in one of his greatest roles, as far as I'm concerned. I thought all the acting was great, and would highly recommend this film. Thanks TCM for providing this jewel of a film for us!",
         "There is a lot of touching sentiment in this movie. Lionel Barrymore is brilliant as the country doctor who keeps putting off his own future plans for his patients. A young Joel Mc Crea before most of his cowboy hero roles, is in support here. Mary Robson is solid as Sarah. There is a lot of sentiment here for Barrymore's character and he plays the role in an understated matter. He plays this role perfectly. The Country Doctor story pulls the viewer in, and does his acting makes you care about his story. While the rest of the supporting cast has little name recognition, they are all solid in support here. John S. Robertson, only slightly younger than Lionel had directed mostly silents, and he would only direct 6 more films. His direction seems perfect here for Barrymore. His last effort would be a Shirley Temple film two years later, and this one has a scene where briefly a little girl in this one June Filmer has a tender moment and little Buster Phelps prove here why he was hired to direct Shirley Temple. Robertson could obviously handle child actors.",
         "It's strange to see the similarities in this film and \"It's A Wonderful Life\" from 13 years later. Barrymore plays a country doctor, Eli Watt, who has failed at a bigger practice, has become a widower, and now returns to his small town along with his small son to set up practice on his on. His first case has a horrible outcome, although it is not the doctor's fault. A farmer's wife dies in childbirth and the farmer (David Landau) does not want the baby girl and says he will get the poor farm to come and get her. Dr. Watt takes the baby girl in as his own and raises her as his daughter, Letty. In one plot turn I could not figure out, Mae Robson appears out of nowhere and says her life is empty and figures it can be fuller by keeping house for the doctor and his family. The film is rather melodramatic, but the great acting of Barrymore and company make it worth your while, as the good doctor gets paid rarely in money and more often in potatoes, handles epidemics, and his son Bill grows up to be...Joel McCrea! (Bill Watt as a young man). Eli has always dreamed of specializing and even traveling to Europe to study with some of the great doctors, so he can bring what he has learned back to his community. However, time after time some emergency, Bill's tuition for medical school, plus just the plain old passage of time delays that dream until finally, old age finds Eli Watt, and he resigns himself to his fate, although with contentment rather than the anger and bitterness of George Bailey. Will anyone ever notice his sacrifice and all he has done for the town? Watch and find out. It's a sentimental journey, but worth watching. Other odd coincidences between this film and It's A Wonderful Life - one of the characters that Dr. Watt crosses paths and locks horns with over the years is a rich banker who thinks money can fix everything and therefore everybody wants his money - much like Barrymore's character in IAWL. Also, one imminent physician who respects country doctor Eli Watt and his accomplishments and sacrifice is played by Samuel S. Hinds, who played Pa Bailey in IAWL. One thing that came out of nowhere for me and seemed a bit silly too, and doesn't have anything to do with the plot, so I will talk about it. When Dr. Watt first shows up and Sarah (May Robson) becomes the Watt housekeeper, she looks about 20 years older than Dr. Watt - and May Robson was in fact 20 years older than Lionel Barrymore. At the end of the film Dr. Watt has aged twenty years, and Sarah looks the same, to the point that she proposes marriage and he gives one of the most unromantic acceptances in the history of the world. Films did give quite a few age un-appropriate roles to May Robson - she was 75 when this movie was made. I guess her great energy just makes you forget her age most of the time.",
         "A journey ,which may seem,to some,very modest,but all in all,as the prestigious thespian says during the meal:'I'm the guest of honor,but I should not;the true guest of honor is Dr Watt. A country doctor ,who has devoted his time to relieve the others' sufferings ,sometimes without asking for something in return ,sometimes paid in potatoes ,abandoning any claim to a great career;he could have carried on his studies at the university but he tells his son (Joel McCrea,future western star)that \"your success will be ours\" ;only he was able to cure Letty ,because,unlike all the greatest leadings lights in the medical world,he healed the soul.Moving performance by Lionel Barrymore.",
         "It's a simple story of a country doctor, Eli Watt, who starts a home town practice in a poor farming community. He is a widower with a small son who finds their life difficult. This is especially true when his first patient dies in childbirth. The husband blames the doctor for his wife's death. Needless to say it becomes difficult for the doctor to gain the trust and support of the people. Without a mother the little girl is next abandoned by her father. Dr. Watt decides to take the child to raise her along with his son Jimmy. He names her Letty. On the day of her entrance \"Aunt Sarah\" knocks on the door and joins the family. She offers her services to care for Dr. Watt's home and the children. She is willing to help in his practice. With Sarah's undertaking we begin to see a unifying of a real family. She steps in, chases the dog out of the baby's crib and the children are blessed with a mother-figure. As I watched this story I was taken by the simplicity of the acting and plot. Dr. Watt and Sarah are great together. It's kind of a grouchy doctor vs. grouchy housekeeper. (Neither of them are really grouchy.) Young Letty grows up with her own serious problems to be solved. Grown-up Jimmy has decided to become a doctor like his dad. But as he gains his education he loses sight of his noble values. As he becomes too self-centered his girl friend, Joan Stockton, isn't sure about their relationship. Here's the cast: \"Lionel Barrymore as Dr. Eli Watt\", \"May Robson as Aunt Sarah\", \"Dorothy Jordan as Letty McGinnis\", \"Joel McCrea as Jimmy Watt\", \"Frances Dee as Joan Stockton\" It's worth seeing.",
         "To enjoy this film you have to get past the fact that this was made in the \"primitive years\" of early silent films. It's long been my contention that somewhere between 1933 (when this film was made) and 1937 that films suddenly \"grew up\" and became more mature in the way that plots and dialog were developed. Within that time span I mentioned, some films as early as 1933 were surprisingly sophisticated, while other films were rather unsophisticated, even as we approached that golden year of 1939. This particular film is still rather \"primitive\", but with good intentions. For example, the makeup for Lionel Barrymore in the early parts of the film are very \"silent-filmish\". The film score is scant. Yet, this is a sentimentally entertaining film with a very moral story. Barrymore's crippling arthritis was already beginning to show in his hands, even at the relatively young age of 55. Also interesting here is the very young Joel McCrea as the son. I don't agree with others who feel McCrea was selfish. I would say he was just sort of average in terms of his humanity, and that really is a point of the film. One can be noble, but not necessarily selfless. A good film, and recommended for those who don't get turned off by the lack of sophistication in such early films.",
         "LIONEL BARRYMORE is the central figure in a slow paced drama about a country doctor who becomes a beloved physician when he selflessly devotes himself to the care of patients, most of whom are too poor to pay him anything in return. He takes in an abandoned girl and raises her, along with his own son, although he is a widower and hasn't remarried. A fussy but helpful housekeeper (MAY ROBSON) keeps him in line and cares for the children. Eventually, the boy grows up to be JOEL McCREA, and he too becomes a country doctor who eventually marries a young woman (FRANCES DEE) who is unhappy being a doctor's wife until Barrymore shows her the error of her ways. Dee would later marry McCrea in real life. It's all told in an hour and twelve minutes with no background music whatsoever except for the opening titles and closing credit. The pace seems dreadfully slow, but it's interesting to see Lionel Barrymore at a stage in his life where he was still walking around and not wheelchair bound as grumpy Dr. Gillespie, the character he would play in all those Dr. Kildare films. He's less mannered than usual. Here, he's the definition of kindness in a role you might expect Edmund Gwenn to inhabit. JOEL McCREA has a very subordinate role and he's given little to do except look handsome before he became a western star. Summing up: Average drama with modest results.",
         "I ask your help to identify a painting shown in this film. In this film, at about the 5 minute point from the beginning, there is a framed painting or print on the screen, almost filling the screen. The picture is of a doctor in a buggy racing after a stork flying with a bundle suspended below its beak. The implication is clear. Then it fades to the scene of Barrymore racing in his buggy to attend a childbirth. That scene is \"boxed\" by the frame. I would like to identify the name of the artist who did the painting or the name of the painting, preferably both. I saw one of these prints, from an engraving, in an antique shop. Some damage, apparently from excessive humidity. The price was too high, I thought. A few days later I went back intending to negotiate on the price. The print was sold. The seller could not recall the artist nor the name of the print. Please help me with this information if you are able to do so. Obviously, the painting was done prior to 1933 and the fact that the print was from an engraving probably dates it from the 1800s. Your response will be appreciated.",
         "Feisty Robson at the end grabs Lionel to go off to Niagara Falls to marry her, or at least it seemed to me. I did not watch a lot of this film, but the end was interesting. Robson's character went from washerwoman-looking drabness to all of a sudden fashionable older woman as she put on her dressy hat with all the aplomb of a society lady. Lionel as the unsung doctor being the aw-shucks speaker at the dinner was priceless. Joel McCrea's character as Lionel's son surely had a lot to learn. I hope I can see this movie again. I did not DVR it. I always notice the facial resemblance between Lionel and his great-niece, Drew Barrymore.",
         "...and if you can believe that, maybe you'll believe Barrymore's young-man makeup (a black wig, loads of pancake) in this tale of a dedicated, low-key, small-town doctor and the many whose lives he touches. It's sweet, certainly, and it's fun watching Barrymore play a nice guy for a change; he doesn't overact as he often did in villainous roles. But he does oversell the crusty-but-lovable persona, as does May Robson, as a cantankerous biddy who moves in and takes over the household. (Implausibly, the film's finale links these two romantically; why now, after they've been living under the same roof for 20-odd years?) McCrea, as usual, underplays effectively against the rest of the cast, and it's nice to see him opposite his real-life ladylove, the beautiful Frances Dee, as his under-appreciated fiancée. Not a lot happens, and the understated atmosphere and period detail add up to a certain pleasant spirit, but a few more plot fireworks might have livened things up.",
         "Very confusing, this movie. There were automobiles, but apparently no vaccination for smallpox, which also seemed to be caused by dirt, according to the doctor. I'll bet that came as a surprise to the smallpox bacilli. I can actually remember when doctors made house calls, so I'm not going just on hearsay. Doctors, and everybody, had to wait to collect sometimes, and I'm sure there were times during the depression when eggs, a chicken and even potatoes were very welcome. I just think this movie went overboard on the sentimentality. I like a good old sentimental movie as much as anyone, but this one just slathers it on like butter. Makes you yearn for a little vinegar. I would say this movie is about as far removed from real life as you could get. Even the car wreck was clean."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": ["Dr. Eli Watt, a widower, comes to a small town, considering himself a failure in his attempt to have a meaningful career in New York. He raises his son Jimmy as well as Letty, a baby whose mother has died in childbirth and whose father blames Watt and abandons the child. Watt dreams of returning to do research studies, but something always gets in the way: an epidemic, his children's needs, or the needs of his generally ungrateful patients. Only with the passing years does he come to find that his future isn't over and his past isn't quite the failure he believed."],
      "budget": 0
   },
   "movielensId": 157021,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-08-31",
      "dvdReleaseDate": null,
      "directors": ["John S. Robertson"],
      "runtime": 72,
      "movieId": 157021,
      "title": "One Man's Journey",
      "mpaa": "",
      "actors": [
         "Lionel Barrymore",
         "May Robson",
         "Dorothy Jordan",
         "Joel McCrea",
         "Frances Dee",
         "David Landau",
         "Buster Phelps",
         "June Filmer",
         "James Bush",
         "Oscar Apfel",
         "Samuel S. Hinds",
         "Hale Hamilton",
         "Colin Kenny",
         "Dave O'Brien"
      ],
      "imdbMovieId": "0024411",
      "originalTitle": "One Man's Journey",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Dr. Eli Watt, a widower, comes to a small town, considering himself a failure in his attempt to have a meaningful career in New York. He raises his son Jimmy as well as Letty, a baby whose mother has died in childbirth and whose father blames Watt and abandons the child. Watt dreams of returning to do research studies, but always something gets in the way: an epidemic, his children's needs, or the needs of his generally ungrateful patients. Only with the passing years does he come to find that his future isn't over and his past isn't quite the failure he believed.",
      "tmdbMovieId": 230284,
      "avgRating": 3.5,
      "releaseYear": "1933",
      "numRatings": 1,
      "posterPath": "/sUWSz5M44H6OGGtWLpdzwCQi9YQ.jpg"
   }
}