{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1263692",
      "video": false,
      "title": "Mock Up on Mu",
      "recommendations": [],
      "backdrop_path": "/46pXARrkWIFZdIWIWrnqusmIVF4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a00c3a36847f81b273d",
               "name": "Craig Baldwin",
               "profile_path": "/dwWwKyGx9yBpmLhvBbW2uQTDRZC.jpg",
               "id": 84445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a00c3a36847f81b2743",
               "name": "Craig Baldwin",
               "profile_path": "/dwWwKyGx9yBpmLhvBbW2uQTDRZC.jpg",
               "id": 84445,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.397611,
      "production_countries": [],
      "id": 102039,
      "vote_count": 4,
      "budget": 0,
      "overview": "A radical hybrid of spy, sci-fi, Western, and even horror genres, Craig Baldwin's Mock Up On Mu cobbles together a feature-length \"collage-narrative\" based on (mostly) true stories of California's post-War sub-cultures of rocket pioneers, alternative religions, and Beat lifestyles. Pulp-serial snippets, industrial-film imagery, and B- (and Z-) fiction clips are intercut with newly shot live-action material, powering a playful, allegorical trajectory through the now-mythic occult matrix of Jack Parsons (Crowleyite founder of the Jet Propulsion Lab), L.Ron Hubbard (sci-fi author turned cult-leader), and Marjorie Cameron (bohemian artist and \"mother of the New Age movement\"). Their intertwined tales spin out into a speculative farce on the militarization of space, and the corporate take-over of spiritual fulfillment and leisure-time.",
      "similar": [],
      "original_title": "Mock Up on Mu",
      "runtime": 114,
      "poster_path": "/bfL66a8c2PFWbMfJ8eSquSykkTD.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2008-01-14",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Craig Baldwin"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Craig Baldwin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1263692/",
      "coverLink": null,
      "actors": [
         "Stoney Burke",
         "Jeri Lynn Cohen",
         "David Cox"
      ],
      "reviews": [
         "The latest from S.F.-based cult auteur Craig Baldwin, \"Mock Up On Mu\", despite its rather avant garde style, tells a fairly straightforward narrative tale. Set in the year 2020, L. Ron Hubbard (Damon Packard), famed founder of the Scientology religion, commands a moon base, Mu, with an army of his followers; the base is under contract with the U.S. government to dispose of depleted uranium from the earth's surface. Hubbard, seemingly omnipotent in the universe of this film, has built a giant theme park on the moon, which he wants to use to lure as many of the ultra-rich as he can to the moon, presumably to join his minions. The only problem is that in order to actualize this plan, Hubbard needs help from the Earth's surface, in the form of Lockheed Martin (Stoney Burke), a rich arms dealer in the Vegas area. Hubbard needs Lockheed Martin to build a giant rocket ship in the desert outside of Vegas, in order to have a viable means of transporting people to the moon. This is where things get sticky, however. In order to convince Lockheed to build the ship, Hubbard must first find Jack Parsons (Kalman Spelletich), a famed rocket scientist with connections to the underground world of Aleister Crowley, a world where \"sex magick\" fights the forces of evil industrialism. Apparently, disgusted with the evil deeds he was asked to perform for the US Government when formerly employed by them, Parsons faked his own death and fled to the Nevada desert, the very sight of some of the original nuclear bomb tests, in order to pursue his research for the good of humanity... OK, so maybe the plot isn't that simple. And the story is not told in a style which you will ever, EVER see in a typical multiplex. On top of original footage shot by Baldwin, the story is told through a montage of images, some bizarre, some silly, some downright sublime, which have been culled from any conceivable source you can think of, from old Japanese monster movies to Home-Ec reels from the 50's and everywhere in between. Anyone with a passion for obscure and arcane relics of Hollywood's cold war days will have a field day watching how this movie seamlessly incorporates endless amounts of these nuggets into the original footage, in order to tell a bold and truly original tale of conspiracy theory Americana. The gears are set into motion when Hubbard sends Agent C to earth in order to manipulate things for his favor. Turns out Agent C ain't who she seems to be... Attempting to describe the plot is almost pointless. If you get a chance to watch this movie, just do it, as Nike would say.",
         "Craig Baldwin returns with another collagist cinema dream, this one featuring the trials and errors of L. Ron Hubbard, Marjorie Cameron, and Jack Parsons. Did that catch your attention? 'Cause if it did, then this movie is definitely for you. Set it 13 segments (as reflecting old serial television series such as Flash Gordon) and spiraling between New Age, Science Fiction, and film essay, Mock Up on Mu is a definitive celluloid dream, where tomorrow's landscapes and yesterday's pop culture merge to ask about today's technological morality, especially as concerns our funding of weapons developments over energy and others. Compiling imagery from such films as North by Northwest, Voyage to the Moon, and Logan's Run puts the experimental form into a familiar landscape for the audience. Shot footage and voice-over narration gives it a little bit more continuity for purposes of narrative. The rest is history. The mash-up of the Western genre to Ennio Morricone music was the greatest. As an experimental films, not all parts are equal to others, and the whole film can be a little overwhelming to those not previously familiar with experimental movies or Baldwin's own works (Spectres of the Spectrum is a masterful movie, by the way... if this film appeals to you, be sure to check that one out as well). I personally love how \"Marjorie\" constantly interjects familiar movie titles, especially SciFi titles, into the dialog, as if to remind you that this all has its roots in stuff that has been explored before. It's a great way of citing sources without using footnotes (or, in cinema's case, intertitles). Baldwin's own Other Cinema DVD label has not as yet released this feature, but it has been touring around recently, and is well worth the time and price of admission if it happens to come by. The timeliness of this release is interesting considering its characterization of Lockheed Martin, but also because economic recession is causing Hollywood to be somewhat more conservative about their releases, meaning that there's a lot more open space right now to place more underground, experimental features such as these. --PolarisDiB"
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Other Cinema"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 157150,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-01-14",
      "dvdReleaseDate": null,
      "directors": ["Craig Baldwin"],
      "runtime": 114,
      "movieId": 157150,
      "title": "Mock Up on Mu",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1263692",
      "originalTitle": "Mock Up on Mu",
      "genres": [
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A radical hybrid of spy, sci-fi, Western, and even horror genres, Craig Baldwin's Mock Up On Mu cobbles together a feature-length \"collage-narrative\" based on (mostly) true stories of California's post-War sub-cultures of rocket pioneers, alternative religions, and Beat lifestyles. Pulp-serial snippets, industrial-film imagery, and B- (and Z-) fiction clips are intercut with newly shot live-action material, powering a playful, allegorical trajectory through the now-mythic occult matrix of Jack Parsons (Crowleyite founder of the Jet Propulsion Lab), L.Ron Hubbard (sci-fi author turned cult-leader), and Marjorie Cameron (bohemian artist and \"mother of the New Age movement\"). Their intertwined tales spin out into a speculative farce on the militarization of space, and the corporate take-over of spiritual fulfillment and leisure-time.",
      "tmdbMovieId": 102039,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 4,
      "posterPath": "/bfL66a8c2PFWbMfJ8eSquSykkTD.jpg"
   }
}