{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "supernatural",
         "id": 6152
      }],
      "imdb_id": "tt0314197",
      "video": false,
      "title": "Imagining Argentina",
      "recommendations": [
         99880,
         68774,
         259045,
         12799,
         153820,
         83748,
         78568,
         351189,
         147196,
         76329,
         284280
      ],
      "backdrop_path": "/jXX5GojbAJJ6BORrD5gj5PuHIKD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carlos Rueda",
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d9bd",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cecilia Rueda",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d9c1",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Teresa Rueda",
               "gender": 1,
               "credit_id": "58c1e338c3a3687e0000a740",
               "name": "Leticia Dolera",
               "profile_path": "/6YH2rpENETOqi6iRI66Sbr54hvJ.jpg",
               "id": 45060,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Esme Palomares",
               "gender": 1,
               "credit_id": "58c1e352c3a368265000e0a1",
               "name": "Maria Canals-Barrera",
               "profile_path": "/61u61cPmoHO6WeSOa0XtBnBM9gh.jpg",
               "id": 85759,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Silvio Ayala",
               "gender": 2,
               "credit_id": "58c1e35fc3a368263d00de17",
               "name": "Rubén Blades",
               "profile_path": "/5J86KHFqEEFgMAdWfUqdpAD3sjV.jpg",
               "id": 2049,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Eurydice",
               "gender": 1,
               "credit_id": "58c1e380925141732700ea4d",
               "name": "Irene Escolar",
               "profile_path": "/ecNcoFaMySBfZYTS7m37g8GJjrH.jpg",
               "id": 962249,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Orfeo / Enrico",
               "gender": 2,
               "credit_id": "58c1e3739251411d5d00a269",
               "name": "Fernando Tielve",
               "profile_path": "/tAc6E2bpJLW6Ig4XB9NnOIXFYeq.jpg",
               "id": 17095,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Pedro Augustín",
               "gender": 0,
               "credit_id": "58c1e39b925141731000e64a",
               "name": "Hector Bordoni",
               "profile_path": null,
               "id": 230168,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe454c9251416c9102d9c7",
            "name": "Christopher Hampton",
            "profile_path": "/7L7S5KHE21jFGL2IS1VXqQJxx9R.jpg",
            "id": 12952,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.238865,
      "production_countries": [],
      "id": 34036,
      "vote_count": 11,
      "budget": 0,
      "overview": "Set during the unsettling disappearances in Buenos Aires during the dictatorship of the 1970s, the film involves theater director Carlos Rueda and his wife Cecilia. Shortly after Cecilia writes an editorial commentary questioning the mysterious abductions, she is herself abducted and taken into police custody.",
      "similar": [
         409297,
         561,
         28355,
         36647,
         8839,
         1562,
         91586,
         622,
         396422,
         77949,
         259693,
         19592,
         377,
         675,
         1487,
         588,
         10014,
         11596,
         7191,
         1427
      ],
      "original_title": "Imagining Argentina",
      "runtime": 107,
      "poster_path": "/xbRs21rdFB9UMNIXQa0QCmpChG8.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2003-09-13",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Hampton"],
      "runtime": 107,
      "synopsis": "A W Bergh, Stockholm: Heard about the green Ford Falcons of Buenos Aires? Death mobiles they was called and were doing the same dirty job for president Videla and a string of junta generals, in the 1970s mimicking their highly successful colleague dictator Pinochet across the border in Chile. Kids protesting against expensive school bus fares could be taken for a ride and never seen again. Disappearances, desaparecidos, was the name of the game and seems to the mayor training for the brave military men crushing the enemies of Argentina in their dirty war against opposition during the late 1970s and early 80s. Performing roughly 40 000 desaparecidos until they met real soldiers on the Falklands in 1982 and was beaten to pulp in a few days by the British. The military rule was toppled but their henchmen have to this day not even been brought to justice. Only leaving a trail of wailing crazy mothers circling the famous Plaza de Mayo Square in central Buenos Aires, flashing large pictures of their murdered sons and daughters. A pity Imagining Argentina is such bomb telling the story. Costa-Gavras took less than a decade to make Missing, to give us a fair shot of what Pinochets CIA-backed bloodstained fascist coup in Chile was all about. A heck of a better job than this quarter of a century late badly told yarn. While Jack Lemon tormented the American ambassador on site to find his missing son in Santiago and actually had the bastard to admit that eggs had to be broken in order to save dear American investments down here on their backyard clairvoyant Banderas use voodoo to figure out the whereabouts of his vanished wife (and later on his already lifeless daughter). To make it even worse, to no avail as it turns out. It chiefly brings him out on the huge Pampas only to meet an old Jewish couple, keeping exotic birds as a hobby(!), lecturing him on the horrors of Nazi Germany. Thats amazingly about all the politics to learn from decades of Latin America military violence in this story. Need I tell more? Not even Leonard Maltin bothered to include the film in his Movie Guide",
      "writers": [
         "Lawrence Thornton",
         "Christopher Hampton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0314197/",
      "coverLink": null,
      "actors": [
         "Antonio Banderas",
         "Emma Thompson",
         "Rubén Blades"
      ],
      "reviews": [
         "Please excuse my English, now that it is my third language. I was born and raised in Argentina; I currently work in Buenos Aires at a café, until I get my bachelor degree in naval architecture. As crazy as it might sound, my grandfather disappeared in the 1970s, and never came back. Perhaps to you\u0085 this was just a movie, you can rate it as you want or give the names you like to. But I found myself dumb founded with this film, I felt the worst anguish while seeing it, and forced myself to keep on watching and to keep on remembering. I can not find words in English nor Spanish to describe how deeply this movie has gotten to me. It's been a long time since it happened, but I see most of this film as my mind portraying old stories that my grandmother used to tell me when I asked about the dad of my dad. A film where reality is described at its best and where a part of me knows that justice in this country is just a word with no meaning, it was before, and it is now. I win nothing by saying this, nor I feel better, I just thought that perhaps I should comment on the impact the movie has had on someone like me, a normal guy who studies and works in country where future has little by little lost its meaning.",
         "Imagining\u0085 arrived with a fair degree of controversy, having been booed, heckled and subject to walkouts at 2003's Venice Film Festival. By saddling an infamous chapter in Argentina's history with a supernatural slant \u0096 Sixth Sense meets Missing, perhaps \u0096 many critics thought this was altogether a bridge too far. But was the reaction justified? It rather depends on whether you prefer your politics served up in an allegorical sauce or red and dripping on the bone. An adaptation of Lawrence Thornton's award-winning novel, the story begins in 1970s Buenos Aires, with dissident journalist Cecilia Rueda (a waveringly-accented Thompson) kidnapped by the fascist junta to join the ranks of the 30,000 'Disappeared'. As her bereft theatre-owner husband Carlos (Banderas) searches in vain, he develops psychic powers, enabling him to witness what happened to his wife and her fellow detainees. Laying his hands on their relatives he glimpses horrifying images of torture, rape and death at the military's hands, galvanising a traumatised public into motioning the government. In Thornton's magic-realist hands, Carlos's clairvoyance was a metaphor for the struggle against state repression, as he 'imagines' scenarios running counter to the official line: 'if you live in a nightmare, you have to re-imagine it.' While playwright-turned-director Christopher Hampton (who also wrote the screenplay for The Quiet American) cannot hope to replicate the novel's tender touch \u0096 the voyage from page to screen being a tricky one at best \u0096 the intentions are heartfelt, and the film does make salient points about the importance of empathy and memory as powerful and long-reaching political instruments in themselves.",
         "The first thing I'd like to say is I've been reading people's comments about this movie, and I'm really touched at how much people round the world know about the worst period in Argentinian history. As regards the movie itself, I wouldn't like to disrespect anyone, but I think it is a lousy portrayal of real events. I agree with someone that the title allows for the viewer to expect a free interpretation rather than an accurate historical account. I disagree with someone about the images of torture being too many and too cruel. I think they were too soft. I've seen at least twenty Argentinian movies dealing with this topic (actually, I'd say nine out of ten Argentinian movies have at least one referent to it). The point is, no one can make a movie about \"El Proceso\" but an Argentinian citizen. It's nothing to be proud of, but it's our burden. I didn't have anyone missing, but I grew up with this, and it'll never be over for us. I understand the good intentions of everyone involved in this movie, and I think it's important that people in other countries let the world find out what happened here, but if you really want to know, you should see local accounts, without fake accents (subtitles are not that bad once you get used to them). Oh, and just for the record, the oppressors were ten times more somber and disgusting than what the movie shows. Most of them still feel the same way about everything they did, and as someone said, justice in this country is a lost cause. I just pray it never happens again. Thanks for reading.",
         "Antonio Banderas plays a theatre director whose wife (Emma Thompson) has been kidnapped by the Secret Service of Argentinian's Videla's dictatorship (1976-1983). Soon he discovers he has sort of a psychic power that allows him to predict the future, and to find out what has happened to her wife and to some of the other missing people (there were +/- 30000 missing people during Videla's dictatorship). Now I wonder: Is it necessary to introduce that paranormal stuff in a movie about Argentinian dictatorship? I mean, you got one of the most cruel and repressive dictatorships ever, and that's enough to make a shocking movie. The psychic powers, the vissions of Banderas' character detract the attention from the main line: the denunciation of that regimen led by General Videla and supported by USA Government, and the atrocities that were committed, the sistematic violation of human rights, and so... Especially when you have two well known stars in the cast, and the movie may have some international impact (which didn't have any of the argentinian movies that talked about the same issue). Anyway, some parts of the movie perfectly portraits the lack of freedom in Argentina along those 7 years, and there are some sequences really shocking (in particular the ones at the prison where Emma Thompson's character gets imprisoned -and tortured, and raped-). Antonio Banderas and Emma Thompson play their roles with so much intensity, especially Mrs. Thompson, one of the best dramatic actresses from the last 20 years (in my opinion). That's all. I just want to add that this kind of movies are so necessary, people need them not to forget some of the darkest passages of human history. Especially they need them there in the United States Of America, where no one knows a thing about latin-american dictatorships (most of them supported by the White House). My rate: 7/10",
         "This was truly enjoyable movie in many ways. The acting was great all around. Powerful emotions were realistically portrayed by seasoned actors, relative newcomers and unknown extras alike. Direction, filmography and locations really come together to set a scene more realistic than most films even aspire to. This film succeeds in projecting, through the characters, the full range of emotions that any individual must feel when their freedoms are seriously undermined by a corrupt ruling power, the same power that they would normally look to to resolve such issues. This is not a feel-good movie, and anyone expecting comic relief at any time may be disappointed. This movie sets out to instill feelings in the audience that may help them to relate to the people in the story. It does not abuse concepts such as violence in order to get a kick out of the audience. Unfortunately, many of those who have posted comments on this movie have failed to grasp part of the point. This is not merely a movie designed to remind the viewer of the past. It intends to remind the viewer that such actions continue to occur worldwide, and that it is only the people themselves who can keep their governments from resorting to such inhumane measures, by reminding their rulers repeatedly that they will not stand for it, in their country or any other. Frankly, it disturbs me that films this deep go virtually unnoticed by the masses, while flashy but hollow explosion-fests receive awards.",
         "This riveting film demonstrates why great actors and actresses such as Antonio Banderas and Emma Thompson perform in \"popcorn\" movies -- it allows them the financial freedom to make truly important films. \"Imagining Argentina\" is just such a film. Passion, suspense, devotion, romance, and probing insights into human nature -- the best and worse within us -- make this film a tremendous credit to those who made it. What's amazing is how little press this received. It's beautiful; it literally kept me on the edge of my seat for more than half the movie. The acting is superb, the story-line captivating. Highly recommended. The DVD will be part of my permanent collection.",
         "Argentina's Dirty War and the regime of the Generals from 1976 to 1983 is one of the dark secrets of history and has been examined by poets, writers such as Colm Toibin (and here, Lawrence Thornton in his novel from which the film was adapted), and journalists. And yet the silence about this period of time is deafening, especially since the amnesty this past June releasing the perpetrators from all responsibility of this terrifying activity and time in Argentina. Now, with the current 'silencing' of our own covert CIA activities and tortures in the name of a fight against terrorism, this overlooked film takes on particular potency. And for whatever reasons the film doesn't succeed as a great movie, at least it is a red flag bravely waving. In 1976 the intellects, professors, journalists and writers began disappearing, kidnapped, taken to secret hideaways, tortured, raped, and disposed of all in the guise of protecting the viability of the military regime. Carlos (Antonio Banderas) runs a children's theater and is married to Cecilia (Emma Thompson) who writes articles about the \"desaparecidos\" despite the warnings from Carlos and their close friends Silvio (Rubén Blades) and Esme (Maria Canals). Their daughter Teresa (Leticia Dolera) is a young girl who is conflicted about the feelings of her parents in this scandalized government. Cecilia is abducted, becomes one of the dreaded desaparecidos, and Carlos commits himself to finding her. He discovers he has clairvoyant powers and holds meetings in his garden to help parents and loved ones of the desaparecidos to cope. Working with Teresa he tries to envision Cecilia's whereabouts and the film's dénouement and conclusion deal with this breathless seeking. The acting if good as expected from this cast. The direction is fast paced, but the problem is one of distance from the passion of Carlos. For some reason Banderas elected to keep such a low profiles that his desperation to find Cecilia is somewhat muted. But as stated above the real success of this fine little film is the message it carries and that message is too close to home to ignore. The musical score and cinematography (and the incidental wonderful Tango dancing) are superb. Recommended. Grady Harp",
         "Dear iggimarco, Coming from a country that has a similar past with Argentina i can say that the movie touch me deeply like you. Greece experienced its 7 years of cruel dictatorship 1967-1974. Seven long years that left too many scars. Every now and then i will hear someone of my family talking about the suffer of those years although they rarely talk about what they've been through. Indeed those who don't know, who are lucky (or not) enough to come from countries that never experienced that kind of horror will judge the movie based on script, lighting, acting etc. Those who know will feel the movie evoking all those feelings of deep sorrow and pain. Movies like this should always be made. It is another way to maintain memory of the fallen alive and to make sure that...never again (as the movie tells us in the end)",
         "Unlike 'bonbonsf' just said, i do think that those heavier scenes should be included in the film. That makes the big impact. I don't think it would have such a big impact on me without those scenes. Offcourse it's terrible what happened and it should never happen again. But torture, rape and murder were things that happened every single day in Argentina in the 1976-1983 period. I honestly think it's a good movie. It's about ordinary men, women and children, who are in this strange situation. No one will protect them, as everything is as corrupt as... It's a sad movie but brings to live \"the truth\", as it actually happened; and never should happen again. \"Nunca más\"",
         "based on real events - the military dictatorship in Argentina during 1976 - 83. touching story and fine acting overall. you will see antonio banderas in a kind of role that he has never acted in before and he has come up trumps. the director has succeeded in portraying the shocking situation in argentina during that period, without being overly visual. the psychic quality of antonio banderas is quite believable and i am sure everybody has heard of such individuals even though they are rare. i recommend this movie to all movie buffs who love good drama and one that is a bit different from mainstream cinema. and such movies try and ensure that the darkest hours in history won't be forgotten that easily.",
         "Imagining Argentina (2003) The story, and the facts behind the story, of innocent people being kidnapped, tortured, and killed in Argentina is so disturbing and emotionally draining it's hard to see this movie objectively. I wish it was a better movie, both in its construction (the filming and editing) and in the storytelling decisions (too much emphasis on empty searching, and too much torture, even after we get the point). Cruelty needs no sympathy, and this movie gives it none. But it gives it attention, offering only a solution in perseverance and romantic love. There are lots of evocative scenes of dancing and music, of wide open countryside, and of warmly lit interiors. It paints a picture of a beautiful country with a beautiful culture, just to show how a small tilt in a great place can turn to horrors. The final statistics of all the people \"disappeared\" under the Argentine dictatorship is an indictment of cruel dictators. The movie serves to remind us, and to paint the horrors, and it goes half way. I wish it had been a poetic, or raw, or inventive success as well.",
         "Imagining Argentina turns out to be exactly the movie suggested by the title... a not-too-literal outsider's take on what the extra-judicial disappearances in 1970s Argentina might have been like. As a result, it will potentially be highly annoying to anyone with any connection to Argentina - not only do the actors contrive to speak in an irritatingly accented English, but several key scenes play (deliberately?) fast and loose with history. This in itself is not necessarily a problem - after all we were warned by the title not to expect a historically literal film - but in my view the resulting mish-mash of the plausible and the implausible is not particularly successful. That said, the film does fulfil the director's stated purpose of drawing world attention to a dark period of Argentina's history - maybe it's worthwhile just for that.",
         "I won't take away from the movie, it was good and dramatic. But I was disappointed in the projection of reality of the subject. First, the reality of why people were disappeared was barely touched upon. They mentioned the word \"subversives\" but they failed to project exactly what that meant, at least in my opinion. The fact that even in Operation Condor, the U.S. was involved and Henry Kissinger gave his blessing with his own words pretty much telling the Videla's government, do what you must, we understand, but hey can't you keep it out of the news because the publicity is bad and we are trying to help fund you...that was missed. Also the fact that people were ASSUMED to be communist sympathizers, whether or not they were, was sort of swept under the carpet to focus on Antonio Banderas other skills. What I did like was the fact that they tied it to the Nazis and rightfully so. What I didn't like was the fact that at the end of the movie they failed to note how many American citizens have been \"disappeared\" or are doing time in our own concentration camp in Cuba. I also was disappointed they failed to mention the babies that were taken from their mothers (which was a huge focus of the Abuelitos de Plaza Mayo) and sold to the high ranking soldiers or even sold to other wealthy people in various countries outside of Argentina. They only touched on the Wednesday helicopter rides, where people were thrown out to die. These things bothered me about the movie, because I think a movie of such relevant subject matter should tell the real story. Especially when it involved the death of so many innocent people. And I do believe it's time to stop making these incidents look isolated to individual countries and show how the Imperialistic values of a group of socialist Nazis has spread this mentality throughout the world and that's why the same practices are done all over. There is so much they could have done with this movie that wasn't done. Was it good? Yes. But it could have been great.",
         "I am pretty sure that it is not possible for someone other than an Argentine to make a film about this subject and have it matter. These are people who at the beginning of the terror supported it wholeheartedly. The military simply responded to what they saw was a terrorist threat by arresting without process and torturing. Starting small means starting; once you cross the line, everything else is trivial. And so 6 years of what ramped up to 3o police murders a day in Buenos Aires. So this thing lacks power as a story about Argentine horror. But even through all its faults, it still rings true and haunts about things at home: power corrupted and evil. Torture to protect citizens never does. The film is incredibly muffed, in pretty much all dimensions except... There are two good scenes. One is when the husband of the newly missing wife is comforted by his daughter in a somewhat sexual way. This was made for American consumption, and though the interaction may be genuinely Latin, the implication in this context is plain. It was a powerful scene and sets up all that follows. The second powerful scene is the unveiling of a spy. There is only a second that matters, when the man knows he is revealed and you see not panic but blame to his informant. It happens fact but it matters. Otherwise, what we have is a powerfully conceived set of folding narratives: a man as a playwright (precisely as in \"The Lives of Others\") in a film with deliberate dissonance. And him further as a psychic, telling the story to us and other characters as it happens to him. In other hands, this could have worked, especially with the intended fold from then there to now here. Tangos, l'exil de Gardel, was not good, but still better and at least genuine. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
         "We read the original text by Lawrence Thornton when it was published in this country and liked it for what it dared to present. Not having seen the film, as we don't think it was ever released commercially in this country, or maybe it was just seen in a few markets, we recently caught up with it via the DVD version. Coming, as it did, to the screen adapted by an English playwright, Christopher Hampton, we were expecting much more than what we see on the screen. The novel is worth reading for anyone interested in the tragedy that was perpetuated in Argentina, in which the people in power decided to eliminate, gradually, all those that opposed the military regime, or as in the case of the story at hand, innocent people that had brains to realize the atrocities that were being committed by the brutal people in power. The main problem with the film is the tone that Mr. Hampton decided to give his adaptation. The metaphysical powers of Carlos Rueda occupy center This film could have improved with an all Spanish cast instead of the mixture of acting styles and accents in the finished product. Casting a bearded Antonio Banderas, as Carlos, was perhaps, the wrong choice. Mr. Banderas, whose career in America has been in mostly action movies, is not effective as the man who sees into the crimes that are being committed, including those against his wife, Cecilia, and his daughter, Teresa, but is helpless to do anything to help them. A heavily accented Emma Thompson is seen as Cecilia, who sees her world shattered when they take her away and is tortured by those savages that kept her. Ruben Blades has nothing to do in the film, as his presence doesn't add anything to the story. Ditto for Maria Canals, who plays Esme, the loyal friend. Leticia Dolera appears as Carlos and Cecilia's daughter Teresa, who like her mother, is taken away as a lesson for the father, who has dared to ask about their whereabouts and has protested publicly. The only thing the film serves is to remind us about those totalitarian governments that have brought to power dictators like the ones that wrecked havoc in Argentina against people they thought were in their way.",
         "Banderas, once again finds himself in a movie that denounces a dictatorship and the crimes against humanity committed by a military junta. Like his character in the movie Of Love and Shadow (where he plays a young Chilean Francisco Leal), here he plays a young Argentinian Carlos Rueda, who finds himself involved in a tragedy bigger than life. And yet he finds that imagination and remembrance brings hope to those who suffer. A beautiful and moving film, with great interpretations (bravo to Emma who acts with a heavy Spanish accent) that enters your soul and makes you feel the pain of an atrocious regime. I loved it and I suggest it to all young people to see how the madness of few can lead a country to incredible pain and sufferance",
         "I would like to add a commentary to something that many have been complaining about; the supernatural part of the movie. I myself believe that Carlos'ability to \"see\" what happens to the \"disappeared\" only is a way to in a short time (it was first a novel, that this movie is based on)tell the story of many people. It's not the focus, not the \"big deal\" of the movie that they want us to see, but a way to let us understand that this didn't just happen to some, but to many. I myself am daughter of an Argentinian, but was born and raised in Sweden. My father has many times told me the story of the \"disappeared\". I have seen many movies about this dark time in Argentinas history, but was very happy that it also was one made in English, with actors that the whole world would recognize. Because it would bring the story to many, just as it happened to many. Sadly, it didn't get great reviews, but I think that at least those who are interested in history will find the movie. The parts with torture, rape, and humiliation are very few. It's a movie based on real events, and all the parts that some feel are too heavy are sadly a part of that truth, and because of that they can't be cut out of the movie. Argentinians only need to look at the cars to remember... People who don't know what happened need to see the whole truth. I loved this movie, it moved me deeply.",
         "I was truly saddened as I watched this--as it hit me that the real tragedy of this time period was being used as a backdrop for a suspense story about a man who discovers his powers of clairvoyance. See \"The Official Story\" or \"Missing,\" as another person mentioned on this message board, for a real sense of what happened. The gratuitous scenes of torture and death reflect a terrible lack of understanding of what went on in that country. The purpose of this film does not appear to be to shed light on any sort of reality of what happened, but rather to tell some sort of fictitious hero's story. It plays upon the deepest wishes of the victims of a tragedy for an outcome different from what really happened. Ridiculous and infuriating.",
         "History classes had taught me some of the darkest moments in modern history. And I always seemed to be gasping away when learning about it. Don't even get me started talking about it. We had been living in a civilised society and we should be thankful for it. History had shown us how sometimes life can be just...not really the way we want to live at times. The movie, which is based on Lawerence Thorton's work of the same name, tells about the military dictatorship that Argentina went through during 1976-1983 through the eyes of a theatre director husband Carlos (Antonio Banderas) and his journalist wife Cecilia (Emma Thompson). During those darkest moments, many were captured and Cecilia were among the targets as well where unfortunately, she was captured too. Given she is a journalist herself and she wanted to report about the suffering. At the same time, Carlos seemed to have this psychic power about knowing the future and where his wife might be. He knew he had to find her, no matter what happens. Even to the point that the theatre that he owned had to be closed down. The price of human suffering through military dictatorship is clear for all to see. You get people who are living in fear. And those who dare to defy the dictatorship. Maybe speaking from someone like me who was once a History student, I felt even more horrified and aghast when watching this movie. It's just, scary.",
         "So, I'm not the best at keeping up with current events. I have a job that I spent most of my time at to keep from being laid off. Local newspaper information about other countries and governments tends to be skimpy and colored by what the newspaper thinks we're interested in seeing. I am eternally grateful to live where I do, but it's only through books like \"House of Spirits\" and \"Bitter Winds\" that I really hear about other regimes. Because I spend a lot of time at a job that isn't exactly relaxing, I'm not hot on movies that are stressful. Classic musicals, comedies, and movies that have big names or get a lot of buzz are movies I'm likely to see. If this move had been made in Spanish and lacked Thompson and Banderas, I wouldn't have seen it. If that means the movie wasn't true to Argentina as some of the reviewers have indicated, well, at least the story reached one more person this way. Maybe the story had some holes in it (OK, the ESP thing was a little far fetched), but the overall impression of the method used to administer \"political\" power in a oppressive regime will never leave me. (And the movie reminded me why isolating armaments to a military group is a really bad idea.) Several comments from the reviewers were incredibly moving, made me appreciate all the more that I live where I do, and made me very glad that I did see this movie.",
         "This is slow and un-dramatic film, about a man who can remember the future, focused around 'los desaparacidos' or the disappeared thousands of Argentina who were kidnapped, tortured and killed. They are called the red deaths. The story of the Argentinians during this time of oppression is a horrific one and this tedious film starring Emma Thompson and Antonio Banderas relies on their truly sorry stories to sell the film. Argentina is a vast country and the camera work in the film allows us a small glimpse at their beautiful landscapes, and these moments were the highlights of the film. In my opinion it was difficult to tell if the acting from Antonio or the script was worse. This period in history for Argentina deserved altogether a better representation of the troubles endured. So a very disappointing watch.",
         "I have NOT seen the movie yet. However, judging from the site's review, it is plainly obvious that the critic is an uninformed, right-wing, biased fascist ready to dismiss the suffering of thousands with the old lame excuse that the subject matter is not based on \"official\" recorded history. My advise to those interested in watching this movie is to be informed ahead of time so you can make your own judgment. Read, read, read. Talk to people who may have lived through this period, or their living relatives. And remember that most people who actually experienced the kidnappings and torture are no longer here to tell their story. So we can \"imagine\" what they went through, without taking the \"official\" stories for granted.",
         "The military dictatorship of Argentina 1976-1983 is indeed, horrifying, and deserves to be condemned and not forgotten; the stated purpose of this movie. The problem with this film is that scene after scene of unending brutality, including the torture and murder of a child, is unbearable. The torture, rape and murder sequences are too graphic and too long. It is possible to make a film that publicizes and condemns the crimes of a military dictatorship without having the bulk of the film consist of torture scenes. Also, the plot itself leaves the viewer with more questions than answers. Two better films on the subject of the abuses of military dictatorships in South America are Kiss of the Spider Woman and Missing.",
         "This film isn't pleasant, and it isn't terribly unique, but I found it to be a good film nonetheless. The characters did affect Latin-tinged English accents, which somehow seemed sensible to me; the written material was always in Spanish, yet the characters had to speak English for us to understand it. The core of the story: a woman political writer disappears, and her playwright husband finds he has a psychic gift that tells the story of other missing children and adults. During the late 70's and early 80's 30,000 Argentinian citizens disappeared without explanation, and this is a fictionalization of their disappearance that was 14 years in the making. His journey ends up being more like Hamlet than anything else, and borrows from \"Missing,\" \"Death and the Maiden,\" \"The Gift,\" and \"Waking the Dead.\" But it resists becoming a revenge fantasy, which is what makes it unlike these others and most mainstream American films. Yet every justification for it becoming one is presented, sometimes quite graphically, so in the end the viewer is justifiably shocked and enraged how the situation was handled in Argentina. One of the man's dreams is recurrent, and unlike the rest, it doesn't come true. This makes the story more palatable, but it doesn't make sense in the context of the story. Some of the cinematography is beautiful and the dream-time imagery is quite poetic. The editing is fine, and both the audible stories and visual stories frequently interact to tell a combined story that's more effective than either one alone. I found George Fenton's score to be the most interesting of his efforts that I've seen, perhaps closer in spirit to Mark Isham's work than anyone else's. Curiously, the final song under the titles is Brazilian, sung quite well by Banderas. My Argentine friends played it constantly during the late 70's and early 80's, the period that the film is set within.",
         "Emma Thomson, Antonio Banderas, and the dark period of 1976-1983 in the history of modern Argentina, would be adequate elements in the hands of director Christopher Hampton to produce a very interesting motion picture without mixing any clairvoyance in the script. However, the film documents with some success an appalling portrait of the brutality of General Videla's regime, and gives the opportunity to the oblivious onlooker to get a shocking glimpse of the methods employed by the military to secure their stay in power. The core issue in the movie is the so called \"El Proceso,\" or the \"Dirty War\", when almost 30,000 people were kidnapped by the regime's secret police, tortured and ultimately \"disappeared\" by their abductors. Some scenes, particularly the repeated rape sessions, are pretty dreadful, but they communicate the right message to the viewer and record for the sake of history what was happening in Argentina at that time. Emma Thompson in the role of the \"disappeared\" journalist Cecilia Rueda is always an exceptional performer. Antonio Banderas, acting as her husband Carlos, is less convincing and his act is losing impetus every time he plays the clairvoyant who can foresee what will happen to the \"desaparecidos\" including his wife and his daughter. You may see the film to know how it ends. It helps anyway to remember how the real history unfolded. General Galtieri replaced Videla, led his nation to a lost war with Great Britain over the Falklands, and in 1983 Argentina returned to civilian rule. Following Carlos Menem election in 1989, an amnesty law was passed remissive of the criminal acts of that period. Last June 2005, the Supreme Court of Argentina scrapped that Amnesty Law, thus lifting all protection against prosecution of the former military officers responsible for human rights abuses during the dictatorship years."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Multivideo",
         "Arenas Entertainment",
         "Myriad Pictures"
      ],
      "summaries": ["Antonio Banderas and Emma Thompson star in this gripping political thriller about a man with the power to see the fate of missing people - with the exception of his own beloved wife."],
      "budget": 0
   },
   "movielensId": 157214,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2003-09-13",
      "dvdReleaseDate": null,
      "directors": ["Christopher Hampton"],
      "runtime": 107,
      "movieId": 157214,
      "title": "Imagining Argentina",
      "mpaa": "",
      "actors": [
         "Antonio Banderas",
         "Emma Thompson",
         "Leticia Dolera",
         "Maria Canals-Barrera",
         "Rubén Blades",
         "Irene Escolar",
         "Fernando Tielve",
         "Hector Bordoni"
      ],
      "imdbMovieId": "0314197",
      "originalTitle": "Imagining Argentina",
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set during the unsettling disappearances in Buenos Aires during the dictatorship of the 1970s, the film involves theater director Carlos Rueda and his wife Cecilia. Shortly after Cecilia writes an editorial commentary questioning the mysterious abductions, she is herself abducted and taken into police custody.",
      "tmdbMovieId": 34036,
      "avgRating": 3.25,
      "releaseYear": "2003",
      "numRatings": 2,
      "posterPath": "/xbRs21rdFB9UMNIXQa0QCmpChG8.jpg"
   }
}