{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt3798628",
      "video": false,
      "title": "Brand: A Second Coming",
      "recommendations": [
         88052,
         381287,
         253277,
         172824,
         172469,
         90949,
         60792,
         348955,
         176077,
         40562,
         365491,
         290290,
         46018,
         18035,
         14937,
         237614,
         333387,
         97406
      ],
      "backdrop_path": "/end7d5JkaLYZ2lRVJIn8yJElkDe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54c1bf25c3a368142100f0c5",
               "name": "Russell Brand",
               "profile_path": "/WwyYUbZYq4YJ7Zh7KTy1klJNso.jpg",
               "id": 59919,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 0,
               "credit_id": "54c1bf31c3a36878d0002be0",
               "name": "Katy Perry",
               "profile_path": "/qrQuxz0aVSppQimvbCcXo2JEW5i.jpg",
               "id": 111455,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54c1bf3bc3a368142100f0c9",
               "name": "David Lynch",
               "profile_path": "/3xMyM3kvPqrIgcFQsHT7hVmIwwf.jpg",
               "id": 5602,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54c1bf4ac3a36878d0002be6",
               "name": "Stephen Merchant",
               "profile_path": "/A70Gtg3kkTeCBgtFkSRPu9qfPQu.jpg",
               "id": 39189,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54c1bf55c3a3687929002ccd",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54c1bf619251412489002b0c",
               "name": "Mike Tyson",
               "profile_path": "/dENp2l4nk5wv6F0AT1iQ3pf4Os1.jpg",
               "id": 80757,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54c1bf6c92514124460029de",
               "name": "Simon Amstell",
               "profile_path": "/zOqetWA9ABh6X5eXMJtfx2hYN6N.jpg",
               "id": 1221053,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54c1bf779251412489002b0e",
               "name": "Karl Theobald",
               "profile_path": "/vFe9LXYBe19elaArLSrRArpRSwX.jpg",
               "id": 1224723,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54c1bf81925141315a00500f",
               "name": "Noel Gallagher",
               "profile_path": "/IfEw48V778qafbpiJilce9wlmw.jpg",
               "id": 143210,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54c1bf8c925141315a005011",
               "name": "Shepard Fairey",
               "profile_path": "/9uLut7ZNHNIiRxvonSmAuPTOLTC.jpg",
               "id": 97515,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "54c1bf09c3a368792c002843",
               "name": "Ondi Timoner",
               "profile_path": "/pwvYguMn1MKFHWiBgBU5MFgi8en.jpg",
               "id": 19416,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "564d70379251416de300600b",
               "name": "Ondi Timoner",
               "profile_path": "/pwvYguMn1MKFHWiBgBU5MFgi8en.jpg",
               "id": 19416,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.779887,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 320586,
      "vote_count": 10,
      "budget": 0,
      "overview": "Comic Russell Brand uses drugs, sex and fame in a quest for happiness, only to find it remains elusive. As he explores iconic figures such as Gandhi, Malcolm X, Che Guevara, and Jesus, he transforms himself into a political antagonist.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Brand: A Second Coming",
      "runtime": 105,
      "poster_path": "/mEYXstlM4UFceTs6eFign5n0Wjc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Interloper Films",
            "id": 5443,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mayfair Film Partnership",
            "id": 66042,
            "origin_country": ""
         }
      ],
      "release_date": "2015-03-13",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ondi Timoner"],
      "runtime": 100,
      "synopsis": "BRAND: A Second Coming chronicles actor / comedian / activist Russell Brand on his journey from addict, self-proclaimed narcissist and Hollywood star living in the fast-lane to his current, and unexpected, role as political disruptor & newfound hero to the underserved. Criticized for egomaniacal self-interest, Brand injects his madness in to the world and calls for revolution. He stays the course with an irreverent courage that inspires a new generation of activists to rise up against the ever-increasing world engorged in Consumerism. Can Brand rise against the roar of criticism from the very system that built him? Does he have the fortitude, resilience and commitment to keep up the fight? Will he find true happiness which has eluded him since childhood? BRAND: A Second Coming takes audiences behind the scenes of this wildly complex man for an intimate look at what drives Russell Brand as he continues to be the consummate disruptor. BRAND: A Second Coming is a feature documentary produced, written and directed by award-winning filmmaker Ondi Timoner (DIG!, WE LIVE IN PUBLIC)",
      "writers": ["Ondi Timoner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3798628/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ0NDI1MzE2OF5BMl5BanBnXkFtZTgwMTc0MTc4NjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Russell Brand",
         "Simon Amstell",
         "Andrew Antonio"
      ],
      "reviews": [
         "To call Russell Brand a polarizing figure in the realm pop culture would be something of an understatement. Over the years, the comedian, actor and author has concocted a public persona that is equal parts amusing and annoying, and there doesn't seem to be much middle ground when it comes to opinions of his particular - well, \"brand\" of humor. The documentary Brand: A Second Coming, which opened the 2015 SXSW Film Festival, seeks to explore the many facets of Brand's personality. Not a stone is left unturned here, from Brand's early days as a comedian and talk show host, to his headline-making romance with pop singer Katy Perry, to his current mission to spark change in the political and social climate. While much of the material is undeniably funny, director Ondi Timoner certainly isn't afraid to let things get a bit darker. Home video footage of Brand in his younger days, slumped against the wall of his apartment and smoking methamphetamine, offers a very candid representation of his well-documented battle with drug addiction. Timoner also examines Brand's recovery, which ultimately led to another addiction that was arguably just as harmful: sex. And of course, his highly publicized marriage to (and divorce from) Katy Perry doesn't escape the scrutiny of Timoner's camera. But for every melancholy moment, there are just as many entertaining and engaging scenes, much of it culled from talk show interviews and some of Brand's stand-up comedy performances. The documentary was actually being produced during the time Brand was creating his Messiah Complex special, and footage from this performance is weaved throughout the film as Brand discusses many of the figures which would inspire the finished product, and ultimately help to inform the belief system he has developed. Brand: A Second Coming also spends a hefty amount of time on Brand's desire to enact social and political change, and his belief that a revolution is not only a necessity, but an inevitability. His beliefs may be a bit too radical for some, but it's nearly impossible not to admire him for his conviction and dedication to those beliefs - even if he sometimes has trouble balancing his activism with his desire to remain in the public consciousness. With Brand: A Second Coming, Timoner has constructed an interesting and enlightening portrait of one of pop culture's most fascinating figures. It's doubtful that anyone viewing the documentary will have their opinion of Brand swayed in one direction or another, but it does shed some light on the influences and experiences that have shaped him into the person we see today.",
         "A compelling, deeper look into the message and autobiographical motivations of an intriguing figure, often overlooked and overshadowed by the cloud of self-induced mania and crude humor that his various addictions have covered him by. I loved Brand in Forgetting Sarah Marshall, was annoyed by him in Get Him to the Greek, and now, after being captivated by his story and passion throughout the rather long running time of this documentary,respect Brand and his tenacity for his latest life's mission. Give this film a chance and you might be pleasantly surprised, if not by Timoner's artful compilations of Brand's vulnerability in the documentary itself, by the insatiable vision of an electric man searching for his truth. Part biography, part call for social change, and completely fascinating, Brand: A Second Coming is worth a watch.",
         "Quite an interesting documentary, that is, if you think Russell Brand is interesting. I do think he is an interesting person and i liked the documentary. it showed Russell brand's good and bad sides, it wasn't one-sided. It did feel a little long for a biographical documentary, but never boring because of that. The documentary mixes behind the scenes clips of Russell's life, clips of his stand-up comedy act and interesting conversations on his political engagement. Russell Brand also opens up about his dark drug past. Altogether the documentary is a great mix between comedy and drama with a clever political message. Great for Russell Brand fans and anyone who wants to know more about him.",
         "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning Filmmaker Omni Timoner chronicles Russell Brand's meteoric rise to fame in this little publicized documentary, from his fractured childhood with his wayward father and cancer stricken mother, to his commute to London to seek fame and fortune, and the whirlwind of mania his unrestrained, egotistical persona generated when this dream came true, with repeated scandals that ultimately only propelled his career further, before making his mark on America, and marrying pop star Katy Perry, before his more recent attempts to start an anti capitalist revolution. With the film roles becoming less frequent (or certainly less publicized) Brand now appears to have turned his hand to documentary film making, or at least documentaries where he is the subject, such as this self aggrandizing narrative. I obviously wasn't sufficiently interested to get round to catching his wealth disparity doco The Emporor's New Clothes, and so for what appears to be a similarly marketed second feature, I was expecting something alike. With at least two autobiographies and endless media exposure, Brand's chart to fame and personal life have already been well exposed to any of his fans who lap up the celebrity culture he purports to despise yet over the years has become intrinsically a part of, and so this insight at the start of the film pretty much covers common ground. It's a less satisfying departure from the personal mission he was exploring in the last film, and for a self confessed egotist to see his life story documented in such a way, the feeling of self indulgence is a little too much to take. It leaves you unable to comment personally on Brand's skills as a documentarian, and whether he can convey his social message in a truly engaging light, but this missold effort leaves you a little short changed. **"
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "Mayfair Film Partnership",
         "Interloper Films"
      ],
      "summaries": [
         "Follows comedian/author/activist Russell Brand as he dives headlong into drugs, sex & fame in an attempt to find happiness, only to realize that our culture feeds us bad ideas & empty idols. Through his stand up, Brand explores his own true icons - Gandhi, Che Guevara, Malcolm X & Jesus Christ- & evolves from addict & Hollywood star to an unexpected political disruptor & newfound hero to the underserved. Will Brand hold fast against the roar of criticism to break out of the very system that built him?",
         "BRAND - A SECOND COMING follows comedian Russell Brand's spiritual journey from addict and Hollywood star to self-proclaimed revolutionary and explores our relationship to the consumerism and individualism that drives our society and distracts us at a time when it's vital for all of us to wake up and take action."
      ],
      "budget": 0
   },
   "movielensId": 157428,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-03-13",
      "dvdReleaseDate": null,
      "directors": ["Ondi Timoner"],
      "runtime": 105,
      "movieId": 157428,
      "title": "Brand: A Second Coming",
      "mpaa": "R",
      "actors": [
         "Russell Brand",
         "Katy Perry",
         "David Lynch",
         "Stephen Merchant",
         "Oliver Stone",
         "Mike Tyson",
         "Simon Amstell",
         "Karl Theobald",
         "Noel Gallagher",
         "Shepard Fairey"
      ],
      "imdbMovieId": "3798628",
      "originalTitle": "Brand: A Second Coming",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["Py2Y0_B805w"],
      "plotSummary": "Comic Russell Brand uses drugs, sex and fame in a quest for happiness, only to find it remains elusive. As he explores iconic figures such as Gandhi, Malcolm X, Che Guevara, and Jesus, he transforms himself into a political antagonist.",
      "tmdbMovieId": 320586,
      "avgRating": 3.7,
      "releaseYear": "2015",
      "numRatings": 5,
      "posterPath": "/mEYXstlM4UFceTs6eFign5n0Wjc.jpg"
   }
}