{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1723111",
      "video": false,
      "title": "Held Up",
      "recommendations": [],
      "backdrop_path": "/kglCLOtAF0vnyiIZUiw6nzUpzfP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Homeless Guy",
               "gender": 2,
               "credit_id": "52fe463ec3a368484e08605b",
               "name": "Steve Agee",
               "profile_path": "/uKVbxQJ60nksFoBKQfuGw6wOqrP.jpg",
               "id": 559457,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rachel Gonzales",
               "gender": 1,
               "credit_id": "52fe463ec3a368484e08605f",
               "name": "Maria Bamford",
               "profile_path": "/oIZNnvkfZIvLv0VG1aFXzOBkMjg.jpg",
               "id": 60278,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ray",
               "gender": 0,
               "credit_id": "52fe463ec3a368484e086063",
               "name": "Jon Dore",
               "profile_path": "/qlYObtOTtq80DLp2zmgmXIaXGmW.jpg",
               "id": 205459,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rocky 1",
               "gender": 2,
               "credit_id": "52fe463ec3a368484e086067",
               "name": "Cyrus Farmer",
               "profile_path": "/haYJFwykiXoFeaiIXiHD1kqe2jM.jpg",
               "id": 82166,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jan",
               "gender": 1,
               "credit_id": "52fe463ec3a368484e08606f",
               "name": "Suzy Nakamura",
               "profile_path": "/rymamRd9wzjZquxMBKWOkylD5wN.jpg",
               "id": 26998,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Homeless Interpreter",
               "gender": 1,
               "credit_id": "52fe463ec3a368484e086073",
               "name": "Tig Notaro",
               "profile_path": "/yDqr2bVV7Q5QCs3anKLuTbGWbKi.jpg",
               "id": 220088,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Rocky 2",
               "gender": 1,
               "credit_id": "52fe463ec3a368484e086077",
               "name": "Kaitlin Olson",
               "profile_path": "/t8I6YPdmPTBgdY5ymqygCxciMYf.jpg",
               "id": 95102,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Batman",
               "gender": 2,
               "credit_id": "52fe463ec3a368484e08607b",
               "name": "Jason Sklar",
               "profile_path": "/kocoW4SCzv3YjnsDmvBJG054YNf.jpg",
               "id": 172169,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Robin",
               "gender": 2,
               "credit_id": "52fe463ec3a368484e08607f",
               "name": "Randy Sklar",
               "profile_path": "/fE67ditk8XnNdX5sB98ykKBZbrj.jpg",
               "id": 172170,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Hector Stiffman",
               "gender": 2,
               "credit_id": "533ad417c3a3680e69007f07",
               "name": "Samm Levine",
               "profile_path": "/7bCP9ywV6162BSGHjKtRXI5g1a8.jpg",
               "id": 58507,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Martin",
               "gender": 0,
               "credit_id": "53f3ad5fc3a36823180001ce",
               "name": "Eddie Pepitone",
               "profile_path": "/90SZlLy5HQ0DcE2R0NwEpsvqfXJ.jpg",
               "id": 1214063,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Douche Bag",
               "gender": 0,
               "credit_id": "53f3ad71c3a36822fd0001e3",
               "name": "Nick Kroll",
               "profile_path": "/puZov7sMmuVkvdqJvmlxtWcS1fU.jpg",
               "id": 208519,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463ec3a368484e086057",
               "name": "Arthur Mulholland",
               "profile_path": null,
               "id": 1261740,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53f3adaac3a368230c0001ce",
               "name": "Jason Sklar",
               "profile_path": "/kocoW4SCzv3YjnsDmvBJG054YNf.jpg",
               "id": 172169,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53f3adb2c3a36822fa0001c5",
               "name": "Randy Sklar",
               "profile_path": "/fE67ditk8XnNdX5sB98ykKBZbrj.jpg",
               "id": 172170,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f3adbfc3a36823180001d6",
               "name": "Gene Hong",
               "profile_path": "/qLvIbTnVFkI369VeAEsYcn6Xo3k.jpg",
               "id": 458014,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 1,
               "credit_id": "5aa53992c3a3687c25024c4e",
               "name": "Keri Smith",
               "profile_path": "/3kU2ZqlEgirseKdkgcrNDmd4iS5.jpg",
               "id": 1995941,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.203883,
      "production_countries": [],
      "id": 60961,
      "vote_count": 2,
      "budget": 0,
      "overview": "Kaitlin Olson (It's Always Sunny In Philadelphia) stars opposite Jon Dore in this hilarious heist comedy written and directed by Jason and Randy Sklar (Cheap Seats). A disgruntled and bored bank teller named Ray (Jon Dore) finally gets his wish for some excitement when the branch is held up by two teams of crazy robbers disguised as Rocky I, Rocky II, Batman and Robin. As the robbery unfolds, the hostages fall victim to a comedic version of the Stockholm Syndrome and begin sympathizing with their dimwitted captors, which leads to an extended siege as Ray pursues a romantic relationship with one of the robbers (Kaitlin Olson).",
      "similar": [],
      "original_title": "Held Up",
      "runtime": null,
      "poster_path": "/rHUm292Xyr6WL5CKzFtQDfhdfBu.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2010-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Best. Heist. Ever.",
      "adult": false,
      "homepage": "http://www.crackle.com/c/Held_Up",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Steve Carr",
         "Arthur Mulholland"
      ],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Randy Sklar",
         "Jason Sklar"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1723111/",
      "coverLink": null,
      "actors": [
         "Jon Dore",
         "Jason Sklar",
         "Randy Sklar"
      ],
      "reviews": [
         "I laughed throughout. Non-stop. This is really a stylish ensemble packed to the rafters with laughables. The comedic timing is genius, there is not a dull moment. Sure ==> there are cheesy moments, the characters could be developed a bit more, the score... well the score was spot on. The score was a perfect mimicry of the scenes: a quaint, goofy eloquence of sorts... And developing the characters any further would be to the detriment of the film. The cheesy moments were perfectly timed. This is COMEDY. There's not much I'd criticize here. I throughly enjoyed this one. It was a brilliant display of wit. I love to smile and this did not disappoint. I smiled from the moment \"A Crackle Film\" appeared on the screen and Ray (Jon Dore) began his spiel about pigs that could coalesce into \"a force with a stench so bad it'd have to be smelled to be believed.\" That line he delivered with a stolid seriousness... It truly set the stage for some exquisitely laughable moments. And I giggled raucously. I laughed throughout. Non-stop.",
         "This highly amusing series of \"webisodes\" was written and co-produced by Jason and Randy Sklar, twin comedians who may be best known for their ESPN series \"Cheap Seats.\" The lead character is Ray Pfeiffer, a depressed bank teller & unsuccessful stand-up comic (Jon Dore, a Canadian comedian who had his own show there). Jan, his self-esteem-impaired manager, is Suzy Nakamura (who has had recurring roles on \"West Wing\" and \"Curb Your Enthusiasm\" and most recently as the Principal on \"10 Things I Hate About You\"). Ray is desperate for something, ANYTHING, to happen at his bank. Dore's derisive comments in front of customers would get him fired in about two minutes in a real bank, but as a sort of audible inner monologue they are quite funny, especially for anyone who has worked in a customer service environment. Nakamura is effective as partly a straight-woman and partly as the deliverer of dry, very dark humor driven by her self-delusion concerning the devotion of her boyfriend, Phil. The Sklars are (as always) a lot of fun with their shticky, neurotic banter. Their contributions to a list of demands are especially amusing. An obvious comparison would be to a pair of less whiny and far less intellectually ambitious/pretentious very early Woody Allens. There are also several running gags about Twitter, local TV news, and the financial woes of government in California. Cyrus Farmer is solid as the most serious of the bank robbers but doesn't have much comedic material to work with. Among a number of funny minor characters, Steve Agee and Tig Notaro (both from \"The Sarah Silverman Program\") give scene-stealing turns in small roles. The real gem here is a sharp, biting performance by Kaitlin Olson, who puts the perfect comic timing and delivery she developed as Becky (Cheryl's sister) on \"Curb Your Enthusiasm\" and refined as Dee on \"It's Always Sunny in Philadelphia\" to outstanding use here. There is a significant amount of crude language and there are several crude sexual references.",
         "I love Jon Dore, so I had to watch this movie. At first it seemed dumb and a waste of my time, but I decided why not. In the end I am glad that I watched the movie. Having so many popular comedians just made this movie a hilarious. I recommend this movie to anyone who enjoys comedy. So if you don't enjoy comedy stop watching comedic movies and rating them low... Jon Dore is amazing! The Sklar twins are amazing. Kaitlin Olson is pretty funny. Cyrus Farmer did a bad job at acting. Samm Levine was not a likable character at all. Steve Agee just made the simple parts extravagant!",
         "I was really disappointed this movie. I wish i could get my money back. It was so painful i couldn't watch more than 30 minutes. I'm not sure if it was the bad storyline or the bad acting but i feel violated for watching it. I didn't think it was funny at all. I think it's the worst movie i've seen in a long time. All i can say is it's crap. How can a movie like this make it into redbox. Redbox you should be ashamed. The whole cop thing with the budget cuts...really??? And they let them hold up in a bank for a week...come on... a week. Seriously. And the lead actor, he tried to be funny but just wasn't. I went in with high expectations and was let down. I looks like it went straight to video and skipped the theaters. That's no surprise.",
         "This movie came on my cable movie channel and I put it on mistakenly believing that I was going to see 30 Minutes or Less, which, in itself I doubt is high brow humour, but at least that film probably contains some laughs. While I can't say that I made it longer than 15 minutes into this movie, there was absolutely nothing funny on the horizon when I did throw in the towel so I think 15 minutes was enough to give me the big picture. What I did see in 15 minutes was terrible acting, writing, and painfully unfunny jokes. If the-thing-I-was-watching (I refuse to call this a movie actually) suddenly improved dramatically after 15 minutes, as some have claimed, then perhaps the writers can learn a thing or two about pacing, but from the level of humour on display in what I did see, I would have to say that I find that hard to believe. Simply awful sets the bar about right.",
         "This movie isn't going to win any awards but it has some genuinely funny scenes. The acting is... well the script is... um alright but honestly it does have some pretty funny scenes every 10 minutes or so. The reason I'm giving it a 6 is I went in with crappy expectations and found myself laughing more than I expected. Some of the background characters I remember from other TV shows and feel just sort of good to see them working. Even if they have no real lines I feel good just thinking to myself, \"hey isn't that the lesbian from that Silverman show\". Silverman, I wonder what she's doing these days. You know that reminds me that \"I'm bleeping Matt Damon\" video was pretty funny, I should you tube that. If you've had a couple cocktails then you will probably like this movie. And if you like It's Always Sunny then you'll dig Kaitlin. It's not the best, not the worst, but descent.",
         "This is the first time I actually take time to write a review about a movie I watched, But I just could not help myself. I had no idea what to expect here and I hate low budget films. The first few seconds of this film I was not in my seat so I didn't realize that this was low Budget but the moment I sat down took a look at the screen I said to myself 'darn!'. The moment I heard the first line spoken an unforced laugh came from my mouth. I was hooked. Right there. I laughed throughout the entire movie. I didn't look for errors or reality I just let myself laugh, and this movie had what it took to help me along. The visual aspect of this film I would not rate to high at all but the script was so funny it made watching easier cause as I said I really dislike B budget films. Why did I rate this so high.... cause it is the funniest film I ever seen. Don't let the cheap filming fool you. Watch the movie.",
         "This is, hands down, the worst movie I have ever seen. Since I enjoy the Sklar brothers' roles on Entourage, I assumed this film would have a decent amount of good comedy. I was wrong. This movie is extremely poorly acted. All members of the cast gave career-shaming performances, with the single exception of Kaitlin Olson, who, despite the extreme lack of talent she was working with, gave a fair performance. Regarding the script... was there really a script? The story came across as if a bunch of these D-list actors decided they were so funny that no script was necessary, and that they will just improv the entire film. It comes across like a teenager's bad home movie project; a self-indulgent and arrogant piece of junk. By the end, I was somehow angry and insulted that I had been subjected to the film."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Mesquite Productions"],
      "summaries": ["A bored bank teller's life changes dramatically when two teams of crazy robbers hold up his branch. The main characters are held hostage and fall victim to the comedic version of The Stockholm Syndrome."],
      "budget": 0
   },
   "movielensId": 157448,
   "movielens": {
      "languages": [""],
      "releaseDate": "2010-01-01",
      "dvdReleaseDate": null,
      "directors": ["Arthur Mulholland"],
      "runtime": 0,
      "movieId": 157448,
      "title": "Held Up",
      "mpaa": "",
      "actors": [
         "Steve Agee",
         "Maria Bamford",
         "Jon Dore",
         "Cyrus Farmer",
         "Suzy Nakamura",
         "Tig Notaro",
         "Kaitlin Olson",
         "Jason Sklar",
         "Randy Sklar",
         "Samm Levine",
         "Eddie Pepitone",
         "Nick Kroll"
      ],
      "imdbMovieId": "1723111",
      "originalTitle": "Held Up",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Kaitlin Olson (It's Always Sunny In Philadelphia) stars opposite Jon Dore in this hilarious heist comedy written and directed by Jason and Randy Sklar (Cheap Seats). A disgruntled and bored bank teller named Ray (Jon Dore) finally gets his wish for some excitement when the branch is held up by two teams of crazy robbers disguised as Rocky I, Rocky II, Batman and Robin. As the robbery unfolds, the hostages fall victim to a comedic version of the Stockholm Syndrome and begin sympathizing with their dimwitted captors, which leads to an extended siege as Ray pursues a romantic relationship with one of the robbers (Kaitlin Olson).",
      "tmdbMovieId": 60961,
      "avgRating": 3.25,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/rHUm292Xyr6WL5CKzFtQDfhdfBu.jpg"
   }
}