{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0152492",
      "video": false,
      "title": "Festival At The Poolroom",
      "recommendations": [
         43083,
         24611
      ],
      "backdrop_path": "/3hVMdBsAgtkbPq9CA6ONAeC4mKC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gavriel 'Gavri' Levi / Azriel Levi",
               "gender": 0,
               "credit_id": "52fe45759251416c7505741d",
               "name": "Yehuda Barkan",
               "profile_path": "/2Rw0fsy9w3tbduwUSK28grM1cpM.jpg",
               "id": 74603,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Hannukah / 'Haham' Hannukah",
               "gender": 0,
               "credit_id": "52fe45759251416c75057419",
               "name": "Ze'ev Revach",
               "profile_path": "/mlHruR6bAIkdOkovWrayAeAvzSu.jpg",
               "id": 74604,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Yona",
               "gender": 0,
               "credit_id": "52fe45759251416c7505742f",
               "name": "Nitza Shaul",
               "profile_path": "/hHyFDu5wR7AO7WNGaDRsqOxTqWe.jpg",
               "id": 215837,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mushon",
               "gender": 0,
               "credit_id": "52fe45759251416c75057433",
               "name": "Tuvia Tzafir",
               "profile_path": "/f9ZEv9ZBBLYSOPtdipmzzovoyJU.jpg",
               "id": 226579,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Salvador",
               "gender": 0,
               "credit_id": "52fe45759251416c75057427",
               "name": "Joseph Shiloach",
               "profile_path": "/wIlEVaa7Tcok9sv9r4zOuKvnSns.jpg",
               "id": 16609,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Halfon",
               "gender": 2,
               "credit_id": "52fe45759251416c7505742b",
               "name": "Arieh Elias",
               "profile_path": "/eOGReJOOx6klLfacU2pYznltfkA.jpg",
               "id": 583760,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45759251416c75057423",
               "name": "Boaz Davidson",
               "profile_path": "/otx19f3Nuzkfy2PWovnEgaM3qv7.jpg",
               "id": 16830,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5728fbfe92514172cb0001e9",
               "name": "Uri Dan",
               "profile_path": null,
               "id": 1182294,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5728fc0ac3a36815a4000241",
               "name": "Eli Tavor",
               "profile_path": null,
               "id": 65653,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58aee5429251410b33006ddf",
               "name": "Matti Caspi",
               "profile_path": "/bI4Srqb16VfI5wCcb1JVgkwvFGE.jpg",
               "id": 1764102,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.683091,
      "production_countries": [{
         "iso_3166_1": "IL",
         "name": "Israel"
      }],
      "id": 13520,
      "vote_count": 8,
      "budget": 0,
      "overview": "The story is about two twin brothers, Azriel and Gavriel. Azriel is a shy, religious Jew who works in a fruit shop in Jaffa. Gavriel, is a hoodlum and a good-for-nothing hustler who runs a Snooker Bar. Gavriel and his friend Hanuka make easy money by swindling people into gambling on Snooker games.One day Gavriel is forced to renew contact with his brother because he is in trouble with a gangster.",
      "similar": [],
      "original_title": "Hagiga B'Snuker",
      "runtime": 95,
      "poster_path": "/kNpAlLOasTEktP4h98gP1FMud5x.jpg",
      "spoken_languages": [{
         "name": "עִבְרִית",
         "iso_639_1": "he"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Filmaor",
         "id": 76346,
         "origin_country": ""
      }],
      "release_date": "1975-01-05",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Boaz Davidson"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Eli Tavor",
         "Uri Dan"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt0152492/",
      "coverLink": null,
      "actors": [
         "Yehuda Barkan",
         "Joseph Shiloach",
         "Ze'ev Revach"
      ],
      "reviews": [
         "Considered by many to be the funniest Israeli movie ever made, Hagiga B'Snuker stars Israel's top comedians such as Ze'ev Revach, Yehuda Barkan and Yosef Shiloah. The story is about two twin brothers, Azriel and Gavriel (both played by Yehuda Barkan), who are in no contact with each other, since they live totally different lives. Azriel is a very religious, naive and good-hearted Jew who works in a fruit shop in Jaffa and leads a very religious life. Gavriel, on the other hand, is a hoodlum and a good-for-nothing hustler who together with his friend Hanuka (Ze'ev Revach) runs a Snooker Bar. Gavriel and Hanuka make easy money by swindling innocent people into gambling on Snooker games. One day Gavriel is forced to renew contact with his brother, because he is in trouble with the mafia, and the only way to pay them off is by selling the family estate which is co-owned by Gavriel and his brother Azriel. Accompanied by a beautiful soundtrack by Matti Caspi, this movie provides a very humoristic view of the clash of cultures in Israel between religious and secular Jews. The dialogs and scenes in this movie are so funny, that you may actually pee in your pants the first time you see it. This movie is considered a cult movie in Israel, to the extent that, living in Israel, once in a while, you may bump into a person so deeply effected by this movie, that every other sentence that comes out of his mouth is a quote from Hagiga B'Snuker.",
         "This old movie features a pantheon of talented performers whose careers went on to justify the public's love for them many times over-- Tuvia Tsafir, Joseph Shiloach, Mosko Alkalai, in a bit part the immensely talented and still-lamented Talia Shapira, and on the soundtrack Mati Caspi-- in his only score for a full-length film; not to mention the stars, Ze'ev Revach and Yehuda Barkan, who both proved capable of much more serious work-- Revach in particular-- but often preferred to set their sights low. Just to watch Ze'ev Revach bump into a lamppost is worth-- well, maybe not worth sitting through the film unless you're interested in bad scripts happening to good actors. For whatever reason, though, time has treated this movie well in the Israeli public's estimation and it is soon to reappear as a stage musical (after more than 35 years). Nhro, who started watching to \"fill in the 'cultural holes' I have as an immigrant\" to Israel, was well advised but Israeli films have improved immeasurably in the years since this one.",
         "...should've known: I was all set to like Hagiga beSnooker, but it ends up it's only slightly less stupid than Charlie vaChetzi, with the same actors (Yehuda Barkan, Zeev Revach) playing sleazy scumbags trying to scam each other, one stupider and sleazier than the other, same as Charlie vaChetzi. Then just when you think it can't get any stupider, along comes the requisite meeting-the-relative-at-the-airport scene, always connected with some sort of promise of marriage to some character that has no clue s/he's been promised or has a clue but no intention of marrying the newcomer. The glamour element? I quit watching as soon as the bar owner said, \"We have to steal the guy's check back from him\". The previous reviewer called this a cult flick in the Israeli collective memory (or something to that effect). Really? I love Israeli cinema and one reason I love seeing Israeli films is to fill in the \"cultural holes\" I have as an immigrant, but this is just garbage. I gave it a \"2\" because Charlie vaChetzi deserves a \"1\", but I couldn't even come up with the minimum 10 lines to say so."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Filmonde Company"],
      "summaries": ["The story is about two twin brothers, Azriel and Gavriel (both played by Yehuda Barkan). Azriel is a shy and religious Jew who works in a fruit shop in Jaffa. Gavriel, is a hoodlum and a good-for-nothing hustler who runs a Snooker Bar. Gavriel and his friend Hanuka make easy money by swindling innocent people into gambling on Snooker games. One day Gavriel is forced to renew contact with his brother, because he is in trouble with a gangster who won the bet on a snooker game, and the only way to pay is by selling the family estate which is co-owned by Gavriel and his brother Azriel."],
      "budget": 0
   },
   "movielensId": 157645,
   "movielens": {
      "languages": ["עִבְרִית"],
      "releaseDate": "1975-01-05",
      "dvdReleaseDate": null,
      "directors": ["Boaz Davidson"],
      "runtime": 95,
      "movieId": 157645,
      "title": "Festival At The Poolroom",
      "mpaa": null,
      "actors": [
         "Yehuda Barkan",
         "Ze'ev Revach",
         "Nitza Shaul",
         "Tuvia Tzafir",
         "Joseph Shiloach",
         "Arieh Elias"
      ],
      "imdbMovieId": "0152492",
      "originalTitle": "Hagiga B'Snuker",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story is about two twin brothers, Azriel and Gavriel. Azriel is a shy, religious Jew who works in a fruit shop in Jaffa. Gavriel, is a hoodlum and a good-for-nothing hustler who runs a Snooker Bar. Gavriel and his friend Hanuka make easy money by swindling people into gambling on Snooker games.One day Gavriel is forced to renew contact with his brother because he is in trouble with a gangster.",
      "tmdbMovieId": 13520,
      "avgRating": 3.875,
      "releaseYear": "1975",
      "numRatings": 4,
      "posterPath": "/kNpAlLOasTEktP4h98gP1FMud5x.jpg"
   }
}