{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2401866",
      "video": false,
      "title": "Broken Side of Time",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Dolce / Jane",
               "gender": 0,
               "credit_id": "5359ebd0c3a3684780000d30",
               "name": "Lynn Mancinelli",
               "profile_path": null,
               "id": 558059,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Viral",
               "gender": 0,
               "credit_id": "5359ebd9c3a3684780000d34",
               "name": "Audria Ayers",
               "profile_path": null,
               "id": 1313367,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Maggie Stinson",
               "gender": 0,
               "credit_id": "5359ebe2c3a3684772000cc3",
               "name": "Olivia Whelan",
               "profile_path": null,
               "id": 1313368,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Alisa",
               "gender": 1,
               "credit_id": "5359ebecc3a3684780000d39",
               "name": "Jessica Mazo",
               "profile_path": "/3OSWEGMJcCBuRaBCu7Z2awYiF0.jpg",
               "id": 1313369,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Zach",
               "gender": 0,
               "credit_id": "5359ebf3c3a3684790000da5",
               "name": "Marcin Paluch",
               "profile_path": null,
               "id": 1299436,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Bathroom hookup",
               "gender": 0,
               "credit_id": "5359ebfec3a3684799000d39",
               "name": "Alex Brown",
               "profile_path": null,
               "id": 558056,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Fresh",
               "gender": 0,
               "credit_id": "5359ec09c3a36847a9000d31",
               "name": "Monique Demopoulos",
               "profile_path": null,
               "id": 1313370,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Guy With Camera #2",
               "gender": 0,
               "credit_id": "5359ec15c3a3684779000d75",
               "name": "Peter Lynch",
               "profile_path": null,
               "id": 1313371,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Gary",
               "gender": 0,
               "credit_id": "5359ec1cc3a3684780000d43",
               "name": "Kevin Gilligan",
               "profile_path": null,
               "id": 1313372,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5359ec2ec3a3684799000d3d",
               "name": "Gorman Bechard",
               "profile_path": null,
               "id": 558062,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5359ec3ac3a3684799000d3f",
               "name": "Gorman Bechard",
               "profile_path": null,
               "id": 558062,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5359ec44c3a3684799000d43",
               "name": "Lynn Mancinelli",
               "profile_path": null,
               "id": 558059,
               "department": "Crew",
               "job": "Additional Dialogue"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.286678,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 266540,
      "vote_count": 1,
      "budget": 0,
      "overview": "Over a million women have modeling portfolios online. BROKEN SIDE OF TIME is the story of Dolce, one of the models who've made a career of it. But now 30, and tired of competing with 18-year-olds, Dolce realizes what makes her feel most alive is also killing her. Before starting a new career behind the camera, she embarks on a long road trip home, shooting with her favorite photographers one last time, and shedding her lifestyle-acquired vices along the way. Combing real photoshoots shot cinéma vérité-style with a narrative based on some very real-life adventures in front of the lens, BROKEN SIDE OF TIME is a dark, sexual glimpse into a world never before captured in a film. A world where any woman can play the role of a model, and any man can be a photographer, and where even the best of them must consider whether the fame and money is worth the cost.",
      "similar": [],
      "original_title": "Broken Side of Time",
      "runtime": 126,
      "poster_path": "/bUNQobUACsC2azYrGYiBcUWMKgG.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-06-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "When what makes you feel most alive is killing you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gorman Bechard"],
      "runtime": 126,
      "synopsis": null,
      "writers": [
         "Gorman Bechard",
         "Lynn Mancinelli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2401866/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTczMDU0NzE2OF5BMl5BanBnXkFtZTgwNjY0MzIwMTE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Lynn Mancinelli",
         "Audria Ayers",
         "Olivia Whelan"
      ],
      "reviews": [
         "Greetings, Thank you for checking out the IMDb page for my new narrative feature, \"Broken Side of Time.\" This is a film that grew out of making my first documentary, \"Color Me Obsessed, a film about The Replacements,\" and the idea of shooting a fiction film the same way we'd shoot a documentary. No script. Just an idea for a beginning and an end, and we'd let the footage captured dictate the story when we got to the editing room. But I knew to make that work I needed a brilliant lead actress, so I turned to Lynn Mancinelli from my \"Friends (With Benefits).\" She will break your heart in this film. She will speak to the wrong decisions we all make, the abuse we often times inflict upon ourself, knowing we need to stop, but unable to, until rock bottom is hit. \"Broken Side of Time\" is a story about redemption. About starting over. About hitting that rock bottom, and realizing you are the only one who can save yourself. Lynn's character, Dolce, needs to reinvent herself at 30 and start over. And that is never easy. The 11 professional photo shoots depicted in the film were all real shoots, with some of the best photographers located on our road trip between Connecticut and Detroit. They were shot cinéma vérité style. My camera set into a corner, capturing the action as it unfolded. The only instructions to the photographers: Lynn had to be called by her character's name. I'm very proud of this film. It was made by a very small crew. At times I was the only person behind the camera (shooting, directing, doing sound), Lynn was the only person in front of it (also doing hair and makeup). The most crew members ever on set numbered 5 during the bar scenes, proof that a small collection of people who really know what they're doing can make a film look as good as a crew of 20 or 60 or more. By ordering this DVD or renting/purchasing the film on a digital platform, you are supporting indie film the way it was meant to be. (This is not a $20 million dollar Hollywood version of \"independent\" cinema.) I truly think you'll find \"Broken Side of Time\" raw and heartbreaking, and Lynn's performance beautiful. Hopefully it's a film that will stay with you for a long long time. A film that you will return to, finding some deeper meaning each time you watch it. Spotting a shot that you somehow missed the first time around. One that now takes your breath away. Thank you for coming along with us on this amazing ride. Thank you for taking the time to read this. Until next time... Gorman Bechard director/editor/cinematographer, \"Broken Side of Time\" P.S. The DVD edition on sale May 20, 2014, features a number of great EXTRAS, including: 5 extended unedited photo shoots, a bunch of deleted scenes, extended scenes, and some really funny blooper outtakes. Plus there's a featurette on how we created the look and feel of the film, and got it made on such a low budget using KickStarter.",
         "This was a dark journey for the Dolce/Jane (Lynn Mancinelli) and the viewer is right there with her. You see her at her lowest, indulging in the vices a lifestyle with no center and sustained by illusion, smoke, and mirrors, provide. You experience her world, from her eyes, and together come to a realization that the ride must come to an end. So, one more trip down the rabbit hole. Only this time, not to stay, but to say, \"goodbye\". On the road for one more stab at all the things that made this her lifestyle of choice. Indulge in one more drug binge, one more casual sex encounter, one last great photoshoot. With each experience, she sheds her demons. In the end, there is redemption in coming home.",
         "When I saw this movie at a festival in NYC last year I left deeply appreciative of how this production truly takes great advantage of the medium to do more than tell a story, but to leave a visceral impression, an experience of a lifestyle I knew very little about. Lynn Mancinelli's Dolce, an Alt model, is on a personal road to change, and the narrative is compelling (helped by an expert, understated performance by Mancinelli)- but what makes the film different most of all is how it somehow, by the time the film comes to its peaceful close, creates in the viewer the sensation of having experienced what it might like to be photographed so many times in one's life, in one's career - and how the clicking and flashing becomes a kind of battery. The beauty of the result of the photography is for the unknowing, anonymous viewer - but this film gets you inside the subject of such photography - not only on a level of empathy, but somehow, and I still can't really articulate how, on an internal level. I felt like I experienced something ironic, and that Bechard and these storytellers do a real service by bringing the unbeautiful hustle and poison in such an industry to the forefront. I like learning something about things when I watch a movie- and this really surprised me in a good way.",
         "First off, for people who seem to think every good indie film review is written by someone associated with the film, I have NOTHING to to with the film, the filmmakers, the cast, any of them. I read these silly comments here all the time, and wonder why people can't just understand we all have different tastes. I think big action movies suck. But I don't write reviews claiming that every good review was written by someone involved with the production. It's just ridiculous. That said, Broken Side of Time is a beautiful film about a woman's journey to rediscover herself, to start over, when she realizes the job she loves now belongs to 18-year-olds and she can't and won't compete. The opening half hour is a brilliant piece of acting my Lynn Mancinelli. There is virtually no dialog during this section. Instead, we see and feel the internal pain she's going through to come to the realization that she MUST move on with her life. Anyone who's ever been in a situation where they know they must make a decision they don't want to make will understand. It's like knowing you need to break up with someone. We see how hard the decision is for her. The zippo lighter scene kills me. First off, it appears to be the only light used in the scene. It's stark, it's heartbreaking, it's how humans actually behave in real life. And for the record, it's about 30 seconds, not fifteen minutes. But for people with ADD, well...y'know. Once she gets in the car and begins the road trip home, at about the 32 minute mark, the film changes tone. We see her come to accept her decision, and even turn from a very depressed creature, into the stunning model she once was. And as she slowly gives up the vices in her life, we see her smile for the first time. We see her begin to enjoy life. Everything about this film is beautiful. From the performances, to the music to the way it was shot. It felt real to me. I've been there. Every woman I know has as well. Broken Side of Time is what an indie film SHOULD be. Allow yourself to get lost in her journey. You won't be disappointed. And if you're looking for a comparison, it's very much like a French film. Think Blue Is The Warmest Color. Or the American indie film Starlet. That's the vibe. If your attention span is that of a 4-year-old, this is not the film for you.",
         "In 'Broken Side Of Time', Gorman Bechard has crafted a road-trip film that is equal parts literal and figurative. The story centers on Dolce, played by the fantastic Lynn Mancinelli, who has been modeling for a decade and is trying to figure out all aspects of her life: her career, her family, her passions, her vices, and herself. Despite not having any true insight into the life of a model like Dolce, I find it easy to relate both to her story and to both aspects of her journey. The film is beautifully shot, with captivating perspectives and dazzling balances between light and shadow, color and griminess, and action and passivity that speak directly to Dolce's movements and to her mental state throughout. Dean Falcone's score, which sounds as if could be a lost Chris Whitley instrumental album, provides a perfect backdrop from start to finish. I won't give anything away here, but I will say that of all the stories I've read and seen on film that follow a character through a journey whereby he or she is seeking redemption or change or insight into the meaning of life - whether his or hers specifically, or in a larger sense - this one speaks to me in a deeper and more direct way than most, particularly when compared to films of the past two decades or so following this general theme. Like life itself, there are moments of Dolce's journey that are hard to take, but they serve to provide both the character and the viewer with the drive to keep on going, to continue searching, to never lose hope. Bechard has struck a chord with me in 'Broken Side Of Time', and has given me plenty to think about in my own journey through life.",
         "\"Broken Side of Time\" was an interesting little project by Gorman Bechard. It follows veteran model Dolce (Lynn Mancinelli) on a road trip to her home, stopping at different places along the way for various types of photoshoots. She is leaving the modeling business, and she intends for these shoots to be her last big \"hoorah\" before leaving. We see Dolce struggling with a variety of different issues, from relationships to drinking and smoking. Through her actions and expressions, it is easy to tell what she is going through at any given moment, and Mancinelli is so convincing in the role it is hard to believe she is even acting. There are many great scenes, including my favorite where she gets behind the camera to shoot a younger model named Viral (Audria Ayers). My favorite aspect of the film was the use of natural lighting. Whether it be the sun shining through a window, or a sliver of light coming from a door, it makes the film seem all the more realistic. Bottom line, this is a good film not only if you are into the aspects of modeling and photography, but also if you like character study. I must admit, I don't get to see many indie films, but I am glad I caught this one.",
         "I cracked up when I read the review that mention ADD. And the reviewer was right on target. This is definitely a slow paced film, but one that is quite rewarding. I saw it at the Cinekink Festival in NYC, where is won best narrative feature and the best way I can describe it is that it's a journey where a woman rediscovers the joys in her life. The main character, Jane, is a mess. Drinking too much, taking too many drugs, hooking up with every guy she meets. And it all comes with her lifestyle as an internet model. She realizes that despite the good money, it's killing her. Plus she is now competing with much younger women, played in the film by real models who obviously have no problem with complete nudity. That said, there is a lot of nudity in this film. Jane is a nude model. But you never feel like its exploitation. It's her job. She's comfortable. Se we are as well watching her. My favorite part of the film was these weird self-portrait sessions. At first you don't know what's going on, but by the end when you see her photos you completely get it, and your heart is broken. I literally started to cry. It's that sort of film. Go with it. Lose yourself in it. And the rewards will be worthwhile.",
         "Possible Spoiler * * * * * * * * * * * As a retired professional photographer (corporate advertising and documentary) who 7 years ago decided to try to become a fashion/glamour photographer and wound up doing it as a hobby this film spoke to me. I've photographed many models some of them approaching retirement as our heroine is in this film. Many of the scenes were familiar to me. Allowing for exaggeration for dramatic effect (I've yet to snort cocaine with a model or to expect sex)I know that this does happen. I know that the career of a model is very short and many start thinking of retiring at age 25. Now this film does not speak for modeling in general or all models. All models don't snort cocaine on the set or in bathrooms, not all are alcoholics or act as prostitutes with cover of modeling, all models don't become anorexic or consider it a destructive lifestyle.The script does have a judgmental attitude toward the photography/model industry. I liked the part about the model become a photographer herself which is quite common actually many do it way before retirement. I traded my old film camera gear to a model for photo shoot once as I had gone to digital photography. The most annoying thing about the film was the music soundtrack, the constant noodling of a guitarist was aggravating and made the 2 hours seem much longer. I swear every independent movie seems to have the very same guitar soundtrack! I suppose its because its the most affordable although its supposed to make you feel more introspective but dead silence would be preferable. That said I enjoyed the film, the actresses were beautiful and the lead was a very good actress.",
         "i guess i said it right in summary title that if you see this film the wasted side of time will be the outcome the films title is broken side of time but it never shows any of it the characters are dull and have no background development at all its missing the lighting in many scenes its an independent film that talks about loneliness and photography it takes itself so seriously i don't know what were these people thinking. the plot:Dolce is 30 years old a model who once had a good career now shes alone living a rusty life before she goes to a new career she decides to take a road trip doing erotic shoots with all previous photographers she worked with. Dolce did waste some serious amount of time in the beginning playing with the cigarette lighter that's about 25 minutes of it are you kidding me then some lesbian relationship continues the rest of the film is pointless dialogs about philosophy and bad pictures Dolce was going through a lot of pain but its not like shes a war veteran or 18th century poet i am sorry but i got just bored watching this as for the cast Lynn Maincinelli did her best but script lacks focus. Overall broken side of time 2013 is a waste of time my rating is 1/10:Skipp It.",
         "OK, I have never done this, but I am 35 minutes into this film and cannot believe how awful this film is! The first 30 minutes were spent with one character. She played with her lighter for 15 minutes, spent some time on the phone, etc. The film is slightly over 2 hours long and I am getting sick and tired of people associated with a film writing phony reviews. Film making is an art, it requires a particular kind of talent and skill. Owning equipment does not a film maker make!! I wish there was some way to control bogus reviews because this does not qualify as a film! I am tired of wasting my time watching stuff that's unwatchable. Spare yourself and pass this one by quickly!!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["What Were We Thinking Films"],
      "summaries": ["Over a million women have modeling portfolios online. BROKEN SIDE OF TIME is the story of Dolce, one of the models who've made a career of it. But now 30, and tired of competing with 18-year-olds, Dolce realizes what makes her feel most alive is also killing her. Before starting a new career behind the camera, she embarks on a long road trip home, shooting with her favorite photographers one last time, and shedding her lifestyle-acquired vices along the way. Combing real photoshoots shot cinéma vérité-style with a narrative based on some very real-life adventures in front of the lens, BROKEN SIDE OF TIME is a dark, sexual glimpse into a world never before captured in a film. A world where any woman can play the role of a model, and any man can be a photographer, and where even the best of them must consider whether the fame and money is worth the cost."],
      "budget": 0
   },
   "movielensId": 157635,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-06-01",
      "dvdReleaseDate": null,
      "directors": ["Gorman Bechard"],
      "runtime": 126,
      "movieId": 157635,
      "title": "Broken Side of Time",
      "mpaa": "",
      "actors": [
         "Lynn Mancinelli",
         "Audria Ayers",
         "Olivia Whelan",
         "Jessica Mazo",
         "Marcin Paluch",
         "Alex Brown",
         "Monique Demopoulos",
         "Peter Lynch",
         "Kevin Gilligan"
      ],
      "imdbMovieId": "2401866",
      "originalTitle": "Broken Side of Time",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Over a million women have modeling portfolios online. BROKEN SIDE OF TIME is the story of Dolce, one of the models who've made a career of it. But now 30, and tired of competing with 18-year-olds, Dolce realizes what makes her feel most alive is also killing her. Before starting a new career behind the camera, she embarks on a long road trip home, shooting with her favorite photographers one last time, and shedding her lifestyle-acquired vices along the way. Combing real photoshoots shot cinéma vérité-style with a narrative based on some very real-life adventures in front of the lens, BROKEN SIDE OF TIME is a dark, sexual glimpse into a world never before captured in a film. A world where any woman can play the role of a model, and any man can be a photographer, and where even the best of them must consider whether the fame and money is worth the cost.",
      "tmdbMovieId": 266540,
      "avgRating": 4,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/bUNQobUACsC2azYrGYiBcUWMKgG.jpg"
   }
}