{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0009796",
      "video": false,
      "title": "The Whispering Chorus",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Tremble",
               "gender": 2,
               "credit_id": "52fe4ba8c3a36847f820e193",
               "name": "Raymond Hatton",
               "profile_path": "/dtzBcur5aco03B8kRguRc3IiLON.jpg",
               "id": 90333,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jane Tremble",
               "gender": 1,
               "credit_id": "52fe4ba8c3a36847f820e197",
               "name": "Kathlyn Williams",
               "profile_path": "/dybeggDRXuHMxBDTeo4vXNkIK8b.jpg",
               "id": 1064961,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Tremble's mother",
               "gender": 1,
               "credit_id": "52fe4ba8c3a36847f820e19b",
               "name": "Edythe Chapman",
               "profile_path": "/fpAQbHjFu0L8EmgiziQvpB21W0w.jpg",
               "id": 1006951,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Charles Barden",
               "gender": 2,
               "credit_id": "5a22c319c3a3680b9d0af386",
               "name": "John Burton",
               "profile_path": null,
               "id": 1464007,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ba8c3a36847f820e18f",
            "name": "Cecil B. DeMille",
            "profile_path": "/hQHlLlfyKbPGw2dS28JFvGjhXR5.jpg",
            "id": 8636,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.140683,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117024,
      "vote_count": 2,
      "budget": 0,
      "overview": "John Trimble has embezzled and obtains another identity by having a mutilated body buried in his place. He is later arrested for murdering himself. During the trial his mother, before dying from shock, asks him to keep his identity secret since his wife is now married to the Governor and expecting a child.",
      "similar": [],
      "original_title": "The Whispering Chorus",
      "runtime": 86,
      "poster_path": "/asOO7pqaiwYfbS3L6NBcX9Bx9aD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1918-03-28",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Cecil B. DeMille"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Jeanie Macpherson",
         "Perley Poore Sheehan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0009796/",
      "coverLink": null,
      "actors": [
         "Raymond Hatton",
         "Kathlyn Williams",
         "Edythe Chapman"
      ],
      "reviews": [
         "Although this unusual melodrama was made in the silent era, it may remind some viewers of the downbeat, guilt-ridden Film Noirs of the 1940s, the ones narrated in flashback by an already doomed man on the run from the law. But instead of, say, Fred MacMurray or Alan Ladd, the lead role here is taken by Raymond Hatton, a character actor who was prolific in supporting roles for decades but rarely cast in prominent featured parts, and very seldom in leads. Hatton was a distinctive-looking man, but no one's idea of a matinée idol: he was short and slight with a prominent nose, receding hairline and recessive chin. In other words, he looked not like an actor but like a \"real person,\" a guy you might see in an elevator or riding the bus and not give a second glance. And unlike some of those later films, the plot of The Whispering Chorus unfolds in a linear chronological sequence, taking the viewer on a dark ride with several unexpected turns along the way. Hatton plays an embittered accountant named John Trimble, a man who barely earns a living wage and struggles with debt. When we first meet him it's Christmastime, and Trimble keenly resents his inability to get his clothes mended or buy his wife nice things. Soon he succumbs to the wicked, seductive voices in his head -- the \"whispering chorus\" of the title -- and chooses to embezzle from his employer. However, his timing couldn't be worse, for he takes this action just as a crusading district attorney (Elliott Dexter, blandly handsome in classic matinée idol fashion) investigating fraud in Trimble's company descends on the place, specifically to examine the company's books. The guilty accountant flees, causing much distress to his wife Jane (Kathlyn Williams) and mother. When Trimble happens upon the body of a drowned derelict he gets the inspiration to fake his own murder, and throw the police off his trail. Out of thin air he concocts a man named \"Edgar Smith,\" sets him up as his own killer, then assumes a new identity for himself and goes into hiding. Years pass. Crusading D.A. Coggeswell is elected governor of the state and soon afterward marries his secretary Jane Trimble, who by this time is convinced that her first husband is dead. The Coggeswells are successful, rich, and happy, with a baby on the way. Their future hangs in the balance, however, when John Trimble, now a crippled derelict, reappears on the scene. A chain of circumstantial evidence leads to his identification as Edgar Smith. \"Smith\" is promptly arrested, tried and convicted for the murder of John Trimble! Ultimately the condemned man must decide whether to reveal the truth, or protect his wife's hard-earned happiness. The darkly ironic plot sounds like something Wilder, Preminger, or Hitchcock might have tackled in later days, but this film was directed by none other than Cecil B. DeMille, who in the early stages of his career occasionally took on material quite unlike the later spectacles with which he's usually associated. Viewers who have seen his moody, sensationalistic drama The Cheat (1915) may find similarities in the stylized touches the director utilizes here, such as the heavy shadows that hover over Trimble in the early scenes, even when he attempts to shake off his gloom and celebrate Christmas, or the touch of Griffith-style parallel cutting offered as ironic contrast, when the solemn church wedding of Governor Coggeswell and Jane Trimble is cross-cut with John Trimble's sordid assignation with a hooker in a Shanghai dive. The showiest effect is the recurring image of disembodied, whispering heads who represent Trimble's worst instincts. These ghostly-looking men encourage Trimble in his cynicism and torment him with bad advice; interestingly, the sole \"good\" voice he hears, though usually overruled by the others, belongs to a woman. It's a shame that The Whispering Chorus was never remade with sound, for this idea might have been particularly effective in a talkie. Similar devices were occasionally used in sound film, of course, but usually for broad comic effect, as when someone's conscience can be heard as a chiding voice-over, or a character torn between two moral choices must listen to an argument between an angel and a devil and choose sides. Here, the device is played straight and is never the least bit comic. This film is intriguing, but I feel it could have been better if certain plot points which strain credulity had been worked out in a more satisfying way. For example, it feels entirely too easy for Trimble to create \"Edgar Smith\" and blame him for his own homicide. The investigators instantly accept the existence of this man and are bewildered by his disappearance, but it seems obvious that the lack of any tangible history for the man would raise suspicions. Also, when Trimble returns after six years, albeit lame and scarred, it nonetheless seems unlikely that Jane could look him in the eye in the courtroom and fail to recognize her missing husband. Still, allowing for these and other moments that call for suspension of disbelief, The Whispering Chorus is an engrossing and offbeat drama, and a most interesting departure for DeMille. Some of the film history books say that this movie's failure at the box office drove the director to seek more upbeat, crowd-pleasing material, but according to Robert Birchard's recent study \"Cecil B. DeMille's Hollywood\" the film actually turned a modest profit. Moreover, the director continued to explore some of the themes found here in his later work, so it could hardly be said that this project represents a Road Not Taken. Even so, in his long career DeMille never attempted anything quite like this again.",
         "\"The Whispering Chorus\" produced and directed by Cecil B. De Mille, tells the tragic story of John Tremble and his descent into oblivion. Tremble (Raymond Hatton) is stuck in a low paying dead end job. He wants the better things in life for his wife Jane (Kathlyn Williams) and his ailing mother (Edythe Chapman). One day he decides to embezzle $10,000 from his boss Chemley (James Neill). Fearing arrest, Tremble goes into hiding. Jane goes to State investigator George Coggeswell (Elliot Dexter) for help. He is immediately attracted to her. He is called in to investigate the Chemley embezzlement but keeps the information of John's involvement from her. Tremble meanwhile is living in an old shack where one day a body of one Eric Smith, a known criminal washes up on shore. Tremble decides to switch identifies with him and stages his own murder scene. Tremble lives the good life until the money runs out and is forced to seek work as a longshoreman. He is partially crippled in an accident and is about to be arrested when a co-worker (Noah Beery) helps him to escape. Years go by and Coggeswell continues to pursue Jane. However Mrs. Tremble still believes her son to be alive even though the body of Smith had been identified as that of Tremble. Finally the old woman relents and gives her consent to the marriage of Jane and Coggeswell. Coggeswell becomes governor and he and Jane live the good life. Still later we see Tremble now reduced to a tramp trying to eke out a living on the street. He decides to go to his mother to reveal the truth. She at first doesn't recognize him. When she finally does, she collapses and dies shortly thereafter. After seeing Jane who also doesn't recognize hum, Tremble is arrested and charged with his own murder. The case come to trial, Jane is asked to testify and..................................................... Melodramatic to be sure, I thoroughly enjoyed the film. The performances were excellent particularly that of Hatton. The trial sequence is very well done and the finale very touching. Raymond Hatton is probably best remembered as the crusty old \"B\" western sidekick of the 30s, 40s and 50s but he had a long and varied career lasting over 60 years. In addition to his work with De Mille, he also appeared in several films with Lon Chaney in the 20s. A good movie.",
         "DeMille's Whispering Chorus is a haunting masterpiece that was ahead of it's time. The story line is highly creative - how the voices in your head can ruin your life. Basically, one man's degradation due to his cowardliness. This movie will make you think, which is exactly what DeMille intended. All in all, an excellent pre-20's silent film. Raymond Hatton gives a fine performance as John Tremble. His change from a handsome upstanding man to a dirty tramp on the run is wonderfully done through make up - if compare a still of him from the first section of the film to a still from the end of the picture, he is almost unrecognizable as the same actor. Kathryn Williams was a very attractive woman, and she portrays the role of Jane Tremble with delicacy. My personal opinion is that at the end of the movie, she acts in a very selfish manner, however, I think this is my 21st century eyes viewing early 20th century morals and is probably not the effect that DeMille, or screen writer Jeanie MacPhearson had in mind. Thanks to Image entertainment, this 1918 film is available on DVD for new audiences to enjoy.",
         "The Whispering Chorus is one of a number of standout films in Cecil B. DeMille's 1910s output, and for some marks the end of an era in his work. It is also perhaps the darkest and most noir-ish story he ever dealt with. Dark stories call for bleak imagery, and visuals are particularly stark here – plenty of barren sets or large areas of darkness. Furthermore with the psychological conflict going on DeMille makes heavy use of superimpositions. DeMille had always used these a lot to literalise products of his characters' imaginations, but here he goes a bit overboard and occasionally they are unnecessary. The eponymous whispering chorus (which is pretty much superfluous to the story anyway) is shown as a cloud of floating heads – not really necessary when the actors alone competently convey the anguish that their characters feel. Although he is not really known for it, DeMille was probably the best director of actors during this period (as opposed to his sound films which tend to be wall-to-wall ham). It is not only that he seems to have encouraged a satisfactory blend of realism and dramatism, it was also his use of long, unbroken takes and intelligent framing of actors. In The Whispering Chorus his handling of more emotional scenes is particularly sensitive, cutting to close-ups at key moments to highlight an actor's face. DeMille also tends to keep the sets Spartan and uncluttered for a poignant scene, allowing the audience to concentrate solely on the performers. Let's take a closer look at the lead actor. The first thing that strikes you about Raymond Hatton is what a thin face he has, and how he seems to have a permanent disappointed expression. But look beyond that, and you can see he is actually a pretty good actor – certainly better than his co-star Kathlyn Williams. Hatton is one of a number of silent stars who drifted out of the spotlight only to turn up absolutely everywhere as a character actor in the sound era – he is quite memorable as the \"murderous impulses\" barber in Fritz Lang's Fury. He made dozens of appearances for DeMille, but The Whispering Chorus is his greatest moment, both in terms of the demands placed on him as an actor and the performance he turns in. Some have labelled this as the last film in which DeMille kept his artistic integrity before giving way to commercialism. This is not really true, as pleasing the audience had always been top of his agenda, and his subsequent films do not differ a whole lot in style, although he would use superimpositions a lot less from here on, which is a good thing. It is true however that his next picture, Old Wives for New, marks the beginning of a series of rather lightweight marital comedies, after which his work would be full of the piety and sensationalism with which he is now associated. Whatever the case, The Whispering Chorus stands as one of DeMille's greatest accomplishments. It does overuse those superimposed images, but this is really the only complaint. Underneath that is a strong and very grim drama. Noir-ish and dark, yes, but it has a poignant, bittersweet edge, hitting a lot of the same notes as George Stevens' A Place in The Sun.",
         "Raymond Hatton is \"John Tremble - 2nd Assistant Cashier of the Clumley Contracting Company.\" He hears voices from the Hall of Echoes. Kathlyn Williams is \"Jane Tremble - his wife.\" Eventually, she will hear voices of her own. Elliott Dexter is \"'Fighting' George Coggeswell - A far-seeing young legislator who heads a commission with extraordinary powers to investigate the muddy waters of the state's politics.\" He tilts the scale of justice with pipe ashes. Mr. Hatton is stuck in a $25 a week dead end job, with no hope for the future; living with his mother (Edythe Chapman) he is unable to even buy a cheap little dress for Ms. Williams, for Christmas. To make ends meet, Mr. Hatton embezzles $10.000 from his company. Plagued by guilt (and an investigation), Hatton drops out of sight, for a couple of days. Whilst fishing, he reels in a dead man, and decides to exchange identity with the deceased Edgar Smith. He becomes Smith, and very unwisely (as it turns out) frames him for both the Tremble embezzlement, and the murder of Tremble - so that he may achieve martyrdom. Then, he becomes a fugitive\u0085 This is an epic psychological drama; always interesting, it slowly becomes more and more unnerving, even horrific. The crescendo of images and plot build wildly, to an INTENSE ending. The film sometimes appears to be off-track, but winds up a tightly woven nightmare. There are SO MANY images to praise - but, just watch... Also, look for the cross-cutting as Hatton fishes for a dead body while Dexter fishes for Tremble - then, later, Tremble hooks up with a Chinatown prostitute while his wife marries Dexter. Director Cecil B. DeMille and the production team are in peak condition. Hatton, remembered mainly as a \"supporting\" or \"character\" actor, performs supremely in the lead role; he effectively portrays the \"slow acid of discontent steadily consuming\" the soul of John Tremble. Williams shows some psychological problems of her own. Noah Berry has an important role as a longshoreman who guiltily houses Hatton, after unintentionally crippling him. It's difficult to believe this film was released in 1918, and has received relatively little acclaim. It's a NOT TO BE MISSED silent classic. ********** The Whispering Chorus (3/28/18) Cecil B. DeMille ~ Raymond Hatton, Kathlyn Williams, Elliott Dexter, Noah Berry",
         "I recently viewed 4 DeMille silents from the 1918-ish time period -- Don't Change Your Husband, The Golden Chance, Old Wives for New, and The Whispering Chorus. The Whispering Chorus was by far the best. I liked this film for its interesting editing (which I assume must've been very clever at the time): superimposed heads floating near John Tremble, telling him what he should do in various situations that tested his moral character -- should he gamble the Christmas money he's intended to buy his wife a dress with or not, should he embezzle from his employer or not. John Tremble makes a series of really bad choices -- so bad, that one has to wonder about his mental health and his intelligence! But no matter, without his bad choices we wouldn't have such an interesting and twist-turning plot! One of these bad choices leads John to switch identities with a dead man -- changing clothes, wallets, etc., and smashing the dead man's skull beyond recognition so the dead body can't be identified by the face. John then goes on the run and is eventually caught and accused of his own murder! Pretty exciting stuff for 1918 if you ask me! John's wife, meanwhile, has taken a job with a kindly government official (played by Elliott Dexter, who must've been a fave of DeMille's as he was in 3 of the 4 flicks I watched), who goes on to become governor of the state. The governor and John's wife, Jane, inevitably fall in love and get married. Jane has hesitated for a long time, out of deference to John's mother, but John's mother finally makes it clear to the couple that they have her blessing. There is a really interesting presentation of the wedding -- we see shots of the happy couple getting married, intercut with shots of a bedraggled on-the-run John in Chinatown making love to a Chinese prostitute. It was a very powerful statement on the contrast of these two peoples' lives (John's and Jane's), and where John's bad choices have led him to. The courtroom scene (John has been caught and is on trial for his own murder; no one believes he's really John Tremble) was rather suspenseful for me -- when Jane walked right by John on her way to the witness chair, and then again when she was asked point blank by the lawyer to look at John and say if she'd ever seen him before, my attention was definitely held captive! She looked straight at John and honestly did not recognize him. Needless to say, John was found guilty of murder and sent to death row. While in jail, Jane goes to visit him and, looking at him upclose and in the eyes, she does recognize her former husband. She asks her new husband, the governor to pardon him, but John tells her not to go to such trouble, that he deserves to die for other crimes and acts. (John had promised his mother he would save Jane even if it meant he had to die in the process, so I presume that John realizes Jane is better off with the governor than with him and the only way she can remain with the governor is if he's really not John, i.e., if John is dead.) Very heady, psychological stuff that makes you think both during the movie and even after it's over. To me, that's the mark of good storytelling. I was overall very impressed with this early DeMille, especially after watching the other 3 that I mentioned above, all of which were pretty light and fluffy.",
         "After transferring the chiaroscuro effects of Rembrandt's painting onto \"The Cheat\", director Cecil B. DeMille likens Kafka's writing in \"The Whispering Chorus\", with its disjointed, nightmarish, psychological drama. The lighting and tinting, as usual for DeMille's films, are superior. Also, as usual, the framing, staging and acting are theatrical. The mise-en-scène, tinting and editing in the dénouement were especially good. The narrative is what sets this film apart, though. The depiction of the hall of echoes, or the whispering chorus--the stream of consciousness--as superimposed faces (none of which are of the protagonist) with conflicting advice seems silly today, like a naïve representation of dissociative identity disorder (multiple personality disorder). Yet, how else could one depict a stream of consciousness in a silent film, without narration? Furthermore, the protagonist is deranged, a psychotic; this is not only evident by the faces, but also in his actions. The story is somewhat congruently nonsensical. The action follows a sort of dream logic, like a Kafka story, often lacking reason and continuing further into a surrealist nightmare of unnatural, ironic events seemingly out of the dazed protagonist's control. The editing is probably the other technique that best supports this, such as in the sequence crosscutting between Jane remarrying and John in China, jumping two years twice within a short length of film. Although DeMille was making a psychological drama, with some focus on subjective perspective, he apparently didn't intend to attempt Kafkaesque depths, and he largely fails to; there's too much causation to the plot, and the film is too objective. That DeMille was trying a narrative that somewhat differs from traditional, popular storytelling is commendable. In this respect, \"The Whispering Chorus\" \"marked a turning point in DeMille's career, causing him to abandon his interesting path of 'artistic' pictures and concentrate on films of proved appeal instead,\" in the words of American film historian William Everson (\"American Silent Film\"). I don't know about the lack of profit of this film determining DeMille's subsequent films, but at this time, early in his career, he was trying different things. And, rather than continuing along the more interesting path including this film and \"The Cheat\", he went on to make \"Male and Female\" and other such commercial rubbish. Cinema lost an interesting filmmaker here.",
         "This 82 minute silent film directed by Cecil B. DeMille was somewhat ahead of its time, being a serious attempt to film a drama of conscience in all its harrowing complexities. The 'whispering chorus' of the title consists of the rival impulses of the anti-hero, John Tremble, who is played by Raymond Hatton. A filmic device was used which may seem corny to us today, but at the time was doubtless very effective and perhaps innovative, namely the appearance on screen of diaphanous heads of good and bad people whispering to Tremble in his ear things like 'go ahead and do it' or 'an honourable person would not do such a thing'. Tremble is a man who is a bit too narcissistic for his own good, which is all too familiar to us today with the rise of smart phones from which people cannot extract their noses. Preoccupation with 'self' to the exclusion of all else has possibly become today's main social psychological problem. But in 1918 this ailment was still in its traditional form, known as selfishness. Tremble gives way to the bad voices of his whispering choruses and because he feels so sorry for himself and his lack of a new overcoat, steals some money from his employer. He has previously gambled away his last few dollars and staged a petulant scene at home in front of the miniature Christmas tree and his long-suffering wife and mother, tossing aside their small presents as being insignificant. Such spoilt-brat behaviour is bound to lead to doom, and as doom is always eagerly waiting for people to fall into it (as it has an insatiable maw) the anti-hero duly sinks into hopeless moral compromise. He disdains what he has got, namely a devoted wife and happy home, and wants what he cannot readily have except by theft. But then his theft is discovered and, to avoid going to jail, he fakes his own death and absconds to Cincinnati. (All of the action takes place in cities along the river, though the only locations we see are waterside ones.) He lives the life of a labourer and vagabond, becomes maimed and disfigured, and has a very rough time. Meanwhile his wife (played by Kathlyn Williams) has obtained a well paid job and after some years remarries a man who becomes the Governor of his state (played by Elliot Dexter). Tremble, having 'killed himself', then ironically ends up being caught many years later and charged with his own murder, as he is assumed to be the other man (whose body he had fished out of the river dead, and had not killed). All the complications one can imagine result from this state of affairs. The film is thus a very early 'film noir'. It is certainly not cheerful viewing. This film was preserved and restored by my old friend Dave Shepard, who died earlier this year. I would like to pay tribute to him, as a genuine hero of the history of the cinema. We knew each other when we were young. By a strange coincidence, when I was seventeen I independently met and befriended the stage actor John Griggs, one of the most passionate early collectors and preservers of old movies. It was only afterwards that I met Dave. It turned out that John Griggs had been Dave's mentor from the time he was a boy, as they lived near each other in New Jersey. I may be the only person left alive now who knew John Griggs, who was himself such a delightful and amusing man and enthusiast for early cinema. He had amassed over the decades a gigantic collection of 35mm prints of silent films, and this collection passed to Dave, giving him a huge head start in his career as a film preservationist. I well remember a short documentary film which Dave directed in his early twenties about children's games. He shot it mostly in a playground on 16mm in black and white and made a serious effort to understand children's mentality. It was very charming. He was always basically a sentimentalist. That film is not listed at IMDb, and I have forgotten its title. I am certain it was never distributed, and Dave was n t satisfied with it; indeed, I liked it better than he did. This DeMille film is not included in the partial list of restorations by Dave in his Wikipedia entry, but then he restored so many, there is probably no complete list of them in existence. Who knows, maybe the original print came from John Griggs. Dave and I used to discuss Eisenstein, Buster Keaton, and D. W. Griffith endlessly, and also foreign films. It was René Clément's FORBIDDEN GAMES (1952), which we both so greatly admired, which inspired Dave to want to make his own little documentary about children's games. All true cinema lovers owe a debt to Dave Shepard which they can only repay by watching as many as possible of the films which Dave loved so much and to which he dedicated his life to save and preserve for others to enjoy. Here's to you, Dave.",
         "Raymond Hatton who had a long and distinguished career since the very beginning of film is usually remembered for playing cantankerous old cusses as sidekicks in western films. But back in 1918 he was the protagonist/lead in Cecil B. DeMille's The Whispering Chorus, the story of a man tried and convicted for his own murder. The character Hatton plays seems to be cursed. He embezzles from his boss and fearing discovery flees from his wife and mother. He gets what he considers a stroke of luck finding the body of a derelict. He mutilates the body and takes the dead man's identity. That would seem to guarantee success. But here the cops get it backwards and declare Hatton under his real identity dead and the dead man wanted for the murder of Hatton. Quite a rude awakening when Hatton returns after 12 years. Furthermore his wife marries a man who is now the governor of the state and he's played by DeMille silent regular Elliot Dexter. Quite the jackpot Hatton finds himself in. The title The Whispering Chorus comes from the ghostly heads that appear to Hatton emphasizes every aspect of his nature. He has a genius for choosing the wrong path every time, listening to bad advice from his chorus of ghostly heads. The special effects were state of the art for 1918, but DeMille also had a good story to work with and Hatton while such a loser does manage to obtain audience sympathy. In some ways this anticipates what Eugene O'Neill did on stage in Strange Interlude.",
         "Almost top-billed in Cecil B. DeMille's Joan the Woman (1916) – only Geraldine Farrar in the title role is billed above him – diminutive Raymond Hatton (who turns in a great performance in Joan the Woman), gets his chance to shine bright as star number one in DeMille's The Whispering Chorus (1918). Unfortunately, the script for this one is none too convincing and Hatton emerges as more of a liability than an asset. Because of his diminutive stature, it seems incredible that none of the other characters can connect him with the \"murdered\" man. He looks the same to me, even though he does discard his beard – and an obviously false beard it is at that! Also, all this stuff about the whispering chorus does not play an important part in the story and could easily have been jettisoned. Its sole purpose is obviously to dress up a hackneyed plot and distract our attention from its highly improbable chain of events in which a wanted man just stumbles upon a body of exactly the right build and stature, thus enabling him to quickly and convincingly assume the dead man's identity. Admittedly, this all occurred before 1935 so there was no question of problems with Social Security, but it's just totally incredible nevertheless. But wait, there's more: The fugitive's destitute wife works her way up the ladder and marries the governor of the state! Boy, oh boy! Wait! There's more! Lots more! But I won't spoil the movie for you by telling you what happens next. As director/producer Cecil B. DeMille himself would say: \"If you can persuade audiences to swallow a gnat, they won't have any trouble digesting a camel.\" Available on an excellent Alpha DVD.",
         "Later known for his comic teaming with Wallace Beery, Raymond Hatton, in the teens, with support roles in \"Young Love\" (1915)(also a DeMille production) was forging a career as a \"hero's friend\" when he was given the role of his life as a cowardly embezzler in \"The Whispering Chorus\". With more than a passing nod to Dicken's \"Our Mutual Friend\", Hatton plays John Tremble, 2nd assistant of the Clumley Contracting Company, whose whispering chorus (his conscience) is sowing seeds of envy and discontent in him. The superimposed images of heads forever giving him advice shows DeMille was trying experimentation. Christmas Eve is a pretty sorry affair at the Tremble's. Long suffering wife Jane's (stately Kathlyn Williams) pathetic attempts at cheer meet with John's grumbles and his determination to find money by whatever means he can. When up and coming State's Attorney George Coggeswell (phlegmatic Elliot Dexter) demands that Clumleys do an audit of their books he finds embezzlement but by this time the thief, Tremble, has \"disappeared\" and is living as a hermit in an old shack. A body washed up on shore gives him the perfect opportunity to begin life anew as he plants papers and articles on the body so it will look as though \"John Tremble\" has been murdered and he, now as \"Edgar Smith\" is free to start a new life. But in DeMille's world cheaters never prosper and Tremble, through his cowardly approach to life goes from bad to worse. After years of degradation when he finally finds a job on the wharves (Noah Beery plays his co-worker) an accident cripples him and when he finally summons courage enough to contact his mother, police are put on his trail. An instance of the unusual symbolism - when Jane finds well deserved happiness with George, the scene switches to a drunken John being seduced by an opium girl (Julia Faye). The ending, with John finally showing a few remains of decency and goodness, must have stretched viewer's credulity to breaking point. It had no really admirable characters, the main one (Tremble) being a bleak opportunist, and no happy ending. Unfortunately coming at the end of the war it was exactly what people didn't want to see - extraordinarily experimental though it was. Really ahead of it's time, just a shame at that particular time no one wanted to know.",
         "Considering that this full-length movie was made in 1918, I'm going to cut it a lot of slack for its old fashioned story--especially because in other ways, it's very original and creative. It certainly is an odd blend of the old and the new. The film begins with John Tremble who is a clerk. You literally see faces appear around his head and they begin talking to him--telling him their opinions about what he should do. No, he is NOT schizophrenic but this is an interesting way to visualize the little messages we tell ourselves when we are considering doing good or evil--sort of like the little devil and angel on our shoulders that later appeared in cartoons (as well as ANIMAL HOUSE). It seems rather old fashioned as does the very moralistic aspects of the film. I am very glad, however, I stuck with the film because it really did get a lot better. Plus, for its time it wasn't so old fashioned and preachy. Anyway, the voices mostly tell him how unfair it is that he isn't paid more or that he and his family don't have more. This goes on for some time until eventually he ends up embezzling money. This plan blows up quickly, as an audit is soon announced. Now here is where the film really gets interesting. Where the story goes next, though very tough to believe and a tad hokey, also is really great viewing. The man runs away and lives on a lonely island--with no particular plan beyond that. When a dead man happens to wash up, he quickly concocts a strange plan. He smashes the face of the dead man (making identification, particularly at that time, very difficult). Then, in his own personal diary, he writes about how a man is going to kill him and if anyone finds the diary, then they'll know who supposedly did the dirty deed. However, the man named as the killer is the actual dead man! Everyone naturally assumes the story is true and his wife and mother grieve--thought the mother \"just knows\" that her son is still alive--at least for a while (a cliché, I know). Eventually, however, even his mother accepts that he is dead and encourages her daughter-in-law to remarry. Interestingly, the man she now is in love with is the man who will soon be the governor! He seems like a decent man and they are quite happy. Eventually, the supposedly dead man comes to hate his new life and wants to see his mother. So, he sneaks back home and sees her--at which point she has a heart attack and dies! But, they assume this \"bum\" who is in her house killed her!! When they realize she only died from a heart attack, he is STILL screwed, as they now think he's the man who murdered John Tremble! So, he is going to court--charged with murdering himself (though everyone thinks he killed Tremble). He has no real proof who he is and in a panic has his old wife called to court. She doesn't recognize him, as years have passed. Later, Mrs. Tremble/the Governor's wife wonders if maybe the man in court could really have been her supposedly dead husband. However, in a grand gesture of good, he tells everyone that he DID murder Tremble and goes to the electric chair rather than ruin his wife's new life. Sounds really tough to believe, huh? Well, of course if you can suspend disbelief, you will enjoy the story a lot more. Plus, while the old style melodrama is definitely there in spades, there is also a fascinating plot at the same time. Plus, the ending really helped elevate the story. I really wish that the director, Cecil B. DeMille, had done more stories like this instead of the huge bigger-than-life epics he was later known for making, as it has a human quality so many of his later films lack. He did direct this with style and the camera work was tremendous on individual vignettes--far more interesting than his shots with thousands of extras.",
         "Cecil B. DeMille himself described this early feature as one of the first 'psychological' films ever made, but it's actually a more-or-less typical late-Victorian Age cautionary fable, expressed (as might be expected) with a heavy dose of morality and melodrama. The story shows how a single moment of weakness (in this case the desperate embezzlement of $1,000 by a poverty-stricken bookkeeper) will ultimately lead to misfortune, and worse. Haunted by a guilty conscience, the long-suffering victim gambles away (in the following order) his savings, his self-respect, his family, and finally his own identity. Reduced at last to a penniless, crippled vagrant, he is finally arrested and, after a series of misunderstandings, charged with his own murder! Most of the heavy-handed exposition and delivery is hilarious when seen today, and the inadvertent humor kills the lingering impact of the film's often striking (for 1918) visual artistry."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Famous Players-Lasky Corporation"],
      "summaries": ["John Trimble has embezzled and obtains another identity by having a mutilated body buried in his place. He is later arrested for murdering himself. During the trial his mother, before dying from shock, asks him to keep his identity secret since his wife is now married to the Governor and expecting a child."],
      "budget": 72500
   },
   "movielensId": 157625,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1918-03-28",
      "dvdReleaseDate": null,
      "directors": ["Cecil B. DeMille"],
      "runtime": 86,
      "movieId": 157625,
      "title": "The Whispering Chorus",
      "mpaa": "",
      "actors": [
         "Raymond Hatton",
         "Kathlyn Williams",
         "Edythe Chapman",
         "John Burton"
      ],
      "imdbMovieId": "0009796",
      "originalTitle": "The Whispering Chorus",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "John Trimble has embezzled and obtains another identity by having a mutilated body buried in his place. He is later arrested for murdering himself. During the trial his mother, before dying from shock, asks him to keep his identity secret since his wife is now married to the Governor and expecting a child.",
      "tmdbMovieId": 117024,
      "avgRating": 3,
      "releaseYear": "1918",
      "numRatings": 2,
      "posterPath": "/asOO7pqaiwYfbS3L6NBcX9Bx9aD.jpg"
   }
}