{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0976039",
      "video": false,
      "title": "Hip-Hop: Beyond Beats & Rhymes",
      "recommendations": [],
      "backdrop_path": "/vlkUwjSY2u5UgUnRMRNAniWo8Pb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "5a910795c3a36824fd005b01",
            "name": "Byron Hurt",
            "profile_path": "/xxuBG6cnMOVOJY8saKQBoz8xSaL.jpg",
            "id": 216924,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.169963,
      "production_countries": [],
      "id": 14263,
      "vote_count": 2,
      "budget": 0,
      "overview": "Hip-Hop: Beyond Beats & Rhymes provides a riveting examination of manhood, sexism, and homophobia in hip-hop culture.",
      "similar": [],
      "original_title": "Hip-Hop: Beyond Beats & Rhymes",
      "runtime": 61,
      "poster_path": "/5HIeGyNGdzC0oEsaMmWmigHoDHL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-01-01",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Byron Hurt"],
      "runtime": 61,
      "synopsis": null,
      "writers": ["Byron Hurt"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0976039/",
      "coverLink": null,
      "actors": [
         "Carmen Ashurst-Watson",
         "Yasiin Bey",
         "Chuck D"
      ],
      "reviews": ["This is one of those documentaries that is much too short and only goes so much into one part of an issue to make an impact. The subject matter - looking at what manhood means in hip-hop and rap and, by extension, what it means if that manhood gets questioned or, worse yet (gasp) if there's femininity or homosexuality in that world of music - is important, and the filmmaker Bryan Hurt has the noblest of intentions. He is also a... guy certainly taking a cue from Michael Moore by putting a lot of himself into the film, often getting into testy interactions with some of the rappers - both big names, like Busta Rhymes, and no-names who are out on the street and more than happy to rap their misogynistic beats which may/may not get them a record deal - and, unfortunately (or happily?) the film is dated. I say happily since, from even my limited perspective (I know somewhat about the current state of rap and hip-hop if for no other reason than that's what is now a major chunk of pop music today, still, after these decades), rap has changed in the decade since this came out. How much the internet has grown is a big part of that, but it's also that as a culture, as much as some people ranting and raving on Twitter (on both sides, both liberal and conservative in the black and white worlds), newer voices are being accepted like Frank Ocean and Kendrick and Kanye and even rawer ones on the female side like Nikki Minaj (who may be like the example of a rapper in the opposite direction, but it occurs to me typing this the director here doesn't get a single female rapper on camera as I can recall, and I'm pretty sure they were not like the great white elk of the genre). It has some good music video clips sprinkled throughout, most notably of Nelly's \"Tip Drill\" (which I didn't even know was a thing), and even DMX (even here, in 2006, Donald Trump makes a goddamn cameo for a few seconds, thanks DMX), and some insightful interviews with the likes of Chuck D, Eric Michael Dyson, one gay rapper (who's name escapes me now, sorry) and Talib Kweli. There are even points where one wants to laugh, though it's *at* some of the subjects on screen for being so ignorant and terrible, like the eighteen year-old who may/may not know any better who calls most women the B-word and talks like the poorest example of his generation. And what it has to say about how black MALE stereotypes and the perpetual cycle of imagery on BET is worthwhile too. At the same time though, it's not indicative of things how they are now, and maybe it was only a sampling of what was back then. The production quality is decent but unremarkable - it got played at Sundance, but it seems like something shot for television, and its thesis gets repeated too much. I think it's mostly not the movie's fault that, ironically, it's now kind of a museum/historical piece more of sociological interest. Again, this may be a good thing that this is not *as* relevant today as it was in 2006. It's not that it has lost its topical value as there's naturally still terrible/terribly misogynistic and braggadocious rappers out there. But the documentary doesn't make an urgent case for it in the *now* either."],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [],
      "summaries": [
         "Hip-Hop: Beyond Beats & Rhymes provides a riveting examination of manhood, sexism, and homophobia in hip-hop culture. Director Byron Hurt, former star college quarterback, longtime hip-hop fan, and gender violence prevention educator, conceived the documentary as a \"loving critique\" of a number of disturbing trends in the world of rap music. He pays tribute to hip-hop while challenging the rap music industry to take responsibility for glamorizing destructive, deeply conservative stereotypes of manhood. The documentary features revealing interviews about masculinity and sexism with rappers such as Mos Def, Fat Joe, Chuck D, Jadakiss, and Busta Rhymes, hip-hop mogul Russell Simmons, and cultural commentators such as Michael Eric Dyson and Beverly Guy-Shetfall. Critically acclaimed for its fearless engagement with issues of race, gender violence, and the corporate exploitation of youth culture.",
         "Hip-Hop: Beyond Beats & Rhymes provides a riveting examination of manhood, sexism, and homophobia in hip-hop culture."
      ],
      "budget": 0
   },
   "movielensId": 157879,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-01-01",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 61,
      "movieId": 157879,
      "title": "Hip-Hop: Beyond Beats & Rhymes",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0976039",
      "originalTitle": "Hip-Hop: Beyond Beats & Rhymes",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 14263,
      "avgRating": 4,
      "releaseYear": "2006",
      "numRatings": 1,
      "posterPath": "/5HIeGyNGdzC0oEsaMmWmigHoDHL.jpg"
   }
}