{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0810970",
      "video": false,
      "title": "Everything's Cool",
      "recommendations": [],
      "backdrop_path": "/9zje9bA21EQuY9MHcGWCl2coApS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5a0a7798925141310f010233",
               "name": "Judith Helfand",
               "profile_path": null,
               "id": 1062364,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a0a77a6c3a368213800e5b2",
               "name": "Daniel B. Gold",
               "profile_path": null,
               "id": 944538,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.00423,
      "production_countries": [],
      "id": 36863,
      "vote_count": 0,
      "budget": 0,
      "overview": "In this documentary, filmmakers Daniel B. Gold and Judith Helfand (Blue Vinyl) follow a troupe of self-proclaimed global warming \"warriors\" on a mission to get the world to care about rising temperatures and melting polar ice caps. Taking a topic that's inherently serious and applying their signature blend of humor and emotional heft, Gold and Helfand advance the environmental dialogue in a surprisingly entertaining way.",
      "similar": [
         3134,
         948,
         8810,
         281,
         298312,
         11564,
         133805,
         2142,
         1359,
         141,
         185,
         10285,
         431,
         101,
         205,
         681,
         949,
         12162,
         23483,
         8923
      ],
      "original_title": "Everything's Cool",
      "runtime": 89,
      "poster_path": "/3Au8x9Yq1W9dssEFQBKPDacvSOz.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2007-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Daniel B. Gold",
         "Judith Helfand"
      ],
      "runtime": 89,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0810970/",
      "coverLink": null,
      "actors": [
         "Daniel B. Gold",
         "Ross Gelbspan",
         "Bill McKibben"
      ],
      "reviews": [
         "Everything's Cool was screened this week at the SXSW Film Festival in Austin, TX. Whereas Inconvenient Truth is a film about the science of global climate change, Everything's Cool is really a study of the artificial political debate about the issue of global climate change. The film provides a compelling historical review of the 20 years of debate around this issue through the eyes of a number of key political activists who have been on the front lines. The film was made over the last several years as a new political consensus (shaped by Hurricane Katrina and Al Gore's film) finally seemed to be forming. The most interesting aspect of the film is the examination of how a small group of think tanks - funded by the oil and coal industries - have created a political debate about global climate change even though the scientific consensus has been quite clear for some time. The film shows how ideology can be used as a tool to warp science and how the media can easily be manipulated into presenting \"both\" sides of a scientific debate. There are many parallels between the story told in this film and the other political discourses such as the \"debate\" between evolution vs. Intelligent Design. Everything's Cool is humorous and entertaining film, but perhaps a bit too long. The film would benefit from some additional editing to create a more concise and crisper presentation of the issue. The film could easily be adopted for use in Political Science classes.",
         "Everything's Cool presented interesting facts about the politics behind the global warming - scientists who have been silenced by the US government, climate change reports edited to look much less threatening, whistle-blowers who resigned from government position. As a movie, Everything's Cool fails in numerous aspects. One that particularly annoyed me was the completely off-topic focus on Dr. Heidi Cullen's adaptation to the TV show world - who cares about that? The plot left an overall impression of a scatterbrained director, distractingly jumping from one issue (a global warming campaign truck) to another (Dr. Cullen's training for the camera) to another (a bunch of Utah guys making biodiesel in a garage) to another (whistle-blowers), without much transition. An another reviewer mentioned, the movie was unnecessarily long. Dr Cullen aside, biodiesel is just one of the plethora of solutions for reducing emission, hence somewhat beyond the scope of the movie.",
         "There were a lot of good documentaries last year: White Light/Black Rain: The Destruction of Hiroshima and Nagasaki, Ghosts of Abu Ghraib, and many I haven't yet seen. Add this one to the list. This is not the story of global warming, but the story of the efforts of scientist to get the story out over the last 20 years, fighting the oil and coal interests, and the Bush administration, all of whom are afraid they will lose their cushy lifestyle when the truth finally dawns on the American people. It took Hurricane Katrina to wake America up to the fact that something is wrong, and now they are listening. Is it too late? That is only touched on in this film, but it is there for you to think about. This was a funny, sometimes cute, and very entertaining film that tackled a subject that few Americans were aware of - how the Bush administration and Fox news covered up the truth about global warming.",
         "Everything's Cool is a documentary that examines the divide between scientists and the general populace on the topic of global warming.It also looks at how activists used the big-budget sci-fi film The Day After Tomorrow as a springboard to push global warming into public consciousness. Global warming has been the most significant environmental issue to come to the public's attention in the final quarter of the Twentieth Century. But while most people know what global warming is, convincing folks that it's a real and present danger has been a difficult task, especially since a number of Republican political leaders and leading figures in multi-national business have used their power and influence to question the facts behind the issue, or dismiss scientific evidence as tree- hugging hysteria. The grassroots efforts of environmental activists to spread the word about the very real dangers of this looming crisis.They are are chronicled from a wide variety of concerned people working to shift public opinion, from author Ross Gelbspan and former Vice President Al Gore to ordinary citizens who use chat at work and in elevators to spread the message. This is a toxic comedy about the most dangerous chasm ever to emerge between scientific understanding and political action - Global Warming. While industry-funded naysayers sing their swan song of scientific doubt and deception, a group of self-appointed global warming messengers are on a life-or-death quest to help the public go from understanding the urgency of the problem to creating the political will necessary to push for a new energy economy.It gives us a full understanding as why some deny this crisis and why others contend that this crisis fully exists.It is very well done, very entertaining, informative, and will provide ideas and inspiration for all sorts of constructive engagement on this issue.",
         "I have always been a big fan for discussion about global warming, so liking this film just comes naturally for me. I read books, I attend gatherings, I discuss with my friends, and surf the Internet to gain for knowledge and understanding about global warming; what causes it, the damages it could bring, and ways to tackle the issue. This film is about global warming, in the political perspective. It doesn't talk about how to tackle the issue (carpooling, change to alternative energy, for example) but rather talk about how the people who support the issue and those who brush aside the issue as nothing more than just a facade. It shows how people with agenda (i.e energy providers) brush aside the issue and said that global warming is a non-issue. It also portrays how media protracts the issues, either incline towards supporting the issue, or against it. It also includes interviews with media practitioners, scientists, politicians and people from all walks of life about global warming. A good watch to gain more knowledge about global warming (minus the jargon and complicated scientific terminologies)."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Toxic Comedy Pictures",
         "Lupine Films",
         "Kendeda Sustainability Fund"
      ],
      "summaries": ["For the past two decades researchers, activists, scientists, and progressive politicians have struggled to rouse the public and the federal government to take action on global warming. Concurrently, naysayers, industry funded think-tanks and lobbyists have worked tirelessly to challenge, convolute and dismiss the issue as hysterical. Everything's Cool tells the harrowing story of what it takes to talk about global warming -- the art of duking it out with collective denial, the struggle to communicate the urgency of the crisis to an indifferent public and a laggard United States government. We follow a cadre of messengers who are passionate, exasperated, driven by fear, hope and a deep appreciation for the ever shrinking window of time we have to stop global warming. THE STORY AS IT IS EVOLVING We take to the road with veteran global warming messenger and author Ross Gelbspan, as he launches \"Boling Point\" -- his \"last\" and \"final\" book on the issue. We are behind the scenes at the Weather Channel for the education of Dr. Heidi Cullen, a climatologist cum television personality, who has the unique and often excruciating task of reporting and/explaining climate change in sound-bites fit for a primetime audience. We film a group of citizen-activists -- ages 18 to 80 - training for their inevitable \"elevator speech\" - their chance to tell the right story to the right audience at the right time and rouse the sleeping country. They are the Paul Reveres of the next energy revolution. Meanwhile the national NGOs, who have been working on the crisis of global warming for the past two decades -- including National Resources Defense Council, Greenpeace, Environmental Defense, - along with Moveon.org pin their oft-dashed messaging hopes on a summer Hollywood blockbuster. \"The Day After Tomorrow\" does what they've never been able to do. It fictionalizes every difficult aspect of global warming into a nightmarish, but undeniably compelling message. The impacts are severe and immediate, the rich countries are devastated, the skeptics, the delayers and the recalcitrant feds are taught their lessons, and it all happens in the time-span of a long weekend. For a moment it seems to be working- newspapers have cover stories, news programs devote entire segments to global warming -- the issue is finally in play! Activists, scientists even former VP Al Gore are in almost all the press coverage speaking right on message: \"this might be over the top and science fiction, but global warming is real and happening now.\" But our collective attention span is short. Spiderman 2 and Fahrenheit 911 soon push The Day After Tomorrow out of the theaters. The public discourse moves on leaving the issue profile of global warming essentially unchanged and mired near the very bottom of the issue heap coming into the election of 2004. Now what?"],
      "budget": 0
   },
   "movielensId": 157893,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Judith Helfand",
         "Daniel B. Gold"
      ],
      "runtime": 89,
      "movieId": 157893,
      "title": "Everything's Cool",
      "mpaa": "NR",
      "actors": [""],
      "imdbMovieId": "0810970",
      "originalTitle": "Everything's Cool",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "In this documentary, filmmakers Daniel B. Gold and Judith Helfand (Blue Vinyl) follow a troupe of self-proclaimed global warming \"warriors\" on a mission to get the world to care about rising temperatures and melting polar ice caps. Taking a topic that's inherently serious and applying their signature blend of humor and emotional heft, Gold and Helfand advance the environmental dialogue in a surprisingly entertaining way.",
      "tmdbMovieId": 36863,
      "avgRating": 4.25,
      "releaseYear": "2007",
      "numRatings": 2,
      "posterPath": "/3Au8x9Yq1W9dssEFQBKPDacvSOz.jpg"
   }
}