{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0088740",
      "video": false,
      "title": "Artie Shaw: Time Is All You've Got",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4b4dc3a36847f81fd17b",
            "name": "Brigitte Berman",
            "profile_path": null,
            "id": 237943,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 8.0E-6,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 114521,
      "vote_count": 0,
      "budget": 0,
      "overview": "This in-depth examination of the life and career of clarinetist and bandleader Artie Shaw cuts between archival footage, location shots, and an interview with Shaw himself. Berman illustrates the tumultuous, complicated, and remarkable legacy of a man who brought numerous innovations to jazz and swing music during the big-band era.",
      "similar": [],
      "original_title": "Artie Shaw: Time Is All You've Got",
      "runtime": 114,
      "poster_path": "/aBX6M0oe3eZl7KmZOpbYhc2f90r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brigitte Berman"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Brigitte Berman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088740/",
      "coverLink": null,
      "actors": [
         "Artie Shaw",
         "John Best",
         "Lee Castle"
      ],
      "reviews": [
         "Artie Shaw's legacy, his music, is the prime focus of this affectionate documentary. It's an impressive legacy by one of the true kings of Swing - a string of dynamic recordings that could not have come about without a strong personality at the helm. The various dramas, romantic and otherwise, in his life are mentioned in this film but not dwelt upon. But Berman's coup is engaging the services of the man himself, 75 and sharp as a tack, for some truly brilliant interview material. As a clarinetist, Shaw's inventiveness was undeniably the stuff of genius. In one unforgettable segment in this film, Artie puts stylus to vinyl and we watch him as he listens to his own 1937 recording of \"The Blues\", a live recording with the Paul Whiteman Orchestra which saw Artie faultlessly ad lib his way through a piece he hadn't had the opportunity to rehearse. Almost 50 years later he knows every note he played. This is a great piece of film-making which is crying out for a DVD release.",
         "I must admit my surprise at being outdone by my fellow Aussie Peter Blight on the first review of this film having recorded it on Pay TV two years ago. I have been a bit slack on my follow up on IMDb. I totally agree with Peter's comments, I couldn't have expressed my own remarks better. What a great review on his part, deservedly getting top marks accordingly. I have a special link to Artie Shaw through my late father, who was a professional Clarinet and Saxophone Player of the 1930 - 40's' and personally met Artie himself, when he toured with his U.S. Navy Band in the Pacific theater during World War 2. He arrived in Brisbane in mid October 1943, to entertain U.S. troops at Camp Moorooka Primary School a recreational facility for these G.I.'s at that time Artie gave my father one of his I.D. Cards in U.S. Navy uniform as a pass to attend this concert, which my father did, and I still have that card in my possession to this day. Artie Shaw was a genius of the clarinet with a unique style of playing not equaled by his other competitors like Benny Goodman, Jimmy Dorsey and Woody Hermann who I would never criticize,- they were entitled to their interpretations of jazz and also played great during the swing band era. Artie's story is one of a self confessed, difficult compulsive perfectionist musician who felt he could not achieve his ultimate dream with his beloved clarinet and gave the music business away in 1954 when he said he could not do better. He married eight times,including actresses Lana Turner, Ava Gardner and Evelyn Keyes - quite understandably, a very striking good looking man. He then turned to writing, including his autobiography,\" The Trouble with Cinderella\", well worth reading, and also his great passion for fishing. I had the great privilege of acquiring some of his fine clothing from his Estate (which fits me perfectly) plus other great souvenirs. Vale Artie - you were the greatest, and departed this world aged 94 leaving us a legacy of some of the finest jazz clarinet music of all time along with a great succession of superb Swing Bands and magnificent players- Billy Butterfield, Roy Eldridge, \"Hot Lips\" Page and Buddy Rich and singers like Billie Holliday, Helen Forrest,and Mel. Torme and his Meltones. I agree that a DVD release on the documentary of this great artist is an absolute necessity.",
         "I'm hoping the producers can shed some light on when litigation with the Shaw estate may be close to an end, so that the world can enjoy this film, myself included. I was living and working in Ventura, California when this was shot. I'm a drummer, and was working with the Very Special Jazz Band, the group responsible for producing an Artie Shaw \"Celebration\" concert shortly before the release of this documentary. Artie came out of retirement, came up to Ventura and rehearsed the band for an entire afternoon, while the production crew captured it all. I doubt if anyone who participated got the opportunity to see this before it got tied up in the courts. With Artie no longer with us, I was hoping for a quick resolution. Sincerely, Rick Horne",
         "According to my memory, Artie Shaw was pleased to give Ms. Berman a break when accepting to build with her a two-hours rendition of his long life but regretfully short carrier (he hanged up his clarinet in 1954, and I missed his New Year appearance at the Toronto Colonial Tavern). I know a jazz fan from Ottawa who spends frequently winter vacations in former Shaw's property at Begur, Spain. The pity with Artie Shaw is that he always wanted to be an intellectual, as he puts it in THE TROUBLE WITH Cinderella: while playing with his band in a crowded dancing auditorium, with dancers disturbing him to the point of almost swallowing his instrument, one of them fell into the orchestra pit and Artie Shaw quipped: \"there goes another Booth, John Wilkes Booth!\"!not realizing that in the audience, there were hardly two couples who realized that he was referring to Lincoln's assassin, who also fell in the orchestra pit while trying to escape from the fatal theater. After his death, I wrote an obituary in a French magazine, from which I am copying the end: \" The souvenir of Artie Shaw, uncrowned king of the clarinet, is still remaining among all the generations of his long life (94 years),thanks to his immortal success (spelled by him $ucce$$):Begin the Beguine,Frenesi and Lady Be Good, described by an Italian jazz critic \"here we are breathing pure Basian atmosphere, with full lungs\". Harry Carasso, Paris, France"
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": ["Bridge Film Productions"],
      "summaries": [
         "Biography of clarinetist and bandleader Artie Shaw, one of the principal figures of the big band/jazz era of the late 1930s and 1940s. He discusses his constant need to seek new challenges, which led to numerous retirements and career changes including his foray into writing, which had long been his primary intention. He speaks about his difficulty in reconciling his fans' popular expectations with his personal, more esoteric musical ambitions. His many years of retreat from public life are also discussed, as well as his notorious series of unsuccessful marriages.",
         "This documentary tells the story of Artie Shaw, legendary jazz clarinetist, with interviews of the 75-year-old about his life. Born in 1910 in New York City, Shaw leaves home to tour as a musician at the age of 16 and slowly rises to national prominence, becoming as famous for his eight marriages as for his musical skill, which earns him comparisons to Benny Goodman. Shaw discusses his musical and cinematic career, his retirement in 1954 and his many interests, from writing to fishing.",
         "Documentary cataloging the life and music of the band leader and clarinetist, Artie Shaw."
      ],
      "budget": 250000
   },
   "movielensId": 157873,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-01-01",
      "dvdReleaseDate": null,
      "directors": ["Brigitte Berman"],
      "runtime": 114,
      "movieId": 157873,
      "title": "Artie Shaw: Time Is All You've Got",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0088740",
      "originalTitle": "Artie Shaw: Time Is All You've Got",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "This in-depth examination of the life and career of clarinetist and bandleader Artie Shaw cuts between archival footage, location shots, and an interview with Shaw himself. Berman illustrates the tumultuous, complicated, and remarkable legacy of a man who brought numerous innovations to jazz and swing music during the big-band era.",
      "tmdbMovieId": 114521,
      "avgRating": 4,
      "releaseYear": "1986",
      "numRatings": 3,
      "posterPath": "/aBX6M0oe3eZl7KmZOpbYhc2f90r.jpg"
   }
}