{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0083257",
      "video": false,
      "title": "Strange Affair",
      "recommendations": [
         78376,
         66957,
         88309,
         51244,
         60760,
         4898,
         134625,
         86727,
         104349,
         114863,
         77418,
         42818
      ],
      "backdrop_path": "/krO9vwY2whYs2YRmWN36ZHyoxk2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Louis Coline",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b2d",
               "name": "Gérard Lanvin",
               "profile_path": "/qK3YBWuTC0CuXL0wmRo7Zhcz8tJ.jpg",
               "id": 70165,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Bertrand Malair",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b31",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Yvette, la grand-mère de Louis",
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b35",
               "name": "Madeleine Cheminat",
               "profile_path": null,
               "id": 71995,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "François Lingre",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b39",
               "name": "Jean-Pierre Kalfon",
               "profile_path": "/70bQNgL8PAhTybJp6QfjsmGwvVR.jpg",
               "id": 16350,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Gérard Doutre",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b3d",
               "name": "Pierre Michaël",
               "profile_path": null,
               "id": 24940,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "le père de Nina",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b41",
               "name": "Victor Garrivier",
               "profile_path": "/1LYAkl3vR7eMjh2drBNjD8XVTwr.jpg",
               "id": 24383,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "la mère de Nina",
               "gender": 1,
               "credit_id": "52fe44d69251416c75042b45",
               "name": "Dominique Blanchar",
               "profile_path": "/y2HdZG6BMpNk1yosiTw7aP9AXmy.jpg",
               "id": 38243,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Véronique",
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b49",
               "name": "Kathy Kriegel",
               "profile_path": null,
               "id": 24470,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Paul Belais",
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b4d",
               "name": "Jean-François Balmer",
               "profile_path": "/cNPMUPwVrKHp6AMuH8DuutZ6WUV.jpg",
               "id": 35527,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Nina Coline",
               "gender": 1,
               "credit_id": "52fe44d69251416c75042b51",
               "name": "Nathalie Baye",
               "profile_path": "/1oDCTomK09eXEZwMTniNNciH7zp.jpg",
               "id": 136761,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b05",
               "name": "Pierre Granier-Deferre",
               "profile_path": "/eDLmU2QhLHYeHBw6YdhmwgjAsuO.jpg",
               "id": 32096,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b0b",
               "name": "Pierre Granier-Deferre",
               "profile_path": "/eDLmU2QhLHYeHBw6YdhmwgjAsuO.jpg",
               "id": 32096,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b11",
               "name": "Christopher Frank",
               "profile_path": null,
               "id": 32083,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d69251416c75042b17",
               "name": "Étienne Becker",
               "profile_path": null,
               "id": 24854,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b1d",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b23",
               "name": "Dominique Besnehard",
               "profile_path": "/5e23OLMMdVM4PSi9EPJmXcgQUYf.jpg",
               "id": 21680,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d69251416c75042b29",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.447243,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 12266,
      "vote_count": 5,
      "budget": 0,
      "overview": "A young Parisian advertising executive becomes so captivated by the unsettling charm of his mysterious new employer that he eventually abandons his family and friends, viewing it a privilege to let the ubiquitous employer take over his home, his life, his desire. Only his wife remains suspicious, recognizing both the pathos and the evil in the man’s soul-stealing power.",
      "similar": [],
      "original_title": "Une étrange affaire",
      "runtime": 105,
      "poster_path": "/8VSxwdsJzbFZSE67nrwSdIbrfJf.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1981-12-23",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pierre Granier-Deferre"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Christopher Frank",
         "Pierre Granier-Deferre"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0083257/",
      "coverLink": null,
      "actors": [
         "Michel Piccoli",
         "Gérard Lanvin",
         "Nathalie Baye"
      ],
      "reviews": [
         "\"Une étrange affaire\" is Pierre Granier-Deferre's magnum opus,where he goes for broke and proves he can be brilliant.He made another important work at the beginning of the seventies \"le chat\" but it owed a great deal to its stars Gabin and Signoret.Here,there's a veteran, Michel Piccoli,and Gérard Lanvin,a generally unambitious actor,finds his best part.But it does not explain everything:the screenplay is very well constructed,the atmosphere stifling and the hero seems to be caught in a giant cobweb. First part depicts the fears of the employees of a department store :a new boss is about to arrive and some skivers are in a cold sweat about it.All rings true,and the whole cast is really excellent. Enter the new boss,Piccoli,who will not be the one everyone expected:he's a bon vivant and he treats Gérard ,the hero, as a friend.He takes him to chic places,where the young man feels like a bull in a china shop,he gives him responsibilities and promotion is around the corner. When the future seems brighter than ever ,it's actually the beginning of the end:his wife ,Nina (a lucid sensitive Natalie Baye) ,has cleverly noticed something was wrong:actually the boss and his beaming but disturbing henchman (Jean-Pierre Kalfon) are making her husband their thing,a slave at their beck and call.They even look into his private life ,and one night,the boss even requisitions the apartment and the couple's bedroom .\"You do not exist anymore\" says the wife as tragedy is impending. The boss 's method is some kind of professional fascism,which destroys all that makes a man a human being.It's all the more terrifying as the Master is always friendly,joking,smiling and even fascinating.The conclusion ,which refuses the happy end will give you the jitters. A strange affair indeed.highly recommended.",
         "This film is shy, one of those you'll fall over on a sleepless night, on an obscure TV station. And you'll find yourself attracted by its awkward mood and characters (check Jean Pierre Kalfon's performance, amazing here). Truth is, \"une étrange affaire\" is an \"étrange\" masterpiece, and I'm not ashamed to say it could have been a Kubrick film in the way it depicts extremely accurately the relationship between a king and his court, and the behaviour of mind bent court followers and how this relationship can work today, in a democracy. Piccoli is at his best, so are Balmer and Kalfon (two very under used and rated french actors) and this is probably Lanvin's best flick (that's if you're a fan of the guy). The film is cruel, and shows how easily a man can get his mind twisted, be it by a ceo or out of a \"big company\" context, anyone standing on any upper level and how weak and cheap the ways to use are. On that sleepless night, try to stay awake, you won't regret it, even at 4.00 AM.",
         "An affair less strange than ominous. Upon confrontation with his new boss, whom he has awaited fearfully because of announcements of his rigor, a small employee gratefully accepts the role as a humble servant without realizing that his whole life is slowly transformed into a sort of \"free slavery\". He is so eager to participate in the system that he ceases to question any of the strange encounters he has with the boss and his obedient followers. His own life stops and is replace by his position as a puppet. In the end, when everything is gone, he is still incapable of refilling the gaps. A striking study on accommodation and the loss of self.",
         "Delving into French cinema of 1981,I decided to start investigating the more \"obscure\" offerings from the year. Getting to a page with hardly any reviews for French flicks from '81,I was happy to locate an off-beat sounding Drama with great IMDb reviews,which led to me finding out how strange this affair could get. The plot: While the advertising business has serious money issues, Louis Coline continues to show dedication to working at the business,with the only breaks Coline takes being to embrace his wife Nina. Fearing their business is about to go bust,the owners send Bertrand Malair in as a new manager. Caught up in Malair taking a highly active role,Coline finds himself losing all interest out of work,and developing a strange love affair for Malair's working method's. View on the film: Leaving his mark on every office desk, Michel Piccoli gives a fantastic, unsettling charismatic performance as Malair. Becoming the centre of attention with his relaxed manner and wide smile,Piccoli cleverly hints at something \"off\" at the sides of Malair,which steps into an obsessive fascism,where Malair kills all that Coline has in the outside world,in order to make him a box- ticking worker. Obeying Malair's orders, Gérard Lanvin gives a wonderful, uncomfortable in his own skin performance as Louis Coline,who is given a meek appearance by Lanvin,which gets completely crushed. Going to the office with Jean-Marc Roberts book,the screenplay by co-writer/(with Roberts and Christopher Frank) director Pierre Granier-Deferre mercilessly strike at the still relevant office culture,from the guys trying to impress the boss on a night out,to Malair's new working methods turning the staff into soulless robots.Picking Coline out of the pack,the writers brilliantly make Malair's dominance in Coline's life gradually get a vice-like grip,shutting out outsiders from Coline. Clearing out the desks,director Deferre & cinematographer Étienne \"son of Jacques\" Becker cover the film in a musky atmosphere, giving tight rows in the office an isolating texture. Choking Malair and Coline's relationship into darkness,Deferre closes in with tightly held shots unveiling Malair's growing dominance in Coline's strange affair.",
         "What if a man doesn't fit the role of being the centre of his loving wife's life but jumps instead to the opportunity of getting invaded and absorbed by his new boss who expects from him and two colleagues that they constitute a team without borders of privacy like one body and the boss as the ruling head?",
         "Set in Paris, a lackadaisical advertising executive, content with his domestic situation with his loving wife, has his life turned upside down when a new ultra-controlling manager takes over the company he works for. The new man begins to intrude upon his life and dominate him, moving his work-life balance into the red. It begins with excessive overtime and gofering, and before long he lets the manager move himself into his house, where he takes no time in the slightest to begin cooking his food, sleeping in his bed and wandering around naked. Needless to say, his domestic life takes a nose-dive as his professional life moves upwards. This unusual French satirical drama is about a man caught in a trap. A man who loses his personality and quality of life in his pursuit of keeping his boss happy as he eyes his career at the total expense of everything else. It suggests that it is dangerously easy to be manipulated and fall over the precipice when authority deems it the way ahead. I think it is a criticism of capitalist thinking and the abuse of power. Michel Piccoli has a lot of fun here as the overbearing boss, in a larger than life performance of passive aggressive manipulation. Also very good was Jean-Pierre Kalfon as his relentless side-kick François. It's overall an interesting and slightly left-of-centre psychological drama.",
         "Louis Coline tries to keep up with his demanding wife and an equally demanding boss. They both want something else of him. How to cope with this? I liked the theme of how work can have an immense influence on your life. Louis is under pressure and we see him trying to cope with it. How would you respond when at midnight your boss (Michel Piccoli) and his aid (Jean-Pierre Kalfon) are on your doorstep and seconds later they are in your kitchen baking an egg? Shaving naked in your bathroom the next morning? And your wife wants to leave in her nightgown in the middle of the night? I did not enjoy the film thoroughly, unfortunately. I waited for the magic to happen but it never came. The reason is, I guess, that I found the film just too regular. A regular story about a regular guy, living with other regular people, in a style of filming that is equally regular. It was visually not very enticing. I am not familiar with the work of Pierre Granier-Deferre, but my guess is it shall be mostly slow and observing. I wouldn't go as far as calling the film bad. It is a solid production after all. It also boasts a couple of decent actors, Gerard Lanvin in his early years being surprisingly sensitive; Nathalie Baye as his wife; and Michel Piccoli as his boss. But it was actually only Jean-Pierre Kalfon who was outstanding (he would've fitted greatly in The Wolf of Wall Street). On the other hand this observing style works fine when you watch the film as some sort of time machine, to have an honest view of life in 1981 (and not the punky kitsch version of these years the media has invented). As how it was for probably most people: working, family, eating, sleeping. Not as different as life nowadays."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Films A2",
         "Sara Films"
      ],
      "summaries": ["Louis Coline assists the head of advertising of a department store in decline. He has little to do, but seems content with his marriage to Nina, his visits to his mother and grandmother, and poker games with friends. When new boss Bernard Malair arrives to turn the store around, Louis fears for his job; but Bernard, with his numbers man Paul and his factotum François, invites Louis into an inner circle of long hours of work, nightclubs, and dinners with an androgynous vamp. Nina objects, but Louis cannot say no to Bernard's demands, no matter how personal. In desperation, Nina leaves Louis, but that drives him further into Bernard's orbit. Can anything break this spell?"],
      "budget": 0
   },
   "movielensId": 157937,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1981-12-23",
      "dvdReleaseDate": null,
      "directors": ["Pierre Granier-Deferre"],
      "runtime": 105,
      "movieId": 157937,
      "title": "Strange Affair",
      "mpaa": "",
      "actors": [
         "Gérard Lanvin",
         "Michel Piccoli",
         "Madeleine Cheminat",
         "Jean-Pierre Kalfon",
         "Pierre Michaël",
         "Victor Garrivier",
         "Dominique Blanchar",
         "Kathy Kriegel",
         "Jean-François Balmer",
         "Nathalie Baye"
      ],
      "imdbMovieId": "0083257",
      "originalTitle": "Une étrange affaire",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young Parisian advertising executive becomes so captivated by the unsettling charm of his mysterious new employer that he eventually abandons his family and friends, viewing it a privilege to let the ubiquitous employer take over his home, his life, his desire. Only his wife remains suspicious, recognizing both the pathos and the evil in the man’s soul-stealing power.",
      "tmdbMovieId": 12266,
      "avgRating": 2,
      "releaseYear": "1981",
      "numRatings": 1,
      "posterPath": "/8VSxwdsJzbFZSE67nrwSdIbrfJf.jpg"
   }
}