{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "undercover cop",
            "id": 11199
         },
         {
            "name": "high school student",
            "id": 33910
         },
         {
            "name": "criminal investigation",
            "id": 157241
         }
      ],
      "imdb_id": "tt0456999",
      "video": false,
      "title": "She's on Duty",
      "recommendations": [
         140785,
         64882,
         18384,
         17128
      ],
      "backdrop_path": "/59milbvqtdizoljp3jwwNfDaHCL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1004,
               "character": "Chun Jae-in, undercover cop",
               "gender": 1,
               "credit_id": "52fe48a2c3a36847f8171c67",
               "name": "Kim Sun-a",
               "profile_path": "/e2HqiEvDdqNeAgybB7ATrHiJFfs.jpg",
               "id": 83221,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Kang No-young, boy at school, Jae-in's neighbour",
               "gender": 2,
               "credit_id": "52fe48a2c3a36847f8171c59",
               "name": "Gong Yoo",
               "profile_path": "/10juj6VEULzy0PNx2h7pVhyKQrl.jpg",
               "id": 150903,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Seung-Hee, daughter of mob boss",
               "gender": 1,
               "credit_id": "52fe48a2c3a36847f8171c6b",
               "name": "Nam Sang-mi",
               "profile_path": "/eFtQ83fUV0pMsP99s7IvyBAkNr.jpg",
               "id": 87890,
               "order": 2
            },
            {
               "cast_id": 1007,
               "character": "Detective Kang",
               "gender": 0,
               "credit_id": "52fe48a2c3a36847f8171c73",
               "name": "Kim Sang-ho",
               "profile_path": "/6DKKFYu3qQFiKQLyTYnhhEBIkVO.jpg",
               "id": 123820,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Detective Chun, Jae-in's uncle and boss",
               "gender": 0,
               "credit_id": "52fe48a2c3a36847f8171c77",
               "name": "Noh Joo-hyun",
               "profile_path": "/zHlVWH7VFAnSuS143K3Nbg6HDfc.jpg",
               "id": 1286419,
               "order": 5
            },
            {
               "cast_id": 1003,
               "character": "Jo Hye-ryung",
               "gender": 1,
               "credit_id": "52fe48a2c3a36847f8171c63",
               "name": "Hong Soo-a",
               "profile_path": "/sQOxXublYwyNJHviMdncSBGv0Cr.jpg",
               "id": 1112440,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Bae Doo-Sang, mob boss of the Whacker gang",
               "gender": 2,
               "credit_id": "52fe48a2c3a36847f8171c7b",
               "name": "Oh Gwang-rok",
               "profile_path": "/xCE5k6Zr2HpLsi7PXVE2JCeTCVY.jpg",
               "id": 528339,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "So-young, girl in class who wants Jae-in's protection",
               "gender": 0,
               "credit_id": "52fe48a2c3a36847f8171c7f",
               "name": "Moon Seo-yeon",
               "profile_path": null,
               "id": 1286421,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "Class teacher",
               "gender": 2,
               "credit_id": "52fe48a2c3a36847f8171c83",
               "name": "Park Sang-myeon",
               "profile_path": "/epNd1B1lWOikK2bASquAsyEcnV8.jpg",
               "id": 87783,
               "order": 9
            },
            {
               "cast_id": 1012,
               "character": "Cha Young-Jae, second mob boss, Seung-Hee's father",
               "gender": 2,
               "credit_id": "532993349251413d860013ec",
               "name": "Kim Kap-soo",
               "profile_path": "/8lkOjoYBqPVl7kNEme008ELdoSf.jpg",
               "id": 1222431,
               "order": 10
            },
            {
               "cast_id": 1013,
               "character": "Detective Cho",
               "gender": 2,
               "credit_id": "53c7c50d0e0a267ffb00446e",
               "name": "Ha Jung-woo",
               "profile_path": "/AuN7czIq0aGmIcTqXR4V7ll2R4B.jpg",
               "id": 75913,
               "order": 11
            },
            {
               "cast_id": 1014,
               "character": "cameo",
               "gender": 2,
               "credit_id": "57edd9179251416cd800206a",
               "name": "Choi Bool-am",
               "profile_path": "/9JpWy3ENn5MHrV6xBL0TASflX6X.jpg",
               "id": 1238646,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe48a2c3a36847f8171c5f",
            "name": "Park Kwang-chun",
            "profile_path": null,
            "id": 554396,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.828042,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 54555,
      "vote_count": 12,
      "budget": 0,
      "overview": "A boisterous detective goes undercover in a high school in order to befriend the teenage daughter of a notorious gangster.",
      "similar": [
         272693,
         10314,
         10625,
         89185,
         57214,
         37725,
         2105,
         449176,
         9880,
         26123,
         308369,
         11887,
         9655,
         9377,
         2108,
         37735,
         8363,
         8193,
         4951,
         277217
      ],
      "original_title": "잠복근무",
      "runtime": 111,
      "poster_path": "/hgbavneqFF3b1pqHSBL4oFijLgM.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Showbox Entertainment",
         "id": 11420,
         "origin_country": ""
      }],
      "release_date": "2005-03-17",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lovehkfilm.com/panasia/shes_on_duty.htm",
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["K.C. Park"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Yong-ki Jeong",
         "Won-jae Lee"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt0456999/",
      "coverLink": null,
      "actors": [
         "Seon-a Kim",
         "Yoo Gong",
         "Sang-mi Nam"
      ],
      "reviews": [
         "It just amazes that people critique a film as though they were film critics and such connoisseurs. When I pay money to see a movie, it's an investment of time for me. Then the questions that arises are; was it entertaining, was I able to escape from reality, and did I feel like it was worth my money, waste of my money or just ehhh? This movie fulfills 2 out of the 3 criteria. It was entertaining and I was able to suspend my disbelief for the duration of the movie. I loved the gym teacher, I loved her commanding officer and I loved Kim Seona. I loved how this movie subtly teaches what goes around comes around. She beats up the high school bullies then the PE teacher disciplines her. I love the relationships in the movie. I won't go into much details of the movie, but it wasn't a waste of money nor was it a more than my money's worth. But if you want to watch a movie that allows you to escape for a coupla hours and be entertained, this is the movie for a nice Friday or Saturday night snuggle with the significant other.",
         "I am a huge fan of Asian cinema, and this Korean movie is worth a watch. The story of a police officer having to go undercover in a school, and no one really wonders about her age? Yeah, already there is the first laugh. The dialogue is good and funny, the scenes are well put together, and the movie works well all throughout. And the characters are well portrayed and have that sparkling on-screen chemistry going on. The lead women, Seon-a Kim does a marvelous job in her role as the undercover police woman. However, if you are unfamiliar with Asian cinema, you should know that many things in these movies are fairly extreme and out there, so you should approach this movie with the intention of being entertained and not having to think too much about what is going on. It is a movie that you will pick up again later and watch it for a second time. It has good entertainment value, and could use a sequel for sure.",
         "This movie seems more like a pilot episode for a TV-show than a regular film, although I don't know weather or not this is actually the case. The story is not that complicated and the telling of it offers no surprises. The actors generally do a good job, but the only one who stands out is Kong Yu as Kang No-Young who was thankfully given a more understated roll than the leading actress Kim Seon-a (as Chun Jae-in). Perhaps it is simply the contrast of his character against the rest of the film, but something about him caught attention (and I'm not talking about his good looks, although there certainly is no lack of that either) and held it in every scene. Given the chance I would definitely watch him in another movie. This is a movie to watch when you are in the mood for something light and easily chewed, and you really, really don't feel too analytical or criticizing... It does have some darker sides to it, but nothing that will spoil the general cheerfulness. If this came on TV (fat chance... *SIGH*) I'd watch it again, but I wouldn't spend money on it - nor would I recommend anyone else to do so.",
         "Personally, I enjoyed this movie immensely because Kim Sun Ah (main actress) plays a character very similar to the character she recently played in an outstanding TV Drama/Comedy \"My Name is Kim Sam Soon\". I watched this movie about two weeks after the series MNIKSS had ended, and personally, the movie was very special. The movie itself, however, is full of clichés from both Korean and American action comedy films. The storyline is too weak, some parts of the movie had definitive plot holes, and... there really wasn't anything impressive about it. Kim Sun Ah once again manages to portray a very unique and lovable character (though how she pulled that off is still a mystery to me, considering the average~weak script that she was given), and Nam Sang Mi also plays her role very well. Kong Yu I was not convinced, and to put it simply, there were way too many actors/actresses playing comical, cartoon-like characters (the bullies, the gang boss, the gang members, Jae-In's friends, the teacher, the detective (Jae-In's partner) and, at times, even Jae-In (Kim Sun Ah's character) herself) This is a good movie to burn time on, because it is certainly funny. Perhaps I'm being too harsh on a movie that only wants to be a laugh-off action comedy. It achieves what it wants to achieve, and in that respect, She's On Duty is a great film. But using a more generalized criteria... 5/10",
         "This is a light-hearted cop comedy about a young female policewoman who reluctantly goes undercover in a high school. Her assignment is to get close to the daughter of the second in command of the \"Whacker\", the biggest crime syndicate in Seoul. Actress Seon-a Kim is wonderful as Detective Chun Jae-in. She has the kind of plastic face and flexible body that can perfectly convey comedy in a physical way, a useful asset in a foreign language film where words and phrases often don't translate well. It's interesting to note that she is roughly ten years older than Sang-mi Nam, the actress who plays Seung-hee, the daughter of the crime boss. Sang-mi Nam was about 21 years old when the film was made, yet Seon-a Kim is totally believable as her peer. The film is a bit weak in the occasional action set pieces, and a lovely female gang member is woefully underutilized. Still, the movie, whose English title is \"She's On Duty\", is charming, delightful, and quite amusing. The DVD, which I picked up in New York City's Chinatown, looks great and has some decent extras: a still photo gallery, a music video, and an enjoyable video of the photo shoot for the film's posters and box art.",
         "Dressed as a schoolgirl, Detective Chun Jane, surrounded by Korean prostitutes, goes undercover to stop Hammer, a member of the Korean mafia who traffics women to the yakuza. When the yakuza arrives, Jane attacks the mafia members and almost beats up every one of them on her own. However, after Hammer is caught, the yakuza turns out to be another detective who blames Jane for destroying his plan to catch the real yakuza member. Being the spunky, hot-tempered fireplug that she is, Jane does not take these words lightly and becomes quite antagonistic towards Detective Cho. Later, the heads of the police department are trying to find the location of Cha Young-jae, Bae Doo-sang's, the leader of the suspected human trafficking scandal, right hand man. Cha had been willing to testify against him, but after an attack Cha quickly fled the scene. In order to find Cha, the head of police decides that Cha's daughter Seung-hee needs to be followed because surely her father will try to contact her. Soon afterwards, after seeing Jane still dressed in her school uniform, the head decides that Jane will attend the school as a student and keep a close eye on Seung-hee. Jane of course dislikes the idea, she is thirty and hated high school, and demands that she should be a teacher instead of a student, but her uncle, who is also her ranking officer, basically says that she is such an idiot that there is no way that she could teach a class. So, against her will, an angry, spunky woman is sent back to school. Always a bit hostile, Jane soon unleashes her fury upon a girl gang and later a group of boys hired by said girl gang. She is constantly in trouble with her P.E. teacher who seems to view her as some type of social deviant, and she has a number of misunderstandings with other girls. However, she is eventually able to find a comfortable position at the school, but when she finally accomplishes this Detective Cho goes undercover at the same school. She's on Duty is a decent film. It takes an old and tired theme and adds new life to it. This is mainly accomplished through the acting of Kim Seon-a who is probably best known for her work on the drama series My Name is Kim-sun. Kim is a spunky and very cute woman who looks twenty instead of thirty and her high energy and exaggerated movements make for an enjoyable film watching experience. However, outside of Kim's performance this film leaves a lot to be desired. There are revelations that can be seen a mile away and some scenes are quite mawkish, but overall She's on Duty is not too bad and it is at least good enough to tickle your funny bone once or twice.",
         "She's on Duty is a South Korean film about a police detective who goes undercover in a high school to befriend the daughter of an elusive gangster.It stars Kim Seon-ah, Nam Sang-mi, Gong Yoo, Kim Kap-su and Kim Sang-ho.It was written by Jeong Yong-Ki and Won-jae Lee and it was directed by Park Kwang-Chun. In the movie,Detective Chun Jae In thinks that she is about to break a huge child prostitution ring, but when she finds that she has really ruined a much higher-level undercover operation, she is embarrassed and humiliated. Despite this, an important new mission arises that requires her unique talents – i.e. her ability to dress up and convince as a school-girl. She must go undercover once again, this time in a school, under the pretense of being a new student so that she can ensure the safety of the daughter of an important Mafia witness that the police want to locate. Before long she finds her maths skills challenged, her fighting skills honed on the school bullies and her heart melted by a fellow student. It was an average film.The story is definitely far from realistic.The acting was decent.But overall,it provides great laughs and pure entertainment.Nothing more.",
         "After ruining a sting operation which might have apprehended a top-ranking South Korean criminal named \"Cha Young-jae\" (Kap-su Kim), a female detective named \"Chung Jae-in\" (Seon-a Kim) is subsequently assigned a mission in which she has to keep tabs on the criminal's daughter, \"Seung-hee\" (Sang-mi Nam). This requires her to go undercover--as a high school student. Not only that but she has to somehow make friends with Seung-hee and at the same time try to fit in. Neither of these are very easy. Now rather than reveal any more of this movie and risk spoiling it I will just say that in order for this particular type of film to work it typically has to have some really good comedy to back it up. That being said, while there is certainly some comedy here, I didn't see anything special about any of it. Even so it wasn't too bad for the most part and as a result I suppose it was worth the time spent to watch it. Accordingly, I rate it as about average. But no more and no less."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "Kcinema",
         "MBC-TV Korea",
         "Ma-in Entertainment"
      ],
      "summaries": ["The film deals with a boisterous undercover female cop who gets sent to a high school in order to get close to a criminal in hideout by befriending his teenage daughter. The general set up and the fighting antics of the female cop play close resemblance to Stephen Chow's classic Fight Back to School."],
      "budget": 0
   },
   "movielensId": 158135,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2005-03-17",
      "dvdReleaseDate": null,
      "directors": ["Park Kwang-chun"],
      "runtime": 111,
      "movieId": 158135,
      "title": "She's on Duty",
      "mpaa": "",
      "actors": [
         "Kim Sun-a",
         "Gong Yoo",
         "Nam Sang-mi",
         "Kim Sang-ho",
         "Noh Joo-hyun",
         "Hong Soo-a",
         "Oh Gwang-rok",
         "Moon Seo-yeon",
         "Park Sang-myeon",
         "Kim Kap-soo",
         "Ha Jung-woo",
         "Choi Bool-am"
      ],
      "imdbMovieId": "0456999",
      "originalTitle": "잠복근무",
      "genres": [
         "Comedy",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A boisterous detective goes undercover in a high school in order to befriend the teenage daughter of a notorious gangster.",
      "tmdbMovieId": 54555,
      "avgRating": 3.5,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/hgbavneqFF3b1pqHSBL4oFijLgM.jpg"
   }
}