{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "comedian",
            "id": 3485
         },
         {
            "name": "stand-up comedy",
            "id": 9716
         },
         {
            "name": "live comedy",
            "id": 9961
         },
         {
            "name": "dark comedy",
            "id": 10123
         }
      ],
      "imdb_id": "tt0777243",
      "video": false,
      "title": "Lisa Lampanelli: Take It Like a Man",
      "recommendations": [],
      "backdrop_path": "/oihVAPYUDOWbXxxEcVdJ69Hsbvt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "herself",
            "gender": 0,
            "credit_id": "52fe48ecc3a36847f8180d85",
            "name": "Lisa Lampanelli",
            "profile_path": "/9Vj4MKNC4rYWf0Aj8qQKYFtOTqr.jpg",
            "id": 105788,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48edc3a36847f8180d8b",
               "name": "Michael Drumm",
               "profile_path": null,
               "id": 86298,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48edc3a36847f8180d91",
               "name": "Lisa Lampanelli",
               "profile_path": "/9Vj4MKNC4rYWf0Aj8qQKYFtOTqr.jpg",
               "id": 105788,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.442031,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56100,
      "vote_count": 4,
      "budget": 0,
      "overview": "Called \"Comedy's Lovable Queen of Mean\" (New York Times) and \"Howard Stern on estrogen\" (Toronto Star), Lisa Lampanelli is the insult comic for a new generation. Now, with a onehour special airing on Comedy Central, she makes her major-label debut with that same outrageous, in-your-face performance on CD and DVD with Take It Like A Man, recorded live at The Improv in Hollywood, FL. Shocking and hilarious, no-holds-barred and politically incorrect, Lampanelli is Don Rickles with breasts and major PMS.",
      "similar": [
         200133,
         34001,
         31788,
         34497,
         416477,
         34505,
         35595,
         812,
         703,
         7516,
         49013,
         109414,
         16290,
         62206,
         270946,
         402897,
         13015,
         11412,
         14,
         275
      ],
      "original_title": "Lisa Lampanelli: Take It Like a Man",
      "runtime": 59,
      "poster_path": "/s1Agr47kv1XKGCsJgkPgY8124yk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2005-08-30",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Drumm"],
      "runtime": 59,
      "synopsis": null,
      "writers": ["Lisa Lampanelli"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0777243/",
      "coverLink": null,
      "actors": ["Lisa Lampanelli"],
      "reviews": [
         "I saw this movie on Comedy Central late one night. I have never laughed so hard in my entire life. Lisa Lampanelli is by far the funniest woman alive. I laughed non-stop at this movie. It's amazing how she can insult someone so strongly and still get laughs. You have got to see this movie before you die. However, put the children to bed because this is not a family film. I almost can't put in words how funny she is. She takes insult comedy to the next level. She makes Triumph \"the insult comic dog\" look like Wayne Brady. Lisa brings gigantic laughs in this gut-buster comedy. Very highly recommended. Definitely one of the best comedies I've seen in years. MORE LISA LAMPANELLI!!!!!!!",
         "I liked Lisa Lampanelli's contributions at various Comedy Central Roasts, so I decided to check out this show by her. Well, what can I say. It's a show built around insulting minorities, ie ethnical minorities, homosexuals and handicapped people. The whole thing isn't half as insulting as one might be lead to believe. Lampanelli always makes clear how proud she is of her audience and how much she appreciates it if someone can take a joke (a GOOD joke, as she refers to her own groaners). Besides, she makes fun of herself a lot, too. According to Lampanelli her mission is to light up the atmosphere which has been so tense in the U.S.A. since 9/11 with a bit of political incorrectness. Well, thanks for so much dedication, Lisa. May we just watch the show for what it is without that lofty excuse? What it is, is a collection of cheap dick jokes. As funny as those can be once in a while, a whole hour of that gets tiresome. What makes \"Take It Like A Man\" a bit more interesting is that Lampanelli seems to improvise half of the show. That is she picks random guys from the audience to use prepared jokes on them and she's rather good at that. So, in the end this is completely mindless comedy without any message whatsoever. It's good for a few chuckles, but there's nothing to take home from it.",
         "It could be funny. It could be really funny, but she has to overdo her sexist, racist humor to the point where it's overkill. Is that her best material? I'm no prude, saint or pervert, but she is short on the jokes and big on the insults. Her excuse is it's not racist if she pokes jokes at everybody...well it's not funny either. There is an entire world full of stupid happenings and events that can be funny aside from just people's nationalities or skin color or sexual orientation. 10 minutes is far more than enough of this humor...an hour or so is by far too much. Is the President or Vice President not doing retarded stuff any longer? Is George Bush all of a sudden a smart, generous, friendly person whit a heart of gold? Is there no events of traffic problems or confusion of sorts that can trigger some comment about daily life? Do I need to hear every 3 minutes about the size of you boyfriend's dick? Or how often you get laid or how a gay man is a fag? It's no longer funny when it's boring...and it gets boring quite easily. Comedy is not easy to do and her show is not easy to watch unless you are truly a hillbilly with little sense and respect for anybody else.",
         "she is swearing and lots of dumb people laughing her.this is not a comedy,not even a black comedy.i could resist the disgusting jokes only for 8 minutes.nobody can laugh that jokes unless he is idiot.i have doubt about Americans after this show.they gave high points for this show.if they liked it they must have problems in their mind.i can not believe that people pay for this disgusting show.it does not worth a penny..i looked its rating before getting it,but i am very disappointed.this is the worst show i have ever seen. i will be very careful while getting American comedy films/shows. do not take into account of the rating in IMDb.wait for at least 100 votes.i do not suggest seeing this show. do not see it even though it is free.do not waste your time with this.the age limit must be +18 for this silly show.if you don't have psychological problems,you can not laugh any of the jokes.",
         "The first time I saw this on Comedy Central, about a year ago, I thought it was incredibly funny. Lampanelli does have a gift for spouting out crass opinions in a deadpan style that keeps building one shock on top of another until you can't help laughing. I felt much like those in the film's audience appear, initially wanting to be offended and superior, eventually guffawing against my will. The show wasn't nearly as amusing the second time around, both because the shock of hearing uncensored bigotry on cable was gone and because of something my friend noted at the end of the first viewing: Lampanelli says that it's fun for us all to make fun of ourselves... but you'll notice she really only makes fun of minorities. Very little time is spent dissing white people -- I recall a few minutes about p.c. soccer moms and racist old white guys, the latter being just another excuse for black jokes. But, really, how could she insult whites to the same extent as blacks, Hispanics, Asians, Arabs or gays? There simply aren't equivalent stereotypes, evincing the same contempt and desire to wound, for Euro-Americans. The best she can do is to make fun of her sexually-motivated preference for dating black guys, which itself becomes an indirect degradation of black men and their supposed sexual assets. It's problematic."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Music Link Productions",
         "Parallel Entertainment"
      ],
      "summaries": ["Lisa Lampanelli is \"Comedy's Lovable Queen Of Mean.\" With her bawdy personality and all out honesty, Lisa has skewered the likes of Chevy Chase, Jeff Foxworthy, and Pamela Anderson on the Comedy Central Roasts, and appeared on \"Premium Blend\" and BET's \"Comic View.\""],
      "budget": 0
   },
   "movielensId": 158322,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-08-30",
      "dvdReleaseDate": null,
      "directors": ["Michael Drumm"],
      "runtime": 59,
      "movieId": 158322,
      "title": "Lisa Lampanelli: Take It Like a Man",
      "mpaa": "",
      "actors": ["Lisa Lampanelli"],
      "imdbMovieId": "0777243",
      "originalTitle": "Lisa Lampanelli: Take It Like a Man",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Called \"Comedy's Lovable Queen of Mean\" (New York Times) and \"Howard Stern on estrogen\" (Toronto Star), Lisa Lampanelli is the insult comic for a new generation. Now, with a onehour special airing on Comedy Central, she makes her major-label debut with that same outrageous, in-your-face performance on CD and DVD with Take It Like A Man, recorded live at The Improv in Hollywood, FL. Shocking and hilarious, no-holds-barred and politically incorrect, Lampanelli is Don Rickles with breasts and major PMS.",
      "tmdbMovieId": 56100,
      "avgRating": 4.21429,
      "releaseYear": "2005",
      "numRatings": 7,
      "posterPath": "/s1Agr47kv1XKGCsJgkPgY8124yk.jpg"
   }
}