{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "health",
            "id": 3721
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "medication",
            "id": 14784
         },
         {
            "name": "medical profession",
            "id": 40244
         }
      ],
      "imdb_id": "tt1632703",
      "video": false,
      "title": "Burzynski, the Movie",
      "recommendations": [82437],
      "backdrop_path": "/3JLl1oIj06dU1T5DAv807G424cD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1001,
            "character": "Himself",
            "gender": 0,
            "credit_id": "52fe49589251416c910aa38d",
            "name": "Stanislaw Burzynski",
            "profile_path": null,
            "id": 932502,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49579251416c910aa389",
            "name": "Eric Merola",
            "profile_path": null,
            "id": 932501,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.43126,
      "production_countries": [],
      "id": 85721,
      "vote_count": 6,
      "budget": 0,
      "overview": "Burzynski, the Movie is the story of a medical doctor and Ph.D biochemist named Dr. Stanislaw Burzynski who won the largest, and possibly the most convoluted and intriguing legal battle against the Food &amp; Drug Administration in American history.  His victorious battles with the United States government were centered around Dr. Burzynski's gene-targeted cancer medicines he discovered in the 1970's called Antineoplastons, which have currently completed Phase II FDA-supervised clinical trials in 2009 and could begin the final phase of FDA testing in 2011–barring the ability to raise the required $300 million to fund the final phase of FDA clinical trials.",
      "similar": [
         40807,
         258230,
         238615,
         9472,
         587,
         824,
         9388,
         10229,
         9428,
         1246,
         300668,
         340837,
         340666,
         222935,
         336843,
         277216,
         308369,
         4970,
         641,
         7350
      ],
      "original_title": "Burzynski, the Movie",
      "runtime": 105,
      "poster_path": "/psUcUPqtfpcP3IybmmjLh2bX49r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-10-28",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Cancer Is Serious Business",
      "adult": false,
      "homepage": "http://www.burzynskimovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Merola"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Eric Merola"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1632703/",
      "coverLink": null,
      "actors": [
         "Joe Barton",
         "Stanislaw Burzynski",
         "Rick Jaffe"
      ],
      "reviews": [
         "----Spoiler Alert---- This movie is made to promote the business of Dr. Burzynski and his untested methods for curing cancer. He charges his clients hundreds of thousands of dollars for \"Clinical Research\" methods of curing cancer. The movie is very self-serving and boring. Emotional at the beginning, but then drones on about how Dr. Burzynski is a victim of vast conspiracies. The dialog is completely one sided without any of the agencies in question ever being given a chance to speak for themselves. Imagine That. He rails against Government and \"Big Pharma\" as trying to put him out of business. But he himself pushes back hard against anyone who speaks against him. He threatens to sue anyone that publishes anything contrary to what he has to say claiming it to be libel. His representatives are known for thug tactics. Google \"Rhys Morgan\" for more on that. I Won't be surprised if this review gets deleted or never makes it to print.",
         "It would make a great story for a movie, wouldn't it? Maverick lone researcher discovers the cure for cancer, but there is a conspiracy to shut him down. The FDA, pharmaceutical companies, and the entire worldwide medical profession are all in on the conspiracy. Well, maybe a conspiracy quite that wide wouldn't really be believable in a movie. And it's certainly not believable in a \"documentary\". Seriously guys, get real. This is not a documentary in any meaningful sense of the world, it's a BS infomercial. Ask yourself this: if Burzynski really did have a cure for cancer, don't you think someone in this giant conspiracy might break ranks if they or one of their family members got cancer? A discovery of that magnitude is simply not possible to suppress for such a long time. The plain fact of the matter is that Burzynski does not have a cure for cancer. He simply charges obscene amounts of money by convincing desperate people that he can help them, but in reality he can't. A legitimate cancer researcher would publicise his discoveries through the scientific literature, not through a movie.",
         "You have only to read the hysterical reviews above to realise that this film is propaganda, and you'll probably recognise that the propaganda is designed to offset the fact that the subject of the film has failed to carry scientific opinion. In fact, he hasn't even tried to carry scientific opinion. His long list of \"publications\" is basically resume-padding; there is nothing by him in any of the high impact medical journals, and nobody appears to have reproduced the results he claims (a massive red flag, especially when you consider that tens of thousands of doctors and scientists around the world are working to find cures for cancer). There is no conspiracy to suppress Burzynski. Nobody forced him to run unethical trials, to break the low on interstate trade, nobody forces him to charge tens of thousands of dollars for clinical trials when normally they are free to patients, only he controls the inflated prices of generic drugs in his pharmacy, only he mandates that pharmacy for his patients, only he chooses to run endless trials without publishing the results for others to review and perhaps replicate or improve on. Burzynski is behaving like the worst kind of quack. This propaganda film seeks to gloss over that. It is despicable.",
         "My jaw dropped after watching this documentary. The evil and length to which the bought-and-paid-for FDA cronies in bed with big Pharma will go to stop, discredit, jail, and steal the IP of Dr. Burzynski made me want to vomit. I'm 100% certain that this is what Copernicus had to deal with when attempting to tell the world that \"no, the Sun does NOT revolve around the Earth and I can prove it.\" He was Polish too, by the way. Dr. Burzynski, since the 70s (!!!!!), has effectively found the CURE for some of the most aggressive, incurable, death-sentence cancers out there. Not only that, his treatment is non-toxic as compared to Chemo and others. This is evidenced by patient testimony and peer-reviewed results of diagnosis and post-treatment results. 1000s of patients have gone to Dr. Burzynski and many of them continue to be cured---not just in remission---CURED! I'll be honest that I had not heard of this guy before but after watching the footage---some dating back to the 80s---, Grand Jury hearings, FDA witch-hunting, and States Attorney's repeated harassment, it became patently obvious that Big Pharma and their Federal puppets were going to do anything to stop Dr. Burzynski from getting his drug to market as it would mean the end of Big Pharma's toxic anti-cancer drugs forever. Thank god HE patented it. He is the ONLY individual to have ever patented a drug individually and not as a \"Pharma\" company. You HAVE to watch this documentary at all cost. There is no sensationalism, bias, cute animation. It is all very professionally done with the majority of speaking done by former patients, colleagues, and Dr. Burzynski himself. It is all laid out for the viewer and all evidence appears in refereed medical journals so it is not quack science and can be 100% verified. You will clearly see the evil of the FDA and, in the shadows, big Pharma. Eye opening. UPDATE: 12/2/2011: Wow, look at all the negative reviews this movie is now getting. Gee, I wonder if any of these reviewers work for big Pharma / FDA and are bashing it to sway opinions and fake downrating. If so, they will fail, and epically at that. Don't buy into their garbage. It obvious the numbers for positive reviews are skewed. ALL of Burzynski's antineoplaston research is sound--after all, why else would Dr. Dvorit Samid steal his work for Élan?--and has been peer reviewed and featured in refereed medical journals. Refereed means people who are even higher up the food chain and smarter than Burzynski vetted his findings AND confirms his results. The very same doctors who diagnosed the aggressive cancers he's cured confirmed the patients were in remission or cured. The proof and truth is right there and you can view and find it for yourself and decide what's what. Do you *really* think a person like Burzynski--an MD and PhD--would have been wasting his time for nearly 40 years on research and treatment that would not be going anywhere AND been able to make a living off of it? Get real. There is nothing self-serving or infomercial about this movie. It is a complete overview or Dr. Burzynski from his beginnings to present as well as evidence that he has cured the most incurable cancers out there. Documented fact and truth. Fight the FUD machine. UPDATE 3/18/2013: So by now you might know that the second part to this documentary series has been released and contains strong evidence that is evaluated by various oncologists who go along with the *whole* antineoplaton process with their patients. Also, after 27 years of research conducted *independently* of Dr. Burzynski, a group of scientists in Kurume, Japan came tested antineoplastons and their results confirm, irrefutably, that antineoplastons do indeed work and that Burzynski has been right all along. One other famous Polish scientist (Copernicus) was also persecuted for his belief. How did his theory work out for us all? It is so blatantly obvious that all the negative reviews are intended to throw you off and dissuade you with opinion rather than fact. Should Burzynski just give his formula for Antineoplaston formulary or treatment away to anyone who wants to test it? I think not. He's got a right to keep his formula secret. It would be like asking Coke or KFC to give the secret formula\\recipe. Not going to happen and understandably so. Burzynski may not have the silver bullet to cure *all* cancers but some day he may. It's no surprise the bottom lines of multi-national corporations are being threatened and they will do *anything* to stop the revenue from being diverted away from them. The truth will out.",
         "This is more a documentary in the style of Moore or such. By far, not an infomercial. It does shows how deep the health system is corrupt by greed. You can ask yourself this question: can another system of curing cancer, would emerge under the current regime when it is so profitable ? Is there any place for innovation unless it enters the frame of the pharmaceutical industry ? Burzynski did try and found something else. But he was naive to think he could fight the good fight, with only a marginal support. How many more discoveries were toss out of the way like this ? Don't get yours hope up when it comes to medicine with nanite technologies, genetic mod or such. It is not different from the petrol industry, trying to stop any kind of new alternative. It's a very sad movie in that sens, since it's shows how flawed we are has a society.",
         "This seems to basically be, at best, a two hour infomercial for a fringe cancer clinic, and at worst, another conspiracy film about big bad pharma and propaganda for something someone is selling: in this case, another cancer cure. If you want to know about Burzynski and his treatments, it's a lot faster just to look up Burzynski Clinic wikipedia. It's a bit tricky to do an Internet search on Burzynski, since some of the results are for his clinic, and a lot of the others are sites claiming his clinic and treatment is an expensive scam. But at least wikipedia tries to cover it from a neutral point of view. Unlike this movie.",
         "This film is pure revolting filth. Nothing claimed in it is true. This parasite exploits sick and dying people, many of them children, by charging extortionate amounts of money for treatments that tap dance around the edges of the law to avoid punishment for long years of unethical behaviour. 35 years of \"clinical trials\" and not one single trial concluded and published. Nothing to show for his 'miracle cures' but the anecdotes of the gullible and a long list of his patients being admitted to real hospitals suffering the ill effects of his quackery based on theories examined and discarded by real scientists more than 50 years ago. Many of his victims cut deals with the clinic in return for their endorsement. Quite a number have sadly died in awful suffering since giving that endorsement while their families are still paying off the bill for their treatment. Two things to remember about anecdotes - 1: Real scientists don't use them, they have real, peer reviewed evidence. 2: Anecdotes are one-sided, dead people don't give testimonials.",
         "Please don't let the minority of negative reviews keep you from watching this excellent documentary. It presents a prime example of what big business will do to protect their massive wealth. The naysayers will tell you to ignore this film and instead depend on the internet to discover the facts about Burzynski and his alleged breakthrough in cancer treatment. I advise you to do both and make up your own mind. The internet should never be someones only resource in obtaining the facts about a particular subject. Anyone who believes that every bit of information found on Wikipedia is complete and the absolute truth is being very naive. There is one fact presented by the documentary that cannot be ignored. If Burzynski's cancer treatment was a scam had no validity why then did the pharmaceutical industry resort to deceptive tactics and patent infringement to steal it from him? Watch the movie, check the facts, and decide for yourself.",
         "This documentary is very well done. It contains no sensationalism or hype at all. It is a testament to the blatant corruption and criminality of the FDA and the pharmaceutical industry who have for years on end waged war against Stanislaw R. Burzynski, M.D., Ph.D. This respected doctor has with amazing results bin able to cure most types of cancer for decades now. The FDA, with the backing of the drug companies, has basically tried almost everything, short of having Dr. Burzynski killed, to hinder him from practicing medicine. And why? It's because his successes in curing cancer, without any side effects at all, will result in dwindling money flow and less power to the drug industry. This great documentary; a very important piece of investigative journalism, should be seen by everyone! It shows, once again, how criminality in big business works against the people of this world. The power structures, on our planet, are mostly criminal in nature and don't care for people at all. Evidence shows that they only care for power and money. I give this documentary the 10 it deserves. It should be seen by everyone who cares about the truth!",
         "I expect this mistreatment of any genius who discovers a cure or another form of breakthrough and is not part of any large corporation. The powers who own the U.S. government, after years of trying to jail Dr. Burzynski with no success due to lack of charges against him and numerous patients who support Burzynski, did finally succeed in literally stealing his discovery and patented it under government representative names. Even a patient from Romania, who fled his communist country, stated that even in his own country, the government would never stand between doctors and their patients. Why do they do so in America? I am not at all surprised by this information, as I have learned to expect it from our government. We have limited freedoms -- just enough to give us the illusion of real freedom. If you look at how we are forced to be slaves to the gas pumps should give us some idea. We are also blocked from patenting anything that would compete with the oil companies, because they also are co-owners of the U.S. government along with pharmaceutical companies. I believe that crimes should be murder, rape, theft, etc. A crime should never be creating a cure that competes with the powers that be. Ideas and patents are TRUE freedom and capitalism, which is something we no longer have. Our government was originally founded to be \"For the people and by the people.\" Our government has not been for us or by us in a very, very long time. It is owned by a few, and we are forced to be slaves to the owners.",
         "Watch this movie and judge for yourself! It is packed with scientific proof about this cure for cancer, and they are in phase 3 of clinical trials! You don't get this far in trials without a product that works!!! Just like in the movie Dr Burzynski is being attacked on all sides,(on this forum as well) because his discovery in the cure for cancer will destroy a billion $$$ industry. And that is very threatening for the most powerful business on the planet, big pharma! This is a must see movie for anyone interested in their health. It clearly demonstrate how the whole medical system is rigged and controlled by big pharma and the FDA. You will discover that there is a cure for cancer, that has been available for over 30 years, but we the public have been kept in the dark of this amazing discovery. A must see for anybody who has cancer, or who knows someone that has it. Your life may depend on watching this scientific based movie! All truth passes through three stages. First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident. Arthur Schopenhauer German philosopher (1788 - 1860)",
         "A must see for everyone. See how your tax money is being spent. This film shows just how hard the 1% will try to push the rest of us down. A doctor who has cured many people of cancer, and they are all prepared to stand in court and defend him and is work, has many months of his time wasted by the FDA and the Texas state medical bureaucrats, when all he wants to do is to continue saving the lives of people who have been given a death sentence by their doctors, or offered highly poisonous and super toxic drugs that destroy their bodies and even if the cancer goes away, their bodies are very unlikely to recover. Chemotherapy is expensive and largely ineffective poison, radiation is dangerous and seriously damaging to any part of the body that is exposed to it, both have been proved time after time to be significantly ineffective but billions is still moving into the pockets of the 1% because we have been given no options. This man who can help, and is a realistic option, is treated like the enemy for curing people when pharmaceuticals fail them, even shorten there life expectancy. and reduce quality of life. He won't play there game - making millions at any cost - and so they are determined to stop him and use millions of taxpayers money to do it.",
         "It is true that this documentary is based on Burzynski's side of the fence. However, he does make compelling arguments, provides multiple important witnesses, and seems to have a substantial backing from his patients. He indicates that cancer treatment is not 100% successful however, he has had significantly better results from his clinical trials then chemotherapy. Most of all, for those who don't realize how the FDA works this documentary is an eye opener. This \"quack\" has been interviewed Dr. OZ, Oprah, and many others. If he has indeed fooled us layman, I feel it's necessary to make it clear that he has fooled thousands of doctors as well. Regardless of what you believe, this documentary is worth watching.",
         "This film is absolutely amazing! It goes deeply into how corrupt the FDA and drug companies are (not to mention other government agencies). The Burzynski Clinic and Dr. B. himself are SO brilliant, caring and beyond strong for their fight in order to help people NOT have to undergo barbaric cancer treatments like chemo and radiation. Dr. B.'s created non-invasive therapies for SO many different types of cancer and the drug companies greed and the corrupt FDA are STILL trying to block wonderful therapies THAT WORK without frying your body and immune system. This film show the absolute unfathomable fight that Dr. B. went through, how his patients stood up for him, testified for him (even military personnel) and won. But then, over & over & over again, the FDA or some greedy entity came back with a B.S. reason for another lawsuit. Dr. B. fought and won over & over. Now, they're going after him again...right NOW. Catch up on what's going on in the real world of medicine and then stay tuned in order to support Dr. B. in his next fight. After watching this documentary, you'll want to!",
         "There is an important message.... This movies goes beyond the idea that there is a new \"miracle\" cancer treatment. It is about truth. Rather then simply reading reviews, positive or negative, I think this movie warrants your own judgment and critical thinking. It reveals something important... The idea that maybe, just maybe, the FDA and government does not have our back. Maybe the incentive for the FDA is to support those who support them. I would ask you to watch the movie and decide for yourself. If his treatment works or not, is not important to me. What is important is the obvious witch hunt that is happening here. Federally funded and well documented witch hunt... You and I are paying for this man to be put out of business. I am not sure I support that. I would like to see his treatment receive the proper funding and testing it deserves. Cancer is big business and healthy people aren't profitable, that is a fact. Anyway, this movie was a real eye-opener for me. Particularly since so many people in my family have died from cancer. Some of them waaayy too young. I asked myself why. I think I know. Do you?",
         "If you believe that cancer research is important and if you also affirm that a society should offer the best treatment possible to its citizens, then watch this documentary and learn of Dr Burzynski struggle. He may be the key to the biggest breakthrough in the fight against cancer yet. Unfortunately by also being the inventor and solely patent holder of this new non-toxic cancer treatment, he is now faced with a legal battle as challenging as cancer itself against the FDA, NCI and multibillion pharmaceutical companies who will not sit and tolerate any serious threat to their profits. All the negative reviews focus on the heavy amount of transcripts and medical records that are presented as a way to say it is boring yet for me it was precisely what I needed to see in order to believe that Dr Burzynski is a credible and a serious person who is indeed bringing amazing results to patients once doomed to a terrible prognosis by regular treatment methods. It is a serious documentary focusing on an important issue, there will be evidence presented to support it. In fact there is a whole website that continues to follow Dr Burzynski's struggle. Spread the word and get people to watch this documentary to form their own opinion.",
         "Why do we have to keep suffering while large corporations suppress game-changing information. Our tax dollars at work--stopping safe, effective cancer treatments so that drug companies can continue to rake in big profits while giving us dangerous chemicals with deadly side-effects. This movie should be seen by everyone! I wish the right people or person that could actually do something about this would see this and take the right steps. America used to be on the cutting edge. Instead, now, we're on the cutting room floor and the people who stand to profit the most have the scissors! We need to get back on track, America! This is a prime example of exactly what's wrong with the health-care system in the United States!",
         "I've seen and researched plenty of materials on health subjects, food, cancer, GMOs & medical history. What is being revealed on this movie about the rampant corruption in the FDA & hidden cancer cures is ONLY the TIP of the iceberg. What baffles me here is the VERY negative ratings & reviews some users have posted here. This movie while not perfect (some parts are too long in my opinion) certainly deserves a more balanced rating. So what's the agenda in slandering Dr. Burzinski, spreading lies and giving it such an unfair review in order to lower the rating? To whose benefits? FDA, big pharmas? It's been proved that corporations & governments (mostly corrupt ones like Monsanto for example) are monitoring & \"correcting\" information on public forums on the Internet by hiring posters/bloggers. Do you really believe that a multi-billion dollar industry would leave anything to chance that could ruin such a perfect \"business model\"? For the skeptics, I suggest you do further research on this. As they say : FOLLOW THE MONEY P.S. If you're serious about learning more, I recommend these movies : \"Food Inc\", \"Dying to have known\", \"Forks over knives\", \"Simply Raw, Reversing Diabetes in 30 Days\", \"The World According to Monsanto\".",
         "This is a great story in its own right, but the information it reveals is even more important. The story is of an epic battle between the 'powers that be' including the medical establishment and government bureaucrats at every level, versus a small band of committed makers of change, a battle that has lasted decades. The information revealed is an expose of a ruthless and corrupt partnership between government agencies and the cancer industry, devoted solely to protecting their interests. These sociopaths (no lesser word will do) are absolutely uninterested in the welfare of cancer patients; their only interest is their self-esteem and self preservation, a stunning example of organizations that have come to exist only for their own sakes, not for the principles upon which they were founded and chartered. The theme is courage against all odds, continuing to this day, a fight truly worth fighting. Please find or buy a copy of this documentary, for your own sake if not for the sake of the David presently fighting Goliath. You won't be sorry!",
         "Dr. Burzynski deserves a Nobel prize, and for their actions against him, in accordance with the Constitution and Laws of our nation, the leaders of the FDA deserve to be imprisoned. Once that happens, Dr. Burzynski's treatment will save millions of lives and lead mankind to a true cure for cancer. Quote me. - Amit Verma (10/26/2011) This documentary gives people a look into the life of a man who has grown up with intelligence and ethics, but has fallen victim to the Government of a country sworn to protect it's citizens. It gives you a look into the tactics used by pharmaceutical companies (the FDA), and how they use the legal system to resolve problems by way of time. Yes, after watching this, my opinion is that the FDA knows it can take years for decisions to be made if they continually use the legal system to harass and abstain people from doing things that do not benefit them. Though the intention of the FDA is not \"clearly\" defined, it can be clearly determined by a mentally challenged donkey that there has been nothing criminal in Dr. Burzynski's actions, in fact his actions have defined him as the complete opposite of a criminal in this situation. The doctor is simply a victim of the laws present during his time period and the ways they can be manipulated by way of our legal system. Unfortunately, the sad part is he is not the only victim, not by a long shot. As long as his medicine is denied support, the real victims might be me, or you.. or your grandchildren.. or their grandchildren. Simply put, the real victim is US. Now in defense of the FDA and and the Government. If they're trying to \"covertly\" work with pharmaceutical companies, the FDA, and other relevant groups in order use cancer treatment as a method of profitable population control. The benefits seen by this would be.. reducing the population of our nation over time, attempting to maintain a higher abundance of natural resources, reducing the rate of consumption of said resources, and stimulation within a steadily declining economy. If there's some minuscule chance that's why these actions were taken; I might understand, but I'd still be on Burzynski's side. This documentary made me think.. if cancer treatment is the fuel that keeps the American Medical System going.. what happens when there's a cure?",
         "This movie is both inspiring and worrisome. Inspiring because it shows clear proof that people ARE getting better results from non toxic alternative treatments. Worrisome because the dogged insistence on thickheaded-ness by the medical establishment is boggling. I mean, why can't we finally start telling the truth about alternative med for use in cancer? (I'm not naive, it's obvious why the truth is not being told - this movie only makes it crystal clear) If you haven't see it yet, I HIGHLY recommend you see these video clips (links are listed in the comments attached to this review): They are NOT about cancer. But they are very enlightening with regards to something as plain as day, yet conventional med REFUSES to acknowledge it. Namely a guy's life was saved by high dose vitamin C, yet they simply won't acknowledge they made what would have been a fatal mistake. These videos are another slant on the conventional VS alternative dilemma we are in - but free. Incredible!",
         "I have personally done quite a bit of research on the topic of health. Everything from vegan diets to studying the effects that pharmaceuticals have on the body. So its no surprise to me that the FDA and Big Pharma would attack anyone that has cured caner. Although Dr Burzynski isn't the first to be attacked for curing cancer just watch the 'Gerson Miracle'. When you really start to research people who have cured caner most of the time the FDA is right their to shut them down. I will admit this documentary doesn't show the other side of the argument enough and that would have given it more credibility. If you see this film and aren't convinced watch this short 40 min documentary called 'Hannah's Anecdote' on Youtube. Its filmed by a couple who go to Dr Burzynski's clinic and receive treatment. 'Hannah's Anecdote' just gets to the point which is does this treatment really work? Well you will have to watch it to find out!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["Ph.D biochemist, Dr. Stanislaw Burzynski, won one of the largest legal battles against the Food & Drug Administration in U.S. history. Dr. Burzynski and his patients endured a treacherous 14-year journey in order to obtain FDA-approved clinical trials for a new cancer-fighting drug. His groundbreaking medical and legal battles have brought revolutionary cancer treatment to the public. Upon completion, his treatment will be available the world over - sending a shock wave through the cancer industry."],
      "budget": 0
   },
   "movielensId": 158308,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-10-28",
      "dvdReleaseDate": null,
      "directors": ["Eric Merola"],
      "runtime": 105,
      "movieId": 158308,
      "title": "Burzynski, the Movie",
      "mpaa": "",
      "actors": ["Stanislaw Burzynski"],
      "imdbMovieId": "1632703",
      "originalTitle": "Burzynski, the Movie",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["2fBdnwooOaw"],
      "plotSummary": "Burzynski, the Movie is the story of a medical doctor and Ph.D biochemist named Dr. Stanislaw Burzynski who won the largest, and possibly the most convoluted and intriguing legal battle against the Food &amp; Drug Administration in American history.  His victorious battles with the United States government were centered around Dr. Burzynski's gene-targeted cancer medicines he discovered in the 1970's called Antineoplastons, which have currently completed Phase II FDA-supervised clinical trials in 2009 and could begin the final phase of FDA testing in 2011–barring the ability to raise the required $300 million to fund the final phase of FDA clinical trials.",
      "tmdbMovieId": 85721,
      "avgRating": 4.33333,
      "releaseYear": "2010",
      "numRatings": 3,
      "posterPath": "/psUcUPqtfpcP3IybmmjLh2bX49r.jpg"
   }
}