{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "civil rights movement ",
         "id": 5861
      }],
      "imdb_id": "tt0390981",
      "video": false,
      "title": "Citizen King",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58cd3ca6c3a36850d700ba3b",
               "name": "Taylor Branch",
               "profile_path": null,
               "id": 1654306,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58cd3cb1c3a36850fb00bd64",
               "name": "David Halberstam",
               "profile_path": null,
               "id": 238278,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58cd3cbc9251415a7400caf2",
               "name": "Andrew Young",
               "profile_path": null,
               "id": 555316,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "58cd3cc7c3a36850fb00bd76",
               "name": "Orlando Bagwell",
               "profile_path": null,
               "id": 1242341,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58cd3cd39251415a4500c9a5",
               "name": "Noland Walker",
               "profile_path": null,
               "id": 1247192,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58cd3ce19251415a4100c9c4",
               "name": "Camara Kambon",
               "profile_path": null,
               "id": 71948,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.005635,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 161463,
      "vote_count": 0,
      "budget": 0,
      "overview": "Documentary about the final five, turbulent years in the life of civil rights activist Martin Luther King. The story begins at the Lincoln Memorial in August 1963, when a 34-year-old preacher galvanized millions with his dream for an America free of racism and comes to a bloody end five years later on a motel balcony in Memphis.  King has since become a mythic figure, an activist whose works and image are more hotly contested, negotiated and sold than almost anyone else's in American history. (Storyville)",
      "similar": [
         29440,
         29720,
         9553,
         197,
         1646,
         1883,
         6106,
         11120,
         13752,
         5718,
         286550,
         20933,
         36023,
         207005,
         162494,
         15772,
         104250,
         392163,
         34836,
         4896
      ],
      "original_title": "Citizen King",
      "runtime": 120,
      "poster_path": "/taJOU9Lnl93WdD7Nn98QBT84PLG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "WGBH",
            "id": 3449,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Roja Productions Inc.",
            "id": 87952,
            "origin_country": ""
         }
      ],
      "release_date": "2004-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Orlando Bagwell",
         "Noland Walker"
      ],
      "runtime": 60,
      "synopsis": null,
      "writers": [
         "Orlando Bagwell",
         "Noland Walker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0390981/",
      "coverLink": null,
      "actors": [
         "Taylor Branch",
         "David Halberstam",
         "Martin Luther King"
      ],
      "reviews": [
         "Everyone seems to know just where they were when they heard of a few very special events...The first landing on the moon, the death of JFK, the death of Bobby Kennedy, the death of Princess Di, and this is another of them. I was touring Europe with my family and we were unpacking the car at a camp on Lido de Iesolo, the mainland beside Venice. The news over the car radio was enough for us to pause for several minutes as we digested the enormity of the event. There have been several good documentaries on TV or in the movie houses about the death of Martin Luther King. I think that this is the best one I have seen. We were lucky enough to have one of the directors to hold a Q&A session after the screening at the Auckland Int'l Film Festival this year; I asked him the question \"Did you just think of the title as an apt one or did you think of its correlation to \"Citizen Kane\" and also another movie \"Citizen Cohn\"...about Roy Cohn\"?\" The director, Nolan Walker, spoke eloquently about the correlation and said that MLK was not only a citizen of the USA but was a citizen of the world and that he tried his best to improve the world. I think the majority would agree with that. The film was very well edited, with a lot of the major players in the years prior to 1968 taking part in the movie, although Coretta did not take part. It dealt, fairly and well, with the controversial parts of King's life, such as his womanising. The packed audience was enthralled by the documentary and by Nolan Walker's eloquence afterwards.",
         "With today another celebration of the birth of Dr. Martin Luther King, I finally decided to watch the documentary made about his last five years that aired on \"American Experience\" that I taped four years ago. Following his Birmingham stint to his march in Washington, D.C. to his trips to the Johnson White House to his Nobel Peace Prize to his demonstrations in Chicago to protest poverty there to his opposition to the Vietnam War and his fallout with the President and finally to Memphis in support of the garbage strike there and his eventual assassination, we get compelling present-day testimony from many of his friends and colleagues like Andrew Young. Many news footage and home movies of Dr. King also abound to show how he presented himself publicly. While much of the current interviews still hold the reverend in high esteem, there's also some that mention his adultery and his occasional employment of Communists not to mention his not-so-cordial encounters with FBI chief J. Edgar Hoover. With all that I just mentioned, I'll just say that I highly recommend Citizen King.",
         "This documentary, aired on our local PBS affiliate, was a great account of King as a human being showing some regular journalistic footage but also some home movie-type scenes and stills that are priceless. The eyewitnesses and biographers/historians include some antagonistic folks from Birmingham & FBI-types who still have grudges and \"issues\" with this landmark American leader. It does give a variety of contemporary colleagues valuable chances to put some of the events of the years into context. I highly recommend this short film and am sharing it with many others myself. Well-deserving of a 10 * rating.",
         "One of the better, more important films on Dr. King, for being \"minor\". Let me explain. There have already been a number of first rate documentaries that focused on the amazing sweep of King's life and work. And those films (e.g. \"King A Filmed Record\u0085 From Montgomery to Memphis\") are probably better places to start for those who aren't familiar with the amazing accomplishments of this great, once in a century human being – the rare person who actually visibly changes the tide of history for the good. But what this film does that is so valuable, different and moving is, through a combination of interviews with those close to King, home movies, and footage I've certainly never seen before, along with focusing on some of the speeches and political moments that haven't been played so many times, is create a portrait of King as a man, not a saint. Vulnerable, human, able to make mistakes (his affairs are acknowledged, though not dwelt upon or over dramatized), exhausted, pulled in different directions politically. But in the very act of showing his imperfections, it makes his accomplishments all the more breathtaking, his endless dedication, and willingness to face danger and death first for his own people, and then for all oppressed and needy people everywhere all the more amazing and inspirational. If this film shows King was 'just a man', it also implies that what he accomplished is something available to all of us if we have the courage and fortitude to take up the mantle of what he fought for. It's important to see King didn't always win, that sometimes he faced situations with no good choices (as when a peaceful march he was leading started to turn violent and he 'abandoned' the march, because it would have been a betrayal of everything he stood for to be seen as being a part of the violence, even though his leaving lead to charges of being cowardly). It somehow makes the odds he really fought all his life even more clear. He wasn't a magician, he wasn't God, he was just a person who put the good of others, and his beliefs in non- violent change ahead of his own life. It's wonderful to see him laugh, to see him with his family, to hear about his personal reactions to winning the Nobel Prize for peace, his struggling with how to extend his movement from small city south to big city north, from a movement for black civil rights, to a movement to raise the lot of the poor and ill used – costing him tremendous political capitol and some popularity. This film manages to make one of our great heroes human, without diminishing one bit his heroism. And that's a lofty and worthwhile accomplishment.",
         "This episode of \"The American Experience\" covers the life of Martin Luther King from his famous March in Washington in 1963 (with his \"I had a dream\" speech) to his sad assassination in Memphis in 1968. For many, this is somewhat unfamiliar territory--especially following the rally in DC. Because it does not cover his earlier work (such as desegregating the buses in Alabama), it is a show that might not appeal to the casual viewer but to the advanced--one that wants to know more about the man other than the traditional narrative. Through the course of this film, you see many, many touching interviews as well as learn about his winning of the Nobel Prize, his family life, his push for full voting rights in Selma, his stand against the Vietnam War, his work on behalf of the striking garbage workers in Memphis and his death. Overall, this is a very good installment of this PBS series. Not only is it educational but seemed more truthful than some documentaries--talking about the greatness of the man while also admitting his deficiencies (such as his various marital infidelities). I love this--as too often biographies only give a sanitized view and make the person seem more saintly than anything else. You can STILL respect and admire a man if you present the WHOLE picture. Fascinating, well made and well worth your time."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History"
      ],
      "productionCompanies": [
         "Roja Productions Inc.",
         "WGBH"
      ],
      "summaries": ["A documentary that draws on input from a broad cross-section of people to examine to last five years of Dr. Martin Luther King, Jr.'s life."],
      "budget": 0
   },
   "movielensId": 158312,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Orlando Bagwell",
         "Noland Walker"
      ],
      "runtime": 120,
      "movieId": 158312,
      "title": "Citizen King",
      "mpaa": "",
      "actors": [
         "Taylor Branch",
         "David Halberstam",
         "Andrew Young"
      ],
      "imdbMovieId": "0390981",
      "originalTitle": "Citizen King",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about the final five, turbulent years in the life of civil rights activist Martin Luther King. The story begins at the Lincoln Memorial in August 1963, when a 34-year-old preacher galvanized millions with his dream for an America free of racism and comes to a bloody end five years later on a motel balcony in Memphis.  King has since become a mythic figure, an activist whose works and image are more hotly contested, negotiated and sold than almost anyone else's in American history. (Storyville)",
      "tmdbMovieId": 161463,
      "avgRating": 4.25,
      "releaseYear": "2004",
      "numRatings": 2,
      "posterPath": "/taJOU9Lnl93WdD7Nn98QBT84PLG.jpg"
   }
}