{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "lynching",
            "id": 157136
         }
      ],
      "imdb_id": "tt0049661",
      "video": false,
      "title": "Raw Edge",
      "recommendations": [111736],
      "backdrop_path": "/bHiFfTajqkD8EMPL5QvFJRs75Oc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Tex Kirby",
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c013",
               "name": "Rory Calhoun",
               "profile_path": "/u3cFCfaGNsUMDTV1CbXS64YZecv.jpg",
               "id": 19181,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Hannah Montgomery",
               "gender": 1,
               "credit_id": "52fe4ae2c3a368484e16c017",
               "name": "Yvonne De Carlo",
               "profile_path": "/v2aCRQusYYePhBF2fS1xsVIPr5Z.jpg",
               "id": 41240,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Paca",
               "gender": 1,
               "credit_id": "52fe4ae2c3a368484e16c01b",
               "name": "Mara Corday",
               "profile_path": "/63qDJTMIkVJPlS5huXjg9wba8Bx.jpg",
               "id": 56923,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Tarp Penny",
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c023",
               "name": "Neville Brand",
               "profile_path": "/tTLqiCL0M4ni0fhlRh8353ynbXw.jpg",
               "id": 9112,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "John Randolph",
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c01f",
               "name": "Rex Reason",
               "profile_path": "/ugN8emTAEKf5q9sT5FIuKFpTsOm.jpg",
               "id": 12353,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Pop Penny",
               "gender": 2,
               "credit_id": "593c19e2c3a3680f6700fdea",
               "name": "Emile Meyer",
               "profile_path": "/3uZJOF28nCj0WKXAJEVt7yCl2Tj.jpg",
               "id": 14579,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Gerald Montgomery",
               "gender": 2,
               "credit_id": "593c19edc3a3680f1400ec21",
               "name": "Herbert Rudley",
               "profile_path": "/myl5ccynELeb0ebAS4tgoCVTA7W.jpg",
               "id": 50573,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Sile Doty (as Robert Wilke)",
               "gender": 2,
               "credit_id": "593c19fcc3a3680ee0010c10",
               "name": "Robert J. Wilke",
               "profile_path": "/jnHaFT2LEpJHMWewNBH6w76zOoO.jpg",
               "id": 2096,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Dan Kirby (as John Gilmore)",
               "gender": 2,
               "credit_id": "593c1a08c3a3680f7b00ee8e",
               "name": "John Gavin",
               "profile_path": "/mMpkW6q6KVyzsRAkc2AObFQ5lEx.jpg",
               "id": 7304,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "McKay",
               "gender": 0,
               "credit_id": "593c1a1592514105e200f615",
               "name": "Gregg Barton",
               "profile_path": "/aG0oUpHvtTarj0Vq3JmJi0wu8lC.jpg",
               "id": 137004,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Whitey",
               "gender": 2,
               "credit_id": "593c1a21925141059b00f5d3",
               "name": "Ed Fury",
               "profile_path": "/tuGC5tc9TDR2ESPvSQae6k2okXI.jpg",
               "id": 106448,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Missionary",
               "gender": 2,
               "credit_id": "593c1a2dc3a3680f5900f216",
               "name": "William Schallert",
               "profile_path": "/orQ5760aUiWhCXZuwA3tdjtQInL.jpg",
               "id": 15992,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c003",
               "name": "John Sherwood",
               "profile_path": null,
               "id": 121314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c009",
               "name": "Harry Essex",
               "profile_path": null,
               "id": 67686,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ae2c3a368484e16c00f",
               "name": "Albert Zugsmith",
               "profile_path": null,
               "id": 45279,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57563582c3a3680cc400123c",
               "name": "Maury Gertsman",
               "profile_path": null,
               "id": 117025,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "593c19b8c3a3680f8700f978",
               "name": "Robert Hill",
               "profile_path": null,
               "id": 137470,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "593c19c1c3a3680f3300ddf4",
               "name": "William Kozlenko",
               "profile_path": null,
               "id": 1593867,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "593c19cbc3a3680ee0010beb",
               "name": "James Benson Nablo",
               "profile_path": null,
               "id": 97287,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.159426,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 126550,
      "vote_count": 3,
      "budget": 0,
      "overview": "A Texan arrives in Oregon and seeks justice for his innocently-hanged brother",
      "similar": [
         281957,
         74997,
         588,
         45569,
         357096,
         2652,
         156022,
         10781,
         133805,
         3134,
         979,
         8456,
         238636,
         281,
         395834,
         3600,
         9373,
         73861,
         291356,
         663
      ],
      "original_title": "Raw Edge",
      "runtime": 76,
      "poster_path": "/hGiYAdbcKADGieSdSxdvxeVpHJO.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1956-03-24",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A savage land beyond the law!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Sherwood"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Harry Essex",
         "Robert Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049661/",
      "coverLink": null,
      "actors": [
         "Rory Calhoun",
         "Yvonne De Carlo",
         "Mara Corday"
      ],
      "reviews": [
         "I read the reviews here and wonder if anyone has a different interpretation. This movie is about the dark side of human nature where everyone is for themselves. I'm not sure if that message will catch but it will in another light if you consider more recent films such as the Dark Knight movies or the Man With No Name trilogy. In many movies, there are no real heroes. So even the women in this movie don't have emotional reaction when something tragic happens to a close person. The hero Tex Kirby comes back for revenge of his brother, or is it? Paca who loses her husband finds an cold unexpected way to get revenge. The Indian maids who leave Hannah (Yvonne De Carlo) and the ranch are neutral characters but still, they do what's best in their interest. So at the end, it is easy for Hannah to have no love lost and be willing to leave with the hero. The wild west was an arena where you had to watch your back. The setting was a wild 1842 Oregon where there are no rules. It was lawless and you defended yourself. Even those you think you can trust, can you really trust them? The rancher who makes the rules, Gerald Montgomery makes very harsh rules. Take a woman like she is property if she has no husband. One evil character shoots his father in the back. No one cries in this movie. Violence, lawlessness and war dull the emotions. We know that where even young children exposed to war get emotionally insensitive to death. It is unusually violent for a movie in the mid-50s depicting rape, murder (of relatives), treachery and lawlessness. It seems really that the Yakima Indians are the only ones with a code, law or ethics. A question is what degrees of evil and selfishness are there? If you watch the movie with this in mind, you can see the message. But most people won't see it that way, but will get confused by the mindless violence and unemotional characters. In this way, it's an unusual minor masterpiece. The evil characters are definitely fun. Overall, supporting roles are well-acted but the leads are very average. The script does not lead to a clearer message and a viewer could get lost in its meaninglessness. Other than the message and supporting actors, the movie is fairly average. So an average rating might be 5-6 for me, but the supporting actors and dark message are fascinating and bump it to a 7 even 7.5. If you don't understand it, it's a 5 or 6.",
         "In 1842, Oregon, might makes right. And might belongs to Montgomery, who rules over the land. One of his \"laws\" is that any \"free\" woman rightfully belongs to the first man who claims her, until his death. And he has claimed the desirable Hannah (Yvonne De Carlo - no wonder she made so many Westerns, that woman can ride!). When the brother of a man whom Montgomery unjustly sentenced to hanging comes looking for revenge, Montgomery's protectors decide to side with him, hoping to see their boss dead and his wife open to re-claiming. The threat of rape, if not explicit then certainly strongly implied, hangs over the proceedings throughout \"Raw Edge\", giving the film an unpleasant air (this is definitely no family fare). Even the \"hero\", or at least the person who comes closest to that description (Rory Calhoun), is morally questionable at best. But the cast is good, and the film is beautifully shot in natural locations and vivid Technicolor. **1/2 out of 4.",
         "This edgy and off-beat western has plenty of seething resentment amongst its characters (and there are lots of them: vengeful gunslinger, baddie, baddie's dumb henchmen, local gambler, baddie's wife, baddies girlfriend...) but isn't too believable. Some good action scenes but only average over all. (5",
         "No doubt thinking he had made a wise decision, Gerald Montgomery (Herbert Rudley) creates a law by which any woman without a man will be the property of the first man who finds her. Well, this trashy but fun western shows how this will have the opposite effect . Quoting Pauline Kael about trashy movies:\"What gives this trash a lift, what makes it entertaining is clearly that some of those involved, knowing of course that they were working on a silly shallow script and a movie that wasn't about anything of consequence, used the chance to have a good time with it.\" Writers Harry Essex (Creature from the Black Lagoon) and Robert Hill (The Private Lives of Adam and Eve) knew for sure what trash was about. There is a big flaw in the script already mentioned in another comment, in how could Montgomery being responsible for the death of Paca's (Mara Corday) husband, allowed her to go to her tribe, without predicting she would turn against him. Apart from this, \"Raw Edge\" is a good western, violent for its time, entertaining and with Yvonne de Carlo sexier than at any other film she made.",
         "Set in the days of the Oregon Territory, Raw Edge is one of your more adult westerns made during the Fifties at a time when westerns were trying to compete with westerns shown on television. The Saturday matinée kids of the Thirties and Forties did not see westerns that were about sex. John Gavin married to Mara Corday insults Yvonne DeCarlo in the eyes of her husband Herbert Rudley who is the local Ponderosa owner in the area. But this guy has a lot more power than Ben Cartwright ever dreamed of. He's a veritable medieval lord of the manor and he's in charge of the women who in pioneer Oregon are the most valuable commodity around. Gavin is hung as per Lord Rudley's orders and Mara Corday who is a mixed racial women is then 'assigned' to Robert J. Wilkie also per Lord Rudley's orders. That's how it is in his part of Oregon. That is until former Texas Ranger Rory Calhoun arrives in town and is greeted with his brother's lifeless swinging body. He wants answers and wants them now. Which presents a peculiar conundrum for a lot of people. They're all under Rudley's thumb, but they also realize that there's still a shortage of women and Yvonne DeCarlo's one most desirable woman. And she'd also be a wealthy widow. And Corday has a tribe of relations ready to take up her cause as well. All in all Raw Edge with its emphasis on sex and women as valuable commodities is an unusual, but entertaining western. Besides those I've mentioned look for good performances from Rex Reason as a cynical gambler and a father and son pair of lowlifes, Emile Meyer and Neville Brand. Definitely one adult western.",
         "\"Raw Edge\" is an exploitation Universal western in its story and direction but shot in classic settings. It was directed by John Sherwood who was a great assistant director (he worked for Anthony Mann, Bud Boetticher, Max Ophüls, John Sturges, ...). Harry Essex wrote the script of \"Raw Edge\", he wrote also scripts for Jack Arnold, and the three movies John Sherwoood shot were like Jack Arnold's movies, \"The Creature Walks Among Us\" and \"The Monolith Monsters\" being the two others. \"Raw Edge\" describes how sex could have been in those times with workers having no home and being strong alcoholics. There are scenes never seen before in a western, like the one with Neville Brand and Yvonne de Carlo. So \"Raw Edge\" cannot please to westerns purists, it's more a western for 1956 youth watching it in a drive-in in their muscle-car, looking for sex and violence. Rory Calhoun had already played in the western \"Four Guns To The Border\" directed by Richard Carlson in which there also were very erotic scenes with Colleen Miller. How could those scenes have been through the censorship? Beginning of the end...",
         "This is one of the most implausible Westerns I have ever seen. Despite the good actors, acting, cinema-photography and other good production values, the story reduces the movie to rubbish. ***Lots of spoilers.**** The movie centers on a stupid rule/custom of the locale that an unmarried woman can be claimed by any (strong) man. So when an Indian wife's (Mara Corday) white husband is hanged on flimsy grounds, she calmly accepts the man claiming her, even though the Indian helping her escape back to her tribe is also killed.. Vigilantes hung the husband for assault even though the wife (Yvonne De Carlo) of the big local land baron said the Indian's husband did not attack her. Rory Calhoun is looking for the land baron, who instigated the hanging (of Calhoun's brother), so some lustful townspeople follow along hoping to claim the land baron's wife and property after he is hopefully killed by Calhoun. Even though he had Corday's husband hanged, the land baron trusts Corday that the Indian tribe wants to see him, not kill him, but she lies and he is killed. Near the end one of the bad guys shoots his father in the back. To top it off, at the end De Carlo goes off with drifter Calhoun, seemingly leaving her wealthy husband's property behind.",
         "Wow, keep the feminists and National Alliance of Women away from this one! I couldn't believe the premise laid out in the opening minutes (actually I can believe it, but it's really over the top) when it was stated that the law, such as it was in 1842 Oregon, held that women were for the taking by the strongest man who could affect his will on her and claim her for his own. After that, she became his property until he died. Talk about a dysfunctional family, I'm still thinking about how Tarp Penny (Neville Brand) shot his Pa (Emile Meyer) in the back! over the old Montgomery Doctrine stated above. George Montgomery (Herbert Rudley) was king of the hill in this story, with his wife Hannah (Yvonne De Carlo) the top prize. Funny, but I didn't get much of a sense that Hannah objected to being his wife for the most part until things got intense with the unjust hanging of Dan Kirby (John Gavin). Otherwise it didn't appear that she was much opposed to this particular law of the Oregon jungle. I'll say this for Dan Kirby's widow Paca (Mara Corday), she sure pulled a neat double cross on Montgomery to save hero Tex Kirby (Rory Calhoun) the trouble. He had his own hands full dealing with the Penny's, Tarp and his Pa. If you think about it, Tarp never had to atone for the problem that opened the story, the attack on Hannah Montgomery. But that issue was settled when he went up against Tex for the final showdown. I thought it a bit too coincidental that Tex and Tarp ran out of bullets at the same time, at which point Tarp found himself on the horns of a dilemma. Nor did it seem very realistic that Hannah would simply run off with Tex to close out the story, but that's how a lot of these Westerns ended for lack of something more creative. It's too bad we never got to see what ever happened to Sile Doty (Robert Wilke). Left to my own imagination, I'd like to think that Paca got her Yakima revenge on his butt too.",
         "A very Different Western with its concern Focused on Sex. Competing with TV, the Movies of the Decade occasionally ventured into this Territory. The Movie Stars Two Beautiful Women, Yvonne De Carlo, and Mara Corday and the Complete Running Time is spent with both being Chased, Near Raped, and generally Lusted after. The Male Cast lead by Rory Calhoun also features Neville Brand, Rex Reason, and Emile Meyer. The Screen is On Fire from Frame One and the Chase is On to see who can Bed the Beauties First. It's Widescreen and Technicolor and Runs 76 Minutes. The Subject Matter Alone makes this one Stand Apart from other Fifties Western Fodder. Definitely Worth a Watch for Western Movie Fans and even those not usually drawn to Genre might find it Entertaining as it leans more toward an Adult Audience. Note...Director John Sherwood made a career as a Second Unit Director and only Directed three films. Other than this one...The Monolith Monsters (1957) and The Creature Walks Among Us (1956)."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "In the lawless Oregon country of 1842, local magnate Gerald Montgomery decrees that any unattached woman belongs to the first taker. Dan Kirby is lynched, starting a stampede to claim his half-Indian wife Paca. Trouble starts with the local tribe, but worse is in store when Dan's tough brother Tex rides in. The zeal of Montgomery's men to protect him from Tex is tempered by their lust for Hannah, who'd be his widow.",
         "In 1842 lawless Oregon, a gunfighter seeks vengeance when his innocent brother is lynched and his beautiful Indian wife is claimed by the local tyrant."
      ],
      "budget": 0
   },
   "movielensId": 158478,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1956-03-24",
      "dvdReleaseDate": null,
      "directors": ["John Sherwood"],
      "runtime": 76,
      "movieId": 158478,
      "title": "Raw Edge",
      "mpaa": "",
      "actors": [
         "Rory Calhoun",
         "Yvonne De Carlo",
         "Mara Corday",
         "Neville Brand",
         "Rex Reason",
         "Emile Meyer",
         "Herbert Rudley",
         "Robert J. Wilke",
         "John Gavin",
         "Gregg Barton",
         "Ed Fury",
         "William Schallert"
      ],
      "imdbMovieId": "0049661",
      "originalTitle": "Raw Edge",
      "genres": ["Western"],
      "youtubeTrailerIds": ["Dp-py5XJw_Y"],
      "plotSummary": "A Texan arrives in Oregon and seeks justice for his innocently-hanged brother",
      "tmdbMovieId": 126550,
      "avgRating": 0,
      "releaseYear": "1956",
      "numRatings": 0,
      "posterPath": "/hGiYAdbcKADGieSdSxdvxeVpHJO.jpg"
   }
}