{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0312603",
      "video": false,
      "title": "Deathlands",
      "recommendations": [],
      "backdrop_path": "/q5WC34LqhPNVVGKpqaC1XdO7WEJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Krysty Wroth",
               "gender": 1,
               "credit_id": "52fe4974c3a36847f819b01b",
               "name": "Jenya Lano",
               "profile_path": "/3iQBdHlnNMa2G9dMtDmdop3Sogq.jpg",
               "id": 116402,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lady Rachel Cawdor",
               "gender": 1,
               "credit_id": "52fe4974c3a36847f819b01f",
               "name": "Traci Lords",
               "profile_path": "/40n1G3p2sGxnsU0m8tfIlthMatA.jpg",
               "id": 10826,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ryan Cawdor",
               "gender": 2,
               "credit_id": "530fc18f9251410ff1000175",
               "name": "Vincent Spano",
               "profile_path": "/zcb6CZepSzOy4zYk6gkXB7FrLOZ.jpg",
               "id": 147119,
               "order": 2
            }
         ],
         "crew": []
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 0.693062,
      "production_countries": [],
      "id": 58813,
      "vote_count": 3,
      "budget": 0,
      "overview": "In 2084, a nuclear war wasted Earth, making the sky red of chemicals and the former United States of America becomes Deathlands. Breeds of mutants and half-mutants share what was left on Earth with humans. The vile of \"Front Royale\" is ruled by a good man, but he is killed by his wife Lady Rachel Cawdor, and his evil son Harvey Cawdor kills one of his brothers and blinds one eyes of his fifteen years old brother Ryan, who escapes. Twenty years later, the one-eyed leader Ryan Cawdor returns to \"Front Royale\" with his girlfriend and half-mutant Krysty Worth, his human friend and specialist in weapons JB Dix and the teenage mutant Jak Laurent to face his brother and his stepmother.",
      "similar": [],
      "original_title": "Deathlands",
      "runtime": 88,
      "poster_path": "/qysVtBh3FjaslKCNZMVXCziME4d.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2003-05-17",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joshua Butler"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "James Axler",
         "Gabrielle G. Stanton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0312603/",
      "coverLink": null,
      "actors": [
         "Vincent Spano",
         "Jenya Lano",
         "Colin Fox"
      ],
      "reviews": [
         "It's always a gamble when a book is adapted to screen. It's more of a gamble when a popular book is adapted to screen. However, when you take a book that's got \"CULT\" written all over it, that's where your real problems begin. I've only read a few of James Axler's \"DEATHLANDS\" books, but enough to know they definitely took some liberties. A major character from the group was completely omitted (Doc Tanner), and a good deal of the backstory was changed, but not really enough to ruin the movie for me. Oscar-worthy, it ain't, but it's nowhere nearly as bad as a lot of people are making it out to be. What puzzles me is people who claim to read the series are complaining about the rather tepid dialogue. Well, what books HAVE you been reading?! The dialogue in the \"DEATHLANDS\" series is about as sophomoric as any adventure series (barring \"THE DESTROYER\" and DL's \"sister\" series, \"OUTLANDERS\"). The terms \"fireblast\", \"nukesh*tting\", just to cite a couple of examples, pepper the prose throughout these books. Not exactly Henry James. But, I digress... Vincent Spano, never one of my favourite actors, actually did a passable turn as Ryan Cawdor, 'though I would've preferred him to be more like the introspective \"Snake Plissken\" clone the character was created to resemble. Jenya Lano was admirably cast as Krysty Wroth, even if the on screen version was a bit too timid. Cliff Saunders, physically a bit too Phil Collins-esquire to accurately portray the gaunt Armourer, JB Dix, did a good turn, though a bit more talkative than his literary counterpart. A lot of other complaints were that the characters were too \"goody-goody\". Well, that's as may be, but it's also one of the primary reasons why the \"DEATHLANDS\" series has a C U L T following instead of mainstream. If these characters were constantly as ruthless on screen as they are in the books, the creators of the movie / proposed TV series would be hard-pressed to get as large a viewership as they'd be aiming to attract. The villains (and some of the protagonists) were over-the-top, but no more so than in any of the books I've read thus far. While some of these people gave shuddering performances, it strikes me as pretty much spot-on in comparison to the the four books in the series I've read thus far. The violence was toned down SEVERELY, as was the obligatory sex scene between Ryan & Krysty, but, as it's a made-for-cable movie, it's about what I expected, and actually, some of the more graphic scenes they left in really surprised me. The cinematography was visually startling and very effective, giving the edginess to the Deathlands that the books convey. It's unfortunate that their budget was only around $2 million, but given that's all they had to work with, they have my kudos in spades for even getting it made, let alone seen by anyone. \"HOMEWARD BOUND\", the 5th book in the \"DEATHLANDS\" series, was the director's personal choice from what I read. It was a nice idea, but I think it might've been a bit too ambitious for a debut movie. As far as post-apocalyptic scenarios, the first book in the series, \"Pilgimage to Hell\", prob'ly would've made a much better choice. The readers are still introduced to the characters one at a time, but there's still some mystery to them, whereas \"HOMEWARD BOUND\" tries to explain way too much at one time. Had this gone to series, \"HB\" would've been more apropos as the first season's cliffhanger / second season's opener. All-in-all, however, it's somewhat heartening to see that the writers and director actually drew from the source material instead of merely paying lip service to it. It gives me hope that they may one day re-do a DL movie, or move on to \"OUTLANDERS\" with better results. Yes, this movie could've been a lot better, but it also could've been a lot WORSE.",
         "In 2084, a nuclear war wasted Earth, making the sky red of chemicals and the former United States of America becomes Deathlands. Breeds of mutants and half-mutants share what was left on Earth with humans. The vile of \"Front Royale\" is ruled by a good man, but he is killed by his wife Lady Rachel Cawdor (Traci Lords), and his evil son Harvey Cawdor kills one of his brothers and blinds one eyes of his fifteen years old brother Ryan, who escapes. Twenty years later, the one-eyed leader Ryan Cawdor (Vincent Spano) returns to \"Front Royale\" with his girlfriend and half-mutant Krysty Worth (Jenya Lano), his human friend and specialist in weapons JB Dix (Cliff Saunders) and the teenage mutant Jak Laurent (Nathan Carter) to face his brother and his stepmother. \"Deathlands\" is another entertaining post-apocalyptic story à la \"Mad Max\" and probably a pilot of a show. In spite of the bad reviews, I found this low-budget movie very reasonable and in the end I liked it. The lead character Ryan Cawdor recalls Snake Plissken, from \"Escape from New York\" and \"Escape from L.A\" and the red-haired Jenya Lano is very gorgeous. My vote is six. Title (Brazil): \"Deathlands \u0096 Terra em Fogo\"(\"Deathlands \u0096 Earth on Fire\")",
         "The acting is good, Traci Lords and Vincent Spano are in it, and the red head is a knockout! It's a Sci Fi where the hero kills the bad guy. It's action adventure. Film Fans, Okay, it's not like the book. Surprised? It never is like the book. Enjoy it for what it is. What do you expect Die Hard? You try and a make a movie with two name actors for under a million, go ahead, see what you come up with. Farside has a little more juice behind it than this piece by Stanton but she has less time to tell the story. I really liked the way that the red haired mutant kept calling Spano (the Ryan character) lover. So warm in today's PC world. Refreshing. But the restrictions of television were evident in the romantic scenes.",
         "Unfortunately, this film doesn't sink to the level of truly horrendous, which would have made it much more enjoyable. The characters aspire to be cardboard cutouts but don't rate quite that high. The occasional scenery chewing actually comes as a relief. The dialogue could have been generated by a word processor set to \"bland\". The kingdom, or \"ville\", being fought over resembles an abandoned shoe factory. The henchmen, or secman as they are known, couldn't put a beat down on a sack of kittens. One of the heroes, the Armorer, looks like an accountant going to a Halloween party dressed an Indiana Jones, and is about as dangerous. One of the only barely original touches is to kill the sound whenever there is an explosion or action sequence. After discovering I hadn't accidentally muted my TV this was interesting for 5 seconds or so, then just became annoying. The ending credits were probably the best done part of the movie. All in all, go to your local community theater instead of watching this. It'll be time much better spent. I just don't understand how movies like this get made.",
         "I think this movie deserve a watch from people. The director made a great job doing the action scenes, really fine. Even if you think how near the characther of Vincen Spano is to Kurt Russell (Snake), is a great pleasure see how the producers can do a fine film with few dollars, and give us something decent. Traci Lords maybe will finish her career in the hardcore again. She is not a great actress, even a character actress, and is necesary to understand that only a character actress can play her role (a bad girl) with success. I think could be better if they do a second part. The better point of the movie: the John Woo influence in action scenes.",
         "having read many of the deathlands books i was happy to see this listed on the show guide for the movie channel. having endured the massacre of the premise and actions of the lame cinematography and the inane dialogue, (everyone talked like they were addressing a primary school class) i reflected on the time at my deathbed when i would be wanting these two hours back.",
         "Well, I've never read the book or anything, but it's probably a given that it's better than this clunker of a movie adaptation. The film suffers badly from a low budget and just silly villains. Let me get this straight: 100 years after a nuclear war, and these uneducated, primitive survivalists will let two nutcases \"rule\" them like a king and queen, when any one of them could shoot the \"rulers\" in the head if they so chooses to? Yeah, right. Some groovy editing work can't save it. This is just a poor movie, and should never have been made. Really, really bad.",
         "Where was Doc, Jak's pointed ears, abbreviated way of speaking and flowing white hair? What was with his supposed rages? Ryan was cast well and Krysty also But J.B. should have been taller and more wiry. The redoubt looked like a homeless shelter made of cardboard and there wasn't even a mention of the Mat Trans system which is probably the most integral part of the series. Sadly, because this movie was so badly made there will probably be no more. One wonders why they would pick the fifth book in the series to film. Of course they could have been hoping for the same success that James Bond has achieved (that series of films started with the fifth in the series also).",
         "I have a shelf of Deathlands books. I am missing only -ten- of more than 80 volumes in this series, and I am a fan of it. The last 15 or so books have sucked rocks, but this movie...I was very disappointed. I was -thrilled- to know it had finally been made into a movie, and when Canada's SPACE channel aired it last night (July 22nd, 2005) I stayed up til crazy hours of the morning to watch it. But, they could have put more into making the chars like we knew them. JB wasn't a jolly man, he barely spoke. He and Jak are both described as 'never using two words where one would be enough' in the books. Jak is my favorite char, and while I don't know the actor well enough to know whether or not he did his best, I do think he could have pulled it off had the character been portrayed correctly. I DID like the sick little grin on his face when Ryan and JB asked him if he could handle obtaining a rifle. That just screamed 'Jak'. :> I also liked where Jak was getting angry at being locked up. Jak is often described as being akin to a caged animal when he's locked up, and the glaring red eyes help a lot with that. Krysty has crimson hair and emerald eyes, her brightly colored hair and startling eyes are what make her visibly different. I think they should have invested in some hair dye and -made- the actress look the part. Ryan looked exactly as I would have imagined him to look (except lighter of skin...Men and women very used to the outdoors so much, I would have expected to be tanned. Except Jak, of course) Also...everything was very new looking, including Jak's perfect and unscratched shades. JB looked the part although his face was a little rounder than I pictured him to be. I think they did an okay job of telling the story itself, and for such a small budget it wasn't that bad. I think they could have put more effort into making the characters more consistent with the books. Hair dye can do wonders. Also, someone made a note about how unbelievable it was that four people would set out to change the world. They're out to change the world for themselves, to give themselves a brighter future than they each had before. It's all about a search for hope. I'm not sure I would have started a series of movies (Which I still hope for it to be) with Homeward Bound, though. At least one movie to provide setting and background before going home would have been more interesting and might have attracted new blood as they waited to see more. Homeward Bound seems so finite that it doesn't seem like there is anything left to look forward to.",
         "I'm a big fan of the deathland books. I thought the movie was good with the budget guidelines they had to work within. I'm sure scifi didn't wanna put millions in a untested project. I would like to see a mini-series of the first book, Deathlands-Pilmagrige to Hell. Then I would like to see a series of original one hour episodes launch covering new and unread material based on the deathlands theme. These books contain a all to real clumps into a all to possible future based on simple mistakes made by a minority to plunge humanity into darkness and chaos. I recommend anyone with a taste for post apocalyptic scenario's to try out this series and maybe in the future one of the major networks will take an interest in a quality budgeted for of this series.",
         "Since when did Jak start speaking in full sentences? Since when did Krysty need her super-strength to beat up Traci Lords? Since when did crappy movies get rave reviews? O.K., nevermind that last one, but the first two still stand. This movie is a travesty to anyone who (like me) is a faithful reader of the \"Deathlands\" books. The actors mouth familiar words like \"fireblast\" and the like, but overall they're just going through the motions (and what is with Ryan's \"pimp daddy\" coat? I ask you!). The early scenes of young Ryan getting his eye gouged out were O.K. (and doubly cringe-inducing for \"Buffy the Vampire Slayer\" fans--poor Xander!), but the rest was crap. The red filter over the camera lens was distracting, and a lame attempt to create the \"blood red skies\" of the Deathlands. You're better off listening to the Judas Priest song of the same name. I know, I shouldn't expect much from a made-for-TV movie, but even with lowered expectations, this movie isn't worth the film it was printed on.",
         "I watched and taped this movie because i thought it would be great to spend \"time\" with Ryan and the others. Unfortunately, the person who did the screenplay can't possibly have read the books and could therefore easily convince someone unfamiliar with them that they're not worthy of reading. First of all, Krysty doesn't get wild-eyed when she calls on the Gaia power and would never show fear before it as she did in the movie when Jabez was going to attack her. Jak is not crazy. In the books, being an albino gives him a crazy look to some people and he has long white hair, adding to the effect. JB is not chubby and doesn't look like a geek. I like Vincent Spano as Ryan. He did a great job, although I'd mention to the writers that I don't remember him ever calling Krysty \"baby\" or refusing to argue with her. They're a true team, but he's not under her control in any way. As to the other writer's comments about how people wouldn't let themselves be ruled by a crazy baron, I ask you to remember \"Baron\" Hitler and his sec force, also known as the SS; \"Baron\" Kruschev and his sec force called, the KGB and let's not forget \"Baron\" Castro although I don't know the name of his sec force. Fear and intimidation rule well. Everything in Deathlands is not red either. There are places that are quite nice. In short, if you didn't like the movie but think that it may have had some interesting moments, try the books. They've been around a long time and are very popular with a strong following. In the books, you'll also meet Dr. Mildred Wyeth, a 'freezie' and JB's lover, and 'Doc', aka Dr Theophilus Tanner, a time traveler, made crazy by too many experiments by the 'white coats'. When he returns from being kidnapped by his mother, Sharona, you can meet Dean, Ryan's 11 year old son. Hope Ryan kills the bitch when he gets the chance. But i do enjoy the movie just for the fun of being with the group. You have to suspend your disbelief long enough to get past the mistakes. And it should have been longer to do it justice.",
         "I've read most of the Deathlands books and this movie doesn't do any of them justice. The characters are stupid and the plot is so weak that it could have been written by a child ( no offense to the kiddies). I had hoped for some time that there would be a movie based on the books, now I'm not so sure that it should have been attempted. Perhaps some producer and director with some talent and a decent cash flow will do it some day and portray the stories in the manner they were meant to be told. This could be the next great action movie if done the way it should. It would help if the story started from the beginning, so that the viewers who have never read the books would get the idea of who these people are and what they are trying to do.",
         "i think that for the most part the movie was okay. i would have found it a lot more enjoyable if i had not read some of the books first. i wasn't very pleased with Jak, who is my fav charecter in the book. he is supposed to be much more 'economical with words' and i didn't see him use one knife in the movie. Jak is supposed to be a knife fighter, though he does own a .357 Magnum. also, though not as important- his hair is supposed to be longer and he should have two scars on his face, one on his cheak and one on his nose. in addition to that, Jak does drive more then anyone else in the book. he does not need a drivers licens. i was very disappointed at the non-appearances of Lori and Doc, who are key charecters. also--i was not aware that anyone in the story had such good grammer. though not idiots, for the most part they are not really schooled, though most of them could read, not just ryan. overall i just found that there were to many differences from the book.",
         "I am a fan of the books although i have only read the first few at the moment. I watched the movie i noticed major problems with it, i hope that the makers of said movie are going to read what i am about to stay Criticism... 1. It was based on the homeward bound book which is not the first book in the series actually DL:PLTH (short form since i am a crappy speller) 2. there is no mention of the redoubts which they use to travel around which is mentioned from the end of first book. Redoubts have transmit chambers which although Ryan cawdors group to travel across the deathlands quickly. 3. no mention of doc, who unlike jaks is a character from the first book who hasn't been killed off 4. while Ryan cawdors group are travelling 'heros' they do use excessive amounts of violence, and that is there answers to most their problems... 5. if u are to make squeal actually use the first book",
         "Being an avid Deathlands (book series) reader as well as Outlanders (follow-up series) for weeks I looked forward to seeing this movie when I heard it was coming out on the Sci-Fi Channel. I was sadly disappointed in not only the acting, but the details of the characters, environment, and such low budget it made Mad Max look like an Emmy winner. Let me say I am a detail-oriented person, and I realize Hollywood takes certain liberties, and or can re-write stories that ruin them, but this is not that, it is fully down to people who have no business making movies. I'll list my complaints : 1) The Book Becomes A Movie : they based this movie off of isn't even the 1st in the series, if memory serves, it was the 5th book in the series, so starting out on the wrong foot altogether. Probably to drastically reduce their budget. But a quality company would've found a real budget and made it into a blockbuster starting with the 1st book in the series and made 3, 5, even 10 movies out of the book series. 2) The Characters : Spano did an okay job as Ryan Cawdor, his acting though is reminiscent of the early days of William Shatner, which SUCKED. I'm not going to go into detail about all of the actors as it's not their fault. But there are two characters which conflict with their book description, \"character\" of personality, and or totally are wrong. 2b) John Barrymore \"J.B.\" Dix : It's like the script writer and or actor didn't bother reading the book series, because there are numerous complaints on this one. J.B. is not a heavyset and or dumpy man, he's lean, mean, and ready to rock, according to the book series. Neither is he a whiny snotty person, the portrayal makes this man seem a wimp. J.B. is an armorer, a guy who can do almost anything with a gun. And his persona is one of almost total confidence only 2nd to Ryan Cawdor, and he's a very quiet man, too much dialogue for him. Wikipedia : J.B. Dix - http://en.wikipedia.org/wiki/Deathlands#Main_characters \"John Barrymore Dix: J.B. Dix, also known as The Armorer, has been Ryan Cawdor's closest friend and travelling companion since both men worked for and travelled with the Trader. He is a thin, wiry, tough man who wears wire rimmed spectacles and a brown fedora. He is very quiet, never using four words when three will do. He is a living encyclopedia on weapons from pistols to tanks to missiles. He is also an explosives expert and good hand to hand combatant, although only an average shot. He carries a large canvas satchel containing his explosives and other weapons at all times.\" (Wikipedia's typos aren't my fault, copied and pasted directly) 2c) Jak Lauren : He's even leaner than Dix to the point of being like a \"wolf\", they even describe him like that in the books, and his glasses were overdone to be totally stupid, not to mention the actor was too old. \"An albino distinguished in the books by his unusual syntax when speaking. Jak was introduced in the third book, Neutron Solstice. He is a young man, in his late teens, and is an extremely capable hunter and warrior. His signature weapon are his leaf bladed throwing knives, of which he has between 8 and 12 hidden on him at all times, and often uses them as thrown weapons or for melee when guns are inappropriate. He comes from the suburb of West Lowellton in Lafayette, Louisiana, where the group first meet him. At the time,he is leading a group of rebels against an extremely sadistic baron known as Tourment. When Ryan and the other's first met him, and saw just how skillful of a fighter and leader he is, they are surprised to find he is only 14 years old.\" I'm going to stop there as even talking about how bad this movie was makes me want to puke. If the writers, directors, and or anyone connected to this movie had read the books, or hired an enthusiast, or a consultant who knew the book series inside out, it MIGHT have been high enough to grade as a B movie. If they had even read the basic Wikipedia on it, it might have been better. Not to mention they actually forgot a character. I'll leave his name out so if you do your own basic research you will see for yourself. http://en.wikipedia.org/wiki/Deathlands Unfortunately, it doesn't even rate a B rating, and that's bad.",
         "I was not expecting much from Deathlands, but got better than anticipated even if the end result was still very flawed. It does get some plaudits for the acting being better than average, Vincent Spano has never been a big favourite but still does a decent job in the lead, the female lead is also more than a pretty face at least, while Cliff Saunders does what he can with some of the weakest material. As well as some slick editing and authentic scenery. On the other hand the colour filtering is very distracting, so much so at first I wasn't sure whether it was the film or whether my television had broken. The dialogue is really tepid, I am sure they are in the books too(I haven't read them though) but this could have been an opportunity to improve on that and they missed it. The music is generic with nothing memorable sticking out, and the action is unexciting with the last one in particular having none of the relentless adrenaline-rushing thrills you'd expect. What's just as bad is that I just wasn't convinced by the story or any of the characters. The story despite a reasonably intriguing idea was dull and seemed structurally thin, with no sense of suspense or genuine surprise, while the characters are clichéd and just never seem to come to life, you don't learn much about them and in the end you don't care about them or their motivations. Overall, Deathlands is not a terrible movie, I've seen much worse, but it could have been far better as well. 4/10 Bethany Cox",
         "When I heard that there was a movie based on one of my favourite book series, I had to see it. Sadly I have to say I needn't have bothered. I understand that in the land of low budget films, changes have to be made to stay under the salary cap. A few tweaks to certain events or the storyline which are relatively subtle are fine. But when a story is already set out, like that of Deathlands: Homeward Bound, these changes just lead to disappointment. Where was Doc, and that girl Lori Quint who was with them in the novel? Could they not afford to pay the actors? They didn't even mention the MAT-TRANS systems from the novels, but I won't dwindle on that. It's better unmentioned then completely changed, like Jak for instance. What was going through the screenplay writers head when he turned the albino youth into a raging mutant. I thought the acting was quite good, not how I imagined but that's understandable. Except for J.B, but that's probably because his character is so different to that of the novels. The sets were impressive and I was delighted to finally see a \"wag\" portrayed outside of literature. The soundtrack was great, fit the theme perfectly. The camera work however didn't live up to that standard, the angles and movements just didn't seem lively enough. Some of the effects were completely unnecessary, such as the chemical haze, which I don't believe was in the books at all, it just gave the film a dull and dreary feel. I actually enjoyed the intro more than any other part of this film. All in all it was mildly entertaining. It has that never meet your heroes mentality about it, although I remain hopeful that one day, a fully fledged well budgeted series based on Deathlands is made. I give it four out of ten.",
         "SPOILERS I began with the Outlanders series of books and just recently started reading the Deathlands series. James Axler, or the conglomeration of writers using his name, are erratic story-tellers at best. You aren't reading Poe or James when you open an Axler book, just mindless post apocalyptic cheese. I really don't understand the bad reviews written here. I entered the film with trepidation - what with the combination of Traci Lords and a Sci-Fi Channel production (which spell disaster) - but this was actually quite entertaining although minus some ingredients from the book - which can be overlooked by the casual fan of the series but not the fanatic. Traci Lords didn't kill the picture and this is handedly the best Sci-Fi original ever produced. VIOLENCE: $$$$ (There is one scene that glorifies bloodletting, when Ryan saves Jak and blows a group of slow-on-the-uptake baddies to bloody pieces. This scene was sensationalized and didn't need all the damn blood - filmmakers seem to subscribe to the excess-is-best theme nowadays. The final shootout scene was terrible though. Ryan and his group basically enter into an ambush but no one even gets close to being hit by gunfire). STORY: $$$ (Although it doesn't follow the Deathlands book verbatim, the screenwriters do a passable job. Many of the lines that are prevalent in the books are used - such as Kyrsty referring to Ryan as \"lover\" and everyone employing the typical series curses like \"fireblast\" and double-stupe\" which are far preferable than the usual X-rated dialogue we get with tasteless flicks like Scarface). NUDITY: None, this is a Sci-Fi original but there is a plethora in the book series). ACTING: $$$ (The acting could have been better, as well as the casting. Dix was easily the worst casting job in the film but Cliff Saunders did a good job with what was given him - he's just not J.B. Dix. When reading the books I always envisioned David Keith as Ryan but Vincent Spano did a fine job in the lead, although the wardrobe department needs a swift kick to the backside with that Elton John feathery coat he sported. Jenya Lano did a stellar job as Krysty. She has come a long way as an actress, having first seen her in Full Moon's terrible horror film Shrieker in which she did little beyond looking pretty. I must say, her trading the blonde mane for a red one sure enhances her appeal. The kid who played Jak was fine - I was eager to see how they were going to portray Jak and the filmmakers did better than I had expected. Traci Lords adds the name to the picture and to be honest, although campy, she did a fine job in her role.",
         "It wasn't that bad and it wasn't that good either. I rated it a 5. I was curious to see what Traci Lords was looking like these days. It was a disappointment in that her role is relatively minor.",
         "I guess someone had been playing a bit too much \"Fallout\" and \"Borderlands\" and decided to make a movie out of that concept, and while they were at it, toss in some elements of classic fantasy. The only problem is that it just did mix well. The story wasn't well knitted together, there were too many elements trying to be mixed together, and it came out as very confusing and lacking a wholesome unity. One thing that really didn't sit well with me was the red light that was supposed to be how the world was in 2021, a chemically induced toxin sky. Well, the idea was well enough, but seeing a whole movie in red was just a bit too much. It was more frustrating and annoying to look at than it was beneficial to the movie. The cast in the movie was fairly good enough, nothing overly impressive here. Seeing Tracy Lords in the movie, might be interesting to some. I, however, found her to be too much and I am sure her name was on the poster just to entice the male audience. Sales tricks like that might just work, eh? The overall impression of the movie, for me, was really bad. The movie had a weak story, weak continuity and weak entertainment value. I am sure that some of the ideas for the script worked well enough on paper (or even if it was published as a book), but on the screen? No, not so much.",
         "This movie (and I use that term lightly) is a great waste of time. I watched it in totality and that's 90 minutes of my life I'll never get back. I have read the entire Deathland series - three times. This dreck has nothing in common w/ that James Axler series of the same name. The red filter made the outside shots unwatchable, and the poor acting made the rest of the scenes unwatchable. The script bore no resemblance to any of the books and the action was akin to all the clowns getting out of a car at the circus. God this thing was terrible. If you get this DVD somehow (and I hope you haven't bought it) it's only good to hang from your rear-view mirror to keep off the radar. Please, please don't buy this crap. Spend the money on the book of the same name and read it - you will be much better for doing it. Don't waste your time on this DVD.",
         "The best part of this movie was the end credits. Really, I am so serious! The ironic thing is that I don't actually believe the people who worked on it were incompetent, just... misdirected somehow. The credits are so good, and a few points in the movie show so much thought, that I have to say this was a case of writer/director/budget incompatibility, or something. I wasn't aware that Deathlands is a novel series (80 strong at that), but it seems to me that whoever made the move wanted to do a Roman Empire or King Arthur-esquire era picture, but got told that Sci Fi is all the rage now, so pretend it's set in the future. It just felt like the story was out of place with the setting, and the setting itself was ambiguous. It's possible that the IP of Deathlands could make a really good series, but this movie doesn't demonstrate that: it more demonstrates what not to do. It was even worse than \"Darklight\", and I didn't think that was possible. DO NOT WATCH THIS. Watch anything else, see my voting list for hints. Better (but so far I haven't reviewed them) are: the Robocop movies, the Mad Max movies (although I didn't watch any properly yet, the portions I saw were much better), and \"The Postman\". Actually, Postman was the best futuristic type movie that comes to mind offhand.",
         "I have to say that i was really disappointed in this movie.The scifi channel could have mad it a lot better.Every character in this movie was nothing like the way that they are presented in the books.if anybody has read the books they know that J.B.Dicks is now way as lame as he is in this movie.Jack is not a mutie for one thing he is an albaino, also he always wears an army jacket not a sports Jersey.All i have to say is I wish that when people make movies out of books that they at least read the book first. and know what each character is like. also they need to get with the ballgame on this stuff. I hope one of these days they will get it together."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Amber Light Films Inc.",
         "Kinetic Pictures"
      ],
      "summaries": [
         "In 2084, a nuclear war wasted Earth, making the sky red of chemicals and the former United States of America becomes Deathlands. Breeds of mutants and half-mutants share what was left on Earth with humans. The vile of \"Front Royale\" is ruled by a good man, but he is killed by his wife Lady Rachel Cawdor, and his evil son Harvey Cawdor kills one of his brothers and blinds one eyes of his fifteen years old brother Ryan, who escapes. Twenty years later, the one-eyed leader Ryan Cawdor returns to \"Front Royale\" with his girlfriend and half-mutant Krysty Worth, his human friend and specialist in weapons JB Dix and the teenage mutant Jak Laurent to face his brother and his stepmother.",
         "The world has gone to hell... A nuclear war has left the Earth as a wasteland where the skies are red and ravaged by chemical mists. The United States of America along with the rest of the world has become \"The Deathlands\" where red-eyed mutants roam the lands and evil tyrants rules communities called \"Viles\". Ryan Cawdor is the one-eyed leader of a band of desert scavengers who have been living in \"The Deathlands\" for many years, as Ryan and his group scavenge what they can find and try to rebuild civilization along with the rest of the world. Ryan and his band returns to the vile \"Front Royale\", only to find \"Front Royale\" is ruled by his evil brother Harvey and stepmother Rachel who 20 years earlier murdered Ryan's father and wounded Ryan so they could rule the vile for themselves. With help of companions, Weapons expert JB Dix, Ryan's girlfriend Krysty Worth and teenage mutant Jak Laurent, Ryan sets out to avenge his past and put a end to Harvey and Rachel's reign of evil.",
         "The one-eyed leader of a team of desert scavengers living in the post-apocalyptic United States returns to his home to get his revenge on his evil brother and his evil stepmother whom murdered his father and his brother."
      ],
      "budget": 0
   },
   "movielensId": 158685,
   "movielens": {
      "languages": [""],
      "releaseDate": "2003-05-17",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 88,
      "movieId": 158685,
      "title": "Deathlands",
      "mpaa": "",
      "actors": [
         "Jenya Lano",
         "Traci Lords",
         "Vincent Spano"
      ],
      "imdbMovieId": "0312603",
      "originalTitle": "Deathlands",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [],
      "plotSummary": "In 2084, a nuclear war wasted Earth, making the sky red of chemicals and the former United States of America becomes Deathlands. Breeds of mutants and half-mutants share what was left on Earth with humans. The vile of \"Front Royale\" is ruled by a good man, but he is killed by his wife Lady Rachel Cawdor, and his evil son Harvey Cawdor kills one of his brothers and blinds one eyes of his fifteen years old brother Ryan, who escapes. Twenty years later, the one-eyed leader Ryan Cawdor returns to \"Front Royale\" with his girlfriend and half-mutant Krysty Worth, his human friend and specialist in weapons JB Dix and the teenage mutant Jak Laurent to face his brother and his stepmother.",
      "tmdbMovieId": 58813,
      "avgRating": 1,
      "releaseYear": "2003",
      "numRatings": 1,
      "posterPath": "/qysVtBh3FjaslKCNZMVXCziME4d.jpg"
   }
}