{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1832368",
      "video": false,
      "title": "How Beer Saved the World",
      "recommendations": [13359],
      "backdrop_path": "/o6nlcgc3ZTehdwNlvogp2QdCB18.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.217771,
      "production_countries": [],
      "id": 81765,
      "vote_count": 3,
      "budget": 0,
      "overview": "This show traces the important role that beer has played in human history from the probable origins of the first beer at the dawn of history to the development of a special beer for use in zero gravity space missions.",
      "similar": [],
      "original_title": "How Beer Saved the World",
      "runtime": 44,
      "poster_path": "/t4Lf8xroxujJPhVTZHuXwRIvzxl.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-01-30",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 60,
      "synopsis": null,
      "writers": ["Martyn Ives"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1832368/",
      "coverLink": null,
      "actors": [
         "Henry Strozier",
         "George Armelagos",
         "Charlie Bamforth"
      ],
      "reviews": [
         "To the tune of \"The Hills are alive\" ... \"The beer is alive, and it sounds like music.\" This 43-minute film is done in both a humorous and serious tone at the same time, quite a feat. I have no reason to doubt the validity of any of it. As we learn, thousands of years before recorded history beer was discovered quite by accident, when ancient hunter-gatherers likely left some grain in a container, it got wet and sprouted, then got wet enough to ferment. Then, it is speculated, living in homes instead of caves and cultivating grains for beer-making was the spark of inspiration that led eventually to civilization as we know it today. Without beer the great pyramids of Egypt would not have been built. Beer helped keep people alive during the dark ages when water was mostly unsafe to consume. Beer allowed the Pilgrims to make it to the new world. The American revolution was discussed over beer at the tavern, and the new National Anthem borrowed the tune from an old drinking song. It wasn't Henry Ford that popularized assembly lines, it was an automated beer bottle making machine some years earlier. Louis Pasteur wasn't looking for a way to preserve milk, it was preserving beer that got him to discover bacteria and pasteurization. Beer led to modern farming, invention of the wheel, and in more recent times the invention of refrigeration which in turn solved most of the problems associated with preserving foods. And it led to the home refrigerator. Certainly this film was written with a slant towards the proponents of beer and the beer industry, but with the contribution of many experts it makes a great case for the critical role beer played in the evolution of our societies. As a beer drinker myself, I say \"Let's raise a glass of beer to beer.\" I saw this on Netflix streaming video.",
         "While I think the film over-dramatized the impact of beer on world history just a bit, I liked its tongue in cheek style and how they managed to get the viewer to reassess everything they'd always assumed about world history. It gets HUGE kudos for managing to be very creative and like nothing you've probably ever seen before...or since. The thesis of the show is that when primitive man accidentally discovered beer, this discovery shaped civilization. So, to get the grains needed to make the beer, nomadic hunter-gatherers needed to settle down and farm. And, before money was used, the early commerce was fueled by beer--and Egyptian records indicate it was used to pay the workers building the pyramids (this was NOT done by slave labor, by the way, but skilled workers). And, even in modern times inventions like pasteurization and refrigeration were developed FIRST and FOREMOST to fuel the production of beer. The argument is compelling--and I suggest you watch this film to see exactly what this history is. Overall, very funny and clever--and well worth seeing.",
         "This show traces the important role that beer has played in human history from the probable origins of the first beer at the dawn of history to the development of a special beer for use in zero gravity space missions. I suspect some of the claims made in this show exaggerate the importance of beer. Was barley made exclusively for beer and not for bread? I do not know, but it seems a bit odd. Even the theory of how beer was accidentally discovered relies heavily on speculation. But overall, it is pretty decent with real experts explaining things about beer's history that are not well known. Did it \"save\" the world? I do not know. I mean, sure, beer was safer to drink than bacteria-filled water... but clearly other societies thrived besides the Europeans. The world was not \"saved\".",
         "I love this documentary - so much so that when it was taken off of Netflix I bought the DVD. The narration is humorously delivered to you in a matter-of-fact kind of way with a touch of boasting. Nice simple animations and historical re-enactments are inserted among interviews in a delightful way. This is the best \"feel-good-about-beer\" video I have ever seen. I don't think the following is spoiling anything, but I checked the spoiler alert box anyway. The documentary makes some incredible statements. Who could imagine that beer is responsible for the invention of writing, or modern medicine, or refrigeration, or the production line in factories which put an end to child labor! It is reason people stopped wandering and started farming. Beer saved millions of people from death during the plagues. It was even used to pay the people who built the pyramids! This is a great tribute to an amazing drink, and I would like to see many more documentaries made like this one.",
         "First, let me say I enjoyed this series. Highly entertaining and informative for the most part. However, I think the cartoons cheapen the presentation. When a documentary resorts to cartooning it is insulting, i.e., \"The Greeks\" and the new \"Cosmos.\" I am not sure the intoxicating effects were the catalyst for the thirst for more beer. This premise is suspect, that being it was the overriding drive to be intoxicated which gave rise to subsequent technology. And there is no doubt beer led to many important discoveries as well as the foundation for other discoveries. There were other reasons for the taste for beer: It signified wealth and prosperity. Beer became its own currency for a time. Otherwise, I highly enjoyed the series getting past the basic premise of the desire to become light headed...yet that premise in the series remains and as such it is bothersome.",
         "This documentary was really a blast. It presents a seemingly reasonable case for how important beer was in human history. It is also filled with really great dry wit. I also really liked the funny cartoons used to present a lot of the material. I would, however, really like to hear some serious academic criticisms of the theories presented in this film, although I'm pretty sure that the film intended to be a bit over the top about how beer made the modern world. Still, this is one of the best documentaries I have ever seen--it was just so fun to watch. I really can't imagine anyone who wouldn't like watching this. Both entertaining and educational. Really a fun time."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Beyond Productions"],
      "summaries": ["This show traces the important role that beer has played in human history from the probable origins of the first beer at the dawn of history to the development of a special beer for use in zero gravity space missions."],
      "budget": 0
   },
   "movielensId": 158729,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-01-30",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 44,
      "movieId": 158729,
      "title": "How Beer Saved the World",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1832368",
      "originalTitle": "How Beer Saved the World",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "This show traces the important role that beer has played in human history from the probable origins of the first beer at the dawn of history to the development of a special beer for use in zero gravity space missions.",
      "tmdbMovieId": 81765,
      "avgRating": 3.9,
      "releaseYear": "2011",
      "numRatings": 5,
      "posterPath": "/t4Lf8xroxujJPhVTZHuXwRIvzxl.jpg"
   }
}