{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "israel",
            "id": 536
         },
         {
            "name": "palestine",
            "id": 537
         },
         {
            "name": "war crimes",
            "id": 1327
         },
         {
            "name": "middle east conflict",
            "id": 5907
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "israeli palestinian conflict",
            "id": 18286
         }
      ],
      "imdb_id": "tt0807956",
      "video": false,
      "title": "Occupation 101",
      "recommendations": [
         34389,
         24060,
         36678,
         13023,
         44260,
         22906,
         84900,
         64522,
         44258,
         35638,
         258570,
         46725,
         32447,
         41303,
         21153,
         157301,
         26370,
         30856,
         61824,
         130750
      ],
      "backdrop_path": "/i8JSCHOEg03TY6IfekNVsXgfGF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47639251416c7509798b",
               "name": "Abdallah Omeish",
               "profile_path": null,
               "id": 86496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47639251416c75097991",
               "name": "Sufyan Omeish",
               "profile_path": null,
               "id": 86497,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.72337,
      "production_countries": [],
      "id": 18152,
      "vote_count": 11,
      "budget": 0,
      "overview": "A thought-provoking documentary on the current and historical causes of the Israeli-Palestinian conflict and U.S. political involvement.",
      "similar": [
         10661,
         612,
         22972,
         12162,
         1369,
         137113,
         4421,
         9667,
         616,
         374720,
         324786,
         8916,
         252178,
         9952,
         746,
         8885,
         586,
         50601,
         7483,
         279641
      ],
      "original_title": "Occupation 101",
      "runtime": 90,
      "poster_path": "/qGtamNzyC5f5pGMvJWnTmPaU5ez.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-03-25",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Abdallah Omeish",
         "Sufyan Omeish"
      ],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Abdallah Omeish",
         "Sufyan Omeish"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0807956/",
      "coverLink": null,
      "actors": [
         "James Akins",
         "Arik Ascherman",
         "Bishop Barltlett Jr."
      ],
      "reviews": [
         "I saw this film at the deadCENTER Film Festival in Oklahoma City where it won the Feature Documentary Award and I was able to visit with the Writer/Director, Abdullah Omeish. The clean cut well spoken young man could've come off any American college campus. Abdullah has worked on this project for years and the result is a comprehensive study of the current situation in this Middle Eastern hotbed. 'Occupation 101' explores the beginnings of the Israeli-Palestinian conflict; tracing the history through today. The straightforward approach is objective and graphics are used effectively without the classroom feeling. Omeish also makes interesting use of the voluminous archival footage available. To avoid appearing bias no Palestinian Officials were interviewed with all experts being Israeli or Americans. The target audience is the United States, rather than just 'the West', since the Producer feels they are the most in need of an educational background of the conflict. The American Christian-Jewish connection could've been fleshed-out better but one can get the idea for the unqualified support the United States gives Israel. The film is thought provoking and begs questions that don't have any easy answers. The goal of the film is educational and it has succeeded, providing needed insight into the conflict. This is an important film that hopefully will find a wider voice which very well could aid fair & balanced dealings with all involved.",
         "This is best and maybe the only film thats exposes the truth about this conflict. As the film said: \"forget everything you think you know\" The film is a fantastic work, it shows historic facts, stats, interviews with the people who live, interviews with human rights groups, etc. I watch this movie with a lot of people, the feeling when you get to know the truth that the film exposes will make you anger and sad at the same time. Makes you think: \"We must do something\" and \"How can this happen in the 21st and no one do nothing?\" specially if you are an Israeli Jewish. I strongly recommend you to buy this film and watch it and share the information with as much people as you can.",
         "I know this may seem like only one side of the story, but the whole point is that we generally only hear the other side of it. In my opinion, this documentary brings another perspective to people's perception of the conflict between Palestinians and Israelis, and makes it all feel very real. You can't fail to feel the pain of these poor people, unless you're not human. That being said, make sure you DO hear the other side of the story as well, before making your own mind up. You won't get the entire story here. Truly Heartbreaking, but everyone NEEDS to see this.",
         "This is one of those films that will provoke only one reaction from people but in two very different ways. That reaction is shock and whether you're pro-Israel or anti-occupation those reactions can be vastly different. Now I'm sure (at least in the U.S. I can't speak for the rest of the world) this is a place you must tread lightly. Apologists will surely call anyone supporting this film anti-semitic. It's clearly not, though it is anti-Zionist. And, for the record, I hate using the term \"Zionist\" since it's somehow been attached to hate group who use it as a blanket term for ALL Jews. As this is certainly not the case, I'll avoid using the term for practical purposes. This film digs into a lot of issues I've personally wondered about since I was a young teenager and the first Palestinian rebellion began in the early 1990s. Most importantly to me as an American, \"Why do we give Israel so much money to do things we know are wrong?\". This film, although a bit slickly edited for a documentary, does a very good job of obtaining facts and backing them up as well as gathering firsthand accounts from strong sources. The fact that Israelis were willing to go on camera and speak out against what their nation is doing says volumes in support of this film. That fact alone should tell you that questioning Israel's actions is not anti-semitic...it's humanistic. Some might say this is rabidly pro-Palestinian and in a very small way they might be right. There's not a lot of information about what Palestians do in reaction to these crimes, often causing violence themselves. But then again if all you have is a rifle and the other guy has a tank...well...that's like bringing your fists to a gunfight. And anyone who calls this film \"controvertial\" will clearly be trying to rally against it. All it does is collect evidence and testimony for things that are happening and have happened. If Jews and Israelis take offense or don't like it then perhaps they can persuade the state of Israel to stop what it's doing so people cannot portray them as war mongers. And trust me, living in the United States we know a thing or two about war mongering.",
         "This movie shows why president Jimmy Carter called his book 'Palestine, not Apartheid'. It shows the terrible conditions in which the Palestinians live and the Israeli policies that make these conditions possible. The most interesting aspect of the movie is how it exposes the absolute biased and twisted picture that has been painted of the conflict in the media. The media has somehow managed to convince the world that the Israelis are craving for peace and that Arabs are a bunch of anti-semitic terrorists. I'm convinced that many people (not me, as I am pretty well informed on the subject) will be absolutely stunned to learn that what they have been told for decades now is a farce. The movie describes Israel as a state which acts out policies that are extremely racist, reminiscent of South Africa and segregated USA, bent on destroying a civilization and wiping out any trace of Arab Palestine. The movie also describes the roots of the conflict, beginning with the rise of European Zionism. The movie is very well made, plus it has Noam Chomsky in it, which in itself is a good enough reason to watch the movie.",
         "In hindsight, when analyzing oppression we generally come to the conclusion that the side of the oppressed should be advocated. In South Africa, for instance, there was of course violence from the oppressed party, and no one was praising that, but doesn't the incredible violence and ethnic cleansing from the apartheid government deserve far more attention? The view that there are viable and arguable sides to this situation is like saying that there are valid sides to apartheid. Am I biased towards the side of the Africans during the oppression? Of course This documentary is an accurate portrayal of Palestinian life. I spent a month in the West Bank and Israel, and every single Palestinian is affected by the occupation. I talked to a family who left their house for 2 days only to come back and find a Jewish family living in it, leaving them homeless. People tell themselves that there must be another side to the story because they are aren't aware of the magnitude of the oppression. This film indeed should have involved more ordinary or affected Isrealis, because it would only expose further the inequality and one-sidedness of the conflict, paid for by US tax dollars. It is impossible to see this heartbreaking documentary and come away still believing that Isreal is the victim in the crisis. It is poignant and accurate, and helps to relieve the public ignorance which blinds us to the gross political oppression of an apartheid state, brought to you by the USA",
         "I've been interested in the situation in the Middle East for years. It started when I read a book by a dutch parliamentarian/writer on Gaza. I thought it was probably not true. I didn't believe the situation could be that bad. Well, I was wrong as I learned from years of reading books on the subject and following the news via newspapers and internet. So there's not much surprising for me in this documentary. It depicts life for Palestinians in the Westbank and Gaza. Which is far from a normal life because they live and have lived for decades under occupation. It's a pretty miserable life too. Land taken away, bypass roads on which Palestinians are not allowed to drive, numerous checkpoints and constant land-confiscations. This documentary shows it all from, it has to be said, a strictly Palestinian/Arab point of view. In that sense it is easy for Pro-Israeli's to dismiss this documentary because it's not balanced. Still, I think everyone even a little bit interested in the subject should watch this. It just might give you a new perspective on one of the most hotly contested areas in the world.",
         "I watched tens of films on the Palestinian cause and I Can tell you this is the best ever produced documentary about the sufferings of the Palestinians since 1948 and the continuous crimes of the Zionists and their illegal state, Iseal. The documentary is well-cited and supported with statistics and numbers whenever available. The powerful part though, I believe, is the comparison between the Palestinian struggle and the South African struggle against Apartheid. If you haven't watched this you HAVE TO! If you already did then make sure you buy your own copy from www.occupation101.com and show it to your friends, family, neighbours, colleagues. Arrange public showings in your local community centre, in your school, university, café. The whole world must watch this one to understand that the key to peace in the world is no where but in Palestine which should go back to its people, Palestinians.",
         "All we ever read, and watch and hear are the bombarding from our media, telling us what to believe, spoon fed how we should feel. It's very refreshing to now know and see the two sides. This documentary has backed up its statistical data with references as evidence, and the opinions expressed are not biased, you would think it would be Palestine's points of views only, but surprisingly they are the voices of Israelis, they are the voices of soldiers, politicians,Jews and Christians etc. I cried, and felt the suffering, I cannot fathom what people under occupation must go through on a daily basis because I have never experienced it, but watching this documentary gave me the insight that I needed. And I will no longer be narrow minded, judgemental, or have tunnel vision. No matter what race or religion, we are all brothers and sisters. The change starts from within ourselves and I for one am changed from this moment. I recommend this documentary and hope it opens the eyes and hearts of others, as it has mine.",
         "Answer for the previous review:\"3 years later we have no peace, the Palestinians are mostly \"occupied\" by themselves and by the Hamas which still controls Gaza strip, more than 5000 Mortar bombs and 300 \"Kasam\" missiles has been fallen into Israel, many people has been died and many more been injured\". It is result of occupation. Children, of those killed parents are growing. What you was expecting??? I cried when I watched this movie. Not only because of injustice. Because of indifference of the world.",
         "There is no doubt that this is a one-sided movie. If you love Israel, this will be a very difficult film to watch, and you'll probably be highly critical. But if you're interested in understanding the Israeli-Palestinian conflict, this is best and most digestible account of the Palestinian perspective. Don't take everything in this movie at face value. There's plenty of pandering to your heart, crying mothers, and upset children. But it is well researched, with a good account of the history of the conflict, and it eloquently explains many of the hot button issues for the Palestinian man on the street.. life under occupation, religious discrimination, US support for Israel, Gaza, and checkpoints. After watching this, you'll understand better why a small minority turn to violence, and you'll have much more admiration for the large majority of Palestinians who've suffered and protested peacefully their lack of rights through 40 years of military occupation. The movie is now a few years old, but it's still relevant. I highly recommend this movie. It can be found online.",
         "This documentary is a frank and honest presentation of the facts of the Isralie-Palestinian conflict and the ongoing and distorted support of the American taxpayer ... though I am certain 99% of American taxpayers have no idea how much money is really going to Israel as America is the main support, both monetarily and militarily (money and weapons), for Israel. Watch it, pass it along to others ... there aren't many documentaries that tell the whole story of this ongoing problem and everyone should know the truth. \"The truth shall set you free\" -- hopefully, the truth in this film will help set the Palestinian people free.",
         "The label Documentary, even in these post modern times, implies objectivity. Unfortunately this is something lacking here. It would wrong to say the film is Pro-Palestian, since it attacks President Yassir Arafat and the members of Fatah as incompetent, corrupt and collaborators. Instead it backs, the militant platform. The peace process is explicitly portrayed as a trick by the Israelis to continue occupation and it is implied Palestians who talked to them, were motivated by greed. As propaganda it also lacks power. I watched it with students, apart from those ideologically committed, they expressed incredulity. A political science student said \"it's propaganda isn't it\". The paradox is, a touch of objectivity adds power to partisan films. The Battle of Algeris is all the more compelling, because, the French paratroops, are human beings. Israeli soldiers are portrayed here as in WWI tabloid cartoons Kaiser's army was, killing children, women and defenceless men, for little reason. However indiscriminate killing is justified, when committed by Palestinian militants: the longest single segment in the film, is devoted to portraying suicide-bombing as the only defence against a merciless foe. Struggles in Ireland, South-Africa and India are used as supporting parallels. Expressly the words, the apartheid government used in the Rivevoina trial to frame Nelson Mandela, are taken to be blessing on terrorism. To sum-up Nobel peace prize winners Rabin,Peres and Arrafat are painted as collaborators in oppression and café, bus and restaurant bombings are elevated to a needed, even laudable noble action.",
         "Everyone knows that each story has two sides which this movie lack off is The ability to show the other side story; If it's the Israeli side, interview the settlers, talk to the soldiers, even some government personals it compensate in showing \"victim\" stories again and again. as an Israeli it's hurting me the same to see mother that lost her son no matter her nationality and her religious she believes in. In august 2005 Israel begin \"unilateral disengagement plan\" to evict all Israelis from the Gaza Strip and from four settlements in the northern West Bank. Those days we all believed that it will bring some peace and quiet to the region and we see no alternative for any real partner in peace \"Road-map\" negotiations . 3 years later we have no peace, the Palestinians are mostly \"occupied\" by themselves and by the Hamas which still controls Gaza strip, more than 5000 Mortar bombs and 300 \"Kasam\" missiles has been fallen into Israel, many people has been died and many more been injured .there is no \"occupation\" from the Israeli side. All the territory is in Palestinian hands ONLY. I don't want to imagine what would happen when Israel pull back from all the west bank. It can become much more unstable for us to live here. To call this film a Documentary is an insult to the film industry. Free \"Gilad Shalit\"",
         "Interesting story line that validates what Palestinians and Muslims want the world to believe. It does include facts, but they are one-sided. This issue is one many Muslims want to dominate the news for their intent on Islam being a SUPREME religion, the only TRUE, religion is substantiated herein. Judaism is has as much a right to survive as do the Palestinian Muslims but when one considers the population of each religion and how much territory is \"owned\" by each, this becomes another issue. The world must see that. Jews cannot take another era of Anti-Semitism and killing of their people, by any peoples. This is not a unique position. Either we rid ourselves of all religions, or we will end up with a World War based on one group of people. Additionally, I don't want to be led by religion as much as I want to be an American with a right to choose a religion, or not. Some of us know there is more to the story.",
         "I saw this movie and have a firm opinion. The second intifada was ignited by fake and fraudulent footage on killing of Mahamad Drury by Israel soldier created by France TV. later analysis clearly showed that the France TV Channel intentionally fabricated the footage an the boy was killed by palestinian sniper. Fabrication of fake scenes to portrait Israel aggressor is a wide accepted practice. Western journalists and operators have been done this for decades; in the second intifada they had agreement with Arafat to fabricate anti-Israel news; in Lebanon war the worked for Hezbollar; in Gaza war - for Hamas. This is one more fabricated \"reality\" that fully contradict to the truth."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "'Occupation 101' presents a comprehensive analysis of the facts and hidden truths surrounding the Israeli-Palestinian conflict and dispels many of its long-perceived myths and misconceptions. The film also details life under Israeli military rule, the role of the United States in the conflict, and the major obstacles that stand in the way of a lasting and viable peace. Unlike any other film produced on the conflict, 'Occupation 101' explains the complicated reality with precision storytelling through a series of highly stylized visual edits, and gives audiences a complete context with which to better understand the Israeli-Palestinian debate. The roots of the conflict are explained with thought-provoking commentaries from leading Middle East scholars, peace activists, journalists, religious leaders and humanitarian workers whose voices have too often been suppressed in American media outlets.",
         "A thought-provoking and powerful documentary film on the current and historical root causes of the Israeli-Palestinian conflict and U.S. political involvement."
      ],
      "budget": 0
   },
   "movielensId": 158743,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-03-25",
      "dvdReleaseDate": null,
      "directors": [
         "Abdallah Omeish",
         "Sufyan Omeish"
      ],
      "runtime": 90,
      "movieId": 158743,
      "title": "Occupation 101",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0807956",
      "originalTitle": "Occupation 101",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["GuoKwAHmJo4"],
      "plotSummary": "A thought-provoking documentary on the current and historical causes of the Israeli-Palestinian conflict and U.S. political involvement.",
      "tmdbMovieId": 18152,
      "avgRating": 4,
      "releaseYear": "2006",
      "numRatings": 3,
      "posterPath": "/qGtamNzyC5f5pGMvJWnTmPaU5ez.jpg"
   }
}