{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "romantic comedy",
            "id": 9799
         },
         {
            "name": "inheritance",
            "id": 10911
         },
         {
            "name": "opposites attract",
            "id": 165301
         },
         {
            "name": "home renovation",
            "id": 182804
         }
      ],
      "imdb_id": "tt4460176",
      "video": false,
      "title": "All of My Heart",
      "recommendations": [
         505723,
         396393,
         289523,
         258691,
         387398,
         363479,
         427045,
         410317,
         478210,
         377431,
         315134,
         407171,
         415962,
         412974,
         437515,
         393659,
         416251,
         411081,
         421620,
         377428
      ],
      "backdrop_path": "/qBZswxe7zqHEhfZXVHdlwjwSh7H.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "54b2738492514107e0002ecc",
               "name": "Lacey Chabert",
               "profile_path": "/s4gEejBUkJPwdSezGlIpFXeidKD.jpg",
               "id": 22082,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Brian",
               "gender": 2,
               "credit_id": "54b27392c3a368093900473f",
               "name": "Brennan Elliott",
               "profile_path": "/7Wilyo6uHlKK4IiD3HkzJriVEaZ.jpg",
               "id": 43458,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Vern",
               "gender": 2,
               "credit_id": "54b2739f92514107e0002ed5",
               "name": "Ed Asner",
               "profile_path": "/nUnDLli9zmGQu6UCEU3G4FUdYqQ.jpg",
               "id": 68812,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Daryl",
               "gender": 2,
               "credit_id": "54b273b1c3a36820a700114b",
               "name": "Greyston Holt",
               "profile_path": "/eEhcGNOWFFFVZpAQU5fuuPeOeeZ.jpg",
               "id": 206405,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "54b273bf925141746c003d95",
               "name": "Daniel Cudmore",
               "profile_path": "/bNVyweJ6lq78vaWpYcYMjnGFrZc.jpg",
               "id": 84222,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Casey",
               "gender": 1,
               "credit_id": "54b273cd9251417479003dfe",
               "name": "Heather Doerksen",
               "profile_path": "/nIF1GLQ2WPGS5pdogVGhOm2nYmh.jpg",
               "id": 83423,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Chef Oliver",
               "gender": 2,
               "credit_id": "54f780f09251416ee4002441",
               "name": "Paul McGillion",
               "profile_path": "/n6S66CIpNqThe6eugr94WZBbI6u.jpg",
               "id": 26069,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Harry",
               "gender": 2,
               "credit_id": "54f78152c3a3683520002419",
               "name": "Patrick Sabongui",
               "profile_path": "/aEJ7963PHcFLBrXE0qJdS5GfU2L.jpg",
               "id": 102742,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Rusty",
               "gender": 0,
               "credit_id": "5a3bcba70e0a264cca220c8d",
               "name": "Drew Tanner",
               "profile_path": "/5EduYLcI49AvZjVKZcTivV6Dw33.jpg",
               "id": 1475818,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54b2735fc3a36809510041c3",
               "name": "Peter DeLuise",
               "profile_path": "/78lmcrrIPEJ4WrlGBRzVpqXq7J2.jpg",
               "id": 118463,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54f781cf9251416f6e0026eb",
               "name": "Peter DeLuise",
               "profile_path": "/78lmcrrIPEJ4WrlGBRzVpqXq7J2.jpg",
               "id": 118463,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54f781e492514151c6003044",
               "name": "Harvey Kahn",
               "profile_path": null,
               "id": 32733,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54f7825ac3a3683520002431",
               "name": "Karen Berger",
               "profile_path": null,
               "id": 1435021,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 2.521734,
      "production_countries": [],
      "id": 317121,
      "vote_count": 20,
      "budget": 0,
      "overview": "A young caterer’s life suddenly changes course when she inherits a country home and learns she must share it with a career obsessed Wall Street trader. At first, these opposites do not attract, but feelings begin to change when they find themselves having to work side-by-side to restore their newly acquired home.",
      "similar": [
         20943,
         4951,
         9029,
         2788,
         1581,
         1824,
         4348,
         9655,
         2642,
         8488,
         544,
         284,
         509,
         114150,
         8065,
         564,
         947,
         209244,
         10112,
         10681
      ],
      "original_title": "All of My Heart",
      "runtime": 81,
      "poster_path": "/kvGliHAzawhZtO1aexLl16oz7o6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Hallmark Channel",
         "id": 6425,
         "origin_country": ""
      }],
      "release_date": "2015-02-14",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "All of My Heart Collection",
         "id": 480160,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.hallmarkchannel.com/all-of-my-heart",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter DeLuise"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Karen Berger"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4460176/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYzE4ZDFmYWEtNzVkNi00Mjc5LTk0ZWItYWFjOTAzZmJkYjc5XkEyXkFqcGdeQXVyNjg5MzE4NTA@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Lacey Chabert",
         "Brennan Elliott",
         "Edward Asner"
      ],
      "reviews": [
         "Really enjoyed the wholesome and family friendly romance. I like the leading couple together. Hallmark should put them in more of their movies as a couple. Lacey Chabert and Brennan Elliot stood out in the sea of Hallmark movies I've been watching. I just loved how their chemistry flowed well. And I really liked the whole cast. They really made me feel like it's a small town with good people. And the comedy was just what I like. I think it's called situational. I also liked Daniel Cudmore and Heather Doerksen in their roles. Their supporting roles really helped the story. Edward Asner was a charming grumpy old man.",
         "Brennan Elliott is HOT...love him in this with Lacey. Great chemistry together! Brennan out-acted her but still very good. He should be a huge star with his looks, acting ability and terrific comedic timing. Perfection. There are a few small issues. SPOILER if you haven't seen it. Don't go further. I didn't like the ending and Lacey's character at end...Corny dialogue. Lacey seemed cautious to kiss him in the film. She just didn't seem comfortable. Her body language when he did kiss her was kind of pushing or holding him back with her arms in between the two. It's acting! Some mistakes with editing. Once where Brian is going into general store, they used someone else in a completely different coat! Lol. The music placement after their candlelit dinner, it goes from 1 song into another and it was cut off abruptly. Just my thoughts but overall, a very good movie. In fact, my favorite Hallmark of all time. I only hope Hallmark does a series or at least a follow up movie. I'd like to see a wedding, how he handles going back to NYC- will he work on a contract basis from home or will he run Jenny's new line of pastries? I'd also like to see Harry and Casey get together...or Casey and Tommy from Grberal store. Rocky was pretty funny too.",
         "Anyone out there see the close resemblance of Mr. Crudmore to New York Governor Andrew Cuomo? There were some scenes when I actually thought I was seeing the governor of New York. In typical Hallmark fashion, two people are brought together by fate when they each inherit the same house. The Wall Street guy and the female chef take it slow as they gradually fall in love despite their rocky beginning. She wants to convert the house to a bed and breakfast and he can't wait to sell his part. Naturally, she had a love interest who was career obsessed and naturally he will return to create a chasm between the two when our Wall Street guy thinks that she is back with the other guy. Ed Asner sits at the General Store muttering about ducks,but his purpose in the film becomes all too clear at film's end. Light fanfare and excuse the pun, great to the taste.",
         "Aspiring chef Jenny (Lacey Chabert) inherits half of a country house. Yes, that's right -- half. The other half goes to Wall Street stock trader Brian (Brennan Elliott). Brian wants to sell the house and Jenny has plans to renovate it and turn it into a bed & breakfast. But when Brian loses his job, he has nowhere else to go so he moves in with Jenny and helps her fix the place up. The usual \"duck out of water\" and \"opposites attract\" tropes follow. I always find Lacey Chabert enjoyable to watch. She's easy on the eyes and has a likable personality that makes you root for her. This movie is no exception. Brennan Elliott is fun and has good chemistry with Lacey. The supporting cast is nice. Ed Asner only appears here and there but steals the scene every time he's around. Daniel Cudmore as Tommy and Drew Tanner as Rusty are both good. In a way, this movie's strengths lie in its male characters instead of its female ones. That's a rarity for these things. This is a decent TV movie of its type and I'm usually generous with my scores for movies like this. But there are problems that bugged me. For one thing, it's very predictable even for a genre that's predictable by its nature. Also the movie falters in the second half badly. At about the midway point the story had moved along at such a pace that only two options were likely: they would either get the couple together sooner than expected or they would find a way to split them up and tediously drag things out until the inevitable reunion. Guess which route they went?",
         "A sweet, small and unpretentious Hallmark TV movie much like the star Lacey Chabert herself. It's a very traditional romantic movie cute meet: newly single girl Jenny Fintley (Ms. Chabert) yearning for the country meets too busy for romance man Brian Howell (Brennan Elliott) who loves the city. The plot revolves around the two's different plans for a house which they have unexpectedly inherited but it's really just an excuse to put the two actors into a room together and see what happens. There's some nice chemistry between Ms. Chabert and Mr. Elliot with Ed Asner (as Vern) on screen now and then to steal a scene. There are no surprises in this kind of movie but so what? It's sweet, it's light, it's unpretentious and it's enjoyable. I will add that the baby goats are a bit too much on the sweet side but overall: 7 out of 10.",
         "Interesting, but far-fetched idea...a stretch of the imagination here in this script, but cute girl in this movie always does it for me. I'm a sucker for them. I like the movie, even though Hallmark can be quite predictable with their choices. I think they can mix it up a bit more though, bringing more unpredictable love endings. I won't stop watching Hallmark movies just because they are predominantly predictable. Most people like happy endings, and I'm no exception to that desire. Regardless, thank you Hallmark Channel!",
         "First Off, I'm a HUUUUGGE Fan of Brennan Elliot. I can't believe he hasn't been in more movies!! Hot, SWEET, AND Sexy! Like someone else here wrote, \"he outacted Lacey\" -I'd say he was actually a great compliment to Lacey. They both have awesome screen chemistry. I just saw that Hallmark came out with a sequel to this: All of My Heart: Inn Love (2017). How did I not see this???? My goal is to just buy the DVD of it along with the first one. Lacey and Brennan shine in All of my heart, as they experience the ups and downs of taking ownership of a house that was left to them after the owner died. The home has a charm that Lacey loves, and she sees potential in fixing it up, and making it a B&B. Brennan is a big city professional who doesn't have the time or patience for a place like this. They go thru things breaking left and right, and then experiencing sweet little victories when things start to get better. Watching them grow closer together on screen was amazing!!! Soooo Believable. (I know, I need a life...I'm way too into this movie). By the end, you'll be sniffling happy tears when they become the proud parents of Gabby Goats \"kids\" ~it's just TOO GOOD to pass up! A+++ Hallmark. I can't stand when Hallmark has to insult my intelligence by spelling out e v e r y little emotion. Seems to me if the actors have any merit, as well as the screenwriters, all should be able to follow and read in between the lines. No saccharine sweet garbage here. Just a light, happy ending movie with awesome actors and pretty locations.",
         "This movie is a traditional Hallmark romance and from as much as I watched, it appeared to hit all the expected plot points. However, the poor choices made by production location scouts and final editor caused me to lose interest in the story and change the channel, FAST. **SPOILER ALERT*** Since this movie was filmed in VANCOUVER CANADA, why wasn't the scriptwriter's original location choice changed from the very specific BUCKS COUNTY, PA, USA to a fictitious named Main Street type place that could be located anywhere? An example of a movie filmed in Bucks County? Signs (2002).",
         "It's quite delightful to see how chef Jenny played by Lacey Chabert fixes up a house she inherits into a B&B and bakes pastries and sells them. She inherits the house 50/50 with a Wall Street guy. Of course a romance develops. Lacey Chabert acts well - not too perky and quite sympathetic. Brennan Elliot is funny as the Wall Street guy Brian who gets laid off and turns to fixing up the B&B. At first he seemed a bit old for Lacey Chabert but the dialog is so snappy it doesn't matter. Greyston Holt as her boyfriend who who put his career first looks a bit out of place as an executive. Liked the comic tone throughout and the supporting characters are funny too. Hope Brian doesn't have to give up his Wall Street job totally - what happens if nobody comes to the B&B?",
         "I love Hallmark movies... This one is really cute... I did a lot of awing and awing in this one.., I loved the music in this one... I wonder if there is any way to find the songs in this... I think the music helps make the movie and this music fit the movie perfectly... Like most of the Hallmark movies... I love it! The main characters are two of my favorites... Lacey Chabert and Brennan Elliott have been very popular on Hallmark lately... I would like to see more movies with them together... This will definitely be one I will want to buy... to add to my growing Hallmark collection... I like movies that make me happy, are pleasant to watch, and hate to see it end... this one was all that... I think it is scheduled to show again in September... I will for sure be watching again..."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Hallmark Channel, The",
         "Better Road Productions",
         "Front Street Pictures"
      ],
      "summaries": [
         "A young caterer's life suddenly changes course when she inherits a country home and learns she must share it with a career-obsessed Wall Street trader. At first, these opposites do not attract, but feelings begin to change when they find themselves having to work side-by-side to restore their newly acquired home.",
         "After inheriting half of a house, a young woman develops an unexpected friendship with her co-owner."
      ],
      "budget": 0
   },
   "movielensId": 158827,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-02-14",
      "dvdReleaseDate": null,
      "directors": ["Peter DeLuise"],
      "runtime": 81,
      "movieId": 158827,
      "title": "All of My Heart",
      "mpaa": "",
      "actors": [
         "Lacey Chabert",
         "Brennan Elliott",
         "Ed Asner",
         "Greyston Holt",
         "Daniel Cudmore",
         "Heather Doerksen",
         "Paul McGillion",
         "Patrick Sabongui",
         "Drew Tanner"
      ],
      "imdbMovieId": "4460176",
      "originalTitle": "All of My Heart",
      "genres": [
         "Romance",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["PkRAkkjd6sA"],
      "plotSummary": "A young caterer’s life suddenly changes course when she inherits a country home and learns she must share it with a career obsessed Wall Street trader. At first, these opposites do not attract, but feelings begin to change when they find themselves having to work side-by-side to restore their newly acquired home.",
      "tmdbMovieId": 317121,
      "avgRating": 4,
      "releaseYear": "2015",
      "numRatings": 6,
      "posterPath": "/kvGliHAzawhZtO1aexLl16oz7o6.jpg"
   }
}