{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hunting",
         "id": 33688
      }],
      "imdb_id": "tt1285125",
      "video": false,
      "title": "Louis Theroux's African Hunting Holiday",
      "recommendations": [
         241620,
         86522,
         210250,
         182979,
         241618,
         238997,
         112722,
         68213,
         241619,
         265945,
         143481,
         68208,
         68363,
         115189,
         397674,
         63581,
         171711,
         206953,
         334534
      ],
      "backdrop_path": "/rdtuC9gPPINy0ezoImtEQxB0pHi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 2,
            "credit_id": "52fe4b099251416c750f6395",
            "name": "Louis Theroux",
            "profile_path": "/nFW75gibtOMzIJtM6cWMRlR6oXW.jpg",
            "id": 219396,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b099251416c750f6391",
               "name": "Paddy Wivell",
               "profile_path": null,
               "id": 1119073,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5736a583c3a3687e1d00226e",
               "name": "Louis Theroux",
               "profile_path": "/nFW75gibtOMzIJtM6cWMRlR6oXW.jpg",
               "id": 219396,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.849244,
      "production_countries": [
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 143431,
      "vote_count": 12,
      "budget": 0,
      "overview": "Louis goes to South Africa where American tourists pay to hunt wild animals in privately owned reserves.",
      "similar": [
         376623,
         376607,
         376612,
         376605,
         7484,
         7840,
         34851,
         199373,
         77663,
         11069,
         10948,
         10010,
         103663,
         9378,
         284289,
         11298,
         1712,
         11826,
         425942,
         46146
      ],
      "original_title": "Louis Theroux's African Hunting Holiday",
      "runtime": 58,
      "poster_path": "/ekIEKxGLHxG1m3sfBV4f7KSQwlJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "BBC",
         "id": 5996,
         "origin_country": ""
      }],
      "release_date": "2008-04-06",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.bbc.co.uk/programmes/b009sj0c",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paddy Wivell"],
      "runtime": 58,
      "synopsis": null,
      "writers": ["Louis Theroux"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1285125/",
      "coverLink": null,
      "actors": ["Louis Theroux"],
      "reviews": [
         "Louis Theroux takes on a complicated topic--African game safaris. In many ways, it's obvious he finds these hunting reserves to be distasteful and perhaps wrong. But, on the other hand, the show does discuss the very positive benefits from such preserves. After all, if these private hunting parks didn't exist, many species of African animals would become extinct. Plus, while it's ugly seeing these animals die, their death is probably more human that the way that our farm animals are slaughtered. I appreciate how the lack of clarity is shown in the program and I think Louis summed it up when he said he would eat the meat but couldn't bring himself to kill one of the animals himself. Because of this, the show isn't one that looks to confirm either extreme--that killing these wild animals is GOOD or that hunting in general is EVIL. Well done, though I did agree with the final interview--Louis did often let his culture and emotion control the interview process. Thought-provoking.",
         "Yo, over enthusiatic anti-captive hunting reviewers, there was NO WAY that anyone can watch this show and not be against stupid captive hunting. And that's exactly what Louis portrayed. He looked physically ill most of the show, and at no point did he not push people to explain why they would do such a cruel and useless thing. Just because he didn't do a hard hitting documentary as you wish, doesn't make it a problem. He wasn't trying to show facts and figures like you want, he just did a great job of showing the ignorance and insensitivity of the participants. When he asked some of them what their limits were, and they had NONE - that gets the point across pretty well. Go watch it again, and try to figure out your allies better next time.",
         "CONSTRUCTIVE CRITICISM FOR LOUIS THEROUX Dear Louis , I watched your program \" African Hunting Holiday\" on BBC Knowledge channel on South African TV on the 13 January, 2009 at 9.30p.m. You certainly caught the atmosphere of canned hunting very well, but it became apparent that you were unprepared for the pro-hunting arguments, none of which bear intelligent analysis. There is a good expose of the hunting arguments in Mathew Sculley's book Dominion and also on our website. We find it a common failing among wildlife documentary film makers that they do not do their homework on this complex issue, leaving the the canned hunting industry free to make propaganda claims which are left unchallenged. For example: Claim: the captive breeders are boosting numbers of wild animals, so they must be conservationists. Answer: once you remove the animals from their natural environment and place them into factory farms or fenced camps, to breed living targets, what you have is a straightforward commercial operation. Wild animals are now no longer wild - they have become alternative livestock being farmed. Being proud of boosting the numbers of these miserable prisoners is as absurd as boasting about our huge prison population, and claiming that it proves we are a healthy society. Virtually all animals shot on one of the 9000 'game' farms in SA are captive bred. They are all bred in fenced camps free from natural predators; given supplementary feeding and subjected to active breeding management, such as the culling of 'surplus' members of family groups. Having turned wild animals into livestock being bred for the bullet, hunters now regard themselves as exempt from the laws against cruelty to livestock set out in the Animals Protection Act of 1962. Claim: Give it a value and it will be preserved ie the only way to save African wildlife is to systematically hunt it. Answer: That is as absurd as arguing that it is only whaling which will save the whales. This false argument was made several times and you never once challenged it. Indeed in your closing narration, you actually endorsed this nonsense! Claim: Hunting is kinder than the slaughter of livestock at abattoirs. Answer: Really! Do hunters seriously contend that farmers should be allowed, out of tender concern for the welfare of their animals, to ambush their sheep and cattle with bow and arrow from hides placed next to water holes. The infliction of pain and death for fun on unoffending animals is, as the hunters themselves concede, offensive to 98% of the population. Yet you never spelled out why. Fair Chase: there is no fair chase because these animals are drawn to the only water hole available and the food that is put out for them. The 'hunter' sits in a vehicle or a hide. Even when the animal is shot he does not even do the follow up to see what injuries he has inflicted on the unfortunate animal. Some black menial worker does it for him. How colonial! Shooting from the back of a vehicle or from a hide is not hunting. You could have asked why they call themselves hunters, when they are so lazy and un-sporting that they have to sit in a hide by a waterhole, or a vehicle, rather than walking through the bush and stalking an animal. 4. As far as the feelings of animals go, your program allowed the hunters to portray the animals as cardboard beings who have no 'human' feelings; mere Cartesian machines who wander around eating grass without emotions. That is far from true. We ran a wildlife centre for 7 years and if you are interested we can tell you amazing stories of the feelings of the wild animals we treated. Your dog shows feelings and emotions, why should the 'wild' antelope be any different? To permit hunters to portray them as unfeeling, without challenge, does not do justice to their suffering, not just that of the victim but also that of the bereaved family members. 6. As far as the meat from the animals is concerned, we know of hunting farms that bury the meat from these poor animals. It is far too much trouble and expense to freeze or deliver the meat to poor neighbourhoods. 7. All sport hunting is intrinsically cruel, not Christian, not Islamic, not Buddhist and in our view illegal under the Animals Protection Act . You could have quoted to the hunters eg a statement from the Koran such as: \"a kindness to an animal will be judged in Heaven the same as a kindness to another human being,\" and then asked for their comment. You could have exposed the fact that not one of those hunters ever thinks about the legal, ethical and moral issue of shooting an animal that has done no harm. Of course, by not shooting the poor unsuspecting baby warthog at the end, you did by implication raise the moral issue, but in a rather weak way. Had you prepared the counter-arguments beforehand, you would have come across much stronger in your ethical beliefs, rather than leaving an impression of an indecisive wimp struggling to get in touch with his predatory instincts. Having showed the six year old girl being coached into killing a poor warthog with a crossbow, and then a wavering urban American lady killing an impala the same way, you laid the foundation for a compelling moral argument which you then conspicuously failed to make. The end result is a program that actually promotes and endorses canned hunting. I look forward to hearing from you. Kind regards Chris Mercer & Beverley Pervan Campaign against Canned Hunting PO Box 356 Wilderness 6560 South Africa"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "Louis visits several privately owned reserves in South Africa where American tourists pay to hunt wild animals. He talks to an American couple of which the husband considers the hunting trip a dream and to the owners of the reserves who explain Louis that some species would be already extinct if it wasn't for the game reserves. Louis also accompanies some hunters and considers trying to kill an animal himself. He also wonders if it's not a rather artificial hunt, considering the animals are in a, very large, cage and the holiday hunters are being driven to the place where the animals can be found.",
         "Louis goes to South Africa where American tourists pay to hunt wild animals in privately owned reserves."
      ],
      "budget": 0
   },
   "movielensId": 158862,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-02-10",
      "dvdReleaseDate": null,
      "directors": ["Paddy Wivell"],
      "runtime": 58,
      "movieId": 158862,
      "title": "Louis Theroux's African Hunting Holiday",
      "mpaa": null,
      "actors": ["Louis Theroux"],
      "imdbMovieId": "1285125",
      "originalTitle": "Louis Theroux's African Hunting Holiday",
      "genres": [
         "TV Movie",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Louis goes to South Africa where American tourists pay to hunt wild animals in privately owned reserves.",
      "tmdbMovieId": 143431,
      "avgRating": 3.66667,
      "releaseYear": "2008",
      "numRatings": 6,
      "posterPath": "/ekIEKxGLHxG1m3sfBV4f7KSQwlJ.jpg"
   }
}