{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cinderella",
            "id": 995
         },
         {
            "name": "rich woman poor man",
            "id": 7579
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "modern fairy tale",
            "id": 221039
         }
      ],
      "imdb_id": "tt4087916",
      "video": false,
      "title": "Midnight Masquerade",
      "recommendations": [
         299590,
         139251,
         173557,
         374609,
         310972,
         366631,
         317114,
         317121,
         346489
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Elyse Samford",
               "gender": 1,
               "credit_id": "5401f871c3a368436300345f",
               "name": "Autumn Reeser",
               "profile_path": "/vZlZQkQzQ0PSCnQT77vqEFnYsoO.jpg",
               "id": 74607,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Rob Carelli",
               "gender": 2,
               "credit_id": "5401f88dc3a3687d50001908",
               "name": "Christopher Russell",
               "profile_path": "/6lqQsR2Ot7nYthCGxfKBzmPzyV3.jpg",
               "id": 151975,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Howard",
               "gender": 0,
               "credit_id": "5401f8cec3a3687d5000190e",
               "name": "Richard Burgi",
               "profile_path": "/jkJ7KeqGlpEcIxyIHHg0dVu4L8Y.jpg",
               "id": 25849,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Emmett Higgins",
               "gender": 2,
               "credit_id": "54465479c3a3683e0500a86e",
               "name": "Damon Runyan",
               "profile_path": "/pUHENtNwkTd2E5OB5PCqsMUwlUe.jpg",
               "id": 1376330,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "5401f8b4c3a3687d5000190c",
               "name": "Helen Colliander",
               "profile_path": "/2TGs5WHbpbHCVQV4BtMPpzjctj3.jpg",
               "id": 1128316,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Carter Higgins",
               "gender": 2,
               "credit_id": "5401f8a7c3a3684363003464",
               "name": "Chris Gillett",
               "profile_path": "/yDdYDBWPoQUeczVuIkzWfmIJRZA.jpg",
               "id": 181028,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Merry",
               "gender": 1,
               "credit_id": "544654a5c3a368277b002244",
               "name": "Kim Roberts",
               "profile_path": "/buXKE9uKIjT4u0TZXv32zgqDCOR.jpg",
               "id": 2676,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Helen",
               "gender": 1,
               "credit_id": "544654b90e0a26633a00acd5",
               "name": "Shauna Macdonald",
               "profile_path": "/v4IOvElfplTjcRmeQdHvBmvoCwn.jpg",
               "id": 57574,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5401f9c60e0a2658e2005310",
               "name": "Howard Braunstein",
               "profile_path": null,
               "id": 144599,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5401f9e40e0a2658e900514d",
               "name": "Jonathan Baruch",
               "profile_path": null,
               "id": 1077655,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5401f9f20e0a2658e9005152",
               "name": "Patricia Resnick",
               "profile_path": null,
               "id": 133489,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "5401fa5c0e0a2658d80050fa",
               "name": "Steve Solomos",
               "profile_path": null,
               "id": 963748,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5401f9af0e0a2658db005173",
               "name": "Graeme Campbell",
               "profile_path": null,
               "id": 90365,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5401f9d40e0a2658e9005146",
               "name": "Deborah Marks",
               "profile_path": null,
               "id": 1358518,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Romance",
         "id": 10749
      }],
      "popularity": 2.345436,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 289523,
      "vote_count": 9,
      "budget": 0,
      "overview": "Young businesswoman Elyse Samford's life takes a turn when she inherits Samford Candy, a multi-billion dollar corporation, from her retired father. A trademark infringement lawsuit against a rival company brings Elyse to Higgins Attorneys and Sons, where Rob Carelli, a young, too-nice-for-his-own-good lawyer, is bullied by his boss, firm founder Carter Higgins, and his two arrogant sons. Despite his workplace woes, Rob becomes instantly smitten with Elyse.  With Halloween just around the corner, Elyse invites the Higgins law firm staff to an opulent masked Halloween costume ball. Rob obeys an order to remain in the office working that night, but has a change of heart when his spunky, 12-year old niece Ruby, convinces him to attend the ball wearing a prince costume. After a magnificent waltz and magical exchange with the handsome \"prince,\" Elyse yearns to locate this mysterious man and hopefully find the romance her life has been missing.",
      "similar": [
         1645,
         9800,
         389,
         392982,
         11224,
         314365,
         396371,
         14128,
         16119,
         8055,
         2642,
         114,
         597,
         634,
         150689,
         2048,
         59,
         1574,
         1592,
         22803
      ],
      "original_title": "Midnight Masquerade",
      "runtime": null,
      "poster_path": "/sg8z2yqFxR6RCba3uUZtM74m5G5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Hallmark Channel",
            "id": 6425,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Domino productions",
            "id": 16218,
            "origin_country": ""
         }
      ],
      "release_date": "2014-09-27",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.hallmarkchannel.com/midnightmasquerade",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Graeme Campbell"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Patricia Resnick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4087916/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTNiM2Q1ZGItZTMxYi00MjkxLTliMmUtNTNkNjlkNTgxNTUxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjg5MzE4NTA@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Autumn Reeser",
         "Christopher Russell",
         "Richard Burgi"
      ],
      "reviews": [
         "Loved it! A very cute romantic comedy! I must admit that I was not totally convinced by the first few minutes. But I was hooked at the first appearance of the leading actress, at the bowling. Autumn Reeser lightens the screen merely with her presence and her beauty! The story: \"Once upon a time there was a ravishingly beautiful young woman who stole the heart of a kind-hearted, handsome young man. However, our Cinderella doesn't mope while cleaning the floors; she's Elyse Samford, CEO of Samford Candy, who has just taken over the reins of the family company and has spontaneously invited Samford's longtime legal consultants Higgins Attorneys & Sons to Samford's Halloween Ball. Among those invited is the handsome young attorney Rob Carelli. Smitten with Elyse, he can hardly wait for the ball and even gets a splendid \"prince\" costume made on measure...\"",
         "This is nothing more than a poor interpretation of the Cinderella story done with the gender roles reversed. The acting is atrocious and the story is completely unbelievable. If they were going to make a fantasy, they should have made it more \"fantastic.\" It is made completely unbelievable because the evil family and the male lead are all lawyers -- a group known for being type-A alpha males. Cinder-guy is completely spineless and would never have made it through any law school let alone gotten an actual job. I bailed before the princess' \"mask ball\" (Halloween party) was over so I can only assume that it played out as expected with the evil \"step-brothers\" being revealed and Cinder-guy getting the princess.",
         "The Cinderella story is here flipped with the guy put upon and the girl the equivalent of a Princess. Hot, believable leads do not in any way cover the think and often poorly edited plot line. The setting of romantic comedy is usually a travelogue of an interesting place however the film is not set in any tourist destination cutting out this important element of romantic comedy and weakening the plot. Worth watching through primarily for the hot leads and some good photography but not competitive as far as one of the better romantic comedies. The evil stepsisters recast as evil brothers is one of the better aspects of the film.",
         "This was a thoroughly charming take on the classic Cinderella Story with a bullied and abused lawyer in the Cinderella role and a newly appointed company CEO as the \"princess\" charming. Loved how the shoes were worked into the story line, along with the self-serving step-father, and step-brother types in roles of partner owner of law firm and lazy sons. The niece role worked nicely as fairy-godmother type. The Halloween costume party was a nice layer to provide costume and mask to hide the identities. The conclusion was very satisfying and did not feel rush like some hallmark movies have. Looking forward to next season's crop of Hallmark's seasonal movies.",
         "I would not call this film a romantic comedy, it is not a laugh out loud film. I would call this Mills and Boon on the big screen. It is the classic girl meets boy with the traditional bad guys. I have to say that what sets this film apart is Autumn Reisser she is a delightful actress, one of those women any mother would love to have as a daughter in law. Back to the film, Midnight Masquerade is a delightful film and I have watched it four times already and like it each time. Every actor is exceptional the niece the leading man even the bad guys. I like the film so much I am waiting eagerly for the film to be released on DVD. So if you have an afternoon spare and you see Midnight Masquerade in your TV listing, take the time out and watch it you will not be disappointed."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Domino Productions"],
      "summaries": [
         "About the Movie - Midnight Masquerade Young businesswoman Elyse Samford's (Autumn Reeser) life takes a turn when she inherits Samford Candy, a multi-billion dollar corporation, from her retired father (Richard Burgi). A trademark infringement lawsuit against a rival company brings Elyse to Higgins Attorneys and Sons, where Rob Carelli (Christopher Russell), a young, too-nice-for-his-own-good lawyer, is bullied by his boss, firm founder Carter Higgins (Chris Gillett), and his two arrogant sons (Damon Runyan and Danny Smith). Despite his workplace woes, Rob becomes instantly smitten with Elyse. With Halloween just around the corner, Elyse invites the Higgins law firm staff to an opulent masked Halloween costume ball. Rob obeys an order to remain in the office working that night, but has a change of heart when his spunky, 12-year old niece, Ruby (Helen Colliander), convinces him to attend the ball wearing a prince costume. After a magnificent waltz and magical exchange with the handsome \"prince,\" Elyse yearns to locate this mysterious man and hopefully find the romance her life has been missing.",
         "A twist on the \"Cinderella\" tale is presented. Rob Carelli (\"Cinderella\"), a hard working and generally all 'round nice guy, is a junior lawyer at Higgins and Sons, a family law firm. He has to work twice as hard as the Average Joe or Jane not just to get ahead but to keep his job, as his boss, the company owner/senior partner Carter Higgins (\"Wicked Stepmother\"), is all about nepotism in favoring the \"sons\" of the company, Emmett Higgins and Andrew Higgins (\"Wicked Stepsisters\"), who he either does not see or chooses not to see are both slackers and brown-nosers. As is standard practice behind the scenes, Rob does all the work but gets none of the credit in preparation for a meeting with their clients, the representatives of Samford Candy Corp. in a potential lawsuit. Elyse Samford (\"Prince Charming\") has just been appointed CEO of Samford in the retirement of her father, former CEO Howard Samford (\"Queen\" and \"King\" in combination). It is at that meeting that Rob finds out that Elyse and the woman who he was attracted to at the local bowling alley are one and the same. In doing things in a slightly different way than her father, Elyse invites the entire staff of Higgins and Sons to the corporation's annual Halloween masquerade ball. Despite not doing Halloween or balls, Rob intends to go to the ball in getting to know Elyse in more of a social setting. Rob is supported by various people both in getting ready for the ball and in his professional life, including Sam, the office building's straight talking security guard, a former lawyer himself, Rob's older sister Helen, and Helen's twelve year old daughter Ruby (the collective \"Fairy Godmothers\"). Rob's attendance at the ball and his job are threatened by a plan by Carter on the Samford file using Emmett to make himself rich beyond his wildest dreams. When Rob thinks he discovers Carter's plan, he has to decide how to proceed, in his want to maintain a source of income while protecting Elyse and possibly telling her how he truly feels about her.",
         "Elyse, a rich heiress, meets Rob, a bullied lawyer, and the two fall in love during a costume ball."
      ],
      "budget": 0
   },
   "movielensId": 158821,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-09-27",
      "dvdReleaseDate": null,
      "directors": ["Graeme Campbell"],
      "runtime": 0,
      "movieId": 158821,
      "title": "Midnight Masquerade",
      "mpaa": "",
      "actors": [
         "Autumn Reeser",
         "Christopher Russell",
         "Richard Burgi",
         "Damon Runyan",
         "Helen Colliander",
         "Chris Gillett",
         "Kim Roberts",
         "Shauna Macdonald"
      ],
      "imdbMovieId": "4087916",
      "originalTitle": "Midnight Masquerade",
      "genres": ["Romance"],
      "youtubeTrailerIds": [],
      "plotSummary": "Young businesswoman Elyse Samford's life takes a turn when she inherits Samford Candy, a multi-billion dollar corporation, from her retired father. A trademark infringement lawsuit against a rival company brings Elyse to Higgins Attorneys and Sons, where Rob Carelli, a young, too-nice-for-his-own-good lawyer, is bullied by his boss, firm founder Carter Higgins, and his two arrogant sons. Despite his workplace woes, Rob becomes instantly smitten with Elyse.  With Halloween just around the corner, Elyse invites the Higgins law firm staff to an opulent masked Halloween costume ball. Rob obeys an order to remain in the office working that night, but has a change of heart when his spunky, 12-year old niece Ruby, convinces him to attend the ball wearing a prince costume. After a magnificent waltz and magical exchange with the handsome \"prince,\" Elyse yearns to locate this mysterious man and hopefully find the romance her life has been missing.",
      "tmdbMovieId": 289523,
      "avgRating": 3.75,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/sg8z2yqFxR6RCba3uUZtM74m5G5.jpg"
   }
}