{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2320087",
      "video": false,
      "title": "The Letter Writer",
      "recommendations": [],
      "backdrop_path": "/1LD9DUrR5tO0JMT37DBFmcZS6hU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Maggy Fuller",
               "gender": 1,
               "credit_id": "52fe4ab49251416c750eb18f",
               "name": "Aley Underwood",
               "profile_path": "/vuFqRsFaPulU4u0GrYZOuRtSgDA.jpg",
               "id": 1010894,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sam Worthington",
               "gender": 2,
               "credit_id": "52fe4ab49251416c750eb193",
               "name": "Bernie Diamond",
               "profile_path": "/yanIfiMrv6QBxduuUtTxuDNYdX1.jpg",
               "id": 1006783,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nancy Fuller",
               "gender": 0,
               "credit_id": "562fcd8e9251414ab700c061",
               "name": "Pam Eichner",
               "profile_path": "/mQEDNyaxFOlTXKQbAOit9VMsiqG.jpg",
               "id": 1362204,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Stella",
               "gender": 0,
               "credit_id": "562fd0bac3a3681b6100e6a3",
               "name": "Stella McComas",
               "profile_path": null,
               "id": 1362208,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kim",
               "gender": 1,
               "credit_id": "562fd17bc3a3681b4d00f7f4",
               "name": "Kylee Thurman",
               "profile_path": "/jtzrMDy2Rxn6dpBMuCfNGsggJYj.jpg",
               "id": 1528093,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Michael",
               "gender": 0,
               "credit_id": "562fd195c3a3681b5200dd41",
               "name": "Nicholas Neve",
               "profile_path": "/l6dQmuLe3Y87rbR6AeqdGjk7JaQ.jpg",
               "id": 1528094,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jason Fuller",
               "gender": 0,
               "credit_id": "562fd1b2925141284c00dfca",
               "name": "Curt Doussett",
               "profile_path": null,
               "id": 1362210,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mrs. Fuller",
               "gender": 0,
               "credit_id": "562fd1d9c3a3681b5200dd4a",
               "name": "Tonia Freeman Doussett",
               "profile_path": null,
               "id": 1528095,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Teacher",
               "gender": 0,
               "credit_id": "562fd1fa9251413b46000777",
               "name": "Matthew Bellows",
               "profile_path": "/29MTpPu3LhsLr3zV6wcoDbBuTDg.jpg",
               "id": 583885,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Principal",
               "gender": 1,
               "credit_id": "562fd74c9251414ad800c23a",
               "name": "Peggy Matheson",
               "profile_path": null,
               "id": 988413,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ab49251416c750eb199",
            "name": "Christian Vuissa",
            "profile_path": null,
            "id": 112379,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Family",
         "id": 10751
      }],
      "popularity": 0.724706,
      "production_countries": [],
      "id": 141418,
      "vote_count": 12,
      "budget": 0,
      "overview": "When a teenager receives a mysterious letter in the mail, she sets out to find the author. It's a journey that will change her life forever.",
      "similar": [],
      "original_title": "The Letter Writer",
      "runtime": 85,
      "poster_path": "/l1ELTqCokKBAmZoC9bd4Xi1Z8G7.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-11-15",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christian Vuissa"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Christian Vuissa"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2320087/",
      "coverLink": null,
      "actors": [
         "Aley Underwood",
         "Bernie Diamond",
         "Pam Eichner"
      ],
      "reviews": [
         "If you don't watch another movie anytime soon, I encourage you to watch this film. This movie could melt a stone. You cannot watch this and not take anything useful away with you. It will touch your heart. All the actors in this movie did a superb job. If you liked Pay it Forward, you'll love this movie. We all need something like this now and then. Watch it today. You'll be glad you did. The young girl, Maggie, did a wonderful job. The power of her emotions is staggering. Sam, aka Bernie Diamond, was simply amazing. We are blessed that he lived long enough to complete the film. He passed away shortly after its completion at the age of 89. The older folks from the nursing home were heartwarming, to say the least. Again, please take some time and watch this film.",
         "You watch lots and lots of movies, sometimes you look for good action, drama and even a good horror flick, but once in a while you come across a movie by chance that has the ability to touch in such loving way that you would have not imagined before pressing that Play button. The movie story begins when a rebellious young girl receives a heartwarming letter from an unknown source and the changes which follows in her life and people around her thereafter. THIS IS NOT A COMING OF AGE FILM BUT IS AN SPIRITUAL (non-religious) AWAKING FILM. The beauty of this film lies in its simplicity and its scripted in such gentle way that is very or may even impossible to find any pretentious message in the film. Its centers on how words can heal or hurt people and how we are carelessly use them among one another. It reminds us the power of receiving a hand written letter from a friend or family member in a way that no email, text, or twitter message can begin to encompass. You will be hard not to cry in several scenes in this movie. I honestly believe this was a labor of love and all were involve in this project must have been touched personally. There is no violence, vulgarity, etc. in this film and people of all ages can enjoy this movie. Highly recommend if you want a wonderful lullaby of a film",
         "This elegant film by writer-director Christian Vuissa conveys a fundamental principle of spiritual enlightenment that transcends theological dogma. If you are seeking a purpose driven life, you will find value in this piece. The teenage protagonist negotiates the rough waters of female adolescence with the unorthodox guidance of an aging mentor. She realizes ethical and moral truths by observing his consistent practices of selfless giving. Embracing these tenants in her daily life opens the door to her personal fulfillment. This is more of a coming to enlightenment than a coming of age film. The presentation is generally nonsectarian, and should be appropriate for viewers of any religious persuasion, and particularly those of no religious persuasion.",
         "I'm not one of those guys who use to write reviews or something, but this movie put another perspective on me. It's like when you can't find way to home an then appear someone who will never rest until not helping you. In its simpleness, The Letter Writer will connect you with that part most people think they lost and that's great because I was one of them and now... I know what I want to be, I know what roads I want to walk and I know... I'm not alone. This movie can save lives, even for people who think there's nothing good in the world. In my opinion, people don't understand things for themselves, so it's necessary to make things easier for them, like this movie does. The Letter Writer is an ESPIRITUAL movie (not religious - people use to confuse both terms), where all broken parts of your soul and heart can be fixed. This movie got the key of life. All depends on you.",
         "I've racked my brain trying to understand how people can give this 10 stars. Maybe if one were under 15 years or under... It was like enduring 2 hours of trite Joel Osteen/Oprah Winfrey, \"the divine within\" platitudes (which are neither Christian nor intelligent BTW). I don't agree with one reviewer who said it was about spiritual awakening. This was about purpose driven humanism, emotionalism, doing good to others in order to feel good about yourself, karma and the like, but it was so poorly acted in parts it was almost embarrassing - particularly the letter writer himself who sadly died during the making of this film. The script and plot weren't believable, the (over and under) acting all round was poor, the fade out scenes lasted way too long, the band was atrocious and even Alley's closing song, while melodic, was lyrically ambiguous and left you thinking... \"wha?\". I apologize for the bad review, it's how I honestly saw it. I was really disappointed with it. Perhaps you'll see it differently.",
         "Although I understand the motifs of the creators to make a film with such a plot, I cannot understand the rating. I was expecting at least a well-acted film, with average but rather good plot... But it wasn't believable at all - she's a teenager but the film reveals none of her inner struggles. How is it real, when her life is \"falling apart\" - as many teenagers would say, that she's not at least angry? She shed a couple of tears and...? Her dad's moving away, friend died, caught cheating, break-up, pushed over from the band, betrayed by a friend and she is not angry but gracefully accepts it and moves on and become a better person? I mean - I've seen worse films, but this was worse than many fairy-tales. The character portraying, the acting, the plot is really bad. I was waiting for a twist happen in the film... disappointed."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [],
      "summaries": ["When a teenager receives a mysterious letter in the mail, she sets out to find the author. It's a journey that will change her life forever."],
      "budget": 0
   },
   "movielensId": 158878,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-11-15",
      "dvdReleaseDate": null,
      "directors": ["Christian Vuissa"],
      "runtime": 85,
      "movieId": 158878,
      "title": "The Letter Writer",
      "mpaa": "",
      "actors": [
         "Aley Underwood",
         "Bernie Diamond",
         "Pam Eichner",
         "Stella McComas",
         "Kylee Thurman",
         "Nicholas Neve",
         "Curt Doussett",
         "Tonia Freeman Doussett",
         "Matthew Bellows",
         "Peggy Matheson"
      ],
      "imdbMovieId": "2320087",
      "originalTitle": "The Letter Writer",
      "genres": ["Family"],
      "youtubeTrailerIds": [],
      "plotSummary": "When a teenager receives a mysterious letter in the mail, she sets out to find the author. It's a journey that will change her life forever.",
      "tmdbMovieId": 141418,
      "avgRating": 3.54545,
      "releaseYear": "2011",
      "numRatings": 11,
      "posterPath": "/l1ELTqCokKBAmZoC9bd4Xi1Z8G7.jpg"
   }
}