{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "fall in love",
            "id": 155651
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt2415112",
      "video": false,
      "title": "A Bride for Christmas",
      "recommendations": [
         311093,
         238304,
         427045,
         348393,
         421629,
         363482,
         145343,
         213901,
         369055,
         344123,
         421620,
         406129,
         369054,
         363478,
         310972,
         362886,
         446493,
         396392,
         234951,
         480638
      ],
      "backdrop_path": "/zUI4RLOkZrgwNrPTfHJ6xvKqU9f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jessie",
               "gender": 1,
               "credit_id": "52fe4b9c9251416c7510878b",
               "name": "Arielle Kebbel",
               "profile_path": "/g8tijCydDd4TGdcxVJLi1UqlXm2.jpg",
               "id": 20373,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe4b9c9251416c7510878f",
               "name": "Sage Brocklebank",
               "profile_path": "/fBSTmz2FKyXmLRq67MV162xdkkw.jpg",
               "id": 62913,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe4b9c9251416c75108793",
               "name": "Peter Benson",
               "profile_path": "/1e5syqHk93Ol4E36RTGG0oVG9C.jpg",
               "id": 5009,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Marcie",
               "gender": 1,
               "credit_id": "52fe4b9c9251416c75108797",
               "name": "Jordana Largy",
               "profile_path": "/uhDavKWMUep1eJGMIWPgeoY6YU1.jpg",
               "id": 1043662,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Patty",
               "gender": 0,
               "credit_id": "52fe4b9c9251416c7510879b",
               "name": "Chelsey Reist",
               "profile_path": "/3I2SEPmU89qv5Zw8T4n0xPH9Y4L.jpg",
               "id": 1073525,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Aiden",
               "gender": 2,
               "credit_id": "5339e0489251417da1004fab",
               "name": "Andrew W. Walker",
               "profile_path": "/tIXOvMadH1JI13DFOTnpAfrvQiV.jpg",
               "id": 134673,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Vivian Patterston",
               "gender": 1,
               "credit_id": "52fe4b9c9251416c751087a9",
               "name": "Kimberly Sustad",
               "profile_path": "/syBA7Scz1LsY9zymB1wvR4a4RMO.jpg",
               "id": 1292329,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "581497ff9251414f9b02f370",
               "name": "Gary Yates",
               "profile_path": null,
               "id": 103699,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5908d4fac3a36858a7012280",
               "name": "Scott Anderson",
               "profile_path": null,
               "id": 1808982,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.015748,
      "production_countries": [],
      "id": 147132,
      "vote_count": 37,
      "budget": 0,
      "overview": "Bride-to-be Jessie Patterson calls off her third engagement - during the ceremony! She swears off serious relationships, until she meets and is pursued by Aiden MacTiernan. Aiden, on the other hand, has bet his friends he is marriage material, and can find a fiancé in the four weeks leading up to Christmas. When Jessie and Aiden begin to fall for each other, Jessie must decide if she is ready for serious love, and Aiden must decide if his bet is worth risking his relationship with Jessie.",
      "similar": [
         11395,
         13673,
         11881,
         10719,
         10147,
         9479,
         13377,
         18147,
         323262,
         287903,
         51052,
         5825,
         1585,
         10872,
         1581,
         8871,
         634,
         772,
         296100,
         338964
      ],
      "original_title": "A Bride for Christmas",
      "runtime": 90,
      "poster_path": "/yC9EAODkDaHEuaYi1MBPzcV4K12.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-12-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Yates"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Barbara Kymlicka"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2415112/",
      "coverLink": null,
      "actors": [
         "Arielle Kebbel",
         "Andrew W. Walker",
         "Kimberly Sustad"
      ],
      "reviews": [
         "My wife and I have not seen every made-for-TV Hallmark movie, but we have seen several dozen. I can't remember a better Hallmark movie than A Bride for Christmas. This movie has a lot of strengths. It has lead characters Jessie (played by Arielle Kebbel) and Aiden (Andrew Walker) who are unusually attractive and likable. Indeed, Andrew Walker has a striking resemblance to a young Tom Cruise. The acting by Kebbel and Walker, and by all the supporting actors, is excellent. The dialog is reasonably realistic. The camera work is quite good and adds interest. The musical score is also very good, effectively enhancing some of the scenes. The plot is predictable (as in all Hallmark movies) and we've seen certain plot elements before in several well known rom-coms (The Runaway Bride, 10 Ways to Lose Your Lover). But given those drawbacks,the movie does an excellent job of telling its story. The inevitable \"change of heart\" on the part of Jessie and Aiden proceeds at a slow and realistic pace and the actors convince us that there is romantic chemistry between the two lead characters. The lead and supporting characters all behave in realistic and believable ways. While watching A Bride for Christmas, my wife and I repeatedly said to each other \"This movie is good!\" We thoroughly enjoyed it and will watch it again.",
         "My goodness. As I am writing, this movie has a 5.8 rating. How anybody could choose to watch a movie called A Bride For Christmas and come away disappointed with this movie is completely lost on me. I mean, what were they expecting? Were they perhaps caught off guard when there was a wedding/Christmas theme? I was expecting a bride, and Arielle Kebbel was a really, really good one. She so reminds me of watching Katherine Heigl in little movies like this one she used to make not too many years ago. She is adorable here, which is what I was expecting in a movie where \"Bride\" is prominent in the title. I was expecting a wedding and I was expecting Christmas. Past that I was hoping for a well written script. This one is sweet, thoughtful and pretty clever considering it sticks to familiar story lines. What it comes down to is whether you want to watch a well made movie about A Bride For Christmas or you want to watch something else. When I sat down for this movie, I was expecting they'd show me a sweet movie about a cute bride at Christmas. Given those parameters, this Christmas movie highly exceeded my expectations.",
         "Jessie (Arielle Kebbel) is about to tie the knot with her third fiancé. She is in a white gown and guests are waiting for her grand entrance. But, as Princess Vespa, she goes right past the alter and out of the ceremony. Nobody is pleased. Certainly not her fiancé Mike, who proposed on a Jumbotron. Nor is her sister and business partner Victoria or Jessie's grandkids minded parents. But, it was the right choice, as Jessie realizes it wasn't true love. From now on, she tells herself, she will concentrate on her job and her volunteer work at an animal shelter. Meanwhile, Aiden (Andrew K. Walker) is having a card game with three of his male, married friends. As the only bachelor present and seemingly confirmed, he takes on a bet from the others. It involves getting a woman to say \"yes\" to his proposal before Christmas Day. So, guess what? The first lovely lady that Aiden casts a serious eye on is Jessie, at an art gallery. Victoria tries to get her sis to make a connection with the really cute man but, naturally, Jessie remembers what her present agenda is. Thus, the only exchange made between the two singles is Jessie's biz card, presented to Aiden. Since she is an interior decorator, the betting man hires the dog lover to re-do his condo. Since this requires many an hour of discussion at the bachelor pad, some of Jessie's reluctance vanishes. But, since Mike is still trying to win Jessie back and there is always the possibility that Jessie will find out about \"the wager\", will there be a future for J and A? You bet! This lovely Holiday movie is just a slam dunk for romcom fans. It features an attractive cast, a beautiful setting (San Francisco), knockout costumes, a sweet, funny script, and a zestful direction. Yes, some of the elements are \"borrowed\" but no one will be blue after a view. For future sighs and smiles, get Bride for Christmas somewhere, somehow.",
         "I HAVE REVIEWED OVER 400 Christmas MOVIES. BEWARE OF BOGUS REVIEWS & REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE REVIEWED OVER 400 Christmas MOVIES. I HAVE NO AGENDA. I AM FARE. THE REASON WHY I REVIEW THEM IS TO KEEP TRACK OF WHAT I HAVE SEEN! Julie Roberts and Richard Gere starred in 1999's \"Runaway Bride\". That was the 2nd collaboration for the two actors. In 1990 they starred in the box office smash \"Pretty Woman\" and they delivered another box- office hit with \"Runaway Bride\". However time has been kind to \"Pretty Woman\" but I can't say the same for \"Runaway Bride\". That film if it were made today would be played to empty theaters. Hallmark Channel however rips off \"Runaway Bride\" with this film \"A Bride for Christmas\". This film however flows better and is 30 minutes shorter than its theatrical inspiration. In this film Jessie Patterson (Arielle Kebbel) calls off her third engagement - at the altar! - she swears off serious relationships until she finds \"the one.\" That is, until charming but chronically single Aiden MacTiernan (Andrew Walker) comes along. Unbeknownst to Jessie, Aiden has bet his friends that he can convince a woman to marry him by Christmas - which is only four weeks away - and Jessie is the target of his bet. As Aiden attempts to court Jessie by first hiring her to decorate his apartment, Jessie looks to her sister, roommate and interior design company partner, Vivian (Kimberly Sustad) as her closest confidant. To complicate matters, Jessie is doggedly pursued by her most recent ex-fiancé, Mike (Sage Brocklebank), who still wants to marry her. Lots of fun and never boring. Watch it anytime of the year. It will make make you smile...",
         "I'm usually pretty skeptical going in to Hallmark movies but this one surprised me. Of course there was the usual combination of the attractive leads, the quick love story and the happily ever after, but it made a pretty good movie along the way. Arielle Kebbel was a strong lead and although her likeness to the Julia Roberts character was shameful (tut tut writers). She became her own \"runaway bride\" though, and even though she left 3 guys at the altar because she was too chicken to say \"no\", I found myself rooting for her. And that's what you want to be when watching a rom-com - rooting for the leads. Cookie-cutter ending, but it was satisfying to say the least. Bravo, Hallmark.",
         "As I have explained in my other reviews, viewers need to realize that every bad X-Mas movie they have ever seen in their entire lives probably was made in Canada. The reason for this is that the Canadian film industry has more or less cornered the market on this niche, mainly for financial reasons (cheaper dollar) and it can -- AND DOES -- offer highly competitive pricing on these films to worldwide distributors who are constantly eyeing their bottom line. I am NOT criticizing the Canadians, you can call this a back-handed compliment, since they are a very robust and profitable industry and they will still be monopolizing this niche long after you and I have gone on to our greater rewards. But for the viewers (not the bankers) the fact is that much of the product is weak because it was produced with eye on the bottom line. Which brings us to A BRIDE FOR X-MAS. What sets this one apart from the pack are the performances of Kebbel and Walker. I have seen a lot of movies, reviewed a lot of movies, but I have to suggest there is real chemistry here. In fact, the scenes with the two of them alone are so highly charged that, for a fraction of a fraction of a second, you might think you were watching a Hollywood A-lister. The rest of the movie suffers from the typical Canuck syndrome, that is, weak writing, and weak performances from the supporting cast who, more often than not, are chosen from the same dozen or so character actors who invariably appear in all the other similar productions. And here is a PS -- one wonders why no one from the production company told IMDb that the poster for the German translation of the film was used in error for this IMDb entry?",
         "What a wonderful and pleasant surprise! My daughter and I watched this movie on and we both loved it - we taped it and left it on so I could watch it again. Jessie reminded me of Jennifer Lawrence - she was that good - all of the actors could transfer easily over to the \"big screen\"! I never saw any of them before in anything but will make a point to follow their career from now on - It was like an old Doris Day/Cary Grant movie... Loved... Loved... Loved it! I'm trying to find where Jessie got the dress that she wore to the art gallery :-) Any ideas on who made some of her clothes would be greatly appreciated... wanted to see much more- any chance a sequel is in the works?",
         "With a character obviously based upon the Runaway Bride, and a lead guy based on several old comedies as well, this movie really doesn't have much to do with Christmas. It's a backdrop, but the movie could have just as well been told as Arbor Day Bride, Memorial Day Bride, or Columbus Day Bride. Hallmark put out several Christmas-themed movies this year, and most of them pretty good. This one is not. The girl has already broken off three engagements, and the guy agrees to a stupid bet about getting a woman to say yes to a phony proposal. Are these the kind of people to settle down to watch with a hot chocolate and /or cuddle up with a loved one with a fire in the fireplace? They're stupid and selfish at best. At worst--well, better not to go there. Everything is predictable: just a brief excerpt list of stuff you've seen in this sort of movie 100 times before: battle of the sexes, hidden agendas, emotions in spite of themselves, family and friends that wants them together in spite of what they've done, etc etc etc. The movie tries to make these elements cute, but doesn't succeed. While most of the cast are likable people and good actors, the tired story line just doesn't offer any Christmas cheer. If you're in the mood for a Christmas movie, switch channels to an old Christmas cartoon movie while this is on.",
         "A BRIDE FOR Christmas is a well-made Hallmark TV movie that debuted in December of 2012. Its leads, Andrew Walker and Arielle Kebbel, are two fine, handsome young actors. The story has some good jokes, fine pictures and some good supporting actors -- particularly by Duffy, a handsome and energetic dog. Yet at its heart is a creepy, stalker plot that made me shake my head. Mr. Walker is a successful man whose friends are all married. He alone remains committed to a life of casual relationships, but agrees to a bet that he can get a woman to accept his proposal by Christmas. He chooses Ms. Kebbel, a woman who has walked out on three fiancés, including one at the altar, as his subject. Then he stalks her. Along the way they fall in love in a charming fashion, but that initial set-up, in which he proposes to make a girl fall in love with him with no thought of the consequences is disquieting. Romantic comedies have a long tradition of such attitudes from the way Jimmy Stewart treats Margaret Sullavan in THE SHOP AROUND THE CORNER to just about every Rock Hudson-Doris Day movie. In this movie careful writing deals with the issues I felt but do not quite dispose of them. I wound up enjoying it but not awarding it the superior rating I would have without that issue.",
         "I've been binging on Hallmark movies this Xmas week. I know many use the ole formula. I look for best rated, good chemistry and stories that sound to be most interesting dare I say 'different' i.e. story lines, locations. We all agree that from the starting gate we know this is Runaway bride run amuck. Super damaged goods. Then, Aiden makes a crazy, horrid bet. I mean, he's going to prank an innocent young woman with a false marriage proposal. OK...we suspend disbelief that he could be so cruel, especially when he's matched with Jessie who has herself basically done this to three guys. Did I mention that Jessie is drop dead gorgeous! Sort of a Jessica Alba clone, I think. Since I know how all Hallmark movies end I am taking a break, with about 15 mintues to go on this one. I had to stop when the idiot screen writers commit the same 'crime' I've seen too often. In K-dramas they use an easy tool. The screen goes dark and voila, signage on the screen says ONE YEAR LATER! I'm not listing any of this as 'spoiler' because it is basically not possible to spoil such Hallmark movies. We know from scene one, 100% that the two will wind up together. Therein is the HUGE plot hole. This and similar Hallmark movies show a proposal and no engagement or no period of engagement. Totally insufficient time to know one another. I mean propose after weeks of 'non-dating', one kiss, and voila, time to buy the wedding dress and plan the wedding. Please, Hallmark, use the fade, then ONE YEAR LATER or even SIX MONTHS LATER before we see a wedding dress, wedding plans or an actual wedding. This might give them time to actually 'date.' In this and other Hallmark movies the eliminate all dating going instead from one kiss to marriage. Totally unnecessary if done right.",
         "I know its only July but i felt like a bit of nostalgia and this was on Amazon to hire for £3.49, so I thought what the heck might as well give it a go. I wasn't disappointed I loved the two leads, they had their own chemistry going on and I almost believed they were made for each other. Its a good movie the family can enjoy. Nothing not to like really. OK there were a few things that I noticed so i marked it down a bit, the fact that Jessie said she couldn't have a dog because of her sisters allergies, but at the end the dog is running all over the house and not one sneeze anywhere, also the fact that the bouquets were the perfect match for Jessies Christmas outfit. Just minor things really. Yeh I really enjoyed it, and the time passed really quickly. MERRY XMAS everyone lol.",
         "Magnificent real life human love screen writing. The music is always in this sense uplifting. What I want to know is who performed the scenic cool music of the contrasting censorial scene of the eventual good guy love interest being so rejected and bummed out at his office Christmas party. This music might speak to the real common joy of a certain general human happiness. To make my 10 lines of artistic word and music and their undercurrents context analysis of this movie's pure human moral warmth and worth of the over-riding good times of altruistic practical human theoretical love, all I can say it is a certain kind of sublime amalgamated feelings. The artistic verified loops we have to pass through to just get to - I just want to realize that that one instant of combined true feeling of human conditions is almost always true. Please just tell me who imagined that song.",
         "This romantic holiday flick stars Arielle Kebbel (Midnight Texas) and Andrew W. Walker (numerous Christmas films) as the love interests Jessie and Aiden. Jessie has been engaged three times and just about given up on love and all that it entails. Aiden is the static bachelor whose friends make a bet with him that he can't be engaged by Christmas only four weeks away. Lead character meet and banter, eventually get to know one another and fall in love. Then Jessie learns of the bet.. Will it be happily ever after or a lonely new year's eve & Christmas for the duo? Cute movie, worth a watch!",
         "That was a bet I wouldn't regret either. I've seen Mr. and Mrs. Charming (Andrew Walker & Arielle Kebber) in other Hallmark movies and they make a cute couple in this one. I would watch this one again. Mainly because I missed what happened during the poker game. This is a solid 7 star movie IMHO!",
         "I found it quite odd that the woman who basically said no to marrying 3 guys but, decides to marry the 4th one after 4 weeks. I mean, that's really sad like, it should've given the character more time to figure out the 4th guy. I wouldn't be too thrilled to hear that he had made a bet with his buddies to marry a stranger before the Christmas holidays, gross! You may think the characters were moving too fast on marriage, the movie was too speedy as well! I thought the whole storyline was going all over the place! I just think they should've made this story more slower and calmer to follow so I could be able to understand what the hell is going on! Not a good Hallmark film I'm afraid!",
         "The acting totally and relationship was as phony as can be...so that killed the plot. And airing this movie ad nauseum doesn't revive it. But considering the scenes with the animal shelter and the adoption from the animal shelter, so be it. Phony relationship: 1. \"Aiden's\" natural looks are like that of a hot-shot...shallow. The most talented acting can change that. 2. \"Jessie\" was neither greatly attractive,* nor did she have an outstanding or even good personality* to have so many guys proposing marriage. Aiden's \"attraction\" to her was only because she was \"super cute\" and available and convenient for his bet...unknown to her. 3. The parents were desperate and over-bearing in trying to get \"Jessie\" married...to ANYONE that she would say \"yes\" to...which I suppose the reason was consistent with #2.* The only good point was featuring the animal shelter to encourage adoptions...which raised my rating level from 1 (awful) to 10 (excellent). Sincerely, Adopt Shelter Pets Today",
         "I saw this movie earlier today. The movie is unrealistic because normally, a woman doesn't \"Just accept the guy after finding out he accepted a bet with a few co-workers\" after he tells her he's in love with her. Something similar happened to me in highschool, but in a different context. Women in reality aren't that submissive when they've been through a few bad relationships unless they're blind and stupid (Three stupid women out of ten with an education.) Arielle Kebbel is cute in the movie, but again, the movie is unrealistic. To say that someone gets married three weeks after the day you meet someone is as unrealistic as getting married in Las Vegas while going through a drive-through, and is as disgraceful as Britney spears getting married for fifteen hours."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Bride For Christmas Productions",
         "Johnson Production Group"
      ],
      "summaries": [
         "After Jessie calls off her third engagement, she swears off serious relationships until she finds the one. That is, until charming but chronically single Aiden comes along. But unbeknownst to Jessie, Aiden has bet his friends that he can convince a woman to marry him by Christmas, which is only four weeks away.",
         "San Francisco. It's four weeks before Christmas. Jessie Patterston, who operates an interior decorating business with her sister and roommate Vivian Patterston out of their apartment, has just broken up with her latest boyfriend, Mike. As he - after Owen and Trent - is the third fiancé with who she has ultimately had permanent cold feet, Jessie believes she is not destined to be married and as such has sworn off men and serious commitments. Aiden MacTiernan, a personal investment advisor, is a love 'em and leave 'em kind of guy. Matt Harper, Aiden's friend and business associate, says women can smell the non-commitment off of Aiden. As Aiden dismisses this assertion about him, Matt bets Aiden that he cannot get a woman to say yes to his marriage proposal by Christmas. Aiden accepts the bet on the caveat that he gets to pick the target. Meeting at an art function of one of Matt and Aiden's clients, Matt encourages Aiden to go after Jessie as Matt knows Jessie's new vow of non-commitment having just been turned down by her. Not knowing this piece of information, Aiden, just thinking that she's cute, does choose Jessie as his target. Although Jessie believes Aiden's request for her business card is just a pickup line, Vivian offers it to him as a client is a client for their struggling business. As Jessie and Aiden begin to spend time together in she redecorating his condo, they begin truly to fall for each other. There are several obstacles to a Jessie and Aiden happily ever after: Mike is still around and will do anything to show up Aiden in front of Jessie; despite their attraction to each other, Jessie and Aiden consider the other damaged goods - Aiden who had an unhappy childhood coming from a broken home - and may not be willing to take a long term chance on the other; they may not be willing to take a chance on themselves to change what has been their own unsuccessful histories in this department; and the bet coming to light to Jessie which could permanently taint her view of Aiden.",
         "A single man tries to win a bet by getting a woman recovering from a broken engagement to marry him by Christmas."
      ],
      "budget": 0
   },
   "movielensId": 158940,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-12-01",
      "dvdReleaseDate": null,
      "directors": ["Gary Yates"],
      "runtime": 90,
      "movieId": 158940,
      "title": "A Bride for Christmas",
      "mpaa": "",
      "actors": [
         "Arielle Kebbel",
         "Sage Brocklebank",
         "Peter Benson",
         "Jordana Largy",
         "Chelsey Reist",
         "Andrew W. Walker",
         "Kimberly Sustad"
      ],
      "imdbMovieId": "2415112",
      "originalTitle": "A Bride for Christmas",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Bride-to-be Jessie Patterson calls off her third engagement - during the ceremony! She swears off serious relationships, until she meets and is pursued by Aiden MacTiernan. Aiden, on the other hand, has bet his friends he is marriage material, and can find a fiancé in the four weeks leading up to Christmas. When Jessie and Aiden begin to fall for each other, Jessie must decide if she is ready for serious love, and Aiden must decide if his bet is worth risking his relationship with Jessie.",
      "tmdbMovieId": 147132,
      "avgRating": 3,
      "releaseYear": "2012",
      "numRatings": 5,
      "posterPath": "/yC9EAODkDaHEuaYi1MBPzcV4K12.jpg"
   }
}