{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "elves",
            "id": 603
         },
         {
            "name": "santa claus",
            "id": 1991
         },
         {
            "name": "christmas tree",
            "id": 5570
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "holiday season",
            "id": 189966
         },
         {
            "name": "christmas spirit",
            "id": 193048
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt2374486",
      "video": false,
      "title": "Help for the Holidays",
      "recommendations": [
         369055,
         239899,
         363484,
         238304,
         313945,
         241903,
         299583,
         423891,
         55210,
         81307,
         149229,
         366631,
         144097,
         421761,
         81421,
         421629,
         150670,
         418969,
         180794,
         307022
      ],
      "backdrop_path": "/rLR2Gj7r9R6ndzkt28wL15Ik6GC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Christine Prancer",
               "gender": 1,
               "credit_id": "52fe4be39251416c751112f7",
               "name": "Summer Glau",
               "profile_path": "/7AlW3QVQUAfGwWrnDwb0iP3J1Wx.jpg",
               "id": 54881,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Scott Vancamp",
               "gender": 2,
               "credit_id": "52fe4be39251416c75111311",
               "name": "Dan Gauthier",
               "profile_path": "/6ofGZR0XMbtulf2Iff9ddHaV8j3.jpg",
               "id": 93321,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sara Vancamp",
               "gender": 1,
               "credit_id": "52fe4be39251416c751112fb",
               "name": "Eva LaRue",
               "profile_path": "/eTaPs2LzZELjc8psM5wF28qeWj0.jpg",
               "id": 121769,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ally Vancamp",
               "gender": 1,
               "credit_id": "52fe4be39251416c75111305",
               "name": "Izabela Vidovic",
               "profile_path": "/q8lxW2OaUmP5OF8SkntIp2vPcDX.jpg",
               "id": 1109976,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Will Vancamp",
               "gender": 2,
               "credit_id": "52fe4be39251416c75111309",
               "name": "Mason Cook",
               "profile_path": "/19XPc3ggqJSsh5k7oYyncWGrxVz.jpg",
               "id": 583040,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Classmate",
               "gender": 0,
               "credit_id": "52fe4be39251416c75111315",
               "name": "Madison Dae Clarion",
               "profile_path": null,
               "id": 1128557,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gabby",
               "gender": 0,
               "credit_id": "52fe4be39251416c75111319",
               "name": "Jessie Lande",
               "profile_path": null,
               "id": 1128558,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dave Gabriel",
               "gender": 2,
               "credit_id": "53539d940e0a265614004671",
               "name": "John Brotherton",
               "profile_path": "/sE73Zs4q8rugmrFnn9jv2wAEVrI.jpg",
               "id": 222906,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4be39251416c75111301",
               "name": "Bradford May",
               "profile_path": null,
               "id": 83996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54848569c3a3680b4300027e",
               "name": "Abbey Cleland",
               "profile_path": null,
               "id": 1395897,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "548485869251416a660002ba",
               "name": "Bob Sáenz",
               "profile_path": null,
               "id": 1358511,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59f5b9cdc3a3682df400e7f5",
               "name": "Dora Hopkins",
               "profile_path": null,
               "id": 1323242,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.990258,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 149235,
      "vote_count": 16,
      "budget": 0,
      "overview": "Although she loves Christmas, Santa’s elf Christine (Summer Glau) wonders if there could be more to life than making toys in the North Pole. When Santa receives an emergency wish from a little boy in Los Angeles, he puts Christine on a special assignment, sending her to L.A. to give the VanCamp family—mom Sara (Eva La Rue), dad Scott (Dan Gauthier), and their two kids Ally (Izabela Vidovic) and Will (Mason Cook)—a holiday wake-up call. Will Christine fail her assignment and be sent back to the North Pole for good, or will the VanCamps come to their senses about the meaning of Christmas?",
      "similar": [
         9479,
         11395,
         10719,
         13377,
         5375,
         287903,
         51052,
         10147,
         1585,
         364,
         8871,
         772,
         5255,
         9279,
         9714,
         10510,
         13673,
         9021,
         11881,
         338964
      ],
      "original_title": "Help for the Holidays",
      "runtime": 84,
      "poster_path": "/nDBBhIcAn17VUX030Iy0OPIHVlt.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Larry Levinson Productions",
            "id": 3282,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "PixL Entertainment",
            "id": 40666,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mediapool Production",
            "id": 40667,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ashton Productions",
            "id": 11982,
            "origin_country": ""
         }
      ],
      "release_date": "2012-12-09",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "because elves, after all, deserve happiness, too",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bradford May"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Abbey Cleland",
         "Abbey Cleland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2374486/",
      "coverLink": null,
      "actors": [
         "Summer Glau",
         "Eva LaRue",
         "John Brotherton"
      ],
      "reviews": [
         "This is one of the best new Christmas movies I have seen in quite awhile. I think Steve Larkin is the best Santa I have seen since \"Miracle on 34th Street\"! His laugh is contagious! I felt a more touching side of Santa. The fact that Santa also knew what his Elf wanted helped to bring the whole story up to a more of a loving caring level. Summer Glau (Christine Prancer) is a very cute Elf. I like the whole Elf ear thing, but don't want to include any spoilers here :) Christine Prancer's Elf friend Gabby (played by Jessie Lande) filled the best friend roll well. The story line is well written, and not just a typical Scrooge changing, Christmas, Love Story. The plot brings to light that Christmas is an important family time and that the spirit and enthusiasm for Christmas can be changed by even the smallest of the family members.",
         "I just watched Hallmark's movie 'Help for the Holidays'. Summer Glau was really amazing, so charming and wonderful as an elf coming to Los Angeles to help a family recover the Christmas spirit, her smile would melt ice. It was such great entertainment for the family. Take summer out of the movie, it wouldn't have been such a great film. The bonding with the kids was great and same with her love interest John Brotherton. She was like a magician with her book. Very heartwarming film with a happy ending, Summer Glau at her most very best great performance, i hope they make a sequel since it was a big success for the Hallmark Channel (most watched original movie of the year).",
         "I'm a little late with my review, but still ... To be honest, I watched the movie exclusively because of Summer Glau. Otherwise I'm really not in Christmas movies. So, I started watching the movie with no expectations but to see another good performance of gorgeous Summer Glau. But, who would have thought ... I actually liked a movie! A lot! Not only that Summer's performance was excellent, also other actors delivered very good performances and even the story was good. I actually liked Santa in this one. Sure, you can't expect deep psychological studies, elaborate relationships, social criticism from a Christmas movies. They're here to entertain, to cheer us up and this movie succeeded in each and every aspect. The story's nice, the actors good but what overwhelms the most is really Summer's outstanding performance. It's simply amazing, how she manages to capture the viewer with only a smile and makes even the worse dialogues good (not that there were any bad or stupid dialogues in this movie). I think that she's one of the most underused actresses in this business. It's really funny that she even manages to curb the ratings of the episodes where she has guest appearance. Eva LaRue was also excellent. i know her from CSI:Miami and this was something completely different but she managed it with flying colors. Well done Eva! The other actors were not quite so good (at least for my taste), but still far better than 90% of performances in other movies. Pity that we don't get a sequel this year. It would be nice to see how Christine and Dave managed to fit in into real life or if Vancamps managed to keep the Christmas spirit. Nice movie, meant to entertain and it managed it perfectly.",
         "I have this odd semi-obsession with seeing, about once-a-week, another Christmas... and this happens year round no matter what month it is. My obsession continued with this Made-for-TV movie from the Hallmark Channel. Santa sends an Elf to bring the spirit of Christmas back to a family who has lost it. Summer Glau stars and as she brings Christmas to the screen she is simply a delight to watch. Overall, an average, but still one of the better, Made-for-TV Christmas movies from the past several years, methinks. Definitely worth it for those who love that Christmasy feeling... even if it does take place in Southern California. 5.6 / 10 stars --Zoooma, a Kat Pirate Screener",
         "I'm big fan of Summer Glau and watch every movie she is in. That's why I'm 22 and watch this at first sight \"child movie\". Summer Glau in this movie did excellent job! The sweetish elf I've ever seen. So much love and endless kindness. Only for this I can rate the film 10/10. I mean on of the best role she played. Terminator chronicles, dollhouse, 4400, serenity, help for the holidays - are the best movies with Summer. But while I was watching it it was good movie. Yeah, really good movie - the actors played good (especially kids and Santa) - as for me on of the best Santa in the movies. In some moments I even have a mood for crying. Definitely 10/10 and you really should watch this.",
         "I'll admit I'm normally not a person that watches anything from \"Hallmark\" mainly because there simply not my movies, however this film is probably the only exception I'll make for them. It's not exactly one of my favorite Christmas films nor a classic in my book, but all the same I like it because it has a fun charm to it as well as surprisingly made me care and feel good, but of course has an actress I really like is in it which makes it even better. I like the story, it's a typical fish out of water story but it's one of those ones done right; it's almost a bit similar to the story in the claymation special \"Santa Claus is Coming to Town\" since that was about a Christmas character coming into contemporary reality and giving cheer where needed. I really love the character Christine whom of course is played by Summer Glau. I'll admit what drawn me to the film is her since I've seen and a fan of \"Firefly\" and \"Serenity\", she is just fraking hot and a capable/underrated actress to boot. I really love her performance in this film, I bought she was an elf. Her character has charisma, has just this infectious charm that could just win anyone even by just a mere smile which on a side note is a great one, she's selfless, energetic and cheerful. Two of the things I really like are how disoriented she is with real world customs, which makes sense since she is an Elf from the North Pole; and it funny how she tries to fit in which of course doesn't entirely work, from the way she behaves and certain things she does the supporting characters know she's a little strange. But just simply the humanity of her character which makes her three dimensional, the fact that she wants more in her life, which is a normal human trait with anyone. And of course she experiences both the ups and even the downs, when things are really down for her, you can't help but feel for her but that all the more makes us want her to win. Supporting characters are solid, Eva La Rue also hot and yeah watched a little of \"CSI Miami\" her character Sara VanCamp is a mom whom is unfortunately all business, she is plenty successful in her career but shamefully doesn't equal toward her family life. She not a bad person the problem is her head is in the wrong place. She does care about her family but she doesn't spend enough time with them even when she should. And of course that mistake soon catches up with her. Her character also has humanity once this begins, she starts to let Christine in a little realizing she isn't happy and needs some help. Another supporting is Dave Gariel (John Brotherton), I like that he doesn't look like a typical pretty boy, but handsome all the same. He's got a sort of rough charm to him, has some charisma, like that he's likes Chrismas just as much as Christine which is one thing they have in common. I do like the chemistry between both of them, it's not the greatest romance I've ever seen but I take it over any crap fest romance comedy/soap anytime. But both have a solid back and forth, I bought the developing relationship between the two sparks were flying, but I love the fact that he accepts her for what she is, sure Christine seems a bit strange but in a good way let alone she's not boring. The film of course does have good messages about the importance of putting family first and also how everyone does deserve happiness. Overall it's a solid simple Christmas film that's worth a watch. Rating: 3 stars",
         "Review Date 3/9/2018 PLEASE BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. I HAVE OVER 400 REVIEWS OF \"CHRISTMAS RELATED FILMS & SPECIALS\" WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I REVIEW MOVIES & SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY \" C H R I S T M A S \" MOVIES AS I CAN. Now Someone keeps reporting my reviews. I guess they are jealous because I do tell the truth. I want to point out that I never make snide remarks about actors weight or real life sexual orientation. If there acting is terrible or limited \"I talk about that\". If a story is bad \"I will mention that\" So why am I being \"picked on\"? IMDB? When one of my reviews gets deleted IMDB will not even tell me what someone found offensive. Well on to this review. Although she loves Christmas, Santa's elf Christine (Summer Glau) wonders if there could be more to life than making toys in the North Pole. When Santa receives an emergency wish from a little boy in Los Angeles, he puts Christine on a special assignment, sending her to L.A. to give the VanCamp family-mom Sara (Eva La Rue), dad Scott (Dan Gauthier), and their two kids Ally (Izabela Vidovic) and Will (Mason Cook)-a holiday wake-up call. Great family film. Children will enjoy and parents will not bored. The film has a nice pace and decent actors.",
         "I was surprised when I saw Summer Glau in a Hallmark Christmas movie. I think of the kick-ass teenager in Serenity, or the robot protector in Sarah Conner Chronicles, but not a cheery elf in a Christmas story. But she makes a good one. While the ultimate outcome is predictable, I was surprised at some of the journey along the way. For one thing there was none of the plot device where the kids terrorize the nanny. The story uses some Santa and elf magic, so don't expect realism. I wasn't impressed with most of the acting, although it wasn't bad either. But Summer did a nice job developing her character from the essentially naïve alien in the real world into at least a little more natural participant in it. I wish I could say John Brotherton did as well, but I thought his performance was more in the middle. They really didn't have enough screen time to play off one another. Glau connected more with the kids, who each did a good job in their roles. For me, Glau was the heart of the movie.",
         "At last! Hallmark presented a GOOD, new Christmas movie!...so rare anymore! I watched this movie several times and enjoyed it each time...and look forward to watching it again. I like that it really stays focused on Christmas in all aspects: all the scenes...apparel...and make-up ...has magic...Christmas décor...and has a delightful, optimistic plot...with talented players. And the plot flowed very nicely! \"Christine\" is absolutely delightful and believable...and she is what made the movie so extra nice to watch! Santa looked, acted, and dressed as we expect a \"real\" Santa to be. (unlike some other movies.) The little boy played his part very well!...not annoying at all. Only slight downer: \"Dave\" (\"Sara's\" brother) was a bit too forward, too pushy trying to woo \"Christine\"...since he only knew her briefly. His approach should not have been over-bearing, but left to the viewer's imagination instead. But anyway, I think the way this movie is...a Christmas movie with magic... is the way they should be... ...while some other Hallmark \"Christmas\" movies make attempts to combine Christmas and magic, they fall very, very short (one ex: the overly-hyped \"Northpole\")...as they stray from the point...to the point of annoying and boring since they include unrelated inner plots...while others have very annoying characters and/or unfit untalented players....and basically, have a lousy plot.",
         "this is a very heart warming Christmas movie starring summer Glau! (The Sarah Connor chronicles) Great family Christmas movie!!! I'm only disappointed I can't find any where to buy it! Great movie tho!!! 🎅 The whole movie from beginning to end is enthralling - I love the updated idea of Father Christmas and his family as well as helping out with other families for the Christmas holidays - bringing back that all too often lost Christmas spirit! Along with that lovely romantic twist! Since we in the UK no longer have Hallmark Channel - I'm hoping that this will soon be available to buy!!!",
         "With all the reruns and infomercials of late and my personal intentions of avoiding stores until after the Christmas 'feeding frenzy' has ended....the Hallmark Channel's Christmas movies are a welcome refuge. Albeit predictable at times...most offerings are definitely 'feel good' and a spoonful-of-sugar antidote to the ills of an otherwise wonderful season. The storyline fits so many families today with parents so involved in making a living, that family life isn't as warm and closely woven as it could be. Many could use the assistance of one of Santa's magical elves. P.S. I'd like to see more of Steve Larkin. So believable as Santa and anyone else as well."
      ],
      "genres": [
         "Family",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "PixL Entertainment",
         "Mediapool Production",
         "Ashton Productions"
      ],
      "summaries": ["Sara Vancamp ('Eva LaRue') is a busy mom with no Christmas spirit. Christine (Summer Glau), an elf from Santa's village who wonders if there could be more to life than making toys in the North Pole, comes to the real world to help the VanCamp family, mom Sara (La Rue), dad Scott (Gauthier), and their two kids, re-discover Christmas spirit."],
      "budget": 0
   },
   "movielensId": 158936,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2012-12-09",
      "dvdReleaseDate": null,
      "directors": ["Bradford May"],
      "runtime": 84,
      "movieId": 158936,
      "title": "Help for the Holidays",
      "mpaa": "NR",
      "actors": [
         "Summer Glau",
         "Dan Gauthier",
         "Eva LaRue",
         "Izabela Vidovic",
         "Mason Cook",
         "Madison Dae Clarion",
         "Jessie Lande",
         "John Brotherton"
      ],
      "imdbMovieId": "2374486",
      "originalTitle": "Help for the Holidays",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["04iqbtrzw5I"],
      "plotSummary": "Although she loves Christmas, Santa’s elf Christine (Summer Glau) wonders if there could be more to life than making toys in the North Pole. When Santa receives an emergency wish from a little boy in Los Angeles, he puts Christine on a special assignment, sending her to L.A. to give the VanCamp family—mom Sara (Eva La Rue), dad Scott (Dan Gauthier), and their two kids Ally (Izabela Vidovic) and Will (Mason Cook)—a holiday wake-up call. Will Christine fail her assignment and be sent back to the North Pole for good, or will the VanCamps come to their senses about the meaning of Christmas?",
      "tmdbMovieId": 149235,
      "avgRating": 2.16667,
      "releaseYear": "2012",
      "numRatings": 3,
      "posterPath": "/nDBBhIcAn17VUX030Iy0OPIHVlt.jpg"
   }
}