{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "christmas",
         "id": 207317
      }],
      "imdb_id": "tt3131532",
      "video": false,
      "title": "Catch a Christmas Star",
      "recommendations": [
         239899,
         311093,
         299576,
         348393,
         421629,
         367537,
         213901,
         299583,
         145343,
         367538,
         360603,
         363482,
         81394,
         241999,
         249062,
         410317,
         363479,
         235662,
         127061,
         144785
      ],
      "backdrop_path": "/qDdaPMUGjQJQvg4GPsIa3XjuiNB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nikki Crandon",
               "gender": 1,
               "credit_id": "52fe4e79c3a36847f82927df",
               "name": "Shannon Elizabeth",
               "profile_path": "/c7l0KsU2PAXXseofmSvsmIMQH1N.jpg",
               "id": 21596,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chris Marshall",
               "gender": 2,
               "credit_id": "52fe4e79c3a36847f82927e3",
               "name": "Steve Byers",
               "profile_path": "/idVVOo2FaOTK2EMBNy34Pesqi4H.jpg",
               "id": 43292,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sophie Marshall",
               "gender": 1,
               "credit_id": "546ab75d92514101e9000643",
               "name": "Julia Lalonde",
               "profile_path": "/mRDAANUyEunljIc3TV0zslhilRr.jpg",
               "id": 1386502,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jackson Marshall",
               "gender": 2,
               "credit_id": "546ab7a7c3a3680d780006e3",
               "name": "Kyle Harrison Breitkopf",
               "profile_path": "/eKweGt5MZqWg3ZlCFxvvz186sFf.jpg",
               "id": 1144353,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jason",
               "gender": 2,
               "credit_id": "5a2e123fc3a3680b9d14acec",
               "name": "Billy MacLellan",
               "profile_path": "/1tgrMzS5fvRsqU8OlcvDYY7HEnN.jpg",
               "id": 63814,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "546087030e0a26490d001390",
               "name": "John Bradshaw",
               "profile_path": null,
               "id": 224214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546087490e0a262ca20023f2",
               "name": "Rickie Castaneda",
               "profile_path": null,
               "id": 1057526,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.797227,
      "production_countries": [],
      "id": 238304,
      "vote_count": 16,
      "budget": 0,
      "overview": "Nikki Crandon (Shannon Elizabeth) is one of the biggest pop stars on the planet. Whether she's singing the National Anthem or promoting her latest album, everyone knows who she is—none more so than New Jersey high school basketball coach and widower Chris Mitchell (Steve Byers), who was Nikki's first love in high school. When Chris' 10-year-old daughter Sophie (Julia Lalonde) finds out her dad still has feelings for the singer, she takes matters into her own hands. With her 8-year-old brother Jackson (Kyle Breitkopf) in tow, Sophie succeeds in reuniting the two. But when a misunderstanding and the growing glare of the public spotlight threaten Chris and Nikki's happiness, one can only wonder: will fame get in the way of a Merry Christmas?",
      "similar": [
         11395,
         13673,
         9479,
         17979,
         25842,
         9279,
         9021,
         11881,
         1581,
         1585,
         634,
         8871,
         10719,
         10147,
         13377,
         18147,
         51052,
         296100,
         149235,
         772
      ],
      "original_title": "Catch a Christmas Star",
      "runtime": null,
      "poster_path": "/lL5MsQjF3svoPbAfksLHRWlAjot.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-11-17",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Bradshaw"],
      "runtime": 0,
      "synopsis": null,
      "writers": ["Rickie Castaneda"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3131532/",
      "coverLink": null,
      "actors": [
         "Shannon Elizabeth",
         "Steve Byers",
         "Julia Lalonde"
      ],
      "reviews": [
         "Yes everything about this movie is predictable, but so is every Hallmark movie. I miss Hallmark's regular scheduled late at night program during the holidays and I don't care for most of the Christmas movies, but this one is one of my favorites. There's just something about it. From the second the movie starts, Chris and his kids are people you want to be happy. You can tell he's a great dad who doesn't have much happiness in his life since his wife died. Even Shannon Elizabeth's character Nikki is someone you want good things for. There's just something about reconnecting with your high school sweetheart. This doesn't have many good reviews on IMDb but I think it's great.",
         "These days so many movies are filled with sex, foul language, and revenge filled plots. It is refreshing to see a movie directed toward family values. Main characters, Shannon Elizabeth's and Steve Byers' on set chemistry was good and realistic. They give viewers a small glimpse into the downside of being famous. Byers' on screen children played by Julia Lalonde and Kyle Harrison Breitkopf were good little actors in their portrayal of today's youth. Many children are wise beyond their years and flip lip. All and all, I enjoyed it! The only negative parts were, of course, the record producer's acting, which was \"really bad\" and the ending. It included Byers' going out on stage professing his love, little unrealistic. At a real concert, he would have never made it passed security. The writers should have improved on that scene. Also, I loved the assistant. His facial expressions and comedic antics were to die for!",
         "The movie was a warm and heart felt movie. The fact that children of a single parent care enough about their parents happiness in a true statement in day to day living. We may all want to think differently about that but children sense and know when a parent is missing something and they are also missing things during those times. As for the acting when watching Shannon Elizabeth and Steve Byers they both transmitted their feelings and passion across the screen to where my family could actually feel the pain and joy that they shared. Julia Lalonde may have shown characteristics of an older child but again children can amaze you with their inner thinking. As for Zach Werner I remember him from Canadian Idol and his personality then and now came across the same. Not sure if he has a soft side to his personality but in the part he played he did come across hard as some people in the music industry may be. Overall this movie is one that I would watch over and over and the music in this movie was fantastic.",
         "From the beginning of this movie, I was on the edge of my seat, and not in a good way. The plot was even more ridiculous and unbelievable than 99% of romantic Christmas movies. Don't get me started on how many impossible things happened. One problem was that there wasn't much romance. The movie was far more about the struggles created by Nikki's fame. And it was barely about Christmas except for some of the songs and the dates it was set in. When I watch a Christmas movie, I want heartwarming moments. I welcome tradition and nostalgia. This movie had none of that. I wouldn't even call the ending that heartwarming. I thought the acting was bad. The kids weren't even cute enough to save the movie. Shannon Elizabeth had so many shots of a fake smile plastered on her face. If there was chemistry between her and Steve Byers, it was squeezed in with an eyedropper because the two of them had very little screen time together that was positive rather than negative. Christopher Jacot managed to add some humor despite the fact that he overplayed his character to the point of cliché. There was quite a bit of singing in this movie, far more than typical in this kind of movie. It ate away screen time that could have been spent on building chemistry between the leads. I'm guessing that Shannon Elizabeth did her own singing, in which case that's one plus for her, but I'm really not sure it was her. I found one site that says it was her.",
         "I had no idea who Shannon Elizabeth was. As I watched this movie, she was so full of herself and her acting was so \"self aware\" ( like a smiling in the mirror all the time effect) that I looked her up. I have never seen her in anything else.The main Dad's daughter was a little brat to me where they thought they wrote her part as a cute kid helping her Dad find love, the actress overplayed it and was obnoxious. I did not find her cute and sweet trying to set up her Dad with \"Nicki\" the rock star old high school girlfriend. Ugh. Nicki makes speeches about fame, the paparazzi and her life as a famous person and it is so cringe-worthy. All the scenes where she is a big famous person felt so fake and cheesy. The Dad and her do not any chemistry either. The other bit actors felt like they got hired from local theater or were extras. The actor who played the Dad was not bad. I have never seen him again either. I watch lots of Hallmark not so great Holiday movies, but this one was below even that standard.",
         "Romantic made-for-TV Christmas movies are a specialty niche that has plenty of fans. I am a man, and both my wife and I enjoy a well-made sentimental Christmas movie; we both often start blubbering when the lead romantic couple finally overcome their obstacles and get together. As of 2013, when A Christmas Star is being \"released\" on TV, we feel there has been a recent upswing in the quality of Hallmark Christmas movies - better acting, better dialog and better cinematography. Unfortunately, this recent upswing in production values somehow by-passed A Christmas Star. The biggest flaw in this film is its unrealistic plot twists and dialog. It's plot is built on music studio executives behaving like Mafia heavies because their recording star has done something very innocent and ordinary. And, there is a 10-year old daughter who is supernaturally wise and talks eloquently to her Dad as if he is a child and she is the adult. Even the climactic scene, which involves a Christmas Eve concert, progresses along an increasingly illogical and impossible course. In addition,the characters played by Shannon Elizabeth and Steve Byers, seem to have very little romantic chemistry. The combination of dialog and acting performances is such that many of the key actions taken by the main characters seem illogical and unrealistic. If you are an incurable romantic and huge fan of the made-for-TV romantic Christmas movie genre,then you might well enjoy A Christmas Star despite its many problems. But I found that my eyes were rolling frequently and that they never teared up. So, I suggest you might pass on A Christmas Star. There are plenty of better romantic Christmas films this holiday season.",
         "It seemed a little out of character. Shannon Elizabeth, having played in several sultry roles and in a few other movies where clothes came off,was cited as the lead star in a Hallmark movie, a network that thrives on cutesy and family oriented entertainment. The movie is rated G. Why would the casting director be interested in Shannon Elizabeth? While this question is never really answered, her having been cast in the lead provided at least two opportunities for cross-referencing Elizabeth's other appearances, particularly in her brief appearance in Love Actually. Shortly past the middle of the movie, Elizabeth's assistant, Carmine, tries to advise her about how to express her feelings to the male lead character Chris Marshall. He asks her if she had ever seen the movie \"Love Actually,\" likely a deliberate reference to a movie she has not only seen, but had played in. But what has to be deliberate is that the character name of the love of her life, Chris Marshall, is phonetically identical to the name of the actor who played Elizabeth's boyfriend in Love Actually, Kris Marshall.",
         "I enjoy Hallmark Xmas movies. Where an average gal can become a Queen yada yada. Always a stretch but such things happen. As for casting, Nikki and Chris have little on screen chemistry. Daughter Sophie shines and the all time star is Nikki's assistant Jason. Sadly this is a story without an ending. Would be different if it was titled Taylor Swift Becomes A Housewife. Chris and Nikki admit they live in two different worlds that totally clash, super star and ex high school jock who still loves visiting the old burger joint. Knowing the two must, in the end, be together the screenwriters decided to punt on the nearly impossible to wit: an ending that sees both worlds co-existing with one another. Instead, boy kisses super star and fade out with not a glimmer of any hope they can make it work without destroying his life or having her give up a lifetime of achievement and dreams. Could there be a 'happy ending'? Yes, with a decent screenplay. I could do without great thought. My ending: Fade-in to NYC TV morning show. Nikki is introduced as new co-host. Nikki greets audience and sends loving message to Chris and kids who live just across the bridge. Nikki sings the first of her daily songs to millions of fans. fade out.",
         "A great title wasted on a lousy movie! This was like: \"Don't judge a book by its cover.\" (even the DVD cover gives an impression too that one can anticipate it being a wonderful movie pertaining to Christmas.).....It seemed like the story writers had \"writers' block,\" and this was the best they could come up with for the entire plot.......Seems like the casters had some issues too about not being able to caste talented players.....which might have saved it (hardly)........I know what this movie was about, yet I really, really fail to see the point of why it was made. It had nothing captivating...nothing special...nothing worth remembering...the singing was depressing......It was just plain boring.......I also fail to see the relationship to merit being classified as a \"Christmas movie.\"..........Just because a certain situation occurs and is staged around Christmas time, doesn't necessarily make it a Christmas movie. I suppose it was because of having a Christmas tree on the set and the \"Christmas\" songs, but that didn't save it.",
         "Catch a Christmas Star is an average Christmas TV Movie about a music star who meets her high school sweetheart years later. It's a typically cheesy and predictable tale. Shannon Elizabeth isn't convincing as the music star Nikki and the lead male Steve Byers whilst suitably good looking is too wooden. To make matters worse there is little chemistry between them both which makes the story even less unlikely than it already is. To be fair there are a few funny moments and these are all provided by the singers assistant Carmine played by Christopher Jacot. He is easily the star of this film. One plus was that unlike many of these type of movies, the kids in the film ( played by Julia Lalonde and Kyle Harrison Brietkopf are actually quite good and aren't either sickly sweet or just plain annoying. There is nothing special about this film but it will have it's market and is moderately entertaining."
      ],
      "genres": ["Family"],
      "productionCompanies": ["Chesler/Perlmutter Productions"],
      "summaries": ["With the help of his two precocious kids, a widower reconnects with his high school sweetheart, who just happens to be one of the biggest pop stars on the planet."],
      "budget": 0
   },
   "movielensId": 158926,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-11-17",
      "dvdReleaseDate": null,
      "directors": ["John Bradshaw"],
      "runtime": 0,
      "movieId": 158926,
      "title": "Catch a Christmas Star",
      "mpaa": "NR",
      "actors": [
         "Shannon Elizabeth",
         "Steve Byers",
         "Julia Lalonde",
         "Kyle Harrison Breitkopf",
         "Billy MacLellan"
      ],
      "imdbMovieId": "3131532",
      "originalTitle": "Catch a Christmas Star",
      "genres": [
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nikki Crandon (Shannon Elizabeth) is one of the biggest pop stars on the planet. Whether she's singing the National Anthem or promoting her latest album, everyone knows who she is—none more so than New Jersey high school basketball coach and widower Chris Mitchell (Steve Byers), who was Nikki's first love in high school. When Chris' 10-year-old daughter Sophie (Julia Lalonde) finds out her dad still has feelings for the singer, she takes matters into her own hands. With her 8-year-old brother Jackson (Kyle Breitkopf) in tow, Sophie succeeds in reuniting the two. But when a misunderstanding and the growing glare of the public spotlight threaten Chris and Nikki's happiness, one can only wonder: will fame get in the way of a Merry Christmas?",
      "tmdbMovieId": 238304,
      "avgRating": 4.25,
      "releaseYear": "2013",
      "numRatings": 2,
      "posterPath": "/lL5MsQjF3svoPbAfksLHRWlAjot.jpg"
   }
}