{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "food critic",
            "id": 18295
         },
         {
            "name": "fire fighter",
            "id": 192094
         }
      ],
      "imdb_id": "tt1849868",
      "video": false,
      "title": "A Taste of Romance",
      "recommendations": [
         289520,
         456213,
         150669,
         475374,
         407334,
         217128,
         413440,
         20564,
         40900,
         117878,
         317118,
         43735,
         343858,
         127061,
         245169,
         234951,
         213901,
         374606,
         229703,
         377428
      ],
      "backdrop_path": "/o82UzdKBs4EW2vk90Hdly6aU9uP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sara Westbrook",
               "gender": 1,
               "credit_id": "52fe49649251416c910abd89",
               "name": "Teri Polo",
               "profile_path": "/67k0q1YYVIeMd0wZalfqJ2FYLuu.jpg",
               "id": 10399,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gill Callahan",
               "gender": 2,
               "credit_id": "52fe49649251416c910abd8d",
               "name": "James Patrick Stuart",
               "profile_path": "/pMrM9hZ2fEieEw4H46mHAhf7Q8T.jpg",
               "id": 105641,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Hannah Callahan",
               "gender": 1,
               "credit_id": "56e5d63d9251416d4600786f",
               "name": "Bailee Madison",
               "profile_path": "/bWrZAukMKC8cSvHSJs5SaDbh5z.jpg",
               "id": 54479,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Officer Ramirez",
               "gender": 2,
               "credit_id": "52fe49649251416c910abda3",
               "name": "Alexander Bedria",
               "profile_path": "/sHpiVvHy6jAr3nOErWYdvGHFhex.jpg",
               "id": 979075,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Chief",
               "gender": 2,
               "credit_id": "52fe49649251416c910abda7",
               "name": "Jack Conley",
               "profile_path": "/u58ICPTEy2y1R6p4XM5c9tdTXQr.jpg",
               "id": 21675,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jane",
               "gender": 1,
               "credit_id": "56e5d5739251416d40007f39",
               "name": "Ashley Cusato",
               "profile_path": "/j4ZDE3xjmjaN46mddyhkC6oN61d.jpg",
               "id": 158155,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Elise",
               "gender": 1,
               "credit_id": "56e5d66e92514115a2000fb9",
               "name": "Simone Missick",
               "profile_path": "/jABU6gXQ1HEG3DeLGziLS7vk7Ez.jpg",
               "id": 1034765,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Taylor",
               "gender": 1,
               "credit_id": "57e5d1fe925141395e000f06",
               "name": "Amandla Stenberg",
               "profile_path": "/w1rlIXKUZFeVU1JRmZI2B6YBSk2.jpg",
               "id": 561869,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Customer #2",
               "gender": 0,
               "credit_id": "56e5d618925141518e0008af",
               "name": "Peggy Dunne",
               "profile_path": "/sduXNJyYUzmhFgUndZI1e5mrACk.jpg",
               "id": 1353272,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Customer #4",
               "gender": 1,
               "credit_id": "56e5d62bc3a3685aa400789e",
               "name": "Dana Foist",
               "profile_path": "/ybsBhnBGzHDSsqj2e2IfIyxqgHB.jpg",
               "id": 1590729,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "News Producer",
               "gender": 1,
               "credit_id": "56e5d651c3a3685a9e007e98",
               "name": "Mercy Malick",
               "profile_path": "/um3k6lzN5V8KKgAUzqbCXls7LhZ.jpg",
               "id": 155293,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Hot Date",
               "gender": 1,
               "credit_id": "56e5dd41925141518e00098f",
               "name": "Veronica Parks",
               "profile_path": "/mdHW2xEgAtHX9Q1LFv4JFLCUXRt.jpg",
               "id": 1590739,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe49649251416c910abd85",
               "name": "Lee Rose",
               "profile_path": null,
               "id": 202122,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49649251416c910abd93",
               "name": "Lincoln Lageson",
               "profile_path": null,
               "id": 136555,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49649251416c910abd99",
               "name": "Evan Laughlin",
               "profile_path": null,
               "id": 1048613,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49649251416c910abd9f",
               "name": "Jennifer Notas Shapiro",
               "profile_path": null,
               "id": 1048614,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59f5b931c3a3682dd401021a",
               "name": "Dora Hopkins",
               "profile_path": null,
               "id": 1323242,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.418199,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85887,
      "vote_count": 16,
      "budget": 0,
      "overview": "Uptight French chef, Sara Westbrook, gets fired up when her upscale café, Chez Varenne, is suddenly overshadowed by a new restaurant moving in next door run by a group of rowdy firemen. Led by handsome former fire fighter Gill Callahan and his friend Danny, The Five Alarm Grill is soon a big success while Sara and Patsy, her pastry chef, struggle to bring in customers.  Sara suddenly softens when she meets Gill's ten-year-old daughter Hannah. Ignoring the obvious tension between her dad and Sara, Hannah is soon playing matchmaker. Can Gill and Sara's burgeoning romance survive the temptation to compete with each other, or will the heat of competition drive them apart?",
      "similar": [
         788,
         9502,
         639,
         72207,
         66945,
         58224,
         35056,
         928,
         376867,
         395991,
         167726,
         41210,
         295964,
         8346,
         9462,
         7549,
         426264,
         25468,
         2924,
         9716
      ],
      "original_title": "A Taste of Romance",
      "runtime": 84,
      "poster_path": "/hNJ1BDh1D5ZBsbkSG0WdVxtUbC7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Hallmark Channel",
         "id": 6425,
         "origin_country": ""
      }],
      "release_date": "2012-01-14",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lee Rose"],
      "runtime": 0,
      "synopsis": null,
      "writers": [
         "Evan Laughlin",
         "Jennifer Notas Shapiro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1849868/",
      "coverLink": null,
      "actors": [
         "Teri Polo",
         "James Patrick Stuart",
         "Alexander Bedria"
      ],
      "reviews": [
         "Finally, a movie that is heart-warming without over-the-top melodrama that dominates romantic movies today or the unnecessary crutch of sex! My husband and I watched it on \"pixl\" a movie channel (that I did not know about before) and we liked it so much that I actually watched it again with my 8 year old daughter because it dealt with aspects of love,and romance without the hysteria and showed how real- life situations can be full of emotional ups and downs. Sara and Gill own restaurants next door to each other and start off the wrong foot with each other; however through a series of situations, manage to set things right and eventually fall in love with each other. The director has dealt with these situations not only with a pace that it engaging and humorous but also without resorting to sex which unfortunately so many movies these days cannot seem to do without. What a breath of fresh air; Kudos to all the artists in the movie. A wonderful performance with excellent direction!",
         "For a TV movie, this was an engaging movie, but the highlight for me was Bailee Madison. Before this movie, I was not familiar with this very talented and versatile young actor, though now I realize that I have seen some of her other work. She was great! She convincingly rides the emotional gamut in a childlike manner that was refreshing. I found Teri Polo's acting a bit over the top with how uptight she was, but maybe there are actually people out there like that. She did refresh my \"how to make a bechamel sauce\" skills. Her assistant chef, Romy Rosemont, had perfect timing again and again, and was the one who consistently made me laugh. It is a movie with no real surprises, but for me, it hit the sweet spot on love.",
         "I absolutely loved this movie. I had no idea what to expect and just started watching while doing something else. And after like 2 minutes I dropped everything and only had eyes for the movie. If you want to feel good, or maybe you want to see a romantic movie, or it's the holiday season - > watch this. It's great. It made me sad, it made me cry tears of joy, it made me laugh, it made me wanna hug my boyfriend. And then when I looked it up on IMDb I saw it didn't even have a picture, and the score was only 6,1. How is it possible that some people didn't like this movie? And that so little people have seen it? Only 360 people watched it and it's been out there for like a year now. I am going to recommend it to everyone from now on, and I really hope the director gets the credit he deserves.",
         "This typical Hallmark film was very nicely done. A widower and former fireman, opens a restaurant right next door to a woman who has just opened a French restaurant. While she immediately bonds with his young precocious daughter, the two can't seem to get along at the beginning. For starters, she complains about his loud music which she feels is a detriment to the ambiance of her place. By Hallmark standards, the two eventually fall for each other. Peter Shaughnessy, of \"The Nanny,\" co-stars as a food critic. Our guy shows what he is made of when our gal goes to his restaurant to cook when his daughter is injured in an accident. It is just then that our critic goes to review his restaurant but is enticed by what he sees at her. You'll just enjoy the ending is this breezy story.",
         "These past few days i have watched a lot of hallmark movies and i have to say this one is by far the best one yet.If you liked No Reservations and the like then you will definitely like this one! The storyline may not be all that original but its redone very well with its own unique spin. The performances are amazing, the characters very real and so are the stories they tell. Hats off to Bailee Madison. Of course as said before the main and other supporting actors did a good job as well. The entire movie seemed very realistic, not over the top and doesn't try too hard to create a romance or a situation that influences romance; thats why I recommend it. a good heartwarming, funny and light and realistic movie. The best in the series of Hallmark movies i have watched this week!",
         "A Taste of Romance is one of the better made and more enjoyable Hallmark films. Sarah Westbrook (Teri Polo) and Gill Callahan (Jame Patrick Stuart) are complete opposites who own and run neighboring restaurants with polar-opposite strengths. Both characters initially seem unlikeable as they clash with each other, but we (the audience) start to genuinely like them as they first slowly learn to co-exist, and then become attracted to each other. The catalyst for their budding romance is Gill's young daughter, Hannah -who is beautifully acted by Bailee Madison. Indeed, a great strength of this movie is that it is well-acted and has characters you can believe in. Teri Polo does a fine job of portraying a complicated woman whose passions and hangups are a significant barrier to new romance. James Patrick Stuart manages to bring warmth and likability to the male romantic lead role. And Bailee Madison delivers one of the best and most believable depictions of a young child that I have seen in a Hallmark TV movie. I do wish there had been a bit more chemistry between the romantic leads - perhaps, a few more lingering looks, a few more tears when setbacks occur. But the feel-good ending is emotionally satisfying and delivers what the Hallmark audience wants. And the story that brings us to that ending never makes us roll our eyes in disbelief nor does it fail to hold our interest. A well-done movie! Recommended.",
         "LOUD music. this TV movie's scenario premise is just too absurd. the guy, a widower with a teenage daughter, leased a space for his junk pizza business, from day 1 when he started the remodeling of his joint, he brought in radio and turned its volume to the extreme, bombarded the neighboring french restaurant. well, here's the first stupid arrangement to have a red-neck pizza joint next to a classy french restaurant. may i ask, what kind business neighborhood is this? how come a guy could be such an arse as a retired fireman when his neighbor complaining the loud and very disturbing music, his answer and response to such complaints would be, so what? this is a free country, i have the right to turn my music volume as loud as i like. no wonder this rude and arrogant bastard's wife would die so early. the causes of her death were obvious: his arrogance and his deafening loud music. the daughter role is very likable and, the french chef, a beautiful female, an American sweetheart, neither needed such arse to be either the father or the next-door neighbor business owner. file a complaint to the landlord and to the city for noise control code. romance? not in a million years!",
         "I knew this was a Hallmark film so needless to say my expectations were not very high. But to my surprise, I found myself not only entertained by A Taste of Romance, but actually liking it and being moved by it. The story is simple: two restaurants clash, but then the uptight owner of one and the down to earth owner of the other start growing fond of each other. There's romance in the air! It's really quite good how everything plays out, the performances all around are much better than expected for a TV movie, especially a Hallmark one. Teri Polo, Bailee Madison, and James Patrick Stuart work well together, their interactions work. The film is very obvious, lacks any subtleties, buts that's my only major complaint about it. It's not a good movie by Hollywood standards, but it's a good TV movie."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Larry Levinson Productions"],
      "summaries": ["Widower Gill Callahan retired from the fire department after a tragedy. Helped out by some mates, he starts a diner, offering simple food to their taste. The matching music is too much for the elitist taste of his neighbor, Sara Westbrook, who just started a French restaurant and aspires a refined reputation utterly clashing with the working class neighborhood, leading to a prank war. Gill's daughter Hannah befriends Sara and ends up acting as matchmaker, helped by fate in what seems tragedy."],
      "budget": 0
   },
   "movielensId": 158946,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-01-14",
      "dvdReleaseDate": null,
      "directors": ["Lee Rose"],
      "runtime": 84,
      "movieId": 158946,
      "title": "A Taste of Romance",
      "mpaa": "",
      "actors": [
         "Teri Polo",
         "James Patrick Stuart",
         "Bailee Madison",
         "Alexander Bedria",
         "Jack Conley",
         "Ashley Cusato",
         "Simone Missick",
         "Amandla Stenberg",
         "Peggy Dunne",
         "Dana Foist",
         "Mercy Malick",
         "Veronica Parks"
      ],
      "imdbMovieId": "1849868",
      "originalTitle": "A Taste of Romance",
      "genres": [
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["xMJ_cmsrezU"],
      "plotSummary": "Uptight French chef, Sara Westbrook, gets fired up when her upscale café, Chez Varenne, is suddenly overshadowed by a new restaurant moving in next door run by a group of rowdy firemen. Led by handsome former fire fighter Gill Callahan and his friend Danny, The Five Alarm Grill is soon a big success while Sara and Patsy, her pastry chef, struggle to bring in customers.  Sara suddenly softens when she meets Gill's ten-year-old daughter Hannah. Ignoring the obvious tension between her dad and Sara, Hannah is soon playing matchmaker. Can Gill and Sara's burgeoning romance survive the temptation to compete with each other, or will the heat of competition drive them apart?",
      "tmdbMovieId": 85887,
      "avgRating": 3.625,
      "releaseYear": "2012",
      "numRatings": 8,
      "posterPath": "/hNJ1BDh1D5ZBsbkSG0WdVxtUbC7.jpg"
   }
}