{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "tattoo",
            "id": 331
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "plastic surgery",
            "id": 4585
         },
         {
            "name": "memory",
            "id": 10937
         },
         {
            "name": "flashback",
            "id": 187844
         }
      ],
      "imdb_id": "tt0326121",
      "video": false,
      "title": "Second Nature",
      "recommendations": [],
      "backdrop_path": "/j3xP7OA4lA3abtSwP6mXqrkk4Dn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Paul Kane",
               "gender": 2,
               "credit_id": "52fe47c59251416c91075277",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kelton Reed",
               "gender": 2,
               "credit_id": "52fe47c59251416c9107527b",
               "name": "Powers Boothe",
               "profile_path": "/3nNL6AvMAYq0BmHKM79RnRZVq3i.jpg",
               "id": 6280,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Harriet Fellows",
               "gender": 1,
               "credit_id": "52fe47c59251416c9107527f",
               "name": "Louise Lombard",
               "profile_path": "/e7UvRkibpGjthTxOtYQp8bYTaDQ.jpg",
               "id": 20805,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c59251416c91075273",
               "name": "Ben Bolt",
               "profile_path": null,
               "id": 137932,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c59251416c91075285",
               "name": "E. Max Frye",
               "profile_path": null,
               "id": 68928,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.242074,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80520,
      "vote_count": 3,
      "budget": 0,
      "overview": "Everything is not as it seems for a man who recovers from a plane crash in which his family is killed. After plastic surgery and rehabilitation, he determines that he worked for a secret agency for which he was an assassin. His former boss puts him back to work to assassinate a political leader, but when he proves unable to pull the trigger, it is he who becomes the target for assassins. As he avoids capture, the story unfolds about his true past and the reason why he has a tattoo of \"chilly willy\" inside his lip.",
      "similar": [
         657,
         667,
         646,
         682,
         699,
         708,
         6637,
         253,
         121856,
         691,
         2252,
         1948,
         2501,
         2503,
         186,
         77,
         101,
         668,
         954,
         714
      ],
      "original_title": "Second Nature",
      "runtime": 90,
      "poster_path": "/aTBlCu349qp1cJ9UZteEao81QOU.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Granada Entertainment",
            "id": 20353,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "El Dorado Pictures",
            "id": 23034,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Turner Network Television",
            "id": 678,
            "origin_country": "US"
         }
      ],
      "release_date": "2003-06-22",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "They made him an assassin. Now he's the target.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ben Bolt"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["E. Max Frye"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0326121/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNDQ3Nzk4NjA3M15BMl5BanBnXkFtZTcwOTU4NDQyMQ@@._V1_UY268_CR7,0,182,268_AL_.jpg",
      "actors": [
         "Alec Baldwin",
         "Powers Boothe",
         "Louise Lombard"
      ],
      "reviews": [
         "Don't expect any great acting performances, from any of the actors or actresses, in `Second Nature'; because there aren't any. Alec Baldwin, who has the starring role, usually gives a far better performance that he offers in this movie. Therefore, one might assume the script itself is simply not a good performance vehicle. Powers Boothe's lackluster performance might also be explained by this. However, the movie is worth watching for one reason; the plot. For the first half of the movie, one might think the plot is simply full of holes that never get filled. But, this is not the case. As the movie progresses, you might find yourself saying ` oh ya, I should have seen that coming'. So, don't give up on this film in the first half. Just keep watching; you'll see what I mean.",
         "A most intriguing action/thriller. The movie is extremely watchable - partly thanks to it's made for TV rating and gearing is about perfect. Not an overly complicated film. Alec Baldwin is cast ala \"Teacher\" in George Dawes Green's The Juror. He's a nebulous assassin type, keeps you guessing, but you know he has skill and know how. The refreshing part is you aren't sure what motivates him or where he got his training or why. Baldwin is king of this style casting. If you like action where get spoon feed and learn as the movie goes, you'll like this. I don't see anyone really guessing where this is headed while you view the movie. Too unique. Throws a high punch and while you see that coming, catches you in the stomach with a quick jab. I've always been a fan of programs like Magnum PI and Simon and Simon, and this movie caters to speed and plot like these shows did so well. As good as any other \"7\" action flick for my rental dollar.",
         "Interesting but otherwise implausible thriller finds a man (Baldwin) with problems to remember his own identity. Along the way, he is harrased by a group of government agents (or so they seem to be) and have to fight for his life. The movie has standard pace but is not dull or uninteresting. In fact, this one is just a routine entry made with some competence. I give this a 06 (six).",
         "I thought this movie had an above average plot, and actually looked like it would be better than the Borne Identity at first. However, shoddy acting and an anticlimatic finish to the movie really don't help it any. If you're looking for an action movie, don't rent this as it has very little. If you're looking for a psychological thriller, don't rent this as the plot twists become contrived at the end to help along the plot. As a matter of fact, I simply can't think of anyone who would feel compelled to see this. Just an average movie that would be worth watching if you catch it on TV and don't have anything else to do. Don't let your expectations get too high early, however.",
         "This is a good, interesting thriller about an alleged hitman's effort to resolve his own doubts about his identity. The movie stars Alec Baldwin, who makes any movie at least 2 points better just by being in it. While it is a made-for-TV movie, it is certainly worth renting (or seeing in a theater). Rated it as 8 points (out of 10).",
         "I found this movie at a video store, but I was not sure if it was any good (Thick as Thieves was not a good movie!) I took a chance, and I liked it! Think of it as an English movie, not an American. This is not an action movie with lots of explosions. This is a nice realistic little thriller! The actors are good, nice locations and a fine pace! So if you like English movies, see it! But if you need American action you might be disappointed! I give it 6 out of 10!",
         "Second Nature will not go down as one of the worst tv movies of 2003, but perhaps the worst of All Time. Formulaic, derivative, and every performance phoned in, from far, far away. Everyone associated with this project should have a hard time looking in the mirror.",
         "Second Nature is a low grade Bourne clone that benefits from two great actors in the lead roles. Slight, airy and inconsequential, it inhabits the clandestine corner reserved for middle-of-the-road espionage ventures neatly. Alec Baldwin plays a mysterious man who recovers from a plane crash that killed his family, left with heavy amnesia and confusion surrounding his past. When a shadowy agency bigwig (Powers Boothe) contacts him claiming he used to be an assassin for his outfit, he's thrown back in the world of high profile contract killing, the world he came from, allegedly anyway. Nothing is as it seems though, and of course his boss turns out to be a bad dude, which gives Boothe a chance to ratchet up the intensity. The film is pretty much average throughout, until we find out Baldwin's origins and arrive at a fairly thoughtful ending with some work put into storytelling, the first signs of a creative pulse in the film beyond garden variety plot twists. Baldwin is always great, whether on the protagonist's or antagonist's bench, and he sells the material well enough.",
         "This universe is full of mind boggling questions - Is there a higher force controlling our destiny, or are we at the mercy of nothing but science? Is there Extra-Terrestrial Intelligence out there in this vast universe, or is Life on Earth nothing but a glitch, an accidental heartbeat in the otherwise dead vacuum of space? How has Alec Baldwin made a career as an actor? Let it never be said that I dislike Alec Baldwin - Au Contraire, I have the highest respect and admiration for a man who, with a deficit of both looks and talent, has forged a living in the most vacuous and saturated industry in the world. Alec Baldwin wakes up from an accident and cant remember anything. The plot then dallies around a bit, before coming to an ending so ridiculous, you wonder if the screenwriters had a dare to see how absurd they could make the movie before the execs said 'NO'. Al dresses in a tux and fires a gun at one point, but that scene doesn't really fit with the movie. I have a sneaking suspicion that he forced a clause into his contract that went something like. 'During one scene, Alec Baldwin gets to dress sharp and fire a gun and do some cool action moves like jumping from a window or Kung Fu the baddie'. I imagine he wrote the clause with James Bond, Bourne or Scarface in mind - Cool, suave, Deadly. Well, whatever the clause was, it didn't work. Alec Baldwin plays a James Bond character so awkwardly, you actually think he is English. I mean really awkward. At one point I genuinely thought he was going to apologise to the baddie for shooting at him. This is a bad version of Unknown, which in turn is a bad version of The Bourne Identity. In fact, In the hierarchy of Amnesia movies, Second Nature is a Lowly Peasant, Living hand-to-mouth in a windowless cellar apartment located behind a noisy train station . The best that can be said in this analogy is that at least it hasn't hit rock bottom. It has a short fall to go before it is the homeless tramp, hanging out in public toilets and offering sexual favours in return for a swig of scrumpy. Oh yes, this memory-loss movie is not '50 first Dates'. After the movie, I reeled off a number of questions that the movie raised and never answered. I would repeat the list here but I only have 1000 words. The amount of questions this movie creates are only outnumbered only by the amount of clichés that it crams in. From the scene at a high society ball, where the villain looks down from a balcony at the carefree guests, to the Rocky Balboa Training montage, where Baldwin bulks up over one night. Then again, If you're looking for ground-breaking originality, you wouldn't have bought a film from the Bargain bin, where this movie was undoubtedly resting before it was picked up by your spendthrift fingers and brought home to watch. But not before checking out the reviews, just in case it really is awful. Still, If Alec Baldwin, A flimsy storyline and a 5.8 star review on IMDb isn't going to stop you, I certainly won't. So, to summarise: Second Nature: The lowlight of action movies, the highlight of Baldwin's Career.",
         "This is a very enjoyable amnesiac secret agent drama. Alec Baldwin is good at this sort of thing, and does well as the man who may or may not be who he thinks he is, or might be. He wakes up in hospital after a plane crash, and is slowly rehabilitated and treated by a woman psychiatrist for his mental trauma. Or so it seems. This is a British TV film well directed by Ben Bolt. Baldwin's acting abilities have been conspicuous ever since he played the lead in the excellent TV series DRESS GRAY (1986, see my review), which unfortunately has never been released on DVD. Here the demands placed upon him are few, because these action films generally just require a grim determination, occasional looks of puzzlement, some interplay with the female lead, getting shot at, leaping over walls, and so on, all of which happens here, of course. Here the woman psychiatrist is played by the British actress Louise Lombard, who has a nice voice and looks appropriately earnest. The villain is played by Powers Boothe, who really knows how to be quietly sinister when he wants to be. As is usual with these films, the hero has been subjected to mind-programming, an advanced form of brain-washing using high-tech techniques by means of brain probes and other ominous devices. Films have been made with actors and actresses which are then fed into his brain and false memories, which when he wakes up he believes are his genuine memories. The key moment in the film is when he sees his 'wife' appearing as a stewardess in a safety video on an airplane. He traces her and discovers that she is an actress, and not his wife at all. These stories about people not knowing who they are are intriguing, as who really knows who he or she is anyway?",
         "As happens more often than expected, I was tricked again by an opening scene. Crappy flashback shots, a guy in a hospital bed and uninspired opening credits. Oh-oh... Fortunately, the movie is not as lousy as the first scene. Helped by the 'stay cool' performance of Baldwin and Lombard, it is a fair watch. The plot is interesting, and it's good that they don't spoil the surprise quickly. The thing that ruins it a bit though is that the 'brainwash' method is portrayed very clumsily. Instead of showing a guy with electrodes on his head while watching pre-acted memories, why not simply a brain implant? Now, it really looks like a bad science fiction fantasy, which invades the further part of the story.",
         "Second Nature is a British production filmed mostly in the UK. Alec Baldwin plays an assassin working covertly for the U.S. government, who's recently recovered from injuries suffered in a plane crash in which his wife and two young daughters were killed. His first assignment upon returning to work goes badly wrong, and he subsequently discovers that his employers are trying to kill him. But whilst on the run, he begins to realise that aspects of his past don't make sense, and he may not be who he thinks he is. More interested in suspense as opposed to action, Second Nature is an entertaining thriller, with several unexpected twists. A large part of the fun in seeing various familiar British faces turn up in blink-and-you'll-miss-it bit parts: for example, Casualty's Georgina Bouzova as an airport check-in girl, and Lucy Punch from Hot Fuzz as a car hire rep. The biggest surprise is TV presenter and occasional actress Daisy Donovan, looking absolutely stunning in a small but important role as a woman from Baldwin's past. The camera positively adores her in this movie.",
         "It's a shame that quality actors like Baldwin and Booth have to succumb to lousy stories and scripts just for the money. But, hey, it's a cruel world... This is just another one of a long line of assassin thrillers that use all the usual narrative twists to try to make it appear more appealing than it is. Sure, it has some nice locations, it's a slick production, there is some good camera work and editing, and it's fairly well paced, overall. So, what's the real problem? Quite simply, the whole premise is just totally unbelievable. However, instead of spoiling a rotten story for you, I'll let you find out what it's all about, that is, if you can get through it. I managed, but only because I like Baldwin and I kept hoping that it would get better. It didn't. And, it had one of the most anti-climactic endings that I've seen for a long time. In fact, maybe never... But, it's harmless fun, I guess, if you've got nothing better to do.",
         "Short summary - no spoilers. Baldwin plays an assassin who recover from a plane crash where all his family dies. But he can't kill on his first assignment after the recovery and find out something is not what is seems to be. I find this movie at the local video rental store under the name \"Manden uden navn\" which in English would be \"The man without a name\". Baldwin does not have one of his best performances in this TV movie but it is okay as a time killer for a week night. I gave it 5 IMDB stars.",
         "(spoilers??) Without that stupid backstory, this movie might have been pretty good. Somehow though, the folks in the looney barn decided to make the film with a sci fi slant. Can you imagine a very bad crook, having plastic surgery to look like Alec Baldwin? Were they senile? The film does pretty good to keep us guessing, but when it's revealed about the brainwashing/plastic surgery crap, the movie goes to hell in a handbasket. Certainly better than some of Steven Seagal's films, but stupid nonetheless. 5/10 6/10 (story 1/10) Entertainment: 5/10 Replayable: 2/10",
         "The movie was awful. The production company should be required to pay a fine for wasting electricity transmitting this nonsense. There were too many holes in the plot. Why would the DOJ send a killer out to assassinate a world leader? If they weren't the DOJ, why would they send someone they thought would not do the job? To quote Butch Cassidy, \"Who are those guys?\" Apparently, the director does not know either because he never told us. The characters were unbelievable. They did not behave in any way that seemed to fit who they allegedly were. With the exception of the doctor, none of the characters were particularly compelling or likeable. If you want to waste money on the electricity required to watch this movie, feel free. Otherwise, run the opposite direction."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Sci-Fi",
         "Thriller",
         "War"
      ],
      "productionCompanies": [
         "TNT",
         "El Dorado Pictures",
         "Granada Entertainment"
      ],
      "summaries": ["Everything is not as it seems for a man who recovers from a plane crash in which his family is killed. After plastic surgery and rehabilitation, he determines that he worked for a secret agency for which he was an assassin. His former boss puts him back to work to assassinate a political leader, but when he proves unable to pull the trigger, it is he who becomes the target for assassins. As he avoids capture, the story unfolds about his true past and the reason why he has a tattoo of \"chilly willy\" inside his lip."],
      "budget": 0
   },
   "movielensId": 159046,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "2003-06-22",
      "dvdReleaseDate": null,
      "directors": ["Ben Bolt"],
      "runtime": 90,
      "movieId": 159046,
      "title": "Second Nature",
      "mpaa": "NR",
      "actors": [
         "Alec Baldwin",
         "Powers Boothe",
         "Louise Lombard"
      ],
      "imdbMovieId": "0326121",
      "originalTitle": "Second Nature",
      "genres": [
         "Action",
         "Drama",
         "Mystery",
         "Science Fiction",
         "Thriller",
         "War"
      ],
      "youtubeTrailerIds": ["-VMpxqd7Zwg"],
      "plotSummary": "Everything is not as it seems for a man who recovers from a plane crash in which his family is killed. After plastic surgery and rehabilitation, he determines that he worked for a secret agency for which he was an assassin. His former boss puts him back to work to assassinate a political leader, but when he proves unable to pull the trigger, it is he who becomes the target for assassins. As he avoids capture, the story unfolds about his true past and the reason why he has a tattoo of \"chilly willy\" inside his lip.",
      "tmdbMovieId": 80520,
      "avgRating": 3.125,
      "releaseYear": "2003",
      "numRatings": 4,
      "posterPath": "/aTBlCu349qp1cJ9UZteEao81QOU.jpg"
   }
}