{
   "tmdb": {
      "original_language": "xx",
      "keywords": [],
      "imdb_id": "tt2134092",
      "video": false,
      "title": "The Extraordinary Voyage",
      "recommendations": [
         97015,
         56761,
         111322,
         118673,
         130580,
         53167,
         35206,
         42502,
         39986,
         42606,
         43877,
         30192,
         18089
      ],
      "backdrop_path": "/dcrxN85jocexDUVYFogI3k6Z3fA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe49b19251416c910b5961",
               "name": "Michel Gondry",
               "profile_path": "/a0uLwuRoAiELs02gJhNX14WqzV9.jpg",
               "id": 201,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe49b19251416c910b5965",
               "name": "Jean-Pierre Jeunet",
               "profile_path": "/u3QmPbF9gdTTLsAHS97ic93gg6S.jpg",
               "id": 2419,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe49b19251416c910b5971",
               "name": "Costa-Gavras",
               "profile_path": "/qYwJwz88aAf0Uraz79egHt5R1a1.jpg",
               "id": 27436,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe49b19251416c910b5969",
               "name": "Michel Hazanavicius",
               "profile_path": "/5Adwey0AqG16rM7jrDMjUaew9W3.jpg",
               "id": 67717,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself (Archive Footage)",
               "gender": 2,
               "credit_id": "52fe49b19251416c910b596d",
               "name": "Tom Hanks",
               "profile_path": "/pQFoyx7rp09CJTAb932F2g8Nlho.jpg",
               "id": 31,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49b19251416c910b5957",
               "name": "Serge Bromberg",
               "profile_path": null,
               "id": 126750,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b19251416c910b595d",
               "name": "Eric Lange",
               "profile_path": null,
               "id": 935013,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.172887,
      "production_countries": [],
      "id": 87061,
      "vote_count": 25,
      "budget": 0,
      "overview": "The miraculous discovery of a hand-colored print of the world-famous TRIP TO THE MOON, the 1902 Georges Melies film, that took 12 years to restore, and opened the Cannes Film Festival in May 2011. The story of this film, from its shooting more than a century ago to its spectacular revival in 2011, is the subject of THE EXTRAORDINARY VOYAGE, the film Serge Bromberg and Eric Lange just completed, which will world premiere at Moma, in New York, November 11, at 7pm, along with the George Melies film with a new spectacular sound track by French group AIR.",
      "similar": [],
      "original_title": "Le Voyage Extraordinaire",
      "runtime": 78,
      "poster_path": "/pzSEkuuD6A8vpuSBuynNYz1MhB8.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2011-12-08",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lobsterfilms.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Serge Bromberg",
         "Eric Lange"
      ],
      "runtime": 60,
      "synopsis": null,
      "writers": [
         "Serge Bromberg",
         "Eric Lange"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt2134092/",
      "coverLink": null,
      "actors": [
         "Costa-Gavras",
         "Jean-Pierre Jeunet",
         "Michel Gondry"
      ],
      "reviews": [
         "Recent years have seen increased awareness and appreciation in the films of early cinema pioneer Georges Méliès. For decades, he's probably been the most beloved of early filmmakers because of the fantastic adventures and trick effects in his oeuvre, but recognition nonetheless seemed largely limited to those already specifically interested in early film history, and Méliès's available films were few and hard to get. Now, however, 199 of his films, which is most of the ones that survive from originally over 500 of them, are available on home video from Flicker Alley's 5-DVD set \"Georges Méliès: First Wizard of Cinema (1896-1913)\" and the subsequent \"Encore\" DVD. A very popular mainstream movie, \"Hugo\" (2011), and the graphic novel it's based on, has made him well known to the general public. There've been documentaries, such as this one, \"The Extraordinary Voyage\", as well as \"La magie Méliès\" (1997) and the part from Tom Hanks's \"From the Earth to the Moon\" (1988) (footage of which is shown here along with an interview of Hanks and other filmmakers of today), which compliment what historians and academics have done in writing. Even popular music videos of Queen and The Smashing Pumpkins have featured Méliès's masterpiece, \"A Trip to the Moon\" (1902). This documentary is paired with a hand-colored version of \"A Trip to the Moon\" (1902) on DVD and Blu-ray (again, from Flicker Alley) and is mostly about that film, with only an outline of the auteur's entire career and life. Yet, the best part of \"The Extraordinary Voyage\" is at its end when it examines the preservation and restoration work done with the hand-colored print—giving, albeit self-congratulatory, recognition to the film preservationists and archivists who've made Méliès's restoration happen. Here, we see the meticulous efforts by the likes of Eric Lange, of Lobster Films and co-director of this documentary, to preserve the newly discovered print by digitally photographing it frame-by-frame back in the 1990s. And, then, aided by improved digital computer technology in this decade, men like Nicholas Ricordel, of the CNC Film Archive, and Tom Burton, the Director of Technicolor Creative Services, re-assembled the color film by combining it with less-deteriorated black and white prints that were re-colorized. The result is extraordinary; I've never seen \"A Trip to the Moon\" look better. Before this dénouement, \"The Extraordinary Voyage\" can be of some interest, but isn't as revealing. Information one can get from more thorough sources is provided, including telling the apocryphal story of how Méliès supposedly discovered stop substitutions (which, never mind, he wasn't actually the first to employ, anyways). The factory of a staff of over 300 women headed by a Madame Thullier who hand colored Méliès's films is covered. The piracy in America of \"A Trip to the Moon\" is mentioned as having come from a stolen reel of the film, which is the first I recall of hearing that. It seems more likely that films that were unethically duped were originally legally bought from the source. And, unfortunately, even stupid conspiracy theorists get a mention, as it's relayed that there are skeptics who believe the Apollo mission was faked by Stanley Kubrick. A narrator, talking heads and plenty of clips fill out this, overall, good introduction to Méliès and his masterpiece and an excellent story of the restoration of its hand-colored print.",
         "Finding out about the movie from the group who did the music, AIR, I was less interested in the documentary portion and more interested in seeing the film with the new original score. The documentary proved to be the far more interesting portion and is, of course, the main attraction. It starts out with a history of Georges Melies and early cinema in general, and then moves onto some specifics about Le Voyage dans la lune. Then there is a portion on the restoration of the film, followed by the film itself. The history of Melies, which occupies most of the movie, is probably the weakest part. The content is interesting and it uses tons of great old footage, but the way it is edited and put together is just not that interesting. The restoration portion is shorter, but also much more fascinating and exciting. The restored movie with music by AIR is fun to watch and you can really understand why it holds a place in movie history. The soundtrack starts off awkward at first but fits it perfectly by the time they're chased by aliens. It's not always the most exciting documentary, but if you're interested in movies, and if you're looking at this right now you probably are, it's a worthwhile watch to see the story of a piece of movie history."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "France 3 (FR 3)",
         "Lobster Films"
      ],
      "summaries": ["A documentary that chronicles the cinematic journey of the iconic film A Trip to the Moon."],
      "budget": 0
   },
   "movielensId": 159185,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2011-12-08",
      "dvdReleaseDate": null,
      "directors": [
         "Serge Bromberg",
         "Eric Lange"
      ],
      "runtime": 78,
      "movieId": 159185,
      "title": "The Extraordinary Voyage",
      "mpaa": null,
      "actors": [
         "Michel Gondry",
         "Jean-Pierre Jeunet",
         "Costa-Gavras",
         "Michel Hazanavicius",
         "Tom Hanks"
      ],
      "imdbMovieId": "2134092",
      "originalTitle": "Le Voyage Extraordinaire",
      "genres": [
         "Adventure",
         "Documentary",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["OKWxm93YTpc"],
      "plotSummary": "The miraculous discovery of a hand-colored print of the world-famous TRIP TO THE MOON, the 1902 Georges Melies film, that took 12 years to restore, and opened the Cannes Film Festival in May 2011. The story of this film, from its shooting more than a century ago to its spectacular revival in 2011, is the subject of THE EXTRAORDINARY VOYAGE, the film Serge Bromberg and Eric Lange just completed, which will world premiere at Moma, in New York, November 11, at 7pm, along with the George Melies film with a new spectacular sound track by French group AIR.",
      "tmdbMovieId": 87061,
      "avgRating": 3.72222,
      "releaseYear": "2011",
      "numRatings": 9,
      "posterPath": "/pzSEkuuD6A8vpuSBuynNYz1MhB8.jpg"
   }
}