{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "gender identity",
            "id": 210039
         }
      ],
      "imdb_id": "tt4425152",
      "video": false,
      "title": "Girls Lost",
      "recommendations": [
         358927,
         22241,
         349441,
         138217,
         83373,
         268297,
         362216,
         339258,
         328930
      ],
      "backdrop_path": "/uKT0Z0vigtMmLa6VQOnC21STsJb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Kim",
               "gender": 0,
               "credit_id": "55dd5e3b925141745200169d",
               "name": "Tuva Jagell",
               "profile_path": null,
               "id": 1500472,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Bella",
               "gender": 0,
               "credit_id": "55dd5e819251417448001684",
               "name": "Wilma Holmén",
               "profile_path": null,
               "id": 1500473,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Momo",
               "gender": 1,
               "credit_id": "55dd5e94c3a36865720018e6",
               "name": "Louise Nyvall",
               "profile_path": null,
               "id": 1500474,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Kim",
               "gender": 0,
               "credit_id": "55dd5f129251410cf1000fba",
               "name": "Emrik Öhlander",
               "profile_path": null,
               "id": 1500477,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Bella",
               "gender": 0,
               "credit_id": "55dd5f2a92514174480016a7",
               "name": "Vilgot Ostwald Vesterlund",
               "profile_path": null,
               "id": 1500478,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Momo",
               "gender": 0,
               "credit_id": "55dd5f43c3a36865770018d3",
               "name": "Alexander Gustavsson",
               "profile_path": null,
               "id": 1500479,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Tony",
               "gender": 0,
               "credit_id": "55dd5fd292514174560016b2",
               "name": "Mandus Berg",
               "profile_path": null,
               "id": 1500480,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Jesper",
               "gender": 0,
               "credit_id": "55dd5fea92514174520016e2",
               "name": "Filip Vester",
               "profile_path": null,
               "id": 1500481,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55dd5c8ec3a36865800015c9",
               "name": "Alexandra-Therese Keining",
               "profile_path": null,
               "id": 562589,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55dd5c9992514174460015b2",
               "name": "Alexandra-Therese Keining",
               "profile_path": null,
               "id": 562589,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55dd5cecc3a36865720018a8",
               "name": "Jessica Schiefauer",
               "profile_path": null,
               "id": 1500468,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "55dd5d6bc3a368658200155a",
               "name": "Ragna Jorming",
               "profile_path": null,
               "id": 1169550,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55dd5d849251410cf1000f7e",
               "name": "Malin Lindström",
               "profile_path": null,
               "id": 1123773,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55dd5db8c3a3686f650014f8",
               "name": "Sophia Ersson",
               "profile_path": null,
               "id": 1500471,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55dd5df2c3a3681643000fdb",
               "name": "Helena Wirenhed",
               "profile_path": null,
               "id": 1366640,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55dd5e079251417446001600",
               "name": "Olle Wirenhed",
               "profile_path": null,
               "id": 852098,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.179357,
      "production_countries": [
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         },
         {
            "iso_3166_1": "FI",
            "name": "Finland"
         }
      ],
      "id": 356218,
      "vote_count": 9,
      "budget": 0,
      "overview": "Kim, Bella and Momo are three fourteen-year-old girls who discover a fantastic flower with magic qualities: by drinking its nectar they are transformed into boys and they enter a new world. At first they enjoy their newly found freedom, but soon Bella and Momo realize that there are downsides to it. Kim however gets seriously addicted…",
      "similar": [
         449176,
         12793,
         376867,
         338189,
         11421,
         370663,
         4927,
         258480,
         184352,
         16367,
         43923,
         152584,
         26280,
         10938,
         65229,
         598,
         1213,
         112160,
         401898,
         391713
      ],
      "original_title": "Pojkarna",
      "runtime": 106,
      "poster_path": "/fwWUI3q4lT73ncdH3VhfdtGkcW8.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [],
      "release_date": "2016-02-19",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Finland",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Alexandra-Therese Keining"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Alexandra-Therese Keining",
         "Jessica Schiefauer"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt4425152/",
      "coverLink": null,
      "actors": [
         "Mandus Berg",
         "Adam Dahlgren",
         "Malin Eriksson"
      ],
      "reviews": [
         "I don't think I've been this enchanted by the possibilities of cinema since I watched \"The NeverEnding Story\", as a kid! The two films aren't at all alike, in theme - but they both gave me the same sense of wonder. The music and soundtrack plays a part in this; it just envelops you like a warm, comforting blanket, drawing you in. Thinking about the subject, it's almost impossible for me to say what made me connect with this, in the way that I did. The thing is, I've always known who I'm supposed to be (I haven't always LIKED who I am, but I'm certain that it was meant to happen). I can't imagine feeling ill at ease, and yet suddenly having the opportunity to change it... I can't imagine how intoxicating such a radical switch would be. Except that now I have an inkling of an idea, because I watched this film... It's too reductive to call it a 'young adult' work, as I have seen it labelled. It should be required viewing for anybody who has the innate curiosity to try and understand how it feels to be in someone else's shoes. Beautiful, harsh, poetic and strange - it is all of these things, and more... A sublime film.",
         "Girls Lost is a very unique film, a gem, beautifully filmed and put together and whilst many of the strange 'trippy' sequences did throw me a little, all in all the film is a great watch albeit rather uncomfortable to watch when the school bullies are acting like the horrible human beings they are. The cast are fantastic and from the moment they appear on screen, there isn't an unconvincing scene within the movie. I wasn't totally sure what sort of film to expect when the opening credits for Girls Lost began. But the film is definitely a hidden gem. And by that I don't mean the film hasn't been seen, I just mean that because its a subtitled film that doesn't have a major studio behind it, that the film probably hasn't been seen by as many people as the film deserves to be seen by. If you are a fan of Young Adult movies, then definitely check out Girls Lost when it hits the screens in November,",
         "Kim, Momo and Bella are three teenage girls going to a highly unenlightened school I Sweden. They are different – lesbians being the label the other kids give them. The three of them are alone together and cocoon themselves off away from the pain and ridicule as much as they can. Then one day a package of plant seeds arrives and it contains a seed that they had not ordered, so they plant it in the greenhouse and it miraculously grows into a flowering beauty overnight. Then, as in a Fairy Tale of old, they each taste the juice of its fruits. The results are brilliant and leads them on to a journey of discovery about their true selves. Now I thoroughly enjoyed this – the Fairy Tale element really worked even though I normally dislike such contrivances and devices. The acting is all excellent as is the direction and the story has a vibrancy that carries you with it – completely recommended.",
         "I gave this foreign film a try, not really expecting much, but I was pleasantly surprised. Initially, it feels like a semi-lighthearted and fanciful exploration of girls and their trouble at school, but the movie gets darker and more intense as you watch (similar to Cracks, another coming-of-age gem about a group of girls that starts light and quickly darkens). In this movie, the fantasy element of an odd, dripping black plant grants the girls the ability to be boys for a short time, a catalyst for exploration and awakenings, but also creates rifts in the friendship and new relationships that threaten the old. Kim, one of the three girls, becomes addicted to the plant when she realizes that she feels at home in a boy's body. This causes a lot of complications among the friends and with others, culminating in an intense ending that seemed a bit odd and abrupt, at best. On the flip side, jealousy, love, sexual awakenings/gender awakenings, and all of those labile emotions of adolescence are very palpable in this film, and sensitively captured both with the male and female actors, who did a great job. It's a little heavy-handed at times, but as I mentioned, the curiosity and sensitivity of adolescence are captured well. Some questions are left unanswered (why do they transform into older boys?, etc.), but these questions and some of the aforementioned issues aside, this film is surprisingly enigmatic. Also, I was happy to hear The Knife contributing to the soundtrack....there's no mistaking Karin Andersson's banshee-like voice. Overall, Girls Lost is a solid coming-of-age movie that burns out at the end, but is still worth watching for its handling of the issues of gender identity, love, and jealousy.",
         "I came across this small independent Swedish movie on Netflix streaming movies. The girls are good friends and are sexually intimidated at school by the boys, called names, pushed down, etc. One of the girls has a greenhouse at her home and they discover a plant that grows very quickly, seemingly from seed to maturity overnight. The smell a liquid from the plant, it reminds them of vanilla. Boldly each of them tastes the fluid. After they sleep for a while they wake up together to find their breasts gone, their looks changed, and they have boy parts. They go to school and no one recognizes them, even though their boy looks are similar to their girl looks. (Different actors, boys and girls, play the corresponding boy-girl roles.) What starts out as a teenager sci-fi story quickly develops into a darker look at gender identity, one of the girls, Kim, finds that she likes being a boy, Kim, but also is attracted to another boy. He rejects boy Kim's affections, beats him and sends him away, threatening to seriously harm or kill him if he persists. In the end the greenhouse is burned down, no more gender-swapping, but the experience has made Kim wonder about her true self and she leaves home, asking parents not to come looking for her. In interesting film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Götafilm",
         "Periferia Productions Ky",
         "Film i Väst"
      ],
      "summaries": ["Three young girls' friendship is tested after they plant a very special flower; the Nectar from the flower changes their lives- and friendship - forever, as they get a taste of what it's like growing up as a boy. It's a story of how we've created gender, and how to know who you are when society is telling you who you should be, but also a story about young love and lust."],
      "budget": 2000000
   },
   "movielensId": 159249,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "2016-02-19",
      "dvdReleaseDate": null,
      "directors": ["Alexandra-Therese Keining"],
      "runtime": 106,
      "movieId": 159249,
      "title": "Girls Lost",
      "mpaa": null,
      "actors": [
         "Tuva Jagell",
         "Wilma Holmén",
         "Louise Nyvall",
         "Emrik Öhlander",
         "Vilgot Ostwald Vesterlund",
         "Alexander Gustavsson",
         "Mandus Berg",
         "Filip Vester"
      ],
      "imdbMovieId": "4425152",
      "originalTitle": "Pojkarna",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Kim, Bella and Momo are three fourteen-year-old girls who discover a fantastic flower with magic qualities: by drinking its nectar they are transformed into boys and they enter a new world. At first they enjoy their newly found freedom, but soon Bella and Momo realize that there are downsides to it. Kim however gets seriously addicted…",
      "tmdbMovieId": 356218,
      "avgRating": 3.7,
      "releaseYear": "2016",
      "numRatings": 10,
      "posterPath": "/fwWUI3q4lT73ncdH3VhfdtGkcW8.jpg"
   }
}