{
   "tmdb": {
      "original_language": "he",
      "keywords": [
         {
            "name": "israel",
            "id": 536
         },
         {
            "name": "israeli",
            "id": 3038
         }
      ],
      "imdb_id": "tt0834955",
      "video": false,
      "title": "Someone to Run With",
      "recommendations": [],
      "backdrop_path": "/jEuXHhCDRFzyagnYPlbBimucQ6E.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Tamar",
               "gender": 0,
               "credit_id": "52fe470d9251416c9106879f",
               "name": "Bar Belfer",
               "profile_path": null,
               "id": 584163,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Asaf",
               "gender": 0,
               "credit_id": "52fe470d9251416c910687a3",
               "name": "Yonatan Bar-Or",
               "profile_path": null,
               "id": 584164,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Shai",
               "gender": 0,
               "credit_id": "52fe470d9251416c910687a7",
               "name": "Yuval Mendelson",
               "profile_path": null,
               "id": 1154865,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Shelly",
               "gender": 0,
               "credit_id": "52fe470d9251416c910687ab",
               "name": "Rinat Matatov",
               "profile_path": null,
               "id": 1154868,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe470d9251416c9106879b",
               "name": "Oded Davidoff",
               "profile_path": null,
               "id": 584162,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470d9251416c910687b1",
               "name": "David Grossman",
               "profile_path": "/9Eq50X0bOm0WxCVnwLmB9igAwUq.jpg",
               "id": 43954,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470d9251416c910687b7",
               "name": "Noah Stollman",
               "profile_path": null,
               "id": 114560,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.121324,
      "production_countries": [{
         "iso_3166_1": "IL",
         "name": "Israel"
      }],
      "id": 39301,
      "vote_count": 3,
      "budget": 0,
      "overview": "Through the streets of Jerusalem two teenagers' stories will unite to tell the summer adventure of their lives. Tamar is an amazingly talented but very quiet and insecure girl, who leaves behind her home and all she knows, changing herself unrecognizably -from her looks to her attitude- to brace herself for a dangerous mission to help a loved-one. Asaf, a clumsy, naive, and very shy boy working a boring summer job at City Hall, is given quite a mission himself : to take an uncontrollable stray dog from the pound, put it on a leash, and let it lead him back to its owners to be fined. The more stories Asaf hears about this extraordinary girl, the more he falls for her, and as he and Dinkah continue their journey Asaf becomes aware that Tamar is in grave danger.",
      "similar": [
         10661,
         8885,
         612,
         67,
         12162,
         4421,
         1726,
         15969,
         6844,
         12545,
         231,
         46738,
         7483,
         1941,
         26842,
         4723,
         10582,
         26,
         12611,
         433627
      ],
      "original_title": "מישהו לרוץ איתו",
      "runtime": 118,
      "poster_path": "/b6WqdIT6KjxBBzyKBNBDg1nS5py.jpg",
      "spoken_languages": [{
         "name": "עִבְרִית",
         "iso_639_1": "he"
      }],
      "production_companies": [],
      "release_date": "2006-07-13",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oded Davidoff"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "David Grossman",
         "Noah Stollman"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt0834955/",
      "coverLink": null,
      "actors": [
         "Bar Belfer",
         "Yonatan Bar-Or",
         "Yuval Mendelson"
      ],
      "reviews": [
         "A great movie!!! Truly done wonderfully. I think the director was able to take the most of this story and make it enjoyable, thrilling and surprising to watch... The story itself was very interesting, realistic and painful. The feelings of those who live in the streets, in their own \"world of the streets\", was build so well in the movie and you could actually feel like you live in this \"world\".I think the actors were great and helped a lot in creating the atmosphere around this movie- loneliness, fears, troubles and one big beauty in the middle that is demonstrated through music. Music was the theme of this movie and it was remarkable to see how the music lights the darkest corners. I think the movie had a lot to say about falling into the wrong places in life, as drug abuse and so on. It was exciting to see what people would do for each other and how hope must never be lost. I liked the twists in the plot, and especially I enjoyed the way the two plots were told together side by side. Great movie! I recommend.",
         "Very enjoyable especially for locals who recognize every alleyway and every coffee bar.well cast and acted and the young newcomer who plays Tamar definitely has star quality.Not sure how it will go over in the foreign market.But a local hit for sure! also great plot.Story tells of a young teenager who runs away from home,winds up in hostel for homeless kids all hoping to be the next big music discovery. She ends up being exploited by a no-good drug dealer and loses her dog. A boy, Assaf, comes looking for her, the dog leading him through her usual Jerusalem haunts, the pizzeria, the place downtown where she hangs out with other young music hopefuls and so on....Shan't spoil the ending",
         "This film wasn't easy to track down. I wanted to watch it because I had really enjoyed and admired the novel it's based on, but Amazon didn't have copies of it; evidently it didn't get a lot of distribution outside Israel. I finally managed to track it down to an Israeli online shop. It's the sort of film that people outside Israel should probably watch, because among other things it lifts the lid on what a corrupt, nasty and dangerous place Israel has become - in other words, it shows just how much Israel can be like any other country. The basic story is of Asaf, a young guy who works for a dog shelter (I think he's meant to be an Israeli Arab, but I'm not certain), trying to reunite a stray dog with its owner. The owner is Tamar, a teenage girl on a mysterious mission. The opening scene, in which Tamar goes into a barbershop and gets her beautiful head of hair shaved off, is shocking in a low-key sort of way. The rest of the film, like the book, is a mixture of adventure story and social commentary. It's a good movie, with fine performances from all but especially from the two leads, Bar Belfer as Tamar and Yonatan Bar-Or as Asaf. Quite a lot of the suspense comes from the tension about whether or not the two main characters are ever actually going to meet. David Grossman, author of the original novel, is one of the best novelists working today and this is one of the toughest and most unsentimental Israeli movies I've seen. Since most of the Israeli movies I've seen have tended to be more than a bit sentimental, that's a major mark in its favour. If there's anything wrong with it, it's that it sometimes seems a little far-fetched; the novel was more believable, for some reason. But it's still a very fine story, and it's a shame that it hasn't been seen much outside Israel; most Irish films (I'm Irish) get more hype, but are far more flimsy.",
         "I don't mind being kept in suspense a bit, but the questions left open produce a weariness after a while and for me a kind of crisis came when the female lead, who was supposed to be a promising singer, turned out to be-- in contrast to what for the purpose of the plot she is supposed to be-- merely mediocre. I lost just about my only reason for remaining interested. Maybe the book carries you along by virtue of the quality of writing, and maybe those who have read the book are carried along through the movie by their prior familiarity with the story and characters. I was pleased to see that eventually the open questions are resolved (and that the promising guitarist sounds a lot better than the promising singer, by the way), but aspects of the resolution were a little hokey.",
         "I was worried that much would be lost in adaptation from the excellent novel. This was not the case; the characters and scenes were as i had visualised them. The acting was good; i felt a lot of empathy towards the 2 central characters ( 3 if you include the dog ) . There was also a little bit of humour, especially in the portrayal of the 'bad' character. The plot is not bulletproof and totally realistic but then this is partly a fantasy. Jerusalem serves as a good backdrop for though it is a big city, you are always only away from a strange wadi or uncultivated area that is required for the movie. The flashbacks were seamlessly handled and easy to comprehend. There was perhaps a short period in the middle of the film where i felt things were dragging on a bit. By the end though i have to confess i was slightly teary and overcome with emotion. I hope that people not from the local market can also enjoy this film",
         "that's a really bad movie, and what's sad is that it holds a great story, which is adapted poorly to the screen (i have not read the book and i'm not comparing the two, only the movie for itself). the story is interesting, with great ideas, surprises and suspense, but the characters in the script are incredibly shallow, feeling less and success very little to bring the viewer to care for them. they're not interesting and have nothing beyond their little plot-driven purposes. the acting also produces that problem, the actors read the lines with no heart (except for maybe Shelly) and even more with out referring to timing and reacting. camera work was also bad by having burned out photography and very little-detailed sets and frames. editing didn't manage to save the movie. all in all it's not the worst, but it's bad, and it's very sad that it could've been more, much more.",
         "Well, I will try to make it short. If many people think that today's youth is a mess, this film shows them that what they thought might not necessarily be true... This film shows the dark side of our society, and how easy sometimes it is for a teenager to go \"bad\"... And yet, it is a story of extraordinary courage and love. Tamar, a 16 y.o. girl is setting on a mission - To save Shai - her brother, that is already locked in the world of drugs and crime. She takes her dog with her. But at some point - the dog gets lost, and is found but Asaf, a teenage boy that starts a journey to find the dog's owners. Step by step he find out the dark path Tamar went by, and tries to follow it, and find her, although it seems more dangerous as moves on... Anyway - What I think this movie is all about, is showing us how ugly some people can be, that there are no real \"bad\" teenagers - they are made this way by people. And it also shows us that there are people who are ready to fight for their loved ones. This film shows us that it is not all black and white... And this film shows us that sometimes things have to be done - even when they are so hard to do, so dangerous, so impossible... I really suggest people to see this film(I don't know when will it come out on DVD, but it is worth the money I think...) But note: This is not a film for everyone, it is a hard film with very deep philosophical thoughts... not something to watch with your dinner..."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "B&K Film Productions",
         "B&K Productions",
         "JCS Productions"
      ],
      "summaries": ["Through the streets of Jerusalem two teenagers' stories will unite to tell the summer adventure of their lives. Tamar is an amazingly talented but very quiet and insecure girl, who leaves behind her home and all she knows, changing herself unrecognizably -from her looks to her attitude- to brace herself for a dangerous mission to help a loved-one. Asaf, a clumsy, naive, and very shy boy working a boring summer job at City Hall, is given quite a mission himself : to take an uncontrollable stray dog from the pound, put it on a leash, and let it lead him back to its owners to be fined. The dog -Dinkah leads Asaf through the city to the people and places that will tell him about Dinka's owner -Tamar and her sudden disappearance. The more stories Asaf hears about this extraordinary girl, the more he falls for her, and as he and Dinkah continue their journey Asaf becomes aware that Tamar is in grave danger. Feeling he knows her, and knowing he loves her Asaf is determined to find Tamar and rescue her from her own rescue mission. This movie tells a beautiful story based on the novel by David Grossman, about growing up and finding the strength to overcome your fears, the meaning of true friendship, and best of all, finding someone to love, someone to hold, someone to run with..."],
      "budget": 0
   },
   "movielensId": 159311,
   "movielens": {
      "languages": ["עִבְרִית"],
      "releaseDate": "2006-07-13",
      "dvdReleaseDate": null,
      "directors": ["Oded Davidoff"],
      "runtime": 118,
      "movieId": 159311,
      "title": "Someone to Run With",
      "mpaa": "",
      "actors": [
         "Bar Belfer",
         "Yonatan Bar-Or",
         "Yuval Mendelson",
         "Rinat Matatov"
      ],
      "imdbMovieId": "0834955",
      "originalTitle": "מישהו לרוץ איתו",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Through the streets of Jerusalem two teenagers' stories will unite to tell the summer adventure of their lives. Tamar is an amazingly talented but very quiet and insecure girl, who leaves behind her home and all she knows, changing herself unrecognizably -from her looks to her attitude- to brace herself for a dangerous mission to help a loved-one. Asaf, a clumsy, naive, and very shy boy working a boring summer job at City Hall, is given quite a mission himself : to take an uncontrollable stray dog from the pound, put it on a leash, and let it lead him back to its owners to be fined. The more stories Asaf hears about this extraordinary girl, the more he falls for her, and as he and Dinkah continue their journey Asaf becomes aware that Tamar is in grave danger.",
      "tmdbMovieId": 39301,
      "avgRating": 4.16667,
      "releaseYear": "2006",
      "numRatings": 3,
      "posterPath": "/b6WqdIT6KjxBBzyKBNBDg1nS5py.jpg"
   }
}