{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "car breakdown",
            "id": 1927
         },
         {
            "name": "grizzly bear",
            "id": 2522
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "forest",
            "id": 5774
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "canuxploitation",
            "id": 206850
         }
      ],
      "imdb_id": "tt0896816",
      "video": false,
      "title": "Grizzly Rage",
      "recommendations": [
         28305,
         52840,
         44184,
         15591,
         35891,
         27304,
         43717,
         161368,
         29412,
         56552,
         3144,
         77985,
         60781,
         110545,
         402516,
         61031,
         90360,
         28142,
         110336,
         297605
      ],
      "backdrop_path": "/86hqOSQmke8NG3K8I9JF1ectZXH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Wes Harding",
               "gender": 2,
               "credit_id": "52fe442b9251416c91007467",
               "name": "Tyler Hoechlin",
               "profile_path": "/9AMrsrX4x4Tls8OEf7nFM9S8wvm.jpg",
               "id": 78198,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lauren Findley",
               "gender": 1,
               "credit_id": "52fe442b9251416c9100746b",
               "name": "Kate Todd",
               "profile_path": "/s53pBtd8xHoyicYeAio8KwpJQTy.jpg",
               "id": 106640,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sean Stover",
               "gender": 0,
               "credit_id": "52fe442b9251416c9100746f",
               "name": "Graham Kosakoski",
               "profile_path": null,
               "id": 106641,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ritch Petroski",
               "gender": 0,
               "credit_id": "52fe442b9251416c91007473",
               "name": "Brody Harms",
               "profile_path": null,
               "id": 106642,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe442b9251416c91007463",
               "name": "David DeCoteau",
               "profile_path": "/nFOFizArK1Vwoo2v4HRKdKXJlrl.jpg",
               "id": 97618,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57b9d124c3a36845dc000091",
               "name": "Arne Olsen",
               "profile_path": null,
               "id": 56898,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57b9d1329251413613000094",
               "name": "Robert Halmi Sr.",
               "profile_path": "/zNgK8A56ozqdhDeu9QGaBU0VT7o.jpg",
               "id": 68607,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "57b9d13fc3a36845ee00009b",
               "name": "Phyllis Laing",
               "profile_path": "/ys16itIanpxzTBgjPfOAmk27RIo.jpg",
               "id": 1131840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57b9d14c925141361e00009f",
               "name": "Joe Silva",
               "profile_path": null,
               "id": 108227,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57b9d15d925141361b0000a5",
               "name": "Bruce Little",
               "profile_path": null,
               "id": 1165992,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57b9d168925141361b0000ac",
               "name": "Réjean Labrie",
               "profile_path": null,
               "id": 75830,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57b9d173c3a36845dc0000bc",
               "name": "Linda Madden",
               "profile_path": null,
               "id": 55180,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 2.028796,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 30641,
      "vote_count": 13,
      "budget": 2000000,
      "overview": "No overview found.",
      "similar": [
         75174,
         281957,
         119450,
         244316,
         7518,
         10155,
         9433,
         10010,
         46146,
         7484,
         37227,
         14211,
         428446,
         67822,
         44932,
         18029,
         47038,
         39995,
         64976,
         343921
      ],
      "original_title": "Grizzly Rage",
      "runtime": 86,
      "poster_path": "/VUO5E8mrQTocTqz0QcdlRfhtas.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "RHI Entertainment",
            "id": 20358,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Peace Arche Entertainment Group",
            "id": 55129,
            "origin_country": ""
         }
      ],
      "release_date": "2007-06-07",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David DeCoteau"],
      "runtime": 86,
      "synopsis": "Sean (Graham Kosakoski), Ritch (Brody Harms), Wes (Tyler Hoechlin), and Lauren (Kate Todd) celebrate their college graduation by breaking into Saranoc Grotto, a forest in Winnepeg province heavily marked with \"No Trespassing\" signs and surrounded by a tall fence. While speeding down a dirt road, they hit and kill a grizzly bear cub, sending their Jeep Cherokee into a tree and cracking the radiator. As they argue over whether they should bury the dead cub, they hear its mother coming and run. The vehicle overheats down the road so Wes and Ritch go into the forest to find water. The grizzly bear finds and attacks Ritch. Having heard Ritch's screams to run, Wes inadvertently runs into the bear and it attacks him. The other two arrive and rescue Wes, but are unable to help Ritch. The Bear kills him while the others flee to the Jeep. The vehicle starts again and they leave, but Wes panics and tries to force Sean to turn around and go back for Ritch, causing the car to go over a cliff. Ritch, being more calm, wants to wait for help, but no one knows where they are because they had told their families they were going somewhere else. They winch the vehicle back up to the road, but they cannot get it to start. Sean leaves to jog the 15 kilometers (around 9.3 miles) out of the forest to find help while Wes and Lauren wait at the Jeep. He comes across some run down abandoned buildings where he finds a hunting paraphernalia, a bear trap, and dead animals. As he leaves, the bear appears. He tries to sneak past the bear, but instead he runs into the bear and it throws him on the roof of the shack and then he falls into a chicken coop. Hours later he makes it back to the Jeep, but his leg is injured. Wes decides to climb a tall hill on the other side of the clearing to see if he can get a signal on his cell phone. It does not work and the bear nearly catches him. He quickly climbs back down and gets back to the Jeep though it still will not start. He and Lauren hide in the Jeep with the wounded Sean in the back. The bear follows and climbs on top of the Jeep, smashing up the car and eventually overturning it before leaving as the sun sets. Sean wakes up and tells them about the hunting paraphernalia, crying about wanting to go home before he dies. Wes and Lauren turn the Jeep right side up, load him back in the car, then push the Jeep down the hilly road as a thunderstorm hits. Using the downward momentum and occasionally pushing, they arrive near the buildings. While Lauren is exploring the building with the trap, the bear swings at her through a window sending her back against the trap, which impales her back. She returns to the vehicle where the bear rips off the tailgate and drags away Sean's body. Wes grabs a can of gasoline and pours a trail from the Jeep to the woods. They lure the bear to it and then set the gasoline on fire. The Jeep explodes, but the bear is unharmed. They decide to try another plan and split up. Wes climbs a tree, leaving his blood covered clothes on the ground to fool the bear. While the bear is sniffing at the clothes, Wes accidentally drops a tire iron, calling the bear's attention up. The bear shakes him out of the tree but he escapes and goes to the shack where Lauren has built a trap. They lure the bear into the shack, and use a trigger to close the front door behind it, locking it in. They celebrate and start to leave but the bear breaks out of the shack and they both try to escape. Unfortunately, Wes stumbles and Lauren tries to get him back up, refusing to leave him behind despite his desperate insistence that she should run and try to save herself. As the bear catches up to them, Wes is mauled and killed. Lauren finally makes a run for it, but the bear quickly catches up to her and kills her too.",
      "writers": ["Arne Olsen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0896816/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTMyNDg5MDAzMV5BMl5BanBnXkFtZTcwODE2MTIzMg@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Tyler Hoechlin",
         "Graham Kosakoski",
         "Brody Harms"
      ],
      "reviews": [
         "And you will too if you see this, since the bear is probably the best actor, followed by the bear cub (and he was dead). A bunch of dimwitted \"Darwin Award\" winners decide to take themselves out of the gene pool and get in a car, and (by montage sequence) travel several hundred miles down to some trashy looking enclosed private property. Smashing their way through barriers the \"fun\" begins. How they knew this place existed, why they thought it would be cool to go there, or why this movie was ever made are just some of the questions never answered. They mow down a bear cub and destroy their radiator, all the while howling and screaming along with their screeching tires. Mercifully, the mommy bear comes along to exact revenge, and none too soon. She can't off these idiots fast enough, even though the footage of the bear is obviously some unused documentary footage from Animal Planet. Like all low budget movies, you'll know who's next to get it from the spliced in stock footage. The cabin scene is the only scene that was remotely well done, but then it's back to stupid behavior by the next victim who leaves the safety of the cabin when he hears the bear growling. Moronic.",
         "Yeah when I first saw the commercials for this movie I was like. Oh God this movie will be boring. I was right. It starts out with four college students. (All who look like they are in there late 20's) driving down the road obviously fast forwarded listening to awful music. They break into a park and run over a baby bear. Soon they are followed by its mother. Every time she kills someone animated blots of blood splatter. And I don't even want to comment on the car which over heats, flips, and amazingly enough still runs. The acting was so bad I rooted for the bear the entire time. I can't even believe that they made and aired this junk. Rating 1 out of 10",
         "Saw this on cable and the information page said something about a \"mutant bear\", so immediately I knew I had to watch it. Turns out, no mutants, no over the top insane events, just a disappointing movie. Featured and filmed in Manitoba, Canada (the scenery might be the best part of the film), four kids out of high school live it up as they go joyriding in the wilderness. When they run over a bear cub, things get hairy, as mama bear wants revenge! And of course, they HAVE to run into all sorts of additional car troubles and other hand-wringing episodes. Overall, a trashy movie with terrible acting. Worth watching if you find bad movies hilarious. Kate Todd, young notable Canadian actor, is the only character that stands out...and only for her looks.",
         "On behalf of all people in Manitoba, I would like to apologize for this film! Maybe it was a tax right off for someone.....someone forgot to tell the director/actors that it was not supposed to be a comedy..... somehow someway some film student (who obviously failed horribly) got his \"final exam\" on the TV by accident...I don't know. Manitoba has a thriving movie industry - though you would never know it from watching this 90 minute waste of time. Please excuse us for putting out this trash (Kate Todd is pretty cute though!). I started watching this horrible movie because it was so bad it made me laugh. Then I looked at the license plate and said \"hey, the movie was made in Manitoba\". According to the credits the movie was made is a local park 5 minutes outside the city. One person said it looked like it was all filmed within a 50ft radius.....close - probably more like 2KM. There is not enough space here to write everything that is wrong with this film. I'll instead close by writing everything that is good about this film........ Thankfully it didn't waste any more of our lives then 90 minutes.",
         "I first saw Grizzly Rage, like so many other Big Creature Eating Attractive People films late one night on the Sci Fi channel with a large group of friends while the majority of us were downing sizable amounts of alcohol. As the sub-par Fast and the Furious style credits sequence shot past with a low rent nu-metal band playing in the background, I was still reasonably sober but could feel the effects of two purple nightmares (look them up) taking effect and knew that soon, I would be swimming in a haze of my own creation. For the sake of a cheap laugh or two, I found a pen and paper and wrote down all the things I learned from this movie. The results are as follows: 1. Bears pursue blood vendettas. 2. Americans graduate from high school at the average age of 24. 3. Bears can push land rovers over. 4. Being torn limb from limb by ferocious, man eating bears is nature's way of punishing you for minor traffic violations committed in your youth. 5. Girls tops can magically sew themselves back together after being ripped open. 6. Eating toxic waste makes bears bigger, stronger, more intelligent and far more bloodthirsty than average, rather than the predicted scientific outcome of causing malignant tumors and killing them. 7. Dressing like an extra from a Vanilla Ice video is no guarantee of survival. 8. You can get attacked by a bear, rolled off a cliff in a car, thrown spine first onto a bear trap and spend all day battling for survival on a sun parched strip of mid-western wilderness and still have better skin and hair than Andie McDowell. 9. Bears respond to sass. 10. Smashed land rovers will still run for miles if rolled down a small hill to gather momentum. In other words folks, this is not great. In fact it's terrible. CGI blood, stock footage, awful characters and death scenes so pathetic they don't even make a group of five young men, drunk off their heads on aftershock concoctions laugh. Avoid.",
         "...make sure you don't kill any bear cubs. That's right. Grizzly Rage is the tale of a group of teenagers who embark upon one of those supremely misguided road-trips, and, for whatever reason, decide to trespass into a wooded quarry, and cheese off a local grizzly bear. What follows is the loosest collection of cobbled-together events I've seen attempting to pass as a film. What little plot exists is just awfully paced. Within the first quarter of an hour, they get lost, attacked, and one of the happy-go-lucky teens dies. Which really leaves me wondering what the other seventy-five minutes of my life is going to spent watching. After that, we're presented with various pointless scenes of the actors pushing their car up a hill, or walking around in the same damn empty hut for at least ten minutes, all without dialogue. These people also sustain some incredible injuries, such as falling on a bear trap, which are quickly ignored when things need to move on. This also allows a character to run a considerable distance on what appears to be a broken leg. The main star, the bear, is obviously appearing either from stock-footage, or a stage-hand wearing bear gloves. Watch out for the point where the guy is literally dragged by his feet back to be attacked some more. I can't go on anymore, this film is just so bad. It is redeemed by the fact that you may find some solace in ripping your teeth into the many, many flaws you will no doubt find. But even then, I predict even that fun would be drained by the terrible ending. Literally, they all die, and then the credits roll.",
         "I don't get what everyone is complaining about. This flick has something for everyone: cute, sweet blond chick (Kate Todd) for the guys; undressed male hunk (Tyler Hoechlin) for the girls; grizzly wins (for the tree huggers); and a really, really stupid bunch of characters (not the cast) for Darwin! It starts with four new high school grads, one maybe the valedictorian, who set out on a summer excursion, but change their planned destination by a vote of three to one. We start thinking maybe this is going to be a parody on blond jokes since the sweetie is the only one for sticking to the plan. But no, off they go to break into a restricted area. Then racing down an unfamiliar curvy, dirt road at 60 mph, the driver hits a bear cub and rams a tree, sticking a limb trough the radiator. Gosh, no water and momma bear is ticked. Two of the crew get busted up by the bear while trying to find water, the initial driver terminally, and the other three scarper in the truck (apparently the radiator is self healing). Then the injured mate (ah, los amigos... is this LA or Manitoba?) decides they can't leave their dead buddy and wrestles with the driver until they wreck. The driver then starts on a 20 klick run (in flip-flops no less) for help, but momma bear has him for porridge. After several other unbelievable misadventures the girl and the male stripper trap the bear in a building and stand around congratulating themselves (the innate blondness finally comes through), until the bear breaks down the door and comes out to eat them. Darwin rules!",
         "I desperately try to not watch one single David DeCoteau movie every year, yet for some reason I always seem to end up watching one of them every single year. This has been going on for some years now. I have no explanation for this phenomenon. So what about GRIZZLY RAGE? Well, the bear was good, wasn't he? The bear was a beautiful specimen. The bear was nice. Watch him roar. Watch him run. Watch him do not much else, really. I have no idea where DeCoteau got the bear footage from, as it was obviously shot on another day, somewhere else and with none of the actors & crew around. That's called stock footage. And if not, then it's lousy film-making. Once again, DeCoteau manages to poop out a movie that has absolutely nothing to offer. He gives us nothing but endlessly padded scenes with no content. Not a single remotely interesting thing is going on in this movie. Three guys and one girl in some woods with a bear out for revenge after them. Seriously, the bear wants revenge. Get even. Up close and personal. Why? Because the youngsters killed Mommy Bear's Baby Bear in a hit-and-run accident. And since Mommy Bear is a law-abiding specimen, she wants justice. So, in a way, this film is like DEATHWISH set in some forest and with a bear replacing Charles Bronson. It might also be a spin on THE TOXIC AVENGER, as the bear apparently had been drinking water polluted by toxic waste. However, that part of the plot was completely lost on me, until I read about it in another user-comment on here. It made me remember there were indeed a few barrels of toxic waste in some shots. I think this film made me very stupid all of the sudden, because I completely failed to link those toxic waste barrels to the bear. And it didn't help things that the bear just looks plain normal. It's a big one. And a beautiful one. Yes. But normal and furry. No Mutant Bear Avenger. I want to re-watch PROPHECY now. What about the killings? Well, we sometimes see a fake bear's claw hitting nothing but thin air really. And then an actor flies through the air. Then cut back to the bear going \"rooaaarrr\" and some CGI blood splatters on the camera-lens, and... that's it, basically. This stunt gets repeated a couple of times. Oh yes, something else: I wanted to see a crappy CGI bear and I didn't get any. Color me disappointed. Another funny thing. Why on earth did that one actor have to run around through the woods at night in his underwear? Was it because he felt like Tarzan? Or did he feel like going back to nature to go barbaric on the bear's ass? No, of course not. He was starring in a David DeCoteau movie, and that requires any hot-looking male actor to take his cloths off at some point. He ran around in his underwear, climbed up a tree and just sat there for a while. Really a profound sequence that was. What? There's no boobs in this movie? Now I'm getting mad. Forgive me if I'm not even going into the movie's plot or other details. Other people have given it their best shot already on here. But I'd like to share one more thought about this film that involves a truly puzzling aspect. Have you ever noticed in certain movies (especially cheap B-horror movies) whenever there's supposed to be a storm going on outside, those light-guys are just a tad bit too eager to push the buttons on their strobe lighting effects? A 5-minutes-long scene might have for instance like 20 lightning flashes in it. While in real life, you're even lucky if you catch about two lightning flashes during a whole rainy night. Now DeCoteau really goes way beyond this. Not just a few steps too far, but so ridiculously beyond this, that he's just gone. The last 30 minutes or so of GRIZZLY RAGE take place at night, during a storm (they actually didn't have the budget to produce rain effects either, but whatever). Now, about every 3-5 seconds, those lightning strobe-effects come on. For about 30 minutes straight, relentless and persistent. You'll be flashed out of your mind, I tell you. Seriously, I'm pretty sure DeCoteau was not at all simulating a nightly storm. I'm convinced he wanted to show audiences he had a stroboscope on the set by simply making it part of the scenery. Part of the story even. Like, \"Hey look, there's pulsating lights in the woods. They just grow there. Ain't that cool?\". Some movies just eat the cake, and GRIZZLY RAGE is one of them. Now, I could swear I will never watch a David DeCoteau movie again in my entire life. But chances are if someone would throw DEMON SPEED or LEECHES! at me, I'd just pop it in and watch it anyway. But not this year, I guarantee you. Next year, maybe.",
         "The title told me right from the beginning that \"Grizzly Rage\" was going to be a bad film. And it is. However, it's not all that bad. I personally feel that although it started out on a truly horrible level that was absolutely bland and pointless and that it ends on an even worse and unexpected level, it slowly turned out to be an acceptable low-budget Sci-Fi flick. It's not an amazing achievement, but it's certainly better than \"Python\", \"King of the Lost World\", and \"Gryphon\" combined. For once, a real creature is used to portray the monster. All of the scenes with the bear used a real grizzly bear: with a few exceptional scenes where you could easily tell those were manmade paws with rubber claws bashing in on the roof above the characters for the safety of the three actors and the one actress. That's a unique thing about \"Grizzly Rage\". It's got a cast of only four people. If I'm correct, there are no other people seen in the entire film, not even in the streets of a busy city. So therefore, its cast is just not there to be eaten by the monster. They are taken out one-at-a-time with large intervals of time between deaths with one exception and thankfully, the characters aren't as annoying as they could have been. They are weak characters, underdeveloped, stupid and mindless, and sometimes seemingly blind-until-it's-too-late individuals that use no common sense. As if they know they're suppose to die. But they aren't at the point where all I say is: \"Okay, grizzly, just kill them. They're getting on my nerves.\" So while \"Grizzly Rage\" is a bad film in a lot of regards, if you just don't take it too seriously, it'll actually turn out to be one of the better Sci-Fi flicks around. I personally found it to be a good adventure story. Definitely with room for improvement, but acceptable nonetheless. Performances were okay, the bear was real for once. But I just really wish the ending had been done differently. It just didn't work out, not even for a film of this type. Had the ending been different and the beginning made more sense, \"Grizzly Rage\" would have been a better achievement. But it's surprisingly good as it is.",
         "Three words: grizzly bears are awesome. I was serious when I said this is the best movie I have ever seen. None can rival it. It makes Shindler's List look like a flop. So often people misconstrue the true nature of an angry grizzly mother. Seriously. Even if it would send you into bankruptcy, you NEED to purchase the 8-disc DVD set with over 246 hours of special features. It's amazing that only $15 million was spent on this fantastic 13 out of 10 star film. Say goodbye to fame, Steven Spielberg, David DeCoteau is the new king of directing. Now that I'm finished talking about how fantastic this movie is, I'll tell you why. 1. You should have known the entire time that the grizzly would win. They can fly, for crying out loud, and they can shoot quills at you. 2. GRIZZLY RAGE 3. It has some of the most brilliant dialogue ever conceived. For example, \"What's a bear doing all the way out here...?\" (they're in a forest). 4. The only thing more dangerous than an angry mama grizzly is a space grizzly. 5. It had the best ending of any movie. Ever. Period. Semicolon. Exclamation mark. Simply put: GRIZZLY RAGE!",
         "This movie is brutal from start to finish. Obviously the writer/director don't necessarily believe in the old adage of \"anything worth doing is worth doing well\". The director has no knowledge of bear behavior or safety. Which you should have if your going to make a movie with a bear. First of all you cant just hide around a tree/corner from a bear, cause bear's have a keen sense of smell. Second, the amplified bear sounds and the shots of the bear at least initially were horrible. The night scenes...you cant hardly see anything, not to mention some of the other camera work. And the ending is brutal...well why would it be any different than the rest of the movie. I cant believe that this movie made it past the editing phase.",
         "I started to watch Grizzly Rage (titled Off Road in TV guide) on TV last night but it was so bad I had to turn it off after 30 minutes. The plot was paper thin, the characters unbelievable. Four graduates head \"off road\" and kill a bear cub in a restricted area. When the mother bear begins to stalk them, they start doing the dumbest things - (1) two of them head off in different directions - alone! - to look for water for their overheated vehicle engine (2) with one guy already killed by the bear, a second guy goes wacky inside the car and causes the driver to go over an embankment! It's just the type of movie that gives Canadian films a bad reputation...",
         "I watched this because I had a free movie pass. Even for free I felt cheated by this lousy excuse for a scary movie. The bear is the best actor in the film and there are not any decent gore shots. The dialogue is dumb and the story line is pretty unbelievable. I don't know if this is going to be on SciFi (like all sucky movies are) but don't watch it unless you are uber bored. I can usually sit through some pretty inane movies but this one was really bad. The ending is probably the biggest losing part of the story. You have been warned. I just hope others don't waste their time like I did on this piece of crap. I probably shouldn't blame the actors. This kinda reminded me of one of those \"revenge of the ...\" movies that got popular back in the 80's and that we all overdosed on.",
         "this is by far THE WORST movie i have ever seen ... it is so bad ... the bear is completely horrendous ... the acting is worse than an elementary school play ... i almost vomited at the dialogue .... oh my god it was so bad i even called the company who made it and told them how bad it was ...the only 2 hours of my life i truly regret ... no one should ever watch this pile of trash.. was this a horror or a real bad comedy ... what was the story ... a bear cub gets killed and its mother takes revenge on the teens who killed it ..... who wrote that ... a bunch of monkeys on meth .... i and my wife have never and will never see such an empty abismul movie again .... time to give the raspberry of the century award to this waste of time. i have no more to say .... bring on grizzly rage 2 .... NOT ... lmao",
         "What would life be like without an occasional rotten movie? The title tells all in this weak variation of the vintage 1977 killer whale movie \"Orca\" about a whale that wreaks vengeance on the fishermen that destroyed its mate and baby. In the lackluster \"Grizzly Rage,\" four obnoxious teenagers recklessly careening through the woods strike a grizzly bear cub accidentally and kill the little fellow. No, the filmmakers don't show the cub getting clipped. Only after they have smashed headlong into a tree and done permanent damage to their 4X4 Jeep Cherokee do they discover the critter. Surprise, surprise, the cute girl, Lauren Findley(Kate Todd of \"Saving God\")cannot get a strong enough signal on her cell phone to summon help. Actually, she objected to their thoughtless plans. Specifically, the guys used the winch to break a chain and trespass onto private property deep in the middle of nowhere littered with ominous looking barrels that would appear more appropriate in a toxic waste dump. The producers never connect the dots here about the toxic waste dump and the bear. Suddenly, an angry momma bear emerges and comes after them. I gave this movie one star because they rely on the old, stand-by suspense scene where the vehicle refuses to crank until the last second. Director David Decoteau, who has helmed such low-budget schlock as \"Sorority Babes in the Slimball Bowl-O-Rama\" as well as \"Frankenstein & The Werewolf Reborn,\" is up to his usual nonsense. Basically, this rarely scary horror chiller boasts three dudes, a sexy babe and a hulking she-bear (a male named Koda) in the forest. Decoteau shows the bear howling, walking on all fours and then rearing up on its back legs, but you rarely see anything but the wrecked vehicle in the same shot with the critter. When the bear is merely stalking her prey, Decoteau provides us with a slightly wide-angled 'bear cam' perspective like they do for the human killer in a stalker movie. When the momma bear does attack, all we see are its paws and claws in close-up. Nevertheless, you know that those belong to a man in a bear costume. Not only do these teenagers lack a shred of sympathy, but they also have no common sense. After their Jeep overheats, they separate and wander off into the woods searching for water to cool their vehicle off. Meanwhile, you find yourself rooting for the bear. Unfortunately, this carnivorous bear takes its time showing up and possesses little personality. Of course, the momma bear eats them all. The first casualty--Ritch Petroski (Brody Harms of \"Adam & Evil\")occurs about 20 minutes into the action, and the shook-up survivors tear off in their Jeep and then have second thoughts about leaving their poor mauled friend behind. They wreck their Jeep again, rolling it down an incline, but manage to recover despite some injuries to themselves. One of them decides to pull on his jogging shoes and run for help. Guess who he runs into? Guess what you'll get watching this half-baked epic? No, no bears or bear cubs were harmed in the making of this forgettable film. Where was Daniel Boone when these kids needed him?",
         "Why should detritus like this have to have so many lines to get a review on IMDb? Other reviewers voted for the bear, I was hoping my liver would leap out of my body and thrust itself down my throat cutting off oxygen to my lungs and hence my brain. This was wrong not on \"so many levels\" but on all levels. This movie as far as I could bear (pun intended) to watch it stank. OK, let's start. One girl going off with three guys? not nice... Maybe if they'ld been Church-going types. Even then it's wrong. (Is this actually what the USA is like?) Moving on, they fool around in their 4wd kill a bear cub and then get hunted by the oh so predictable toxically challenged bear mom. The formulaic crash later sees them looking to repair that steamy thing at the front of the car. Not only do they bring a cooler full of empty \"evian\" bottles, but they don't seem to realize a 4wd means four-wheel-drive, so the \"dude, our tyres spinning\" line makes the idiots look like they belong in kindergarten, as they and the \"people\" who made this do. The bear was laughable, no, that's not true, I cried it was that bad. Did the director, producer etc put their names at the start of this? I can't remember. I'm betting they only put it at the end knowing only teenagers intent on scoring might make it to the cringing finish (sorry teenagers, but hey, if it gets you where you're going who cares! right!). Finally, even the scenery was lame.",
         "The movie seems to start out with the makings of a good Sci-Fi Channel creature flick - average acting, questionable plot, teenagers in the middle of nowhere, and a mutant bear. How did it go so wrong? (I mean that seriously.) I am of the persuasion that if you don't want to see a bad movie, you would not be watching (or even looking up) a movie with \"Grizzly\" in the title. Hence it is not fair to hold the movie's own lousiness against it - you should have known that, expected that, and indeed -hoped- for that going in. So disregard anyone giving this movie a 1 right off the bat - if you were looking for a masterpiece, and picked this to watch, you aren't too bright yourself. But here's a review for the -rest- of the crowd, people who wanted something crummy, low-budget, with mediocre acting and bad special effects - something comparable to all the other Sci-Fi channel movies. I -love- those movies, and appreciate the fact that their crumminess is part of their charm. But I think what the writers here failed to realize is that there's a difference between eating a delicious steak a few bites at a time, and having 72 ounces crammed down your throat at once. (Maybe comparing a delicious steak to a movie's crumminess isn't the best metaphor, but it's the best I could come up with). The point is there's just too much awfulness to take in, and it's just unpleasant. The first maybe 30 minutes or so are actually pretty decent, but after that the movie just sort of meanders around and nothing happens (I don't mean in terms of plot - no plot is fine, but no action? Come on.) In hindsight, I should have expected this - after all, how much can really happen between 4 teens and a bear? So although special effects, acting, etc are more or less on par with other Sci-Fi Channel movies, this movie fails in the one place a lousy movie never should - it fails to entertain. And without any entertainment value, all the other weaknesses begin to shine through, and you realize just how bad it really is. So - I'd recommend pretty much anything else. If you have your heart set on the bears-attack genre, \"Grizzly Park\" was not too bad. If you want a decent Sci-Fi Channel movie, \"Aztec Rex\" was pretty awesome. If all else fails, I guess watch this, but maybe consider doing your taxes during the middle hour to throw in some excitement.",
         "WOW! This movie is absolutely terrible; the directors took a dumpy, low-budget film WAY too seriously. I mean, c'mon, with all the misplaced CGI blood, horrible acting (the best performance came from the bear) and continuity errors, you'd swear this was done to give you a good laugh... Mind you, I did miss the very start of the movie, however once I was involved, I also took notes of things throughout the movie (mainly pertaining to survival given the circumstances) and figured I may as well post them. I'll leave out any that have already been covered. (to be continued below)",
         "A woeful script - if indeed there was one - combined with the worst comedy-special-effects known to mankind, make this film possibly the worst I've ever seen. And I've seen a few ... The long list of credits disproves my theory that it was in fact, concocted over a drunken weekend by a bunch of bored, penniless students. What exactly did all those people contribute to this 'movie'? I refuse to believe there was a script, a director, or a budget. I could find enough rubbish under my bed to accurately re-create the 'special effects'. The location appears to be a garbage tip in a wood, and the entire film was shot within a radius of about 50 feet. All this, and a plot based on the premise that the victims all choose to run around in the open to escape the wooden bear, rather than take refuge on the first floor of the empty house. Some of the camera shots are actually quite artistic - possibly evidence that they could only afford to hire a professional for one hour. I feel sorry for the young actors, who have probably had their careers set back 20 years. Some may say that's no bad thing, but I think there is a glimmer of talent there, particularly in Kate Todd. One only hopes they are able to look back and laugh at this in 20 years' time.",
         "This film is about when 4 teens (Wes, Shaun, Ritch and Lauren) go wild after they graduate from high school, brake into private property, and kill a grizzly cub whose mother goes on rage to kill them. The film includes bad actors, goofs, and the toxic junk shouldn't even be in it. I gave it two because I gave it a little credit and at least all the bad actors died! I wish I could go back in time and never watched this rip-off. I mean, bears don't live in that territory, 3 branches will not hold a car, and fake blood splatters isn't going to make it better. Plus, at least a woman got a contraption in her back for bad acting! Plus, this is the first movie I've seen that before the credits, it says the title again. My rating: D- So don't waste your life on this junk like I did, it is also possibly the top ten boringest film I have ever seen! Plus, the dialog is boring and pointless. Don't watch this boring junk.",
         "First a Grizzly as large as the one in this film would need a large hunting ground but yet seemed to be in a fairly small one around a blocked of toxic waste dump and has never been noticed by anyone . Second is the waste dump it self why so many shots of it when they never bothered to say why, was it the reason the bear was so aggressive/seemingly intelligent, was the bear put there to guard the dump, where did the dump come from, why has it not affected the trees and ground water to get noticed by rangers and or nearby communities as from the rusty barrels it has been there for many years. Intelligence on the people, a tire iron is not going to do much against a adult bear, going off alone over and over when as a group they would stand a better chance, not trying to make weapons such as spears at nigh they sit around 2 flash lights instead of building a large a fire as they can for light to give warning of the bear but also to use as protection not to mention to maybe signal someone that at least they were in a no trespassing area to get rangers interested. The cabin seemed to be set up as a defensible position but they don't use it or get any of the weapons from it, also who built it when and what happened to them and when, as recent chicken remains are shown but the cabin it self look long deserted. They trap the bear in the barn but they already see it is getting lose but they just walk away with out trying to reinforce the trap or kill the bear that escapes and kills them leaving no one left alive. Alas your left just siting there going what just happened and why did a watch this.",
         "When four recent high school graduates take an unnecessary detour from their normal vacation plans for some joyriding, they accidentally run over..and kill..a baby bear cub infuriating it's Grizzly mother. When Ritch(Brody Harms)goes in search for water for his cracked radiator after putting his SUV into a tree(..going around dirt road curves at 60 miles an hour, what would one expect?)the grizzly strikes leaving the other three with the warning that their next on it's hit list. When Sean(Graham Kosakoski)attempts to jog for help with a highway some many miles distant he finds an old house with abandoned tools and such. But, before he could go any further, the grizzly throws(!)him on the roof of the house! Soon Sean returns nearly dead leaving Wes(Tyler Hoechlin)and cutie Lauren(Kate Todd)with very few options. How will they ever survive this monster bear with a grudge? The usual genre survival picture pitting unfortunates against nature which doesn't really deviate from the norm. You've seen it all before. Many might chuckle a bit at the bear attack sequences such as when the grizzly jumps on the top of the SUV with Wes and Lauren scared silly inside. It's hard to fault DeCocteau for the rather unrealistic bear attacks on humans and SUV for you can not put your actors or stunt men in close proximity of a killer bear, no matter how tame they might be in real life. So we're stuck with the ones present here showing the bear separately from the cast cutting here and there hoping to convince us that this occurs. The characters are able to get a lot of miles out of that SUV, even after severe damage from the bear, a cracked radiator, being tipped over by the grizzly, and a dead battery. Ultimately the flick comes down to a rather mundane ending that leaves much to be desired.",
         "If you're watching for the purpose of learning how not to make a movie, or how to make a movie for less than the cost of one episode of Trailer Park Boys. I watched because I had an inkling that Kate Todd might actually be able to act, but even if she was an Oscar winner, she couldn't have made this good. Just too low budget to be worth it. If my sister, and her friends made it, I would be surprised, but only because I'd wonder how the f they got a bear to not eat them. Funny, for about 10 seconds, then it is an absolute waste of time. You'll spend a lot of the movie not paying attention, maybe flipping to other channels, as I did, and coming back and saying, didn't something happen that would stop that person from completely walking? Why is that person OK now? Or something? I doesn't make any sense at all. It makes about as much sense as Doctor Seuss having a tea party with Frasier Crane and Peter Griffin, All while on LSD and talking about the recent downturn in the economy of slippers.",
         "WOW!!! what a film, me and my best friend compete to find the worst film of all time!!!! and this film is it!!!! this film is so bad i love it! i've watched it 3 times now! if you've seen it you'll prob think my TV is broke or summit, but no i watched it again on purpose. it amazes me the film got as far as production. i would love to meet the person who read that script and said yes i'll invest in this piece of film history!!!! i don't claim to an animal expert but what the **** was up with that bear!?!?!? plus where was the daddy bear? was this an immaculate conception or are daddy bears just more chilled than mummy bears? my main concern is that these four idiots had just graduated!!!! where the hell from??? i recommend if you have nothing to do and are bored out your mind you watch this film, it'll have you crying with laughter and screaming at your TV! i challenge anyone to watch this film and not be on the bears side by the end! this film is so bad i have to go watch it again!!!!",
         "Grizzly Rage (2007) * 1/2 (out of 4) Incredibly stupid and rather boring \"nature attacks\" film has four teenagers deciding to go off roading for some weekend fun. Like idiots they decide to go through a gate warning them not to go any further but they want to have some fun. Soon the laughs turn to sadness as they accidentally kill a bear cub and soon it's large mother comes for revenge. There's really not too many good things going for this film, which runs out of ideas around the fifteen-minute mark and then we're left with one bad or boring event after another. I think the worst thing is that this film starts off so poorly that you can't help but hate the four people simply because of how annoying they are. You hate them so much for being so stupid and then they end up killing a baby bear and in all honesty I doubt many people are going to feel sorry for them once mommy comes. I think a lot of people are going to be cheering for the bear but the screenplay then adds dumb scenes like the group crying and wondering what they did to deserve the bear attacks. Well, duh, you were acting stupid and killed her child. The screenplay never seems to have any idea of what it wants to do because we're given so many scenes where nothing happens or the characters end up talking about things that either make no sense or you have to wonder why they're even talking about them since they're all about to get eaten. The bear attacks aren't the greatest in the world but they're serviceable. I think the best thing that can be said is that they use a real bear so it's none of that CGI madness. There are a couple shots that are obviously fake including one rather funny sequence where the bear uses its head to try and push the jeep off a cliff. The performances are pretty much what you'd expect from a film like this but the screenplay does none of them any justice. GRIZZLY RAGE isn't the worst film ever made but you should still pretty much skip it and just check out the must better GRIZZLY."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Peace Arch Entertainment Group"],
      "summaries": [
         "4 teens trespass on a closed park site and accidentally run over a Grizzly bear cub. The mother comes after them. Unfortunately, she was been drinking from a lake full of toxic waste, illegally dumped, and has mutated into a super Grizzly bear.",
         "After accidentally killing a bear cub while celebrating graduation in the woods, four teens become the target of a seemingly unstoppable Grizzly."
      ],
      "budget": 2000000
   },
   "movielensId": 159694,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-06-07",
      "dvdReleaseDate": null,
      "directors": ["David DeCoteau"],
      "runtime": 86,
      "movieId": 159694,
      "title": "Grizzly Rage",
      "mpaa": "",
      "actors": [
         "Tyler Hoechlin",
         "Kate Todd",
         "Graham Kosakoski",
         "Brody Harms"
      ],
      "imdbMovieId": "0896816",
      "originalTitle": "Grizzly Rage",
      "genres": [
         "Thriller",
         "Horror",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["Ipqdmi39Jio"],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 30641,
      "avgRating": 3,
      "releaseYear": "2007",
      "numRatings": 2,
      "posterPath": "/VUO5E8mrQTocTqz0QcdlRfhtas.jpg"
   }
}