{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1533058",
      "video": false,
      "title": "Julia X",
      "recommendations": [
         183433,
         108147,
         100274,
         204904,
         166161,
         242033,
         69485,
         65953,
         150889,
         183661,
         264227,
         177552,
         15476,
         336167,
         196305,
         35004,
         213803,
         143942,
         27773,
         406582
      ],
      "backdrop_path": "/dIJsnIOv3W0q8nWjkEw9MkWPbgK.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "58abef7ac3a36849f600ea66",
         "content": "Poor form acting, subpar stunts and some God awful (not to mention completely unnecessary) CGI, but I did have a great time laughing at the subtitle errors.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
         "url": "https://www.themoviedb.org/review/58abef7ac3a36849f600ea66"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe48e29251416c9109b861",
               "name": "Valerie Azlynn",
               "profile_path": "/sFTa7qjamPCIdKfQrcWKaqBhgo6.jpg",
               "id": 66636,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Stranger",
               "gender": 2,
               "credit_id": "52fe48e29251416c9109b865",
               "name": "Kevin Sorbo",
               "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg",
               "id": 51965,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jessica",
               "gender": 1,
               "credit_id": "52fe48e29251416c9109b86f",
               "name": "Alicia Leigh Willis",
               "profile_path": "/jAZejfPEgQ2DRbpLzuOiTqougux.jpg",
               "id": 184560,
               "order": 2
            },
            {
               "cast_id": 21,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe48e39251416c9109b8b3",
               "name": "Joel David Moore",
               "profile_path": "/y6AyGCsQHLoi4LegSS7VRtgRyJe.jpg",
               "id": 59231,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "The Man",
               "gender": 2,
               "credit_id": "52fe48e29251416c9109b873",
               "name": "Ving Rhames",
               "profile_path": "/8nS83GOu0iqxjL2Oj2DgwkAceFQ.jpg",
               "id": 10182,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Young Julia",
               "gender": 1,
               "credit_id": "52fe48e29251416c9109b877",
               "name": "Saxon Sharbino",
               "profile_path": "/p149Yj4AOTaMWTwGpGAZOpdNhGU.jpg",
               "id": 1079805,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The Father",
               "gender": 2,
               "credit_id": "52fe48e29251416c9109b87b",
               "name": "Gregg Brazzel",
               "profile_path": null,
               "id": 84702,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Young Jessica",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b87f",
               "name": "Meg Rains",
               "profile_path": null,
               "id": 1082351,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "The Dead Woman",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b883",
               "name": "Kasi Scarbrough Corley",
               "profile_path": null,
               "id": 1082352,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "The Jogger",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b887",
               "name": "Sarah Duncan",
               "profile_path": null,
               "id": 1082353,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Business Man with Mistress",
               "gender": 2,
               "credit_id": "52fe48e39251416c9109b88b",
               "name": "Ted Ferguson",
               "profile_path": "/j3ZaVsHjlo1WbkkcQykmCK5Jn5j.jpg",
               "id": 1026877,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Coffee Barista",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b88f",
               "name": "Michael Kober",
               "profile_path": null,
               "id": 1082354,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Coffee Shop Patron",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b893",
               "name": "James B. McDaniel",
               "profile_path": null,
               "id": 1082355,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "The Girl at the coffee door",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b897",
               "name": "Courtney Rawls",
               "profile_path": null,
               "id": 1082356,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Polizist",
               "gender": 2,
               "credit_id": "52fe48e39251416c9109b89b",
               "name": "Michael Showers",
               "profile_path": null,
               "id": 109787,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Barista",
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b89f",
               "name": "Lindsay Small",
               "profile_path": null,
               "id": 1082357,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Young Julia's Mother",
               "gender": 1,
               "credit_id": "52fe48e39251416c9109b8a3",
               "name": "Cassie Shea Watson",
               "profile_path": "/ncg4SfCIe0XtFy7XOwT2uNhJt6r.jpg",
               "id": 1082358,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48e29251416c9109b86b",
               "name": "P.J. Pettiette",
               "profile_path": null,
               "id": 562691,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e39251416c9109b8a9",
               "name": "P.J. Pettiette",
               "profile_path": null,
               "id": 562691,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e39251416c9109b8af",
               "name": "Matt Cunningham",
               "profile_path": null,
               "id": 101486,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.812617,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84228,
      "vote_count": 38,
      "budget": 4000000,
      "overview": "Meeting a man on the Internet, Julia decides to see him in person, only to get abducted and branded with the letter \"x\" by that guy. A game of cat and mouse follows, but the story has an unexpected twist.",
      "similar": [],
      "original_title": "Julia X",
      "runtime": 92,
      "poster_path": "/epXlnFxNdiWVnsO9f1E9sd2axOC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Dixie Theatrical Corporation",
         "id": 26610,
         "origin_country": ""
      }],
      "release_date": "2011-09-24",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["P.J. Pettiette"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Matt Cunningham",
         "P.J. Pettiette"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1533058/",
      "coverLink": null,
      "actors": [
         "Valerie Azlynn",
         "Kevin Sorbo",
         "Alicia Leigh Willis"
      ],
      "reviews": [
         "Julia (Valerie Azlynn) is a young woman dating a stranger (Kevin Sorbo) that she met on the Internet in a bar. Out of the blue, she decides to leave the man and goes to the parking lot. However, the stranger abducts her and brands her thigh with the letter \"X\". Then he brings Julia and a corpse of a woman in his truck to dump the body in the middle of nowhere. However Julia flees from him and hides in an old house. The man hunts her but she subdues him. Then she calls her sister Jessica (Alicia Leigh Willis) and they bring him to her house. Soon the stranger learns that the sisters are deranged and is tortured by them. What will happen to the man? \"Julia X\" is a B-movie with a promising storyline of cat-and-mouse game. However the execution is flawed and the gore story is lost between horror and black comedy. In the end, \"Julia X\" is too silly for horror and the black humor is not funny. My vote is four. Title (Brazil): \"A Vingança de Julia\" (\"The Revenge of Julia\")",
         "This one starts off really bad. It starts like a B movie that you made a mistake taking a chance on, but give it time it turns out to be fun. So this is one of those dangers of internet dating tales in the beginning, a hot girl gets kidnapped by a serial killer and is seemingly his next victim, She escapes and with the help of her hot sister turns the tables. OK, so this is a B-movie, Kevin Sorbo is in it and that should say enough to turn and run away screaming \"NO.\" The main character Julia (Valerie Azlynn) is hot enough to keep you watching as a guy, and when her sister, Jessica (Alicia Leigh Willis) gets into the action it just ends up being a fun, comedy, horror flick. Nothing thought provoking, the script is lame enough that it makes for a decent laugh. A lot of violence, some blood, the only thing that could have made this B movie any better would be if the Women showed some more skin and threw in some good sex scenes. This is what a B movie should be. Fun, twisted Fun. I was amazed I would enjoy this movie, but I did, 7 stars for me.",
         "Another wannabe tongue-in-cheek splatter flick that is, in fact, not nearly as crowd-pleasing as the creators intended it to be. The film opens very traditional; with Hercules (Kevin Sorbo for friends) depicting a handsome yet deranged serial killer who meets his victims via dating sites and then eventually kills and bookmarks them with a follow-up letter of the alphabet on their butts. Why? Because all females are cruel heartless bitches, of course! And, by the looks of it, our boy Hercules (whose character actually remains nameless throughout the entire film) has been active for quite a while, as the sexy blond Julia sitting across him at the restaurant table during the opening sequences is supposed to become number \"X\" already. But this date won't go as easily as planned for Hercules, because Julia – together with her equally ravishing younger sister Jessica – is a serial killer herself, also targeting men that respond to dating ads placed by luscious blond chicks. Why? Because all males are sexually perverted bastards like their daddy was, of course! The revelation of Julia being a serial killer herself is supposed to come as a totally unexpected plot twist, but I surely haven't got a problem with mentioning it here in the review, as you can see it coming from several miles away. The concept of a \"showdown between serial killers\" certainly isn't new and, moreover, it's one of the most implausible and far-fetched formulas imaginable. \"Julia X\" also doesn't undertake any effort to provide the story and characters with more depth and/or background. We learn absolutely nothing about Hercules' character (not even his name) and the explanation of the girls' bad behavior is restricted to a few very clichéd flashbacks and a handful of verbal arguments between them. Instead, the whole damn film is just a non-stop series of torturing, fights, escapes, chases and wannabe witty one-liners. The \"X\" in the title might just as well stand for the Roman number ten and refer to the amount of times that Hercules ought to have died! He's beaten, stabbed, bludgeoned, thrown from heights and mutilated more than any living creature could possibly bear – yes, even Hercules – and yet he rises again every time seemingly even without suffering. Both girls as well put up with a lot more physical agony than their beautiful anatomy can possibly handle. \"Julia X\" is a film that is dreadfully overlong, or at least feels that way because the subject matter is minimal and simplistic. This actually might have worked a lot better as a short, with approximately three quarters of the cat-and-mouse games cut from the final print. On the plus side, the special effects and make-up are quite superior and, if you have the opportunity to watch the film with 3D-glasses on your nose, it's definitely worthwhile. It's one of those rare flicks where the 3D treatment isn't just a lame gimmick to lure more viewers, but an actual added value.",
         "God, did I enjoyed this flick. You just have to watch it without thinking and you will have a lot of fun with two hot chicks and a lot of red stuff. It is P.J. Pettiette first attempt to direct a horror but being a producer of a few horrors it shows clearly that the director knew his stuff. It's a flick with a great twist that you just couldn't see coming. It all starts off when Julia (Valerie Azlynn) met a stranger (Kevin Sorbo) via internet not knowing that he is a serial killer. From the first minutes the red stuff comes in. Both Julia and the stranger are believable. Of course Julia tries to escape and once she tries it this flick becomes something different and from that point Jessica (Alicia Leigh Willis)comes into the story, the sister of Julia. This flick is full of red stuff but it never becomes gory. Still, if you take it seriously then you will hate this but just watch it as a no-brainer. The only thing it is missing is of course some nudity. There is a bath scene with Julia but nothing is shown. Towards the end you will have a laugh on your face and the end scene is so predictable and funny, yes, I liked it a lot. And I liked Kevin although a lot hate him. Gore 1/5 Nudity 0/5 Effects 3/5 Story 4/5 Comedy 1/5",
         "A young woman means an attractive, muscular guy in a chat room. What could go wrong? For whatever reason she has a bad feeling about her date, makes her excuses and leaves. Her intuition was right because he is a serial killer whose MO is to brand his victims with the letter X using a red hot iron. When she returns to her vehicle he is waiting inside for her, kidnaps her, takes her to his lair, brands her, then makes the mistake of not murdering her then and there. More than once. Seizing her opportunity, she escapes from his clutches and against the odds overpowers him. At this point we are not far enough into the film for the cops to arrive, and they don't, rather her sister does; the two are more than sisters, they are a killer couple. This is where it gets silly. The implication is they are like this because they were sexually abused by their own father; they appear to hate men, or at least any man who gives them the eye, which is most red-blooded males over the age of about 14 because they are both strikingly attractive. What happens next? Well, the younger sister lures the man across the road into the house on the pretext of fixing her bike; the serial killer has his feel nailed to the floor crucifixion fashion, and when he frees himself, you have to think this is some kind of bizarre satire, because he is as blithely nonchalant as when his victim escaped when in the real world he would have been in desperate need of medical treatment. A satire on what remains to be seen. Comedy? The problem with that is that for the first part of the film there are no laughs at all. Any points this one earns is for originality and mild special effects, but even originality can be over-rated.",
         "And I'm not talking about the 3-D effects (though I did like them, because they are showing depth, rather then jumping out of the screen at you). While the movie starts of conventionally and very straightforward it soon leaves that path (no pun intended) and strays to other areas. You might hold this against the movie, but I think it's one the strongest points it has going for it. The wonderful Kevin Sorbo is having a great time and hopefully so will you. It is very much tongue in cheek (sometimes even literally) and after a strange opening the movie does not disappoint. If you are into Non-PC humor that is of course. Because it can go to very dark places and it is very explicit at times (gore-wise). A great movie, that was much better than I could have expected.",
         "Don't expect this movie to make any sense. There are lots of continuity errors, and the directing is simply awful at times. You will find yourself wondering why a character did or said what they did on more than several occasions. I completely understand why this movie has such a poor rating, and I myself have rated it poorly, however, from the meagre helping of existing reviews for this title suggest, there is definitely an audience for this kind of thing. I'm not sure if it's a B-movie in the traditional sense, but it is definitely along those lines. If blood and violence is your thing, and 'kind of' attractive girls, and if you're really not bothered for things making any kind of sense what-so-ever, or the plot driving the film, or the script being good in any way shape or form, then this film might just entertain you for the short amount of time that it runs for. And for me personally, I was glad it was so short! I'm giving this 2 out of 10, just for the fact that I managed to watch it from start to finish. I will not be watching it again, nor shall i be recommending it, unless of course I find myself in a conversation with someone who likes dumb ass movies with violent bitches and lots of blood...",
         "In the intro we find out a serial killer is on the loose. He brands women with a letter and kills them. Julia and a guy are on a date. They are attracted to each other, so much so that Julia fantasizes about him but cuts the date short and leaves. Somehow, they guy manages to be in her car as she gets in it and kidnaps her. He takes her to some garage where he cleans up and shaves. She's hanging from some wires but frees herself. He finds her and brands her with an X. He drives her out to the country where he dumps another corpse in the ground. Julia escapes again, makes it a house--which is his house. They beat each other up. She escapes to some other building. He goes after her, they beat each other up some more, she knocks him out. A car arrives. It's Julia's sister, Jessica. They put the guy in the trunk and take him to their house where they torture him. We learn a bit about the girls' childhood and their problem with men. They also have problems with each other. Julia is the dominant one and doesn't let Jessica do anything. Jessica wants to take charge, she wants to kill. So she goes to a neighbor and seduces him, takes him home and puts him in a chair with the other guy. As the two talk we learn something about the stranger. He could free himself and the neighbor and escape. Instead, he frees himself and goes after his date so they can beat each other up. He's a masochist and enjoys it...and so does Julia but she doesn't realize it until late into the movie. Julia X features plenty of violence against women, against men, and lots of torture. If that bothers you, then this movie isn't for you. It also has a strong performance by Kevin Sorbo. Unfortunately you can't really have an entire movie on the basis of violence. It all gets too repetitive. The character of Jessica is a bit too wacky, considering things. The concept is actually a good one, even somewhat original, but more story was needed.",
         "I saw the film so unlike the other reviewers (11) so far that I feel I should write a review of my own. No sense? Bad continuity? Funny? Stupid? B movie? Trash? Watch it without thinking? Don't take it seriously? No, I saw it very differently. For a while I was thinking why am I wasting time watching this. Lots of blood. Seemed like senseless violence for a time, but I hung in there. After a while it made good sense. Being alert to detail helps. Enough work went into this film that I would not call it a B movie. Acting was quite good. Think of what wife-beating and sexual abuse by a father can do to children. There is anger. Think of disgusting male sexual behavior and what this can do to women. That this can result in aberrant behavior as well as wasted life is how the film makes sense. A commentary on modern society. What happens to people. Abused people do do things many of us would not. There is room for serious thought here. Not pleasant, not funny, not stupid, and not trashy. I would much rather people think seriously of these things. I cannot say I enjoyed the film, but I found it thought provoking. Oh, and one more thing. Plenty of opportunity to throw in gratuitous nudity. They did not, and that also means something.",
         "First of all, the cover intrigued me, as I saw two legs crossed like an ''X'' and I didn't see from where, so I thought it meant something like a danger sign, only without the skull... I liked the movie because even when it starts like many other, this one have some twists. After the first chase, I was expecting the obvious, then Kevin got chained and managed to escape. I was expecting that he would run away from the kidnappers, but it turned out he was a masochistic and wanted to follow the date through! Isn't that original? He was actually enjoying all that, when other people,like Sam, would run away immediately! They were birds of a feather! The movie is different, it is good and entertaining, three things we don't see together everyday lately... 7 stars from me too!",
         "First and foremost, Ving Rhames who gets his name on the cover and who was the main reason I got interested in watching this movie is barely in it He's in it in the very last scene for exactly 94 seconds, that is it So yeah if you're like me a Ving Rhames fan watch something else As far as the movie goes, I expected more of an action movie tbh, but I have no problems with the horror genre, in fact it's one of my most watched genres But this is just not very horrifying It's a somewhat typical 'lure you into my house where I can torture you and no one can hear you scream' type of movie But the twist is that the torturers aren't the typical dirty rednecks instead they are somewhat attractive women And instead of torturing them in the countryside where no one can hear you scream, they do it in the middle of the city Where STILL no one can hear you scream (for some odd reason) And you can cause all kinds of mayhem and no one can see it (for the same odd reason) Anyhow the set ups looks exactly like porno scenes with the sisters seducing there victims and the acting is the like as well, nudity free however Anyhoots the rest of the movie is basically them punching and torturing Kevin Sorbo with a couple twists (kinda) so if you always dreamt about seeing Kevin Sorbo being slapped in the face by a woman then I guess you might find some joy in this, otherwise I would stay clear of this movie There was a couple of laughs because of how bad it was but overall it was boring and annoying to watch",
         "I can say that I enjoyed the hell outta this film. My only gripe was the soundtrack which was composed by Ryan Beveridge, his music did not suit this film. Although I did like the fact that music by Karen Carpenter was throw in there (trust me her song belonged in this movie), you'll see why when you view this film. But other than the soundtrack. This film rocked, from start to finish. You won't believe how awesome Kevin Sorbo was as 'The Stranger'. He played his character with wicked perfection and my thoughts of him portraying 'Hercules' in the television series were quickly washed away by the flow of bloodshed he and his female counterparts(Valerie Azlynn and Alicia Leigh Willis)splattered throughout the film. There were a few flaws in the directing, but other than that Director P.J. Pettiette has delivered in my opinion a horror classic. So I beg of you, please please whenever you get the chance, see 'Julia X' it's a bloody good time.",
         "The edit is sh*t, the music is sh*t, the places are sh*t, directing is sh*t, ale the movie is a total crap.. BUT the story is so f*cking awesome :D I really enjoyed this creation. first 20 minutes were hard, and I was really going to switch it off.. But then.. happened something I just could not do it any more.. so I left it play. I will never regret this decision :D Great! I wish you all the best And to enjoy it just as I did :) Best story ever! :D the story is so no predictable at some point you just start to watch it and enjoy. There is a lot of humor in this.. so called horror. I would not say it is a horror or a thriller movie. It is a black comedy. A forgotten genre :)",
         "A serial killer, played by Kevin Sorbo, lures a victim from a chat room, kidnaps her and starts to torture her. Half an hour into the movie, you find out that the 'victim' is not an innocent, but part of a sisterly duo of serial killers who their own twisted plans for him. Then it's a smörgåsbord of torture scenes. Unintentionally hilarious piece of crap. But it's basically what one I expected based on the ratings online. So I shouldn't be complaining, and neither should you, unless you were tricked into watching this by some douche of a friend who promised the next Silence of the Lambs. I mean - in the normal course of things, you would have seen the trailer/ read a two line review about the movie, and that should be enough to prepare you for what the movie is about.",
         "This was a great surprise. I rented it as a last option with some friends basically because it had Kevin Sorbo in it and looked vaguely interesting. What I got was a fantastic and funny game of cat and mouse where the tables are turned many times. To mention any of the plot would be to give too much away nut luckily the action escalates quickly and there's rarely a boring moment. Sorbo's performance is one of the best I've seen from him in a long time. Most of the humour and success of the film comes from him and his indestructible character known as 'The Stranger'. No one can defeat the mighty Hercules. This bloke can take some serious punishment and laugh it off with style. For those of you who like plenty of violence and blood (like me) there's plenty to be had here. Most of the film has a fun tone except for when it switches to the girls back story which then jolts the viewer into much more serious territory for several minutes before being taken back to the party. It's like being at a beach party with mates only to look down and realise a shark has taken your leg off at the knee, but then to look around and realise that acid your friend gave you at the party is kicking in but your still having a great time. Anyway I heartily recommend this film for a good time with mates or to impress your girlfriend with Sorboism (the new word for orgasm). Watch it just for the Ving Rhames seen at the end. This needs to happen more often to Ving.",
         "The film has had mixed reviews, but lets start with the positives. The 3D is superb. It is, undoubtedly, one of the best uses of 3D tech I have ever seen: the feathers, dust, everything combines to give an amazing depth of field that is just breath-taking. The premise and the twist is brilliant. Totally did not see that coming. The idea was brilliant. Alas, the execution was less so. The scenes are ridiculously violent, the characters are skin deep and much of the decisions by the characters are non-nonsensical. Basically, it feels like they filmed a first draft. Which is a shame, because there are elements of this film that suggested it could be a cult classic. It's worth 90 minutes of your time to watch. Especially in 3D. It is not worth buying.",
         "JULIA X is a very strange film indeed and that it works at all is down to the talents of writer/director P.J. Pettiette, who brings a ton of high energy slapstick to his production. This twisty-turny thriller turns out to be a black comedy of epic proportions, with virtually no story to drag down the pacing. It's simply a battle of wits between a serial killer and his supposed victims. The film benefits immensely from the presence of former HERCULES star Kevin Sorbo playing the killer. Sorbo is a likable, lovable screen presence and that continues to be the case here; you just can't take him seriously as the villain as his persona is exactly the same. The story sees him taking a woman captive with the intent to kill her, but the tables are turned early on. What follows is a gruelling journey of violence as incredible amounts of pain and torture are inflicted on each of the leading characters in turn. The special effects are effective, yes, but the film's light-hearted feel means that this never ventures into real torture porn territory; the intention is to entertain, not to disgust, so it's surprisingly enjoyable. I usually hate this genre so it's saying something that I enjoyed this one.",
         "Kevin Sorbo aka Hercules aka Captain Dylan Hunt. It was just the hardest/strangest thing to see him as a serial killer. I mean, c'mon! And the scary thing is... he actually looked good doing it! So the movie is all about a serial killer. He kidnaps, rapes (we assume), kills and dumps the bodies of women. Then he meets Julia. Ahh, was there ever a match made in Heaven? Turns out Julia and her sis Jessica are almost like him. In the final fight I honestly saw it going one of either 2 ways... they stop and become a couple or kill each other. Did not expect the ending I got. Ahh well. And then Jessica is a cuckoo (screwed up majorly in the brain cuckoo!) who..., well, watch and see. If you are expecting a great movie, go away. This is for the B-movie lovers and low A-rankers. Shucks, i'd even rank it better than Re-animator (and I am a huge Jeffery Combs fan!). Overall opinion.... I liked it and had a good time watching it! Cheers",
         "After a decent turn as Hercules, TV's Kevin Sorbo has been doing C Grade straight to video fare for some years now. This is one if his better efforts. Its just as well this movie doesn't take itself seriously. This movie, Julia X, is a throw back to those rape revenge flicks that proliferated the 70s B Grade shelves in video stores everywhere. Some pretty trusting young stupid, but ultimately psychotically vengeful hot young woman, is abused in a variety of ways only to eventually triumphantly wreak her revenge. Anyway, this wont win any awards, but who cares, its a well made campy violent movie that fans of violent campy exploitation cinema will enjoy. 6/10",
         "\"Julia X\" was a movie that hadn't particularly caught my attention, nor can I claim to have had any knowledge about it before I accidentally came across it and decided to give it a go. The movie started out quite nicely actually, and it was nice to see Kevin Sorbo in a role such as this one. And I will say that he actually pulled it off quite nicely. He has actually done some good work in movies aside from just being known for his work in \"Hercules\", so if you aren't already familiar with his acting in movies, you should get around to watching some. \"Julia X\" has a story that starts out rather interesting, but unfortunately takes a turn for the worse, story-wise that is, when you learn about what is going on and when the big plot twist is revealed. Sure it was good entertainment and lots of fun, but it was just unrealistic and stupid on a high level. The way the story turned out after that twist was fun enough in itself, but took the story in a very bad direction. That being said, don't get me wrong, because the movie is fun to watch, lots of blood and violence, but it just went steeply downhill at the revealing of the plot twist. Most of the dialogue was alright, but there were moments here and there that makes you cringe and go 'who would say something like that in a situation like that?' So the dialogue had some anchor points that pulled the movie down a bit. There were some moments of continuity problems as well. I was especially impressed with how The Stranger just put back on his boots after having a huge spike driven through both feet and was able to walk about with no difficulty. And also the scene in the restroom where The Man was stabbed in the eye and blood sprayed out everywhere, but the floor was spotless clean in the following scenes (aside from that which ran out underneath his head), that was just amazing. Self-cleaning restroom floor, eh? \"Julia X\" is a mediocre slasher movie that, in my opinion, fell to the floor horribly when the story took a twist for a very unrealistic approach. But all in all, the movie was entertaining and fun to watch. Just don't watch it with your reality-goggles on. Had they not gone for that somewhat stupid plot twist, then the movie could have been far better.",
         "Julia X is kind of a confusing movie with a very odd flimsy story and tone that feels a bit goofy and experimental. For about half an hour I didn't care for what it seemed to be, which was yet another pretty girl being kidnapped by some sadistic asshole, sure wasn't like I hadn't seen that too many damn times before.. And even after the twist that the girl was neither helpless nor innocent but was in fact a killer herself was revealed and the hunter became the hunted, I still wasn't that keen, the quality was kinda sucky. But when I got what it was really going for and the real fun began I got into it and ended up having a pretty good time, it was dumb but it rocked. I'm not gonna say it's not, it is a very sloppily put together movie, it's like the writers had a good idea and had no clue as to how to fill up all the little details that make a full length feature. And by the end there are so many hopelessly loose ends that never come together that I could see why some would plain hate it, but I just personally enjoyed it for the action and unintentional comedy. What little plot there was felt like a mere contrivance to pit psychos against each other in a macabre royal rumble, and in that sense it delivers in spades. It doesn't even bother with fancy luxuries like atmosphere and adequate characterisation. Just. Plain. Business... So, I really wasn't buying Kevin Sorbo as a vicious serial killer for a moment, the guy is just too naturally likable, he's got all those years he played heroic Hercules hanging over him that he'll never live down that it's kinda hard to see him in that light. And it's weird hearing him swear, like hearing your grandmother! That said, I may not have believed him as scary killer guy, but I thought he excelled at being comically twisted beat-up guy who was getting a perverse kick out of a horrendous situation of constant brutality and the pain he was continuously receiving and dishing out, he was much better at conveying all that dark s**t.. He looked good and totally in his element in the physical action scenes, it's what he does the best. I don't think I've ever seen another independent horror movie with such extensive stunt work. And of the two women, I thought Alicia Leigh Willis played crazy a lot better than the other, I thought she was really funny with all her kinky body language and the creepy mischievous look on her face, she would have made a great Harley Quinn! She had such killer legs.. The scenes with them all yield such marvellous mayhem, I mean compared to what it starts out as this film goes so completely off the rails that I wasn't sure when to laugh or be shocked because the tone veers crazily between brutal and dangerous to almost cartoony madness that I found it such a mindless but fun and entertaining blast to watch! It had me laughing at how absurdly unrealistic the results of the injuries were. Like Sorbo's character suffered so many stabbings, pelvic limb and vertebral fractures, not to mention concurrent massive head traumas with being cracked over the head so many times that he should've been dead at least twenty times over! And something else that I enjoyed was how there was nobody to root for! All three were completely unsympathetic pain-loving maniacs! The only sympathetic character was Joel David Moore who played an abducted car mechanic who I think was meant to be a little slow in the head, and who is strangely and unexpectedly let go completely unharmed.. He's so lanky and cute, I do so like 'em nerdy! It was sick but fun-sick, never too unpleasant. I guess the most noticeable and disturbing thing about this movie is the definite theme of sadomasochism that runs through it. What a wild show. It takes a while to get going, but once it does it runs like a mother***ker!!!",
         "Instructions: Try make it through the first 20 or so minutes. Stop shaking your head in disbelief - the feeling is endless. Give up hope immediately of any flash of smouldering ladyflesh. The storyline cries out for it but it never comes. Not even the bath scene. Sorry. Search the internet for whoever edited this horror, and check if he has recovered yet. At the time, the man was obviously very ill/stoned/deranged, or all three, probably! Search within you for a fun frame of mind. That way you'll find yourself laughing - slowly at first, and like the film, build to a bloody climax. Watch it with friends, popcorn and beer - lots of it. And suddenly the realisation will click into place. Yep, it's so much worse than bad - it's gorily brilliant! ENJOY!"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "21st Century 3D",
         "Dixie Theatrical Corporation"
      ],
      "summaries": [
         "Julia is a young woman dating a stranger that she met on the Internet in a bar. Out of the blue, she decides to leave the man and goes to the parking lot. However, the stranger abducts her and brands her thigh with the letter \"X\". Then he brings Julia and a corpse of a woman in his truck to dump the body in the middle of nowhere. However Julia flees from him and hides in an old house. The man hunts her but she subdues him. Then she calls her sister Jessica and they bring him to her house. Soon the stranger learns that the sisters are deranged and is tortured by them. What will happen to the man?",
         "Meeting a man on the Internet, Julia decides to see him in person, only to get abducted and branded with the letter \"x\" by that guy. A game of cat and mouse follows, but the story has an unexpected twist."
      ],
      "budget": 4000000
   },
   "movielensId": 160014,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2011-09-24",
      "dvdReleaseDate": null,
      "directors": ["P.J. Pettiette"],
      "runtime": 92,
      "movieId": 160014,
      "title": "Julia X",
      "mpaa": "NR",
      "actors": [
         "Valerie Azlynn",
         "Kevin Sorbo",
         "Alicia Leigh Willis",
         "Joel David Moore",
         "Ving Rhames",
         "Saxon Sharbino",
         "Gregg Brazzel",
         "Meg Rains",
         "Kasi Scarbrough Corley",
         "Sarah Duncan",
         "Ted Ferguson",
         "Michael Kober",
         "James B. McDaniel",
         "Courtney Rawls",
         "Michael Showers",
         "Lindsay Small",
         "Cassie Shea Watson"
      ],
      "imdbMovieId": "1533058",
      "originalTitle": "Julia X",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "Meeting a man on the Internet, Julia decides to see him in person, only to get abducted and branded with the letter \"x\" by that guy. A game of cat and mouse follows, but the story has an unexpected twist.",
      "tmdbMovieId": 84228,
      "avgRating": 2.5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/epXlnFxNdiWVnsO9f1E9sd2axOC.jpg"
   }
}