{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0490488",
      "video": false,
      "title": "Dead Run",
      "recommendations": [
         25054,
         26896
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "54828c5ec3a36829ab007b71",
               "name": "Yuya Tegoshi",
               "profile_path": "/eBTc7KkEYYU4YZRY4fRP8UxrFmJ.jpg",
               "id": 577605,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "54828c66c3a36829ae006fe6",
               "name": "Hanae Kan",
               "profile_path": "/yyYZLqWZRN5LFlxBGyHNEkZpi1l.jpg",
               "id": 25652,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "54828c6ec3a36829b5009366",
               "name": "Miki Nakatani",
               "profile_path": "/qaRpv9GOkUX2ClscEGNJ9wdqwCZ.jpg",
               "id": 27778,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "54828c77c3a36829a7007999",
               "name": "Etsushi Toyokawa",
               "profile_path": "/gkmAbZ47w7jFfr1ASgs1cqZY9Mi.jpg",
               "id": 80754,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "54828c80c3a36829ab007b75",
               "name": "Ryo Kase",
               "profile_path": "/8Fnh4yzktTsFbJCLnWnGmInajG5.jpg",
               "id": 33517,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "54828c879251414efa007f49",
               "name": "Ren Osugi",
               "profile_path": "/AtITnpwCJXRxaO0K2kKcDYeef7o.jpg",
               "id": 137029,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "54828c8ec3a3684afd002976",
               "name": "Susumu Terajima",
               "profile_path": "/oZPxC2TvOu9DeeVUg38P043ItpJ.jpg",
               "id": 4990,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "54828c97c3a36829b5009371",
               "name": "Shun Sugata",
               "profile_path": "/9Ntziepdp2P2xsLGHdy0rchVJ3G.jpg",
               "id": 9193,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "54828cb99251416e6c006e2c",
               "name": "Hitomi Takahashi",
               "profile_path": "/l1W84J2kpxwUerl6xlUm1gMhokM.jpg",
               "id": 1057931,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "54828cda9251416e74007b99",
               "name": "Tasuku Emoto",
               "profile_path": "/1cGfekGjCLp0LpZxzXeY7Lon6bU.jpg",
               "id": 111639,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "54828ceac3a36829a30077bb",
               "name": "Kazuma Suzuki",
               "profile_path": "/ft14DofbfZjJx5iVx5vNIldt7EJ.jpg",
               "id": 78267,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "54828cf09251416e7b006feb",
               "name": "Shin Yazawa",
               "profile_path": null,
               "id": 97340,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "54828cfac3a3685c0e0016ef",
               "name": "Sei Hiraizumi",
               "profile_path": "/wsJ6zNlcOq67BNAudgU2OILj7Du.jpg",
               "id": 85939,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "54828d07c3a3684afd00297f",
               "name": "Shifumi Yamaguichi",
               "profile_path": null,
               "id": 1279794,
               "order": 15
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4a48c3a36847f81c51c3",
            "name": "SABU",
            "profile_path": "/qNjgqL33xBtkEJfW51G2Cc08pu6.jpg",
            "id": 58614,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.217654,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 105136,
      "vote_count": 3,
      "budget": 0,
      "overview": "The story concerns a boy called Shuji, growing up in a rural area of Japan where the community is divided into \"Shore\" and \"Offshore\" - the latter so-named because it is built on reclaimed land. He meets a few main characters, besides his family, that shape his development - gangster Oni-ken (Susumu Terajima) and his hostess girlfriend, an ominous-looking Catholic priest and his congregation-of-one, the troubled and rebellious teenage girl Eri - who also becomes Shuji's classmate and the object of his adolescent affections. Life in the Shore/Offshore community is not a bundle of joy - the impression is of a community and lifestyle in decay, with the only hope of rejuvenation being a gangster-funded hotel development project that doesn't exactly inspire the locals either. It's an environment that does not fill its young inhabitants with much hope or inspiration.",
      "similar": [],
      "original_title": "疾走",
      "runtime": 124,
      "poster_path": "/kn6V4bXBfmz1EDi6dvtTG9jDBLg.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2005-12-17",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["SABU"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "SABU",
         "Kiyoshi Shigematsu"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0490488/",
      "coverLink": null,
      "actors": [
         "Yûya Tegoshi",
         "Hanae Kan",
         "Miki Nakatani"
      ],
      "reviews": [
         "Director Sabu has a small cult following thanks to his quirky, slightly clever but mostly quite fluffy comedies which tend to be based around a literal perspective on the theory that a good story is about the characters' \"journeys\". However, there was a suspicion gaining ground that he was stuck in a rut with this theme/style, especially after the rather uninspired and uninteresting pair of BLESSING BELL and HARD LUCK HERO. Perhaps feeling this rut himself, DEAD RUN represents a pretty radical change of direction (and style) for the director. Not only are the characters' journeys more metaphorical than literal this time around, but 'light fluffy comedy' is right off the menu... DEAD RUN is heavy stuff. The film feels more typically 'Japanese' than Sabu's other work (which feels like nothing so much as Sabu's other work). The pacing is languid, the storytelling sometimes oblique and mostly stripped of exposition (though sections are narrated, curiously, in the second person). The prevailing atmosphere is of melancholy throughout most of the film, reinforced by mostly static camera placement and a (beautiful) haunting soundtrack. Stylistically there are definitely shades of Shunji Iwai, maybe with traces of Takeshi Kitano and Toshiaki Toyoda. The story concerns a boy called Shuji, growing up in a rural area of Japan where the community is divided into \"Shore\" and \"Offshore\" - the latter so-named because it is built on reclaimed land. He meets a few main characters, besides his family, that shape his development - gangster Oni-ken (Susumu Terajima) and his hostess girlfriend, an ominous-looking Catholic priest and his congregation-of-one, the troubled and rebellious teenage girl Eri - who also becomes Shuji's classmate and the object of his adolescent affections. Life in the Shore/Offshore community is not a bundle of joy - the impression is of a community and lifestyle in decay, with the only hope of rejuvenation being a gangster-funded hotel development project that doesn't exactly inspire the locals either. It's an environment that does not fill its young inhabitants with much hope or inspiration. Since Sabu's previous films have essentially been about self-discovery through a journey, one might expect that DEAD RUN will follow a similar path - which leads the characters to discover the hope and inspiration missing from their environment. One would be wrong. When a glimmer of hope seems to appear on the horizon, you can be fairly sure that its going to be dashed. The central and recurring presence of the church and the bible often had me wondering if Sabu was going to start selling Christianity to me, but the promise of redemption it initially seems to offer is never delivered. As I said, DEAD RUN is definitely a departure from Sabu's other films. In fact, this turns out to be the main criticism I have of the film. Whilst the first 2/3rds are undoubtedly powerful stuff, with ideas and imagery that are sure to leave an impression, I couldn't help *hoping* that Sabu was going to pull some redemption and optimism out of his hat in the last act. In fact, circumstances do force characters to abandon their passive slide towards defeat and take charge of their lives, but whilst this is certainly transformative, it is hard to argue that it's redemptive. Whilst events in the final few reels are often unexpected, they are in many ways too obvious - in the context of Japanese cinema at large, if not Sabu's own body of prior work. This leaves them feeling rather unfulfilling, especially because they sometimes rely on characters acting in a manner that they've shown no disposition towards earlier. I assume that the novel being adapted provided constraints in this respect, but I think the film would have been more successful if it had followed a more typically Sabu-ian trajectory at the end. The film definitely shows that Sabu is more than a one-trick pony though, and being more high-brow and portentous will perhaps help him to cross over with international audiences in the way that some of his contemporaries have managed (though it is not at all clear why his earlier films have been largely neglected outside - and probably inside - Japan). Despite my reservations about the ending, it's a powerful film that is worth a watch.",
         "If you have seen some of Sabu's previous films, this one may be a bit startling. Though there are still many coincidences and it basically remains a road movie, the trademark laconic humor is missing. What we have is a very oddball social drama, and the first film by Sabu he has adapted from a novel. And this may be its biggest problem, as - even judging solely on the thematic range of the film - the novel must be quite a big and complex effort in telling one persons life story. To compress such a book into a 2 hour film is a difficult task which Sabu doesn't always manage successfully. Between extended contemplative periods, there are disproportionately fast episodes with numerous twists and turns. Either he should have used at least 4 hours to tell his epic story, or shortened the overall occurrences into a coherent whole. As it is, the film often appears a mess, with moods changing swiftly, and introducing shocking scenes into the overall melancholia that seem out of context. At times Sabu seems to be copying some of his contemporaries like Takashi Miike, Shunji Iwai and Sion Sono, rather than creating anything personal. But after a bumpy ride I was nevertheless released from the film with a \"completed\" frame of mind, and the feeling that this may be a transitional (and important) phase for Sabu to brake free of his image. In the end he succeeded in creating a highly fascinating film, that will surely trigger further rewards with repeated viewings. And the eclectic mix of originality and banality regarding his stylistics seemed oddly satisfying. Somehow he managed to walk the line between trash and art, and emerge with something truthful. In this regard the film could be a good companion piece with Sono Sion's \"Strange Circus\" which stumbled while performing the same task. Also fine acting by the fascinating Hanae Kan, whom I still have a fond memory of from her difficult role in Koreeda's \"Nobody Knows\".",
         "Essentially the movie tells of the story of the central character, Shuji (Yuga Tegoshi), and his ultimate downfall from grace. However, with the way the narrative is set up, you'll most likely be bewildered as to how the movie is going to develop and which direction it's going to take. It's quite messy with its many ideas thrown in at multiple points, each may or may not providing the resolution you're seeking. In fact, it has so many ideas (since it's adapted from a novel), that it's almost like watching an incident laden life of a young boy growing up into a teenager, examining and observing his interactions with unexpected members of society, ranging from small town gangsters, to big town Yakuzas, from gangster molls to his own female peer in Eri (Hanae Kan), who shares the same passion for running as Shuji does. There are quite a number of characters introduced to facilitate this, and more often than not, you only get to know of their background in a rather slow revelation. The movie takes its time to develop the characters and their backgrounds - so don't be expecting the conventional approach. It's a pity though, that some characters become throwaway ones, even after significant screen time had been dedicated featuring them. Of importance is the character of a priest, Father Yuichi (Etsushi Toyokawa), which had a rather rich background story developed and set up as the \"Boo Radley\" of the movie. Given the screen time devoted, I was rather puzzled when it turned out that he too became a disappearing act in the middle portion, before returning for a bit part in the finale. Like most of the other movies shown during the festival, this one also had a segment of its setting in a classroom, and has its fair share of featuring children in lead roles, albeit up to the one-third mark where the more adult actors took over. And lead actor Yuga Tegoshi did an excellent job in his Shuji - a confused boy, utterly moulded by the environment around him, his loneliness stemmed from a disappearing family, and his quest to seek companionship bringing him to Osaka and Tokyo. What finally redeemed the movie was its last third, where it got its act back together, and realized its direction towards its final push to end the movie. It's a full circle tale after all, with a message never to judge a book by its cover, or to judge a character based on hearsay. And what finally hit you, assisting you in sitting through the convoluted storyline, is the excellent piano musical score done by SENS. p.s. at one point in time the projection seemed to have tilted downwards, cutting off the bottom half where the subtitles are. Thankfully there was just one (inconsequential) line of dialogue uttered, and was fixed before anything major happened in the story. p.p.s. I thought at one point it had a scene somewhat similar to Sepet, with the handphone bit!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "IMJ Entertainment",
         "J Storm",
         "Stardust Pictures (SDP)"
      ],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 1000000
   },
   "movielensId": 160004,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2005-12-17",
      "dvdReleaseDate": null,
      "directors": ["SABU"],
      "runtime": 124,
      "movieId": 160004,
      "title": "Dead Run",
      "mpaa": null,
      "actors": [
         "Yuya Tegoshi",
         "Hanae Kan",
         "Miki Nakatani",
         "Etsushi Toyokawa",
         "Ryo Kase",
         "Ren Osugi",
         "Susumu Terajima",
         "Shun Sugata",
         "Hitomi Takahashi",
         "Tasuku Emoto",
         "Kazuma Suzuki",
         "Shin Yazawa",
         "Sei Hiraizumi",
         "Shifumi Yamaguichi"
      ],
      "imdbMovieId": "0490488",
      "originalTitle": "疾走",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "The story concerns a boy called Shuji, growing up in a rural area of Japan where the community is divided into \"Shore\" and \"Offshore\" - the latter so-named because it is built on reclaimed land. He meets a few main characters, besides his family, that shape his development - gangster Oni-ken (Susumu Terajima) and his hostess girlfriend, an ominous-looking Catholic priest and his congregation-of-one, the troubled and rebellious teenage girl Eri - who also becomes Shuji's classmate and the object of his adolescent affections. Life in the Shore/Offshore community is not a bundle of joy - the impression is of a community and lifestyle in decay, with the only hope of rejuvenation being a gangster-funded hotel development project that doesn't exactly inspire the locals either. It's an environment that does not fill its young inhabitants with much hope or inspiration.",
      "tmdbMovieId": 105136,
      "avgRating": 2,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/kn6V4bXBfmz1EDi6dvtTG9jDBLg.jpg"
   }
}