{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0382114",
      "video": false,
      "title": "Junkers Come Here",
      "recommendations": [
         54803,
         30002,
         13775,
         35992,
         35101,
         58760
      ],
      "backdrop_path": "/miPbTOkQAYSGnDemtTjpuB1ygj8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hiromi Nozawa (voice)",
               "gender": 0,
               "credit_id": "53ff1270c3a368573b0006cc",
               "name": "Mei Oshitani",
               "profile_path": null,
               "id": 1357662,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Junkers (voice)",
               "gender": 0,
               "credit_id": "53ff1297c3a368574f000621",
               "name": "Shinnosuke Furumoto",
               "profile_path": null,
               "id": 1252773,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Atsushi (voice)",
               "gender": 0,
               "credit_id": "53ff12bcc3a3685741000695",
               "name": "Daisuke Sugata",
               "profile_path": null,
               "id": 1357663,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "School Crossing Warden (voice)",
               "gender": 0,
               "credit_id": "53ff12ebc3a3685752000644",
               "name": "Hiroko Takahashi",
               "profile_path": null,
               "id": 1357664,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Passenger (voice)",
               "gender": 2,
               "credit_id": "53ff1312c3a368574b0006a8",
               "name": "Kappei Yamaguchi",
               "profile_path": "/8QpMGuviKgXS9Kx3IbAJeQclQY.jpg",
               "id": 68472,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Keisuke Kimura (voice)",
               "gender": 0,
               "credit_id": "53ff1342c3a368573b0006f0",
               "name": "Katsunari Mineno",
               "profile_path": null,
               "id": 1060576,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Fumie Morita (voice)",
               "gender": 0,
               "credit_id": "53ff1368c3a368573b0006f6",
               "name": "Keiko Nakajima",
               "profile_path": null,
               "id": 1357666,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Kazuko (voice)",
               "gender": 0,
               "credit_id": "53ff1393c3a3685752000654",
               "name": "Mayumi Iizuka",
               "profile_path": "/kCWf5pXYb6SmW59umVkVrZbsd56.jpg",
               "id": 65426,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Suzuko Nozawa (voice)",
               "gender": 0,
               "credit_id": "53ff13e0c3a36857450006c1",
               "name": "Misako Konno",
               "profile_path": null,
               "id": 1250208,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Chie Harada (voice)",
               "gender": 0,
               "credit_id": "53ff143ac3a368574f000648",
               "name": "Momoko Ishi",
               "profile_path": null,
               "id": 1357667,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Shintaro Nozawa (voice)",
               "gender": 2,
               "credit_id": "53ff1468c3a36857410006cc",
               "name": "Naoto Kine",
               "profile_path": null,
               "id": 1148348,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Yoko Inoue (voice)",
               "gender": 0,
               "credit_id": "53ff1496c3a368573b000730",
               "name": "Sakiko Tamagawa",
               "profile_path": null,
               "id": 83937,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Baby (voice)",
               "gender": 0,
               "credit_id": "53ff14e1c3a368574f00065d",
               "name": "Yuki Sato",
               "profile_path": "/xk4mfvYP4HFfvq8BdILiKfAhIdn.jpg",
               "id": 1247733,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Hiroshi (voice)",
               "gender": 0,
               "credit_id": "53ff1500c3a368574b0006d5",
               "name": "Yuta Yamazaki",
               "profile_path": null,
               "id": 110502,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Takashi (voice)",
               "gender": 0,
               "credit_id": "53ff1522c3a36857450006e1",
               "name": "Yuya Tejima",
               "profile_path": null,
               "id": 1357669,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Waiter (voice)",
               "gender": 2,
               "credit_id": "577729c8c3a368478400263c",
               "name": "Mitsuaki Madono",
               "profile_path": "/wtX8NjQ6FAhL2fcZFRmw18FZ9Up.jpg",
               "id": 222386,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Photographer (voice)",
               "gender": 2,
               "credit_id": "577851939251411eb1002482",
               "name": "Toshihiko Nakajima",
               "profile_path": null,
               "id": 126287,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44b7c3a368484e032e85",
               "name": "Junichi Sato",
               "profile_path": null,
               "id": 106577,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53ff26d2c3a36857550007da",
               "name": "Hiroichi Fuse",
               "profile_path": null,
               "id": 1357700,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55344c7c92514125dc0026ab",
               "name": "Shin'ya Ôhira",
               "profile_path": null,
               "id": 1456632,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.756948,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 25079,
      "vote_count": 3,
      "budget": 0,
      "overview": "Hiromi appears on the outside to be a mature, resilient girl, but on the inside she feels like she's falling apart.  She is having troubles at home mainly because of her parents wanting to separate.  Her dog, Junkers, tries to comfort her in ways no other dog can.  You see, he can talk and grant her 3 wishes.",
      "similar": [],
      "original_title": "ユンカース・カム・ヒア",
      "runtime": 103,
      "poster_path": "/osuf7KFsswUVsaTF9IZeqn8LdIb.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Triangle Staff",
            "id": 3530,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bandai Visual",
            "id": 5844,
            "origin_country": ""
         }
      ],
      "release_date": "1995-03-18",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jun'ichi Satô",
         "Rob Bakewell"
      ],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Hiroichi Fuse",
         "Naoto Kine"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0382114/",
      "coverLink": null,
      "actors": [
         "Brittney Wilson",
         "Lisa Ann Beley",
         "Sean Campbell"
      ],
      "reviews": [
         "Just imagine! It took around eight years for this movie to reach America? Why? This isn't an anime genre piece like Perfect Blue or Gundam or Battle Angel that people outside of anime circles would mock or not understand or be disgusted by; this is a wonderful fantasy grounded in a very realistic, contemporary, America-like Japan. With the exceptions of the samurai drama and the parody of a classic shojo-manga theme (falling in love with your teacher or older person--not unheard of in America but not something that routinely appears in children's cartoons), Junkers Come Here could take place in any upper-class American town, or in England, or in France, etc. The title character (though not main character) is a Schnauser named Junkers. Junkers is magical, reminding me a bit of Elliot from Pete's Dragon. He can talk and has the power to grant three wishes. As far as characterization, he's very laid back and easy-going, and he just loves period samurai TV shows (which makes me wonder if he's not some sort of reincarnated samurai himself), especially the over-the-top ones that are reminiscent of Sergio Leone's spaghetti westerns. The focus of the movie is Junkers' owner, Hiromi. She's a smart, well-behaved twelve-year-old who tends to take care of herself, since most times her parents are away on business, leaving her in the care of the daytime cook and a live-in college student who pays the rent by tutoring Hiromi. Of course, she falls in love with him, and that is probably the most cliched part of the story (though a dream she has of Junkers officiating her marriage to him is about as funny as can be). However, over the course of the movie, as it becomes clear that Hiromi's parents are heading for divorce, cracks in her projected self-reliance begin to appear. I don't want to spoil much more than that. Just know that her wishes are neither spectacles like Aladdin nor twisted (much) to make her miserable, like in \"The Monkey's Paw.\" While the ending is predictably happy (but just fanciful enough to make it self-evident that this is still a fantasy and couldn't happen in real life), there is an intensity of emotion (in both the Japanese and the English versions) that puts it on a level high above the likes of \"Irreconcilable Differences.\" The animation, though slightly \"limited\" like most anime, is not so distracting as even some newer anime (some of the crowd scenes in Perfect Blue come to mind, not to mention the Pokemon and Digimon movies). In fact, it has a beauty similar to the works of Studio Ghibli (most notably, Whispers of the Heart and I Can Hear the Ocean). Which is exactly why it is so universal, and why it is so surprising that the movie took so long, in this anime-obsessed nation, for it reach America. It is a wonderful film, even for those who normally dislike anime.",
         "I first saw (most) of this movie whilst enduring a rainy night in a lonely hotel in Shimoda (Japan). It was running on the local TV and whilst I couldn't understand any dialogue (no English) I very much enjoyed the interesting animation and what story I could work out. Since then I've obtained a Region-1 DVD and seen it with subtitles: it still entertains. As with a lot of Japanese output (Studio Ghibli in particular) the story is rooted in characterisation. I cared about the people in this movie and they seemed well fleshed out, they were never just a prop to hang events on. Basically: if you like Miyazaki then you'll probably like this.",
         "After having turned into a Ghibli addict a few years ago, I have been a difficult person to impress. I am greatly impressed. Junkers Come Here is a jewel of a story that took me for the emotional ride of the year. The central character in the story is eleven-year-old Hiromi Nozawa. Her parents are successful professionals who love their daughter, but have little time for her--or for each other. They had been drifting apart over the previous few years and were on the verge of divorce. She has a pet Schnauser, Junkers (pronounced Yoonkers), who has the ability to speak and, as we learn, the ability to grant three wishes. Rounding out the central list of characters is the family's maid, Fumie, and a level-headed college student, Keisuke, who tutors Hiromi in return for room and board. Hiromi desperately wants to maintain a normal family, but had long since given up the idea that she and her parents would do something together. When her mother casually hints that she and her husband might get a divorce, she is devastated. She doesn't want to show it, though, as she didn't want to be the source of unhappiness. Junkers, who speaks only with Hiromi, offers to grant three wishes. Are Junkers gifts all part of Hiromi's imagination? Are they real? Get the DVD and find out. I give this a ten out of ten rating.",
         "Hiromi is a young 6th grade girl who has parents who are devoted to their work and plan on getting a divorce. She doesn't know how to cope with the fact that she might be losing her parents and she seeks help from her dog Junkers. A well made anime dealing with real life issues that many kids must face, may be a bit to serious for some kids, but the talking dog should keep their attention. The acting in the English dubbed version was surprisingly good. Hiromi and Junkers are two very cute innocent characters that are fun to watch. It is a film that the whole family will enjoy, so feel free to pull up a chair and watch with your kids. You won't be disappointed. ** out of ****",
         "I recently went and stumbled upon this movie at a used DVD and CD store and had to buy it. At first, I thought the movie was just about a dog. Then as ,i started to watch the movie ,i noticed it was about the relationship between a dog and his best friend and master Hiromi, whom is always alone. The whole time you see this character grow and grow and get sentimentally attached to her. I felt her loneliness the whole time. You can see she seems always happy and puts on a smile, but that only hides her true feelings. Because her parents aren't always around Junkers becomes her best friend, and the one and only friend she can share her feelings with. As time goes on she starts to grow and things get tougher with her parents bringing up the subject of divorce. After this one realizes there is more to Junkers then you think. This movie is good and the end made me cry. I highly recommend this movie it was a great family movie. This movie would also be good to show children that have a tough time with divorce. To show kids what to do and not to do and how to properly cope with divorce.",
         "This is quite a nice anime movie. On the surface, the anime tried to sell its story with the attraction of a unique talking dog. However in its core essence, it was a movie about family problems and a little girl who just wanted the best for her family. There were some comical moments and the sad moments were not overly sentimental. However, what prevented me from rating this movie a 7 star or above, was due to the fact that the final moment was a bit of a letdown in my opinion. It was like the creators were rushing for deadlines and came up with a convenient solution to the ending. If this movie was remade with a better ending, magical or not, it could have the potential to be on par with the best anime movies of all time.",
         "I would absolutely love to have a dog like Junkers because seriously, when I feel lonely or if I'm having a bad day, he would always be there for me. Plus a bonus of three wishes wouldn't be a bad idea too y'know! I liked how this film didn't make Hiromi into a whiny snobby 12 year old. They honestly did make her mature for her age and thats even better then the well-known anime film \"My Neighbor Totoro\" because seriously, it wasn't as mature as this film truly is! There was a scene that I nearly cried at. The scene consists of Hiromi telling her parents to stop getting a divorce in the place where the last spent time together as a family. It does break your heart actually, for real, a separation in any family is difficult especially if your parents were together for years! Well at least in the end, Hiromi's parents rekindled thanks to Junkers' magic! I really liked the film, it was different and plus, it was easy to follow! I think it should've won awards like some of Studio Ghilbi's films had done!"
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Bandai Entertainment Inc.",
         "Triangle Staff"
      ],
      "summaries": ["The movie is about a girl named Hiromi Nozawa and her dog Junkers. Hiromi is having troubles at home mainly because her parents wanting to separate. Junkers tries to comfort her in ways no other dog can. He can talk and grant her 3 wishes."],
      "budget": 0
   },
   "movielensId": 160133,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1995-03-18",
      "dvdReleaseDate": null,
      "directors": ["Junichi Sato"],
      "runtime": 103,
      "movieId": 160133,
      "title": "Junkers Come Here",
      "mpaa": "G",
      "actors": [
         "Mei Oshitani",
         "Shinnosuke Furumoto",
         "Daisuke Sugata",
         "Hiroko Takahashi",
         "Kappei Yamaguchi",
         "Katsunari Mineno",
         "Keiko Nakajima",
         "Mayumi Iizuka",
         "Misako Konno",
         "Momoko Ishi",
         "Naoto Kine",
         "Sakiko Tamagawa",
         "Yuki Sato",
         "Yuta Yamazaki",
         "Yuya Tejima",
         "Mitsuaki Madono",
         "Toshihiko Nakajima"
      ],
      "imdbMovieId": "0382114",
      "originalTitle": "ユンカース・カム・ヒア",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["AOohc1Jiw5E"],
      "plotSummary": "Hiromi appears on the outside to be a mature, resilient girl, but on the inside she feels like she's falling apart.  She is having troubles at home mainly because of her parents wanting to separate.  Her dog, Junkers, tries to comfort her in ways no other dog can.  You see, he can talk and grant her 3 wishes.",
      "tmdbMovieId": 25079,
      "avgRating": 2.25,
      "releaseYear": "1995",
      "numRatings": 2,
      "posterPath": "/osuf7KFsswUVsaTF9IZeqn8LdIb.jpg"
   }
}