{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4247738",
      "video": false,
      "title": "A Field Full of Secrets",
      "recommendations": [],
      "backdrop_path": "/5ujwV0uHQG7WMeiJz0MQHP2K0zU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "55f0cc06c3a36823070001c6",
            "name": "Charles Maxwell",
            "profile_path": null,
            "id": 1507747,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "55f0cbd992514167010001a2",
            "name": "Charles Maxwell",
            "profile_path": null,
            "id": 1507747,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.101426,
      "production_countries": [],
      "id": 302161,
      "vote_count": 1,
      "budget": 0,
      "overview": "Charles Maxwell makes his directorial debut with this documentary about crop-circles and the intelligence behind them.",
      "similar": [],
      "original_title": "A Field Full of Secrets",
      "runtime": 82,
      "poster_path": "/16H6hAzQi3uDK1PPNYMqpnC20Zg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-12-02",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.afieldfullofsecrets.com/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Maxwell"],
      "runtime": 122,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4247738/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQyMTEwMjE0M15BMl5BanBnXkFtZTgwMjE1OTM2MzE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Colin Andrews",
         "Francine Blake",
         "Tim Carson"
      ],
      "reviews": [
         "I saw this on Netflix and was curious, as it gives the same blurb it does here. I'm not an avid crop circle researcher, so you're if you're looking for an expose on crop circles, aliens and everything in between, this isn't for you. The film begins with some interesting facts on the crop circle phenomena, especially in regards to hoaxers. There are definite hoaxers, but there are also things they showed that cannot be hoaxed nor explained. As the story went on what really drew me in was the human interest part of it. The director, Charles Maxwell, was as much a part of this story as he was the one creating it. I really admired his courage to go all in and see just where this was all leading. He became friends with a transsexual, and despite judgment and criticism from his friends, began to build with this woman what might be the secret the crop circles were trying to share. I was really rooting for Charles and Nikola and extremely curious what would happen when their invention was built. Mixed in with this are stories on Nikola and how those closest to her feel about her transition. I won't tell you what happens in the end. I will only say that Charles is what I would call a dreamer, and it's the dreamers who bring about the most important and revolutionary changes in this world. They also tend to face the roughest path as those who don't believe in their vision want to hold them back. What if what Charles and Nikola built really is a glimpse of future technology? What if it really is something that historians will look back on and say, \"Thank God they tried that.\" We'll never know. All I do know is, the world needs more people like Charles and Nikola. People who will put what society says is rationale aside, knowing full well they could fail, to take a chance on something that expands all of our minds. Charles and Nicola, I salute you. You're two people who won't have to die with regret and the wonder, \"What if I'd not cared what people would say and just went for it? What if I'd tried? What if....\" All in all, a movie I would recommend to anyone. Some will like the crop circle stuff, others will like the personal aspects. And some might even get inspired like me.",
         "I like a film that makes you think... though its hard to know just what to think of this film and its subject matter, its power is in not letting you make up your mind too easily. Before I say what I think of its subject, I'll say its an entertaining film that most people would enjoy, even if they decide that the protagonists are simply nutters (as one of Charles' friends suggests). No doubt they put genuine and considerable effort in trying to turn a theory into a reality, and its inspiring to watch this. Their efforts are compared with those of the Wright brothers and with Edison in taking a leap of faith to venture into new fields of science and technology, despite the high risk of failure and the scepticism of others. They are inspired by the designs that appear in crop fields, so the title alludes both to these mysterious phenomena, and the attempt to open up new fields in science. All inventions are inspired by thinking outside the box, they require leaps of faith, and their success is often due to a mixture of persistence and fortuitous accident. The potential of many discoveries and inventions is not realised until much later. Charles and Nikola attempt something so inspired, daring and original, so far beyond our existing technology, that their results should be interpreted in that light. If you gave the ancient Romans a blueprint for creating a helicopter, do you think they could build a working model? I hope this review inspires you to watch this film, its the best I've seen for a while, and it may just make you wonder as well...",
         "Great effort trying to show what might be behind the circles that appear on the fields near a small pyramid at the south of England. Thanks to this documentary I could come up with the answer. It's my perception. The circles are done by the planet itself, by mother earth herself and she is showing that the gadget we have to create, cultivate and take care of is ourselves. You can see the figure of a human being in the figures appearing on the fields. The energy they are talking about is in this precious machine already built called human being. The answer is in ourselves not outside. A human being is rounded, when sitting down in meditation position, he becomes a pyramid with six circles showing eternity, no limitations, no laws. Thank you for this documentary and for showing that the most important was the people involved in it and the transformation Nikola had is important to the extent the others respected and accepted that transformation. It is time to cultivate ourselves to get to extend ourselves to maturity.",
         "Here on IMDb this movie has a 6.1 rating out of 44 users. On Netflix, it has less than 3 stars. This film deserves much more, and you must know that going into it, because crop circles have never held particular fascination to me, but the subject matter is the foundation for a movie that shifts and grows throughout into so much more. It is multi- dimensional, and the people appearing in it are treated with a positive and light-hearted touch that goes beyond your personal beliefs about aliens and crop circles. It's funny at times, and while they do poke fun at some of the people in the film, they do it to themselves as well. It's not meant to change your specific views regarding the extraterrestrial, but to encourage you to see what great potential can come from the work and care you put into whatever drives you, regardless of what others believe is possible.",
         "I don't know why I watched this because I hate documentaries, especially from paranormal (try to find a way to put what they are...) basically paranormal researchers seem to like to make money off other peoples trauma/ experiences, and give little back to the community they take from, but fanaticism, conspiracy theories far far away, and the death cull of self made white coat pig disinformation agents without pay...like Psychiatrists. This movie says so much about the world we live in and the state of education, when genius comes off as insanity. Basically being yourself, being an individual not caring what people think, true punk rock anarchist\"AMERICAT\"values, are seen as queer, the original meaning, meaning strange, having unjustly connotation of not being right. There was probably one lone Nicola in Nazi Germany looking at all the German's just doing it to the end of their world, popping till they can't stop into seizers with lust for ADEL, buying all his albums, trying all his words on for size singing them to themselves in the shower, I'm a Nazi, I'm a Nazi, hallalulaaahhhhh. Then the Nazi gets out of the shower and wipes the scum covered mirror across, and he screams, because he's not a Nazi he's an American? Which is the worst kind of Nazi cause there the religious type. Sitting at the bottom feeding off the glower of a culture machined Apis, knee out with nothing, but ready to come to the aid of ADEL. \"How could you say that about ADEL, Adelpho is more beautiful and talented then you'll ever be and he does so much up on that stage for humanity with his beautiful voice....mamamammmmm DUH....DUH...DUHHHHhhhh eerrrrrrrrrrrrrr....(REAL AMERICATS SWARM IN ON PLANES) Bombs explode, One lone man spots a weeping beautiful soul in the street who doesn't blend in with the rest of the human bland wall paper strewn of dead souls. A glow, a luster, saving her is the most important thing, for saving her we preserve what she has... \"Nicola\" I'm on my way to save yo.....\" (boom) a grenade goes off and the hero is thrown to the floor among incoming enemy fire. He closes his eyes hoping for a quick shot to end him. Then he feels the arms of an angel around him. \"What is happening am I in...\" \"Are you ok?\", Nicola asks, \"You know why I was sitting there...I had a dream that you were dying, that a good person was...and I came here to save you...I thought I wouldn't find you and I started to weep and their you were like an explosion going off in front of me.\" You will find down every avenue, a lull, a congregation eventual leading to one place...It says a lot about our country that the message is loud and clear and nobody wants to hear it, they want to fight, fight against the people who have come to set them free from the identity programming brain damage done by religious Nazi sobs...",
         "SPOILERS -- Some beautiful scenes of England at the opening credits... sunrises, countryside, and Stonehenge. Ostensibly the story begins by talking about those durn crop circles, which have dubious origins and explanations, but a title card says \"This story is about what happened next.\" Director Charles Maxwell narrates and talks about researching the early occurrences. They also spend a couple minutes talking about the connection to the circular earth pyramid at Silbury Hill. Apparently, www.English-heritage.org.UK/visit/places/silbury-hill/ was an ancient chalk formation, perhaps a religious symbol or energy source, way back in England's history, similar to Stonehenge. About an hour in, the path switches to building an actual 3D object from the one dimensional lines in the farm field, which looks like a space craft, or UFO, which they call sweet potato. Nikola Romanski used CAD software to draw it out, and then machinery to build parts for the \"object\". This is where it gets interesting. The film was on a very low simmer until this point. Assembly, curing, and much discussion of deadlines. There is good news, and bad news at the conclusion, sort of a mixed result. Running out of time and money, the last stop is in Hawaii, where another guy has been inspired to try to create objects from the crop circles, if he can raise the funds. I'm guessing that when he does raise the money, Maxwell will be there to film it. The first hour could have been edited to a more interesting 30 minutes, but it kind of gets going for the second hour.",
         "Yes what they were building is an attractor/repulser engine! That is how saucers move, by attracting or repelling gravity. Thats why the opposite rotating core plates with the magnets to create a magnetic attraction or repulsion! Just like when you put the north and north pole of the second magnet together they repel or the north and south pole of a secondary magnet together they attract. Gravity fields work in the same manner; they are magnetic and found throughout the entire universe . That's why a black hole sucks everything in and can be used to transport in milliseconds to any part of the galaxy! Simple mathematics and physics. The government has known about this for years. That's why they're funding suddenly stopped. Because of the information in this review; the government may stop it from being posted!",
         "This is one of the greatest mockumentaries I've ever watched. When you watch the film, you can easily understand that Charles Maxwell built a story on people's most extreme beliefs. It's enough just to look deeply in the dialogues and characters to see this movie is a mock. The inventor, the hoaxer, the producer... They all make fun of people who see this movie as a real documentary. Let me give you an example. The inventor of the machine is a real freak (by \"freak\" I mean it is a fictional fun character) and he just invents a device from the crop circles. There is no scientific source for the device they are talking about. It's just a simple mock. This is a speech from the producer of the film: \"I mean, it was a matter of life and death. They were convinced, you know, that they could be killed for trying to create this free- energy device, right? That big oil was somehow gonna send commandoes, you know, um, through the windows with machine guns and...\" I guess they all tell us the story about this movie. Great mockumentary!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["In 2008, two best friends stepped into their very first crop circle in southern England. This is story of what happened next."],
      "budget": 0
   },
   "movielensId": 160642,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-12-02",
      "dvdReleaseDate": null,
      "directors": ["Charles Maxwell"],
      "runtime": 82,
      "movieId": 160642,
      "title": "A Field Full of Secrets",
      "mpaa": "",
      "actors": ["Charles Maxwell"],
      "imdbMovieId": "4247738",
      "originalTitle": "A Field Full of Secrets",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Charles Maxwell makes his directorial debut with this documentary about crop-circles and the intelligence behind them.",
      "tmdbMovieId": 302161,
      "avgRating": 2.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": "/16H6hAzQi3uDK1PPNYMqpnC20Zg.jpg"
   }
}