{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0077868",
      "video": false,
      "title": "The Avenging Eagle",
      "recommendations": [],
      "backdrop_path": "/khm6IN6VWo53aD1aZeZmGlAqtC7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Black Eagle Chik Ming-sing",
               "gender": 2,
               "credit_id": "52fe48c69251416c91097f3d",
               "name": "Ti Lung",
               "profile_path": "/1daG4DpWRRvpssf5gimrFoTPFk4.jpg",
               "id": 69636,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Double Sword Sleeve Cheuk Yi-fan",
               "gender": 2,
               "credit_id": "52fe48c69251416c91097f41",
               "name": "Alexander Fu Sheng",
               "profile_path": "/fF023avHzOJHBVdDb77n1PSqXXv.jpg",
               "id": 244430,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Yoh Xi-hung",
               "gender": 2,
               "credit_id": "52fe48c69251416c91097f45",
               "name": "Ku Feng",
               "profile_path": "/zSJwvWED9pT54YUBrQhL31UzeaC.jpg",
               "id": 229302,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Vulture Eagle Yien Lin",
               "gender": 2,
               "credit_id": "52fe48c69251416c91097f69",
               "name": "Johnny Wang Lung-Wei",
               "profile_path": "/ktExluorH4yrX01bMWUYdkZRru1.jpg",
               "id": 240174,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Blue Eagle Wan Da",
               "gender": 2,
               "credit_id": "52fe48c69251416c91097f49",
               "name": "Eddy Ko",
               "profile_path": "/gezpiGi74FTOFns3JcgyvMH2owR.jpg",
               "id": 612216,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Owl Eagle Cao Gao Shing",
               "gender": 0,
               "credit_id": "54c9cd1a925141561e005cf1",
               "name": "Austin Wai",
               "profile_path": "/rwvRaOqgk7wDCw7jTbsOnfEleYp.jpg",
               "id": 1173203,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Eagle",
               "gender": 0,
               "credit_id": "54c9cd37c3a368092400533a",
               "name": "Bruce Tong Yim-Chaan",
               "profile_path": "/mQ5lxzXW4mmhsqmCDxvVq2chJ2f.jpg",
               "id": 1163371,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Eagle",
               "gender": 0,
               "credit_id": "52fe48c69251416c91097f55",
               "name": "Lam Fai-Wong",
               "profile_path": "/8x13SPg0DkUUcvAjTEwcTxW63aJ.jpg",
               "id": 930251,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Eagle",
               "gender": 0,
               "credit_id": "52fe48c69251416c91097f59",
               "name": "Dick Wei",
               "profile_path": "/sOhPtfy5nrDlxklZpJ374o3T2KV.jpg",
               "id": 62424,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Soaring Eagle Wang Tao Sang",
               "gender": 0,
               "credit_id": "54c9cd61c3a36874b700a70e",
               "name": "Peter Chan Lung",
               "profile_path": "/w7SgLmFYgyQAJrAve16gqM4Wo1p.jpg",
               "id": 1173757,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Eagle Yau Koon-hung",
               "gender": 0,
               "credit_id": "52fe48c69251416c91097f65",
               "name": "Yuen Bun",
               "profile_path": "/eDDUUKvFxXc1sEIZWLofdB53PJh.jpg",
               "id": 119461,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Eagle",
               "gender": 0,
               "credit_id": "5889fa2592514156a6005a8d",
               "name": "Huang Pei-Chih",
               "profile_path": "/rK9g5AYcQGlZUZnbqYq58f1XUFi.jpg",
               "id": 1743596,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Eagle Lin Gin Ming",
               "gender": 0,
               "credit_id": "5889fa3cc3a3681810005c4f",
               "name": "Jamie Luk Kim-Ming",
               "profile_path": "/issyq7o6xLI0XeF5COauEToPyRs.jpg",
               "id": 1134732,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Eagle Fan Lun",
               "gender": 0,
               "credit_id": "5889fa4d92514156a6005aae",
               "name": "Cheung Kwok-Wah",
               "profile_path": null,
               "id": 1618925,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Siu Fung",
               "gender": 1,
               "credit_id": "5889fa58c3a368191e005d37",
               "name": "Shih Szu",
               "profile_path": "/6py6zWWKZUdYn6dsMODhRd2MJkZ.jpg",
               "id": 1073193,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Devil's Plight Wang An/Jiang Shun Kwai",
               "gender": 0,
               "credit_id": "5889fa8a92514157570057ec",
               "name": "Yue Wing",
               "profile_path": null,
               "id": 1517828,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Golden Spear Tao De Biu",
               "gender": 0,
               "credit_id": "5889fa979251415397005d2b",
               "name": "Tong Kai",
               "profile_path": "/2Lx9Sc5FRr020zCjqIfbifmCqD7.jpg",
               "id": 1743496,
               "order": 17
            },
            {
               "cast_id": 29,
               "character": "Se Ma Sun",
               "gender": 2,
               "credit_id": "5889faa492514156a6005af5",
               "name": "Yeung Chi-Hing",
               "profile_path": "/sDI8YsvMACm40KpJSfJdGlNMugp.jpg",
               "id": 1133986,
               "order": 18
            },
            {
               "cast_id": 30,
               "character": "Se Ma Sun's wife",
               "gender": 1,
               "credit_id": "5889fab2c3a3681810005cb8",
               "name": "Ou-Yang Sha-Fei",
               "profile_path": "/6pC66FBZmscDlnUX86OEGTkY34F.jpg",
               "id": 1134748,
               "order": 19
            },
            {
               "cast_id": 31,
               "character": "Se Ma Sun's second daughter",
               "gender": 0,
               "credit_id": "5889fabec3a36859e9020233",
               "name": "Yau Chui-Ling",
               "profile_path": null,
               "id": 1134752,
               "order": 20
            },
            {
               "cast_id": 32,
               "character": "Se Ma Yu Chin",
               "gender": 0,
               "credit_id": "5889facc9251411ac6019a2e",
               "name": "Jenny Tseng",
               "profile_path": "/AtgRuWpbmz16943qjpp7Mpq3LCg.jpg",
               "id": 1091254,
               "order": 21
            },
            {
               "cast_id": 33,
               "character": "Innkeeper",
               "gender": 2,
               "credit_id": "5889fad892514156a6005b24",
               "name": "Gam Tin-Chue",
               "profile_path": "/v9zMKXExLwZsLux84HwxydRHxYD.jpg",
               "id": 1583011,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48c79251416c91097f6f",
               "name": "Sun Chung",
               "profile_path": "/c8yobExM1HF1XpECbq9DDhsb0yh.jpg",
               "id": 240167,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c79251416c91097f75",
               "name": "Run Run Shaw",
               "profile_path": "/e3azWtlmEQrQtJ5HxbRte935aFq.jpg",
               "id": 21918,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c79251416c91097f7b",
               "name": "Ni Kuang",
               "profile_path": "/41TVqxyNekPr2HQR4IhUuIXhPzZ.jpg",
               "id": 70675,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "55d31ed4c3a368464c000fa5",
               "name": "Mona Fong",
               "profile_path": "/3hpmsYjWWNChzjGzu2hu5epb6Ai.jpg",
               "id": 70676,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55d5f62092514102c6004962",
               "name": "Chiang Hsing-Lung",
               "profile_path": "/4rJVpsyq1UA2JoMQDdvGSbvzxMh.jpg",
               "id": 43913,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 0.613337,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 83876,
      "vote_count": 5,
      "budget": 0,
      "overview": "Eagle Chief Yoh Xi-hung raises orphans to be his personal killers. One such is Chik Ming-sing who now wants to put his killer life behind him. When the Eagle Clan come after him, a stranger called Cheuk comes to his assistance It turns out that Cheuk is the son of a family who were robbed and murdered by the Eagles. Now they will team up to destroy the evil clan.",
      "similar": [],
      "original_title": "Long xie shi san ying",
      "runtime": 90,
      "poster_path": "/6eZ7n8pyBu9dDw0cIXkbn090qON.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": "/nPGLMS26OKdu6T7RYakXGYVXFzK.png",
         "name": "Shaw Brothers",
         "id": 5798,
         "origin_country": ""
      }],
      "release_date": "1978-09-13",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chung Sun"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Hung Chin",
         "Kuang Ni"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0077868/",
      "coverLink": null,
      "actors": [
         "Sheng Fu",
         "Lung Ti",
         "Feng Ku"
      ],
      "reviews": [
         "Avenging Eagle is the story of a man Chi Ming-sing (Ti Lung) who after years of killing for a brutal gang decides to leave and seek revenge against them and their leader. The gang, know as the Iron Boat Clan and in particular the men he raided with the 13 Eagles. All were raised from birth by Yoh Xi-hung (Ku Feng) to be brutal killers to obey his every command. Each with his own hand made eagle medallion and weapon. Now the 12 reaming eagles are sent out to find Chi Ming-sing and either kill him or to bring him back. Chi Ming-Sing soon runs into a wanderer Cheuk Yi-fan (Fu Sheng) who does not reveal himself at first, but decides to crusade against the clan together. As they head towards the clans base they are attacked in waves by the Eagles and defeat them one by one. As the movie goes on Chi Min sing tells his story of how he saw the light after being forced to kill a pregnant woman and betrayed the clan. In the final battle of the movie with Yoh Xi-hung, it's revealed that his companion is actually his worst enemy, the husband of the woman he killed and the man he swore to die by. In one of the great battles of Kung Fu cinema they combine forces to defeat there common foe. Chi Ming sing then forces Cheuk Yi-fan to kill him allowing his wife's spirit to rest in peace. Avenging Eagle is easily one of the greatest films the Shaw Brothers ever created. The story is great, played out with a solid cast of familiar A list Kung Fu actors from the Shaw's studio at the time. As with most Shaw Brothers films the action is non stop and choreographed well. Fans of the violent fights often seen in Shaw Brothers Kung Fu films will not be disappointed in the level of action and brutal fights in this film. The costumes worn by the actors were very unique. The \"Eagles\" each have a unique outfit with a primary color and medallion that matches their outfit. Also each member of the gang is usually equipped with a different or unique weapon. Ti Lung uses the 3 section staff and Fu Sheng uses a pair of hidden knives for what he would become know by, \"the double blade.\" Among other interesting weapons would be Yien Lin's (Johnny Wang Lung-wei) brass ring and of course Yoh Xi-hung' iron claw gloves. Overall this is a masterpiece from the great Shaw Brothers. Compared to non Kung Fu films I'm sure most would find it stupid. But to fans of the Shaw's and Kung Fu films this is one of the great ones and not just your average Kung Fu flick. This isn't just action and killing but great story as well. Without a doubt this gets a big ten out of ten stars. Truly a classic.",
         "AVENGING EAGLE (1978) stars Fu Sheng and Ti Lung as a pair of kung fu fighters on opposite sides who form an alliance to defeat a common enemy. It's a rousing kung fu film with strong production values, a top-ranked cast, expert fighting, and an engaging storyline. Shot partly on location in Taiwan and partly on lavish studio sets, it's an extremely good-looking film that was not available in the U.S. in a decent copy until 2005. (NOTE: see addendum below) Ti Lung stars as a killer who has deserted his outlaw gang, the Iron Boat Clan, after being forced to slay a pregnant woman during a raid. He and his particular band were called the 13 Eagles and, once he leaves, the other 12 go searching for him. Fu Sheng plays a wanderer who pitches in to help Ti on the road. The other Eagles (all distinguished by large customized eagle medallions worn on their chests) come in successive waves until Ti decides to turn around and go after the clan leader (Ku Feng), who had raised him from childhood. Fu Sheng's identity is a mystery for the first two thirds of the film, and its revelation is a genuine surprise which adds an additional emotional layer to the film. There are a number of excellent scenes, including a lengthy jaw-dropping final battle at the Clan's spacious headquarters, but one deserves singling out. Ti and Fu take over an inn in a nearly-deserted town and wait for the next group of killers to arrive. When they do, Fu poses as a typically obsequious waiter and serves them but, when asked about Ti's whereabouts, he insists that the man they're looking for is working in his kitchen. They don't believe him at first, but it's all a successful ploy to split up the gang to work them over one at a time, until the two heroes each square off against an opponent---Ti fighting Eddy Ko and Fu Sheng fighting his frequent co-star/opponent, Wang Lung-Wei. Ti fights with a three-section staff, while Fu uses blades hidden in his shoe soles that are then strapped to the sides of his hands. Ti and Fu work wonderfully together and give performances that are among the finest of their distinguished careers. The slow build-up of their friendship leading to their alliance to take on the leader of the clan and the twists and turns that develop when Ti learns Fu's true identity are all handled expertly by these two excellent actors. It helps that the English dubbing is well above average. This film marks the first of only two times these two stars teamed up as a pair of heroes, the second being DEADLY BREAKING SWORD in 1979, also directed by Sun Chung. (The two stars did work together in ensemble casts on at least three other occasions, including SHAOLIN TEMPLE, 1976). This film is also that rarity among kung fu films: a Shaw Bros. masterpiece that was not directed by either Chang Cheh or Lau Kar Leung. (Fu Sheng's best work, aside from this, was always for Chang or Lau.) Sun Chung made a number of other kung fu films at Shaw Bros. and, away from the studio, made the impressive A FIST FULL OF TALONS, starring Billy Chong. There is a good deal of attention in AVENGING EAGLE to story and character and the number of main characters is kept to a minimum. The flashback structure works quite well in setting up Ti's current flight from the clan and gradually piecing together his history and the incidents which led to his falling out with the gang. The fights may not be the sprawling, epic battles of Chang Cheh films or the technique-oriented bouts in Lau Kar Leung's work, but they are satisfying and exciting nonetheless. ADDENDUM (5/26/08): Since doing the above review, which I've revised in parts, AVENGING EAGLE has come out in a remastered Region 3 DVD edition from Celestial Pictures, in Mandarin with English subtitles, and is well worth acquiring. I've also since seen other films from Shaw Bros. directed by Sun Chung, including KUNG FU INSTRUCTOR, JUDGMENT OF AN ASSASSIN, THE PROUD YOUTH, RENDEZVOUS WITH DEATH and DEADLY BREAKING SWORD.",
         "Sun Chung's AVENGING EAGLE is a martial arts film that transcends the genre; it boasts a superior script and characterization, and achieves a tragic quality of its own. The Shaw Bros. studio churned out a lot of martial arts films in its 25 year heyday. AVENGING EAGLE is one of the most memorable that I have seen. The script takes the viewer back and forth in time, the flashbacks allow the viewer to discover more and more about its two protagonists (played by TI LUNG and Alexander FU SHENG). So interwined are their pasts that it is quickly obvious that they should actually be each other's enemy. But the logic is such that we can also readily accept that they put aside their differences, eliminate as many of the Iron Boat clan sent in pursuit of TI LUNG's character, and finally, take on the evil leader of the clan (KU FENG). I found the dialogue especially good and satisfying, and I am sure that others who have seen the film, can think of at least four or five instances, whether the dialogue demonstrates wonderful irony, quiet sadness, and ensures the two heroes display real qualities of heroism. SUN CHUNG and his crew show a wonderful eye for their locations, the exotic and distinctive costuming and weaponry (of the heroes, and also the thirteen Eagles, and of course, their leader). With the opening shot, it was obvious this film was photographed away from the usual locations. That, the initial meeting of the two leads, their first skirmish with the Iron Boat gang, and much later, the remote inn that they 'rent' for a month to set up an elaborate ambush, and lastly, the lair of the gang, where SUN builds up to and sustains a lengthy climax, demonstrates a lot of imagination. Even the music is effective, despite the mono sound of the Region 3 IVL/Celestial Pictures DVD, and is largely 'original'> This film is so good that I have not even broached the subject of its martial arts. And that alone, I believe, is reason enough that I consider AVENGING EAGLE one of the best martial arts films I have seen. (PS: Consider a quarter century later the Japanese were making films along the same line, ie. AZUMI, which surely lacks the economy of this film, running almost an hour longer). (PSS: I enjoyed the other contributors' comments on AVENGING EAGLE, surely more confirmation, this film deserves repeated viewing). (PSSS: If you enjoyed this film, please take the time to track down and watch KILLER CONSTABLE).",
         "I love this movie more for the truisms it presents regarding the heart of a man as well as for the wonderful kung fu it represents. The main character displays a depth of emotion that is not often seen in this genre managing to convey in word and memory induced vignettes the tragedy of his life, the wrongs he has committed to survive and his sorrow at what he has become. The man he has wronged is also compelling in that instead of exacting quick revenge as we see with other martial arts films he wants to know his families murderer to find out why he killed them. The ultimate protagonist and leader of the Eagles is also good but more in line with other kung fu baddies than as a truly original character. I would recommend this movie because it manages to tell a story of vengeance and human frailty without sacrificing either of them.",
         "This is the one that boosted Sun Chung's directorial fame that was later followed by THE KUNG FU INSTRUCTOR, THE DEADLY BREAKING SWORD, and HUMAN LANTERNS, to name a few. The plot tells the story of a mysterious wandering swordsman (Fu Sheng) on his way to accomplish a personal mission. On his journey, he meets a renegade assassin of the infamous Eagle Clan (Ti Lung) who is being hunted and marked for death by his clan brothers for insubordination. They befriend each other and eventually discover that they are heading for the same fate: to confront the leader of the Eagle Clan, King Eagle (Ku Feng). However, things do not come easy for them. Before they are able to reach him they have to fight their ways against 12 Eagle Clan assassins, each with their unique fighting weapons, who will stop at nothing to capture their fugitive. It's always desirable to watch the charismatic Ti Lung in action and surprisingly also likable to watch the comical Fu Sheng act soberly in this particular entry. Watching them fight against the 12 assassins is the main attraction besides the incredible final fight with King Eagle, who seems invincible. The other 12 eagles, unfortunately, are only given the usual bad-guy stereotypes which give very little to improve the plot. Playing opposite the heroes are some \"familiar faces\" of the time: the ultimate Shaw Bros villain - Wang Lung Wei (as eagle no.1 the Vulture), Kao Siung (as eagle no.2 the Owl), Hui Thien Che (as eagle no.6 the Blue Eagle) and Ti Wei (as eagle no.7 the Red Eagle). The remaining eagles are Shaw Bros cameos. One serious drawback in this film is Sun Chung's crude slow-motion technique he employed in a few fight scenes - jerky freeze frames - which reduces the intensity of the fights that would otherwise deliver more punch. Despite the minor flaw, Tang Chia's fight choreography is tight, though not as intense as that of the Venoms', particularly in the final duel against the King Eagle, who uses iron claws. The assassins' weapons of choice are also unique, ranging from something cool like double wrist blades and a chained dagger to something weird like a smoking pipe ! AVENGING EAGLE is one of those Shaw Brothers wuxia flicks that definitely warrants repeat viewings. Highly recommended for old school kungfu film lovers.",
         "Two strangers—one seeking revenge, the other looking for redemption—join forces to defeat a common enemy, the Iron Boat Clan, a gang of bloodthirsty bandits raised from childhood by the cruel overlord Yoh Xi-hung (Feng Ku). As the two men (brilliantly played by tragic star Alexander Fu Sheng and martial arts legend Ti Lung) fight side by side, they form an unlikely friendship, but when they finally face their ultimate foe, the despicable Yoh Xi Hung, the tragedy that connects them threatens to divide them. An epic tale of love, revenge, absolution, camaraderie, and intertwined destinies, The Avenging Eagle is classic Shaw Brothers storytelling, told with the utmost skill and style by director Chung Sun, who delivers a visually stunning and throughly engaging masterpiece. Sun also proves to be no slouch when it comes to capturing awesome fight action: featuring an incredible raft of villains, each adept at a different weapon (including spears, rings, axes, swords, and metal claws), this marvellous martial arts spectacular delivers some of the most entertaining fight scenes I've seen in an old-school kung fu movie, with incredible stunts, impressive acrobatics and brutal violence galore, all leading up to a fantastic finale in Yoh Xi Hung's HQ that sees our 'heroes' duking it out with numerous henchmen on their way to the top man, including a duel with a pair of deadly one-armed bandits (the human kind, not the fruit machine variety).",
         "Chi Ming-sing is a former disciple of a gang run by overlord Yoh Xi-hung. Yoh's disciples hunt Chi relentlessly as he travels on a soul-searching journey. He comes to the aid of a seemingly bumbling man who hardly takes even life-threatening scenes seriously. The man Chi saved starts following him on the road, explaining that he's looking for someone who committed a grievous, unforgivable wrong. I am still getting into the Shaw Brothers. I watched this back to back with \"Five Deadly Venoms\", and i have to say that \"Venoms\" is the better film. I just liked the plot and characters better. But \"Avenging Eagle\" has a great use of color, and you have to love the way they make the beards look on these old men. Maybe those are real beards, but I highly doubt it... only in these films do they have that wispy, billowing quality.",
         "Chik Ming Sing (Ti Lung) is about as vicious as a cold-blooded killer can be: raised by the bloodthirsty Hung (Ku Feng), leader of the infamous Iron Boat Clan (whose hideout looks like the inside of a giant ship, with a potbellied eagle overlooking the main room), Chik will kill at the drop of a (sedge) hat. In flashbacks, we learn that he was mortally wounded during one raid, but was found and befriended by the \"Kwai\" family (not the patriarch's real name). For the first time in his life, he has experienced kindness. Once he has recuperated, he leaves and rejoins his wayward companions. Their next raid turns out to be- surprise- the home of the \"Kwai\" family. Chik tries to stop the slaughter, but fails. Chik later kills a pregnant woman, who turns out to be the wife of Cheuk Yi Fan (Alexander Fu Sheng), before being banished from the Iron Boat Clan. Chik encounters Cheuk (way back at the beginning of the movie) without knowing who he is. As things progress, Cheuk learns that Chik intends to die at his hands. Not your typical tale of vengeance, and an outstanding movie overall.",
         "With a plot more resembling a Japanese production than your usual kung fu film and excellent cinematography, Avenging Eagle is a very good lesser-known martial art movie. The main actors do their usual good job and the fight scenes are very well done. The whole film has the feel of a good B grade western. The director, Sun Cheung, has a style apart from the other more well known Shaw directors and he handles the fight scenes with finesse as well as the rest of the movie. HIs movie output is hard to find and guessing from the lack of reviews on IMDb many of his films never made it into the U.S.. I recommend this film for anyone familiar with Liu Chia Liang or Chen Cheh's work. The movie is a change of pace from the baroque and brutal plot lines of Chen Cheh and the elaborate hi-jinx of Liu Chia Liang."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Shaw Brothers"],
      "summaries": ["Chi Ming-sing is a former disciple of a gang run by overlord Yoh Xi-hung. Yoh's disciples hunt Chi relentlessly as he travels on a soul-searching journey. He comes to the aid of a seemingly bumbling man who hardly takes even life-threatening scenes seriously. The man Chi saved starts following him on the road, explaining that he's looking for someone who committed a grievous, unforgivable wrong. As the two travel on the road, it starts to become clear that Chi's companion is more than he seems: he's actually a very skilled martial artist, and his boots contain short blades that he can attach to his sleeves. Chi finally tells his companion his story: he's seeking out a renowned swordsman named Cheuk Yi-fan... not to kill him, but to die at his hand. Chi is haunted of the last job he did with the gang, slaughtering many of Cheuk's family and friends... and Chi himself slew Cheuk's pregnant wife. Chi's companion agrees to help Chi with his mission. But when the two arrive at Yoh's stronghold intent on killing him, Yoh recognizes Chi's companion as none other than Cheuk Yi-fan himself. Will Chi and Cheuk be able to remain together against Yoh's formidable fighting style, or will Yoh succeed at dividing and conquering his foes?"],
      "budget": 0
   },
   "movielensId": 160798,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1978-09-13",
      "dvdReleaseDate": null,
      "directors": ["Sun Chung"],
      "runtime": 90,
      "movieId": 160798,
      "title": "The Avenging Eagle",
      "mpaa": null,
      "actors": [
         "Ti Lung",
         "Alexander Fu Sheng",
         "Ku Feng",
         "Johnny Wang Lung-Wei",
         "Eddy Ko",
         "Austin Wai",
         "Bruce Tong Yim-Chaan",
         "Lam Fai-Wong",
         "Dick Wei",
         "Peter Chan Lung",
         "Yuen Bun",
         "Huang Pei-Chih",
         "Jamie Luk Kim-Ming",
         "Cheung Kwok-Wah",
         "Shih Szu",
         "Yue Wing",
         "Tong Kai",
         "Yeung Chi-Hing",
         "Ou-Yang Sha-Fei",
         "Yau Chui-Ling",
         "Jenny Tseng",
         "Gam Tin-Chue"
      ],
      "imdbMovieId": "0077868",
      "originalTitle": "Long xie shi san ying",
      "genres": [
         "Action",
         "Adventure",
         "Foreign"
      ],
      "youtubeTrailerIds": ["__NFC1JXk3Q"],
      "plotSummary": "Eagle Chief Yoh Xi-hung raises orphans to be his personal killers. One such is Chik Ming-sing who now wants to put his killer life behind him. When the Eagle Clan come after him, a stranger called Cheuk comes to his assistance It turns out that Cheuk is the son of a family who were robbed and murdered by the Eagles. Now they will team up to destroy the evil clan.",
      "tmdbMovieId": 83876,
      "avgRating": 3.75,
      "releaseYear": "1978",
      "numRatings": 2,
      "posterPath": "/6eZ7n8pyBu9dDw0cIXkbn090qON.jpg"
   }
}