{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0050237",
      "video": false,
      "title": "He Who Must Die",
      "recommendations": [],
      "backdrop_path": "/bwS0DB6su3Uir7yhZe72Z8Rjt3L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Priest Fotis",
               "gender": 0,
               "credit_id": "52fe4c07c3a36847f821e1fb",
               "name": "Jean Servais",
               "profile_path": "/u6pWPrF8uUa4WQgZc8ueNTxTBjo.jpg",
               "id": 14242,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lukas",
               "gender": 2,
               "credit_id": "52fe4c07c3a36847f821e1ff",
               "name": "Carl Möhner",
               "profile_path": "/x4vrT7stZqMzQxiW8QAsQVwDWNY.jpg",
               "id": 11937,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Agha",
               "gender": 2,
               "credit_id": "52fe4c07c3a36847f821e203",
               "name": "Grégoire Aslan",
               "profile_path": "/1KymTHXP2weyuSYNJeXzrNmGCPM.jpg",
               "id": 53819,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Patriarcheas",
               "gender": 2,
               "credit_id": "548cc75cc3a36820b5002d02",
               "name": "Gert Fröbe",
               "profile_path": "/eMXyEZXTWAcfUXPACYfG0pka0Id.jpg",
               "id": 9908,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Katerina",
               "gender": 1,
               "credit_id": "548cc76e92514122f200279b",
               "name": "Melina Mercouri",
               "profile_path": "/sEeosxLV6WhPm9J26P0R5BKC4ls.jpg",
               "id": 29902,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Manolios",
               "gender": 0,
               "credit_id": "55f63fa492514175f800233f",
               "name": "Pierre Vaneck",
               "profile_path": "/1VYytOUrkCybWzL0qliGTXqNfNp.jpg",
               "id": 4289,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Michelis",
               "gender": 2,
               "credit_id": "55f63fdcc3a3686cfd008199",
               "name": "Maurice Ronet",
               "profile_path": "/89AUkh5mjmWPDQYaWNLZdsa4cV5.jpg",
               "id": 15395,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Panagiotaros",
               "gender": 2,
               "credit_id": "55f6401a9251413ed9001952",
               "name": "Roger Hanin",
               "profile_path": "/q23lgIX7Phj8qDTsm01BCXv21rB.jpg",
               "id": 3836,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4c07c3a36847f821e1f7",
            "name": "Jules Dassin",
            "profile_path": "/v7DZOtLE1i6S7UjLNjkHq85JPEu.jpg",
            "id": 14227,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.350368,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 119637,
      "vote_count": 5,
      "budget": 0,
      "overview": "Greece, in the 1920's, is occupied by the Turks. The country is in turmoil with entire villages uprooted. The site of the movie is a Greek village that conducts a passion play each year. The leading citizens of the town, under the auspices of the Patriarch, choose those that will play the parts in the Passion. A stuttering shepherd is chosen to play Jesus. The town butcher (who wanted to be Jesus) is chosen as Judas. The town prostitute is chosen as Mary Magdalene. The rest of the disciples are also chosen. As the movie unfolds, the Passion Play becomes a reality. A group of villagers, uprooted by the war and impoverished, arrive at the village led by their priest. The wealthier citizens of the town want nothing with these people and manipulate a massacre. In the context of the 1920's each of the characters plays out their biblical role in actuality.",
      "similar": [],
      "original_title": "Celui qui doit mourir",
      "runtime": 122,
      "poster_path": "/q3FHwbfjfY90trv9ZQId6LPuJNM.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1957-05-03",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jules Dassin"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Ben Barzman",
         "Jules Dassin"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0050237/",
      "coverLink": null,
      "actors": [
         "Jean Servais",
         "Carl Möhner",
         "Grégoire Aslan"
      ],
      "reviews": [
         "\"Celui qui doit mourir\" (He who must die) is one of many fine films directed by Jules Dassin, who was born in 1911. At the advanced age of 93, Dassin would merit a special live tribute since he had to suffer blacklisting and was still able to direct in exile such masterpieces as \"Rififi\", \"Never on Sunday\", \"Topkapi\" and \"He who must die\". This last movie takes place in a village in Greece, occupied by the Turks, showing the different attitudes adopted by the people face to the occupant. There is a big contrast between two priests: the rigid Grigoris (interpreted by Fernand Ledoux) and the compassionate Photis (Jean Sevais, also in \"Rififi\"). This was also Melina Mercouri's first collaboration with her future husband, playing a proud but very human prostitute. Among the actors, mostly French, one can not avoid mentioning the late Maurice Ronet, René Lefèvre, Roger Hanin and Pierre Vaneck, whose Manolios is probably the most important character. Also Gert Fröbe, Carl Möhner and Gregoire Aslan have astounding performances. This movie probably a bit forgotten merits a release in DVD since I do not believe it is available at present in this format. It deserves the maximum qualification (10) and let us be hopeful that Dassin who was born in the US but had to emigrate to Europe will receive a recognition for such a brilliant career.",
         "I saw this movie in about 1959 and it is seared into my mind. It is the most ordinary, but miraculous story of a parallel of Christ's life. I have searched diligently for a copy of the film, either in Digital Video Disk or VHS format. I might even be able to afford a copy of the film, although I have no idea what a print would cost. It depicts a Greek village's reenactment of the passion play, done each year in the community. The man who is selected to play the part of Christ (as well as the other players) is encouraged to behave as much like Christ as he can imagine. the net result is that he must die because of the nature of the humans (including the organized religion in the community). I mean, this is the most moving, thought provoking story I've EVER seen on film. Any help by others in finding a copy would be greatly appreciated.",
         "I saw HE WHO MUST DIE in Edinburgh, Scotland (1957). No film relating to Jesus Christ, before or since, has had such an emotional/spiritual impact on me. Its imaginative plot (preparations made in a small Greek village for a Passion Play during the Turkish occupation of Greece) has some affinity to biblical events leading to Jesus' crucifixion. Powerful in presentation, it never gets excessively sentimental or superficial as do typical \"Hollywood\" religious productions, nor as sadistically brutal as Gibson's THE PASSION OF THE CHRIST. I've not seen a film about Jesus, or related to Jesus, that I like, not one ... except HE WHO MUST DIE. Brilliantly conceived and executed, it is one of the finest films ever made! I wish I could find it on VHS.",
         "When I saw this movie as a teenager, I felt I had experienced an ultimate moment in movie-going. How such a story could be so convincingly and moving portrayed has remained a talisman throughout my life. Still, at age 60, I regard this film as among the two or three finest films of all time.",
         "The same writer wrote \"last temptation of Christ\" where the Savior and Mary Magdelene played prominent parts too. Dassin was driven from his country in the wake of the witch hunt.He came to France where he made an estimable film noir \" Du Rififi Chez les Hommes \"(which does not cut his best American works such as \" night and the city\" or \"brute force\" )\"Celui qui doit mourir is his second film in seven year ,and although it took place in Greece ,it was essentially made with French money and French actors (Pierre Vaneck,Fernand Ledoux,Maurice Ronet,Roger Hanin,Jean Servais are all first-class thespians),the only important Greek artist being Melina Mercouri (it was the first time Dassin had directed her and he was to marry her afterward). Unfairly despised in France,\" he who must die\" is probably Dassin's best European work.In a Greek village ,under Turkish occupation ,a bunch of refugees asks for help:they are starving and they would like to settle in the hills ,where they could clear pieces of lands which the inhabitants do not cultivate.But their priest does not agree and he tells them so :they have cholera and they could contaminate us all! In the village they get ready for a commemoration of the Passion:a shepherd will be Christ,a widow,Mary Magdelene ,some other inhabitants ,the apostles...but what's the point of this masquerade,which becomes a farce if some people are dying only a mile from your place?the \"actors\" take a rebel stand and they side with the refugees.Then the new \"crucifixion\" is around the corner.The Turks turn into some kind of Romans and their chief some Pilate who can wash his hands without tears. God gives the stammering shepherd the power of speech.The rich young man gives all he owns to the Poor ... NB: Joseph Dassin aka Jo Dassin ,the director's son ,who was very famous as a singer in Europa ,in the sixties/Seventies ,appears briefly as a young refugee :you can spot him in the scene when their priest tells his flock he dreamed he saw saint George last night.",
         "Let's suppose Jesus Christ returned to modern times. What would be the fate that befalls him? That is the question that the great writer Nikos Kazantzakis (1883-1957) poses in his deeply moving novel \"The Greek Passion\", brilliantly realized by black-listed director Jules Dassin in the film \"He Who Must Die\". The story's answer to this question was not to the liking of the Greek Orthodox Church, who promptly excommunicated the author Kazantzakis, who also wrote the novels \"Zorba the Greek\", \"The Last Temptation of Christ\", and \"Saint Francis\", among other works. (He is rumored to have been nominated 5 times for the Nobel Prize for Literature.) This tale is about much more than a religious passion play put on in a Greek village towards the end of the 400-year Turkish occupation. In a century in which religious morality and the church's real-politics have been severely criticized, this tale hits us right between the eyes. Definite food for thought. Could the church's silence in the face of so much unspeakable evil during the 20th century be one reason that religious thought has become largely irrelevant in our daily lives (politics, business, diplomacy, etc). A solid philosophical perspective is found in Robert Boldt's brilliant review (above). Why this film has not been released on video is totally beyond me -- a nice DVD would certainly be appreciated--especially now, when more and more of Jules Dassin's work is being restored and released (especially on the Criterion label).",
         "Rather than go the usual Hollywood biblical epic route, this Good Friday I opted for an alternative \"Communist\" view of the tale of the Christ via 2 European films made by exiled American film-makers: Edward Dmytryk's British-made GIVE US THIS DAY aka Christ IN CONCRETE (1949) and the French film under review – both of which, incidentally, also share blacklisted screenwriter Ben Barzman. Naturally, neither of these movies is located in Roman-ruled Judea or features crucifixions and, in fact, they are allegorical in nature and modernized in setting. Celebrated Greek novelist Nikos Kazantzakis – on whose book \"Christ Recrucified\" Dassin's film was based – would die the same year HE WHO MUST DIE was released and is himself perhaps best-known for another controversial work on similar lines, \"The Last Temptation Of Christ\", that was filmed much later by fervently Catholic film-maker Martin Scorsese. Set in 1921 in a small Greek village under Turkish rule during Passion Week, the film deals with the moral dilemma caused by the arrival in town of a group of Greek fugitives led by their priest (Jean Servais) – the survivors of a nearby village that was burned to the ground by the Turks. The majority of the townspeople, headed by the fearsome local priest Grigoris (Fernand Ledoux) and the wealthy mayor (Gert Frobe), refuse them any help lest they be judged traitors by the Turks, but a handful are sympathetic to the fugitives' plight: Maurice Ronet (as Forbe's hesitant son), Melina Mercouri (as the popular local widow-whore) and Pierre Vanek (as a simple shepherd in Frobe's employ). HE WHO MUST DIE marked a departure for Dassin who, leaving behind his tried-and-tested noir territory in which he had excelled until then, goes straight for Art in this powerful but heavy-going drama. The villagers are deep in preparation for the annual Passion pageant on Good Friday (a tradition that is still highly popular in my neck of the woods – in fact, I had an uncle and a good friend of mine who both used to take part in local representations of this sort many years ago!) when the harassed band of countrymen pass through their town; needless to say, the resulting heated confrontations makes everybody forget all about the play but the Christ saga soon enacts itself in real-life in the person of the stuttering shepherd (who, unsurprisingly, had been the one chosen to portray Jesus in the first place). The reteaming of Servais and Carl Mohner (as a chief member of the fugitive group) – both from Dassin's legendary caper RIFIFI (1955) – could not have been more different, nor (the future Mrs. Dassin) Melina Mercouri's portrayal here – despite the surface similarities – of the proverbial \"whore with a heart of gold\" than that of her most famous role in Dassin's popular hit, NEVER ON Sunday (1960)! This unholy mélange of patriotism and sensuality – not to mention Communist solidarity and Christian hypocrisy – cannot fail to give rise to impressive sequences and performances (particularly a white-haired Frobe and the enigmatic 'Blond Christ' Vanek) along the way but also, at least, one major deficiency: the villagers' avowed fear of Turkish retaliation if they aid the fugitives – especially as displayed via the overstated performance of Ledoux as a vindictive Patriarch – rings false when set against the laid-back personality of the Turkish Agha (Gregoire Aslan), perennially clad in pyjamas, seemingly uninterested in anything that happens around him and perfectly happy (until the finale, that is) to let his Christian subjects fight it out amongst themselves! Likewise, the melodramatic tussles over Mercouri's favors, between the awkward, pacifist Vanek and the robust, violent Roger Hanin, seem intended to give the film an extra touch of Greek tragedy more than anything else. Nevertheless, I am grateful to have been provided with an opportunity to check out this elusive Dassin film, and also very glad that it was by way of such a (surprisingly) pristine widescreen copy.",
         "I remember this film so vividly. When the lights of the theater came on at the film's conclusion, people were not merely wiping their eyes- - they were sobbing! Perhaps I was adolescent then, but I remember the movie as being one of the finest films I had ever seen. How, oh how, can I see this film again?",
         "As with another comment posted here, I would note that I too saw the film, only once, way back in the sixties and the memory of it has stuck with me ever since. I have read mixed reviews of the piece which saddens me as I feel that the picture was so finely wrought and deeply moving that nothing should prevent its reaching the widest possible audience. Bad, or Luke-warm reviews can have this effect. \"Celui Qui Doit Mourir\" should long have been available in a first- rate DVD edition. Its tale of the lives of simple villagers coming to parallel those of the scriptural characters they enact in a Passion Play is a rich, atmospheric parable. The black and white cinematography is exquisite along with the actors' performances and all the other production values of this rare motion picture.",
         "In contemporary life, where the struggles of power vie for our souls, I am constantly reminded of the passion that this film embodies. 'He Who Must Die' has become the quintessential metaphor for our spiritual unfolding in the modern world. The final scenes epitomize the existential dilemma of our lives: the fight for freedom and authenticity that too often puts us at odds with the practical accommodations of our community and the laws enforced by our rulers. This battle on behalf of humanity often results in rout, and yet we fight on with a fulfilled heart, the love of our comrades in arms and a belief in justice in spite of defeat and death. Jules Dassin was blacklisted by Joe McCarthy because he was willing to stand for his values. This film is perhaps his greatest acknowledgment of this struggle. Nikos Kazanzakis himself, summed it up: 'I fear nothing. I hope for nothing. I am free!' I loved this film and fervently believe it should be re-released.",
         "\"He Who Must Die\", despite its title, is not some sort of film noir or action movie. On the contrary, it's a fascinating religious allegory that slowly but surely catches your attention. I thoroughly enjoyed it and felt it had some nice similarities to another excellent film, \"Jesus of Montreal\". The film is set in Greece at the very end of the Turkish occupation. It begins with a village being destroyed and the remnants of the town leaving to find a new home. The scene abruptly changes to another Greek town. This one is content and well-fed--and on friendly terms with the Turks. They also are planning on their passion play--a huge extravaganza that is held every seven years. Instead, however, of trying out for parts, the Priest and the council pick who they think should be in the play. Oddly, they announce several of the key roles (such as Jesus, John, James, Peter, Judas and Mary Magdelene) but not the full cast. Over the course of the film, the cast members slowly begin to change--to, in effect, become more and more like their parts in real life. And all this is set into motion when the bedraggled townspeople at the beginning of the film show up looking for some food and land...and the council and priest of the prosperous village cruelly drive them off and give them nothing. There are so many parallels to the life and crucifixion of Christ that they aren't worth discussing--it's something you need to see unfold for you. This movie is beautiful and full of wonderful symbolism. In addition, the message is wonderful--as are the parallels between Christ and modern times. A must see for anyone wanting to see a wonderful film--whether you are a Christian or not. Terrific, well acted and directed and hard not to love. By the way, this French language film was directed by the blacklisted American director, Jules Dassin--one of the best directors of his age. He did NOT really understand French but still managed to make one of his best and most unheralded movies here. Just a few of the amazingly good films to see that he directed (and sometimes wrote) are \"Rififi\", \"Thieves' Highway\", \"Naked City\", \"Brute Force\" and \"Night and the City\". His wife (they married in 1966), Melina Mercouri, played Mary Magdelene in \"He Who Must Die\".",
         "\"One who must die\" was filmed on the island of Crete in Greece. Although it is a black and white film, nevertheless it succeeds in rightfully capturing the essence of the overall beauty of idyllic Greek landscape. The film also has its share of a mature existentialist side with the depiction of ordinary folks such as villagers assuming new identity in the form of extraordinary roles. This happens when they are asked to take part in a passion play. This is precisely how their lives get transformed.One of the wonders of this film is the effervescent display of great acting by famous actors like Jean Servais,Roger Hanin,Melina Mercouri and Maurice Ronet.The film's pace is in perfect tandem with its light hearted humor in day to day situations which makes it more of a lively experience. Celui qui doit mourir is a film that must be watched to ascertain how a work of art can give a message of peace needed to build bridges among people from different communities.",
         "The impoverish inhabitants of a rural village in Crete, after WWII, have to leave their town in order to look for a more agreeable place in which to live. Unknown to them, the poor villagers are seen as a menace by the people in a prosperous settlement they decide to make their new home. Led by the local priest, Fotis, the migrant peasants decide to go to the nearby hills to try to make a living after Grigoris, the hateful head of the church sees a menace in them. Pope Grigoris, prior to the arrival of the unwanted invasion, decided to cast the Passion Play his village celebrated every seven years. The main role of Christ is given to a shepherd, Manolios. In the pivotal role of Mary Magdalen, the local prostitute, Katherina, is asked to portray it. The son of the riches merchant of the place, Patriarcheas, is assigned to enact John, who was the favorite of Christ. The Cretan village was under Turkish rule with its commander, Agha, in charge of the invading army. The Agha looks the other way to the town can stage the play. Led in the hatred toward the invaders by Grigoris, Patriarcheas, the rich man, does not accept that Manolios, and his own son Michelis, take food to feed the starving villagers. Grigoris set the Agha against what he sees as an invasion to their well being by asking his help to repel Manolios and his friends to do any kind of help. The army proves its might against the poor invaders, thus protecting the interest of the evil priest Grigoris. Jules Dassin, having gone to exile in France, decided to bring Nikos Kazantzakis novel \"The Greek Passion\" to the screen. Mr. Dassin adapted the original material with Ben Barzman and Andre Obey. This is a powerful film that examines hypocrisy in an institution like the Orthodox church that shows a cruelty beyond belief, thus betraying the doctrine it tries to impose on its followers. The priest Grigoris is one of the most evil characters in literature. Mr. Dassin's must have been bitter after what he experienced in his own country, so the narrative and Kazantzakis' own take on religion offered the director fresh material in which to set this parable that resulted in one of the best films of all times. There are strong performances in the film. Jean Servais, who had worked with Mr. Dassin in \"Rififi\" is seen as Fotis, in an inspired performance. Fernand Ledoux, as Gregoris, is a study in malevolence. We were impressed by Pierre Vaneck's take on Manolios, the man selected for the Christ of the enactment of the play. Melina Mercuri is also effective as Katherina, the town's prostitute abused by all the men that wanted her for their enjoyment. Gret Froebe, Maurice Ronet, Nicole Berger, and the rest of the supporting cast do amazing work for the director. \"He Who Must Die\" deserves to be seen by discerning movie fans thanks to Jules Dassin, a genius in his own right.",
         "According to a certain reading of the Christian Gospels, it is likely that Jesus was crucified not because he was leading an anti-imperialist campaign against Rome or an anti-capitalist crusade against the current economic powers, or even that he was suspected of being the \"Messiah\". Rather, it appears that he was executed because of his enormous popularity with the poor, especially those who had come to Jerusalem for the feast of Passover, and its perceived threat to the status quo. Author Terry Eagleton (New Internationalist, May, 2008) states \"Some aspects of the way Jesus is portrayed in these texts have an obvious radical resonance. He is presented as homeless, property-less, peripatetic, socially marginal, disdainful of kinfolk, without a trade or occupation, a friend of outcasts and pariahs, averse to material possessions, without fear for his own safety, a thorn in the side of the Establishment and a scourge of the rich and powerful.\" Based on Nikos Kazantzakis' powerful novel, \"The Greek Passion\" American director Jules Dassin 1957 French film He Who Must Die (Celui Qui Doit Mourir) brings Christ's radicalism to center stage, posing the question - if Jesus returned to Earth, would he be crucified again? Known for such film-noir masterpieces such as Night and the City and Rififi, He Who Must Die was a distinct departure for Dassin who had moved to France after refusing to testify before the House Un-American Activities Committee. Now available for the first time in either VHS or DVD-R format from Learmedia (http://www.learmedia.ca), I saw this film yesterday for the first time in 48 years and the experience was just as remarkable as the first time. It is a powerful work of art that is unsparing in its depiction of Christian hypocrisy, skewering those who conveniently forget about Jesus' words about mercy, justice, feeding the hungry, welcoming the immigrant, sheltering the destitute and protecting the poor from the oppression of the powerful. While its villains may be a bit overdrawn, no clearer example exists on film of the disparity between lofty sentiments and the willingness to do what is right regardless of personal consequences. The film takes place in Greece in the 1920s when the country was occupied by the Turks and entire villages were torn apart. On the Island of Crete, a wealthy village has reached an accommodation with its Turkish governor (Gregoire Aslan) and is getting ready to stage its annual Passion Play on Good Friday, dramatizing the crucifixion. To do this, the autocratic local priest Grigoris (Fernand Ledoux) selects citizens in his village to play the leading roles. Manolios (Pierre Vaneck), a stuttering shepherd who works for the town's well-to-do mayor (Gert Frobe) is chosen to play Jesus while the local butcher is chosen as Judas. The town prostitute (Melina Mercouri, later to be Jules Dassin's wife) is chosen to play Mary Magdalene. Preparations for the Passion hardly get underway when a band of impoverished villagers led by Pope Fotis (Jean Servais) enters the streets of the village looking for food and shelter. Fearing Turkish retaliation if they aid the starving villagers, Grigoris and the mayor refuse requests for food and land to cultivate, evoking the fear of cholera and sending the dispossessed villagers to starve in the nearby hills. Some in the town, however, are sympathetic to the fugitives including the shepherd chosen to play Christ and the Mayor's son (Maurice Ronet). As the film unfolds, the Passion Play soon becomes real and the characters play out their biblical roles in dramatic fashion.",
         "The pain of people getting exiled from their homeland and the struggle to get a place to settle down is beautifully depicted in this movie.Same thing is happening in Europe now in 2016. The Christian priest on one side speaks about humanity and at the same time stands for sectarianism and finally the man who stands with poor is crucified.One of the powerful movies i saw which is relevant at all times. Human emotions sympathy ,love is depicted in this movie in a heart touching scenes. The love of father towards his son is one such thing which will last in your memory for quiet long time after seeing this movie. The cinematography is top notch.",
         "I'm Greek, so this may be a bit biased, but I'm an atheist and the movie moved me both in spiritual ways, as well as religious ways. It's not insulting to those who believe, the exact opposite. It's a thought provoking film that treads on the line of spirituality without telling you that it's wrong or right to believe but rather shows you deeper motives on why was Christ crucified. It shows you the kindness and brutality and stupidity of human nature, that exists in all of us. The acting is brilliant by every single cast member, the settings are wonderful, the music does it's job without overdramatizing anything, the situations the characters are put in, are enough for that. And this film, portrays that like few have."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Indusfilms",
         "Prima Film",
         "Cinétel"
      ],
      "summaries": ["Greece, in the 1920's, is occupied by the Turks. The country is in turmoil with entire villages uprooted. The site of the movie is a Greek village that conducts a passion play each year. The leading citizens of the town, under the auspices of the Patriarch, choose those that will play the parts in the Passion. A stuttering shepherd is chosen to play Jesus. The town butcher (who wanted to be Jesus) is chosen as Judas. The town prostitute is chosen as Mary Magdalene. The rest of the disciples are also chosen. As the movie unfolds, the Passion Play becomes a reality. A group of villagers, uprooted by the war and impoverished, arrive at the village led by their priest. The wealthier citizens of the town want nothing with these people and manipulate a massacre. In the context of the 1920's each of the characters plays out their biblical role in actuality."],
      "budget": 0
   },
   "movielensId": 160890,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1957-05-03",
      "dvdReleaseDate": null,
      "directors": ["Jules Dassin"],
      "runtime": 122,
      "movieId": 160890,
      "title": "He Who Must Die",
      "mpaa": "",
      "actors": [
         "Jean Servais",
         "Carl Möhner",
         "Grégoire Aslan",
         "Gert Fröbe",
         "Melina Mercouri",
         "Pierre Vaneck",
         "Maurice Ronet",
         "Roger Hanin"
      ],
      "imdbMovieId": "0050237",
      "originalTitle": "Celui qui doit mourir",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Greece, in the 1920's, is occupied by the Turks. The country is in turmoil with entire villages uprooted. The site of the movie is a Greek village that conducts a passion play each year. The leading citizens of the town, under the auspices of the Patriarch, choose those that will play the parts in the Passion. A stuttering shepherd is chosen to play Jesus. The town butcher (who wanted to be Jesus) is chosen as Judas. The town prostitute is chosen as Mary Magdalene. The rest of the disciples are also chosen. As the movie unfolds, the Passion Play becomes a reality. A group of villagers, uprooted by the war and impoverished, arrive at the village led by their priest. The wealthier citizens of the town want nothing with these people and manipulate a massacre. In the context of the 1920's each of the characters plays out their biblical role in actuality.",
      "tmdbMovieId": 119637,
      "avgRating": 3.66667,
      "releaseYear": "1957",
      "numRatings": 3,
      "posterPath": "/q3FHwbfjfY90trv9ZQId6LPuJNM.jpg"
   }
}