{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt4465220",
      "video": false,
      "title": "My Friend Rockefeller",
      "recommendations": [
         185515,
         253265,
         415482,
         362092,
         403011,
         338167,
         295726,
         226064,
         335149,
         354421,
         278772,
         407588,
         147923,
         294862,
         340223,
         252143,
         390520,
         323679,
         84323,
         333346
      ],
      "backdrop_path": "/ohOWg2VTepvcubWHjm0frwapX8f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57763bdb9251417e16001433",
               "name": "Steffi Kammerer",
               "profile_path": null,
               "id": 1643796,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57763be4c3a3684e54001658",
               "name": "Steffi Kammerer",
               "profile_path": null,
               "id": 1643796,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.0295,
      "production_countries": [],
      "id": 368620,
      "vote_count": 13,
      "budget": 0,
      "overview": "Christian Karl Gerhartsreiter lived a life of deception and crime before settling on his ultimate scam - impersonating a Rockefeller. How was Gerhartsreiter able to dupe so many people from so many walks of life? A story that begins in a Bavarian village, continues in the most exclusive clubs on the American East Coast, - and ends in a Los Angeles court.",
      "similar": [
         5915,
         152532,
         134411,
         5176,
         769,
         462,
         858,
         11202,
         112160,
         276907,
         11005,
         141,
         634,
         640,
         371638,
         318846,
         389015,
         407445,
         376867,
         363676
      ],
      "original_title": "My Friend Rockefeller",
      "runtime": 87,
      "poster_path": "/5su427rQorhEZvzpU8njaucdL9h.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2015-07-04",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steffi Kammerer"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Steffi Kammerer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4465220/",
      "coverLink": null,
      "actors": [
         "Christian Karl Gerhartsreiter",
         "Dan Banks",
         "Sandra Boss"
      ],
      "reviews": [
         "I saw this on streaming NF last night, and didn't find any reviews of this doc anywhere, so I didn't know what to expect. It turned out to be about a story I vaguely remembered hearing about on the news; a guy who was impersonation a scion of the Rockefeller family. However, that was just the surface of the story, as this German citizen had been impersonating and lying his way through life in the US since high school to become a part of of the wealthiest circles in places like San Marino CA, Greenwich Conn., Wall St. NYC, Boston's 'Cafe Society', and some wealthy enclave in New Hampshire. If that was all he did, it would be just a benign story of a social climbing parasite, who used lived off of two high earning women to fund his escapades. But the fact that he murdered at least two innocent people, and hacked up their bodies so completely, that one of them was only discovered because the house owners decided to dig up their backyard to build a swimming pool, revealed that this man was a murderous sociopath, who would stop at nothing to achieve his ridiculous goals in life. I felt like there could have been more included in the doc, considering two books had been written about this guy, and Lifetime even made a docudrama about this man, from the POV of one of his wives. The second body, the first victim's wife, was never found.",
         "Like a lot of documentaries about crime puzzles, many of them are in desperate need of a narrator if for no other reason than it may be difficult to understand how all the pieces fit, risking leaving the viewer with a jumbled mess. After having viewed this documentary, I wasn't sure how all the puzzle pieces fit together. I've read two books about so-called Clark Rockefeller, the German provincial Christian Gerhartsreiter, who impersonated a Rockefeller and fooled the elites of New York for well over 10 years. The present documentary certainly added much I didn't know before, but if I had come into this subject with a clean slate, I think I would have been very confused. The time-line of events is not made clear, particularly when and where Christian Gerhartsreiter was under his many aliases. Certainly, the best known is Clark Rockeller, but he also want by Christopher Chichester, Chip Smith, and Chris C. Crowe among others. Although these aliases were mentioned, it wasn't always clear exactly when and where he used them. In the late 1970's, Christian Gerhartsreiter who had been born and raised in the small provincial town of Siegsdorf in southern Germany came to the United States intent on \"becoming\" an American. He didn't just assimilate himself into America society. He decided to pass himself off as one of the nation's elites. After convincing some American's to \"sponsor\" him, he moved to San Marcos, CA, a quasi-Beverly Hills located in the northeastern part of the Los Angeles area. There, he named himself Christopher Chichester and claimed he was in the upper circles of Hollywood. He freeloaded off the elites of San Marcos who believed his story that he was a descendant of Lord Mountbatten. He even went so far as to imply he was a cousin of Queen Elizabeth II of Great Britain. Eventually, he would steal a car and murder at least one person, probably two, and then he disappeared. A few years later in the 1990's, a young man name of Clark Rockefeller infiltrated the upper-crust of New York, claiming he was a member of the Rockefeller family, one of the most elite and prestigious of American clans. He spoke and presented himself in a way which endeared him to the NY elites and they bought his story hook, line and sinker. In America's largest and arguably most elitist city, Clark was given access to exclusive clubs, given prestigious jobs, and invited into elite circles. Even though he was supposedly worth $100's of millions, he freeloaded off of other people's generosity, often compelling companions to pay for drinks and dinners. And yet, almost none of them ever questioned that he was anything but a Rockefeller. He married a woman making $1 million a year working for a prestigious NY firm, and convinced her to give him full access to her bank account. He also claimed to have inherited an art collection which turned out to be filled with fakes and copies. Back in San Marcos, police dug up dead bodies at a residence in which he used to reside, and were getting closer to the man who had called himself Christopher Chichester. The gig was up when, after his wife divorced him after a private detective determined he wasn't a Rockefeller, he kidnapped their only daughter. When the story broke, the Rockefellers claimed they didn't know who he is and that he definitely wasn't one of the family. He was eventually arrested and flown back to the Los Angeles area to stand trial of murder where he was convicted. Even stranger than the incredible false identities he assumed was that so many people bought into his story. Nearly everyone he met were convinced he was a member of the Rockefeller family, and those in San Marcos believed he was descended from Lord Mountbatten. The documentary is mostly comprised of interviews of people who interacted with \"Clark Rockefeller\" aka Christian Gerhartsreiter. Very few actually questioned he was telling the truth. Far stranger was that many people could have easily researched online to find out whether this man was who he claimed to be. Of particular interest is Walter Kirn, writer of the novel \"Up in the Air\", who befriended Rockefeller and bought into his story. He admits he had witnessed many hints which might have led him to discover for himself whether Clark was telling the truth about his lineage but failed to do so. However, he missed these opportunities because it sounds like it never occurred to him until after Gerhartsreiter's arrest that he would have been lying.",
         "Portrait of Christian Gerhartsreiter, who posed as a Rockefeller heir for decades, but who was, in fact, a con artist and a murderer. I don't recall ever hearing about this story before watching the documentary on Netflix. I feel like I must have because it is so extraordinary, but perhaps not. This film is darn near perfect. The court testimony, the interviews with neighbors and William Quigley, you really get a sense for who this man is and what he was able to accomplish. Other than the murder aspect (which he denies), there are some things to admire in here. I don't think we've heard the last word on this story.",
         "Although real life psychopath is fascinating, this film could be more journalistic. I did see a version of TV interview about this Rockefeller impostor a few years back. He certainly did fool a lot of folks. However, truth to be told by the journalists seemly convinced me more. This one tried to weave those human factors into a story was not particularly impressive. Documentary can be a good story telling alone by itself. Interviewing related characters should not be the focus. It should be the chronically telling all the frauds and mischief he had done to lead to his arrest. Impersonating someone else is not a crime itself legally unless it causes any damages to victims. Apparently, he did not cause enough financial or physical damages to others to turn him in earlier until 2008. He was charming to those soft ears. People were fool by him because they also wanted to using him to climb up the social or career ladders. He never really met anyone in the upper class society otherwise he would have already been exposed. His ex-wife wanted to believe she married into the Rockefeller so she did not even check on his story. She though somehow she finally could be proud of her femininity to attract a classic American Aristocracy, Everyone has his or her volubility. Knowing yours would definitely protect yourself from those fouls. The story of \"Catch me if you can\" which Steven Spielberg adopted it into a comedy is very much alike. However, the main character never harm anyone physically. This Rockefeller impostor is a convicted murderer which I don't see anyone would make this case into other than a thriller. I am somehow disappointed about this film. If you already know the case, you can skip it."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Crime",
         "Mystery",
         "News"
      ],
      "productionCompanies": ["LOOKSfilm"],
      "summaries": [
         "Christian Gerhartsreiter, a man eventually known as \"Clark Rockefeller\", lived a life of deception; the FBI called it \"the longest-running con in FBI history.\" After ingratiating himself into New York society and marrying a top banker with a Harvard MBA, \"Clark\" settled into his new luxurious life. The two had a daughter, before they divorced after 13 years. When his wife won custody, a distraught Clark abducted his beloved daughter. Ironically, it was the search for the missing child that not only exposed a web of lies and multiple identities, but a double murder committed decades earlier. How was Gerhartsreiter able to dupe so many people - from the very cream of society? What buttons did he press? We followed his trail and collected the reflections of those close to him. His friends who were left in the wake of his roller-coaster journey: from a Bavarian village to the most exclusive clubs on the American East Coast - to the grand finale in a Los Angeles court room. Here a jury recently found him guilty of murder, he was sentenced to 27 years in prison. After the sentencing we interviewed him exclusively together with best-selling author Walter Kirn.",
         "My Friend Rockefeller\" is a film about trust, illusions and a deadly secret. Christian Gerhartsreiter, a man eventually known as \"Clark Rockefeller\", lived a life of deception; the FBI called it \"the longest-running con in FBI history.\" After ingratiating himself into New York society and marrying a top banker with a Harvard MBA, \"Clark\" settled into his new luxurious life. The two had a daughter, before they divorced after 13 years. When his wife won custody, a distraught Clark abducted his beloved daughter. Ironically, it was the search for the missing child that not only exposed a web of lies and multiple identities, but a double murder committed decades earlier. How was Gerhartsreiter able to dupe so many people - from the very cream of society? What buttons did he press? We followed his trail and collected the reflections of those close to him. His friends who were left in the wake of his roller-coaster journey: from a Bavarian village to the most exclusive clubs on the American East Coast - to the grand finale in a Los Angeles court room. Here a jury recently found him guilty of murder, he was sentenced to 27 years in prison. After the sentencing we interviewed him exclusively together with best-selling author Walter Kirn.",
         "Portrait of Christian Gerhartsreiter, who posed as a Rockefeller heir for decades, but who was, in fact, a con artist and a murderer."
      ],
      "budget": 0
   },
   "movielensId": 161084,
   "movielens": {
      "languages": [""],
      "releaseDate": "2015-07-04",
      "dvdReleaseDate": null,
      "directors": ["Steffi Kammerer"],
      "runtime": 87,
      "movieId": 161084,
      "title": "My Friend Rockefeller",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "4465220",
      "originalTitle": "My Friend Rockefeller",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Christian Karl Gerhartsreiter lived a life of deception and crime before settling on his ultimate scam - impersonating a Rockefeller. How was Gerhartsreiter able to dupe so many people from so many walks of life? A story that begins in a Bavarian village, continues in the most exclusive clubs on the American East Coast, - and ends in a Los Angeles court.",
      "tmdbMovieId": 368620,
      "avgRating": 3.125,
      "releaseYear": "2015",
      "numRatings": 8,
      "posterPath": "/5su427rQorhEZvzpU8njaucdL9h.jpg"
   }
}