{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2948078",
      "video": false,
      "title": "Lake Eerie",
      "recommendations": [
         385363,
         291290,
         356483,
         350616,
         213803,
         78411,
         84293,
         406582,
         396004,
         336167,
         347764,
         287793,
         343750,
         347850,
         323792,
         332689,
         446360,
         316246,
         259543,
         166161
      ],
      "backdrop_path": "/bcPiNwo84QXbrnrqR87EPUGQP8g.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "5897fa41c3a3687724003d72",
         "content": "If a pair of tits and a Lance Henriksen cameo are enough to get you on board with a movie, then sure, give _Lake Eerie_ a chance. If you require any more substance than those two things, I wouldn't recommend it.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid if possible._",
         "url": "https://www.themoviedb.org/review/5897fa41c3a3687724003d72"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Pop",
               "gender": 2,
               "credit_id": "54ae4da6c3a368404f001048",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Realtor",
               "gender": 0,
               "credit_id": "54ae4dc99251413e62001522",
               "name": "Marilyn Ghigliotti",
               "profile_path": "/3UmNH4sNfnBUDiu8PDzpcf3vxcH.jpg",
               "id": 23631,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Eliza",
               "gender": 1,
               "credit_id": "54ae4ddd9251411ef6001439",
               "name": "Betsy Baker",
               "profile_path": "/dKnuMuT5H01UGoVJXeB3HhnvIT5.jpg",
               "id": 11464,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Man in Black",
               "gender": 0,
               "credit_id": "54ae4df9925141152c000f78",
               "name": "Al Snow",
               "profile_path": null,
               "id": 1410539,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Kate Ryan",
               "gender": 1,
               "credit_id": "54ae4e24c3a3682f9d0013e3",
               "name": "Meredith Majors",
               "profile_path": null,
               "id": 1410540,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Jack Hammer",
               "gender": 0,
               "credit_id": "54ae4e3dc3a3682f9d0013e9",
               "name": "Jason K Wixom",
               "profile_path": "/VeDWOWWiGXXXEy9n640pfFt5uq.jpg",
               "id": 1338033,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Autumn",
               "gender": 0,
               "credit_id": "54ae4e64925141131f000dd5",
               "name": "Anne Leigh Cooper",
               "profile_path": null,
               "id": 1410541,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Harrison Lloyd",
               "gender": 0,
               "credit_id": "54ae4e89c3a3680cac001542",
               "name": "Chris Majors",
               "profile_path": null,
               "id": 1410542,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Fire Chief",
               "gender": 0,
               "credit_id": "54ae4ea29251413e62001548",
               "name": "G. Larry Butler",
               "profile_path": null,
               "id": 31234,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "54ae4eaf925141131f000de1",
               "name": "Kevin R Allen",
               "profile_path": null,
               "id": 1410543,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5844899bc3a3683e1600d216",
               "name": "Meredith Majors",
               "profile_path": null,
               "id": 1410540,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56a1267392514149bc0071c6",
               "name": "Chris Majors",
               "profile_path": null,
               "id": 1410542,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.253578,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 316268,
      "vote_count": 29,
      "budget": 0,
      "overview": "A young widow moves into an old house on Lake Erie to recover from the sudden loss of her husband; however, she soon discovers a dark secret and that she is not alone.",
      "similar": [],
      "original_title": "Lake Eerie",
      "runtime": 104,
      "poster_path": "/wqsGwJSdR5X7BxfTJmCEpx0GHS9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Solid Weld Production",
            "id": 43436,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Savage Beast Film",
            "id": 43437,
            "origin_country": ""
         }
      ],
      "release_date": "2016-01-15",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "A dark secret locked away...will soon be discovered.",
      "adult": false,
      "homepage": "http://www.lakeeeriemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Majors"],
      "runtime": 104,
      "synopsis": "A young widow (Kate) moves into an old house on Lake Erie to recover from her husband's sudden and traumatic death. The lake house has not been lived in for over 40 years. The previous owner (Harrison) was a young archaeologist and explorer. The house is just as Harrison left it in 1969. From the moment Kate moves into the house, she is soon haunted by a dark presence. Kate is taking multiple pills/ medications for her anxiety and depression; therefore, she is not sure if she is losing her mind or if the haunting is really happening. Kate is suddenly enveloped by a whirlwind of tragedy and dark forces, and must decide whether or not she is strong enough to fight back and figure out the evil truth before it's too late.",
      "writers": ["Meredith Majors"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2948078/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjQyOTcwOTc2N15BMl5BanBnXkFtZTgwMTY1Nzk5NjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Lance Henriksen",
         "Marilyn Ghigliotti",
         "Betsy Baker"
      ],
      "reviews": [
         "I like indie films and I'm prepared to give them slack that I wouldn't give to mainstream movies. I hated this movie. The acting was, throughout, bad. Sometimes painfully bad. Again, I can put up with that. Professional actors cost money that independent movie makers don't have and indie films give new talent a chance to make their marks. Plot and script writing on the other hand costs nothing and, in both, this movie literally falls apart. Horror movies, even the best of them, require a suspension of disbelief but, when the characters in horror movies start acting in ways that stretch credibility, you have a major problem. Example (one of many): There's a strange man in my new house. Response: Find a knife (check), find a light (check), take some pills, find a comfortable sofa, lie down, sleep till morning (nope). By the end I had completely lost interest in both the characters and the story line. The IMDb rating has been boosted by lots of positive reviews (no doubt from friends and family) and I'm confident it's only going to head in one direction. Don't waste your time watching it and, if you do, leave a suitable review. Don't be surprised however if your review is instantly attacked with lots of \"This review was not useful to me\" hits.",
         "Absolute trash, I'm tired of awful directors churning out this lower than b movie garbage. Unless there's an award for not being able to afford a steady-cam and constantly having the actors framed at an odd angle...if there is then this gets my vote! Unbeliveably fake reviews aside (different subject) the following issues exist: 1 horrible camera work 2 horrible acting 3 horrible script 4 seeing lance henrikson suck so bad hurt. The story itself wasn't horrendous but laughably cliché and i did personally enjoy the often bizarre incidental music as it seemed to want to build tension when quite often nothing was happening, dark and spooky unpacking for example. Who knows whats in your suitcase?? Oh clothes thats right you totally packed it. I am especially fond of demonic keyboards whilst walking or knocking on a door etc.",
         "It's funny to see all these fake reviews and how the rating of the movie has been plummeting over the last few days. I'm not sure what to add, most points are covered by the previous reviews (the real ones, that is). The acting is stiff and amateurish, even Lance Henriksen somehow looked like he had never been in a movie before. The story is extremely stupid. Half the scenes don't serve a point, and could have been removed from the movie without making it worse. Actually, it might have made it better. But why stop there? If just all the scenes had been removed, maybe it would have been slightly watchable. Don't waste your time, not even if you're looking for a bad movie to laugh at. Go find something else to watch.",
         "I went to Mask Fest and saw the World Premiere and I didn't understand the rave reviews then and don't understand the overly spectacular reviews on here now. I don't know if people were afraid of hurting the director's feelings or what, but it's not good, plain and simple. Not scary and down right laughable. I think there are some good ideas but it just didn't come together. I'm all for independent films but it needs to be better than this. A real disappointment especially given the fact that Lance put his name and his face on this project. Perhaps if he'd had a bigger part and it wasn't so obvious the director was trying to push his wife to the fore front it might have worked better. I listened to the comments at the premier and quite frankly I think people were just being nice so they could hob knob with Lance. The movie is just not good....sorry! Out of respect for the fact that I realize someone put their heart and soul in this project, I stayed and sat through the entire thing, hoping it would get better and it didn't. I generally don't write reviews but because of all the pre release hype that I found hard to believe, I kept waiting for someone, anyone to be honest... No one said what I and my husband were both feeling at the time, it was just not a good movie. I do give props to Betsy Baker and Lance...they were the ONLY reason we stayed til the end.",
         "I feel that I need to comment on this film in more detail, so I can save someone's time. Don't go by the high ratings. I have no idea where they come from. Must be friends and family of the directors. It already started weird but was sort of interesting. Anything could have happen and because I had no idea about this film, I kept watching. Then something happened but it didn't really fit in with the start. It seemed that I was watching a subtle horror, when suddenly a ridiculous story line emerged. It was so unfitting that I assumed it was purposefully bad in order to highlight a mental illness or something. But it never happened. The cartoon story was actually what the film was about. Stuff about Egypt and Pharaos and Princesses and a love story and a realm of hell and an amulet. I remember writing stories like that when I was 10. It was cringe worthy and tacky. Up to the very end I gave the bad acting my benefit of the doubt, waiting to find out that the main character was actually in a mental institution, having imagined all of it... But that would have been a good, clever ending. In reality, what you see is what you get. An incredibly bad episode of the Outer Limits.",
         "I thought this had very similar atmosphere to horror films of the 70s and 80s, but at the same time doesn't feel retro. The house they used for filming looks amazing, it completely becomes a character itself. I will say that after my first viewing at the Horror Hound film festival I liked it but didn't love it. But for the next few days after seeing it, I couldn't stop thinking about it, it just stuck with me. So I bought it once it came out on VOD and I have to say it gets better with repeat viewings. There is quite a bit of depth to the story. It has become one of my favorite modern horror films, low budget that is. 8/10",
         "This movie's greatest strength is its ability to build tension and not rely on jump scares. It really captures the feeling of what it's like being alone in a creepy house (my family has an old house and I have been there alone, even the little things freaked me out.) I appreciate the shower scene not having blood coming out of the shower head, that has been done to death and I was getting worried when the scene began. Dirty, mucky lake water was a clever twist to an old horror trope. Nicely done. Bonus point for shooting the film using the Great Lakes. The Great Lakes are amazing and don't get enough love in movies! I would really love a Put in Bay movie",
         "I don't know how I found this movie on my flight the other day, but it kept me awake during my red-eye. Sure, it is not a perfect film, but it is entertaining. I didn't read any reviews on it, and I'm glad I skipped them because the reviews are all over the place! I liked it. Wasn't my favorite movie ever made, but I was happy something entertained me during my flight. I watch until the end because it kept me engaged. Some unusual filmmaking, but better than some other films I've seen lately. Didn't really have known actors, but performances were pretty good. I never give reviews on movies. Never! I went back online to check out this one, and decided to write a review. My first movie review, so that says a lot about Lake Eerie. I'd watch it again. And I'm grateful for the entertainment on my miserable flight. Plus, I liked the girl coming from the lake. What a beauty! Check this out just for her.",
         "Literally laugh out loud. The lead actress (Meredith Majors) is catastrophically unable to portray a convincing human, never mind a recently bereaved widow. She has less talent than a soft-porn actress, and I can tell you this for certain because there's actually a hilariously bad, and painfully inappropriate soft-porn scene inexplicably rammed into the middle of the film! You get an idea of this woman's utter lack of talent when, early on, she fails to simply walk down a road without looking like an awkward marionette. I kid you not, it's like a home movie made by doting parents who film their baby daughter self-consciously pretending to \"act natural\", and then force you to watch. The only redeeming features are an unaccountable cameo by Lance Henriksen and the over-enthusiastic neighbour they've invited over to help out. She can't act either, but boy she gives it a damn good try. Get out while you can.",
         "Watched this last night on iTunes, and didn't really expect much. Lance Henriksen was the only actor I recognized at first, but I found out later that the crazy neighbor was Bruce's girlfriend in the original Evil Dead, that was cool. Anyway, Lake Eerie was actually pretty good. Maybe it was because I had low expectations going in. Great camera work, i'm so sick of the \"shaky cam\" nonsense in low budget movies. I get that it is easier and cheaper, but it looks terrible. I'm surprised by the really low rating and negative reviews here though. I don't think those people watch many low budget independents films, because I do, and this was definitely one of the better ones. 8-9 out of 10 for what it is. Remember, you don't review it the same as you would a studio film. Silly kids.",
         "When there are so many movies that do the same old formulaic crap over and over...it is a breath of fresh air to see a film that actually requires thinking and subjectivity. Thank you, Lake Eerie, for that! That is what art is for anyway; well it was in the past when we had films to discuss and debate about. I entered into watching Lake Eerie knowing it was a small independent film, but had no idea what it was about. Wow, I couldn't believe how different it is from other films. I really enjoyed it. Even though there are people on IMDb who don't understand art or film...I'm happy to say I do! I understood this movie because I had fun with what the story was telling. To me, it shouldn't be in the horror genre, but hey that's me. It is kind of sci-fi, kind of drama, kind of thriller. I really enjoyed the build up...even though I was anxious to see the ending, I really enjoyed the characters. I wish there was more about Kate's husband and their past story but I understood why the story kept to its path. I loved Lance Henriksen's small role as the father. He always performs well. Aliens is one of my top 10 films of all time. Speaking of Aliens, there is woman-power in that film...and there is woman-power in Lake Eerie. Kate finds her strength at the end and I really enjoy those heroine type tales. If you go into Lake Eerie wanting the same old seen-it-before movie, then you will be disappointed. However, if you go in understanding it's an independent film with some twists at the end...oh and bring your imagination, you will enjoy it. You cannot watch this movie at face-value. It has more depth than that. It was a fun ride for me!",
         "Lake Eerie does everything I like in horror that seems all too rare these days. First, the story takes its time introducing the characters, the plot, and the setting. This seems simple, however, it is so often rushed (or completely absent) in many modern horror films. Solid acting all around for an indie. One weak performance, but several really great performances, Betsy Baker being my favorite. The lead was also convincing, not to mention pretty. The story was intelligent and unique, with a surprising amount of depth to it. At first I thought I knew where the film was going, but I was way off. I love when a movie can do that. The music is superb and really ties everything together. It adds heaps of atmosphere to the film. The tone and atmosphere really stuck with me after watching it. It's one I'd watch again.",
         "Sad to see that a flick containing Lance Henriksen and Betsy Baker is total crap. i admit it, I was fooled by seeing their names taking me back to Aliens (1986) with Lance and The Evil Dead (1981) with Betsy. This flick clocking in over 90 minutes is one big yawn. It's all about talking and nothing happening. It's only the last 10 minutes that the horror comes in and even that is ridiculous. Most of the horror is not shown or done off-camera. And don't watch it for your thespians, they are maybe 5 minutes in this crappy flick. The poster looked promising, sadly the flick wasn't. And people bragging give independent flicks a change. I do, i'm in the scene over 30 years so I have seen it all by now. Sorry, this doesn't offer one thing to notice. Gore 0/5 Nudity 0,5/5 Effects 0/5 Story 0/5 Comedy 0/5",
         "I enjoyed Lake Eerie. I recommend it. Period. First off, I will say that IMDb is full of trolls. There are only a few people who know the ethics of writing reviews anymore. Reviews are not meant to spat idiotic, hateful garbage. It's so obvious these trolls know nothing about film-making, and apparently they want to give the film a 1 star because they want to balance the fake reviews?? What kind of logic is this? Anyway, Lake Eerie reminded me of artistic films of the 1960s. Such as Ingmar Bergman films. Oh how I would love to see the hateful, ignorant rants if the IMDb trolls reviewed Bergman films. My point is, there aren't enough smart people to discuss films in a respectful way anymore. Being a filmmaker myself, I feel bad when I see other filmmakers being attacked because trolls want to leash havoc on the internet. To me, Lake Eerie was meant to be like a dream. I didn't know what was real and I thought the actors performed according to that strategy. Similar to Bergman, the atmosphere is supposed to create dread. The other reviews (the negative trolls) speak of bad acting etc, but they don't understand that the filmmakers probably made these choices on purpose. That is the beauty of understanding film, and being able to notice intricate detail strategically placed by the Director in order to shift audiences' emotions to resemble the main character's experiences. It is amusing to read the negative reviews and know these people have no idea what they're talking about. I'm sure the trolls want to tell me that I'm crazy, but the difference is I know film. It is a shame that Lake Eerie will probably not get the appreciation it deserves because people don't understand the plot or that it is more artistic than mainstream. It is a shame that trolls are crawling all over this film for whatever reason. If you like Bergman, and are smart enough to understand films like that, you just may enjoy Lake Eerie. Especially if you enjoyed Persona!",
         "Lake Eerie was very unique, different and intriguing. I don't think it deserves these horrible reviews. It wasn't perfect, but it was entertaining. I enjoyed the stuff about Egypt and the Egyptian princess, I feel like there could have been more on that story line. I hope that people will give this film a shot and see it from a different perspective. Everyone can have their own opinion, but don't let it sway you from at least giving it a chance. Watch it for yourself and see what you take away from it. Just for the record: reviews shouldn't be used to blatantly attack others. If you don't like a movie, fine, but don't spread hate. No one deserves that.",
         "Bad acting. Bad writing. Bad directing. Bad. The biggest thing that struck me was how it appeared that the actors, director, writer/s seemed to never have interacted with other humans before. It's like aliens were trying to sneak an alien movie into the public and they thought \"This is how humans act, right?\". I tuned out after the inexplicable lesbian ghost dream scene. You could enjoy this movie by turning it into a drinking game. Within the first half hour the neighbor lady says dear about 30 times. That's what old Earth human people say, right? Take a shot every time she says this and you'll have a great time. \"You're the bravest person I know!\"",
         "Seriously? Is this how 2016 begins? This film is just bad. I'm not sure what the other reviewers were watching? Don't even wait for the DVD release, just watch it on late night TV when it gets there while you're zoned out on the couch on a Friday night when you're too sick to go out. Here are the issues. * Lake Erie is a real place and there was so much potential that could've been used, but the premise that was chosen.. oh come on. * The lead actress tries, but the script is just too bad. I'm sure it read like \"Be happy\", \"You lost your husband, now be sad\", \"Now be happy again\". Its no flow or transitions or depth in her character * A lot of it just didn't make any sense. Its a lesbian scene in it that has no place. And whats with the topless girl on the beach? No reason. * There's a dingy red haired supporting actress who has to keep saying the lead actresses name over and over. Its forced and robotic. \"But Kate, yes Kate, no Kate, please Kate\".. sheesh. * Lance Henriksen is in it for a short time and what a waste of a phenomenal talent. Someone give this man a TV drama, please! He must have needed a car payment made or something to appear in this bomb. * The 'monsters' are straight out of your neighborhood fake haunted house. Bad makeup, crappy acting. \"rawrrr!\" * Its low to no budget. The audio is bad. The cinematography consists of moving an iPhone through a house. This movie is just awful, but since I'm from Michigan where Lake Erie borders, I'll give it 2 stars.",
         "It's low budget but not painfully low budget, actually looked pretty a number of times. The story did some new stuff in a tire genre so that was appreciated. Camera work was good, no shaky cam or found footage nonsense, it was simple and didn't get in the way. Reminded me of older horror films and that is a compliment due to the current state of the horror genre. Acting was above average for an indie. All the leads were consistent but some of the parts left a bit to be desired. The electrician was terrific, had me laughing pretty hard. The ending really got me, this is where the movie really earned some bonus points. Without spoiling anything, it was clever and didn't over explain, it actually gave me something to think about after. Thank you.",
         "Sorry that was the cheesiest B Movie I have seen and I have seen a few... It is an independent movie, so I guess the lack of money showed. The script was poorly written. The plot could have been better. The actors could have been less wooden, but I doubt it. Why the add in of the silly I wanna watch you with another woman scene, was it added in to sex this lackluster up a little, if so then sorry it was an 'Epic Fail' That was not the only epic sex fail, there was the scene with the naked woman splashing in the water, what did that add into the movie? The 'zombie attack' scene so bad. The villains, the aunt and the niece were annoying. This could have been a good made for TV movie, with better actors and a better script and yes more money spent. Sorry it got one star from me,for a reason. It was an hour and some of my life I won't be getting back. I will say one thing, don't bother watching this film because the only good thing in this movie was the house.",
         "Lake Eerie is less horror and more a mixture of suspense and sci-fi. It was written by Meredith Majors (who also stars) and directed by Chris Majors (the duo is currently working on a new film, Echo of Evil). The plot of Lake Eerie is in some ways slow to develop, but a lot of that has to do with the deliberate choice to reveal things sparsely rather than poor pacing. Kate Ryan (Meredith Majors) is recovering from some personal losses and crisis and has moved from Idaho to the shores of Lake Erie for a new start. She chooses an old house, including all the aged furnishings and belongings of the prior owner. Although it has been taken care of, the home has been unoccupied since the 60's. Soon she learns the prior owner was an archaeologist who was investigating some curious artifacts. And quickly strange things begin to happen, leaving Kate to try and decide if her mental instability is rearing its ugly head, or if she is being confronted with forces she cannot explain. The real gem in this film is without question Betsy Baker, who plays nosy and eccentric neighbor Eliza. Horror fans might recognize Betsy's name, but if you don't, her most famous role was as Ash's girlfriend Linda in the original Evil Dead. Even to this day fans encourage her to thrill them with her \"We're gonna get you, we're gonna get you, not another peep, time to go to sleep\" chant. In Lake Eerie, Baker is a tour de force, savoring her scenes the way a wine aficionado enjoys a rare vintage. It helps that she and Meredith Majors have very good on-screen chemistry, dancing between friendly banter and strained frustration. The great Lance Henriksen makes an appearance as Kate's father, left back at the Idaho farm and worried about the well-being of his troubled daughter. He doesn't get a lot of screen time, which is a disappointment. Henriksen is in many ways a next-generation Peter Cushing: he can play a range of characters and no matter how goofy the dialogue he might be given it sounds believable and powerful when it comes out of his mouth. If I have quibbles with Lake Eerie, the first is in some of the supporting cast. Anne Leigh Cooper as Eliza's niece Autumn has to jump between excited, upbeat college kid to serious researcher and she never really finds a comfortable middle ground between the two. Ben Furney, in his scenes as Kate's former husband, seems like oil to Kate's water; they simply don't carry any believable emotion as a loving couple. My other complaint would be the resolution of the story. Admittedly a portion of this is because they wanted to leave an opening for a possible sequel. So I can allow a partial pass for that transgression. Obviously I can't give you a lot of detail, because I want to avoid any possible spoilers. Lake Eerie isn't Hellraiser or Poltergeist quality, but it didn't have the budget or commercial backing for that kind of punch. But it is enjoyable, so if you get a chance to pick up the DVD or watch it on Amazon Video or some other On-Demand service I say go ahead. Oh, and Victoria Johnstone as \"The Countess\" can visit my nightmares anytime.",
         "Lake Eerie lives up to its name in this haunting indie horror. It is not terrifying, it is not gory or gross, it is simply eerie. The final shot of the film is downright bone-chilling. I can see why some horror fans may not enjoy this film, it does break out of the horror genre and is so much more. There is a level of subtly that is not often seen in horror, I for one appreciate that kind of thing. Story: unique and intriguing Acting: better than your average indie Camera-work: Simple and concise Special effects: Not many, however, I thought the demon's costumes could have been better. Especially the main bad guy. Sound and music: Top notch, very high quality sound design and a haunting score by Harry Manfredini. Lake Eerie doesn't take the viewer by the hand, it expects you to pay attention and figure out the details yourself. 9/10",
         "This was a not very pleasant surprise. I watch a lot of horror films, and I am very disappointed. A movie start was not so bad, but after a while it was getting worse and worse. As movie was going on I was getting that actors are not professionals and that they even not acting like at least in some of this kind of films. A house is great, real one for this kind of movie. But the acting is terrible. I used to watch a movie where at least main actor is a pro, but not a case to be here. So bad. Not even some real action that can convict you that it might be real. A story is not so bad, but that's all what is not bad. Waste of time and money.",
         "(Post may contain spoilers) After watching Lake Eerie a second time, some cool things were revealed to me. I enjoyed it the second time around because I was a little confused at the beginning. The layering of realities is well-done for an Indie picture. I guess not having a bigger budget limited the film's SFX and other scare tactics? But as I engaged in the deeper meaning of the story, I saw it as a metaphor for suicide. I started seeing the film more tasteful than normal horror. Subjectively, I saw Autumn and Eliza as figments of Kate's imagination and pain. At first, I tried watching the film like any other soulless horror film, but this Indie seems to be more clever than that. To me, I was touched by this...maybe it is because I have lost a loved one recently. But the simplistic complexities of this story is really quite good. One cannot try to view this like a normal horror story. It is not. There are many angry people that try to view it as such...or so I think. It is a film that needs the audience to engage their imagination and not anticipate some new CGI monster to scare them; or naked, bloody women to squander any ounce of humility in the story. I do think it has horror qualities but they seem to be undertones and distractions to a deeper meaning. I think there may even be more layers that I may have missed. But if you have ever lost someone you love more than yourself...it is Hell on Earth. And I think this is what the story tries to show in Indie fashion. No big Hollywood effects. It shows how we can create a hell for ourselves and become lost in it, while here on Earth and after we die as well. Harrison's character shows depth too, but I do not want to give too much away. For someone like me, it took a second time to watch for me to enjoy...but I truly did.",
         "A good entertaining horror movie which will keep you at the edge of your seat. The Acting, cinematography and sound was all good. The plot was unexpected and intriguing, and the nightmare scenes well done. In few parts I thought the editing and sound, could have been done better to increase realistic feel or dramatic intensity. But over all, a pleasant surprise. How anyone can rate this move a 1 or a 10 is amazing to me. If you have seen above 10 movies and this isn't the best or the worst you have seen then such ratings make no sense. This movie did what a horror movie should. It kept the suspense and surprise, caused the familiar to feel unfamiliar, had you caring about the story and people in it, and gave a good mix of peaceful & unsettling scenes to make the horror more intense, and feel realistic. Horrors are not so tough to make, but tough to make well. And this one was definitely worth watching.",
         "Wow, I'm not sure what genre this falls into but I really loved the hybrid of classic horror and modern thriller. It does a great job playing with different realms of reality and consciousness. The lead character, Kate, is played by an unknown actress, but is performed well. I wanted to follow her down the rabbit hole to see if see was losing her mind or if this was her reality. I think Lake Eerie gave a wonderfully artistic look at what it is like to grieve and be lost. It is not a film for the weak-minded or someone wanting blood, gore, excessive nudity, or other shallow tactics. I was really surprised by this film, it is not the best film ever or anything close, but it is really good for what it is, and I wanted to see it through until the end. And I really enjoyed the ending. Truly great job for an indie!"
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Savage Beast Films",
         "Solid Weld Productions"
      ],
      "summaries": ["A young widow moves into an old house on Lake Erie to recover from the sudden loss of her husband; however, she soon discovers a dark secret and that she is not alone."],
      "budget": 0
   },
   "movielensId": 161074,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-01-15",
      "dvdReleaseDate": null,
      "directors": ["Chris Majors"],
      "runtime": 104,
      "movieId": 161074,
      "title": "Lake Eerie",
      "mpaa": "NR",
      "actors": [
         "Lance Henriksen",
         "Marilyn Ghigliotti",
         "Betsy Baker",
         "Al Snow",
         "Meredith Majors",
         "Jason K Wixom",
         "Anne Leigh Cooper",
         "Chris Majors",
         "G. Larry Butler",
         "Kevin R Allen"
      ],
      "imdbMovieId": "2948078",
      "originalTitle": "Lake Eerie",
      "genres": [
         "Thriller",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["L2rMTqJNwGY"],
      "plotSummary": "A young widow moves into an old house on Lake Erie to recover from the sudden loss of her husband; however, she soon discovers a dark secret and that she is not alone.",
      "tmdbMovieId": 316268,
      "avgRating": 1.66667,
      "releaseYear": "2016",
      "numRatings": 9,
      "posterPath": "/wqsGwJSdR5X7BxfTJmCEpx0GHS9.jpg"
   }
}