{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "fandom",
         "id": 220266
      }],
      "imdb_id": "tt4976984",
      "video": false,
      "title": "Ghostheads",
      "recommendations": [
         349441,
         22241,
         268297,
         177298,
         138217,
         188532,
         83373,
         358927,
         329160,
         34219,
         290283,
         342550
      ],
      "backdrop_path": "/pgmLIHxsu5kj0kRbmXHb7AoWZWU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Narration",
               "gender": 0,
               "credit_id": "56432d79c3a36870e800181a",
               "name": "Robin Shelby",
               "profile_path": "/ciTQ1MiDxoH6cAJCkW3TQPG783L.jpg",
               "id": 1534447,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "570cdc3bc3a3684bf9002201",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Herself",
               "gender": 1,
               "credit_id": "570cdc4dc3a3684c1b002344",
               "name": "Sigourney Weaver",
               "profile_path": "/gxBIAr3CnBjkNRoPovVJCvEGqP0.jpg",
               "id": 10205,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "570cdc5b9251416cee002247",
               "name": "Ivan Reitman",
               "profile_path": "/vYT8xpWCzKZc9F02Oqihxx1GFyg.jpg",
               "id": 8858,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "570cdc67c3a3684c060026e1",
               "name": "Paul Feig",
               "profile_path": "/68XiL9p5KAKtWK9F6q435ChzpBL.jpg",
               "id": 116805,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57a184cc925141020600443f",
               "name": "Ernie Hudson",
               "profile_path": "/h6hSUIuvJEjUih3wgMqYOZhNe57.jpg",
               "id": 8874,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57a184d992514102460045a7",
               "name": "William Atherton",
               "profile_path": "/ulUP6CRnC3F6XmD3NH0AMJpVmln.jpg",
               "id": 7676,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "57a184e8c3a36868ae003f22",
               "name": "Ray Parker, Jr.",
               "profile_path": "/gRWx334Hx0qb0eiJ1Z9HAbEyJv.jpg",
               "id": 192700,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56432cbbc3a36870e3001a9a",
               "name": "Brenden Mertens",
               "profile_path": null,
               "id": 1534441,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56432cc2c3a36870d60018a0",
               "name": "Brenden Mertens",
               "profile_path": null,
               "id": 1534441,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56432ccfc3a36870db00194f",
               "name": "Brenden Mertens",
               "profile_path": null,
               "id": 1534441,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56432cdb9251410a470018e8",
               "name": "Tommy Avallone",
               "profile_path": null,
               "id": 1099836,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56432ce79251410a4100191c",
               "name": "Lee Leshen",
               "profile_path": null,
               "id": 1534443,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a8dfc27c3a368268800680d",
               "name": "Derrick Kunzer",
               "profile_path": null,
               "id": 1534445,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.818469,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 367816,
      "vote_count": 13,
      "budget": 0,
      "overview": "Ghostheads is a documentary that explores the extreme side of the Ghostbusters fandom. Join us as we travel the world meeting extreme Ghostbusters fans. Every Ghosthead is unique. Every Franchise is its own. Every pop culture fandom should learn how to give back to the community.",
      "similar": [
         91356,
         24703,
         15800,
         81899,
         160220,
         276122,
         401,
         107846,
         335984,
         75311,
         80274,
         13532,
         142988,
         97,
         692,
         45132,
         5552,
         138061,
         278468,
         271165
      ],
      "original_title": "Ghostheads",
      "runtime": 100,
      "poster_path": "/mRqTz0vthnHXrCn9uAE7kKW8sk5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-04-23",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Post Production"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brendan Mertens"],
      "runtime": 73,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4976984/",
      "coverLink": null,
      "actors": [
         "Chace Ambrose",
         "William Atherton",
         "Dan Aykroyd"
      ],
      "reviews": [
         "I knew this movie was like a Ghostbusters version of 'Heart of an Empire', but I wasn't expecting to get right-in-the-feels. As a casual fan of the franchise (and a huge Star Wars fan) it's interesting to look into a different fandom window. What makes Ghostbuster fans unique is that they put their *own* names on their uniforms, chew on that for a bit. Packed with cast and crew interviews, the weaving of the stories is handled very well. Great doc! You can keep reading this or you can just check it out for yourself on Netflix. Go on. Go see it.",
         "\"Ghostheads\" came at just the right time to show that not all \"Ghostbusters\" fans are mean Internet ragebeasts. Personally, I'd walked into this movie expecting little more than a few interviews from the original creative minds (Aykroyd, Reitman, etc.) and some images of cosplayers. And there is that, but this movie isn't set out to poke fun at those who strap on proton packs in public. This is all about how a supernatural comedy from 30 years ago can have a positive impact on people's lives - and more than that, how they can use it to promote goodness in their community. I recognized a few faces from Ghostbusters messageboards and YouTube channels, and their stories are . . . is life-affirming too strong a word? Either way, prepare to be moved. This one's got surprising depth. 8/10",
         "My girlfriend and I decided to take a chance on this movie and were pleasantly surprised! Neither of us are into Ghostbusters and found it very interesting to learn the human side of how people can become so passionate about a movie. This documentary offers a glimpse into a world I will never be apart of. The film follows several fans, some who seem to take their obsession too far and others who seem to have been saved by having something to give meaning to their lives. The stories move along at a quick pace and kept me entertained for the entire length. I highly recommend this movie to anyone that is slightly curious about what sort of person would throw on a proton pack and dedicate their life Ghostbusters.",
         "First off, if \"Sizzlegeek\" is looking for his \"true\" Ghostheads movie, he could just get off his computer and go make his own movie about these Ghostheads. Nothing is stopping him/her, so stop wasting time by writing biased reviews and go make the movie if it's that easy. Jeeze. I want to say that I cannot express enough how much I enjoyed this film! I discovered it by hearing about in on the \"Opie and Jimmy\" show and I was beyond impressed. It was executed brilliantly and there was everything...like an emotional roller coaster. There were sad parts, happy parts and I laughed a lot and enjoyed it immensely. I now have an appreciation of this group of people and will look for them at a comic con or event and go up and shake their hand. I never realized just how this movie impacted people. I have seen the original movies once or twice, but I never really gave them a second thought. I will now re-watch them with a new appreciation.",
         "It brought back so many amazing memories. I want to Thank Brendan Mertens from the bottom of my heart for spending so many countless hour on making this film. If you are a fan of the original films or new to the Ghostbuster World then is the perfect film to welcome you to the GhostBuster Family! I know some people are going to hate on this film, thinking the people in it are losers, but we have a passion, a fire that these films give us....We are a Family. It helps us through the hardest days of our lives, and this film shows the struggles we go through and what we do to overcome them. It shows our dedication to our community and Charities throughout the world.",
         "From the trailer and info dropped about this film I thought I was going to get an interesting look at how Ghostbusters fandom started, how it has evolved over the years, what it is now, where it's going... Instead, it was more of a few sob stories featuring 3 or 4 people who all, coincidentally, happen to like Ghostbusters. There was a little bit of history and relevance in there. But it seems like if they had to trim another 20 minutes off the run time, those interesting bits would be on the chopping block. This film should change it's title to something like: ∙Touched by Dan Aykroyd ∙How to Cope with Cosplay ∙Khaki Flightsuit Diaries ∙Drama and Your Inner Spengler Maybe one day will we get a true Ghostheads movie.",
         "The team behind Ghostheads definitely put a lot of their own personal time and effort into this. They really wanted to show exactly what being involved in a fandom can be all about. Knowing one of the producers from years past and his enthusiasm and passion for Ghostbusters has really shown in this documentary. Let it be known that he does not make this a self serving documentary at all, even for the amount of dedication he has to this franchise, these individuals, and this fandom. If you sit back and take this documentary for what it really is, it can show you just how anyone, from any background can get involved and create a community for themselves to foster good ideas, to help people, and let anyone be who they want to be. We are all different, and that's OK. It is communities like these that can provide us support in times we might need it the most.",
         "If you ever asked yourself \"Who are these Ghostbusters cosplayers and why do they love this movie so much?\", this surprisingly fun, positive and moving documentary explores the fandom, friendships and personal stories of the cosplayers/devotees of the classic 80s movies 'Ghostbusters' and 'Ghostbusters II' and the new reboot 'Ghostbusters (2016)'. This film is not 'Trekkies' which had attempted to make fun or laugh with the audience at the fans of the Star Trek franchise. A great tribute to the fans who commit their time, money and schedules to make people feel great in their communities. Great personal, heartwarming interviews with the fans from around the world and features interviews from the celebrities and creators of the original films. A great companion piece on Netflix to watch with the original movies and to watch before the new Ghostbusters reboot.",
         "The term Ghosthead is used for a devout fan of all things Ghostbusters. They collect every item of memorabilia, go to conventions, the set of the reboot, and each state has their own sector of Ghosthead, as depicted by the different patches that they wear. The documentary is a fascinating insight to fans who go beyond the norm to show their love for the film. And when they are on their own, in the vox pop sense of the documentary, they are genuinely interesting people....a little extreme in some instances ( I think the his name was Chace, but the guy who takes his daughter to school in the Ecto- 1), but hey, it's their passion, so who am I to judge? But the documentary takes quite an interesting term when these fans actually mix with each other. It feels that they are in competition with each other, and suddenly it doesn't seem like the fun they should be having. Their is no clear evidence by physical acts in the documentary, but there are signs of body language that states different. But the biggest reason to see this is the scene where Chace meets with Peter, the first Ghosthead, who even played an extra in Ghostbusters II. It's one of the most uncomfortable situations I've seen in recent time, and again, it's down to body language. It's clear that Chace is in awe of the first Ghosthead, and Peter looks clearly uncomfortable to be in his company. It gives the documentary a dark edge, and makes it all the more watchable. Other than that, it's your usual talking heads from stars of the original, and for once, it's genuinely interesting, and you can see the love the stars have for the film.",
         "this hard hitting doc about peoples struggles in daily life by turning to beloved franchises that makes them special just by turning up in tribute as one of their idols was heartfelt and made me very proud to help fund as for an resident of united kingdom I seen loads of hard hitting docs about peoples struggles it touches people but instead of franchises to turn for guidance we have self help focus therapy groups as for this doc it makes people from all walks of life come together in celebration and some of the stories are harrowing that this deserves an award an gem that with continue it's legacy for generations to come. 10/10 rating. frankie holtzmann smales alienbugstomperfan",
         "This provides some nice insight into the great things that the Ghostbusters community does for each other and for others. Although it focused a little too much on one individual and it would've been nicer to see more groups and members given the spotlight a bit more. I wish the moments where people talk about wives not liking it or \"needing to keep it separate\" from your wife would have ended up on the cutting room floor. I feel like one of the intentions of this documentary was to show that the \"overdoing-it nerd\" stereotype is not true, and I feel like these conversations went against that idea. Ghostheads, as a community, do great things and help others and, at least in cases I'm familiar with, our wives fully support what we do. Overall, it definitely captures the spirit of who we are and what we do and is an entertaining look at the world of Ghostheads."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Double Windsor Films",
         "Patchwork Media",
         "Don't Quit Your Day Job"
      ],
      "summaries": [
         "Ghostheads is a documentary that explores the extreme side of the Ghostbusters fandom, and looks back at the impact the franchise has had on the world over the past three decades. Through interviews with key cast and crew, including Dan Aykroyd, Ivan Reitman, Ernie Hudson and many more, as well as with Ghostbusters fans all over the world, Ghostheads presents countless humanizing stories that will connect with audiences about comradery, overcoming obstacles, and that no one should ever feel alone or isolated. Ghostheads will show what really separates a fandom from the rest. Every Ghosthead is unique. Every Franchise is its own.",
         "A look at the intense fandom for the media franchise, Ghost Busters (1984)"
      ],
      "budget": 0
   },
   "movielensId": 161298,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-04-23",
      "dvdReleaseDate": null,
      "directors": ["Brenden Mertens"],
      "runtime": 100,
      "movieId": 161298,
      "title": "Ghostheads",
      "mpaa": "",
      "actors": [
         "Robin Shelby",
         "Dan Aykroyd",
         "Sigourney Weaver",
         "Ivan Reitman",
         "Paul Feig",
         "Ernie Hudson",
         "William Atherton",
         "Ray Parker",
         " Jr."
      ],
      "imdbMovieId": "4976984",
      "originalTitle": "Ghostheads",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["sYo-_2xKwls"],
      "plotSummary": "Ghostheads is a documentary that explores the extreme side of the Ghostbusters fandom. Join us as we travel the world meeting extreme Ghostbusters fans. Every Ghosthead is unique. Every Franchise is its own. Every pop culture fandom should learn how to give back to the community.",
      "tmdbMovieId": 367816,
      "avgRating": 3.2,
      "releaseYear": "2016",
      "numRatings": 5,
      "posterPath": "/mRqTz0vthnHXrCn9uAE7kKW8sk5.jpg"
   }
}