{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "snake",
            "id": 1585
         },
         {
            "name": "pit",
            "id": 4065
         },
         {
            "name": "revitalization",
            "id": 4188
         },
         {
            "name": "descendant",
            "id": 4198
         },
         {
            "name": "count",
            "id": 6932
         },
         {
            "name": "surrealism",
            "id": 9887
         }
      ],
      "imdb_id": "tt0062235",
      "video": false,
      "title": "The Snake Pit and the Pendulum",
      "recommendations": [
         27411,
         29399,
         28673,
         80193,
         94055,
         27405,
         38824,
         37583,
         62684,
         28409,
         116445,
         27505,
         75759,
         20032,
         63317,
         84062,
         109558,
         51878,
         60949,
         86527
      ],
      "backdrop_path": "/nHkujXYpDrUNHPnCocyuZlNZYpg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roger Mont Elise",
               "gender": 2,
               "credit_id": "52fe45059251416c75048ed3",
               "name": "Lex Barker",
               "profile_path": "/zDbNsktl4Wz3chDweYn17v4fUUG.jpg",
               "id": 6102,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Baroness Lilian von Brabant",
               "gender": 1,
               "credit_id": "52fe45059251416c75048edb",
               "name": "Karin Dor",
               "profile_path": "/OKzRenG0MDFrvPDIQwzDFTATrx.jpg",
               "id": 10073,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Count Frederic Regula",
               "gender": 2,
               "credit_id": "52fe45059251416c75048ed7",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anathol",
               "gender": 2,
               "credit_id": "52fe45059251416c75048edf",
               "name": "Carl Lange",
               "profile_path": "/bK8C0Bl1Q4oBBW40Nnxq6N5cJhj.jpg",
               "id": 38124,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Babette",
               "gender": 1,
               "credit_id": "52fe45059251416c75048f19",
               "name": "Christiane Rücker",
               "profile_path": "/inrih4EpNQXgcEhvNZEztV0Okve.jpg",
               "id": 46047,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Pater Fabian",
               "gender": 2,
               "credit_id": "52fe45059251416c75048f1d",
               "name": "Vladimir Medar",
               "profile_path": "/xEeemVEaOJJTfT3dGftn6xziFSe.jpg",
               "id": 98770,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Coachman",
               "gender": 2,
               "credit_id": "52fe45059251416c75048f21",
               "name": "Dieter Eppler",
               "profile_path": null,
               "id": 26245,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75048ee5",
               "name": "Harald Reinl",
               "profile_path": "/5AUktlP3iDumjgMKz1792ByTOu2.jpg",
               "id": 33542,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75048eeb",
               "name": "Manfred R. Köhler",
               "profile_path": null,
               "id": 32121,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45059251416c75048ef7",
               "name": "Erwin Gitt",
               "profile_path": null,
               "id": 51892,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75048f09",
               "name": "Ernst W. Kalinke",
               "profile_path": null,
               "id": 19517,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45059251416c75048f0f",
               "name": "Dieter Liphardt",
               "profile_path": null,
               "id": 73068,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75048f15",
               "name": "Hermann Haller",
               "profile_path": null,
               "id": 12741,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "558b5db69251416091001325",
               "name": "Wolfgang Kühnlenz",
               "profile_path": null,
               "id": 73067,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5a3415c3c3a3680b881b8134",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5a3415e292514103361b7a45",
               "name": "Gabriel Pellon",
               "profile_path": null,
               "id": 1546258,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a3415ed925141032c1b8133",
               "name": "Rolf Zehetbauer",
               "profile_path": null,
               "id": 3771,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a3415f892514103241b1cb3",
               "name": "Gabriel Pellon",
               "profile_path": null,
               "id": 1546258,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5a341605c3a3680b8d1b3d17",
               "name": "Irms Pauli",
               "profile_path": null,
               "id": 38118,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a341611925141547502c1de",
               "name": "Gerda Bublitz",
               "profile_path": null,
               "id": 1941744,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a34161e925141547202c204",
               "name": "Erich L. Schunckel",
               "profile_path": null,
               "id": 1941745,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a3416a1925141547502c291",
               "name": "Peter Thomas",
               "profile_path": null,
               "id": 18508,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.127844,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 12602,
      "vote_count": 14,
      "budget": 0,
      "overview": "In the Olden Tymes, Count Regula is drawn and quartered for killing twelve virgins in his dungeon torture chamber. Thirty-five years later, he comes back to seek revenge on the daughter of his intended thirteenth victim and the son of his prosecutor in order to attain immortal life.",
      "similar": [
         626,
         20347,
         2265,
         32536,
         44510,
         46624,
         20122,
         68757,
         85512,
         98106,
         41077,
         44386,
         44184,
         69559,
         52205,
         94295,
         41313,
         158380,
         421003,
         392432
      ],
      "original_title": "Die Schlangengrube und das Pendel",
      "runtime": 85,
      "poster_path": "/5Q1TJBjI8dJFsJdgfTWIKdyOWWw.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": "/53JWq1rzbAXzbh1rnFo3XdqsAUh.png",
         "name": "Constantin Film Produktion",
         "id": 5755,
         "origin_country": ""
      }],
      "release_date": "1967-10-05",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "UNBELIEVABLE! Until You See It With Your Own Eyes!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harald Reinl"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Manfred R. Köhler",
         "Edgar Allan Poe"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0062235/",
      "coverLink": null,
      "actors": [
         "Lex Barker",
         "Karin Dor",
         "Christopher Lee"
      ],
      "reviews": [
         "Recently viewed this little gem as \"The Torture Chamber of Dr. sadism\". Originally released in the US and UK as \"The Blood Demon\", while it's German title was \"Die Schlangengrube und Das Pendel\". An odd film that seemed to be a sort of German take on a mixture of Bava with one of Corman's AIP Poe efforts. Count Regula (Christopher Lee) is drawn and quartered for the death of 12 maidens, but swears his revenge. 35 years later a disparate group ends up at the Counts ruined castle. The 4 travelers are Baroness Lillian (Karin Dor of Bond fame), her maid Babette, Roger (Lex Barker, former Tarzan and a huge star in Germany) and the monk Fabian (a hilarious turn from Vladimir Medar). As it turns out, Roger and the Baroness are the descendants of the folks that originally put the Count to death and he wants revenge. The crazed servant Anatol lures them to the castle and reanimates the Count. The Poe elements then come into play as Roger faces a deadly pendulum and Lillian is faced with a pit full of snakes. Do they foil the reanimated Count or meet their doom? Check this fun film out to see for yourself! I expected this to be a really bad film, but was very surprised to find that I enjoyed it tremendously. Christopher Lee's performance is all menace, but with just a smattering of black humour to keep things moving. Lex Barker, more than a decade after playing Tarzan, looks great and is a perfect heroic figure. Karin Dor is lovely and does a fair bit of over the top shrieking, but still manages to give a convincing performance. This was a whole lot of fun! A bit of dark humour, Grimm's fairytale mixed with a Mario Bava sensibility and a little Poe thrown in for good measure makes for a superior European horror flick. Hopefully a nicer print will turn up or a DVD release, as the Magnum Entertainment video that I viewed was murky, faded and very badly edited.",
         "It is fortuitous that this film has at last reached the light of day again, (via DVD) since it provides a welcome reminder of the type of Saturday matinée \"scary\" fare 1960s parents could safely drop the youngsters off to see--in some ways similar to 1962's \"The Magic Sword.\" Boasting a very \"Siegfried\" style hero in Lex Barker, a particularly comely brunette heroine, and Christopher Lee at his most cadaverously malevolent, horror fans should not be disappointed in the regulation personalities. Nor will they be disappointed in the abundance of Gothic contrivances: snakes, skulls, potions, glass coffins, razor pendulums etc. etc. And to those with questions about the logic of the narrative, don't bother with them--the rapid fire pacing won't wait for you to find an answer anyway--if nothing else this film does move! Ultimately, however, it is in the visuals that this film most impresses. Production design and color are of a very high order indeed, ranking very favorably against Jack Asher and Mario Bava, and it is impossible to believe that the previous work of these two gentlemen is not deliberately evoked here. Much could be observed in this connection, but suffice it to say that rarely has a nocturnal forest been presented more balefully, with gnarled trees juxtaposed against an ultramarine sky. Even more in its favor is the effective use of a medieval Bavarian town, whose quaint architecture seems right out of E.T.A. Hoffmann. Here is an example of location shooting that counts for something! Overall, although the credits credit Edgar Allan Poe as the basis of the story, the piece feels altogether more like a \"penny-dreadful\" hybrid pastiche of the aforementioned Hoffmann and Ludwig Tieck. Highly recommended for admirers of the genre.",
         "The Castle of the Walking Dead is the first film that I have seen directed by Harold Reinl, the filmmaker who helmed numerous 'krimi' (German-made horror-thrillers based on the works of Edgar Wallace, precursors of the Italian 'giallo'), several entries in the 'Dr. Mabuse' series, and most of the 'Karl May' westerns. If this movie is any indication, Reinl is a major talent ripe for rediscovery by fans looking for a cinema that revels in flamboyant visual pyrotechnics, rather than in quotidian literacy and a politically correct 'sensibility'. Reinl may not be Mario Bava, but his extravagantly baroque camera style is nonetheless extremely impressive. The Castle of the Walking Dead is relentlessly designed; each shot has been carefully thought out and executed to its fullest illustrative potential. Set decoration, lighting, and camera movement are all carefully integrated; there is almost no shot that is arbitrary, accidental, or unnecessary. Reinl is an obvious practitioner of the great expressionist tradition in cinema, in which the significance of each shot is determined by the director's architectural and illuminative insight, in opposition to current film dogma, in which the subordinate elements of the shot (the acting, the script) dictates its formal structure. Significantly, only Christopher Lee, a performer who, like Lugosi, his predecessor, understands the physically revelatory importance of the actor to the overall impact of a film, is able to rise to the director's challenge. The Castle of the Walking Dead is ultimately derivative, badly acted, and pointless, but, for fans of cinema, can be a joy to behold. I should note that the DVD that I watched was faded and crappy; one can only hope that in the future the rest of Reinl's output will be rediscovered and restored with the loving care that it deserves. I can't wait.",
         "Next to \"The Whip and the Body\", this has got to be Lee's weirdest movie. Lee plays Count Regula which is a very fitting name since he \"regularly\" frequents the local village & steals away young girls to his castle. He tortures them & uses their blood for his \"life elixir\". His final victim manages to escape to inform the local authorities and he is executed for his crimes (check out how its done). He manages to come back years later to exact his revenge on the descendants of his last victim & the judge/magistrate that sentenced him to death. Among the actors you've got to check out is the guy who portrays the Count's butler/servant. He's really wild. In some scenes, he actually steals the scenes from Lee!This guy takes the phrase \"loyal servant\" to a whole new level! If the average household of today had a madman like him in service, we'd all be in trouble! Lex Barker is the Count's adversary/good guy here. Sometimes Lex acts as if he's sleep-walking through his scenes. His voice also never seems to change its tone. The other performers are good. The locales are incredible. I believe this film was shot in Germany.Very beautiful & peaceful but don't be alarmed horror fans. You will love the scenery around the Count's castle. Can you picture a countryside littered with dead bodies everywhere? You will once you've seen this movie. For those of you that love a little ham in your horror, this one's for you! Its very hard to find in mainstream video stores so you may want to check the ones that cater to specialized genres. It will be worth the search.",
         "Beautifully photographed, fast-paced, unique, colorful, atmospheric and even surreal at times, this combines elements from Gothic films popular at the time (not only limited to Bava, but stretching into Roger Corman's Poe series and the Hammer costume/period horrors of the day), but somehow manages to distinguish itself entirely. Definitely not a movie to be judged on literary faithfulness (it is based - very very loosely - on Poe's 'Pit and the Pendulum'), then again it doesn't really need to be. The film open with a standard prologue where hateful-looking Satanist/sadist/scientist Count Frederic Regula (Christopher Lee) is in prison awaiting execution for killing 12 virgins and using their blood in his experiments. He has a spiked gold mask slammed onto his face by a red-hooded executioner (shades of BLACK Sunday), is dragged into a small town's city square, tied to four different horses and then drawn-and-quartered (pulled apart). Before dying, he promises to get revenge on the descendants of both the judge who sentenced him (Lex Barker, who was a big star in Germany at the time) and the woman who managed to escape from his torture chamber and warn authorities (Karin Dor, the very lovely former wife of the director). Thirty-five years later, strapping manly-man Roger Mont Elise (Lex Barker again) arrives in the same town to claim an inheritance. Said inheritance is Castle Andomai, a remote, crumbling castle far from the main town. Superstitious townspeople try to warn him not to go near the place, but he shrugs them off and decides to hire an apprehensive coachman (Dieter Eppler) to take him there. Accompanying them on the trip is a very strange priest named Father Fabian (Vladimir Medar) who claims he just needs a ride. And what a strange coach trip it turns out to be! At first, the countryside is serene and picturesque with a clear blue sky, moss-covered trees and quiet ponds. Suddenly, black-hooded men on horseback blaze the trail. They attack another coach, steal it and leave behind two female passengers; the beautiful Baroness Lilian von Brabant (Karin Dor again) and her cute blonde servant Babette (Christiane Rücker). Roger learns that Lilian is headed to the same exact location he is (she and Roger being, of course, the two descendants of the 'cursed' people from the opening segment) so he gives the two ladies a lift. And then things get really weird; almost fairy-tale like in the dark imagery. The carriage marches across a blood red sky... Every house on the way seems to have been burned to the ground... The fog grows thicker and thicker... At dark, the trees take on a sinister life of their own, with body parts protruding from the trunks, squawking ravens lining limbs and corpses hanging from the branches. It's all too much for the harried coachman, who promptly keels over from a heart attack! A strange man named Anathol (Carl Lange) also shows up long enough to kidnap the women and steal the carriage. Roger and Fabian finally come across Castle Andomai and find Lilian and Babette unharmed inside. The four then discover why it has been nicknamed \"The Bloody Castle.\" Inside is a virtual treasure trove of visual beauty and horrific set design, with prominent shades of blue, purple, green and gold in the backdrop. The art direction is exceptional. Many walls are covered with demonic, abstract paintings. Others are made entire of skulls. There are tons of secret passageways and every room is sealed off by razor sharp gates when characters enter or exit. Vultures line corridors. Many of the rooms are designed solely for torture, including one with a rack over a bed of spikes, one where the floor slowly pulls back to reveal a pit of poisonous snakes underneath and another where a huge pendulum emerges from the ceiling. All kinds of creepy crawlers (snakes, scorpions, rats, lizards, tarantulas) make appearances, and so does an undead-looking Christopher Lee again; at least long enough to explain his attempts to create a special \"life elixir\" and how he needs a virginal thirteenth victim to accomplish his goal. And Anathol, the guy who stole to coach/girls, turns up once again as Lee's ghostly accomplice. Aside from the production design, the make-up effects are also good and there are several surprising visual effects using stop-motion animation. There's also some non-obtrusive comedy elements; both dark humored and lighthearted. Former \"Tarzan\" Lex Barker's (dubbed) performance is tolerable enough, even though these romantic male leads in Gothic horrors are easily forgotten when the other crazy cats pop up. Future Bond girl Karin Dor (who'd star in Hitchcock's TOPAZ the following year) does very well as the heroine, Vladimir Medar is great comic relief and Lee does an equally fine job with limited screen time as the dour, blue-faced, cross-hating Regula. However, the movie is pretty much stolen by Carl Lange as Lee's sinister/gleefully sadistic/over-the-top sidekick. Anyway, I totally loved every second of this one. It's very underrated, has awesome sets/art direction, great cinematography, a great cast, a great score, is wonderfully atmospheric and has the best Pendulum scene of all time (much better than the one Corman's crew staged in 1961). Anyone who loves Bava, Hammer Horror, Corman's Poe flick, Gothic horrors, etc., should really enjoy it.",
         "This is an unknown surreal little masterpiece of horror! Borrowing loosely from Poe's \"The Pit and the Pendulem\", director Reinl does a masterful job of pacing and fills the screen with surreal and spine tingling images. There is atmosphere a plenty throughout the film and a sense of uneasiness. The set pieces and costumes are beautiful and are enhanced by the color filming of the movie. Christopher Lee is the rejuvenated Count Regula out to destroy the last member of one of the families that put him to death. Karin Dor is the last female member of one of the families and her blood will give the count what he needs for his \"life exlixer\". A fun and atmospheric movie that one can watch over and over again. Just beware the heavily cut video rental version and try to find the complete print.",
         "What a cool-o little flick this is! Christopher Lee is Count Regula (say that name real fast and see what it sounds like) who, at films beginning, has a spiked mask nailed to his face and is then drawn and quartered in a public square for the torture/murders of 12 virgins. 35 years later, the daughter of the woman who turned him in and the son of the man who sentenced him, are brought to an eerie castle in the deep dark woods. There's a GREAT spooky carriage ride through the creepiest forest in the world, where dead-pale bodies hang from the branches. The castle looks pretty convincing; drippy stone walls lined with human skulls and draped with cobwebs, its corridors choked with vultures. There are pits filled with poisonous snakes and hairy spiders, skeletons everywhere. A pretty blond maid is nearly impaled on a board full of spikes and The Pit and The Pendulum is re-enacted, with all of the sweaty tension of the original tale. Christopher Lee looks wonderfully terrible - a shambling, blueish corpse with a nail-hole scarred face, absolutely void of emotion as he plots his revenge against our beautiful couple. There's a lot of tension here, lots of icky-yucky moments and a genuinely creepy atmosphere that seeps into every single frame. There's also a rare, non-saccharine and totally satisfying happy ending. Don't miss this one, it's really great!",
         "My memories of seeing \"The Torture Chamber of Dr. Sadism\" as it was called on US local television in the mid Seventies date back a quarter of a century. I well remember the first time I saw the movie. I wasn't expecting anything at all special, certainly nothing as gripping and fascinating as this. The movie has a real feeling of something you would read about in a crumbling old manuscript in a deserted, dusty library. Lee is terrific as always and has a tremendous presence, even though he is only on screen for brief periods. Lex Barker is surprisingly effective as the hero, and Karin Dor is beautiful and elegant as always, as the heroine. The sets really steal the movie, though--inspired by the weird paintings of Hieronymous Bosch, they give a sense of ancient evil, laced with a perverted sort of fanciful whimsy, to the scenes in the castle.",
         "Christopher Lee is the villain of the piece in this story of a nobleman who was in league with the devil who is quartered, vowing revenge on the families of those that caused his death. Years later letters seemingly from the dead man are sent to the children of those involved asking them to come to his castle. They of course go and find their host very much alive. In all my years of watching schlocky horror films I never saw this film before and I don't know why because its a good little rainy night film. There is something fun about this film, which is not really scary, but which does keep you on the edge of your seat simply because it plays with the typical madman in a castle genre. I just had a good time watching this, and I can't say anything more about it then that.",
         "I think - and I can hardly remember, I saw this film two times and I was deeply impressed. Lex Barker as one of my favorit actors (caused by all the Karl May based movies) appeared this time in an completely other kind of motion picture. The film itself - very strange and what's really amazing is the fact that the plot begins without a long and boring introduction. Furthermore the strange \"effects\" make this peace of art very exciting. You can only love it... Robert",
         "Castle of The Walking Dead is the video version of the Constantin Film, Die Schlangengrube und das Pendel, and as such is shortened by approximately 15 minutes from the original. This film, released in 1967, is interesting for several reasons although it is certainly no classic. The careers of Lex (`Tarzan') Barker and Christopher Lee crossed briefly here and the presence of the lovely Karin Dor (wife of director Harald Reinl), whom readers may recognize from her role in the Fu Manchu films (which also starred Lee) of the same era, added a bit of grace to an otherwise grim story. Castle of . . . is an interesting mix of excellent atmosphere hampered by odd editing and sometimes laughable storyline. I was impressed by the sets and grim mood the film projected from beginning to end, and the presence of Lee makes this must see viewing for his many followers. However, this was far from his best work and one wonders if he was not overextending himself during this very busy period in his career. Set in what appears to be 17th or 18th century Germany, Count Regula (Lee) is drawn and quartered for his offenses. 35 years later, his manservant Anatole, (ably portrayed by Carl Lange) initiates a rite to bring him back to life on Good Friday. The good Count requires the blood of 13 virgins for this to be achieved and, you guessed it, Dor as Baroness Lillian Von Brabandt is to be number 13. So the countess, and Barker as Roger Montelise, son of the judge who condemned the count many years before, are duped into visiting Regula's castle. One of the few scenes in the film which combines outstanding atmosphere with sold story line comes when Montelis and his party are being coached to the castle. A very frightening and disturbing ride it was through a forest of hanging bodies and detached limbs, giving some much needed credibility to a mostly mediocre offering. At the castle, the flow of the story breaks down. Several scripting mistakes are painfully obvious. Two examples: In one scene, Anatole is shot in the chest by Roger's man and we see a small amount of dark red blood before the bullet hole supernaturally closes. A few minutes later, Anatole cuts his wrist and green blood drips to Regula's coffin. In another, it is established that the `undead', Anatole and Regula, cannot bear the presence of a Christian cross in the same room with them. Yet instead of throwing it in his face and escaping, Dor meekly obeys Anatole's harsh command to remove it from his sight! But, in the end, the good guys win, vanquishing the risen to life Regula and the evil Anatole. They are taken away by the same coach they came in on and we are led to believe they lived happily ever after. Castle of . . . will be of interest to fans of European and/or obscure horror and the previously mentioned Lee cultists. Years ago I viewed the longer version, released under the American title, The Torture Chamber of Dr. Sadism and the added 15 minutes enhances the story greatly, so find that copy if you can. Castle of . . . was another release from InterGlobal Home Video, whom collectors like me owe a huge debt to.",
         "We see Christopher Lee as Count Frederic Regula, who used the blood of 12 virgins for his experiments. He is drawn and quartered but not before swearing vengeance on the descendants of the Judge and the woman who escaped and turned him in. Now, we come some years later, Roger Mont Elise (Lex Barker) has come to claim his inheritance. He is joined on his journey by a somewhat randy priest, Father Fabian (Vladimir Medar), and a young woman, the the beautiful Baroness Lilian von Brabant (Karin Dor) and her servant Babette (Christiane Rücker). They were travelling in a separate coach that was beset upon by robbers, who took their horses. The setting near the castle is surreal, with body parts seemingly growing out of the trees. Carl Lange as the Count's servant was particularly good. Lee, himself, was particularly evil in his appearance. Karin Dor did this film the same year as she was a Bond girl in You Only Live Twice. The art direction was excellent in the castle, with many strange paintings, and the cinematography was superb. The buzzards in the castle were a nice touch, as were the scorpions and spiders and snakes. Roger's escape from the pit with the pendulum can only be described as miraculous.",
         "Just as the German krimi of the 60s proved to be a big inspiration for the Italian gialli, this film is in turn inspired by the 1960s Italian Gothic horrors (perhaps best exemplified by Mario Bava's Black Sunday). Like Black Sunday, this film concerns an executed practitioner of the black arts returning from the dead to get revenge on the descendants of those who executed them. In this case it is Christopher Lee rather than Barbara Steele, and thankfully he dubs himself. Like the films of Bava, this is filled with moody photography and baroque, Gothic visuals (such as a forest filled with corpses, a hallway lined with skulls, and walls painted with Boschean landscapes). It is difficult to judge how great the photography itself was in relation to Bava's, since the print was so poor, but the direction was definitely as competent. None of the characters were particularly interesting except for Fabian, a highwayman disguised as a priest suffering from major Falstaff syndrome. The man even resembles the Orson Welles incarnation of the character, so I can't help but wonder if it was intentional. The film is pretty entertaining for the most part, and doesn't suffer so horribly from its dubbing like many films from the period do. It is only during the pendulum sequence that I found myself getting bored. While it had not been at the time, the sequence has been done to death, and it always ends the same way: hero comes up with a clever plan and escapes just as the blade gets driven into the ground. Maybe they could've shaken things up by having the hero get sliced in two, and had the poor man's Falstaff save the day! So all in all not a particularly significant Euro-horror entry, but it benefits from some awesome visuals, one amazing character, and an occasionally effective score (though it sometimes lapses into some painfully inappropriate and thus hilarious \"happy-go-lucky\" music). Personally I'm just glad to have finally seen it after reading about it for all these years!",
         "\"Die Schlangengrube und das Pendel\" of 1967 aka. \"Castle Of The Walking Dead\" is a cheesy, but amusing little German Gothic Horror film. This was arguably made to cash in on the earlier success of Roger Corman's brilliant Poe-cycle (starring Vincent Price). And while the film is quite entertaining overall, this German Gothic attempt can in no way come anywhere near the brilliance Corman's films, or the many ingenious Italian Gothic masterpieces and British Hammer flicks that were made in the 60s. While this has a partly nice atmosphere, and, most memorably, the great Christopher Lee (who sadly has way too little screen time) as the villain, it is sadly less stylish, and incomparably tamer and more well-behaved than its Italian, British or American counterparts. While the film does occasionally build up a mood, it lacks aspects such the macabre touch of the Corman films or the nastiness of Italian Gothic gems. This is not to say, of course, that the film is a complete waste. On the contrary, it is pure camp fun which I highly recommend to any of my fellow Gothic Horror fanatics. The cruel count Regula (Christopher Lee) is drawn and quartered for tormenting twelve virgins to death at his castle. Thirty-five years later, Roger von Marienberg (Lex Barker) and Lilian Von Brabant (Karin Dor) are invited to the count's castle. The two are the spitting image of the judge who sentenced the count to death (Barker), and the count's only surviving victim (Dor)... The film is very loosely based on Edgar Allan Poe's short story \"The Pit And The Pendulum\". Roger Corman had made a film based on the story in 1961, namely the brilliant \"The Pit And The Pendulum\" starring Vincent Price (my favorite actor) and Barbara Steele (my favorite actress), which became one of the greatest Gothic masterpieces ever in cinema. \"Die Schlangengrube und das Pendel\" (which translates \"The Snakepit And The Pendulum\" - also the German title of Poe's short-story) is, of course, no masterpiece of the kind. Harald Reinl, who is mainly known for Edgar Wallace films, the naive German Karl May Westerns and his interpretation of the Nibelungs, was no Roger Corman. Lex Barker was certainly no Vincent Price, and while Karin Dor is certainly no Barbara Steele either, she is still beautiful enough to make this film worthwhile. The film's greatest quality is, of course, the great Christopher Lee (another favorite actor of mine), who plays the sardonic villain. Sadly, he has far too little screen time. The overacting Carl Lange also fits in his role of the evil count's sidekick. This one's negative aspects lie mainly in its (very German) harmlessness, and partly also in the censorship, which was stricter in Germany at the time (green blood? - you gotta be kidding me). Yet it is an amusing film which may be highly entertaining to some of my fellow Gothic Horror lovers. Just make sure to watch all the Gothic masterpieces from Mario Bava, Antonio Margheriti, Roger Corman, the Hammer Studios, etc. before giving this a try.",
         "When I was a kid, I tried watching THE TORTURE CHAMBER OF DR. SADISM (one of MANY alternate titles for this movie). However, I never got past about the first half of the film--it scared me do much I turned the TV off and spent the rest of the night worrying. And for 35 years I've wondered if the movie was really THAT scary or was I just a wimpy kid. Well, after finally getting a copy of the DVD, I realized that most any kid would indeed be scared watching this Gothic horror flick. That's because the atmosphere in the film is truly horrific--with more disturbing images that you'd find in three or four horror films. And, although the film stars Christopher Lee and Lex Barker, it is not a Hammer Film and is much more visually disturbing than any of their movies. The film begins with Christopher Lee being condemned to death for the murder of 12 virgins. Due to the number of victims, he is ordered to be drawn and quartered. While not all of this is shown, enough is that it might be a bit of a shock. Years pass and the memory of this maniac pass as well. Now 35 years later (hmm...the same length of time since I was first traumatized by the movie), the townspeople have only a dim memory of him or his horrors. When Lex Barker arrives in town, he is told that he needs to meet a Count Regula at his castle but no one seems to remember him or the castle--even though he was the guy drawn and quartered decades earlier. Finally, Barker is able to find a priest who knows where the Count's castle is and the two of them set off for the meeting. On the way, they pass through countryside that SHOULD have warned them to go back--especially when the woods near the castle is littered with body parts and people who had been hung. Obviously, the Count is no saint!! Why they didn't go back is beyond me!! Whatever the Count needs to tell him, it certainly isn't worth continuing the journey! However, Barker and the priest are apparently idiots, so they continue. On the way, they meet up with another carriage which contains a couple nice looking young ladies (one of which looked a lot like Barbara Steele, a famous Gothic horror star of the age). Unfortunately, the ladies are soon kidnapped and it's up to the two men to continue the journey and save the damsels. Once at the castle, the place looks much more like a twisted torture chamber than a castle. A drawbridge with knives protruding from it, paintings on the walls inspired by paintings by Hieronymous Bosch, trap doors, sick torture devices and dead bodies litter the place and this is not a segment for the squeamish. How as a kid I was able to watch this much is amazing, as it looks like the interior decorating was done by the Marquis de Sade and Satan! A zombie-like servant appears and announces that the Count is dead but will be coming back to life that night to meet his guests. Wow--now THAT'S going all out for company! And so in a sick little ceremony, the zombie-servant cuts his wrists and green blood pours from his veins--all over the glass coffin containing the dismembered Count. At this point, the arms and legs all reattach and the guy wakes up--and that is when 35 years ago I turned off the film!!! As far as ambiance go, you can't get much scarier than this very disturbing film and the movie had a nice look--even though the DVD print was awful. While audiences in the 21st century might laugh at it a bit, back in 1967, this was quite a shocker. Skulls, corpses, vultures picking apart bodies, etc.--it's all very graphic and intense. And as for the town in the first portion of the movie, it looked very old and authentic--having been filmed in the town of Rothenburg, Germany. I've visited this very quaint town and quickly recognized the buildings. The acting, despite being a very international film is just fine. Most of the actors originally spoke German and I know that Barker was fluent in the language as well. I don't know if Lee spoke German as well, but in the American print he and Barker are not dubbed--they speak English. As for the plot, up until the very end the movie was well done. Not exactly deep, but very well done. The various graphic images and plot devices really were effective. It's just that the end occurred so quickly and almost randomly--leaving you feeling like they just threw a cheap ending on the film because they were running out of film! While not a bad ending, it was the weakest part of the film. Overall, this is a scare the pants off you type of film. Not especially deep, it still will have you on the seat of your pants and amazed at the brutality of the evil Regula and his henchman. FYI--In addition to being a very bad print, the film also was not captioned or closed captioned--something that might have been helpful.",
         "A strange West German reworking of the classic Edgar Allan Poe tale The Pit And The Pendulum. Already filmed by Roger Corman in 1961 with Vincent Price in the lead role, the Germans - with their infinitely subtle touch - throw almost every possible horror cliché into the mix. The result is a virtual smörgåsbord of unearthly delights, presided over by veteran horror actor Christopher Lee who, by playing the bloodless Count, seems to be having a leisurely walk through the Black Forest, having spent almost as much of the Sixties in Continental potboilers as he did in their British counterparts. Looking even more pale and cadaverous than his Dracula appearances, Lee plays Count Regula, a creature of pure evil sentenced to be drawn and quartered whilst wearing a spiked mask (trust Teutonic sadism to add a generous amount of Bava's Black Sunday). Before he expires, he curses the Judge (American B-actor Lex Barker) and his entire Von Marienberg family; thirty five years later his estranged son Roger (also played by) is summoned to Regula's now ruined castle, along with Lillian, the daughter of the woman who framed him (striking German actress Karin Dor, also a Bond villainess in You Only Live Twice the same year). Their carriage passes through some genuine old German towns (complete with authentically craggy townsfolk) and into a hostile and increasingly surreal landscape - bodies hang from trees with severed arms for branches - towards a castle crawling with vultures and every other possible harbinger of doom, not to mention a resurrected Regula and the bodies of the twelve bodies of the virgins he sacrificed to perfect the elixir of eternal life. Lillian, it seems, is the thirteenth and final virgin (..?), while Roger is destined to be the end of the family line, strapped under a ghastly pendulum in a torture chamber covered in what looks a Brughel mural of A Clockwork Orange. Lee is superb as always, even sleepwalking through these zombie Count roles, and the art direction in the cobweb-covered catacombs brings a dry tickle to the throat. It's not classic Poe by any stretch, but then every Corman adaptation with Vincent Price had the unmistakable aroma of ham, and the Germans really know what to do with their pork products. So.let's go down the basement to see what the Swinging Sixties has to offer - possibly a bloody big pendulum blade, that is, swinging on the end of a chain. Sweet dreams sinners,as we enter The Torture Chamber Of Dr Sadism. Roger: So these are the 12 murdered girls? Servant: Yes. But that's no reason why you shouldn't make yourselves at home.",
         "I have the Aikman Archives 2003 DVD release which has a quoted running time of 81 minutes, but I do not know if it is uncut. It says that it is digitally remastered... but that is a pretense only. The opening scenes have some severe film scratches on it, and minor scratching is visible in many later scenes, although the color is not too bad. The charm of this film is obviously the sets and general creepiness. Story wise, it is typical of the \"Revenge\" and \"Curse\" plot lines in horror movies, but adds a few twists to make it a little more bizarre. It's mostly a vehicle for the well-realized castle and torture chambers. Huge Hieronymus Bosch paintings dominate the walls while trained vultures greedily peck at bloody leftovers. Corpses hang along dimly viewed roadside trees; and with every move a spiked portcullis or oaken door closes behind the protagonists sealing their passage. With a more coherent plot and more subtle and cohesive dialog and editing this would have been more than a \"B\" movie. To me, it lacks some measure of suspense, although the torture chamber sequences aren't too bad. Christopher Lee needed more screen time and better lines, and Lex Barker could have been replaced with Ron Ely or Gordon Scott (my favorite Tarzans).",
         "This \"Castle of the Walking Dead\" contains – hands down – one of THE creepiest sequences I've ever seen. A carriage with four people inside is on its way to a sinister castle with a dark past when suddenly the driver notices they're going through a woods where there's a dead body hanging from nearly every three! The sight of and atmosphere during this particular sequences is truly horrific. In fact, the entire film somewhat relies on powerful isolated sequences of the macabre, as the story itself is quite familiar and routine Gothic stuff. \"Castle of the Walking Dead\" is another loose adaptation of Edgar Allen Poe's legendary tale \"The Pit and the Pendulum\"; which also already existed in a version directed by Roger Corman and starring Vincent Price. The film gives top-billing to veteran actor Christopher Lee, but apart from the intro sequence and the exquisite finale, his role isn't too extended. Lee plays the malicious and murderous Count Regula, who gets quartered for the all the vicious crimes he committed, but of course not before placing a curse on the judge who pronounced the death sentence and the last female victim who managed to escape and get him arrested. 35 years later, their unaware relatives are lured to the castle where the score shall be settled once and for all. I'm a big fan of Gothic horror and, generally speaking, rather forgiving when there are shortcomings. That's why I'm still very fond of \"Castle of the Walking Dead\" even though it definitely could have been even better. Many isolated sequences are terrific, but the wholesome is a bit incoherent. Once the almighty Christopher Lee is resurrected again, the quality level of the film rises again. His character is masterfully malevolent (another evil count consuming the blood of virgins to gain eternal life) and this great actor's natural horror charisma already delivers half of the powerful impact. The scene with the giant pendulum remains a brilliant highlight, regardless of how many times you've seen this before in other films. The titular castle is like a theme park full of wondrously sinister Gothic attractions. It even has vultures patiently waiting outside of the pendulum room!",
         "Sadistic Satanist Count Frederic Regula (a wonderfully wicked portrayal by the great Christopher Lee) gets drawn and quartered after he murders twelve virgins in an attempt to gain immortality. Thirty-five years later Regula comes back to nefarious life so he can exact a harsh revenge on Roger von Marienberg (the handsome Lex Barker) and Baroness Lillian Von Brabant (gorgeous brunette Karin Dor), who are the direct descendants of Regula's executioners. Crafty priest Peter Fabian (a delightfully robust Vladimir Medar) and servant girl Babette (cute blonde Christiane Rucker) also find themselves in considerable jeopardy. Evil butler Anathol (a deliciously creepy Carl Lange) assists Rugula's cruel plans for the unlucky quartet when they seek refuge in his moldy and remote castle. Director Harold Reinl keeps the pace swift and unflagging throughout. Reinl in addition expertly creates a bleak, brooding and supremely eerie atmosphere as well. The grimly serious tone and several jolting shock set pieces likewise hit the satisfying spot. The rich, vibrant and agile cinematography by Ernst W. Kalinke and Dieter Liphardt offers a wealth of nifty visuals (the desolate foggy countryside littered with corpses and body parts hanging from trees is an especially startling image). Peter Thomas' groovy lounge music score makes the grade, too. The amazingly gloomy'n'grimy castle sets are simply stupendous. All in all, this baby sizes up as a perfectly spooky and flesh-crawling period Gothic horror treat.",
         "the version of this movie that i saw was so heavily edited and dubbed that it takes away from the movie. however, the movie still managed to entertain me tremendously. there are wonderful sets (the hall of skulls, the endless castle corridors, the on location villages, and the forest) and striking uses of color. There are some really tense scenes (the snake pit) and some haunting images (the hanging corpses). however, with so much editing and poor dubbing, most of the story gets lost. granted i was presented with the really interesting parts, the story was never boring, but i felt we needed a bit more exposition. other than that, the only gripes i have with the movie is the lack of explanations. i got the impression while the coachman was driving he was only imagining the bodies in the trees and the corpses on the road, because he doesn't get scared until he sees....three black crows. But the movie doesn't bother to tell us that. The other problem i have is with the black riders. were they the guys who were hanging later on? this is never explained either. And then there is the lack of good special effects. I said before the snake pit scene was tense, and yes it is, noone wants her to fall, but the pit has about five or six black snakes in it. better effects would have had the entire pit swarming with hundreds of different snakes. and the laboratory scene was pretty cheesey too, just various liquids bubbling and steaming. all negative points aside this movie is really really entertaining. like i said, it is never boring. the reviewers who compared it to bava are correct, it is very similar to his style. the other reviewer who said the movie feels evil was also correct. the entire movie seems to have been shot in hell. and perhaps that is what this movie is all about, hell, or nightmares. when the movie is over, i was left with questions, but i was still pleased. i can only imagine what the uncut original is like. Anchor Bay, if you are reading, this is a prime candidate for you!",
         "I have written elsewhere about my longtime love for redheaded Italian actress Lucianna Paluzzi, who captivated this viewer back in 1965 by dint of her portrayal of S.P.E.C.T.R.E. agent Fiona Volpe in the James Bond outing \"Thunderball.\" Two years later, another redheaded S.P.E.C.T.R.E. agent also caught my fancy: Helga Brandt, Agent No. 11, in the Bond blowout \"You Only Live Twice.\" Brought to indelible life by German actress Karin Dor, she remains, 45 years later, one of the sexiest of the Bond \"bad girls,\" and her death in archvillain Blofeld's piranha pool is a 007 classic. Well, despite admiring Dor's performance in this film dozens of times over the years, I have been hard pressed to see her in anything else, other than Alfred Hitchcock's 1969 film \"Topaz,\" in which she plays Juanita de Cordoba, the widow of a Cuban revolutionary...and a brunette, to boot. A happy day for me, then, when I found a DVD containing Dor's next film after \"You Only Live Twice,\" 1967's \"Torture Chamber of Dr. Sadism.\" This German production opens with a scene strongly reminiscent of one to be found in Mario Bava's 1960 classic \"Black Sunday,\" with the Count Regula (played by Mr. Tall, Dark and Gruesome himself, Christopher Lee) getting a spike-studded demon mask impaled into his face, prior to being drawn and quartered. (Barbara Steele, in the Bava film, had had a similar mask sledgehammered into her face before being burned at the stake.) Regula, it seems, had been convicted of slaying 12 virginal girls for their blood, with which he'd hoped to concoct an immortality potion, and before his sentence is carried out, he swears to take vengeance on his accusers. Flash forward 35 years, and hunky dude Roger Mont Elise (Rex Barker) and the Baroness Lilian von Brabant (our Karin, 29 years old here), strangers to one another, meet on the road en route to the Count's castle, to which they have both been mysteriously summoned.... \"Torture Chamber of Dr. Sadism\" originally appeared under the title \"Die Schlangengrube und das Pendel,\" or \"The Snake Pit and the Pendulum,\" and as the film's credits DO reveal, it was (very) loosely based on Edgar Allan Poe's 1842 story \"The Pit and the Pendulum.\" It is a remarkable film in many ways, but perhaps most especially for its incredible art direction and set design. The 19th century villages in the film's opening sequences look absolutely authentic, and Regula's castle is a thing of ghastly and dreary beauty. Frescoes from Hieronymus Bosch's \"The Garden of Earthly Delights\" decorate its walls, weird sculptures are placed everywhere, a corridor of skulls adds an aura of even greater menace, while vultures, scorpions and tarantulas flap and scurry about in abundance. It is all a total triumph for set decorator Gabriel Pellon. Even more remarkable, perhaps, is the dreamlike, surreal carriage ride through a nighttime forest before the castle is even reached. Arms and torsos of naked mannequins sprout from the surrounding trees, while hundreds of figures hang in effigy from the limbs in the fog-shrouded moonlight. Kudos to Austrian director Harald Reinl for bringing this sequence home in such an effective manner. (Reinl, it might be added, had been married to Karin since 1954 despite being 30 years her senior, and would divorce Karin the following year. As it turns out, he should have stuck with her, as he was ultimately stabbed to death by his later wife in 1986!) The picture, true to its title, features several sequences of startling torture; nothing like what is to be found today in films such as \"Saw,\" but rather torture that is, uh, fun to watch. In one scene, Lilian's maid, Babette, is suspended over a bed of knives; in another, Mont Elise is strapped under a razor-edged, swinging pendulum in a rat-infested dungeon; and in still another, Lilian stands on a slowly retracting ledge above the titular snake pit (and a high fall into a nest of vipers would certainly be as bad as being dunked into a piranha pool!). Great, ghoulish fun! Barker and Dor, it must be said, play their parts absolutely straight, and make for a very handsome couple, ultimately. As for Lee, well, he is absent, after that grisly opening scene, for the next hour or so, but his resurrection and gray-visaged, corpselike appearance should certainly linger in the viewer's memory. Some other items to enjoy in this truly outrageous film: the sometimes jazzy, sometimes outre, sometimes goofy/non sequitur music provided by Peter Thomas; the deliciously evil performance by Carl Lange as Regula's assistant, Anatol; and still another tasty performance, that of Vladimir Medar, as the jovial \"Father\" Fabian. For this viewer, however, seeing Karin Dor in one of her difficult-to-see film appearances was worth the price of admission alone. And even more good news for me: I have just learned that a 1963 Dor picture, \"The Strangler of Blackmoor Castle\" (also directed by Harald Reinl), has finally made it to DVD. Guess I'll be heading in that direction soon....",
         "Excellent little German-made Gothic thriller about an evil count returning from the dead to exact vengeance on the descendants of his persecutors and executioners. The film is a cross between \"Dracula\" and \"The Pit and the Pendulum,\" with a pinch of \"Black Sunday\" thrown in for good measure. Beautifully photographed with the most amazing set design and production values, but haphazardly dubbed and the music is atrocious, more befitting a beach party flick. Christopher Lee is the undead count. Lex Barker of Tarzan fame plays the hero and a beautiful German actress named Karin Dor is the love interest. She looks like a cross between Barbara Parkins and Barbara Steele. I don't know if there were any actual torture scenes in the original. The version I saw had none, which is to say no one is shown dying in agony. Lee is the main reason for watching this forgotten gem, although he is only in the movie briefly.",
         "\"Torture Chamber Of Dr Sadism\", \"Castle Of The Walking Dead\", \"Snake Pit and The Pendulum\", \"Blood Of The Virgins\" - all lurid titles given to this Euro Horror that conjure up ghastly images which this film readily delivers upon but does not exceed. Sumptuous on location shots from Rothenburg, a haunted forest with trees sprouting decaying bodies and limbs, a medieval castle replete with endless catacombs and creepy dungeons - all filmed in garish lascivious colors - is sure to be a feast for the eyes for any lover of these \"Hammer\" style horror films. This creepy-cartoon-come-to-life sports two leads (Lex Barker and Kristin Dor) who are as stunning looking as their surroundings and just as inanimate. They seem to just walk through the horror with very little effect. And the plot - well, it isn't really a plot, but rather a few different events taking place. After the conventional, but always enjoyable, beginning involving Christopher Lee being declared a witch, sentenced to death for his crimes and swearing out revenge upon the descendants of his perpetrators, the first third is our characters traveling to the castle, the second third is our characters exploring the castle and the final third is Christopher Lee's reappearance and avengement. Still, this one is highly recommended viewing for lovers of these cool Euro Gothic horrors. Casual viewers, non-genre addicts or those requiring a plot may grow bored with this style over substance effort. But, oh...what style it has!",
         "\"The Torture Chamber of Dr.Sadism\" was loosely inspired by Poe's famous story 'Pit and the Pendulum'.It opens with Count Regula(Christopher Lee)being executed for twelve virgin killings.Before his execution he declares revenge from beyond the grave on the magistrate who sentenced him and all his descendants.A lawyer played by Lex Barker is invited to the castle of Count Regula,the one whose name is feared.The Baroness' letter suggests she'll be getting some kind of inheritance while the orphaned Mont Elise is promised information about his mysterious childhood.The long journey to the castle is dangerous and spooky.The haunted forest of human limbs and hanging people is memorably eerie.Upon arriving at the castle they find themselves at the mercy of a re-animated Count Regula and his invulnerable servant Anatol.Vastly entertaining Gothic horror with paper-thin plot.The castle itself is filled with vultures,cobwebs,dangerous traps,snake pits,torture devices and a pit and pendulum.The soundtrack is pretty inappropriate,but the film is surprisingly atmospheric and spooky.8 out of 10."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["Constantin Film"],
      "summaries": ["In the Olden Tymes, Count Regula is drawn and quartered for killing twelve virgins in his dungeon torture chamber. Thirty-five years later, he comes back to seek revenge on the daughter of his intended thirteenth victim and the son of his prosecutor in order to attain immortal life."],
      "budget": 0
   },
   "movielensId": 161444,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1967-10-05",
      "dvdReleaseDate": null,
      "directors": ["Harald Reinl"],
      "runtime": 85,
      "movieId": 161444,
      "title": "The Snake Pit and the Pendulum",
      "mpaa": "",
      "actors": [
         "Lex Barker",
         "Karin Dor",
         "Christopher Lee",
         "Carl Lange",
         "Christiane Rücker",
         "Vladimir Medar",
         "Dieter Eppler"
      ],
      "imdbMovieId": "0062235",
      "originalTitle": "Die Schlangengrube und das Pendel",
      "genres": [
         "Mystery",
         "Horror",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the Olden Tymes, Count Regula is drawn and quartered for killing twelve virgins in his dungeon torture chamber. Thirty-five years later, he comes back to seek revenge on the daughter of his intended thirteenth victim and the son of his prosecutor in order to attain immortal life.",
      "tmdbMovieId": 12602,
      "avgRating": 3.16667,
      "releaseYear": "1967",
      "numRatings": 3,
      "posterPath": "/5Q1TJBjI8dJFsJdgfTWIKdyOWWw.jpg"
   }
}