{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "based on novel",
         "id": 818
      }],
      "imdb_id": "tt0159914",
      "video": false,
      "title": "Soul Music",
      "recommendations": [20934],
      "backdrop_path": "/j3vCmGPO1FXLVAEG9fXFT33nyhI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Death (voice)",
               "gender": 2,
               "credit_id": "52fe47869251416c7509c95f",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mustrum Ridcully (voice)",
               "gender": 2,
               "credit_id": "52fe47869251416c7509c96f",
               "name": "Graham Crowden",
               "profile_path": "/wyGg5BXqE1N8oG1Ag82I3yHYQdW.jpg",
               "id": 10654,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Imp y Celyn (voice)",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c973",
               "name": "Andy Hockley",
               "profile_path": null,
               "id": 219741,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Susan Sto Helit (voice)",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c977",
               "name": "Debra Gillett",
               "profile_path": null,
               "id": 141946,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mort (voice)",
               "gender": 2,
               "credit_id": "52fe47869251416c7509c97b",
               "name": "Neil Morrissey",
               "profile_path": "/m4JIPGagmc0c6Psk2a2TdRHdskX.jpg",
               "id": 26862,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Asphalt (voice)",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c97f",
               "name": "Bernard Wrigley",
               "profile_path": "/ymAtIv3TR2uDoHBsp8f9USbJj3Y.jpg",
               "id": 1121491,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Albert (voice)",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c983",
               "name": "Bryan Pringle",
               "profile_path": "/z4mTyXKpKvR8Ek1VawFKCncTWud.jpg",
               "id": 22171,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47869251416c7509c965",
               "name": "Jean Flynn",
               "profile_path": null,
               "id": 1121490,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47869251416c7509c96b",
               "name": "Terry Pratchett",
               "profile_path": "/6zmAMtmgr0wEx7fBX5qWLDmCUPD.jpg",
               "id": 95903,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.874198,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 18560,
      "vote_count": 7,
      "budget": 0,
      "overview": "The young druid Imp y Celyn comes to Ankh-Morpork to become a famous musician, but a new guitar from a mysterious shop possesses him with a new kind of music - the Music with Rocks In. To make matters worse, Death, saddened by the death of his adopted daughter, has gone away to try and forget, and his granddaughter Susan suddenly has the family duty passed on to her.",
      "similar": [
         449176,
         336843,
         281957,
         101299,
         49529,
         6114,
         392044,
         11224,
         13,
         278927,
         193893,
         11931,
         38117,
         2486,
         342878,
         133805,
         22971,
         1586,
         4771,
         2048
      ],
      "original_title": "Soul Music",
      "runtime": 159,
      "poster_path": "/fN4gzy9qKil7SzwzHUJ6XeSirHe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-05-12",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/x1xgpkM4CBIQgGEVy6TTyf9KOke.jpg",
         "name": "The Discworld Collection",
         "id": 108502,
         "poster_path": "/3eGJF4MICUu9KJ7TcEQxjb10YrI.jpg"
      },
      "tagline": "A story of reality, fantasy and the bits in the middle",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 172,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0159914/",
      "coverLink": null,
      "actors": [
         "Christopher Lee",
         "Graham Crowden",
         "Debra Gillett"
      ],
      "reviews": [
         "After stumbling across Pratchett completely by accident two years ago (\"Sourcery\" was my first book), I underwent a 5-month long intensive crash course in getting *anything* discworld that I could get my hands on. This was quite a feat, as not all the books were published in America at that time. Once I got all the books, my fervor diminished to an extent, but it was still enough to inspire me to actually *buy* both the Soul Music and Wyrd Sister's DVDs. I was hesistant to watch Soul Music for fear that it would destroy my mental image of my favorite Pratchett book. But between the two, Soul Music does a better job of adapting the book and pacing the jokes. I felt that Wyrd Sisters was a little too rushed, and some jokes were even mumbled at points. Soul Music favored pacing over cramming in every little detail. (My favorite part is probably the scene where Death is talking with the guru-guy on the mountain and they're arguing about the color of the infinite.) The musical numbers were quite entertaining as well, and I loved how each of the tour concerts they did had a specific parody theme. The casting was good and bad. Susan was good, the Band members were good, though I do agree that the Dean and Quoth the raven grated on my nerves very quickly. Christopher Lee as Death totally made up for any poor jobs in casting, and in fact it was these movies that introduced me to Lee and made me realize how cool he is. And suuure, the animation is, frankly, weak-sauce. However, though I enjoy artful quality as much as the next guy, you don't need eye-candy to tell a good story.",
         "It is said that no movie may ever surpass the book it was adapted from. It's wrong. Although it is completely incorrect to say that Soul Music, the animated film (or series, depends on how you watch it. :)) is better than the book, because they are two completely different kinds of media, Soul Music managed to capture a deep essense in the book and give it life. The result - a movie filled with humor and fun, with the sort of fiction you can only bring to life with animation. If you see the movie after reading the book, unlike with other book-based movies, you will most certainly not be disappointed, because since Pratchett himself helped direct the movie, he managed to recreate the Discworld down to the tiniest detail just the same way he did in the books.",
         "I have to say, when I heard about this movie I searched and searched and finaly asked my parents to search (they were far more successful) and so after 2 years of fruitless searching, Happy 19th Birthday Heather! It was fantastic. Even thought I think they got a couple of the characters wrong (Like the Dean- I like Paul Kidby's version better)and that the Raven was just damn annoying, I still really enjoyed this film. Christopher Lee is the only one who could do Death's voice (besides James Earl Jones)and they have managed to include most of the best parts from the book. Plus I really like The \"we're bigger that cheeses\" line (an nice nod to John Lennon). However, you can't say that it is better than the book because really it is almost impossible to be better than the original work. But even though this is true, it is still really good in its own way. It's a little strange in parts, but hey, so's the book. I have to say that my favourite part of the movie was Glod. He was done really well and got to keep all of his cynical, witty one-liners. The only thing I have to ask is how many letters they got about the blatent ethnic-steriotyping (and if you've seen it you'll know what I mean)? Even so, I recommend this movie to Discworl fans and non Discworld fans alike (although if you're not a Discworld fan and live outside the UK I'll be very surprised if you've even heard of it).",
         "One of the rare films I've seen which really does justice to the book upon which it was based. 'Soul Music' is particularly suited to a small-screen transfer, and much time and effort has obviously been lavished on this production. A great, funny, intelligent film. Don't miss this one.",
         "I actually thought that the movie was pretty good. I didn't notice the looped animations that several people have mentioned and the animation itself was pretty good for what is essentially a low-budget production (probably due to it being a relative unknown in terms of success). A lot of my favorite jokes were in. Of course not all of them could make it, but it was still pretty good at conveying the weirdness and dry sense of humor that the book possesses, especially about the music industry. I would ordinarily give this movie (or series, however you want to put it) a seven. It has decent animation, the voices are well done in some places and adequately done (at best) in others, but the soundtrack made all the difference. The soundtrack is a work of art. I only wish that they had included the full length songs on the DVD. The parodies are excellently done, with Elvis, Jerry Lee Lewis, the Beatles, the Blues Brothers, 60's flower power, Jimi Hendrix, and Van Halen-like songs all being represented. The songs are all masterfully done. Terry Pratchett himself said that he wanted a copy of the soundtrack. All in all, a decent recreation of the book with a 10-star soundtrack. If someone could post in the forum on whether or not a soundtrack CD was made (and where to get it), I and many others would be grateful.",
         "I watched the videos all the way through, and somehow I feel them to be an embarrassment to the books - I found the animation to be a bit crude, and not as I had imagined the scenarios. But of course, it's impossible to make an animated film that's totally accurate, as everyone's view of the Discworld and the characters who people it is entirely different, and nothing could capture the humor in the narrative of DW books. The animated version of Soul Music is something to watch once if you like Terry Pratchett, but I don't think I'll be watching it again. Long live Great A'Tuin!",
         "First of all, I would like to say that I have not YET read the book when I first saw this, simply because I had never even heard of Discworld (besides seeing some of books around here and there). I've read quite a few complaints about the animation technique used in this film. I personally think it's great! It somehow fits excellently together with the weird and unique universe that the Discworld is. Although, I gotta agree that the use of recycled characters (such as the maids at the Unseen University) could have been done better. Just like they shouldn't have looped scenes etc. But these small \"flaws\" doesn't even come near into ruining this great series. The story is interesting, though I gotta say that I enjoyed the scenes with the band, more than with Susan. There's no doubt that most of the voice talents are excellent, even for some of the minor characters. Such as the wannabe \"Music With Rocks In\" band and the long haired assisant at the Unseen University. The music is nicely made too, and it's funny to listen to how it starts with Elvis type music, moves up to Jerry Lee Lewis, then The Beatles, heads into Jimi Hendrix and ends with a Van Halen 80's style rock.",
         "Death, with capital D, comes to a turning point on his existence. He's adopted daughter and her husband die in a cart accident. Death begins to wonder what is this all about. How do people forget? So, as Death starts to prowl around the Disc someone has to carry on the business. Only one fitting the bill is Susan, niece of Death. And she's not very keen to carry on the family business. At the same time young bard gets possessed by the Soul of Music. He begins to live for music. And Susan has to do something about this before all is too late. In \"Soul Music\" everything is little bit better that it was in \"Wyrd Sisters\". Animation is a bit smoother, music is helluva lot better with a parodied touch of rock'n'roll music. All in all \"Soul Music\" is much more solid piece of work than the first Discworld movie \"Wyrd Sisters\" As it has been some time since I've read the book itself, I cannot say how closely the movie follows the main plot of the book, but as it was with \"Wyrd Sister\" I recall that \"Soul Music\" is pretty much straight forwarded take from the book with out any additions or major changes, so fans of the series should feel comfortable with this movie. Atmosphere is just correct and places, especially Ankh-morpork looks absolutely correct. Voice acting is as solid as it was on the first movie, with great Christopher Lee doing a fine job as Death. All in all I can give \"Soul Music\" a solid number of 8",
         "In many ways this Discworld cartoon is perfect -- for example, who else could play Death but Christopher Lee? And the soundtrack, which charts the history of rock n' roll from Elvis, through the beatles and psychodelic rock as 'Music With Rocks In' is introduced to the Discworld, is simply brilliant. But there are times when it just fails to capture the same atmosphere and intelligence that is present in Pratchett's writing. Maybe someday soon a film with be made, after the success of Lord of the Rings, and particularly if the upcoming Hitchhiker's Guide to the Galaxy movie is successful. And cast Christopher Lee as Death!!!",
         "Well I WAS! The book is FAR superior!!! The series is more like a children's comic. ´The animation was shoddy, and a lot of the voice acting sounded forced. The only real laugh I got was when Death speeds toward a cliff edge and shouts: \"Oh, BUGGER!\" Christopher Lee (Death) was the only really good actor. His voice is as close as a mortal can get. On a brighter note: The music was very good indeed. Especially the sixties, hippie track.",
         "Let's face it; the Discworld novels are rather uneven. The first three are barely worth bothering with. But then, Pratchett produced a novel, Mort, that was dangerously close to literature. Mort went on to be a stage play, and Pratchett went on to write other things. It took four years to get back to the Mort storyline with Reaper Man in 1991, and another three years to continue the story in Soul Music in 1994. Having read all the Discworld books so far, I still think Soul Music is my favorite. Having played in a band myself, I could appreciate the musical in-jokes better than most. Imagine my surprise when a friend mentions casually that Soul Music was an animated feature and he had the DVD. A trade was arranged (one of my Bubblegum Crisis volumes) and I settled down to watch my favorite Discworld novel transformed into a movie. So how was it? Oh, pretty good as a whole. After a stunning CGI opening which takes us on a quick tour of the Discworld, the film settles down to conventional animation with an occasional computer assist. My friend describes the animation as \"kinda like squigglevision\" (as in Doctor Katz and a couple others) but I have to disagree -- it's much better than that. There are a few places where it was painfully obvious that the animation team was trying to save a few drawings by playing the same clip over and over, but in general, the animation was adequate. The voice talents ranged from excellent to really really bad. Christopher Lee was excellent as Death, as was Debra Gillett as Susan, Death's Granddaughter. The voices of the band (Lias, Glod, and Buddy) were very good. Other voices were adequate, with the exception of the wizards at Unseen University. Yes, I know they were supposed to be petty old men, but why did they have to have the pitch, tonality and speech patterns of Smurfs? It became irritating after awhile. I found myself getting restless whenever the wizards were on the screen, wishing the scene would be over. It's a mystery how such bad choices could co-exist with such good choices. Plotwise, most everything is there. The story was shortened in a few spots, which is reasonable when filming a novel. Sometimes the editing destroyed a joke; for instance, when Nobby and Sgt Colon comment \"there she goes -- Susan Death\" the joke falls flat for lack of the earlier setup. \"Wasn't that death?\" \"I dunno, it looked more like a Susan.\" I believe from the description in the book that Pratchett intended the sound of the shop fading and reappearing to be the Dr. Who Tardis sound, but maybe they couldn't get permission to use that. Much of the humor of the novel manages to make it into the film, and it's still funny. I laughed out loud a few times, more out of surprise that a favorite joke was delivered well. All in all, the film has a few flaws but is definitely worth watching. I've just learned that Wyrd Sisters has also been filmed. I can't wait. Now if only they would film Hogfather..."
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Fantasy",
         "Music"
      ],
      "productionCompanies": [
         "Channel 4 Television Corporation",
         "Cosgrove Hall Films",
         "ITEL"
      ],
      "summaries": [
         "Based on Terry Pratchett's Novel. On Discworld (a world carried by four elephants standing on a huge turtle in space), a small girl, Susan Sto Helit, has got a major problem. Her grandfather is Death, who wants to forget that he has just \"processed\" his adopted daughter and her husband who was Susan's mother and father as this is causing him great grief and Death is a person that can remember everything, much to his chagrin. Susan find herself pressed into taking over Death's \"duty\" but finds that she is falling in love with an elf/human, Imp, who is slowly being taken over by a kind of \"musical\" force that is forcing Imp and his friends to play Rock Music to the Discworld. The Rock Music is proving to be a great success, but it has got plans for Imp and everybody wanting to play it and it is up to Susan, the head of the wizards, the Archchancellor and Death (that is, if he can be found and made to remember who/what he is.) to stop it before it conquers the entire Discworld...",
         "The young druid Imp y Celyn comes to Ankh-Morpork to become a famous musician, but a new guitar from a mysterious shop possesses him with a new kind of music - the Music with Rocks In. To make matters worse, Death, saddened by the death of his adopted daughter, has gone away to try and forget, and his granddaughter Susan suddenly has the family duty passed on to her."
      ],
      "budget": 0
   },
   "movielensId": 161502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-12",
      "dvdReleaseDate": null,
      "directors": ["Jean Flynn"],
      "runtime": 159,
      "movieId": 161502,
      "title": "Soul Music",
      "mpaa": "",
      "actors": [
         "Christopher Lee",
         "Graham Crowden",
         "Andy Hockley",
         "Debra Gillett",
         "Neil Morrissey",
         "Bernard Wrigley",
         "Bryan Pringle"
      ],
      "imdbMovieId": "0159914",
      "originalTitle": "Soul Music",
      "genres": [
         "Fantasy",
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Hv1ZV7I3bNM"],
      "plotSummary": "The young druid Imp y Celyn comes to Ankh-Morpork to become a famous musician, but a new guitar from a mysterious shop possesses him with a new kind of music - the Music with Rocks In. To make matters worse, Death, saddened by the death of his adopted daughter, has gone away to try and forget, and his granddaughter Susan suddenly has the family duty passed on to her.",
      "tmdbMovieId": 18560,
      "avgRating": 4,
      "releaseYear": "1997",
      "numRatings": 1,
      "posterPath": "/fN4gzy9qKil7SzwzHUJ6XeSirHe.jpg"
   }
}