{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0968743",
      "video": false,
      "title": "Guys and Dolls",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b31c3a36847f81f7409",
               "name": "Nick Holt",
               "profile_path": null,
               "id": 188717,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b31c3a36847f81f740f",
               "name": "Tina Flintoff",
               "profile_path": null,
               "id": 1056795,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b31c3a36847f81f7415",
               "name": "Mark Raphael",
               "profile_path": null,
               "id": 1056796,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b31c3a36847f81f741b",
               "name": "Frank Loesser",
               "profile_path": null,
               "id": 41747,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.10956,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 113262,
      "vote_count": 3,
      "budget": 0,
      "overview": "Guys And Dolls focuses on a group of men who have fallen in love with their life-size dolls, called \"Real Dolls.\" For these men, their $10,000 lifelike, built-to-order creations have replaced human women.  For some people, finding a partner in life can be difficult. For these men, it's almost impossible. Ten years ago, a small factory in California began making an alternative partner. Each is tailored made to suit every taste.  There are now 3000 real dolls across the world providing some of those with love and companionship that real women cannot.",
      "similar": [],
      "original_title": "Guys and Dolls",
      "runtime": 50,
      "poster_path": "/nlIUhPkJ6wOYMNDSYxWub5vQAwX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "BBC",
         "id": 5996,
         "origin_country": ""
      }],
      "release_date": "2007-01-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Holt"],
      "runtime": 50,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0968743/",
      "coverLink": null,
      "actors": ["Mark Strong"],
      "reviews": [
         "A real water-cooler documentary this one and indeed it was at work when I first heard about this film. This led me to believe it was going to a typically sensationalist documentary from channel 5 but instead it turned out to be much more painful and tragic than I thought it would be. The dolls here are not the blow-up style you see on BBC sitcoms but rather fully realised fake humans that cost about £4000 and we look at a handful of men who have dolls as well as a company that makes them and a \"doctor\" that repairs them. The film doesn't really push the subjects at all and indeed narrator Mark Strong is barely heard across the film. This doesn't mean that the subjects are allowed to have free run and indeed their surprising honesty means that they say more than they probably meant to. The overall impression is one of sadness, where the dolls are embraced as easy companionship in a world where the self is all. I would have liked to see the film push them more and really investigate the subjects more and probe their lives but to be honest it is still engaging even without this. It is a tough watch because the viewer is confronted with people who have given up living and have mostly decided to take these dolls as their lives. On one hand it is a concern that a fake relationship with a sex doll is better than no relationship but mainly it is just so tragic to see such emotion invested in something that will never return it. It is to the film's detriment that it doesn't expand this behaviour beyond the realm of the doll, because this film easily could have used the audience disgust with the subjects to challenge them as well. What I mean is that they really are not too different from people who lock themselves away from real life in video games, movies, fantasy and so on \u0096 and I write this well aware that I fall in one of those groups! The documentary should have been cleverer to make this about modern society and, by sticking firmly with the dolls as the issue, it misses the chance to have a lot more value. An imperfect documentary then but one that makes for depressing and gripping viewing by nature of its subject matter. More intelligence and social commentary would have made it much better but it works for what it is and is, happily, not the tawdry thing I expected at all.",
         "I quite liked this documentary. The narrator wisely let the people speak for themselves without trying to push an overt viewpoint. And we are rewarded with extremely candid interviews from subjects who obviously feel comfortable with that environment. And what could a voice-over communicate better than the girlfriend's expression at the end of the movie or the shot of the young man cuddling his doll in bed. Although there are many hilarious moments (now I know what the Swedes do with excess hair), the clips are skillfully put together to prevent this from becoming a freak show, and we grow to understand and sympathize with the doll lovers even if we are shaking our heads at the end - because - no matter how open-minded one is - this is not something that you normally talk about with your bubbe..."
      ],
      "genres": [
         "Documentary",
         "Romance"
      ],
      "productionCompanies": ["North One Television"],
      "summaries": ["They say love is blind, but can it also be synthetic? This extraordinary film meets a group of lonely guys who have fallen in love with their customized, life-sized dolls."],
      "budget": 0
   },
   "movielensId": 161668,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-17",
      "dvdReleaseDate": null,
      "directors": ["Nick Holt"],
      "runtime": 50,
      "movieId": 161668,
      "title": "Guys and Dolls",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0968743",
      "originalTitle": "Guys and Dolls",
      "genres": [
         "Documentary",
         "Romance"
      ],
      "youtubeTrailerIds": ["f59N37xH0Ng"],
      "plotSummary": "Guys And Dolls focuses on a group of men who have fallen in love with their life-size dolls, called \"Real Dolls.\" For these men, their $10,000 lifelike, built-to-order creations have replaced human women.  For some people, finding a partner in life can be difficult. For these men, it's almost impossible. Ten years ago, a small factory in California began making an alternative partner. Each is tailored made to suit every taste.  There are now 3000 real dolls across the world providing some of those with love and companionship that real women cannot.",
      "tmdbMovieId": 113262,
      "avgRating": 1.5,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/nlIUhPkJ6wOYMNDSYxWub5vQAwX.jpg"
   }
}