{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0144134",
      "video": false,
      "title": "The Cherry Orchard",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 135,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe471bc3a36847f8123c13",
               "name": "Mihalis Kakogiannis",
               "profile_path": "/prtlp8E2u5YQfaNNTOpDI94TVkH.jpg",
               "id": 65843,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe471bc3a36847f8123c19",
               "name": "Anton Chekhov",
               "profile_path": null,
               "id": 109469,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.001694,
      "production_countries": [
         {
            "iso_3166_1": "GR",
            "name": "Greece"
         },
         {
            "iso_3166_1": "CY",
            "name": "Cyprus"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 47034,
      "vote_count": 0,
      "budget": 5,
      "overview": "Madame Ranevskaya (Rampling) is a spoiled aging aristocratic lady, who returns from a trip to Paris to face the loss of her magnificent Cherry Orchard estate after a default on the mortgage. In denial, she continues living in the past, deluding herself and her family, while the beautiful cherry trees are being axed down by the re-possessor Lopakhin (Teale), her former serf, who has his own agenda.",
      "similar": [],
      "original_title": "The Cherry Orchard",
      "runtime": 141,
      "poster_path": "/4rdpxyb0S5TYsotTU8hkMFl8bxe.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Greece",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mihalis Kakogiannis"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "Anton Chekhov",
         "Mihalis Kakogiannis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144134/",
      "coverLink": null,
      "actors": [
         "Charlotte Rampling",
         "Alan Bates",
         "Katrin Cartlidge"
      ],
      "reviews": [
         "From the previous reviews I gather that this is where the elite meet to bleat. I wish those who are so afflicted by nearly everything in this lovely film could spell a bit better. I have seen several stage versions of this play, and I have read the play, so I was prepared to see the film. I agree with whoever it was who said it would appeal best to those who had seen or read the play and that is true. Not every film is for the popcorn crowd. I loved the atmosphere and that is something you cannot get in a stage play. How can acres of cherry trees in blossom be offensive to anyone? That falling-down hunting lodge seemed just right for that decaying family. The costumes were beautiful. There is not a single character in the story whom anyone could actually like, it's true, but by the end of the story you have been told so many things about them, if you pay attention, you can believe in them, which is better at times than merely being able to 'like' them. I believe Chekhov would have approved it.",
         "Cacoyannis began his career filming Greek tragedies five decades ago. Anyone seeing his production of Chekhov's wonderful play knows he adores this work: the discerning casting, the use of Tchaikovsky's little-known piano pieces. Best of all is the look of the production-- its costuming and lighting have the quality of delicate homage. Watch for scenes like the arrival of auction-bidders in a muddy street midway through the film-- a bit of period recreation on a par with Coppola and Scorsese. Chekhov's brilliant bits of stage-business are treasured here: Varya's clobbering her wished-for fiance with a door-slam, Epikhodov's goofs, Yasha's mother-problem, and especially the family's sitting gravely down together before their dispersal. These are lovingly done, and if citing them here is meaningless to those who haven't read the play, I'm afraid the film will mean as little to them, especially on videotape, where the exquisite visuals won't count for much. The acting can't sustain novices-- the cast, especially the males, show the effects of limited rehearsal time, sliding in and out of cohesion. The exceptions to that are Katrin Cartlidge (in a role that often stands-out in stage productions), Ian McNeice, and Michael Gough, delivering the finest performance I have seen from his 50+ years of movie-acting-- acting-teachers should march students to see CHERRY ORCHARD to hear how Gough reads a choice line like, \"Now I can die.\" Cacoyannis nodded in spots: the weird accents affected by the lower-class characters add nothing, and the hammy Act II beggar-- one wants to thrash him. This is not a great film. But the play it serves may be the past century's greatest. At a time when American theaters cannot afford large-cast period plays, a Chekhov-fan feels special gratitude for this production.",
         "Chekhov's plays have generally resisted film and TV adaptations: Sidney Lumet's \"Sea Gull\" was lumpy and not well cast, and even the Russian film adaptations have been turgid affairs. Michael Cacoyannis' version of \"The Cherry Orchard\" (originally titled \"Varya\" after one of the main characters), is better than Lumet's film largely because it's better acted in general. But the direction is sometimes fussy, sometimes leaden - the pacing becomes more and more turgid as the film progresses. The final 40 minutes or so become very tedious. Plus there's an unnecessary prologue in Paris - an obvious attempt to open up the play, but it goes on much too long. Charlotte Rampling does very well as Madame Ranyevskaya, a near-penniless aristocrat who returns to her family estate as it is about to be auctioned after a default on the mortgage. Rampling clearly shows us a aging woman who is spoiled, charming, childish, delusional, sometimes haughty and condescending, and feckless - a person who never learned how to manage money because she never felt she had to. Her performance makes this woman less conventionally sympathetic than others in the role - which is fine. There are times when her performance is undercut by some jarring editing where her mood swings from one extreme to another. The rest of the cast is quite fine: Alan Bates as Ranyevskaya's equally feckless and lazy brother Gayev shows us the man who knows full well his coming fate, yet goes through fits of denial to coddle his sister and the others; Michael Gough as the increasingly senile family servant Fiers; Tushka Bergen as Ranyevskaya's daughter Anya. The best acting comes from Katrin Cartlidge as the hapless, lovesick, foster daughter Varya, a soul sister to Sonia of Uncle Vanya; and Owen Teale (who was superb with Janet McTeer onstage in \"A Doll's House\") as Lopahin, a former peasant whose family worked on Ranyevskaya's farm but who has now become a successful businessman. His efforts to convince the fading aristocrats to save themselves by selling the estate fall on deaf ears, so he decides on a different plan of action. I would recommend seeing this only to people who are familiar with the play. First-timers would be better off seeking out a good stage production (lots of luck there) as Chekhov has always worked better there.",
         "The Cherry Orchard is an ensemble piece about a country estate with a famous cherry orchard that is the pride of the province. It is 1900 in Russia and amid the turmoil of social and political revolution, the family and servants at this little corner of the world are caught in a time warp. It is still Imperial Russia with all the privileges for the wealthy and landed gentry. Time goes by, life goes by, wealth disappears, but these people can't be bothered to notice. Charlotte Rampling (\"The Statement\" 2003) is Madame Ranevskaya who returns, with her daughter, from exile in Paris to her estate to be with her lazy brother (Alan Bates, \"Gosford Park\"), her adopted daughter, and various servants, friends and freed peasants. Like the large old house, their way of life is rotting away. They are broke and the only thing that will save them from poverty is to sell the land, house and orchard to developers. But the are so besotted with the old life they cannot arouse themselves to make a decision on what to do. And of course, they lose it all. The commentary throughout in the form of asides, laughter and outright contempt, is in the character of the servant Yasha (Gerard Butler, \"Dear Frankie\"). He serves Madam R, but he gossips about her profligate ways, has contempt for many in the family and takes advantage of the privileges they provide him, including a romp in the orchard with one of the housemaids (Melanie Lynskey,\"Shooters\"), who he then lectures on her immoral ways. It is a small part, but acts like a Greek chorus to comment on the others. In the end, the doddering valet of Bates is left alone, locked into this decaying house, two old relics forgotten by the aristocrats and the new bourgeoisie. He says to himself \"my life has gone by as though I have never lived. No strings - nothing.\" He leans back in the chair and dies. These people are so careless that no one makes sure the old man has really been taken to a hospital, although they all talk about it, and Yasha keeps assuring everyone he 'knows' he was picked up. So they all just ride off in their carriages and the woodsmen move into the orchard and begin chopping down the cherry trees. The beauty of the cinematography, costumes and piano score of Tchaikovsky music set a mood that is languid and only for those who relish the type of multi-character stories like the recent \"Gosford Park.\" I loved it. 9/10",
         "I don't know that it's possible to achieve a satisfactory production of this Chekov work. Written at the end of his life, the tone is always a question. When Chekov first saw what Stanislavski had done with the play, he was horrified. \"This is a comedy!\" Well, that's hard to pull off. While all the characters are certainly silly and vain and foolish, their circumstance--with the weight of the Revolution soon to rip the entire World open--is not anything to laugh at. And their future is undeniably grim, even though we have the perspective of history to assess their fate, in the context of the play, what's ahead is not going to be something where the audience can rejoice. At the premiere, audiences cheered at the sound of the ax cutting the orchard. Whether that was Chekov's intention (doubtful), it's impossible to create that kind of reaction today. Cacoyannis, however, comes close to perfection. While some of the lines are stage-bound, his choice to open the play up to nature as much as possible was the right one. We see the investment in the family has in the orchard first hand and what it means to lose it. The music by Tchaikovsky adds an aura of authenticity to these fragile people and their bittersweet story; set decoration and costuming are both splendid. Ms. Rampling, who is always interesting, works against the classic portrayal of Mme. Ranevsky. She's not simply a ninny who has suffered circumstances that she's unprepared to deal with; Rampling shows us she's suffered real tragedy and to survive has lapsed into a world bordering on delusion. It's a tender and loving performance. The rest of the cast is more traditional but also excellent. The camera shows us it's magic in the final tableaux. As it floats around the abandoned and locked country home, Chekov's most surprising device works better on screen than on the stage. This is a very impressive work by one of the masters of the cinema who has brought one of the masterpieces of theater (again) to audiences of the cinema. Note: I've since read where other viewers objected to the brief prologue Cacoyannis has added to the play, and I'm going to disagree that it was a mistake. In a stage production, the audience is somewhat disoriented as to why Ranevsky is arriving at the estate, and Cacoyannis clarifies that with the prologue. As well, we are allowed some of the poignancy of the return and to see where and with whom she's been spending her time. For me it added rather than distracted to the text.",
         "Michael Cacoyannis seems strangely reluctant to tell this story in a straightforward, understandable fashion. This ridiculously edited film rates a 7 out of 10 only because it does, in its idiosyncratic way, convey something of the story of a Russian woman, of the landed gentry, fallen on hard times, who is desperately seeking to preserve the ownership of her estate, on which is an ancient and beloved cherry orchard. If she is forced to sell, the orchard will be cut down and the estate \"developed\" into \"affordable housing\". So what else is new, eh? By all, this is the choppiest editing and directing style I have ever encountered. Chekhov's play is certainly not constructed this way. There is no effort to introduce characters in an orderly fashion so that one may get to know who they are, and what their relationships and motivations are. Some of this eventually emerges if you are patient and alert enough, but don't blink! Some of the cast work is excellent. They must have been frustrated, though, if they knew what kind of editing would appear in the final cut.",
         "Obligatory disclaimer: I am not familiar with the traditions of the Russian stage. Whether this is the realization of Anton Chekhov's dream for his production or a terrible mockery of it, I have no idea. Regardless of how it relates to the original format, however, it's clear that it stays a little truer to its roots than would be beneficial. The acting tends towards the stilted more often than not, and while the characters are allowed their respective personalities, they remain just that: characters. This could certainly be spun as subtle commentary on the restrictive social roles in Russia at the turn of the 20th century, but at that point, the only thing you'll be grabbing is straws. What is relevant is the contemporary social commentary. Chekhov's play premiered a mere thirteen years before the Russian Revolution, when Russia's recently-formed capitalist class was making itself the nuisance that the Bolsheviks needed for their uprising. Represented in the film by the character of Lopahkin, his relationship with Madame Renevskaya echoes the growing power of the self-made wealthy over the gentry. The advice of the capitalist goes unheeded time and time again as sentimentality overrides rational decisions regarding the Renevskaya estate. The estate, symbolized by the cherry orchard, is the last remaining tie to the glory of nobility in Russia prior to emancipation in 1861. While he's presented as the opposition to most of the primary characters, it's difficult to present Lopahkin as a villain. His actions are rational. He operates under no pretenses whatsoever. In fact, while this may be something lost in translation from play to film or simply to the march of time, it's difficult to sympathize in the least with the Revenskayas. Their departure from the manor is depicted as bitter and forlorn, but they had it coming the whole time. Attachment impedes progress, resulting in their downfall and disgrace as members of the nobility. Thus, The Cherry Orchard is not a film meant to be watched on its own merit. A passing knowledge of Russian history in the 19th century is all but required to understand its message: possession of an estate means nothing when that estate brings in no money, for now, the forces of capitalism have overridden all but the oldest traditions in Russia. Even a lowly peasant can become the lord of an estate if they only have the material wealth for it.",
         "In his adaption of Anton Chekhov's play, The Cherry Orchard, Mihalis Kakogiannis shows a great deal of respect for the 19th century Russian play. In fact, Mihalis shows so much respect for it that he tried to have the film flow and seem very much like a play. Although the technique is an interesting way of trying to adapt a play to film, it ultimately leaves the audience wishing for less of a boisterous staged feel and more of a subtle real life feeling that film can so wonderfully produce. To Mihalis' misfortune the over animated and often over dramatized characters do more to take the audience out of the film than it does to push them into the story. Although the staged feel to The Cherry Orchard does make the film seem to drag on without the interest one would find in a lifelike representation of the events, there is several very significant themes that are important to Russian history that come across very nicely in the film. One of the most interesting aspects of The Cherry Orchard is the way that we see the very different reactions to the emancipation of the serfs. If we look at the two \"main\" characters of the film, Madame Ranevskaya and Gayev, we see two people that are having a very hard time adjusting to the realities of the serfs being freed. They're not only in constant denial of the economic state of their estate but they are also oblivious to the possibility that former serfs are gaining both power and respect. If we look at how the film expresses the Raznichintzhe class, we see two different expressions. First we see Lopakhin that represents the emerging merchant class in Russian. Although Lopakhin was a former slave, by the end of the film we see that he wields the most respect and power through the active and hard work that he has done as a free citizen. Now on the other hand, Trofimov represents the Intelligentsia class that is emerging towards the later part of the 19th century. His nickname as the perpetual student gives away that he is not about working and doing business in a capitalist society, instead he talks of enacting greater change to help the uneducated freed serf class that now has a ton of freedom and not a whole lot to do with it. Now as Lopakhin showed one of the possibilities for freed serfs Firs showed another. Firs represents a relic of the past, a serf that was more content with being a serf and serving than being forgotten and left behind in the new society. Which is exactly what happens to firs at the end of the movie. Just like Firs, older serfs that could not enjoy the full expanse of their newfound freedom were in a way left behind by society. Although as a movie I believe that The Cherry Orchard could have been a little more intriguing had the director strayed further way from the play format, there are still many interesting aspects to the film that make it a enjoyable piece of Russian oriented cinema. Definitely, worth the watch if you have any interest in Russian life towards the end of the 19th century.",
         "I did not enjoy this film, I enjoyed the story, but this particular telling of the story was not enjoyable for me. The story itself is based off of and named after the play The Cherry Orchard written by Anton Chekhov. The story is centered on a Russian noble family trying to hold onto an estate. Actually they don't actually try to hold onto the estate they just party and worry about losing the estate until they do. My reasons for not enjoying this film are not because the lack of action, I in fact enjoyed the narrative, but the way it was portrayed in the film was very unengaging. Which is odd since you would think that a film being shot around the idea of being both a theatrical play and a movie would be more stimulating, and perhaps it could be, but this film did not achieve this. In its attempt to be a theatrical play and a movie it loses elements of both. The audience performer dynamic for example you lose that sense of the audience watching you as you act is gone as well as the feeling of seeing the actors sweat while they do it all in one take. A film can't do this and it's not expected to. A theatrical play also has to rely on the fact that you can't fix things in post-production. However I do not dislike the film because of these elements. I dislike the film because of the terrible pacing, and the wooden acting, among other things. The first act of the film does not set up the characters or really even tell you who they are or what their names are. Although I wouldn't be surprised if they do in fact mention all the names and who they are in relation to each other, but with all the chaos, and the muttering, I'm not sure how I could figure it out without a guidebook. And while a film does not have to tell me all of the characters names, plays usually do, at least the ones I have gone to give you a little pamphlet telling you about who the actors are and who they play. The middle section of this film feels slow and painful so there is little build up for the delivery at the final parts of the film. This might be somewhat due to the narrative of the film but the acting exacerbates these negative elements and doesn't really let the stories good points shine through. Because of the mindset this film was directed in the actors act and talk spontaneously throughout the film, but apparently the attempt to give it feeling and impact was forgotten which makes the sudden spontaneous over acting feel wooden slow and really takes me out of the film. Most, if not all, of this film's good points are towards the end and it was absolutely not worth the wait (although the films ending need some serious work as the effectiveness it had was lost). If this review is very disjointed take that sense and try to multiply it by 11 that should be about how the acting feels like. The real cruel irony of this film is that it tries to be a film and a theatrical play and fails at being both. I do not recommend this film but I do recommend going out and seeing it done in a theatrical play.",
         "The Cherry Orchard is Mihalis Kakogiannis' ambitious, if ultimately dissatisfying, film adaptation of Chekhov's famous play of the same name. In an attempt to remain true to the story's roots as a stage performance, Kakagiannis filmed the movie as if he were filming a live performance. While this approach is undeniably an artistically appealing gamble, we quickly find that the over the top acting and hasty scene transitions (perfectly befitting a stage) ultimately fail to translate smoothly onto the big screen. The film struggles to grab your attention early on (when it is most critical to engage the audience and establish a connection), but does come into its own about halfway through. Following the Russian abolition of serfdom in the mid-19th century, many noble families found themselves strapped for cash as they lacked the resources and skills required to maintain the estates previously granted to them and maintained by free labor. Set in this era, The Cherry Orchard introduces us to one of these financially struggling noble families on the brink of losing their beloved estate, known for its beautiful cherry orchard. Despite receiving sound advice on how to save the bulk of their estate (at the cost of the orchard itself), the family continuously brushes all logic aside as if waiting to be saved from their fate without having to give up anything in return or to lift a finger to help themselves. Because of this, the estate is seized and put up for auction, ultimately falling into the hands of an up-and-coming merchant whose family had been serfs at the estate for generations prior to abolition. This highlights both the waning power of noble society and the rising fortunes of the middle class in Russia at the turn of the century. Because the family would do nothing to save themselves, the film ends with them going their separate ways into the world as the sounds of axes echo in the background. The Cherry Orchard is being cut down, symbolizing the transition from the old world into the new. As the family leaves and the estate is boarded up, we the longtime family servant, who had served as a serf before the abolition and stayed loyal to the family, has been forgotten and locked inside to die. Earlier in the story, this servant had referred to the abolition of serfdom as a great misfortune, symbolizing that this is man who had long ago resigned himself to his fate. Here again, the man simply sits down without a fight, resigned to his misfortune. His fate, like that of the entire family, is left unknown. Overall, the movie was entertaining at times and utterly boring at others. Its approach was ambitious but, sadly, missed the mark. The actors themselves performed admirably, but even their skill could do little to distract from how badly stage acting so often translates to film acting and vice versa. The two arts are separate for a reason, and very rarely is their melding done correctly. The story itself was thought-provoking and entertaining, a testament to Chekhov's abilities, and once you've grown accustomed the style of the film it becomes infinitely more watchable. For fans of Russian history, it offers an interesting glimpse into Russian society at the turn of the century. For fans of Chekhov, it provides you with a glimpse of what his play would look like if performed and if you're unable to go see it live, as it should be seen. For fans of film...meh.",
         "Overall, I thought this film was a good representation of how a family and others were affected by a major historical event.The fact that this movie was originally written as a play changed how a viewed the movie. I feel like I most likely would've enjoyed it more seeing the play version, but the movie wasn't terrible. There were points were you could tell (such as the characters facial expressions, or their stage direction) that the movie followed closely to how the play would have been performed. A lot of the main ideas circled around the emancipation of the serfs in 1861, and how it affected the lives of both the serfs and the people who once owned the serfs. After the Ranyevskaya's Orchard was bought by Lopahin it sent a large statement out about the fact that man who was once a serf, was able to purchase the land he would have worked on if he weren't emancipated. On the other hand, we have Feers, who was also an emancipated serf, but there was a real struggle he was going through. He was old, didn't really have anywhere else to go, and cared about the family. When he is left alone at the end, we get a sense that while the emancipation was great for Russia, not everyone was able to feel it's glory. I gave it a 7/10 because it did have it's good moments, but I haven't seen the play so I feel like if I had, I would be more appreciative of it. I did like the connections to history, and thought it was an interesting story.",
         "If at first you are put off by the acting and you feel like the acting is over exaggerated, you must know that this film was meant to be a play. The director chose to make this story a play and just film it as a play not a traditional movie. If you ignore the acting you can see the important content of the time. The film takes place at around the time the serfs are emancipated. So at this time the serfs are allowed to leave their masters and do as they wished. This impacted everyone, but especially the nobles. In this film we can see the nobles start to die down without the serfs. Many of the nobles get deep into debt which is what happened to the Ranevskaya family and without the serfs they were not able to make money to pay it off. The style to this film is not that appealing but the story gives us insight into the events that took place at the time.",
         "In this era of gratuitous special effects and uneven, even shoddy, production, one cannot depend on Hollywood to successfully transfer a stage play to the screen. This movie is partially the exception, as the movie amazingly pulls itself together in midstream to become a commendable work of art. The first part of this movie is a cinematic disaster. It's boring, slow, and muddled, with a terrible first ten minutes which is supposed to provide some background information about some of the main characters but which is totally disconnected from the main body of the story itself which takes place in a completely different venue. Then as this movie is heading toward a complete cinematic breakdown it amazingly recovers its strength and vitality and becomes crisp, sharp, focused and coherent, conveying a poignant story about torment and suffering in time of change. From that point on all the performances are great, especially that of Michael Gough, Alan Bates and the beautiful Charlotte Rampling who succeeds in capturing the essence of the woman whose whole world is being turned upside down. But despite the strong finish, that one first has to endure a truly bad start before getting to the good part makes this movie a tedious cinematic experience.",
         "I have to say I hated this movie. I don't like to say that because Gerard Butler is in it. About a half an hour of boring conversation, sorry to all who actually care about the plot, I started fast-forwarding to Gerry's scenes. I really don't know the ending, I was that bored with it. If Gerry wasn't in it, I probably either done one of two things: fell asleep or turned it off, but Gerry is the bright light of this movie, as he is with most of his earlier movies. If you're a fan of Gerry's don't worry, he's as adorable and precious as he always is, but if you actually want to watch the movie for the plot, good luck because you'll need it, either that or lots of coffee or soda to keep you awake! 4/10...and that's just because the casting director had the sense to put Gerry in this movie, even though they had no idea of how to spell his name!",
         "I agree with a previous review that this version of THE CHERRY ORCHARD doesn't happen until halfway through. Then, the curtain comes up, the story and the characters gel, the ideas kick in and the play is revealed. This is one of the only performances of Alan Bates that I didn't care for. It seemed silly and forced. Charlotte Rampling is rather perfect, however. I love Chekhov but I expect to be disappointed. I've seen performances on stage and on the screen that horrified all my sensibilities to the depth of my soul. I've seen plenty of train wrecks. This starts off very badly with a prologue that is utterly unnecessary and not very interesting. Scenes are presented in different order and seem to be jumbled up in a unauthentic attempt at cinema. The beginning just doesn't work. But, if you're patient, the second half does have many moments that are satisfying and resonate deeply. We see many of Chekhov's themes of loss, unrequited love, the ennui of modern life, etc. The acting seems more focused and the pay off pretty good by the end. I recommend it with serious reservations in mind."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Melanda Film Productions",
         "Greek Film Center",
         "Amanda Productions"
      ],
      "summaries": ["Madame Ranevskaya (Rampling) is a spoiled aging aristocratic lady, who returns from a trip to Paris to face the loss of her magnificent Cherry Orchard estate after a default on the mortgage. In denial, she continues living in the past, deluding herself and her family, while the beautiful cherry trees are being axed down by the re-possessor Lopakhin (Teale), her former serf, who has his own agenda."],
      "budget": 5000000
   },
   "movielensId": 161726,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": null,
      "directors": ["Mihalis Kakogiannis"],
      "runtime": 141,
      "movieId": 161726,
      "title": "The Cherry Orchard",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0144134",
      "originalTitle": "The Cherry Orchard",
      "genres": [
         "Drama",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Madame Ranevskaya (Rampling) is a spoiled aging aristocratic lady, who returns from a trip to Paris to face the loss of her magnificent Cherry Orchard estate after a default on the mortgage. In denial, she continues living in the past, deluding herself and her family, while the beautiful cherry trees are being axed down by the re-possessor Lopakhin (Teale), her former serf, who has his own agenda.",
      "tmdbMovieId": 47034,
      "avgRating": 0,
      "releaseYear": "1999",
      "numRatings": 0,
      "posterPath": "/4rdpxyb0S5TYsotTU8hkMFl8bxe.jpg"
   }
}