{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0284605",
      "video": true,
      "title": "VeggieTales: Esther...The Girl Who Became Queen",
      "recommendations": [
         273309,
         273315
      ],
      "backdrop_path": "/wxqGnjJtkwka4NHmrDUdfCINHmJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Esther (voice)",
               "gender": 0,
               "credit_id": "5630182ac3a3681b5400e94c",
               "name": "Jessica Kaplan",
               "profile_path": null,
               "id": 1528164,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Esther (singing voice)",
               "gender": 0,
               "credit_id": "5630183cc3a3681b6100edf3",
               "name": "Pamela Thomas",
               "profile_path": null,
               "id": 1528165,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Mr. Nezzer (King Xerxes) / Mr. Lunt (Haman) / Pa Grape (Mordecai) / Scallion #1 / Phillipe Pea (Peaoni Brother #1) (voice)",
               "gender": 2,
               "credit_id": "5630184ac3a3681b5e00df75",
               "name": "Phil Vischer",
               "profile_path": "/tqQLl2HRYOkMETPqgO6v4zJwEZ3.jpg",
               "id": 78297,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Larry the Cucumber (Markus the Scribe) / Jean-Claude Pea (Peaoni Brother #2) (voice)",
               "gender": 2,
               "credit_id": "563018a3c3a3681b6100ee09",
               "name": "Mike Nawrocki",
               "profile_path": "/1rSsWpWeKAd03AvULIr4UkBCyL6.jpg",
               "id": 78298,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "563018d49251413b46000e0e",
               "name": "Mike Nawrocki",
               "profile_path": "/1rSsWpWeKAd03AvULIr4UkBCyL6.jpg",
               "id": 78298,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "563018dec3a3681b5e00df91",
               "name": "Mike Nawrocki",
               "profile_path": "/1rSsWpWeKAd03AvULIr4UkBCyL6.jpg",
               "id": 78298,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "563018eac3a3681b4d00ffa5",
               "name": "Phil Vischer",
               "profile_path": "/tqQLl2HRYOkMETPqgO6v4zJwEZ3.jpg",
               "id": 78297,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.221502,
      "production_countries": [],
      "id": 273296,
      "vote_count": 4,
      "budget": 0,
      "overview": "A VeggieTales of Queen Esther and her struggle to save her people from being sent to the Island of Perpetual Tickling (IPT) by her husband the king.",
      "similar": [],
      "original_title": "VeggieTales: Esther...The Girl Who Became Queen",
      "runtime": 39,
      "poster_path": "/mbjr2qLOBXOQE0qLg6xcc6kzjUc.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-06-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Nawrocki"],
      "runtime": 30,
      "synopsis": null,
      "writers": [
         "Mike Nawrocki",
         "Phil Vischer"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0284605/",
      "coverLink": null,
      "actors": [
         "Jessica Kaplan",
         "Pamela Thomas",
         "Phil Vischer"
      ],
      "reviews": [
         "My children loved Esther. The format was slightly different; it didn't include a \"Silly Song\" segment, but there was a very silly song about puppies. And my children absolutely loved Esther's song. They got the message about being courageous and trusting God during difficult situations. It was a serious story, but they handled the touchy topics in a way that got the basic idea across without making it too serious, gruesome, or graphic for kids...the usual VeggieTales way. For example instead of being executed, criminals were sent to the Isle of Perpetual Tickling. My children and I highly recommend Esther; they learned a lot, laughed a lot, and sang a lot.",
         "Now I think I have seen all VeggieTales at least once and I must say that this one here \"Esther, the Girl Who Became Queen\" is one of the weaker entries. Writer and director team is Nawrocki and Vischer as usual, but at almost 40 minutes, this one is fairly long for a VeggieTales episode. It was made in the first year of the new millennium. The only thing i really liked here was the music used on several occasions. But it's just not enough to make up for the fairly mediocre story. They almost tried to be really dramatic here with a tale on a queen who doesn't want to be a queen and one of the closest advisers to the king being a traitor. So it is about moral, yes, but still it feels like something's missing and this one does not tell an educational message as inspiring as the ones from some other VeggieTales. Animation is also fairly weak for 2000. I do not recommend the watch. Only worth checking out for the really biggest fans of the franchise.",
         "For a start, I don't know if anything here counts as a spoiler- I just want to stay on the safe side. Okay, so I have always wished that Veggie tales would go back to the exact pattern of the first couple of videos, and this one definitely did NOT. That said, I actually enjoyed it very much. I first saw a picture of Esther, I thought, \"A *new* veggie? And she has HAIR?\". But she won me over from the start, sweet and cute and talented, perfectly conveying the rolemodelishness of Esther. One review said that the 'Death' like character that take victims to the IPT is a bit too scary for little kids. It's possible... I for one (When I was younger, OK!), and my ultra-sensitive baby sister were far more scared by the Fib from Outer Space- The Death of Tickles was nothing. Esther is (My sister's best friend)'s favorite book of the Bible- I think this did her love justice.",
         "I was rather disappointed with this one. By the time this came out we had watched almost all 13 of the Veggie videos which had already been released by Big IDea, and it was a good thing, since we knew that they were capable of far better things. We thought hard about what made Esther less appealing than the rest of the series, and finally hit on it: the veggies were taking themselves too seriously. The silliness was gone (no Silly Song, even), the wackiness was gone, the Monty-Pythonesque humor was gone, and all we were left with was a beautiful young scallion with hair (but no limbs) and a serious dramatic difficulty before her. Which sounds stupid, and, well, it did kind of come across that way without the zaniness to buoy it. We own it, and we let the kids watch it because there's nothing really *wrong* with it, but we don't enjoy it while it's on.",
         "I was stunned by the graphics in this one. They did an excellent job. The story is well told and moves along at a great pace. I did feel the character who leads the Peas to the Island of perpetual tickling is a little to scary looking for the youngest ones in the audience. Aside, from that this video is awesome."
      ],
      "genres": [
         "Animation",
         "Short",
         "Drama",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Big Idea Entertainment"],
      "summaries": [
         "Esther has been chosen by the king to be queen, but she's about to find out that being queen is going to take more courage than she ever imagined! Esther... The Girl Who Became Queen teaches kids that \"you never need to be afraid to do what's right!\"",
         "A VeggieTales of Queen Esther and her struggle to save her people from being sent to the Island of Perpetual Tickling (IPT) by her husband the king."
      ],
      "budget": 0
   },
   "movielensId": 161804,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-06-01",
      "dvdReleaseDate": null,
      "directors": ["Mike Nawrocki"],
      "runtime": 39,
      "movieId": 161804,
      "title": "VeggieTales: Esther...The Girl Who Became Queen",
      "mpaa": "NR",
      "actors": [
         "Jessica Kaplan",
         "Pamela Thomas",
         "Phil Vischer",
         "Mike Nawrocki"
      ],
      "imdbMovieId": "0284605",
      "originalTitle": "VeggieTales: Esther...The Girl Who Became Queen",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A VeggieTales of Queen Esther and her struggle to save her people from being sent to the Island of Perpetual Tickling (IPT) by her husband the king.",
      "tmdbMovieId": 273296,
      "avgRating": 3.16667,
      "releaseYear": "2000",
      "numRatings": 3,
      "posterPath": "/mbjr2qLOBXOQE0qLg6xcc6kzjUc.jpg"
   }
}