{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0090068",
      "video": false,
      "title": "Starship",
      "recommendations": [
         63105,
         58903,
         66892,
         47822
      ],
      "backdrop_path": "/rqBRDPsSybUR2616NkIf0QMebLC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "School child",
               "gender": 0,
               "credit_id": "52fe495b9251416c750c5753",
               "name": "Adam Cockburn",
               "profile_path": "/32ebTXNoGFvUUBbutF6hWAnvifS.jpg",
               "id": 1001970,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Detective Droid",
               "gender": 2,
               "credit_id": "52fe495b9251416c750c5757",
               "name": "Tyler Coppin",
               "profile_path": "/s3IwFYyKgA4hfyvKcrH6DLd2Xjg.jpg",
               "id": 152548,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Jowitt",
               "gender": 2,
               "credit_id": "52fe495b9251416c750c575b",
               "name": "Ralph Cotterill",
               "profile_path": "/8u3BnT9ANGdZ2ppp591BIjXl0Q.jpg",
               "id": 97331,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Little girl",
               "gender": 0,
               "credit_id": "52fe495b9251416c750c575f",
               "name": "Rebekah Elmaloglou",
               "profile_path": null,
               "id": 115720,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "School child",
               "gender": 0,
               "credit_id": "52fe495b9251416c750c5763",
               "name": "Tami James",
               "profile_path": null,
               "id": 1001971,
               "order": 4
            },
            {
               "cast_id": 1005,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe495b9251416c750c5767",
               "name": "Hugh Keays-Byrne",
               "profile_path": "/lhYUcPimMMy7Ltp58NkB3RuJzSv.jpg",
               "id": 26060,
               "order": 5
            },
            {
               "cast_id": 1006,
               "character": "School child",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c576b",
               "name": "Michelle Linley",
               "profile_path": null,
               "id": 1001972,
               "order": 6
            },
            {
               "cast_id": 1007,
               "character": "Dylan",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c576f",
               "name": "Arky Michael",
               "profile_path": null,
               "id": 1001973,
               "order": 7
            },
            {
               "cast_id": 1008,
               "character": "Soufie",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c5773",
               "name": "Peter Morris",
               "profile_path": null,
               "id": 1001974,
               "order": 8
            },
            {
               "cast_id": 1009,
               "character": "School child",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c5777",
               "name": "Ben Philips",
               "profile_path": null,
               "id": 1001975,
               "order": 9
            },
            {
               "cast_id": 1010,
               "character": "Abbie",
               "gender": 2,
               "credit_id": "52fe495c9251416c750c577b",
               "name": "Donogh Rees",
               "profile_path": null,
               "id": 181898,
               "order": 10
            },
            {
               "cast_id": 1011,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c577f",
               "name": "John Rees",
               "profile_path": null,
               "id": 145876,
               "order": 11
            },
            {
               "cast_id": 1012,
               "character": "School child",
               "gender": 1,
               "credit_id": "52fe495c9251416c750c5783",
               "name": "Holly Robinson Peete",
               "profile_path": "/lcdP7aJNGxvgwB55gjHPdVsnlB7.jpg",
               "id": 168581,
               "order": 12
            },
            {
               "cast_id": 1013,
               "character": "Grid' not 'Kid",
               "gender": 2,
               "credit_id": "52fe495c9251416c750c5787",
               "name": "Deep Roy",
               "profile_path": "/rCg84FP1x5tOutHKRB4OKhQeR4N.jpg",
               "id": 1295,
               "order": 13
            },
            {
               "cast_id": 1014,
               "character": "Controller",
               "gender": 0,
               "credit_id": "52fe495c9251416c750c578b",
               "name": "Arthur Sherman",
               "profile_path": null,
               "id": 1001978,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe495c9251416c750c5791",
            "name": "Roger Christian",
            "profile_path": null,
            "id": 5058,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 1.096756,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 94502,
      "vote_count": 7,
      "budget": 0,
      "overview": "Jowitt, a mercenary without recluse institutes a totalitarian regime in a small mining city of an arid planet, Ordessa, helped in that by androids incapable of any emotion.  The young Lorca and his android professor, Kid, are both in this tended situation. To find the liberty, they must at any costs seize a spaceship, the \"Red Star\", but they quickly have to face an android killer...",
      "similar": [],
      "original_title": "Starship",
      "runtime": 95,
      "poster_path": "/dJ5exTggUVvskdZxHQzxzKebghA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1984-12-13",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Christian"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Roger Christian",
         "Matthew Jacobs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090068/",
      "coverLink": null,
      "actors": [
         "Adam Cockburn",
         "Tyler Coppin",
         "Ralph Cotterill"
      ],
      "reviews": [
         "I admire Roger Christian enormously and rate this film at a 7 purely for creativity, fortitude and bravery because I dig the hugely ambitious nature of the concept he had at the time. I remember him rattling off all these fascinating ideas in interviews about a 'sci-fi western'. I also love the rawness of the young actors some of whom did a really good job. It was originally to be called '2084' (taking a cue from Orwell's 1948 novel '1984' was a hugely pompous mistake and luckily the fact that the film didn't come into fruition until 1985 must have helped seal the fate of that particular name). It was released under that name in Australia however. The original tag-line was \"In 2084 all who oppose the system must die or become outlaws\" The English language VHS versions I have seen both in the UK and USA releases are edited heavily, some key scenes and at least one character have been completely deleted, this leaves gaps in the plot and the continuity. Also both these VHS releases have been dubbed. Tony Bank's score being replaced with a dribbling, tawdry load of old giblets composed and performed by Craig Huxley. The droid character with the annoying voice was originally called 'KID' but for some reason every instance of his name has been clumsily dubbed over with the name 'GRID' It's annoying as the dubbed-in single word stands out a mile, sometimes I think it is another actor impersonating the right voice. I know that on a German TV channel they have aired the full version of the movie with no deleted scenes and with the original score although with a dubbed German soundtrack. I do not know if the foreign language VHS releases are edited versions or not. Donogh Rees was great despite the limits of her role and acted rings around everyone else, she really should have been the lead and indeed in many ways she ends up being the hero in the end. As for Lorca played by John Tarrant. He is unfairly hampered by the poor script (some of his lines are just awful) and no amount of 'acting' could make them convincing, but actually when you see him in less scripted scenes like scrambling over moving monster truck in the desert he is very compelling and during some of his weepy moments he shows a degree of talent for displaying emotion far beyond the sort of actor that you'd expect to find lurking in the murky sediment of Australian TV like 'A Country Practice'. As the only real women in the film are part of this mining community they all have no makeup on and wear boiler suits all the time which makes them look more like men... you get the impression that (even as a straight guy) if you were actually stuck on Planet Ordesa you'd probably find yourself casually dropping the soap in Tarrant's direction in no time at all. He single-handedly provides the eye candy as he was by far the prettiest thing in the cast besides Toyah Wilcox, who appears on a holographic video jukebox in the 'Miram Bar' (despite writing a very intriguing song with Tony Banks especially for the movie that was a whopping 7 minutes long she only appears for about 5 seconds! It is a shame as she probably spent about 5 hours on hair and makeup for the shot). I get the impression that Toyah's cameo appearance ended up being so small in order to make way for the Peter Gabriel cameo appearance (which was not part of the soundtrack or actually written for the film). The final song performed by Tony Banks and sung by Jim Diamond \"You Call This Victory\" is just a typical, unremarkable bit of eighties fluff, but if you enjoyed the eighties, as I did, you'll appreciate it. Everybody universally seems to hate the teacher droid midget played by Deep Roy. His crummy voice combined with a mouth that the budget didn't allow to move makes him very difficult to engage with. There is a scene in the desert where Lorca is doing all his scrambling over a moving truck macho action stuff and in the background the stupid droid is dangling from a cable and squeaking 'Lorca, help!' again and again and AGAIN!!! It's like a demented parakeet. Then when the truck crashes the little runt's head flies off and you feel two emotions: relief and joy. When Lorca walks towards the head you half expect and half hope he will kick it way off into the desert, but instead he (of course) repairs the droid who 'lives' on until the end. The other characters are pretty much one-dimensional and really not worth mentioning. I rather like the robot soldiers, in a way their human clothing and army boots makes them a bit more sinister than clunking metal bodies would. Some of the scenes like the church one are quite poignant and symbolic and very well done, (although this scene is shortened on the US and UK VHS releases) others like the death of Abbey and the death of Lorca's mother seem clumsy and untidy. Tony Banks wrote a great piece of music for the death of Abbey scene, (Original score not present on some VHS releases) but the scene itself just doesn't have any of the polish and poignancy it deserves. Not in this case due to a lack of props or effects, it is just badly shot. On the special effects side of things they are limited, but well done. Even accepting all its shortcomings I still have a big soft spot for this film, I am not sure what it is but there is something special about it that very few people seem to get! I am glad I am one though, even if I am the only one and I am glad Roger made it! Thanks RC!",
         "The opening scene - where youthful protesters are seemingly trying to influence the \"thinking\" (more accurately, the programming) of military androids - set's the mood for this entire film: nothing makes any sense! Roger Christian hasn't had a lot of hits in his career. Well, actually, he's not had ANY. Be that as it may, this one could be his worst movie ever. The week before I saw \"Starship.\" I watched \"Battlefield Earth.\" It was dreadful, of course. But it had at least two things \"Starship\" didn't: a plot that made *some* sense and action that didn't put you to sleep. However, \"Starship\" DID have unintentional humor every so often, which saves it from being a complete and utter waste of time. For instance, why were the androids programmed to feel pain (reminds me of a parody from \"The Simpsons\")? Why was this movie called \"Starship\" when it is primarily terrestrially-based? Why was it necessary to have this movie based on some distant planet? (I didn't see anything different about Ordessa compared to an Earth of the future.) Who were the miners? (All we saw were teenagers playing video games, protesting and blowing up things.) The intrepid bounty hunter (who doesn't seem very menacing) is named \"Danny\"? Oh, I could go on and on... Anyway, if you can stay awake through it, you might get a chuckle or two out of it. However, if you are looking for an interesting, exciting, well-made movie - take a pass on \"Starship\"! My rating: 2",
         "Yow, I remember this movie when it came out in the 80's. There I was, with a bunch of friends, I was about 15, popcorn in hand, expecting to see a great sci-fi movie at the theater. We were all disappointed. The plot was totally unoriginal, the b-grade acting & the special effects were a let down. The masks they used for the bots were ugly, and the ship designs were bad. 18 years later, they stick in my head like a bad, umm, movie. The whole underground resistance idea could have worked if they put more idea and thought into the story line and had somewhat of an interesting dialogue, but there is none worth remembering. To be fair, the movie is probably better then some of the garbage that we see today that passes as sci-fi, but that's not saying much. 3 out of 10",
         "Holy makerel, how did I end up on this page? Right, after cringing at the dismal career of director Roger Christian, many gleefully bad reviews for \"Battlefield Earth\" and realizing that Christian was actually responsible for one of my first cinematic epiphanies. See, as a wee lad, I was convinced that everything Science-Fiction was perfect. Didn't matter whether \"2001\", \"Omega Man\" or a Japanese Gozilla film. The good, the bad and the ugly where all good and wholesome to me; until my dad brought me a VHS-copy of \"Starship\" and for the first time in my long life, I reached for the controller and actually pressed STOP during the second half of a science fiction film! \"Enough\", reeled my young mind. \"Why bother finishing this crap\"? A realisation set in that there are films really not worth sitting through. Honestly, since I've spent many precious hours on utter garbage, b-films cheapos – sometimes regretting, sometimes not – but I've never finished watching the last half of \"Starship\". And I'm still kinda proud of that. Let's just hope that \"Starship\" will never be transferred from VHS, never makes it unto DVD or the internet and will just one day be forgotten in time and space \u0085 it's the best it deserves. No points from me although IMDb forces me to give at least one. A",
         "STARSHIP is touted in the tagline as a \"warp speed adventure\". Instead of being anything like an adventure this film throws great visuals at the audience and absolutely no story. STARSHIP is weird and disappointing, and not worth viewing or effort it takes to thrust it in a VHS deck.",
         "When I first saw Starship, I was actually pretty impressed. Sure it's kinda dim and has badly cliche'd characters, but I thought the direction and general style of the film lended itself well to the subject matter. It's fun in a cheezy sort of way, and even vaguely artistic to a certain extent. Where things really go wrong is the inclusion of Deep Roy as \"Digit\"...the robot companion. Oddly enough, most version of this film have mysteriously dubbed over Digits name and changed it to \"Grid.\" Considering it's low budget, Starship comes off as a more entertaining sci-fi style film than alot of higher budget, straight-to-video drek. Just don't take it too seriously.",
         "Lorca and his friends are fighting against a Robot-Army that is controlled by the evil commander of their colony. They are in underground an are kidnapping and reprogramming some robots to have a better stand against the overwhelming forces of the \"Empire\". Last but not least there always has to be a little love-story ;=)",
         "Well i ordered this from Amazon.com and i must say that found several things interesting. As for the American version of the film the android voices have been dubbed over and some stupid music score has been put on it to, which makes it much less impressive than the original version. And the sound effects of the guns have been altered also as for some minor edits... It was like they tried to edit this film so it would adapt better or more to children which its not meant to do! So in my opinion get a hold of the international version and stay away from this imperial American crap! As for the movie itself, i enjoyed it when i watched the other version when i was a kid!",
         "This movie is pointless...some of my friends and I had a Crappy sci-fi movie party and this was by far the worst. I looked amazing on the package. But it is possibly the most boring thing I have ever witnessed in my entire life... It made me Physically Ill having to sit though this after ten hours of other horrid Sci-Fi trash such as Abraxas and Star Crash. There was huge mining trucks...and weird robots wearing football helmets wielding M-16s that I called OJ Simpson robots. But this was just the most lifeless and horrid drivel in the world. This is actually, the worst movie I have ever seen...no exageration...by far the worst.",
         "I've come up with a drinking game to play while you watch Starship. Here's what you do. Get a bottle of your favorite liquor and a shot glass for everyone who wants to play along. Fill up each shot glass to start off, and then slap Starship in the VCR. The rules are that everyone takes a shot whenever something interesting happens. Suitable for teetotalers. Unused liquor can be deposited back in the bottle utilizing a funnel. This is the absolute worst kind of movie: a boring one. I watch lots of terrible movies. In the right frame of mind, an onslaught of cheese and surprise 80s dance numbers and mullets can provide a fun evening like nothing else. Battlefield Earth, for instance (and by the same director), is wonderful because it aims for real emotional impact over and over again and achieves not an ounce of it. Starship, on the other hand, might just be aiming to put me to bed early. Action matters when we care about its outcome. Nothing we give the least little tiny crap about is ever really in jeopardy in Starship, and the one time something terrible happens to a main character it's filmed so poorly we're left for a minute wondering precisely what happened. This movie's a mess. But not, let me stress, a hilarious mess. It's not an interesting mess. It's not something to get drunk and make fun of. It's not a crappy, crappy, crappy movie; the situation is altogether more dire than that. It's boring.",
         "I like to watch obsolete/obscure movies, but I must say that this one was not high on my list. Starship is cheesy, corny, etc, but they could have done much better. While I liked the general idea (underground army, post-nuclear holocaust, etc), the approach was, well, limited, to say the least. The Grid/Kid/Digit character was one of the most distracting in the film. Also, hinging the fate of the future on one character seemed to stretch the plot a bit, to put it mildly. There were some positive aspects... but they are hard to find. What I mean to say is that if I myself had a home video camera and a couple of football helmets, I could have made a similar movie. But if you're looking for excitement, or the winner of the \"best obsolete film\" award, this is not it. Sorry.",
         "This is the third movie I have rented tonight with the word 'Star' in it. However, it isn't 'Star Wars', 'Star Trek', 'The Last STARfighter', or even 'Star Kid.' This movie was made 'down under' and we can expect no less from foreign movies. Like 'Star Crash' before it and 'Star Knight', we have a movie that wants to be so many things we Americans made but simply could not do. And, like everything else, it comes out so dirty it should be condemned in the laundry pile to be burned completely. I'm sorry, folks, this sucked hard. The back of the box mentioned and stole a few words from the Star Wars common terminology and compared itself to the likes of Blade Runner, which wouldn't make a whole lot of sense. The 'droids' here are simply people with jumpsuits, aluminum guns and creepy Chinese/Buddhist masks - and more often than not, these are midgets. With someone whose name is 'Deep Roy', which is really downright hilarious (especially the name typo - Kid? Grid? Fail.), this is pretty bad. The 'storm troopers' are all poorly designs animatronics which look like something a child did for a science project out of whatever was in a junkyard. The music goes on to copy, blatantly, the same motifs as Last Starfighter - and blatantly rips most of Luke's battles in Tattooine from the first movie. The villain even looks like Darth Vader! Gah, originality must be pretty hard to find, is it? Jesus Christ on a stick. None of the movies I have seen so far are recommended. It's a proved fact you'll ignore most of them for private time on the computer or with a loved one rather than pay attention."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "VTC",
         "Associated-Rediffusion Television",
         "Lorca Film Production"
      ],
      "summaries": ["Things are not going well on the mining planet Ordessa: the conditions are awful, the workers are disgruntled and the management is cracking down by using killer security robots. Only the underground resistence movement, led by Lorca, has a chance of turning around the brutal regime, but the management has hired Danny the bounty hunter to track him and his followers down. Will any of them stand a chance against the brutal hunter and his robot assistants?"],
      "budget": 0
   },
   "movielensId": 162002,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-12-13",
      "dvdReleaseDate": null,
      "directors": ["Roger Christian"],
      "runtime": 95,
      "movieId": 162002,
      "title": "Starship",
      "mpaa": "",
      "actors": [
         "Adam Cockburn",
         "Tyler Coppin",
         "Ralph Cotterill",
         "Rebekah Elmaloglou",
         "Tami James",
         "Hugh Keays-Byrne",
         "Michelle Linley",
         "Arky Michael",
         "Peter Morris",
         "Ben Philips",
         "Donogh Rees",
         "John Rees",
         "Holly Robinson Peete",
         "Deep Roy",
         "Arthur Sherman"
      ],
      "imdbMovieId": "0090068",
      "originalTitle": "Starship",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jowitt, a mercenary without recluse institutes a totalitarian regime in a small mining city of an arid planet, Ordessa, helped in that by androids incapable of any emotion.  The young Lorca and his android professor, Kid, are both in this tended situation. To find the liberty, they must at any costs seize a spaceship, the \"Red Star\", but they quickly have to face an android killer...",
      "tmdbMovieId": 94502,
      "avgRating": 2,
      "releaseYear": "1984",
      "numRatings": 1,
      "posterPath": "/dJ5exTggUVvskdZxHQzxzKebghA.jpg"
   }
}