{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "alabama",
            "id": 2075
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "segregation",
            "id": 233016
         }
      ],
      "imdb_id": "tt0065944",
      "video": false,
      "title": "King: A Filmed Record... Montgomery to Memphis",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "",
               "gender": 2,
               "credit_id": "576a62e0c3a36835cf00299c",
               "name": "Paul Newman",
               "profile_path": "/my0Blo9IBy1WZ0QKbuxUzS0QwV5.jpg",
               "id": 3636,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "576a62e6c3a36812f70006e2",
               "name": "Joanne Woodward",
               "profile_path": "/8a500O203jN1IHFZVAPwVUyAHUZ.jpg",
               "id": 109410,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "576a62ea9251412c30000454",
               "name": "Ruby Dee",
               "profile_path": "/hadVr5kdeqlorRmjaMhHAutTbAm.jpg",
               "id": 15532,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "576a62f29251412bcd000480",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "576a62f99251412bf100045e",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "576a63009251412c85000452",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "576a63079251412c85000456",
               "name": "Ben Gazzara",
               "profile_path": "/dbmfyjTC3PSBvHOjlAMI0I0eZ6T.jpg",
               "id": 856,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "576a630fc3a36835cf0029a3",
               "name": "Charlton Heston",
               "profile_path": "/pXwJV9JlOCKOHSfEJdt2q61SZVq.jpg",
               "id": 10017,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "576a63159251412c85000459",
               "name": "Harry Belafonte",
               "profile_path": "/fSSsExSbBbkr6ZV5uwTMZqZyDwh.jpg",
               "id": 33162,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "576a631c9251412c3000045c",
               "name": "Sidney Poitier",
               "profile_path": "/9LV17m3H7nGCJTXg7pzhK857g6V.jpg",
               "id": 16897,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "576a63299251412bcd000494",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "576a632ec3a36822430004ca",
               "name": "Diahann Carroll",
               "profile_path": "/t6avXJWcaUh9yZBT6ZWBzvmUAft.jpg",
               "id": 20158,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "576a63479251412bf100046c",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "576a634f9251417901000c36",
               "name": "Anthony Quinn",
               "profile_path": "/9sKpm4KCoUbmMbR86fpqcgBCHrJ.jpg",
               "id": 5401,
               "order": 14
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "576a6357c3a36835cf0029b2",
               "name": "Leslie Uggams",
               "profile_path": "/1WGFWsvPagdugT7fBBrAI4IJC9T.jpg",
               "id": 122750,
               "order": 15
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "576a635e9251412bcd0004a2",
               "name": "Paul Winfield",
               "profile_path": "/6FuLfJh70aDUxggFuPC2oID5Mjg.jpg",
               "id": 1818,
               "order": 16
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "576a63659251417901000c3d",
               "name": "Marlon Brando",
               "profile_path": "/84aAmVDUiQqzkfliOBemb7FaiuD.jpg",
               "id": 3084,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "576a6385c3a36822430004df",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "576a638e9251412c24000466",
               "name": "Joseph L. Mankiewicz",
               "profile_path": "/4nXrV7vGy3V6hgMVw7nTiVJhZpY.jpg",
               "id": 10601,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.645159,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 149320,
      "vote_count": 2,
      "budget": 0,
      "overview": "A 1970 American documentary film biography of Dr. Martin Luther King, Jr., presented in the form of newsreel footage and segments of recordings by Dr. King, framed by celebrity narrators, including Marlon Brando, Paul Newman, Joanne Woodward, Ruby Dee, James Earl Jones, Clarence Williams III, Burt Lancaster, Ben Gazzara, Charlton Heston, Harry Belafonte, The movie was produced by Richard Kaplan and Ely Landau.",
      "similar": [
         17654,
         10637,
         381284,
         419430,
         393457,
         273895,
         323677,
         50014,
         1640,
         8961,
         770,
         6637,
         147441,
         600,
         72976,
         72331,
         271110,
         239566,
         301337,
         376867
      ],
      "original_title": "King: A Filmed Record... Montgomery to Memphis",
      "runtime": 185,
      "poster_path": "/jeld2y4CsLIvFhiRVom7Thuw7eo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Commonwealth United Entertainment",
         "id": 1427,
         "origin_country": ""
      }],
      "release_date": "1970-03-24",
      "vote_average": 8.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://afilmedrecord.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Sidney Lumet",
         "Joseph L. Mankiewicz"
      ],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Mitchell Grayson",
         "Ely A. Landau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065944/",
      "coverLink": null,
      "actors": [
         "Paul Newman",
         "Joanne Woodward",
         "Ruby Dee"
      ],
      "reviews": [
         "If ever there were a documentary that could be deemed absolute required viewing, whether in classrooms or in homes, it is KING: A FILMED RECORD\u0085MONTGOMERY TO MEMPHIS. Shown in only a handful of theaters on one single day (March 24, 1970), and released on video numerous times over the years in condensed form, this monumental documentary, some fourteen years after it was entered into the National Film Registry, is back in release on DVD in the form that people who got to see it in 1970 originally saw it, in its uncut length of just slightly over three hours. Put together by filmmakers Sidney Lumet and Joseph L. Mankiewicz and producer Ely Landau, KING: A FILMED RECORD looks at the place that the Rev. Dr. Martin Luther King Jr. holds in American history. Having gone from a relatively unknown preacher in the early 1950s to national prominence as a result of Rosa Parks' breaking the segregation barrier on transit buses in Montgomery Alabama, King became one of the great figures of our history by making it his mission in life to see that all men, women, and children in America would be judged by what's in their heart and not by what their skin color was. In the original uncut form that had gotten it an Oscar nomination for Best Documentary Feature in 1970 (it lost to WOODSTOCK), KING: A FILMED RECORD looks at all the important moments in Dr. King's non-violent revolution that would forever change the American landscape, even if it didn't change everybody's perceptions of those different from themselves. He fought non-violently against racist governors like George Wallace, bigoted police chiefs like Birmingham, Alabama's infamous Bill Connor, led the march on Selma, and managed to get long-stalled civil rights and voting rights legislation through Congress onto the books through the signature of then-president Lyndon Johnson . All of his most important speeches are included in their full, unexpurgated form here, including the monumental \"I Have A Dream\" speech he made during the March on Washington of August 28, 1963, and his final \"I've Been To The Mountaintop\" speech he made in Memphis on the night of April 3, 1968, the night before he was felled by an assassin's bullet. We also see how tough the struggle could be, what with the murder of Malcolm X, the formation of militaristic groups like the Black Panthers, the urban rioting, White resistance in the South, and, perhaps most important of all, the war in Vietnam, which would eventually destroy Johnson's achievements as a crusader alongside King for civil rights and also be responsible for sending thousands of poor and working-class young men, white and Negro alike, to their deaths. These are important reminders of where America was during the 1960s, how far it has come since then with the election of our first African-American president in Barack Obama, and how, in many other ways, we still have a long way to go towards full acceptance of difference and diversity in America. All of this makes KING:A FILMED RECORD an epic film to match any that Hollywood itself ever did, but that is because the real-life story it tells is a true American epic of modern times. Martin Luther King was one of the greatest American citizens who ever lived, and this documentary ensures that his legacy will never be forgotten.",
         "Compiled from newsreel footage and interspersed with celebrity commentary, this film has a heavy impact, showing Rev. King, not as a saint, but as a compassionate man of God with great goals for all people. The film quality is rather rough at times, and the racial slurs shouted are harsh, but the film is powerful. Recommended for those who seek an insight to the man behind the dream.",
         "This movie consists almost entirely of documentary news footage of Dr. Martin Luther King, Jr.'s crusade for racial equality from the 1950s up to the time of his assassination in 1968. It features a wide diversity of gripping footage... interviews, sermons, marches, press conferences and speeches by Dr. King as he gradually secured basic rights and dignity for his people (and thereby for ALL people). As we sit here today, with prejudice remaining far too abundant in American society, it is nonetheless hard to believe that so much struggle and sacrifice was needed to secure what our Constitution and laws had already bestowed on all of our citizens long before Dr. King began his heroic effort. Dr. King's inspiring oratory is a potent contrast to the hatred, bigotry and unrelenting brutality he and his followers faced time and again. Scenes of police violence and jeering white racists are sprinkled liberally throughout the film and are truly horrifying. The patience and nonviolence of the African-American protesters in the face of their oppressors is remarkable. The film ends with Dr. King's funeral, an event that is foretold by Dr. King himself time and again in this film as he muses about the possibility of his death at the hands of his racist antagonists. In one such prophetic moment contained in the movie, Dr. King says: \"You know when I say 'Don't be afraid', you know what I really mean - don't even be afraid to die! But I submit to you tonight, no man is free if he fears death. But the minute you conquer the fear of death, at that moment, you are free. You must say, somehow, 'I don't have much money - I don't have much education - I may not able to be able to read or write - but I have the capacity to die!'\" The DVD is available from the distributor, Kino Lorber... don't even hesitate to buy it. This is a must-see film for anyone even remotely concerned about social justice or history.",
         "After watching 103 minute edited version (the only celeb commentary by Harry Belefonte), one has to wonder why this film isn't more available to the general public. It is by far, one of the best documentary efforts to chronicle Martin Luther King Jr. as he helped push the civil rights movement forward into the public consciousness. What makes this film special (in its condensed version) is the plainly laid out - but thoughtfully edited - chronology of Dr. King's various actions, speeches - and the public response. Other than Belafonte's opening statement, the film has no narration - which gives it an urgency. This is punctuated by King's powerful oratory (including the entire I Have A Dream speech...and segments of many others), along with footage of demonstrations, marches and material that is often hard to watch due to the racially charged violence. Still, it is a potent reminder of our history - and should be seen by all.",
         "The version of this documentary I saw did not contain any of the celebrity \"bridges\" that Maltin mentioned in his review. The version I saw, ran only 103 minutes (as to the 185 of Maltin's version) and contained only archival footage of Dr. King's career from 1955 to 1968. This version is a pure video diary of King's speeches and marches. It contains amazingly powerful footage of the nonviolent protests and the final moments of King's life.",
         "11/18/17. A bit on the long side, but at least you get the chance to listen to the entire \"I have a dream.\" No denying that King was a force to be reckoned with. His oratory style is reminiscent of the fiery preacher of past, and still quite effective in inspiring its listeners to bigger and better things.",
         "I was able to catch about the 2nd half of this on cable recently. The remnants of the divide between the North and South dating back to the civil war were played out as MLK continued his crusade in Alabama. This was a gripping account of the small victories that he rallied the public to empower themselves. I found it more engrossing than other MLK documentaries because it examined the battles more closely. But then, interspersed within this footage presented without narration, the film breaks to a stage with minimal theatrical backdrops. Periodically, a famous actor will give a 2 -3 minute famous speech from a notable source. These quotes are not given any introduction or provided any titles to inform the audience. The pieces I saw in the last part were Charlton Heston, James Earl Jones, and a few others I didn't recognise. After reading the trivia notes about this film on IMDb, I understand this was a fund raising film for a charitable organisation. That explains the appearances by the big name stars to get people to pay to see the film. On the other hand, it extends the film running time. I found myself impatient, waiting for the film to return to the shocking footage of churches being bombed, killing children. But on the other hand, seeing James Earl Jones give a powerful performance complimented the film. Production wise, there were moments of choppy editing, but letting the footage and MLK's words speak for them-self is very compelling."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History"
      ],
      "productionCompanies": ["Commonwealth United Entertainment"],
      "summaries": ["Follows Martin Luther King's life and decades long civil rights activism."],
      "budget": 0
   },
   "movielensId": 162192,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1970-03-24",
      "dvdReleaseDate": null,
      "directors": [
         "Sidney Lumet",
         "Joseph L. Mankiewicz"
      ],
      "runtime": 185,
      "movieId": 162192,
      "title": "King: A Filmed Record... Montgomery to Memphis",
      "mpaa": "",
      "actors": [
         "Paul Newman",
         "Joanne Woodward",
         "Ruby Dee",
         "James Earl Jones",
         "Clarence Williams III",
         "Burt Lancaster",
         "Ben Gazzara",
         "Charlton Heston",
         "Harry Belafonte",
         "Sidney Poitier",
         "Bill Cosby",
         "Diahann Carroll",
         "Walter Matthau",
         "Anthony Quinn",
         "Leslie Uggams",
         "Paul Winfield",
         "Marlon Brando"
      ],
      "imdbMovieId": "0065944",
      "originalTitle": "King: A Filmed Record... Montgomery to Memphis",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A 1970 American documentary film biography of Dr. Martin Luther King, Jr., presented in the form of newsreel footage and segments of recordings by Dr. King, framed by celebrity narrators, including Marlon Brando, Paul Newman, Joanne Woodward, Ruby Dee, James Earl Jones, Clarence Williams III, Burt Lancaster, Ben Gazzara, Charlton Heston, Harry Belafonte, The movie was produced by Richard Kaplan and Ely Landau.",
      "tmdbMovieId": 149320,
      "avgRating": 3.375,
      "releaseYear": "1970",
      "numRatings": 4,
      "posterPath": "/jeld2y4CsLIvFhiRVom7Thuw7eo.jpg"
   }
}