{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "unity",
            "id": 208693
         }
      ],
      "imdb_id": "tt0120169",
      "video": false,
      "title": "Soul Food",
      "recommendations": [
         20322,
         265991,
         22067,
         28121,
         39310,
         16158,
         81828,
         38803,
         25462,
         47816,
         45602,
         27322,
         14544,
         14805,
         8291,
         28353,
         26454,
         75250,
         59930,
         24664
      ],
      "backdrop_path": "/8LwGc6mkeGuq1mBkiMDWMebk0pN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Maxine",
               "gender": 1,
               "credit_id": "52fe45e2c3a368484e0745ab",
               "name": "Vivica A. Fox",
               "profile_path": "/uxTOzgRhk0VkbK1ZiOrQSTYuzAl.jpg",
               "id": 2535,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Robin (Bird)",
               "gender": 1,
               "credit_id": "52fe45e2c3a368484e0745af",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Miles",
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745b3",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lem",
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745b7",
               "name": "Mekhi Phifer",
               "profile_path": "/xrv9RDMPoTd9NsfpUzL81XglAmk.jpg",
               "id": 327,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ahmad",
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745bb",
               "name": "Brandon Hammond",
               "profile_path": "/ooljlVi5IYf2w4Px3jqc8OQdjjS.jpg",
               "id": 23681,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kenny",
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745bf",
               "name": "Jeffrey D. Sams",
               "profile_path": "/uSEZG5HqCvAzyuZ9eYzg971nSJr.jpg",
               "id": 103898,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Faith",
               "gender": 1,
               "credit_id": "52fe45e2c3a368484e0745c3",
               "name": "Gina Ravera",
               "profile_path": "/cJDWfNdmnBFSFFi1YKXCM4YVyY6.jpg",
               "id": 77279,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mother Joe",
               "gender": 1,
               "credit_id": "52fe45e2c3a368484e0745c7",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Teri",
               "gender": 1,
               "credit_id": "52fe45e2c3a368484e0745cb",
               "name": "Vanessa Williams",
               "profile_path": "/25QMiae8zSvSYObHDbYn1mgbOrz.jpg",
               "id": 27011,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Nicole",
               "gender": 1,
               "credit_id": "57549c0c92514106fe000444",
               "name": "Marcia Wright",
               "profile_path": "/7YRExXidWvylfJudpdZrsg2LSLS.jpg",
               "id": 1631215,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Reverend Williams",
               "gender": 0,
               "credit_id": "579e41519251411022001db7",
               "name": "Carl Wright",
               "profile_path": null,
               "id": 1226697,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Simuel",
               "gender": 0,
               "credit_id": "579e7aee925141106b003b2b",
               "name": "Mel Jackson",
               "profile_path": "/e7qEqOblarMz922qWGdyE5Fm44Q.jpg",
               "id": 98622,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Kelly",
               "gender": 0,
               "credit_id": "579e7b509251411022003b18",
               "name": "Morgan Méchelle Smith",
               "profile_path": null,
               "id": 1659414,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Uncle Pete",
               "gender": 0,
               "credit_id": "579e7bd3c3a36825770078db",
               "name": "John M. Watson Sr.",
               "profile_path": null,
               "id": 1659415,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745d1",
               "name": "George Tillman, Jr.",
               "profile_path": "/np4Q1q68M8ejWmkUpChXTIVrQRO.jpg",
               "id": 66121,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e2c3a368484e0745d7",
               "name": "George Tillman, Jr.",
               "profile_path": "/np4Q1q68M8ejWmkUpChXTIVrQRO.jpg",
               "id": 66121,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.585912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29461,
      "vote_count": 25,
      "budget": 0,
      "overview": "Traditional Sunday dinners at Mama Joe's (Irma P. Hall) turn sour when sisters Teri (Vanessa L. Williams), Bird (Nia Long) and Maxine (Vivica A. Fox) start bringing their problems to the dinner table in this ensemble comedy. When tragedy strikes, it's up to grandson Ahmad (Brandon Hammond) to pull the family together and put the soul back into the family's weekly gatherings.",
      "similar": [
         8272,
         4170,
         8967,
         13,
         73,
         2064,
         773,
         244772,
         112160,
         277216,
         21481,
         433,
         164457,
         10054,
         2196,
         13813,
         9679,
         8293,
         8204,
         11829
      ],
      "original_title": "Soul Food",
      "runtime": 114,
      "poster_path": "/2BiUNHq9QkgCUVGKwGIAyknFYdq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Edmonds Entertainment Group (EEG)",
            "id": 2923,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-26",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "There's Plenty For Everyone!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Tillman Jr."],
      "runtime": 115,
      "synopsis": null,
      "writers": ["George Tillman Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120169/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzOTA5OTc0OF5BMl5BanBnXkFtZTYwNzkxNDA5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Vanessa Williams, Vivica A. Fox, Nia Long | See full cast and crew »"],
      "reviews": [
         "When I first saw this film it reminded me so much of my family I actually got nervous. The story depicted in this film is so true especially in many Black families, especially mine. The story is pretty much about how a family breaks up after the matriarch becomes ill and eventually dies causing rifts to develop due to the fact that the one person who keeps the family grounded is no longer around to mediate disputes and to show love and guidance to the younger generation. This is definitely a wonderful film that should be viewed by every family no matter what race they are.",
         "This movie is fantastic! The acting is first-rate (especially Vivica A. Fox and Brandon Hammond). The storyline is touching, funny, and poignant. This film wisely avoids being a \"chick flick\" and tells about a regular middle-class African-American family, something we don't see in movies that often.",
         "I didn't really want to see Soul Food that much but I thought I might as well give it a go. I was fully impressed. I was glued to my seat the whole way through. The acting is superb, the storyline is both funny and touching. It is an unmissable film telling the story of an Afro-American family going through hard times. Trust me, Soul Food is a good film which left me shocked at how touching and how nice the film was. My rating : 8/10.",
         "I totally enjoyed this movie. It had me full of emotion and rubbing my belly all at the same time. It's hard to understand why all families cannot sit down and enjoy times like the Joseph family had. Lem getting arrested, Teri & Max at each others throats, Mama Joe's illness, and Faith and Myles' bad deed really tested that love. This was a film that brought to light about hard times and rising above them. One person can make a difference. Ahmad proved that by getting the whole family back for \"sunday dinner.\" It is always a silver lining to a negative situation. That food would definitely bring me back! We need more of these times in today's world. Forget materials things, love is bigger.",
         "I love this movie. I just saw it for the first time and could kick myself for waiting so long. Brandon Hammond is a hoot and Viveca A. Fox was wonderful. It is so nice to see a movie centered around an African-American family that wasn't about hoods or hip-hop. Every family, black or white or whatever, can identify with the kinds of problems this family had. There is a poignant, endearing quality to this movie that just appealed to me and I would recommend it to anyone who needs a \"feel-good\" fix without the sweet-as-saccharine quality so many movies have.",
         "Excellent movie. identifiable with the African American Families. Mama Jo was a strong parent seeking only the very best for her fatherless family. The responsibility of raising a child after a parent dies is so right! The jealousy of siblings is right on, and the ability to still love each other was so familiar. African Americans may see themselves in this film. We do love to cook big meal, and we do love to feed others. I wonder if inviting the Pastor to Sunday dinners is happening. One thing is a puzzle to me....Rev. enjoyed the dinners, and the wedding, so where was he when the great cook Mama Jo was in the hospital, and at her burial? It is strange because after Mama Jo passes away, The good Rev. is again sitting at her dinner table. And how can one believe all the money that was packed in the back of Uncle's portable TV. In the movie, the narrator says that the Uncle had not left his room in years but sits there watching his TV.",
         "The actors do a great job. It basically lays problems right out on the table which instead of ignoring problems that a lot of families are used to doing, this movie casts these things out to give us a sense that problems should be worked out. It follows the theme of how one should see that \"family is a commitment to one another and not an obligation\" very well.",
         "OK, so I waited for 4 years to see this movie. Silly me. This movie was very good. Not great, but very good. The acting really carried what was a mediocre script. The movie did peak my interest in how this family addressed issues openly among themselves. They did not try to sweep things under the rugs. Rather, they used \"Sunday dinner\" as an opportunity to address tough family issues such an infidelity, gambling addition and encarceration. The film was also successful at capturing many aspects of a typical, 90's African-American family. Being half African-American, I can see traces of my very own family in this film and thought that the script was very true, open and honest.",
         "the movie exemplifies what the black family can and should be. strong through the tough times. As a black lady, I can relate to the drama that the family goes through and how their Sunday dinners kept them close. To the person who said Kingdom Come was way better than Soul Food just proves that no movie can satisfy everyone. This movie was incredible and believable. But I felt that Kingdom Come was to put mildly boring. It does not stick out to me at all as a memorable movie. It was alright. No to bash anyone but obviously taste in movies differs person to person.. but I must say Soul Food was great...the acting was magnificent...especially Vivica and Vanessa. LOVED THIS MOVIE. Plus the movie features fabulous music.",
         "Appetizing, home-cooked Sunday dinners save a family in stress in writer & director George Tillman, Jr.'s autobiographical movie \"Soul Food,\" an emotionally satisfying but occasionally saccharine tour-de-force family melodrama. Comparisons with \"Waiting to Exhale\" are inevitable, but \"Soul Food\" shuns a sexist agenda that attributes its many ills to one sex at the expense of the other. Neither men nor women escape the devastating toll of the storyline. An ensemble cast of charismatic performers, an entertaining plot that alternates happy moments with tragic episodes, and Tillman's imaginative helming gives \"Soul Food\" a memorable if sometimes schmaltzy appeal. Eating Sunday dinner at Mother Joe's house constitutes an age-old family tradition for three Chicago, Illinois, based sisters, Teri (Vanessa L. Williams of \"Eraser\"), Maxine (Vivica A. Fox of \"Batman & Robin\"), and Bird (Nia Long of \"Friday\"). Mother Joe (Irma P. Hall of \"Mo' Money\") lives to indulge her quarrelsome trio of daughters as much as her adorable grandchildren. Her favorite is Maxine's oldest son, Ahmad (Brandon Hammond of \"Mars Attacks\"). Tillman filters the poignant story of this family from the juvenile perspective of Ahmad. As \"Soul Food\" unfolds, Bird has just married Lem (Mekhi Phifer of \"Clockers\"), a guy whose criminal record has already cost him his job. As the elder sister, Teri acts as the chief financial genius of the family. She has an eye and a heart for dollars. As an affluent attorney, Teri has bankrolled her youngest sister Bird in the beauty parlor business. Teri also supervises her mother's estate and manages the family's purse strings in woebegone times. Teri never lets anybody forget her pecuniary sacrifices, especially Maxine. Teri's overwrought attitude alienates her younger sister Maxine. Rivals since high school, Maxine stole Teri's boyfriend and took him to the altar. While Teri persevered with her college education, Maxine dropped out. Her husband Kenny (Jeffrey D. Sams of \"Waiting to Exhale\") and she started their own family. Two girls and a boy later, they have managed to survive on Kenny's blue-collar salary with no ill effects. Teri struggles to make her second marriage a success, but her greed and holier-than-thou attitude sabotage her well-intentioned efforts. Eventually, Teri's attitude jeopardizes her marriage to Miles (Michael Beach of \"White Man's Burden\"). Although Miles and she are both well-heeled attorneys, he has been bitten by the music bug. Miles wants to form a jazz band, something Teri holds in utter contempt. She argues that Miles could be earning more money at the bar\u0097the legal bar. No matter how much these sisters bicker, they always show up for Sunday dinner at Mother Joe's house. No sooner has Tillman set up the plot than he introduces a string of predicaments that starts with Mother Joe's tragic trip to the doctor. It seems that the indestructible matriarch must have a leg removed or she will die. Reluctantly, Mother Joe consents to surgery. During the operation, she suffers a stroke and slips into a coma. The sisters maintain a vigil at Mother Joe's bedside, but their relationship continues to sour. They argue over Mother Joe's hospital bills, and the traditional Sunday dinner is the casualty of their rage. Young Ahmad doesn't understand the family fracas. He doesn't understand why Teri and Miles have drifted apart or why Lem has been arrested and jailed for brandishing a firearm in a bar. Ahmad holds his own vigil at his grandmother's beside. If Mother Joe cannot physically reunite the fragmented family, then perhaps Ahmad can. The ambitious youngster cooks up a plan that he is certain will bring the family back together for a traditional Sunday dinner. Nothing particularly original distinguishes \"Soul Food\" from a hundred or so similar family melodramas. The formulaic Tillman script plunges each character into a soup of despair. Indeed, \"Soul Food\" would rate as little more than an ethnic potboiler were it not for Tillman's nimble directing. Although the soap opera storyline alternates one sister's plight with another sister's predicament, the characters are so believably drawn and the atmosphere so filled with genuine sentiment that the film succeeds in spite of its clichés. At times, \"Soul Food\" degenerates into plain, old-fashioned mush. A subplot involving an elderly, anti-social relative named Uncle Pete (John M. Watson, Sr. of \"Groundhog Day\") who hides in his upstairs bedroom is pretty warmed-over. Ahmad's plan to reunite a family as suspicious as each of these relatives is seems a little far-fetched, too. Although \"Soul Food\" is a movie about a family, some of its content may not be appropriate for all family members, especially juveniles. The performances are all marvelous. Each cast member plays a substantial, flesh-and-blood character with hopes and dreams. Hall steals the early scenes as Mother Joe. When one of Lem's curvaceous old flames threatens to disrupt Bird's wedding reception, Mother Joe adroitly rescues her son-in-law without stirring up discord. Mother Joe's speech about how one finger accomplished less than a knuckled-up fist is one of the movie's rousing highlights. Williams has the plum role as the materialistic sister who always gets the rough end of the stick. As her chief rival, Fox is less materialistic and more maternal. Phifer brings credible dimensions to his role as an ex-convict who faces the same song and dance from every employer who is afraid to hire him. You don't have to be African-American to appreciate \"Soul Food.\" Although the movie is aimed at mainstream black audiences, the problems that this family confronts are universal to any family. Ultimately, the sympathetic characters and the rich atmosphere of loving kindness that permeates the action compensate for the sappy story. Tillman boosts things immensely by rejecting a happily-ever-after ending, give the film a significance that it otherwise might lack."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Edmonds Entertainment Group (EEG)"
      ],
      "summaries": [
         "Matriarch Mama Joe has held her family together for 40 years around a Sunday dinner of soul food. When diabetes hospitalizes her, the dinners stop and tensions among her three daughters start to break the family apart. Two of the sisters feud continuously: Teri is jealous of Maxine's marriage and irritated that everyone assumes her corporate salary is open to the rest of the family's uses. Maxine resents Teri's bossiness and insensitivity to family tradition. Bird, the youngest, newly married to an ex-con, accepts a favor from an old lover that leads to her husband's arrest. Mama Joe's grandson Ahmad cooks up a scheme to bring the family together, back to the table.",
         "One person can keep a family together and, when that one person is gone, a family can be torn apart."
      ],
      "budget": 7500000
   },
   "movielensId": 1621,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1997-09-26",
      "dvdReleaseDate": "2001-04-03",
      "directors": [
         "George Tillman",
         " Jr."
      ],
      "runtime": 114,
      "movieId": 1621,
      "title": "Soul Food",
      "mpaa": "R",
      "actors": [
         "Vivica A. Fox",
         "Nia Long",
         "Michael Beach",
         "Mekhi Phifer",
         "Brandon Hammond",
         "Jeffrey D. Sams",
         "Gina Ravera",
         "Irma P. Hall",
         "Vanessa Williams",
         "Marcia Wright",
         "Carl Wright",
         "Mel Jackson",
         "Morgan Méchelle Smith",
         "John M. Watson Sr."
      ],
      "imdbMovieId": "0120169",
      "originalTitle": "Soul Food",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["OijFtJ5iHzg"],
      "plotSummary": "Traditional Sunday dinners at Mama Joe's (Irma P. Hall) turn sour when sisters Teri (Vanessa L. Williams), Bird (Nia Long) and Maxine (Vivica A. Fox) start bringing their problems to the dinner table in this ensemble comedy. When tragedy strikes, it's up to grandson Ahmad (Brandon Hammond) to pull the family together and put the soul back into the family's weekly gatherings.",
      "tmdbMovieId": 29461,
      "avgRating": 3.26263,
      "releaseYear": "1997",
      "numRatings": 752,
      "posterPath": "/2BiUNHq9QkgCUVGKwGIAyknFYdq.jpg"
   }
}