{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt1213926",
      "video": false,
      "title": "The Sicilian Girl",
      "recommendations": [
         5413,
         40071,
         28047,
         31008,
         1294
      ],
      "backdrop_path": "/dfWujFkTHLIW2X2nx1Bf054Vpwx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe445f9251416c9100e6a1",
               "name": "Veronica D'Agostino",
               "profile_path": "/hXNjR21h1kFSFgBinVyPiH5qsvv.jpg",
               "id": 72737,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Judge",
               "gender": 2,
               "credit_id": "52fe445f9251416c9100e6a5",
               "name": "Gérard Jugnot",
               "profile_path": "/vaYvo2SJZw8MgBhZOkBAAVSpmg9.jpg",
               "id": 21171,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Vito",
               "gender": 2,
               "credit_id": "52fe445f9251416c9100e6a9",
               "name": "Francesco Casisa",
               "profile_path": null,
               "id": 20590,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Don Michele",
               "gender": 2,
               "credit_id": "52fe445f9251416c9100e6ad",
               "name": "Marcello Mazzarella",
               "profile_path": "/dfWKDbbhhAeocP6Es2mKEKYHjF4.jpg",
               "id": 107624,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Don Salvo",
               "gender": 0,
               "credit_id": "52fe445f9251416c9100e6b1",
               "name": "Mario Pupella",
               "profile_path": "/62wSo5jD5vjtBq5b6bHFO9r20MW.jpg",
               "id": 107625,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bruni",
               "gender": 2,
               "credit_id": "52fe445f9251416c9100e6b5",
               "name": "Paolo Briguglia",
               "profile_path": "/1syznbCncrXUcBaUjn2WZPdREEK.jpg",
               "id": 107626,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Pubblico ministero",
               "gender": 0,
               "credit_id": "5948ea1bc3a36816c505255b",
               "name": "Manuela Mulé",
               "profile_path": null,
               "id": 1836261,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe445f9251416c9100e6bb",
               "name": "Marco Amenta",
               "profile_path": null,
               "id": 107627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe445f9251416c9100e6c1",
               "name": "Sergio Donati",
               "profile_path": null,
               "id": 5555,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe445f9251416c9100e6c7",
               "name": "Marco Amenta",
               "profile_path": null,
               "id": 107627,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.073922,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 31111,
      "vote_count": 18,
      "budget": 0,
      "overview": "Inspired to a true story, on November 5th 1991, Rita Atria a young 17-year-old Sicilian girl, goes to see an anti-Mafia judge Paolo Borsellino to denounce the Mafia system that was responsible for the murder of her father and her brother. It is the first time that such a young woman from a Mafia family rebels and betrays the Mafia. From that moment on, Rita's days are numbered. She only has nine months to live...",
      "similar": [],
      "original_title": "La siciliana ribelle",
      "runtime": 113,
      "poster_path": "/ygk3InIn9UDJLh15QUxZwxVZ6jQ.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "R&C Produzioni",
            "id": 19385,
            "origin_country": ""
         },
         {
            "logo_path": "/mOL2WcHtox2urbUf1oJvjw7kz01.png",
            "name": "Rai Cinema",
            "id": 2683,
            "origin_country": "IT"
         },
         {
            "logo_path": null,
            "name": "Euro Film",
            "id": 26879,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Roissy Films",
            "id": 2282,
            "origin_country": ""
         }
      ],
      "release_date": "2008-12-31",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "What would drive a seventeen-year-old girl to betray her family? And if that family was the mafia?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marco Amenta"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Marco Amenta",
         "Marco Amenta"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt1213926/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjAwODQ2MjAwMl5BMl5BanBnXkFtZTcwNTgzMTk2Mw@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Veronica D'Agostino",
         "Gérard Jugnot",
         "Marcello Mazzarella"
      ],
      "reviews": [
         "Having lived in Sicily, this movie had extra relevance for me, especially as it deals with an aspect of the investigations into the Mafia, by magistrates Falcone and Borsellino, and the resulting maxi-trials in Palermo, with which I was not familiar, namely the part played by Rita Atria. I particularly liked the way the role of the mother typifies the see-nothing/say-nothing attitude of the people. This is emphasized in the scene where Rita's mafioso father is murdered by a rival. Windows and shutters are quietly closed and the piazza is deserted save for the corpse. The director also deserves credit for not making Rita a docile, frightened informer; instead she is feisty and she is not slow to tell the police what she thinks of them. It is a beautifully paced movie,with a well-told tale and is, like, \"Gomorra\" which concerned the Neapolitan Mafia, the Camorra, a movie that makes you angry. Angry at the utter scum who still permeate society in southern Italy and angry at the corruption of public officials who deal with such scum. At least something good has come out of those investigations and trials. There is a grassroots movement in Palermo called \"addiopizzo\". Young business people who were so shocked by the excesses of the mafia during the period of the investigations and the maxi-trials that they took to the streets, as can be seen in real-life footage at the end of this movie, and declared they were no longer willing to pay the \"pizzo\" (extortion) money demanded by the Mafia. A gripping and important movie.",
         "Only because more people will have seen \"Veronica Guerin,\" I cite that splendid film as an introduction to \"The Sicilian Girl.\" The themes are similar -- true stories of young women who invite death by exposing murderous activities. In this case, Rita Atrria (Veronica D'Agostino), a 17 year old from a Sicilian village controlled by the Mafia, takes her story, documented by diaries she has been keeping for many years, to an anti-Mafia prosecutor, Paolo Borsellino (Gerard Jugnot) seeking vengeance for the murder of her father and brother, both of whom were themselves members of the Mafia. Rita's diaries confirm incidents which the police have tracked and lead to the arrest of her town's Mafia chieftains, including the ones who had her father and brother killed. To avoid spoiling the story, I will offer no more of the details except to say that Rita's revelations make both her and Borsellino targets for assassination. Ms. D'Agostino and Mr. Jugnot are excellent actors, and a number of other roles are very well done. The movie is exciting and well worth the two hours it takes to watch it. As with any of the movies based on a \"true\" story, one is left wondering where truth leaves off and fiction takes over. I can guess at the juncture, but for the most part \"The Sicilian Girl\" is very convincing.",
         "This is a movie I would see again and again. The is the kind of film that pays tribute to the true cinematic experience: a perfectly told story with beautiful cinematography that lets us move along with the characters and took the necessary time to let us care about these people. Wonderfully directed, with awesome performances by the actors. While some directors might have chosen more violent scenes in this true account of going up against the mafia, Marco Amenta chose something we don't see too much in films anymore: imagination. This film unfolded rather than assaulted, tantalized rather than terrorized. Bravo!",
         "While this film adds one of the faces that could easily be overlooked in the saga against the mafia in Sicily, it's just not quite there. The wide shots are typical of setting the scene in different places but the angles are trite and not not reflecting of other realities. Example: A piazza in a small town at mass with 1 or two families? Where are the other extras? The script unnaturally plays to the uninformed audience (why would a prosecutor tell a Palermo policeman how far a town is on the island? Why would the same judge inform, on the way to the courtroom, that the defense has the best lawyers? All are items that could have been interlaced better into the story and thus add the real drama that actually played out. Rita's story deserves to be told and for that the lay audience needs more context but we have lots of real material that could have been unobtrusively added without detracting from the imaginary settings/details. Of course, the film has particular moments of veracity: the hush attitude, the insolent exchanges with police, the Sicilian's simplicity in honor. The film fits in a context of other life to art about the Falcone period.",
         "Rita Mancuso, 11, born in Sicily gets the afflictive experience of watching her father, respected Don Michele shot by a rival mafia family. This inflicts greater incorrigible wound in her heart thus insisting on execution of her fathers criminals out of the reputation and weight her regal family carried. 7 years later when the plan hatched by her brother to avenge their father's death goes futile resulting in the murder of brother, she offers her help to law to satisfy her personal vendetta. From here on follows the story of Rita raging a war against the mafia based on true story. Languishing in my hard disk for over a year I finally caught up with this Italian/Sicilian movie. The movie shot in picturesque Italy with distinctive roads, artistic houses and Corleone-esq feel is symbolical of the situation at the time. The movie premise is 1985-92 during which there was collective negligence by the government towards the region and hence it culminated the dominance of Don mafia.According to the true events I read later, the movie for most part stays true to the events occurred in reality. Although there isn't much startling about the movie or it's revelations, its intriguing to trace the path of a lone girl against a huge empire. What's also very interesting is the development of Rita in the movie, as she is shown a egoistical, domineering proud Sicilian at first. When she approaches the law to punish the mafia, she tells them she is offering her services and not asking for help. She is shown as this fiery character who listens to nobody as fixes on the notion that she should carry forward her great family legacy and avenge the murder. Later when the things comes to light about her family, she finds it difficult to understand her existence, she thinks the prosecutor is the only guy who understands her. This transformation of Rita is what I found most enjoyable, yet it had it's shortcomings. The one major flaw of the movie was the cast, for me the role of Rita needed extreme aggressiveness and had to be overtly bold. Here in some parts the actress Veronica D'Agostino lacked/underplayed the portrayal. Also the aforementioned actresses either never looked 17(character age) or Sicilian age suspiciously faster. The supporting cast of Gérard Jugnot,Lucia Sardo played their role according to the story. Also I liked the small scene shot outside Colosseum. A very interesting movie and a definite watch if you have two minds about it.",
         "Rita Mancuso's father is beloved Don Michele in Balata, Sicily. He orders the death of Bellafiore who murdered innocent peasants. A prosecutor arrives to confront him but the villagers support the Don rather than the corrupt incompetent police. Six years later, Rita is 17 and the village is awash with drugs. Her brother Carmelo gets killed and Rita brings in her evidence to the prosecutor who actually got her father's respect. She testifies against the Sicilian mob as revenge for her family's murders. The story is somewhat muddled. Veronica D'Agostino is good as the fierce heroine. She isn't a pretty little thing but she has a nice vulnerability. Gérard Jugnot is also good. The material is there but the intensity is dispersed. The tension comes and goes. This should be a great character study of the Girl but the final ending should not be as confused.",
         "One of the reviewers (from Minneapolis) said \"bad choice of casting the leading actress prone to overacting.\" Nope. Growing in a NY Neapolitan/Sicilian neighborhood, I didn't see her overacting. That's just the way my BFFs were. Dramatic. Passionate. Over the top. I found her performance an honest portrayal. (And laughed at the scene where the cop buys her colorful clothes, b/c everyone in NY, Sicilian or not...wears black.) PS: My family visited Sicily the year this trial took place. I remember the guards w/Uzis both out side the Palace of Justice and in the airport. And I'd give this movie an 8.5.",
         "Someone tells you one word: \"Sicily\". Quick, quick, what do you think? you think of Godfather scenes, of rolling rural landscapes, societies scarred by vendettas and inter-family violence, closeups of old rugged facial lineaments, scenes of emigration on rural lifestyle. Now, the true Sicily is much different, with modern office buildings, people holding cell phones and having business meetings, and a much more urban society. For a motion picture financed and produced just a few years ago, and supposedly on a modern story, this production was a disappointment. Totally stereotypical. I mean, Antonioni's \"L'Avventura\" from forty years earlier looks much more modern. Obviously, the producers wanted to create a cash cow and sell it to the American audience, still nostalgic of the GF series. Smart movie-goers can easily see through the facade, and not like this production. The producers think that the audience is stupid enough to see their stereotypical work. If you want to see a motion picture that portrays modern Italy with its crime-ridden background, see Gomorrah.",
         "Sicily and mafia. It would be a first thought an average person would have, however unjust or unfair it might be. \" The Sicilian Girl\" is a strange, a bit clunky movie, torn between the court drama and passionate bloody opera. The medieval, macabre, isolated world of rural Sicily, with its outdated sense of honor and codes of conduct, that nobody else would understand or relate to. The heroine of this movie is a strong willed, privileged young woman, trying to avenge the death of her father and brother. Gradually, she manages to accept the fact that they both, were criminals, like the people she hated. The movie is missing something hard to explain,firmer shape, and there is a bad choice of casting the unfortunate leading actress prone to overacting.",
         "This mafia revenge story might have been a good film but, a weak script and some horrendous acting render it with the kiss of death. As a child young Rita witnesses her father's cold blooded murder at the hands of a rival mafia clan. Years later in an attempt to bring justice she seeks the assistance of the district prosecutor and is placed in a witness protection program in Rome. While strolling the Colosseum she feels she is being followed. Moments later she encounters the stranger and shortly after is calmly chatting with him soon they are dating. It is mindless and ridiculous instances like this that completely undermine any credibility in this tale. Her life has been threatened but, somehow it's okay to strike up a budding romance with some guy in Rome. Much later Rita is placing phone calls home from her Rome apartment not terrific thinking if you value your life and your enemies can easily be tapping the lines. Aside from many flaws within the story the biggest fault with this film was the casting of Veronica D'Agostino in the title role. Ms. D'Agostino is an acting neophyte and it shows with every over the top glare and pained expression she delivers. In her attempt to appear indignant her face contorts in such odd fashions she looks somewhere between constipated and deranged, or both. She is capable of one note throughout the entire film, anger. In fact you get the feeling that the love interest she encounters in Rome was probably created to develop another more uplifting shade to her on screen demeanor. A good actress would hold the picture together and elevate the weak material by giving the viewer someone to care about. The Sicilian Girl suffers from wretched acting, poor writing and should be swimming with the fishes and not in your cue."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "R&C Produzioni",
         "Eurofilm",
         "Roissy Films"
      ],
      "summaries": ["The true story of 17-year-old Sicilian Rita Atria (Veronica D'Agostino) -- who broke the Sicilian Mafia's code of silence and testified against the \"family business\" after both her father and then her brother are both murdered -- is brought to vivid life in Marco Amenta's hard-hitting and wonderfully acted drama."],
      "budget": 0
   },
   "movielensId": 162168,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "2008-12-31",
      "dvdReleaseDate": null,
      "directors": ["Marco Amenta"],
      "runtime": 113,
      "movieId": 162168,
      "title": "The Sicilian Girl",
      "mpaa": null,
      "actors": [
         "Veronica D'Agostino",
         "Gérard Jugnot",
         "Francesco Casisa",
         "Marcello Mazzarella",
         "Mario Pupella",
         "Paolo Briguglia",
         "Manuela Mulé"
      ],
      "imdbMovieId": "1213926",
      "originalTitle": "La siciliana ribelle",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Inspired to a true story, on November 5th 1991, Rita Atria a young 17-year-old Sicilian girl, goes to see an anti-Mafia judge Paolo Borsellino to denounce the Mafia system that was responsible for the murder of her father and her brother. It is the first time that such a young woman from a Mafia family rebels and betrays the Mafia. From that moment on, Rita's days are numbered. She only has nine months to live...",
      "tmdbMovieId": 31111,
      "avgRating": 3.66667,
      "releaseYear": "2008",
      "numRatings": 3,
      "posterPath": "/ygk3InIn9UDJLh15QUxZwxVZ6jQ.jpg"
   }
}