{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1384586",
      "video": false,
      "title": "Deuce of Spades",
      "recommendations": [],
      "backdrop_path": "/amoVCUEUeqAb1FyrUTOkqrFIpjc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1002,
            "character": "Hotrod girl",
            "gender": 0,
            "credit_id": "52fe48f8c3a36847f8182a71",
            "name": "Faith Granger",
            "profile_path": null,
            "id": 232746,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48f8c3a36847f8182a67",
               "name": "Faith Granger",
               "profile_path": null,
               "id": 232746,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f8c3a36847f8182a6d",
               "name": "Faith Granger",
               "profile_path": null,
               "id": 232746,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 0.364624,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56296,
      "vote_count": 2,
      "budget": 25000,
      "overview": "When a hotrod girl finds a mysterious letter dating back to the fifties hidden in her roadster, she is left with nothing but questions... She sets out to find the answers and retrace her deuce's troubled past. Who is Johnny Callaway? But will learning the truth make a difference and can a broken man ever get a second chance at a happiness long forgotten? Fast hotrods, cool cats, gravity defying swing dancing and rockin' retro music all serve as a colorful backdrop to this heartfelt, inspiring story. Discover an underground scene where counter culture is in, old school is cool and nostalgia forever reigns.",
      "similar": [],
      "original_title": "Deuce of Spades",
      "runtime": null,
      "poster_path": "/swPWTgHlV8umfOZApOQKZK1frAv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Deuce of Spades Productions",
            "id": 6934,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Faith Granger",
            "id": 6935,
            "origin_country": ""
         }
      ],
      "release_date": "2010-06-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.videobb.com/video/aED90P0QKHOr",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Faith Granger"],
      "runtime": 150,
      "synopsis": null,
      "writers": ["Faith Granger"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1384586/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMmRiMzdkZmYtZDBjMi00MDdkLWFmNWUtMzQ2NGVkOTkwYzA0XkEyXkFqcGdeQXVyMjA3MTAzNzM@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Timothy Luke",
         "Faith Granger",
         "Alexandra Holder"
      ],
      "reviews": [
         "All I can say is ... Faith Granger has created a timeless masterpiece. The hot rod culture, the meticulous attention to period detail, the characters, the story, the beautiful cinematography, the music, the whole package: I don't think I'm going over the edge when I say I had flashes of Bergman and Welles watching DEUCE OF SPADES - her editing is Oscar-worthy and there are scenes where Ms. Granger's camera work literally takes your breath away. The film is an emotional roller coaster unsurpassed by anything from Hollywood. DEUCE OF SPADES gets better with each viewing and its artistry is a pleasure to experience. Most of today's $100 million+ releases are mindless eye candy, completely forgotten when you leave the theater. DEUCE OF SPADES, made with a total budget of $100,000+, stays with you long after the film has ended. I think it's destined to be a rarity in movies: a personal, independently-made film that becomes an American cult classic with broad appeal. Granger put studio Hollywood to shame. If there is any justice, she will have a great future in film. Kevin Bishop - CANADA",
         "Deuce of Spades is a hand crafted piece of art. This is a car movie, but it actually has character development, a plot, high craftsmanship, and a meaningful message which will extend its appeal far beyond the typical car movie crowd. All the characters in this movie are fully three dimensional characters that evolve and change before the audience's eyes. They do not fall into the stereotypical categories associated with many movie characters, and show true real-life emotion, strength, and weakness. The well thought out plot keeps the audience emotionally involved with all of the characters, while giving both the character and audience room to grow. All while the plot twists create a true need to understand the characters and know the truth about the Deuce. The quality of Deuce of Spades is also fantastic. The cinematography is very nicely done; using lots of natural light that helps showcase all of the stars of this film, including the cars. The scenery and locations are also well chosen, and add a realistic back drop for story development. All the vehicles were period correct and added realism to the story. I personally like the use of the TRI fives, 1955, 1956, 1957 Chevrolets, as a way to mark the passage of time. This movie will naturally mean something different to each and every person who sees it, but it does get many messages across relating to the essence and feelings of love, rebellion, pride, passion, fear, and destiny. It is these messages along with the powerful emotions of the characters and decent acting that sets this film apart. Deuce of Spades is much better than most of the movies put out by Hollywood, and stays with you long after the credits have finished. The meaningful feelings that this movie impresses upon an individual should be done by all Hollywood movies. Simply put; most other movies get their doors blown off by the Deuce of Spades.",
         "Deuce of Spades is a move that begins telling the story of a 1932 Ford Highboy Roadster but ends up with the discovery of a love story between the builder of the roadster and his girl. This exquisitely photographed film filled with so many fantastic hot rods, jumps back in time to the mid 1950's; the age of innocence, when fast cars, rock and roll, drag racing, and good times were all that mattered to young people. Author/Director/Producer/Editor Faith Granger, has captured the look and feel of Southern California back in the days when orange groves dotted the landscape and swing dances were all the rage. Period correct in every detail Granger manages to bring back the simple life style of that era with confidence and grace. But it is her keen story telling of the lost love between Johnny Calloway and Betty Thompson that captivates the main thread of the story The most incredible aspect of this film is that film maker Granger, never went to film school, never made a film before, had never written a script, never edited a movie or scored a film before Deuce of Spades. Faith Granger is an undiscovered talent whose keen eye for detail and smart approach to film making should be making movies for a major studio. I for one look forward to more outstanding work from this most talented film maker. Lynn B. Tivens Meister Communications",
         "For an \"Home made\" low-budget film, Faith has nothing to be ashamed face other film sizes similar. Good all age story, good construction for the scenario, good choice of cars for the flashbacks, although unknown actors (except some celebrities out of the movie world that you will recognize if you are passionate ) but doing very well (we had much worse in big budget movies ),... Frankly, if there is one lesson of this movie is when we want something, you can get, Faith is the proof, just watch the end credits and listen to the first minutes of making off, she almost did everything alone, production, screenplay, directing actors, ... she even participate in the film as actress, production of the soundtrack,... Faith, you're a Lady. I don't think passionate fifties and / or cars, you can be disappointed by this small unpretentious film, or you're very critical. That was my personal opinion. Good vision",
         "Retrospective film accounts of times past involving innocent youth and classic automobiles are inevitably compared to American Graffiti. Granger's Deuce Of Spades relies on none of the elements of that film and moves into uncharted territory. Where Graffiti took us down a memorable stroll of a mere decade past, Deuce Of Spades covers over a half-century with a story that portrays the periods, lives and times of several multi-dimensional characters. A dramatic story that at first appears strange yet familiar, it encapsulates a tale any baby boomer can relate to and truly appreciate. Sans comedic relief with a true period correct depiction, it takes a hard edge look at the history of hot rodding. For the main character Johnny Callaway, was he a hood running afoul of the law or just a young man trying to make his mark and chart his future during the post war era. Was Bettie wrong to accept her parent's plans for her, or did she fall prey to the lies of a friend who wanted her out of the way. The story unfolds with true credibility, using masterful cinematography that totally belies the films low-to-no budget. Standing head and shoulders above other entry-level films in release today, Deuce Of Spades is like a good book you can't put down and one you will return to for a second look. Guaranteed! Larry D",
         "The quality of this film can only be described as incredible, when one considers that Faith Granger is virtually a total amateur in the field of making movies and all the aspects involved to create this movie. But her passion for the Hot Rod lifestyle shines through in the attention to create total realism for the era being depicted in this movie. When you also consider that virtually all the actors were also appearing in a movie for the first time and played their rolls so well, tells me of their commitment and the belief they had in Faith and her production. The storyline is such that one doesn't have to be into Hot Rod and Custom cars to enjoy this film. Because the storyline isn't totally about the hot rod and custom cars. At the end of the day this is a love story set in an era that Faith obviously loves. But I see that she does not do this in a self indulgent way. She came up with a concept that she believed in and went for it. And as I suggested earlier the end result is stunning. I would highly recommend this movie to anyone. Geoff aka whodaky",
         "I waited it seemed like forever to finally see this film. It was worth the wait. My wife and I enjoyed the story line and wonderful videography of the film. I think Faith's choice of sound track was also cool. The scenes, locations and especially the cars were period perfect. If you look at my bio it'll show you my age and the time I grew up around hotrods. Here in the midwest they were few and far between so it was great seeing the early hotrodding years. And I'm sure the younger generation will also enjoy it. I'd love to view the movie on the big screen and I think it would enhance the movie if and when that happens. Faith's determination to shoot a beautiful \"hotrod\" movie was well done with the Deuce of Spades!",
         "I got the movie to watch it for the 1950's hotrod element but was pleasantly surprised by a wonderful and touching story that made this 46 year old man get teary eyed 3 times. The nostalgic era of 1950's hotrodding is captured as if we were watching footage from then, only on modern video. The cars make you want to be there. Then there is the story that sucks you in, even if you are not the sentimental type. Faith Granger unfolds her story so well, and ties in the hotrods so perfectly, that you don't even realize how much these characters suddenly mean to you. The cinematography provides a warm and inviting feel to the movie. Much of the daylight scenes are filmed during \"magic hour\" when the low sun provides a warm orange glow, or else the genius of Faith Granger just got the lighting perfect that way to provide the look. Get it, watch it, you'll love it too.",
         "If you'll read the other reviews, you'll notice that every single one of them gives the movie the maximum rating, gushes on about how great it is, etc. It is extremely clear that these aren't reviews by random people who \"just happened\" to rent the movie or see it online or whatever, they are obviously people who somehow know the filmmaker, are members of hotrod groups to whom this film has already been marketed, etc. It's obvious that the film's owner/creator/whatever has solicited these comments and reviews under the mistaken impression that they will somehow influence others, which is a mistake. I just watched it online, it was certainly good for a first effort, but Jackie Grainger still has a ways to go when it comes to perfecting her craft. This is a noble first time effort, but it doesn't, contrary to the \"sincere and unsolicited reviews\", deserve a spot in the \"top films of all time\" et al. The acting is, in spots, terrible and at more than two hours, it was about 30 minutes longer than I felt it should have been (a common mistake made by first-timers who cut their own work).",
         "My expectations were set high on this film as I am a car buff and a hotrodder. Too bad, I must say, I was disappointed. Not of the cars in the movie, which are great, but to the acting. I know the budget of the film was close to nothing and it shows. The dialogue is poor, the acting of almost the entire cast is even worse (almost like an 80's pornflick) and I wish that Faith Granger had stayed behind the camera. As for the photo, it's quite good in the car scenes but why the slowmotion shots when the filmmaker shows a leg or two? The story around the main character in the film, the hotrod named Deuce of Spades, is interesting. I only wish that Faith Granger had taken her story to a professional filmmaker for advice and executive production instead of doing everything herself.",
         "I'm reading the other reviews and all I can think is that OBVIOUSLY this first-time film maker is begging friends to give this film a high ranking. Don't waste your time! I won't even say it is valiant effort for a first time film maker. It's horrible. The acting makes me cringe. The story is Hollywood predictable. There is nothing refreshing about this film. Just an attempt to showcase a culture that not many people are aware of. The hot rod car scene/rockabilly music culture has been thriving for years albeit in small numbers. She's not showcasing anything \"new\" or \"amazing\". She's showcasing lack of talent. This is like a film \"popularity\" contest. The only thing this film has going for it is the \"social networking likes\" that it has been given. I see links for it posted on H.A.M.B and other hot-rodder/kustom boards - and that is where THEIR interest lies. In the cars. And after that? SO WHAT? Bad boy and good girl love story? PLAYED OUT....over and over again. Yet another movie that portrays \"tough guys\" from the 50s in cuffed jeans, white t-shirts, boots and leather jackets. Yeah....that stereotype is GETTING OLD and is pretty off base too. Congratulations on the so called $0 budget that this was made on. That budget is VERY evident in every aspect of this film! Don't waste your time. Watch Happy Days if you need your bad-boy-leather-jacket-wearing fix. At least the Fonz is more entertaining than this drivel!",
         "In my opposite coast relationship with Faith Granger, what I've found amazing about her is devotion. And attention to detail. And fearlessness. And the use of a switchblade. Although, I have come to recognize that she is actually a Swiss Army knife, one of the big versions - a tool for everything. I enjoyed her \"filmmaker's commentaries\" immensely, especially after watching the film twice, in which she deploys said knife: \"I'm a hot rodder, Joann,\" hardeeharhar! Deuce of Spades is a devotion film; part love story and part journey with a fine dusting of authentic rodding culture post WWII. It doesn't parrot any other hot rod film with a lot of quaint notions about youngsters. Instead, we see Faith herself set out to discover in this film, a story, interlaced with revealing flashbacks. It is pleasantly surprising and authentic. So please, visit the Deuce of Spades website. Buy the DVD. Buy a t-shirt and renew yourself with a second chance.",
         "This is a tour-de-force by the incredibly talented Faith Granger, who almost single handedly willed this into being. Very high production values for a no-budget films that only suffers from occasionally wooden dialog and stiff performances, which can easily be ignored. The centerpiece of this film is the hot-rod cult of the 50's and the men and women that filled it with drama. I knocked it off one point as mentioned above for the wooden dialog and stiff performances. I think if Ms Granger could pull in more talent instead of having to do it all herself, she could easily overcome these problems in the future. I knocked it off another point as the plot did get a touch melodramatic at times. I described it to a friend as a mix between American Graffiti and The Notebook (for it's framed story approach). While I love American Graffiti, The Notebook was definitely not in my top ten. Bottom line: if you love hot-rods, this is a must see. If you love a good story, and don't mind a little melodrama, again, must see. I can't wait to see if Ms Granger can top this.",
         "Does this movie have some likable elements? Yes. Is it plausible that anyone over the age of 12 would give it 9 or 10 stars? Not in the least. The dialog and acting are amateurish to the point of being a constant distraction. The director's choice to keep showcasing her own self in slow-mo soft focus shots really makes me wonder if the point of this film was to tell a story or just create an homage to her own looks. The soundtrack is pretty good. The quality of actual film making is very impressive for first time effort. But the script could have benefited from some professional editing, the actors could have been much better (though the acting may not have seemed as bad if their lines were more realistic). And the movie was way longer than it should have been. Thumbs down.",
         "I DO believe in second chances (tag line from the movie). If you love your cars and love life, this movie is a MUST to see. It tore at the very heart of my emotions. I could relate to it all. I compliment Faith Granger on doing a fantastic job first time round with her acting, film making and producing and more. The inital set up of the story line was good, and i didn't get lost in between present day and 50 years before. Great use of black and white in the beginning to put you into that \"historic\" mode. This is a movie about hotrodders, for hotrodders, by hotrodders. If you EVER had an interest in Hot Rods, you won't be disappointed in this movie. If you have a spare hour or so, see this film.",
         "Set against the backdrop of the early 1950's, Deuce of Spades whisks you away into the very heart and soul of classic hot rodding. More than just lots of very cool cars, and believe me, there is a veritable sea of timeless classics, at its core, Deuce of Spades is a powerful and moving love story. Woven into the colourful tapestry of swing dancing, vintage rock 'n' roll, saddle shoes, and fast cars, this movie goes straight for your heartstrings and doesn't let go. Hang on tight 'cause you're right along for the ride with Johnny Callaway, (wonderfully played by Timothy Luke) and his Deuce of Spades. Faith Granger has created something truly magical that will stand for years to come as a landmark in independent cinema. There's an honesty and passion which comes through and the only thing which touches me more than the story portrayed in the movie is the story behind its brilliantly gifted creator.",
         "Yes there is no specials effects, yes it's not a blockbuster but yes it's what cinema must be..... Passion. Because this film was made with passion and heart.I prefer this independent film to \"A transformers\" because just after watching it I was happy of speeding 2 cool hours. The actors are nice and charismatic, the music is excellent, and the cars. I want one. If you're looking for a great moment of homemade cinema with authenticity and will expect cinema will not be only blockbusters. Please buy it, don't download it. Please Please Please help the independent cinema. So thank you Faith Granger and I Hope you could make another film........I buy it right now.",
         "I was invited to a screening of the film at a friends B-day. 4 or 5 guys over for food and a movie. We are all into vintage cars. I knew nothing about the film or plot. As it unfolded (I had planned to leave early for work day following), I was mesmerized and was stuck in my chair right until the end. I had to \"know what happened.\" OK so lets talk content. I fell in love with the chick buying the car. I think it was the way the story unfolded that got me. The pace. Coupled with the stunning color, shots, angles; what filled the frame along with the music and cuts, pulled me in. And of course \"The Car.\" All the sudden OK there are cool cars but oops so this is a ..... story also. I am always up for a good one, along with a mystery, and the rumble of souped up motors. I found the cutback in time to black and white fading back into color (present at the time) a clever vehicle (not car), for moving me through time. I liked Johnny He was a like-able motorhead. Full of himself but not too much...I loved the chase of the girl. Details Details, but this is me the guy watching as a film lover and story lover. Overall the Characters in the film were interesting and \"fit\" amazingly well. I think though (filmmaker now talking), that the film left me feeling like I had been to a magical time, a moment somewhere in time I had never been, familiar but new, told differently. The way the filmed looked From a photography standpoint was visually \"excitingly beautiful.\" The long lens shots of the deuce ripping across the desert, made me want to be in that car with the wind in my hair..and dust in my eyes. I could taste it...Bravo to all who were involved. Different film genre entirely but the way the cast production crew and all who speak about Forest Gump...say it was amazing and engrossing path working on and finishing the film. I suspect the people who where involved with this one feel the same. That the process of weaving this yarn on film will endure for their lifetime. Not just a job or a thing they did but part of their makeup and character. THIS ONE WILL ENDURE AS A MODERN DAY MASTERPIECE FROM OUTA THE FIRE (coming from the pipes), and into your HEART. Lastly - THE music The MUSIC and The editing...BRILLIANT, AHhhh sigh! and oh yes FAITH - ow ow oh wow... P.S. My personal taste is I do not like the name of the Lord taken in vain and I would never say it on film. It is what the characters would have said; kept it real. Then again I don't like smoking. The characters and scenarios were \"authentic\", and is what counts in a film and a story.",
         "Taking into account this is a movie from an \"unknown\" and obviously done on a budget, my wife and I both came away with the feeling that the lady that made this movie has \"what it takes\" to make movies that will get into your soul and move you. I bought this movie because I'm an old-time hot-rodder, but my wife and I were both tearing up at the end, and that's got nothing to do with the cool cars in the movie, it was because the movie really brought out our emotions. It's a great love story. We want to see it again, and this time we'll invite some friends over. I think a good comparison is to the movie \"World's Fastest Indian\" which, on the surface could be dismissed as a \"motorcycle\" movie, but is really a great movie that can appeal to anyone. We'll be watching for more from Faith.",
         "I had a great review in mind but only 1000 words? Too short! But I've watched it more than few times, if for nothing else than the sounds of the flatheads. This was my era. I loved the cars, grew up with them, was raised in the SoCal area and still have the urge, currently have a '29 flathead Ford and a'40 Ford coupe. The film not only reminds me of my youth but keeps me going now. Thank you for your effort. I've hung out at some of the locations shown, albeit a few years ago... considering today, I wish we could go back to that simpler time. Congratulations on a great period piece, one that helps us relive our youth and those golden times we had. Looking forward to a sequel. Bless you.",
         "I saw this movie for the first time with no knowledge of it's story or the film's background, then after watching it, I found more of the background to this Faith Granger film. To start with, the film was excellent. To me it had the feel of a 1950's pulp fiction novel with modern day twisted amongst its pages. The flashbacks that the story is built upon is so perfectly recreated to the smallest detail. It had everything a guy could want in a movie based on a hotrod...cool cars, racing, cop chases, fights, drama and chicks. My wife loved the movie for the romantic aspects and the story of Faith researching the history of the Duece of Spades and its driver Johnny Callaway. What happened to him? What's so special about this car? The story twists and turn, but I'm not going to spoil it. Other than the story, the story behind the story is Faith Granger and her independent film. What an amazing talent. She has a great eye for detail, and for someone with a low budget and minimal experience, she has put forth a great film. Watching the credits shows someone totally involved with making this film a piece of her life. Not just staring, but writing, directing, filming, editing, producing, and even performing tracks on the soundtrack are all accredited to Faith. Oh yeah I did say soundtrack...All the tracks have that old school 1950's feel created by some great talent of today's rockabilly scene. Producing a high caliber film with a good story line, great music, and cool car is something everyone can enjoy. I did and believe it warrants a vote of 10. Steve Beistline",
         "A truly wonderful film! I watched \"Deuce of Spades\" twice the first day it arrived and I've watched it several times since then. Lots of great little details hidden in the film waiting to be discovered. Great love story of too! I also loved the car driving sequences out on the dry lake-beds! It added a touch of realism not found in most car driving films made today. Faith Granger did a wonderful job with this! I just wish I could see it on the big screen! Guys ... if you're looking for a film that will get your girl in the mood for a trip to the passion pit ... this is it! Gals ... if you're looking for a great romantic story with enough action to keep your fella interested ... this is the film for you too! Keep up the great work Faith!",
         "As strange as it may seem, I'm a french writer who writes in English and as Faith Granger, I can't understand writing unless it is deep from within, using my own moral teaching and personal experiences to maintain the very real personal and feminine touch. I highly admired the movie for many reasons, but most of all, because it's a story about second chances and protagonists who never give up on love. Florence.",
         "As an avid car enthusiast I held some hope for the film. I knew going in that it did not have a decent budget to it. I've seen many low budget films across a plethora of genres but this is one of the worst. I thought Faith should have stayed off screen. She was the one dark spot I found within the variety of actors. Why only her? Because i did see some skill in many others but it was the script that held them back. Simply because she wrote the film does not men she should have been in it. The story behind the title car was intriguing but the build up to the revelations around it was incredibly choppy. I feel the writer/creator/lead actress should have pitched the idea or allowed someone else to rewrite the script and just as importantly she should have let someone else produce. There was potential here but unfortunately it seemed ego to do everything Faiths own way was what held this film back.",
         "I was at a car show a couple of weeks ago and spotted a booth selling DVD's of this movie. Adjacent to the booth was the '32 roadster featured in the film. Of course I didn't know that at the time. Faith Granger was working the booth along with a young girl. I bought the DVD mainly out of curiosity and frankly wasn't expecting much. Faith even autographed the disc and disc case for me. When I started watching the film I was blown away by the cinematography and extremely high production values for such a low budget film. Much of the film takes place in the '50's and '60's and everything seemed to be super period correct. One scene took place in the kitchen of a home and the refrigerator, stove and so forth were all right out of the '40's or '50's. The editing and scoring was also extremely high quality....all done by Ms. Granger. The overall story (written by Ms. Granger) was also very well done and definitely holds your interest throughout the film. Some parts of it are very touching and also a little bit corny but that's all right. My only quibble with this movie is that much of the acting is sub-par. I presume that the low budget contributed to that. This bothered me in the beginning but once the film started to roll I was able to overlook that flaw. As mentioned by another reviewer, there were many scenes in the movie that were so lyrically beautiful that you wished it was you in those scenes. And I even found some moisture on my cheeks in a couple of scenes. I assumed that Ms. Granger, a first time filmmaker, probably came from a background of cinematography and editing so imagine my shock when I looked at the IMDb and found that this was her first movie in any category. How does someone with no experience and no formal training make something this well done? I have no clue. Most low budget films look like it. Grainy cinematography, poor lighting, awkward angles, choppy editing, marginal music and so forth. You won't find any of that in this film. I hope the studios find out about Faith Granger and give her some money to continue to make movies. I do have one question that didn't appear to be answered in the film. (Possible spoiler alert) After the car crash, how did the car get repaired and who was responsible for fixing it? This isn't really necessary information, but because the movie more or less tracks the path of the car from its inception as a hot rod in the '50's to the present day, this seems like an omission in the car's story."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Faith Granger Films"],
      "summaries": ["When a hotrod girl finds a mysterious letter dating back to the fifties hidden in her roadster, she is left with nothing but questions... She sets out to find the answers and retrace her deuce's troubled past. Who is Johnny Callaway? But will learning the truth make a difference and can a broken man ever get a second chance at a happiness long forgotten? Fast hotrods, cool cats, gravity defying swing dancing and rockin' retro music all serve as a colorful backdrop to this heartfelt, inspiring story. Discover an underground scene where counter culture is in, old school is cool and nostalgia forever reigns."],
      "budget": 250000
   },
   "movielensId": 162260,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-06-01",
      "dvdReleaseDate": null,
      "directors": ["Faith Granger"],
      "runtime": 0,
      "movieId": 162260,
      "title": "Deuce of Spades",
      "mpaa": "G",
      "actors": ["Faith Granger"],
      "imdbMovieId": "1384586",
      "originalTitle": "Deuce of Spades",
      "genres": [
         "Drama",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When a hotrod girl finds a mysterious letter dating back to the fifties hidden in her roadster, she is left with nothing but questions... She sets out to find the answers and retrace her deuce's troubled past. Who is Johnny Callaway? But will learning the truth make a difference and can a broken man ever get a second chance at a happiness long forgotten? Fast hotrods, cool cats, gravity defying swing dancing and rockin' retro music all serve as a colorful backdrop to this heartfelt, inspiring story. Discover an underground scene where counter culture is in, old school is cool and nostalgia forever reigns.",
      "tmdbMovieId": 56296,
      "avgRating": 4,
      "releaseYear": "2010",
      "numRatings": 1,
      "posterPath": "/swPWTgHlV8umfOZApOQKZK1frAv.jpg"
   }
}