{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1825784",
      "video": false,
      "title": "3 Geezers!",
      "recommendations": [
         76297,
         135708,
         56085,
         31281,
         61418,
         19214,
         11505,
         292191,
         273610,
         15398,
         291326,
         18944,
         253105,
         82315,
         18856,
         122796,
         250622,
         13903,
         51321,
         24230
      ],
      "backdrop_path": "/aMkinTfDogzErWP4SfGZfoB3hgb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "J. Kimball",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f5735",
               "name": "J.K. Simmons",
               "profile_path": "/jPoNW5fugs5h8AbcE7H5OBm04Tm.jpg",
               "id": 18999,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f5739",
               "name": "Tim Allen",
               "profile_path": "/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg",
               "id": 12898,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Scott",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f573d",
               "name": "Scott Caan",
               "profile_path": "/kvUKf9HCaqUtgj7XuKZOvN66MOT.jpg",
               "id": 1894,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Victor",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f5741",
               "name": "Basil Hoffman",
               "profile_path": "/3kIPq25xlD05KZWJa6T835mlUMc.jpg",
               "id": 91369,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f5745",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Randy",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f5749",
               "name": "Randy Couture",
               "profile_path": "/rsUeCsaKCY01iWK1chOW9VZkOMO.jpg",
               "id": 74748,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Director",
               "gender": 2,
               "credit_id": "52fe4c749251416c910f574d",
               "name": "Sam Raimi",
               "profile_path": "/uEAaCUJzyMI8N5mOVyLtaOPKoEf.jpg",
               "id": 7623,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c749251416c910f572b",
               "name": "Michelle Schumacher",
               "profile_path": null,
               "id": 155596,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c749251416c910f5731",
               "name": "Randle Schumacher",
               "profile_path": null,
               "id": 1171538,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c749251416c910f5753",
               "name": "Eric Radzan",
               "profile_path": null,
               "id": 1209960,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c749251416c910f5759",
               "name": "Tony Cummings",
               "profile_path": null,
               "id": 573307,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.100875,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 190967,
      "vote_count": 12,
      "budget": 0,
      "overview": "Follow actor J Kimball as he researches what it's like to be old for a role in an upcoming movie. When he meets the residents at The Coconuts convalescent home, he quickly discovers that his perceptions of the elderly may be off from today's reality. After being on the wrong end of some pranks, J enlists the help of his Hollywood friends to turn the tides. Mayhem ensues.",
      "similar": [
         258480,
         10735,
         27586,
         244772,
         401898,
         858,
         634,
         3981,
         112160,
         437557,
         17130,
         43923,
         11634,
         141,
         394117,
         376867,
         297762,
         242224,
         370663,
         376660
      ],
      "original_title": "3 Geezers!",
      "runtime": 81,
      "poster_path": "/4uswzYm1HO0EVUBFcW1BQ4CDLCL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rubber Tree Productions",
         "id": 17033,
         "origin_country": ""
      }],
      "release_date": "2013-05-22",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "It’s Cocoon meets The Hangover in this hilarious romp through the golden years.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michelle Schumacher"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Randle Schumacher",
         "Eric Radzan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1825784/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BOTgxNjIzNzcxM15BMl5BanBnXkFtZTcwNjAxMjE0OQ@@._V1_UY268_CR13,0,182,268_AL_.jpg",
      "actors": [
         "J.K. Simmons",
         "Tim Allen",
         "Scott Caan"
      ],
      "reviews": [
         "Not sure why the low scores because this is a delightful and funny movie. Maybe it is because it is a cast mostly of middle-aged and elderly. Or maybe it is because western social attitudes about older people not being as interesting as those under 30. Or people are made uncomfortable by the thought of old people \"doing it\". \"Old\" people aren't supposed to be silly, irreverent, sex obsessed or pranksters? Well, from the elderly I know in real life, they definitely can be. It's really only illness and infirmity that puts a stop to it, if you were silly, irreverent, sex obsessed or a prankster when you were younger. Perhaps not even then. (I visit and occasionally have lunch out with a lady in her 70's who likes to scope out and then point out good looking young men to me. Not because she is trying to fix me up, but according to her, because she likes looking at good looking men!) I don't think this would have been funny if this was about teenagers or twenty-somethings because it has been done to death. Using the older generation gives a tired old genre, a fresh new twist. It is filmed as if it were a documentary, and the unseen camera holder is mentioned a couple of times. But, unlike another review, I did not care for the beginning and almost stopped watching because of that Tyler Perry \"filming a play for a movie\" feel. Luckily, that changed after just a couple of minutes. There are also some nice cameos, including a hilarious Christopher Walken impression by Kevin Pollak. While it isn't an Oscar contender, it is definitely an entertaining film worth the watch. And I want that red \"bikini\".",
         "First the positives: I loved the fact that the film portrayed the elderly as lively and fully sexual (if frustrated) beings. The acting was decent and some of the characters were very entertaining. These are not Hollywood elderly either-which is a very refreshing change (and one of the things I prefer about British entertainment--Hollywood needs to get a clue); these characters look like regular people; \"old people\" which is nice--grey hair, wrinkles, saggy boobs and butts and all. Hollywood old and Hollywood \"ugly\" is just annoying and is so unrealistic that it is simply distracting and takes the audience out of the story. Honestly, this aspect really enhances what humor there is in this film. These actors are very obviously comfortable in their skins--as it is! and have fun with it. Unfortunately that's just about all I can say on the positive side, which is really too bad. The movie missed a golden opportunity to really explore and humanize the elderly. The moments that were truly interesting and worth expanding were barely there and then ignored. An example is the sadness experienced by one of the lead characters when his (I think) granddaughter comes by for her weekly--all too brief visit. It's mentioned in passing to explain his long face, then never brought up again. In that case, why even have it in the film at all? These kinds of subjects have been successfully treated with humor in other films. Looking at the serious side of being old doesn't have to be maudlin or depressing, but it certainly would have given the movie a depth that it currently lacks. I don't think the movie was scripted, but rather the actors seemed to mostly ad lib around a general set-up, then the clips were joined into something resembling a scene. Many of the scenes lacked any kind of bridge to tie them together, resulting in a slap dash amateurish effect. This would explain some of the continuity issues and why the pacing seemed off throughout the film and greatly lowered my rating. Many of the jokes were just irrationally juvenile; and several of the characters simply acted like naughty neglected children. This kind of treatment does the elderly a great disservice. There was also way TOO much emphasis on the men wanting to get \"laid\"--as they acted more like pre-pubescent boys who had never touched a boob before instead of grown men who had been married and raised children to adulthood. The women were also shown as sexual beings, but far more realistically--the uneven treatment is rather baffling. This film is not for anyone who would be offended by graphic and crude sex talk or language, though the visuals are pretty tame. Overall a sadly missed opportunity.",
         "The film begins interestingly - as a documentary. But after 10 minutes the disaster begins.The Worst! Flee from this film. The jokes and the story are terrible. Very bad acting. And using poor cameos of Tim Allen, Kevin Pollak, Sam Raimi, Randy Couture among others. A total waste of time and money. Run away from this movie. Someone should go to jail for making a movie this bad. \"3 Geezers\" is painful: Simmons tags along doing his best Tim Allen impersonation, which is topped when Tim Allen himself shows up solely so the senior citizens can defecate in his bushes. It's not clear whether \"3 Geezers!\" is trying to celebrate people of advanced age or mock them, but it doesn't really matter. Either way, this is one terrible movie.",
         "I gave it an 8 because it had such a low rating. I would rate it a 6 to be honest. Basically the story line is about a documentary made about old people, and the life they live. I think they made the old people the way we would like ourselves to be when we reach (if we reach hehe) that age. Nobody wants to grow old physically and in spirit as well, that's just no fun and so the movie is fun and portrays the elders as little horny children. In my experience its not so far from the truth. I like talking to old people and some are really cool or young at heart like those in the movie which is why it made me laugh. In my opinion anyone that gave this movie a 1-3 doesn't like old people or the fun way they were portrayed, or is old in spirit and cannot see people older than himself with a younger spirit. Geezers is very worthy to watch and i highly recommend it to people with a sense of humor especially self humor.",
         "Wow, seriously, this film is beyond terrible. If it was possible to get a refund for seeing this film I would. Unfortunately it is not the theaters fault at all. In fact it is more or less offensive, as it seems to be making fun of some of the elders in the film in general than trying to be funny. It is POORLY written, the jokes are TERRIBLE and the acting is wooden at best. Even J.K. Simmons, whom I like in most movies, and consider a funny man is terrible in this. More than likely that was the writing more than anything. The film, as someone else stated, started out with promise, then slowly (and I do mean deathly slowly) evolved into a completely bad film. Bad jokes, bad writing, bad acting, bad pretty much all of the way around! Do yourself a favor, avoid this film! Save yourself the complete waste of time.",
         "I am embarrassed to admit I enjoyed portions of this film. The plot is non-linear. J.K. Simmons visits Coconuts, a retirement home and finds 3 Geezers full of life. He interviews and films them for a new film, which is immaterial to the script. Lou Beatty Jr. plays Benard, a blind man who does all the things a sighted person does from being a line judge to sculpturing. Victor (Basil Hoffman) is the lead in the group. He has the hots for Ruth (Beverly Polcyn), eat your heart out Phoebe Cates. Will Bonaiuto rounds out the group, although his role is minor. I can understand a young audience not enjoying this film. There are things older people will pick up on such as the Phoebe Cates imitation scene, and the sound track playing the theme from \"Shaft\" while the group plays a trick on Bernard. I personally enjoyed this film in spite of being filled with much low brow humor. Clearly not for everyone. Parental Guide: F-bomb. No sex. Male rear nudity.",
         "We found this movie to be quite funny and entertaining but it is not for the uptight, grumpy types that need to pigeon hole their elderly. It is a \"mockumentary\" and was pretty obviously tongue in cheek. You follow J Kimball as he researches for a role playing an old dude. It is a silly, funny, easy to swallow movie that shows the elderly are people too. Great cameos, great music. Incredibly original concept. How many times do you see a movie completely different than every other movie? You haven't seen this movie before. Not much of a plot but a lot of funny. I don't believe some of these people that didn't like, must have zero sense of humor!",
         "This was a waste of time and money, I wish I had them both back. I rented it because it is advertised as starring Tim Allen, but he only had a tiny part in the middle of the movie. I also wanted to see it because it had Sam Raimi, but he didn't appear until after the credits started. This movie gives you the impression that all old people are crude, vulgar, and repulsive to be in the same room with. The parts trying to make it look like being blind was funny did not go over well, and making fun of a person with dementia was also not amusing. At least it was a short movie, that's the only good thing I can say about it. Wish the memories of it could be erased.",
         "I was deeply disappointed when I rented it. I had expected it to be awesome with all the big names that were in it. Most of the movie is made up of cheap and dirty jokes. The big names advertised for this movie only have short segments in the movie and even then are lost in the blandness. The movie was so dry and awful that I only watched about 30 minutes of it before turning it off. It was not worth any more of my time. Further more I was still left feeling like I had been robbed of time. The next time that I am tempted to rent a movie based on the assumption that good actors only take roles in decent movies, I will I will be sure to do my research first. I would not recommend this movie to anyone. It was a complete waste of time and money."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Rubber Tree Productions"],
      "summaries": ["Follow actor J Kimball as he researches what it's like to be old for a role in an upcoming movie. When he meets the residents at The Coconuts convalescent home, he quickly discovers that his perceptions of the elderly may be off from today's reality. After being on the wrong end of some pranks, J enlists the help of his Hollywood friends to turn the tides. Mayhem ensues."],
      "budget": 1000000
   },
   "movielensId": 162240,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-05-22",
      "dvdReleaseDate": null,
      "directors": ["Michelle Schumacher"],
      "runtime": 81,
      "movieId": 162240,
      "title": "3 Geezers!",
      "mpaa": "NR",
      "actors": [
         "J.K. Simmons",
         "Tim Allen",
         "Scott Caan",
         "Basil Hoffman",
         "Kevin Pollak",
         "Randy Couture",
         "Sam Raimi"
      ],
      "imdbMovieId": "1825784",
      "originalTitle": "3 Geezers!",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["b8Y8mvxOMhY"],
      "plotSummary": "Follow actor J Kimball as he researches what it's like to be old for a role in an upcoming movie. When he meets the residents at The Coconuts convalescent home, he quickly discovers that his perceptions of the elderly may be off from today's reality. After being on the wrong end of some pranks, J enlists the help of his Hollywood friends to turn the tides. Mayhem ensues.",
      "tmdbMovieId": 190967,
      "avgRating": 0.833333,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/4uswzYm1HO0EVUBFcW1BQ4CDLCL.jpg"
   }
}