{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1978451",
      "video": false,
      "title": "Hit 'n Strum",
      "recommendations": [],
      "backdrop_path": "/saFvNoDVnMvYPGUhMqLn1szgNIa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stephanie",
               "gender": 1,
               "credit_id": "52fe4c889251416c7511d5bb",
               "name": "Michelle Harrison",
               "profile_path": "/aCdt4RsUBPZM0jMFUGyhGkUF4qr.jpg",
               "id": 59240,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe4c889251416c7511d5bf",
               "name": "Kirk Caouette",
               "profile_path": null,
               "id": 172874,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Christopher",
               "gender": 2,
               "credit_id": "52fe4c889251416c7511d5c3",
               "name": "Paul McGillion",
               "profile_path": "/n6S66CIpNqThe6eugr94WZBbI6u.jpg",
               "id": 26069,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c889251416c7511d5b7",
               "name": "Kirk Caouette",
               "profile_path": null,
               "id": 172874,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c889251416c7511d5c9",
               "name": "Kirk Caouette",
               "profile_path": null,
               "id": 172874,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c889251416c7511d5cf",
               "name": "Kirk Caouette",
               "profile_path": null,
               "id": 172874,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c889251416c7511d5d5",
               "name": "John Cassini",
               "profile_path": "/x6on7gR2Q8iQknmrmEL6hMZWZPJ.jpg",
               "id": 12055,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c889251416c7511d5db",
               "name": "Shawn McLaughlin",
               "profile_path": "/24oirvXtkN67vO3l1d5KdyB5pSJ.jpg",
               "id": 1273474,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4c889251416c7511d5e1",
               "name": "Jacqueline Nguyen",
               "profile_path": null,
               "id": 1273475,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.495792,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 182583,
      "vote_count": 3,
      "budget": 0,
      "overview": "After committing a hit and run, a beautiful career woman attempts to clear her conscience by befriending her victim, a homeless but talented street musician.",
      "similar": [],
      "original_title": "Hit 'n Strum",
      "runtime": 91,
      "poster_path": "/igkFtEen5wouU7i0ALDTQKPfnas.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-04-05",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kirk Caouette"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Kirk Caouette"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1978451/",
      "coverLink": null,
      "actors": [
         "Michelle Harrison",
         "Kirk Caouette",
         "Angelo Renai"
      ],
      "reviews": [
         "\"Hit n strum\" is a movie about the platonic connection between a man and a woman whose paths cross one night when the lady's car hit the male. The storyline is pretty straightforward. It is about the friendship between a rich lady and a poor man. In a sense it is a movie about class - high class versus low class. Two components are visible, [1] there are a lot of stereotypes and [2] there are a lot of transcending of the stereotypes. For example, homeless are known to have no money, vandalize and perhaps steal because the homeless person is hungry - however when the female gives the male a guitar he refuses it. This example by-passes the stereotype. The story is idealistic. The female helps the homeless person get a record deal and is able to get the homeless person off the streets. This is what a lot of helpers in the field of addictions and mental health often try to do, however this is not always successful. There were no drug-use and there was no violence in the movie, except by someone other than the homeless man. The movie was shot in Vancouver British Columbia where there are a lot of homeless men and women. There is a mystery to the movie. For example, why was the person homeless in the first place? There are hints here and there, like when he writes a letter to his father and then visits his father in Toronto, but there is not definitive answer. The audience is left hanging as to how and why the individual does not have a home - and only when he is in sickness does he reconsider his position and want to change. The good thing about this movie is that there is a character transformation. This character transformation from homeless man to recording artist living in his own home versus outside. The driving force seems to have been the channels of friendship which is brought to light in both an idealistic and a motivating fashion. The female character believed in the homeless man and started to see past his exterior to the soul of the man. Was this the factor that inspired the man to change? In the end the platonic friendship is separated out of free-will. The seeds of the platonic friendship kept on growing, for each individual. This was very uplifting and happy. The movie had heavy subject-matter but it was delivered in a way of absolute success. Written by Annuska van der Pol, BA, PDD-IMHA",
         "what a wonderful movie! at first, i thought this is just a B leveled movie, but then when i watch on, it gradually became such a beautiful movie. both the male and female main characters are just fantastic, and the directing is also very smooth, never made me feel pretentious or unrealistic. the homeless guy wrote and sang beautiful and heart-felt songs again and again. and the story about this woman who has a guilty conscience and trying so hard to help this very decent but lost soul back on his feet is such a rare viewing experience for me. the only thing that i didn't quite feel comfortable is that if this guy got T.B., how such contagious disease won't become a problem when they aboard-ed a flight? when she so kindly let him stayed at her home temporarily, did she ever consider his health problem might cause some unpredictable problem later? the stubbornness of the homeless stay-on-the-street-better-stay-under-a-roof, sleep in the open on rainy days is more comfortable than stay indoor? what kind of psychological problem or phobia syndrome for those people living on the street? of course, this movie has completely avoided the absolutely avoidable drug abusing scene, all the street bums were nice people, making this film like a sanitized film, but for the purpose of making a kinder, gentler and even poetically beautiful film, these unreality are understandable. i don't know what happened when writing this review, i suddenly become so confused about the present and past tenses, but what the hack, all i want to say is that this film is a gem that should never be overlooked. if you like to hear some nice original songs, this film is also for you. don't forget to seek out Kirk Caouette's songs to appreciate further, because every song is so original and so unpretentious."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "4Branch Productions",
         "Whole Earth Entertainment",
         "Union of B.C. Performers"
      ],
      "summaries": [
         "While driving down a back alley in Vancouver, contract lawyer Stephanie, distracted by reading some case materials for an imminent meeting, runs over a young seeming vagrant. Seeing that he is alive and mobile and that there are no other witnesses, Stephanie drives off without making sure that he is not injured, but not before they lock eyes with each other. Stephanie later sees the man, he a busker in a small combo in the same neighborhood as her office building. Her initial thoughts in seeing him are to ensure that she assumes no liability for the accident in he suing her, and then to throw money at him in the form of gifts to ease her guilty feeling, those gifts as she can see that he is indeed homeless. She is surprised that the man, Mike, wants nothing from her and seems to harbor no ill will toward her. Mike's attitude and homeless situation is largely to exist on his own terms, and thus not be beholden to anyone, despite his homelessness leading to health problems. Living on the street also means playing music solely for his own pleasure and not as a paid job. What money he has is primarily through the busking and from dumpster diving for bottles and cans. Stephanie is not only surprised by Mike's attitude, but how much she actually does enjoy his music. As such, she continues her assistance for him, she wanting to play a part in him getting back on his feet, especially in helping him with his music in a business sense. Stephanie's actions do not sit well with those closest to her, namely her parents and her fiancé Christopher, who believe she should not trust a homeless person. But a further issue is how much assistance Mike will accept from her, he who truly does have deep seated feeling about the woman who ran over him and who may be hiding the true reason for his homelessness.",
         "After committing a hit and run, a beautiful career woman attempts to clear her conscience by befriending her victim, a homeless but talented street musician."
      ],
      "budget": 0
   },
   "movielensId": 162236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-04-05",
      "dvdReleaseDate": null,
      "directors": ["Kirk Caouette"],
      "runtime": 91,
      "movieId": 162236,
      "title": "Hit 'n Strum",
      "mpaa": null,
      "actors": [
         "Michelle Harrison",
         "Kirk Caouette",
         "Paul McGillion"
      ],
      "imdbMovieId": "1978451",
      "originalTitle": "Hit 'n Strum",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["cfF5rzZvUlM"],
      "plotSummary": "After committing a hit and run, a beautiful career woman attempts to clear her conscience by befriending her victim, a homeless but talented street musician.",
      "tmdbMovieId": 182583,
      "avgRating": 2,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/igkFtEen5wouU7i0ALDTQKPfnas.jpg"
   }
}