{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt1823202",
      "video": false,
      "title": "Siberia, Monamour",
      "recommendations": [
         222071,
         127236,
         51272,
         91282,
         79580,
         144804,
         31227,
         138769,
         49580,
         69646,
         91520,
         83444,
         102363,
         282663,
         69666,
         49106,
         64266,
         83524,
         69401,
         27922
      ],
      "backdrop_path": "/3SrxrM5LQTWFXLJn4KgAJBqftQ9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "старик Иван",
               "gender": 0,
               "credit_id": "52fe47d49251416c91077099",
               "name": "Pyotr Zaychenko",
               "profile_path": "/pBfgVaFib0ui1NUXg3K7GgbvP2.jpg",
               "id": 590127,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Лешка",
               "gender": 0,
               "credit_id": "52fe47d49251416c9107709d",
               "name": "Mikhail Protsko",
               "profile_path": "/cVr2jUHiqBXtlTZ8KCERc50d2oY.jpg",
               "id": 590128,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Анна",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770a5",
               "name": "Lidiya Bairashevskay",
               "profile_path": "/ouydhY7V9nih8Ho6G3m3IVMnSBH.jpg",
               "id": 590130,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770a9",
               "name": "Nikolai Kozak",
               "profile_path": "/ntWdFKSXzD95iyf24MlSQro1RZA.jpg",
               "id": 590131,
               "order": 3
            },
            {
               "cast_id": 1002,
               "character": "дядя Юра",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770a1",
               "name": "Sergey Novikov",
               "profile_path": "/o9W373sh05A9o2ttjlTlAv3W1zg.jpg",
               "id": 590129,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770ad",
               "name": "Sergey Puskepalis",
               "profile_path": "/mXvDqjHiSthiXdCCQ8ncwWO2lLp.jpg",
               "id": 590133,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770b1",
               "name": "Maxim Yemelyanov",
               "profile_path": null,
               "id": 590134,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Люба",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770b5",
               "name": "Sofia Oleynik",
               "profile_path": "/fi4MAKgEOFTITqp3G0grCkJXCse.jpg",
               "id": 582228,
               "order": 7
            },
            {
               "cast_id": 1011,
               "character": "Анжела",
               "gender": 0,
               "credit_id": "52fe47d49251416c910770b9",
               "name": "Marianna Shults",
               "profile_path": "/93y8PNdjHBKRQP6QonvKXMjc3v9.jpg",
               "id": 590145,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c910770bf",
               "name": "Vyacheslav Ross",
               "profile_path": "/v0g65Rs0ZDFMbh1fHpa6S88ZSDY.jpg",
               "id": 582221,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53737e710e0a267c6a001ac2",
               "name": "Vyacheslav Ross",
               "profile_path": "/v0g65Rs0ZDFMbh1fHpa6S88ZSDY.jpg",
               "id": 582221,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.697678,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 80670,
      "vote_count": 17,
      "budget": 0,
      "overview": "Siberia. Late autumn. In taiga, in the deserted village there lives an old man Ivan &amp; his seven-year-old grandson Leshia. A pack of feral dogs devours everything alive in the neighborhood. One of these dogs is Leshia's best friend. Sometimes their relative uncle Yuri brings food to them. Once on his way back from Ivan's village uncle Yuri is attacked by dogs &amp; perishes. Ivan &amp; Leshia stay without supply. Once Leshia witnesses Ivan shooting at 'his' dog &amp; runs away. The old Man finds him in a dry well, but he fails to get him out on his own. Ivan sets out through taiga in search of help. Now the dogs are hunting him... And the boy is waiting for his father...",
      "similar": [],
      "original_title": "Sibir, Monamur",
      "runtime": 102,
      "poster_path": "/1dDkoqLf1gghDHPQHsPRBmjY2zJ.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tundra Film",
         "id": 23377,
         "origin_country": ""
      }],
      "release_date": "2011-03-08",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vyacheslav Ross"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Vyacheslav Ross"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt1823202/",
      "coverLink": null,
      "actors": [
         "Pyotr Zaychenko",
         "Mikhail Protsko",
         "Sergey Novikov"
      ],
      "reviews": [
         "Actually, I have registered here just to write a review for this film. This film will really burst your heart. The story is simple: an old man and his grandson (ab. 6-7 y.o.) live in the midst Siberia taiga. They wait for the old man's son (grandson's father) who disappeared several years ago. A horde of feral dogs devour all the living beings around. But the boy has a dog-friend from this horde. The film is about what does it mean to be a human, about kindness, about God in our hearts. The movie is not easy and light, it makes you cry. And it is one of the best movies I've ever seen. Actually, I watch it twice, the second time in the next day after the first.",
         "Slava Ross excellently guides his protagonists through parallel story lines, almost wordless immersing into their souls, giving us a glimpse of their cruel humanism, intriguing us by raising our own perception to a angelic level which enables us to perceive the difficulty we would have if we would judge his characters. At first glance you would say that some of Ross' characters are evil, but sooner or later you will realize that you have to think over your verdict. What an excellent philosophical film not denying the kind heart in every human soul despite all misery. Thank you very much Slava for Lesia!!",
         "With this complex story about human nature, Slava Ross made exceptional debut as a director. She put back on track Russian cinema, that in past few years lost some of the values with failed blockbusters, historical epics and unnecessary sequels (some of them made even by Mikhalkov). Alongside with Vozvraschenie, this is another character study that deals with hard life of individuals living in remote area. It creates a parallel between humans and animals, compassion and cruelty, living and surviving. The story is breathtaking, very well written and directed. Cinematography is stunning: it shows in its perfection the main character of the story - nature. Beautiful, distant, unpredictable, frightening and never-ending space... which controls actions of every other character. Their inner nature and emotions gets changed towards each other depending on circumstances. However, they are connected in a battle against the wilderness of the nature, but divided by a way of surviving. Do not miss this modern Russian masterpiece which shows a circle of life with one different point of view.",
         "it is a film for who the review is haunting of wind. because it is out of words. picture of an universe, cruel, touching, pure state of facts, it is a form of pray. this is cause for who, for me, the scene of paper icon is the best. a world in search of sense. desire / need/ search of God. in the heart of taiga. and His presence. in presence of young prostitute. in the young soldier. in the letter to father. in the grandfather as keeper of measure. a Russian film like a conquest. as lines of a battle.it is not an exception, many movies from East are exercises for self definition. in this case, like in Ostrov or Tsar, in Angel Tunnel , the problem, the central quest is this feeling who gives sense of life. the answer - miracle. in old Dostoyevsky manner - redemption. fall of sin. honest image of circle who has you as part. bitter, cruel, sad, full of extraordinary beauty. a film. about God.",
         "I talked to my American friends before watching and all of them warned me that this is a \"heavy\" movie. Guess what, it was like I just went home. Real. It was true in every detail. Brutal. Exposing. Poisonous. Nauseating. Yes. And true. Superb work by Slava Ross worthy of Oscar nomination. I think that the strongest lines were: Grandpa, Lyosha, the Captain and Anna, aside from Fang the dog. There was only a single overreach - I do not remember drinking vodka for breakfast. Otherwise - the film was captivating and honest. I feel that sometimes watching the endless line of all-goody-goody movies kills our ability to perceive reality, which is far from nice and fluffy. Soviet system kills the most important thing in every man - his ability to respect himself. That is what the Grandpa in the movie is running from and so do we...",
         "It's the best and incredible film about wild Russia. All scenes about hard life in taiga. I'm under the impression. The old grandfather and his grandson live in the wild wilderness. Wild dogs have eaten all the animals in the nearby woods. Grandfather is lame and can not go far to hunt. Wild dogs ate their goats, they have no food. His grandson is waiting for his father. Sometimes they were visiting by uncle and brings food, because of the drunkenness and sloppiness uncle once was lost in the forest. The grandson had quarreled with his grandfather, fled, and fell into the pit. To get him out of the pit grandfather needs help and he goes through the wild forest to the people. This film is about what it means to be human. This film about the hard life in which there is a place not only care about survival, but also mutual. This is a complicated film, it makes you wonder about the meaning of life.",
         "Without a doubt one of a best Russian movie I have seen till date and one of a best among 2011 world movies. It tells the story of cruel Siberian natural environment and those men who are depending on it. Specially it deals between the good versus the bad, even some animals are in crucial part of this beautiful tale. This movie distinguishes between the man, the animal and the nature. These three are the main ingredients of the story and the movie explains how they are related in this one world which they share for theirs survival by facing and defending each others all the time. The one who gain victory will be profitable for their survival and future. Of course it was concentrated more on human perspective which tells how the humans created borders within themselves by ethic, race, nationalism and all, who had to fight themselves others than the beasts and harsh mother nature. This movie gives more meaning than what it was made of just like some modern art. If you had a vision you will get it just like an poet. The places where the movie was shot were amazing and breathtaking just like what I have seen in the other Russian movie 'Kray'. Camera work was good, a fine photography, it was the artistic capture of beautiful Siberia.",
         "I have registered to make a review for this film.I shocked when I see 900 vote for such a film.I think Russia is a gold mine for the cinema because after isolation from the world there thousand of lost story and unknown environments such Sybria.The cinema needs too to comments of Russian people.Because there was black out and cinema shaped with out them.This film has a lost story one of these people.The film is breath taking and have too powerful story and environment.Actors camera director are perfect.All film is about hope and teaching you worth of the hope.He is taking from you with such powerful actors and environment.You are cold and lost with in Syberia.Feeling hopeless people emotions.And director has a gift for you end of the film. This film a lost diamond and nobody is knowing.Everybody must see this lost masterpiece!",
         "I lived in Siberia between 1963 and 1973 and I can testify that the film is as true to the reality of life there as it gets.",
         "It's lovely movie, Siberia. Late autumn. In taiga. In the deserted village there lives an old man Ivan & his seven-year-old grandson Leshia. A pack of feral dogs devours everything alive in the neighborhood. One of these dogs is Leshia's best friend. Sometimes their relative uncle Yuri brings food to them. Once on his way back from Ivan's village uncle Yuri is attacked by dogs & perishes. Ivan & Leshia stay without supply. Once Leshia witnesses Ivan shooting at 'his' dog & runs away. The old Man finds him in a dry well, but he fails to get him out on his own. Ivan sets out through taiga in search of help. Now the dogs are hunting him... And the boy is waiting for his father..."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Tundra Film"],
      "summaries": ["Siberia. Late autumn. In taiga, in the deserted village there lives an old man Ivan & his seven-year-old grandson Leshia. A pack of feral dogs devours everything alive in the neighborhood. One of these dogs is Leshia's best friend. Sometimes their relative uncle Yuri brings food to them. Once on his way back from Ivan's village uncle Yuri is attacked by dogs & perishes. Ivan & Leshia stay without supply. Once Leshia witnesses Ivan shooting at 'his' dog & runs away. The old Man finds him in a dry well, but he fails to get him out on his own. Ivan sets out through taiga in search of help. Now the dogs are hunting him... And the boy is waiting for his father..."],
      "budget": 0
   },
   "movielensId": 162246,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2011-03-08",
      "dvdReleaseDate": null,
      "directors": ["Vyacheslav Ross"],
      "runtime": 102,
      "movieId": 162246,
      "title": "Siberia, Monamour",
      "mpaa": "",
      "actors": [
         "Pyotr Zaychenko",
         "Mikhail Protsko",
         "Lidiya Bairashevskay",
         "Nikolai Kozak",
         "Sergey Novikov",
         "Sergey Puskepalis",
         "Maxim Yemelyanov",
         "Sofia Oleynik",
         "Marianna Shults"
      ],
      "imdbMovieId": "1823202",
      "originalTitle": "Sibir, Monamur",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["A5jhr-W79VA"],
      "plotSummary": "Siberia. Late autumn. In taiga, in the deserted village there lives an old man Ivan &amp; his seven-year-old grandson Leshia. A pack of feral dogs devours everything alive in the neighborhood. One of these dogs is Leshia's best friend. Sometimes their relative uncle Yuri brings food to them. Once on his way back from Ivan's village uncle Yuri is attacked by dogs &amp; perishes. Ivan &amp; Leshia stay without supply. Once Leshia witnesses Ivan shooting at 'his' dog &amp; runs away. The old Man finds him in a dry well, but he fails to get him out on his own. Ivan sets out through taiga in search of help. Now the dogs are hunting him... And the boy is waiting for his father...",
      "tmdbMovieId": 80670,
      "avgRating": 3.61111,
      "releaseYear": "2011",
      "numRatings": 9,
      "posterPath": "/1dDkoqLf1gghDHPQHsPRBmjY2zJ.jpg"
   }
}