{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "sweden",
            "id": 1192
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "psychology",
            "id": 2800
         },
         {
            "name": "adult",
            "id": 3718
         },
         {
            "name": "nymphomaniac",
            "id": 9838
         },
         {
            "name": "sexploitation",
            "id": 10053
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "naked",
            "id": 157813
         },
         {
            "name": "discovery",
            "id": 162342
         },
         {
            "name": "voyeur",
            "id": 180340
         },
         {
            "name": "provocative",
            "id": 197514
         }
      ],
      "imdb_id": "tt0069718",
      "video": false,
      "title": "Anita",
      "recommendations": [
         85269,
         35044,
         38051
      ],
      "backdrop_path": "/nLn4mBG38HOvMANSt3j99bUt51Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anita",
               "gender": 1,
               "credit_id": "52fe4731c3a36847f8128301",
               "name": "Christina Lindberg",
               "profile_path": "/doweQzXmyMCQupRL1AV1HLPuETK.jpg",
               "id": 77707,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Erik",
               "gender": 2,
               "credit_id": "52fe4731c3a36847f8128305",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "The Mother",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812830f",
               "name": "Danièle Vlaminck",
               "profile_path": null,
               "id": 1286278,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Father",
               "gender": 2,
               "credit_id": "52fe4731c3a36847f8128313",
               "name": "Michel David",
               "profile_path": null,
               "id": 190077,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Erika, Anita's twin-sister",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128317",
               "name": "Erika Wickman",
               "profile_path": null,
               "id": 1286280,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "The Glasier (as Evert Granholm)",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812831b",
               "name": "Ewert Granholm",
               "profile_path": null,
               "id": 101644,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Man at Library",
               "gender": 2,
               "credit_id": "52fe4731c3a36847f812831f",
               "name": "Arne Ragneborn",
               "profile_path": null,
               "id": 576545,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "The Artist (as Per Matsson)",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128323",
               "name": "Per Mattsson",
               "profile_path": null,
               "id": 1263741,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Professor Lundbeck",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128327",
               "name": "Jörgen Barwe",
               "profile_path": null,
               "id": 1286281,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Schoolteacher #1",
               "gender": 2,
               "credit_id": "52fe4731c3a36847f812832b",
               "name": "Jan-Olof Rydqvist",
               "profile_path": null,
               "id": 1026170,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Schoolteacher #2 (as Tore Segerström)",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812832f",
               "name": "Thore Segelström",
               "profile_path": null,
               "id": 1286282,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Agnes - Social Worker (as Berit Agerdal)",
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128333",
               "name": "Berit Agedal",
               "profile_path": null,
               "id": 1286283,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4731c3a36847f81282fd",
               "name": "Torgny Wickman",
               "profile_path": null,
               "id": 138853,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4731c3a36847f812830b",
               "name": "Torgny Wickman",
               "profile_path": null,
               "id": 138853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128339",
               "name": "Inge Ivarson",
               "profile_path": null,
               "id": 1119017,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812833f",
               "name": "Ove Wallius",
               "profile_path": null,
               "id": 1286284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128345",
               "name": "Lennart Fors",
               "profile_path": null,
               "id": 1026152,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4731c3a36847f812834b",
               "name": "Torgny Wickman",
               "profile_path": null,
               "id": 138853,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128351",
               "name": "Hans Dittmer",
               "profile_path": null,
               "id": 1286285,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4731c3a36847f8128357",
               "name": "Torgny Wickman",
               "profile_path": null,
               "id": 138853,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812835d",
               "name": "Ulf Wallius",
               "profile_path": null,
               "id": 1286286,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128363",
               "name": "Klinga Wickman",
               "profile_path": null,
               "id": 1286287,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f8128369",
               "name": "Klinga Wickman",
               "profile_path": null,
               "id": 1286288,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4731c3a36847f812836f",
               "name": "Kerstin Karlsson",
               "profile_path": null,
               "id": 1286289,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.400666,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         }
      ],
      "id": 47397,
      "vote_count": 24,
      "budget": 0,
      "overview": "Anita is a girl of only 16 years, and while she has developed early physically, to a mature woman, she is psychologically completly ruthless. Her relationship the her parents and her friends is very poor and she is regarded with contempt by the people around her, even by the men who so ruthlessly use her.",
      "similar": [
         27066,
         22705,
         28468,
         112160,
         80752,
         249397,
         76726,
         1259,
         258480,
         9667,
         9352,
         158907,
         1391,
         12093,
         1791,
         13416,
         50124,
         14174,
         1024,
         48650
      ],
      "original_title": "Anita",
      "runtime": 95,
      "poster_path": "/gKciJKWsyiIRScge3cR9W2cvBRG.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Swedish Film Production (SFP)",
            "id": 4862,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alpha France",
            "id": 6211,
            "origin_country": ""
         }
      ],
      "release_date": "1973-12-25",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The true story of a 17 year old nymphomaniac",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Torgny Wickman"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Torgny Wickman"],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0069718/",
      "coverLink": null,
      "actors": [
         "Christina Lindberg",
         "Stellan Skarsgård",
         "Danièle Vlaminck"
      ],
      "reviews": [
         "People debate today whether there really is such a thing as nymphomania, or if it was just a term pinned on women who tried to lead a naturally healthy sex life back in much more repressive, Victorian times when such a thing was not permissible. One thing's for sure though , if this particular movie is based on a real story as it claims to be, this girl definitely had a serious problem. The girl in this movie (played by Cristina Lindberg) , will sleep with anybody, and I do mean ANYBODY. This turns her into a social outcast (because of course, nobody likes a beautiful girl who wants to have sex all the time). She's like a junkie in her compulsion, begging for the key to a friend's apartment so she can have quickies with unattractive businessmen she picks up at the train station. And when one kindly elderly guy tries to console her after an unsatisfying sexual encounter, she drops to her knees to give him the b.j. of his life. All this is treated in a very serious, at times almost depressing manner, and Lindberg gives a very earnest performance. Since I doubt too many people then or now watched this movie out of concern for the social problem of nymphomania (more likely they wanted to know where they could find a girl like this), this move and Lindberg's performance may seem pretty campy. I have to say though I'd much rather see a movie like this that sets out to be somewhat serious and falls into camp than a movie that aims at camp and falls flat on its face. And though Lindberg will never be mentioned in the same breath as Greta Garbo, her overly seriously performance here is infinitely better than most modern-day \"cult actresses\" and \"scream queens\" camping and mugging their way through movies that they (very erroneously) consider beneath their talents. In any case, campy or not, this movie definitely succeeds as exploitation thanks to Lindberg doffing her duds every five minutes or so. If you've never seen Cristina Lindberg, she's kind of like really sexy mutant or mythical beast--she has the face of an innocent teenage Swedish schoolgirl attached to the body of a voluptuous burlesque-era stripper (which is not at all to say that her appeal is limited to those who dig schoolgirls or burlesque strippers). Her most memorable scene here is where she and her goody-good twin sister are singing for their parents' friends and she turns the occasion into an impromptu full-monty striptease. And if you are a fan of Lindberg, or become one after this movie, also check her out in \"Thriller--a Cruel Picture\" (a favorite of Quentin Tarantino), her first film \"Maid in Sweden\", the German \"schulmadchen report\" films in which she was a regular, and the unbelievably depraved film \"Depraved\" (sadly unavailable in English). She's almost always worth the price of admission all by herself.",
         "As you can notice, this film is both Swedish and french in production; there are two versions of this film that differ considerably; the french version has a logical plot evolution and is more sleazy than the Swedish version. The latter if more moral in tone and has an unlogical plot evolution; it also has less sex(y) scenes. In the Swedish version, the plot line of the young students forming a classical music group is more elaborated (and dull). The french version focuses more on the nymphmaniac addiction; in this version Christina Lindberg tries out a therapy to bring her relief of her addiction. The french version runs for 74 minutes; this makes the plot evolution more compact. The 'solution' of both versions is the same. For the french version I would give an 8 out of 10; for the Swedish version I would give a 6 out of 10",
         "The English title of this film is Anita (Swedish Nymphet). At the time of release of this film, in the United States, this was regarded as a duplicate title; by our standards at that time all Swedish girls were considered nymphomaniacs! That was NOT right for us to do so; I am the first to admit that. Rather it reflects the morality, or perceived morality, of that era. In some locations of the US a nymphomaniac was a woman who had sex twice a night with her husband; except perhaps for her honeymoon when such \"immoral\" behavior was tolerated. The Swedish women were much more advanced in human sexuality; it was the United States that had to catch up in this field. This movie is interesting in that it does portray a true Swedish nymphomaniac in a realistic fashion. The movie explains in some detail that nymphomania is actually a comparatively rare condition; the psychology student mentions that nymphomania is improperly used to describe the activities of a woman who is simply enjoying a healthy sex life (when I was growing up the healthy sex life of a woman was considered to be having sex only when her husband was extremely desperate). Rather, nymphomania is a reflection of a very deep seated mental disorder. The question is whether or not Anita can be cured. Not deprived of all sexual desire but having the sexual desire that is properly balanced with L-O-V-E! The uncut movie was banned in the United Sates for some time. Though you could show breasts and butts by 1974 one found it quite difficult to legally show a woman's pubic area-this being about the same time that Larry Flynt was going to prison for doing just that. The uncut version of this film shows a little more of that area than what was allowed in the U.S. then. Christina Lindberg did a remarkable acting job in the private nude and sexual scenes. Today this film would be regarded as more or less normal fare; back then it was considered pornographic to a tremendous degree. Hence my high regards for her.",
         "The seventeen year-old outcast Anita (Christina Lindberg) has neither a good relationship with her parents and sister nor has friends. She is a nymphomaniac and has intercourse and BJ with most of the men in her little town regardless of their ages. When she meets the psychology student Erik (Stellan Skarsgård), he brings her to live with his friends that are artists and she discloses her sexual experiences to him. Further, Erik discuss her problem with his adviser, he also realizes that he has fallen in love with her. But Anita needs an orgasm to cure first before staying with Erik. \"Anita\" (1973) is a Sweden-French movie of exploitation about a seventeen year-old nymphomaniac forty years before the hype in the Lars von Trier's \"Nymphomaniac\". The story lines are the same, but the Danish director has detailed the plot along four hours running time. Stellan Skarsgård works in both movies listening to the nymphomaniac. My vote is five. Title (Brazil): Not Available.",
         "I saw this disc offered by Synapse at the latest Horrorfind Convention, and immediately the cover of a topless Christina Lindberg caught my attention. I didn't purchase the disc at the convention, but needless to say, I grabbed this one up the first chance I had. ANITA is the story of a misunderstood 17-year-old nymphomaniac outcast (Lindberg) who bones anyone and everyone in sight. Shunned by her family and everyone in town, Anita whiles away her days and nights in the arms (and beds, and floors, and coat-rooms, etc...) of any willing man (and in some cases, woman) she lays eyes on. During one of her clandestine \"rendevous'\" she accidentally runs into (literally...) a young psychology student who takes an interest in her and her \"illness\". The two form a platonic friendship as the budding psychologist attempts to figure out the cause, and better yet, a cure for young Anita's ailment... Honestly - this film isn't that great. It's a little too serious in tone to be a fun, sexploit style erotic romp - and yet a bit too shallow to be very thought-provoking. Lindberg looks amazing (as usual...) and does a decent job of playing the role of the conflicted, sometimes ruthless, but always \"fragile\", girl-next-doorish sex-addict - and as would be expected, she provides several nude-scenes (the main reason for my above average rating). Unfortunately, as this film seems to try to be a semi-serious \"case-study\" of this troubled young girl - the sex scenes are more sad than arousing. It's also a damn shame that Lindberg never did any hard-core scenes, as this would have easily gotten this film a 37-out-of-10 from me. Serious Lindberg fans will most definitely wanna cop this one, most others will probably find it pretty dull. At least it's FAR better than the extremely boring Swedish WILDCATS, which also has Lindberg in it - but she is grossly underused in that film. 7/10 for ANITA - but only because of the several Lindberg nude shots...",
         "Anita: Swedish Nymphet (1973) ** (out of 4) Cult star Christina Lindberg of Thriller: A Cruel Picture fame stars as Anita, a 16-year-old girl who has to have sex and it doesn't matter with who. She picks up lawyers, junkies, little boys, drunks or even the homeless. Her sexual behavior gets her kicked out of towns but one day she meets a doctor who thinks he can help her. This Swedish picture is rather strange because it's certainly a sexploitation title and the main goal is for the beautiful Lindberg to get naked every chance she gets but the overall tone of the movie is so serious that it's hard to have fun with the film. The story is pretty straight forward, which means it gets pretty boring as it rarely goes over the top outside of a 16-year-old wanting any guy she can get. As for Lindberg, this is only the second film I've seen with her but she certainly deserves her cult status. She's certainly easy on the eyes but unlike a lot of erotic stars, she can also act and she brings a lot life to her character.",
         "Christina Lindberg was already selling herself in nude pinups and movies several years before this movie. This movie is yet just another \"social issue\" excuse for selling Christina Lindberg and soft-core porn. The movie pretends to explore the true life of a teenage sex-addict but in reality it's just an excuse for the nude and sexual content matter of the movie. There are of course the pompous analyses by her psychologist but they're simply a vehicle to deepen the chaotic and kinky erotic state of the character, played by Christina Lindberg. Overall, the movie lacks depth, the acting is poor and 70's-cliche' in its settings and seems to have no real purpose other than to sensationalize popular Christina Lindberg in yet one more sexually exploitative movie.",
         "You know how most 'erotic films' are burdened with long, boring, overly graphic sex scenes? This isn't one of them. Oh, there are some sex scenes, but most of the long, boring passages in this Scandinavian drama involve serious discussions about nymphomania or lots and lots of classical music. Anita is actually quite well-acted (Christina Lindberg is genuinely good) and reasonably serious, but still can't help itself when it comes to the requisite lesbian encounter, which comes out of left field and isn't terribly convincing. And watch out for the continuity error when Anita doffs her clothing for another soulless sexual liaison and magically pulls her hair back into a ponytail whilst her hands are, er, otherwise occupied. Not bad, not particularly good, and not very sexy, Anita will leave your Swedish meatballs lukewarm at best.",
         "The best thing about \"Anita\" is that is supposed to work within the sexploitation genre, and it is actually a subtle and insightful social critique -well, at least in the first sixty minutes. To someone who's looking for crude, hardcore sex scenes (myself included), this movie is may be disappointing, but for a feminist researcher the movie's angle points out and contextualizes patriarchy and domination as main causes of social \"ilness.\" Just watch the perspective of the movie, and you'll see a \"lylja-for-ever\" for the seventies. In addition, the movie suggests an interesting development of the relationship between the psychology student/psychoanalyst/'doctor' and his patient Anita. At one point, you can see the parallel between the authoritarian/ disengaged father and the psychoanalyst, and both of them are exercising power over the nymphomaniac character. However, Hendrix becomes involved in the story (he hangs on the door where the full human contact-I mean the orgasm- takes place), and we get a sweaty non-convincing highly idealized ending. I would watch this movie again to see: 1. the construction of anita's character as an outcast 2. the whole symbolism behind the young student's actions: feeding her, putting the band aides on, offering her a community where she is actually defended 3. the dysfunctional family 4. the sad scenes of sex that reminds me how the porn industry is using my fantasies. but hey, I kinda like this, though...",
         "This is a good solid well made film and not at all like I expected. Indeed although there is much sexual activity depicted, we see nothing like as much of Christina Lindberg as we do in say, Exposed. Because the film is serious we do not get an exploitative showing of the leading lady's numerous liaisons and due to the constant reminding that these are desperate encounters of an unhappy young girl, we find ourselves in a rather uncomfortable position for most of the time. There are moments, nevertheless! For those that reckon Lindberg cannot act, she certainly does well enough here in many a varied situation, be it talking with her psychiatrist chum, trying to relate to her parents, or sucking some old man's d***. Stellan Skarsgard, who plays the said psychiatrist, and very convincingly too, he had a most illustrious career ahead of him and is still very much working today, having appeared and even sung in Mamma Mia! Worth seeing but it is rather downbeat a lot of the time.",
         "Anita is a nubile sixteen year old girl living in a bleak industrial town somewhere in the wilds of Sweden. She has a problem, in that her reputation in the town is at a low due to the fact that she insists on propositioning every man she meets - young or old, mostly ugly - and then giving them a blow job and sometimes more. The local girls call her a \"slut\", the local lads rough her up and her parents dismiss her in favour of her swat of a younger sister. Eventually Anita runs away to Stockholm (nobody misses her) and is lucky enough to hook up with a cute and well-mannered young man who not only falls in love with her but also understands that she's a textbook example of a nymphomaniac (him having access to the textbooks as he is a psychology student). The young man falls in love with Anita and eventually they get together, once Anita has been cured of her nymphomania by having an orgasm with a lesbian lover. Hold on, the plot goes a bit mad at the end there, doesn't it? Anita the film is as schizoid as its protagonist. It comes on like a particularly bleak version social realist cinema, all grimy interiors and ruined or soulless exteriors and does go some way to suggesting that Anita's sexual compulsiveness is an outcome of a particularly loveless family life (a la Ken Loach's film of the same name) in the context of a meaningless consumer society of shopping malls and urban development. Yet at the same time, the film voyeuristically finds excuse after excuse for getting the gorgeous actress (Christina Lindberg) who plays Anita naked at every opportunity. It is as if the film is itself suffering from the same compulsion as its heroine, and what's more it expects its audience to be suffering from the same malady. In the final third, the film loses all pretence to realism, with the completely gratuitous soft-core lesbian footage and an equally unnecessary trip to a strip joint, where Anita supports a saucy dancer in her routine. Logic is thrown completely out of the window, as Anita's completely unbelievable \"cure\" leads to her settling down to a life of doe-eyed monogamous bliss with her psychiatric student now boyfriend, ending in a church where the organ player notices them canoodling and so strikes up one of those jaunty & jolly tunes that we expect to find at the close of one of the late 60s Carry On films. Anita - Swedish Nymphet (as it is currently know in its UK DVD release) is certainly not a film which has anything much constructive to say on the subject of sexual compulsion (although its portrait of the malady in the first hour is convincing enough); instead, it's rather more intriguing as a symptom of the sexual compulsion of the society which made it and watched it: like the men accosted by Anita, the makers and viewers of the film may be made uncomfortable by her excesses but they aren't saying \"no\" to taking part in them themselves, compulsively."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alpha France",
         "Swedish Film Production (SFP)"
      ],
      "summaries": [
         "Anita is a girl of only 16 years, and while she has developed early physically, to a mature woman, she is psychologically completly ruthless. Her relationship the her parents and her friends is very poor and she is regarded with contempt by the people around her, even by the men who so ruthlessly use her. During her troubles she meets Erik, a young psychology student. Gently and carefully he begins to dispell her psychological blocks. In the course of this treatment she reveals to him some of the shocking espisodes of her previous experience and how an inner compulsion forces her into humiliating debauchery in dangerous environments. Erik believes he has the solution to Anita's problems: to let her move into an artist's communal experiment, of which he is already a member. The common interest of this collective is largely the performing of classical music. Anita's prosence in the collective, however, is regarded by some of the other girls as highly provocative. Anita's nymhomania is her means of protest against her parents, school, society and her own enviroment (her whole life situation). Erik holds a scientific theory that Anita will be free of her sexual fixation if she were once able to experience a true orgasm. He therefore tries to get her to see clearly, and with some insight, the breadth of her psychological situation. Against the background of the intensive battle that Anita carries om with the self-destructive drives within her, grows the depth of feeling that bind her and Erik together. She is no longer simply a \"case\" for him. Anita discovers that Erik is the one man whom she both wants to, and can, remain together with...",
         "The seventeen year-old outcast Anita has neither a good relationship with her parents and sister nor has friends. She is a nymphomaniac and has intercourse with most of the men in her little town regardless of their ages. When she meets the psychology student Erik, he brings her to live with his friends that are artists and she discloses her sexual experiences to him. Further, Erik discuss her problem with his advisor, he also realizes that he has fallen in love with her. But Anita needs an orgasm to cure first before staying with Erik."
      ],
      "budget": 0
   },
   "movielensId": 162250,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "1972-12-30",
      "dvdReleaseDate": null,
      "directors": ["Torgny Wickman"],
      "runtime": 95,
      "movieId": 162250,
      "title": "Anita",
      "mpaa": "R",
      "actors": [
         "Christina Lindberg",
         "Stellan Skarsgård",
         "Danièle Vlaminck",
         "Michel David",
         "Erika Wickman",
         "Ewert Granholm",
         "Arne Ragneborn",
         "Per Mattsson",
         "Jörgen Barwe",
         "Jan-Olof Rydqvist",
         "Thore Segelström",
         "Berit Agedal"
      ],
      "imdbMovieId": "0069718",
      "originalTitle": "Anita",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Anita is a girl of only 16 years, and while she has developed early physically, to a mature woman, she is psychologically completly ruthless. Her relationship the her parents and her friends is very poor and she is regarded with contempt by the people around her, even by the men who so ruthlessly use her.",
      "tmdbMovieId": 47397,
      "avgRating": 2.16667,
      "releaseYear": "1972",
      "numRatings": 3,
      "posterPath": "/gKciJKWsyiIRScge3cR9W2cvBRG.jpg"
   }
}