{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "self consciousness",
            "id": 206297
         }
      ],
      "imdb_id": "tt0064651",
      "video": false,
      "title": "Me, Natalie",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Natalie Miller",
               "gender": 1,
               "credit_id": "52fe4c6b9251416c75119d91",
               "name": "Patty Duke",
               "profile_path": "/tQSbfEIuQ4W2tGm2cqrgIrWTYLv.jpg",
               "id": 27446,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "David Harris",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119d8d",
               "name": "James Farentino",
               "profile_path": "/uRF4R4y3vV1wwHG8Vr5Z1N9hnH3.jpg",
               "id": 24685,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Uncle Harold",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119d81",
               "name": "Martin Balsam",
               "profile_path": "/vOrAfNxbu3Y1eQbdVQGUcmTu9Rc.jpg",
               "id": 1936,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mrs. Miller",
               "gender": 1,
               "credit_id": "52fe4c6b9251416c75119d85",
               "name": "Nancy Marchand",
               "profile_path": "/d9DASq3XmUsyfzSrATbAAOY7yn1.jpg",
               "id": 12957,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Miss Dennison",
               "gender": 1,
               "credit_id": "52fe4c6b9251416c75119d89",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Morris",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119d95",
               "name": "Bob Balaban",
               "profile_path": "/3g7IKz8ycv0opDxmpoBxsQkUslU.jpg",
               "id": 12438,
               "order": 5
            },
            {
               "cast_id": 1,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119d77",
               "name": "Al Pacino",
               "profile_path": "/f9tBVwcNHnawvMoyuuzmKvEhBsb.jpg",
               "id": 1158,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Shirley Norton",
               "gender": 1,
               "credit_id": "5631ee629251413b46004883",
               "name": "Salome Jens",
               "profile_path": "/8j4USKO81HQSa6fmB086crtnq3S.jpg",
               "id": 86343,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mr. Miller",
               "gender": 2,
               "credit_id": "5631ee859251414ad80102db",
               "name": "Philip Sterling",
               "profile_path": null,
               "id": 22437,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Betty",
               "gender": 2,
               "credit_id": "5631eece925141284c0122be",
               "name": "Philip Sterling",
               "profile_path": null,
               "id": 22437,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Stanley Dexter",
               "gender": 1,
               "credit_id": "5631ef789251413b460048ac",
               "name": "Deborah Winters",
               "profile_path": "/akHgQXj4Q4djdCA3YXaSPickQ8q.jpg",
               "id": 140883,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Harvey Belman",
               "gender": 0,
               "credit_id": "5631efb3925141285701245e",
               "name": "Ron Hale",
               "profile_path": "/q6KbbkSZE3PuELiOu7sOUp74goG.jpg",
               "id": 1217677,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Mrs Schroder",
               "gender": 1,
               "credit_id": "5631f02cc3a3681b61012aeb",
               "name": "Ann Thomas",
               "profile_path": null,
               "id": 1528898,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Hester",
               "gender": 1,
               "credit_id": "5631f045c3a3681b4b011379",
               "name": "Catherine Burns",
               "profile_path": null,
               "id": 1230605,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c6b9251416c75119d7d",
               "name": "Fred Coe",
               "profile_path": null,
               "id": 15671,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5971447a9251412d4c03fd06",
               "name": "Stanley Shapiro",
               "profile_path": null,
               "id": 58415,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5631edd39251412857012407",
               "name": "A. Martin Zweiback",
               "profile_path": null,
               "id": 176453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5631edeb9251414ab7010167",
               "name": "Stanley Shapiro",
               "profile_path": null,
               "id": 58415,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5631ee069251416167004323",
               "name": "A. Martin Zweiback",
               "profile_path": null,
               "id": 176453,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "597144719251417fa60024e4",
               "name": "Kurt Neumann",
               "profile_path": null,
               "id": 1513646,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "59714481c3a368712802d83c",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5971448792514112bb001aff",
               "name": "Arthur J. Ornitz",
               "profile_path": null,
               "id": 31501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59714491c3a3686f7c024efc",
               "name": "Sheila Bakerman",
               "profile_path": null,
               "id": 1855274,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "597144979251412d4c03fd2b",
               "name": "John McSweeney Jr.",
               "profile_path": null,
               "id": 21508,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5971449dc3a36813d700184b",
               "name": "Marion Dougherty",
               "profile_path": "/vHUj1WzotNrj9PTT6wJ1yhhULbD.jpg",
               "id": 3806,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "597144a392514112bb001b26",
               "name": "George Jenkins",
               "profile_path": null,
               "id": 6358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "597144aa92514113010019ff",
               "name": "Anna Hill Johnstone",
               "profile_path": null,
               "id": 6851,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.716056,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 181553,
      "vote_count": 2,
      "budget": 0,
      "overview": "Since she was a child, Natalie Miller has always thought she was an ugly ducking. Despite her mother's encouragement that she will grow up to be pretty, Natalie has never believed it will happen. She rents a Greenwich Village apartment from an eccentric landlady and gets a job at the Topless Bottom Club. She rides a motorcycle to work, decorates her loft with a moose head, and rides up and down a dumbwaiter to get to her apartment. There Natalie meets David an artist, and the two have a love affair before she discovers he is married.",
      "similar": [
         843,
         28468,
         37265,
         36630,
         1440,
         27066,
         283227,
         4507,
         884,
         10998,
         284,
         244772,
         634,
         2539,
         255,
         11368,
         1259,
         2251,
         9716,
         24016
      ],
      "original_title": "Me, Natalie",
      "runtime": 111,
      "poster_path": "/kivb5tELiUhfkYf0j2vgFyIfEqi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nob Hill Productions Inc.",
            "id": 60950,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinema Center Films",
            "id": 3070,
            "origin_country": ""
         }
      ],
      "release_date": "1969-07-13",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fred Coe"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "A. Martin Zweiback",
         "Stanley Shapiro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064651/",
      "coverLink": null,
      "actors": [
         "Patty Duke",
         "James Farentino",
         "Martin Balsam"
      ],
      "reviews": [
         "Those of us who grew up being less than \"beautiful\", can relate to Natalie all too well. We were unattractive, for whatever reason, and needed to feel loved and wanted. The progression of the film was perfect in the way it portrayed Natalie finding her own self, in both worth and confidence. The parents we excellently scripted and acted, as well as Farentino's character. It makes you laugh and cry at just the right times, and leaves you with a sense of being able to make the changes in your life that you didn't think were possible. I haven't seen this film since it's original release, but it has obviously made a tremendous impact upon me. I hope someone has the sense to release it on tape.",
         "\"Me, Natalie\" is very much a film of two times: literally, the late 1960's (in which it takes place) and figuratively, post-adolescence, which it's heroine grapples with throughout the film. Along the literal lines, the film sensitively deals with the generation gap during the era in which it was perhaps most severe. Impressively, ageism is never cause for condescension in this film. Not so impressively, a gooey Henry Mancini soundtrack and some maudlin wanna-be-romantic photography date it pretty badly. As a coming of age story, the film is very much a contemporary of \"The Sterile Cuckoo\", being about a relative misfit who must find what works for her as she enters adulthood. How one feels about these eras will invariably affect how one responds to the film. It's chief assets are it's vivid New York atmosphere and it's terrific cast. Patty Duke carries this film as effortlessly as Sandy Dennis or Natalie Wood carried earlier films of a similar nature, and she is surrounded by a terrific supporting cast. Fans of \"The Sopranos\" will enjoy seeing the late Nancy Marchand, who is superb as a very different type of mother than Livia Soprano. Martin Balsam and Elsa Lanchester are also memorable in brief appearances. James Farentino is effective as the artist Natalie falls in love with, and Al Pacino is charismatic in his first screen role as a cad she meets at a dance. The entire cast works beautifully, and makes a look at this film well worth while.",
         "The good news: Patty Duke redeems herself as an actress after her admittedly \"bad work\" in \"Valley of the Dolls.\" The bad news: hardly anyone went to see this in theaters. That's a shame because there's much to commend this film. Most of that centers around Duke's performance (actually, they're all top notch performances here). She has to convince us she's unattractive, vulnerable, yet no weakling by any stretch of the imagination. Yet I never felt entirely sorry for her because she seemed well equipped to weather the putdowns that come from being an ugly girl. I ended up liking Natalie because Duke makes her likable -- yeah, she's got a heart of gold but she's got spirit, too. There are all kinds of nice moments here but I especially appreciate the scene at the Hoboken ferry landing where she goes to see if her fictional Prince Charming will actually materialize. She won a Golden Globe award for this performance and it stands as probably her best work as an adult. From here she moved into what is arguably her second best adult role, in the TV film, \"My Sweet Charlie.\" She won an emmy for that one. About this time she also did a wonderful job in a PBS film called \"Birdbath.\" Again, she's paired with Farentino and again, she's a plain Jane from New York City, but this time with an entirely different psychological make-up from Natalie and with a horrible secret. Duke sure showed a lot of potential for the big screen...too bad it never materialized. And it's too bad this film isn't available on VHS.",
         "I finally managed to secure a 16mm transfer of ME, NATALIE on NTSC VHS cassette after searching for this film for nearly nine years. I originally found it on Japanese laserdisc in a video store in Manhattan in 1994 but the price was $75.00 and I was hardly about to spend that kind of money! Al Pacino has a less-than 60-second role in this 1969 \"people will love you for the person you are inside\" drama starring Patty Duke and Martin Balsam. I always liked Balsam, and he had me giggling after he discourses on the virtues of being homely, then announces his decision to marry a stripper! He's a true male chauvanist pig. LOL Nancy Marchand is very good as Duke's mother, but the screenplay suffers from a preachy tone that gets to be a real turn-off by the end of the film. A running time of 90 minutes would have been plenty rather than the nearly 107 minutes that it does run. I love movies shot in New York City, and this film does an ample job of capturing the aura of city life at that time. Worth seeing for the performances, plus seeing Livia Soprano 30 years younger is a treat...",
         "I watched a film print from my collection of this coming of age story last night for the first time in years and came away feeling somber, yet inspired at the same time. Patty Duke is remarkable as Natalie and she does indeed have a transformation of character. Natalie metamorphosis's before our eyes from an \"ugly duckling\" to a beauty by the film's end. The change has nothing to do with makeup, but everything to due with Duke's power as an actress. All of the performances are stellar. I like Henry Mancini's melancholy score. It is difficult to fathom why this inspirational film is unavailable to the public in any format including cable and satellite television. Many could relate to this story and find the movie helpful.",
         "Me, Natalie is a very evocative film of the late '60s. It's notable as one of Al Pacino's first films but Patty Duke gives a wonderful performance. It's a shame this isn't on video. It perfectly captures the vibe of late '60s New York.",
         "This is by far one of my favorite films ever. I haven't seen it since I was 9 or 10 about 12 years ago. I absolutely love Patty Duke's performance, and the film is so balanced and witty. It definitely inspired me to be a filmmaker and I would love to see it again.",
         "Part of this movie was shot right across the street from me, in an apartment building on Ocean Parkway in Brooklyn, NY, when I was a kid. One of my friends lived there, and when I came out of his apartment, I talked to Patty Duke who was sitting with some crew in the lobby, for a couple of minutes before they ushered me out. I was a major fan of the Patty Duke show, so I was thrilled, and she was very nice. It's the only movie I can ever remember shot in my neighborhood, and it caused quite a thrill. I don't remember much about the movie except the Brooklyn street scenes of neighborhoods I was familiar with. I'd love to see this movie again to relive some of those moments. Is it ever played on TV on one of the movie channels that specialize in older movies like AMC or Turner Classic Movies?",
         "It's tough to make Patty Duke into an ugly duckling. Her fierce determination, wiseass manner, and throwaway good humor are attractive qualities--and they each serve to save her \"homely\" character from heartbreak. Natalie is a textbook plain Jane from Brooklyn who finally makes a break from her parents and moves to the Village; she gains strength in her independence, but her self-consciousness (and keenly-honed sense of dramatics) cause her to hit a comedic bump or two. Martin Balsam has a wonderful and sensitive supporting role as an adoring uncle, and James Farentino is very fine playing an artist with whom Natalie falls in love. Their relationship is surprisingly free of the usual clichés, making this a sweet, warm, funny movie that has stood the test of time. *** from ****",
         "This movie really shaped my adolescence. James Farentino was so dreamy in it. I cried when she left him even though I knew it was the right thing for her to do. The use of humour as a defence mechanism was truly touching. Philip Sterling and Martin Balsam's performances also stand out in my mind --- and what a creep Bob Balaban was! A well-done memory everlasting.",
         "I saw this movie as a young girl and it made a lasting impression on me. I have since the internet spent many hours trying to get a copy of the movie. Can anyone tell me where I can acquire a copy? Patty Duke was a favorite of mine since Gidget. I have to say however, anything I have seen her in has been talented and artful. Patty Duke will remain a favorite of mine for life. James Farantino all I can say about him is WOW what an awesome part he played in this movie and can you believe I forgot Al Pacino. I just remember this movie with a love in my heart for Natalie and what she had to do to succeed. The ultimate creativity to survive. Thank you, in advance. O'Nan Pensacola",
         "I was 13 when I saw Me, Natalie on Swedish television. I thought it was great, especially the scene where Natalie tries to kill herself, it was so funny and heartbreaking. I enjoy the memory of this movie, and intend not to see it again.",
         "This was one of the crucial films in my childhood. Can't forget it. Anyone of you who reads this knows what I mean. If not, find it, watch it, and cry a bit. It's good for you.",
         "I remember going into Center City Philadelphia with a friend and walking along Chestnut Street right past a line of hippies waiting to get into Easy Rider. Of course, we went to see Patty Duke as we were fans of her TV show. I enjoyed the That Girl mixed with pathos. Yes, it was a tad preachy but the golden girl attracting trouble, a little schadenfreude on Patty's part? But, all too soon, Patty became involved with the wrong man, too. There was a lot of good in the movie for us young girls to see. Natalie graduating from school, getting a job and her own place complete with the bed cut of a bathtub seemed preferable to doing the deed in a New Orleans graveyard as in Easy Rider.",
         "The film shows the trials of growing up and becoming an independent person. I felt that Natalie was an unpopular person in school, who couldn't get acceptance and happiness in it. She found herself after graduating high school and going into the adult world. She became a happy and mature person. Shame the movie isn't on DVD because it is a relevant movie. Natalie becoming an independent adult is what each of us goes through in life, no what what generation growing up happens. I feel that people that are unpopular and not attractive can be successful and independent just as people who are popular and attractive. Unfortunately, the world puts too much emphasis on physical attractiveness and popularity. Each of us strives for acceptance and independence, among other things, just like Natalie did in \"Me, Natalie.\"",
         "I saw this film many,many years ago when I worked in a movie theatre in Brooklyn, New York. It was a great coming of age film for young women experiencing love, freedom and independence. I sure wish some cable channels would pick up and feature it some time. Like on the \"WE\"-Women's Entertainment channel. Can't get it on video,I've tried with no result.",
         "Frustrating comedy drama was made after the creative and critical debacle of Valley of the Dolls and seems to have been intended primarily to rescue Patty Duke's career as a potential movie star and re-establish her as the adorable and sweet screen presence that she was before Dolls. Hiding Duke's natural appeal under bad hair, a putty nose and Jerry Lewis teeth clearly wasn't the path to movie stardom because she only top-lined one other theatrical movie after this one, the underrated You'll Like My Mother. The bigger problem with Duke's love-me-please performance in Me, Natalie is that she doesn't do the character or the movie any favors. The basic plot involves an ugly duckling girl looking for her place in the world as a young woman. The problem with Duke's performance is that it feels shallow and gimmicky--she never captures her character's genuine pain and longing (at one point when a favorite uncle she hasn't seen since childhood comes to visit she flees through her bedroom window because she feels so awful about her looks). Patty Duke and the movie also largely ignore Natalie's negative qualities such as her complete lack of empathy for other people, her shallowness and her judgmental nature. At one point after leaving home she finds out that her dead uncle's former fiancé has died from a drug overdose and all she feels is that it's a great opportunity for her to get her first apartment. The movie seems to think this is cute and quirky but in reality it's sad and probably a little creepy. Natalie shows a similar obliviousness to anyone's feelings other than her own when she attends a former best friend's wedding, sees that the bride to be is pregnant and not marrying her boyfriend and then leaves the church without ever saying anything to her friend to even let her know that she was there. This was an opportunity for Me, Natalie to confront the main character's shallow belief that beautiful people always have beautiful lives and the movie completely flubs it by not giving Natalie and her former best friend a scene together. Natalie eventually engages in an affair with a neighbor that doesn't ultimately go anywhere because the main character is too immature and indecisive. I'm sure that wasn't the intention the filmmakers had in mind with the ending but that's about the only thing you can really take away from it. Some people might find this movie of interest as a period curio or because Al Pacino turns up for one scene in his big screen debut. I can't watch Me, Natalie without feeling sad for the big screen career that Patty Duke should have had--she probably squandered more talent than any other actor or actress from her generation. How many other actors went from winning an Academy Award to doing guest spots on The Love Boat and Hawaii Five-O?",
         "This is an audience movie. You can pick apart the minor faults, but in the end it doesn't matter. If you click with Patty Duke's character/performance you're going to love this. And she's tremendously good here, easily her best adult performance. She's funny, bitter, innocent, sweet, conniving, honest, temperamental, gentle, loving and cold. Her facial make- up is by Dick Smith (who later transformed Marlon Brando in THE GODFATHER) and is completely believable and natural-looking. The supporting cast is an embarrassment of riches: Nancy Marchand as the nervous Mom who refuses to admit she has an ugly duckling daughter, Martin Balsam as the kind, understanding Uncle whose actions ultimately belie his words, Salome Jens who makes a big impression in a small part as the ex and future stripper, Deborah Winters a year before her starring role in THE PEOPLE NEXT DOOR as the beautiful friend and Bob Balaban as one of Natalie's horny dates. There's also Cathy (LAST SUMMER) Burns and Al Pacino in blink and you'll miss 'em debuts. James Farentino is the male lead and he's aces. Filmed all over Greenwich Village and Brooklyn in the late '60's the film will offer New Yorkers a nostalgic look-back. There's a beautiful score by Henry Mancini, for those that like his work (in the mode of TWO FOR THE ROAD) and a couple of vocals by Rod Mckuen. Inexplicably a box office dud, the same year THE STERILE CUCKOO was a hit., I think the film's horrendous poster sheet was the reason. They obviously wanted to keep Duke's appearance a secret and it back-fired. Never released on video or DVD as of yet, and hardly ever shown on TV (National General Pictures, anyone?) this funny, perceptive coming-of-age story is probably only available on bootleg.",
         "Me, Natalie is more of a curio than a worthwhile film. Most noteworthy for being Al Pacino's film debut, Me, Natalie was rightly overshadowed by two other 1969 releases featuring an ugly duckling/misfit: The Sterile Cuckoo and Last Summer in which Liza Minnelli and Catherine Burns gave genuine performances that garnered sympathy, and Oscar nods. As Natalie, Patty Duke is abrasive and grating, and her false nose and buck teeth are distracting. Amateurish and lackluster, the film is a compilation of wisecracks and sentimental clichés directed without atmosphere or pacing by Fred Coe who alternates drab interiors with lyrical interludes set against New York with syrupy music by Henry Mancini and awful lyrics by Rod Mckeown. Another hard to find theatrical release starring Duke, 1972's You'll Like My Mother, is a more satisfying film.",
         "thinking about such a film being the debut of Al Pacino is just uncompilable but not that it isn't possible where you'll have Patty Duke playing the titular role of Natalie where both have acted as per the story could give them the chance of. Me, Natalie is that type of film that falls into category of slice- of-life and bildungsroman where films like (500) Days of Summer 2009, A Swedish Love Story 1970, Adam 2009 and the perks of being a wallflower 2012 also brings similar elements of finding one's own personality and importance into the world they live. with other aspects, films look dated into filming but as per the story standards, it is still relevant. acting is average but what you could expect more from a script that brings monotonous and simplicity too simplified? at last, this one counts in the rare to find dramas and by chance if you get a hold of this onto TV or DVD, do give it a try, you won't be dissatisfied.",
         "A buried treasure if ever there was one. This movie, released in 1969, is residing in the \"where is it now?\" file and that's unfortunate because it's an excellent, uncompromising look at the life of an ugly duckling and how she manages to \"make it\" in the world. It also features Patty Duke's best acting. She's great as a self deprecating social outcast who takes a long time to come to terms with herself. Donning buck teeth and a permanent scowl, Duke carries this film. There's no false notes in the script and Fred Coe's direction is great. Nancy Marchand, Martin Balsam, Salome Jens (unexpectedly cast as a stripper) and James Farentino are in the supporting cast. Elsa Lanchester has a cameo as Duke's daffy landlady. Al Pacino made his film debut as a creep who rejects Duke at a school dance. The songs are by Rod McKuen & Henry Mancini and the NYC location photography is by Arthur J. Ornitz.",
         "I've been waiting for 20+ years for this wonderful movie to come out on VHS or DVD. I fell in love with both of the major characters played by Mr. Farantino and a very young Patty Duke, but especially Mr. Farantino. When I saw this film, I was a young girl, just a bit older than Natalie in the film, I found it wonderful that the male character found something special in a girl's life when she needed it the most. It is a heartwarming movie for the entire family. I am Keeping an eye for it on AMC, Turner Classic Movies, this week especially because of the passing of Mr. Farantino. It's a wonderful film, I saw it once and it stuck with me. Hopefully one of the networks will do a tribute to him this week and show this movie so I can see it a second time. I am hopeful."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cinema Center Films",
         "Nob Hill Productions Inc."
      ],
      "summaries": [
         "Since she was a child, Natalie Miller has always thought she was an ugly ducking. Despite her mother's encouragement that she will grow up to be pretty, Natalie has never believed it will happen. She rents a Greenwich Village apartment from an eccentric landlady and gets a job at the Topless Bottom Club. She rides a motorcycle to work, decorates her loft with a moose head, and rides up and down a dumbwaiter to get to her apartment. There Natalie meets David an artist, and the two have a love affair before she discovers he is married.",
         "A young woman struggles for independence."
      ],
      "budget": 0
   },
   "movielensId": 162616,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-07-13",
      "dvdReleaseDate": null,
      "directors": ["Fred Coe"],
      "runtime": 111,
      "movieId": 162616,
      "title": "Me, Natalie",
      "mpaa": "",
      "actors": [
         "Patty Duke",
         "James Farentino",
         "Martin Balsam",
         "Nancy Marchand",
         "Elsa Lanchester",
         "Bob Balaban",
         "Al Pacino",
         "Salome Jens",
         "Philip Sterling",
         "Philip Sterling",
         "Deborah Winters",
         "Ron Hale",
         "Ann Thomas",
         "Catherine Burns"
      ],
      "imdbMovieId": "0064651",
      "originalTitle": "Me, Natalie",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Since she was a child, Natalie Miller has always thought she was an ugly ducking. Despite her mother's encouragement that she will grow up to be pretty, Natalie has never believed it will happen. She rents a Greenwich Village apartment from an eccentric landlady and gets a job at the Topless Bottom Club. She rides a motorcycle to work, decorates her loft with a moose head, and rides up and down a dumbwaiter to get to her apartment. There Natalie meets David an artist, and the two have a love affair before she discovers he is married.",
      "tmdbMovieId": 181553,
      "avgRating": 3,
      "releaseYear": "1969",
      "numRatings": 2,
      "posterPath": "/kivb5tELiUhfkYf0j2vgFyIfEqi.jpg"
   }
}