{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wrestling",
            "id": 5970
         },
         {
            "name": "extreme championship wrestling",
            "id": 12187
         },
         {
            "name": "wcw",
            "id": 190660
         }
      ],
      "imdb_id": "tt0471614",
      "video": true,
      "title": "Cheating Death, Stealing Life: The Eddie Guerrero Story",
      "recommendations": [],
      "backdrop_path": "/fJbqPNOJJmshbnLVrpcBE8L3Y6P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "",
            "gender": 0,
            "credit_id": "52fe4f26c3a36847f82c0edd",
            "name": "Eddie Guerrero",
            "profile_path": "/cFtgpO2r79ZpkQhJzwIIZcUJK4.jpg",
            "id": 543535,
            "order": 0
         }],
         "crew": []
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.020924,
      "production_countries": [],
      "id": 247488,
      "vote_count": 0,
      "budget": 0,
      "overview": "Born into Mexico's first family of sports-entertainment, Eddie Guerrero's career choice was only natural. In the ring, Eddie was unbeatable. He was part of the most popular tag team in Mexico. Fans worldwide were captivated with his high-flying style. Soon, he moved to Japan and experienced similar success. After returning to the United States, Eddie faced a challenge he was not prepared for - addiction. Surviving a car accident that almost killed him, Eddie felt he was bulletproof, resulting in reckless behavior that put his life, career and marriage in jeopardy. Then it all fell apart. The true test of any man is how he handles adversity. In one of the most inspiring stories in the history of sports-entertainment, Eddie Guerrero not only regained his life, he surpassed his wildest dreams. This is his story.",
      "similar": [
         12163,
         9053,
         1850,
         502122,
         87492,
         66027,
         84682,
         446663,
         360814,
         11307,
         11535,
         376812,
         20697,
         304458,
         19119,
         34303,
         257747,
         60979,
         388862,
         238475
      ],
      "original_title": "Cheating Death, Stealing Life: The Eddie Guerrero Story",
      "runtime": 44,
      "poster_path": "/ning5hMYcxJxk7jYXLLrKAIPslQ.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-05-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 360,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0471614/",
      "coverLink": null,
      "actors": [
         "Eddie Guerrero",
         "Kurt Angle",
         "Art Barr"
      ],
      "reviews": ["It's probably not much of a surprise that I now review this biographic documentary of Eddie Guerrero. I admit that I wasn't exactly a head over heels die hard fan of the guy, but I never saw a bad Guerrero match, ever. This is my way of saying \"Thanks, Eddie. And bless you.\" I knew that the Guerrero family has had long traditions in wrestling, both in Mexico and the US. I was caught a bit off guard when I got to know that even Mando Guerrero had been wrestling. One of the bonus matches is actually Gory's three oldest sons (Chavo, Mando and Hector) taking on RPM and Cactus Jack in a six man tag match at AWA Superclash III. (A bit strange that a match that doesn't include Eddie is on Eddie's movie though. But no complaints, because the match was entertaining.) All of Eddie's brothers praised him as the superior wrestler and really showed him the best of respects. The part that dealt with Eddie's addiction was quite sad and disturbing, but in a good way. I must agree to the fact that when you talk about something as serious and terrible as drugs, it's not going to be a pleasant moment. The dirt must be dug up so the people can learn from it. Eddie is actually one of the best examples, both on the good and bad. (Note: If you think about it, the youth today and their drinking and drug habits are about the same as old rockers has had over the years. People remember Rolling Stones, Doors, Beatles and Jimi Hendrix for their drug use as well as their music. These people took loads of drugs and booze, but obviously, the younger generations haven't learned. Sad really...) Eddie took a big load of drugs, but miraculously, he prevailed. Thet takes guts, hard training and a iron will stronger than any to do. I tip my hat, nay, take it off, for Eddie. Eddie was a all-round kidder, no doubt. He had a laid-back style and lots of humour and self irony. This gave birth to the Latino Heat, Los Guerreros, the Raza and the Lyin', Cheatin' an' Stealin'. Being this good-guy with criminal habits worked out well for both him and Chavito. I'm glad to see that Eddie came in on a track where he felt secure. The documentary itself doesn't cover his WWE Championship and the story lines it took on, but let me just say it like this; I'm glad Eddie was stripped of the WWE title as quickly as he was. He might've put the worst of his demons behind him, but the pressure of being the WWE Champ would most likely re-ignite some of them. Eddie was strong, but not that strong. Or rather, WWE decided to not finding out. They played it safe, and I really am glad for that. And I'm pretty sure Eddie was as well. Now, you may ask that if I thought this documentary was so great, why not the top score? First, I thought it was too short. The actual documentary is barely 70 minutes long, and the extra material on the first disc is a bit messy. It doesn't really make too much sense time line-wise. On disc two, there's ONLY extras. This is good, but it's still messy, according to the time line these things has occurred. And there are more matches that I think should've had alternate commentary. There's alt. commentary with Dean Malenko, Rey Mysterio and Rob Van Dam, but there's matches with Chris Jericho and Chavo Guerrero that I'd love to hear alt. commentary on. Well, c'est la vie. I recommend (and note this; I NEVER, NEVER, recommend films) all Eddie fans to get this. This is his testament. This is his legacy. (Final note: What really irks me, is that Eddie will be just like JYD; inducted in the Hall of Fame after his death. I was so hoping to see him stand there on the podium, a elderly, graying gentleman with a wave of cheers rushing over him. Now it's not to happen.)"],
      "genres": [
         "Documentary",
         "Biography",
         "Sport"
      ],
      "productionCompanies": ["World Wrestling Entertainment (WWE)"],
      "summaries": ["The highs and lows in the life of WWE Champion Eddie Guerrero are explored."],
      "budget": 0
   },
   "movielensId": 162884,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-05-26",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 44,
      "movieId": 162884,
      "title": "Cheating Death, Stealing Life: The Eddie Guerrero Story",
      "mpaa": "",
      "actors": ["Eddie Guerrero"],
      "imdbMovieId": "0471614",
      "originalTitle": "Cheating Death, Stealing Life: The Eddie Guerrero Story",
      "genres": [
         "Action",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Born into Mexico's first family of sports-entertainment, Eddie Guerrero's career choice was only natural. In the ring, Eddie was unbeatable. He was part of the most popular tag team in Mexico. Fans worldwide were captivated with his high-flying style. Soon, he moved to Japan and experienced similar success. After returning to the United States, Eddie faced a challenge he was not prepared for - addiction. Surviving a car accident that almost killed him, Eddie felt he was bulletproof, resulting in reckless behavior that put his life, career and marriage in jeopardy. Then it all fell apart. The true test of any man is how he handles adversity. In one of the most inspiring stories in the history of sports-entertainment, Eddie Guerrero not only regained his life, he surpassed his wildest dreams. This is his story.",
      "tmdbMovieId": 247488,
      "avgRating": 3,
      "releaseYear": "2004",
      "numRatings": 1,
      "posterPath": "/ning5hMYcxJxk7jYXLLrKAIPslQ.jpg"
   }
}