{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0497639",
      "video": false,
      "title": "Be Silent, Sorrow, Be Silent",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "53da68b30e0a2652dc002636",
               "name": "Vera Kholodnaya",
               "profile_path": "/uukpJDjxA77IFZKPnGE1J6fpNqG.jpg",
               "id": 1210599,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "53da68bd0e0a2652df0027b3",
               "name": "Pyotr Chardynin",
               "profile_path": null,
               "id": 1157257,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "53da68c40e0a2652dc00263c",
               "name": "Konstantin Khokhlov",
               "profile_path": "/rB1zIA5BoHmzLkuSNZJn53h6r6e.jpg",
               "id": 1348116,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d54c3a36847f825b359",
               "name": "Pyotr Chardynin",
               "profile_path": null,
               "id": 1157257,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d54c3a36847f825b35f",
               "name": "Cheslav Sabinsky",
               "profile_path": null,
               "id": 1157573,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.611398,
      "production_countries": [],
      "id": 174895,
      "vote_count": 3,
      "budget": 0,
      "overview": "Paula is a circus performer married to the alcoholic clown-acrobat Lorio. Lorio's heavy drinking leads to him being severely injured during a performance. This forces Paula and the now-crippled Lorio to become street musicians. This film formerly ran to 81 minutes – regrettably, the second half is considered lost.",
      "similar": [],
      "original_title": "Молчи, грусть... молчи",
      "runtime": 45,
      "poster_path": "/cKZgclzQ2KB0qPhAi9xH3fgzMtC.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1918-05-14",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Pyotr Chardynin",
         "Cheslav Sabinsky"
      ],
      "runtime": 45,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "None",
      "imdbLink": "http://www.imdb.com/title/tt0497639/",
      "coverLink": null,
      "actors": [
         "Pyotr Chardynin",
         "Konstantin Khokhlov",
         "Vera Kholodnaya"
      ],
      "reviews": ["The Russian pre-revolutionary silent films were quite different in aesthetics and technical aspects in comparison with the Bolshevik ones. Films in the pre-Marxist period were mostly melodramas, carefully made and stylized with the classes being much idealized and romanticized. They also tended to be static and theatrical and usually without the intense and skillful narrative of the later films. Herr Pyotr Chardynin was one of these well regarded pre-revolutionary silent directors who worked, besides in old Russia, in many European countries and his star is Frau Vera Kholodnaia, the most important and famous actress during Russian silent times. Their film \"Molchi, Grust, Molchi ( Be Silent, My Sorrow, Be Silent ) (1918), is one of the last pre-revolutionary films and is typical of that period. It has a larger-than-life story wherein Frau Kholodnaia shines thanks to her restrained, modern performance and great beauty. The film tells the story of two humble circus actors, Frau Paula und Herr Lorio. Herr Lorio's fondness for booze causes him to have an accident while performing as a clown acrobat. He is crippled for life and the couple is obliged to become street musicians in order to make a living. Paula's beauty always attracted many men even during her circus times; now as street musicians, the couple performs sometimes at parties given by rich gentleman where Paula enchants many with her singing and good looks. One of the aristocrats seduces her and she leaves her husband to become his mistress. This leads to emotional turmoil and deception. The film includes a kind of moral lesson in its story, namely the risks in store for those fascinated by money and the easy life ( the delights of bourgeois style, as is mentioned in the film's opening credits). Our heroine discovers this when she exchanges her modest but happy former life for one of riches which is full of false appearances and selfishness, ultimately dragging her into the abyss. The film's sets achieve the perfect mood implicit in the story, depicting accordingly the circus atmosphere and contrasting FrauPaula's and Herr Lorio's modest home with luxurious bourgeois apartments. It combines realism and romanticism to create an intense drama full of mixed emotions. It can be appreciated also in the film the careful use of medium shots and close-ups as well as some slight camera movement. The stylized movie works very well thanks to Herr Chardynin's remarkable direction. Alas, only the first half of the film has survived so we don't know how Frau Paula dealt with her trying circumstances, made even more difficult by an accidental murder! And now, if you'll allow me, I must temporarily take my leave because this German Count must silence one of his Teutonic rich heiress' shrieking voice. Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com"],
      "genres": ["Drama"],
      "productionCompanies": ["D Kharitonov"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 163058,
   "movielens": {
      "languages": [""],
      "releaseDate": "1918-05-14",
      "dvdReleaseDate": null,
      "directors": [
         "Pyotr Chardynin",
         "Cheslav Sabinsky"
      ],
      "runtime": 45,
      "movieId": 163058,
      "title": "Be Silent, Sorrow, Be Silent",
      "mpaa": null,
      "actors": [
         "Vera Kholodnaya",
         "Pyotr Chardynin",
         "Konstantin Khokhlov"
      ],
      "imdbMovieId": "0497639",
      "originalTitle": "Молчи, грусть... молчи",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Paula is a circus performer married to the alcoholic clown-acrobat Lorio. Lorio's heavy drinking leads to him being severely injured during a performance. This forces Paula and the now-crippled Lorio to become street musicians. This film formerly ran to 81 minutes – regrettably, the second half is considered lost.",
      "tmdbMovieId": 174895,
      "avgRating": 3,
      "releaseYear": "1918",
      "numRatings": 1,
      "posterPath": "/cKZgclzQ2KB0qPhAi9xH3fgzMtC.jpg"
   }
}