{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "deserter",
            "id": 1806
         },
         {
            "name": "cross dressing",
            "id": 12090
         }
      ],
      "imdb_id": "tt0070835",
      "video": false,
      "title": "The Triple Echo",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe465ac3a36847f80fa61d",
               "name": "Glenda Jackson",
               "profile_path": "/7o9KfeMoegPR5rY905vojh1Fadc.jpg",
               "id": 115573,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sergeant",
               "gender": 2,
               "credit_id": "52fe465ac3a36847f80fa621",
               "name": "Oliver Reed",
               "profile_path": "/we10IusqRV1NHRtA68ftyck2N33.jpg",
               "id": 936,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Barton",
               "gender": 0,
               "credit_id": "52fe465ac3a36847f80fa625",
               "name": "Brian Deacon",
               "profile_path": "/48GhLPSdrWJoaYJV6FnuTDumYA5.jpg",
               "id": 107241,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Subaltern",
               "gender": 0,
               "credit_id": "58b06fa6c3a368431c003afa",
               "name": "Anthony May",
               "profile_path": null,
               "id": 115622,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Christine",
               "gender": 1,
               "credit_id": "58b070709251411a7101001b",
               "name": "Jenny Lee Wright",
               "profile_path": null,
               "id": 146706,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Provo Corporal",
               "gender": 2,
               "credit_id": "58b070c79251411a540101dc",
               "name": "Kenneth Colley",
               "profile_path": "/yNZF27tBauzUcg6Fw7M2xsRD8IC.jpg",
               "id": 10734,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Shopkeeper",
               "gender": 1,
               "credit_id": "58b071149251411a9a00fff8",
               "name": "Daphne Heard",
               "profile_path": null,
               "id": 202427,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "First Girl",
               "gender": 0,
               "credit_id": "58b07162c3a3682cf600ee5f",
               "name": "Zelah Clarke",
               "profile_path": null,
               "id": 1050332,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Compere",
               "gender": 2,
               "credit_id": "58b071aec3a3682d1b010886",
               "name": "Colin Rix",
               "profile_path": null,
               "id": 982412,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Stan",
               "gender": 2,
               "credit_id": "58ff4623c3a3685322008c44",
               "name": "Gavin Richards",
               "profile_path": "/lTSEFSrscR9hUHYZtCSVL7SI8tm.jpg",
               "id": 588306,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe465ac3a36847f80fa60d",
               "name": "Michael Apted",
               "profile_path": "/j5KoJlZUepN36ZD8VoDLuvV5BG5.jpg",
               "id": 10781,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe465ac3a36847f80fa613",
               "name": "H.E. Bates",
               "profile_path": null,
               "id": 550286,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe465ac3a36847f80fa619",
               "name": "Robin Chapman",
               "profile_path": null,
               "id": 113899,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58b072ab9251411a540102d3",
               "name": "Marc Wilkinson",
               "profile_path": null,
               "id": 32159,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "58b07301c3a3682d2400e762",
               "name": "Zelda Barron",
               "profile_path": null,
               "id": 119476,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "58b0733b9251411a5401031c",
               "name": "Graham Cottle",
               "profile_path": null,
               "id": 20119,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.676531,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 43701,
      "vote_count": 3,
      "budget": 0,
      "overview": "A WW2 deserter holes up on a farm with disastrous results. Overlooked gem with Glenda Jackson in one of her best roles and Oliver Reed playing a part he was made for.",
      "similar": [
         581,
         2289,
         1934,
         239,
         307,
         37265,
         16367,
         9576,
         3763,
         10035,
         9423,
         35696,
         19592,
         82505,
         41876,
         16780,
         701,
         24548,
         40377,
         20713
      ],
      "original_title": "The Triple Echo",
      "runtime": 97,
      "poster_path": "/o3C02WeLmICMoY6Y9SpZ0Kb4SMA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Senta Productions",
            "id": 100015,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hemdale",
            "id": 16593,
            "origin_country": ""
         }
      ],
      "release_date": "1972-01-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Apted"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Robin Chapman",
         "H.E. Bates"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070835/",
      "coverLink": null,
      "actors": [
         "Glenda Jackson",
         "Oliver Reed",
         "Brian Deacon"
      ],
      "reviews": [
         "20. THE TRIPLE ECHO (war-drama, 1973) England, WW2: Homesteader Alice (Glenda Jackson) has been left a widow by the war so now has to work the farm on her own. Soldier Barton offers to help her out. They eventually become friends then lovers. Not wanting to go back to the front, Barton goes AWOL. Alice helps him by disguising him as her 'sister Katy'. Successfully fleeing detection, their relationship turns sour, as Barton becomes accustomed to his new femininity. Even worse when visiting 'Sergeant' (Oliver Reed) takes an interest at 'Katy'. Critique: Bizarre, at times unpleasant little film has stuck with me ever since I saw it. Maybe my impressionable age at the time contributed to its lasting impact but after watching it for only the second time, I find it very original, exciting and tragic. It also reminded me of Ed Wood's infamous 'Glen or Glenda' (one of the earliest cross-dressing films), and of Sydney Pollack's Oscar winning 'Tootsie' (starring Dustin Hoffman). In those, and many others since, the emphasis is based on the whole plot's comedy-plus value. The interplay struggle to inhibit their natural desires, disgust at dressing up, and shedding their 'machismo'. Our film's hero, however, is further enticed into the role and even his personality changes. Jealousy, drama and a sisterly-type relation develops. It is only too late that he discovers what a mess this has gotten him into. Perplexing study of isolation benefits from a good cast. Oliver Reed's brutish 'Sergeant' is the standout. The surprising ending adds to the film's abstract nature.",
         "THE TRIPLE ECHO is a sedate, slow paced psychological drama with a few characters interacting in a barren and isolated landscape. It's a one-of-a-kind type film that offers up some interesting characterisation and an unusual storyline. The film was directed by Hollywood director Michael Apted (GORILLAS IN THE MIST) as one of the first things he made outside of television. The unknown-to-me actor Brian Deacon plays a frustrated young soldier who happens by a lonely farmhouse occupied by grieving widow Glenda Jackson. The two embark on an affair, although it transpires that Jackson is a little disturbed by her history. For his part, Deacon's had enough of the army, so he decides to go A.W.O.L., masquerading as Jackson's sister. Their happiness is short-lived when other local soldiers call by and one of them takes a shine to Deacon, mistaking him for a woman. The cross-dressing aspect of the tale is what makes this unusual. It's hard to believe that the rugged Oliver Reed would genuinely mistake Deacon for a woman, but there you go. The climax has an air of inevitable tragedy to it, so a sense of foreboding seeps over the latter stages of the film. The central performances are subtle and effective, although Reed is something of a scene-stealer as the flamboyant and utterly horrid army sergeant.",
         "I have loved this film ever since I first saw it, so much so that I had bought a VHS tape AND the player, as this forgotten gem is unfortunately still not available on DVD. I will not explain the plot, as the synopsis is covered rather detailed on the first page, but concentrate on the specifics. Michael Apted, from the first shot, creates a certain mood of the film which is very effective that once in, the viewer is fully engaged to the end (despite certain plot and screenplay shortcomings) and that is isolation and loneliness. And this emotion is shared by all three central characters, shaping their decisions and actions. A fitting title, as well, as we do have a three-way character development here. They all want the same things. Brian Deacon's loneliness is in his alienation and is very much a need to belong. Oliver Reed's is purely physical and Glenda shares both. All the actors are very good in their portrayals. However, Glenda Jackson's performance is what glues the whole story together. A brilliant turn, and probably her most subtle that I have seen. The silent looks that she gives are priceless. Alas, this is a forgotten gem. I don't think it will ever get a DVD release, unfortunately. But a must see, for sure. Especially if you like for those rare, character and performance driven dramas, all too rare in today's market. 8 1/2 out of 10",
         "An unusual little feature which teams Glenda Jackson and Oliver Reed with, making his debut, Brian Deacon. Deacon plays an AWOL soldier who goes to Jackson for help and ends up posing as her visiting sister, a role he grows to identify with. Reed plays a sneery officer who becomes interested in the the 'sister'. Cue a rather convoluted plot which inevitably ends in tragedy. Jackson is the best thing in this - a tired, lonely farmer looking for companionship and making tough decisions. But the film is - although fascinating - ultimately unsatisfying and seems to step back from the scenario it took such care to create just as it gets interesting.",
         "The Triple Echo is, for want of a better word, queer. It's hard to see what commercial appeal the film ever had, if indeed if ever had any. It is also hard to see how the production team and the actors ever felt that it could have much merit as art or entertainment. That's not to say that it is a bad film, for it has plenty to recommend it; it just seems necessary to point out that it is a truly odd project to have been considered for the big screen. The story tells of a widowed woman living on a farm during WWII. A deserting soldier appears on her property seeking shelter; she takes a liking to him (he is, after all, helpful and energetic around the farm) and eventually decides to help him to evade capture by disguising him as her sister. However, a crude army officer from the nearby garrison starts to fancy \"her\", until he realises that \"she\" is actually a \"he\". The three principle performances are very good, and the English countryside is painted lovingly throughout. The ending contains a genuinely surprising and jolting twist. There's even a brief dash of sex and bad language to give the film a bit of that typical 70s realism (though, obviously, the story is set during the 40s). What damages this film is the fact that it is such a thin and directionless story. This would have made a splendid 60 minute TV drama, but as a feature length theatrical release, there is simply not enough material to keep you intrigued, interested and entertained for an hour and thirty three minutes or so.",
         "Triple Echo, based on the H E Bates story, is a well-directed and well-acted film about a lonely woman (Jackson) on a farm who is visited by a young soldier (Deacon) and they soon become lovers. He decides to avoid being captured as a deserter by dressing as a woman and pretending he is Jackson's sister. A surly sergeant-major (Reed) falls for her (his) charms and invites the 'sisters' to a Christmas dance at the barracks. In a back room, Reed discovers 'her' real sex. The soldier escapes but is eventually caught. It is one of Reed's best performances, and although the plot is barely believable, the film is highly entertaining.",
         "Glenda Jackson once again proves to be the British equivalent of Bette Davis--in fact, \"The Triple Echo\" might have been an ideal vehicle for Davis had it been produced two decades earlier. In 1942 Wiltshire, a farm woman mourning the capture of her husband by the Japanese befriends a young soldier passing across her land; after several visits, they become intimate and he decides to go \"over the hill,\" but their affair is complicated by his being cooped up, hiding in the house all day. What's more, she has dressed him in her clothes and begins telling the people in town that her sister is now staying with her. Maddening story begins as jaunty fare, takes a turn into melodrama and ends on a tragic note, with the young soldier now in full drag and fending off the advances of a randy tank sergeant. Jackson retains her stubbornly sensible dignity, even when the plot goes off the rails. She's a decent, forthright, romantic-minded woman, a salt-of-the-earth type who can be mother, big sister and lover at different intervals. As the pushy sergeant who won't take no for an answer, Oliver Reed has a one-note bullying role, and director Michael Apted never steps in to scale him back. ** from ****",
         "(I have found \"triple echo\" referenced in cardiology, architecture, but most searches give returns to this movie or to the book it is based on. In square dance calling, a Triple Echo is to do concepts 1, 2, 3, then concepts 2 & 3, then concept 3. I do not recall an explanation by H.E. Bates even though I remember reading his essay on writing the book.) \"Triple Echo\" UK 1972 was sold in the US as \"Soldier in Skirts\" 1973. US audiences expected a drag farce (maybe a \"Some Like It Hot\" in uniform) but instead were served a very dark tragedy. It did not go over well. Leonard Maltin gave \"Triple Echo\" 3 of 4 stars as drama; other reviewers gave \"Soldier in Skirts\" a dud bomb. I'll compromise at five stars. The setting is the English countryside in 1943, the 5th year of WWII for the British. Farmwife Alice's husband is a POW of the Japanese and she is working their farm alone. The soldier Barton stops by the farm wandering about on leave from the Army. Alice and Barton get romantically involved. He doesn't want to return to the Army. She doesn't want him to leave. They decide that he'll go AWOL. She can't have a man living at the farm (too many questions) and the Army looks for runaway soldiers especially in wartime. So Alice disguises him as her sister Cathy from the big city. He grows into accepting the sister role living full time as Cathy. Then the blustering sergeant from the local Army base shows up at the farm scouting for a date for the base Christmas dance (but expecting sex afterward). Cathy tries to persuade Alice it would be fun to get out of the coop and go to the dance. When Alice won't go, Cathy goes him/herself and tragedy descends. People expecting a farce or comedy were not prepared for the ending.* Throughout the movie there are symbols like dark storms, birds free and confined, an ailing dog that has to be put down. People who like to study such things in films liked \"Triple Echo\"--people expecting a comedy hated \"Soldier in Skirts\". What most people notice about the movie is that Barton starts off reluctantly being groomed and dressed by Alice as her sister, then grows accustomed to being presented as Cathy, finally becoming her enthusiastically. Barton's role reversal is obvious. I wonder what is going on in Alice's head. Reviewer Pauline Kael brought up an interesting point: groomed and dressed by Alice, Cathy is more feminine than Alice who is stern, drab and mannish for most of the movie. Part of the book and movie is about traditional male roles and their impact on Alice's life. Alice is alone because her husband took up his manly duties and went off to war becoming a prisoner of war. The sergeant is a blustering male stereotype (the only comic element in the movie). Barton is AWOL--away without leave shirking his manly duties. Ultimately the story is about a lonely woman who has lost her husband to the intrusion of war into her life, then loses her lover to the intrusion of war into her life and then symbolically declares war on war itself. ______________ *SPOILER ALERT -- even though the movie ending is very different and more violent. In the book, at the dance the sergeant suspects \"Cathy\" is a man but says and does nothing; the next day Sarge comes to the farm to arrest the AWOL Barton and Alice shoots both of them. The movie ending is bloodier. It is tragedy, not comedy."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Hemdale",
         "Senta Productions"
      ],
      "summaries": [
         "Barton is a soldier in WW2 England; he meets Alice, who is looking after her farm single-handed as her husband is a prisoner of the Japanese. Barton stays overnight and they get friendly, and he decides to desert and stay with Alice. They become lovers. As a cover, she tells people in the village that her sister is staying with her, and Barton dresses the part. He has mixed feelings about the feminine role but evidently grows accustomed to it. Eventually an army sergeant comes to the farm, and is glad to learn that there are two unattached women there; he has sexual designs on them. Alice rebuffs him and he concentrates on Barton, as \"Cathy\". Barton is flattered by the attention, and foolishly agrees to go to a Christmas dance at the army base with the sergeant, obviously not realising that sexual activity will be involved, despite Alice's warnings. At the party, Barton realises what is developing, but can't escape, and the Sergeant won't take no for an answer.",
         "Deserting soldier dresses as a woman to escape detection; liking the female role he goes to a dance with another soldier and is exposed."
      ],
      "budget": 0
   },
   "movielensId": 163038,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-01-01",
      "dvdReleaseDate": null,
      "directors": ["Michael Apted"],
      "runtime": 97,
      "movieId": 163038,
      "title": "The Triple Echo",
      "mpaa": null,
      "actors": [
         "Glenda Jackson",
         "Oliver Reed",
         "Brian Deacon",
         "Anthony May",
         "Jenny Lee Wright",
         "Kenneth Colley",
         "Daphne Heard",
         "Zelah Clarke",
         "Colin Rix",
         "Gavin Richards"
      ],
      "imdbMovieId": "0070835",
      "originalTitle": "The Triple Echo",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A WW2 deserter holes up on a farm with disastrous results. Overlooked gem with Glenda Jackson in one of her best roles and Oliver Reed playing a part he was made for.",
      "tmdbMovieId": 43701,
      "avgRating": 4,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/o3C02WeLmICMoY6Y9SpZ0Kb4SMA.jpg"
   }
}