{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "balloon",
            "id": 9903
         },
         {
            "name": "based on children's book",
            "id": 15101
         },
         {
            "name": "cartoon pig",
            "id": 188652
         },
         {
            "name": "cartoon bear",
            "id": 197345
         }
      ],
      "imdb_id": "tt0211729",
      "video": false,
      "title": "Winnie-the-Pooh",
      "recommendations": [
         36162,
         36163,
         77294,
         77304,
         79701,
         72215,
         129229,
         33108,
         333372,
         77759,
         127608,
         84254,
         57778,
         77557,
         72203,
         160046,
         85051,
         59803,
         90001,
         49802
      ],
      "backdrop_path": "/yTQpsHNcrGuLJ1o8US2k0GbTrHv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Winnie-the-Pooh (a.k.a. Vinni-Pukh) (voice) (as E. Leonov)",
               "gender": 2,
               "credit_id": "52fe45d19251416c9103f64f",
               "name": "Evgeni Leonov",
               "profile_path": "/7q1rS2svu6a3sUcR9NupEm3q1J5.jpg",
               "id": 86664,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Piglet (a.k.a. Pyatachok) (voice) (as I. Savvina)",
               "gender": 1,
               "credit_id": "52fe45d19251416c9103f653",
               "name": "Iya Savvina",
               "profile_path": "/kzbPGV0xdBAKHf6F2GVdgjLyIw3.jpg",
               "id": 99265,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Narrator (voice) (as V. Osenev)",
               "gender": 0,
               "credit_id": "52fe45d19251416c9103f657",
               "name": "Vladimir Osenev",
               "profile_path": "/5OxfYN47l4Ac77DanxcIDJSZfYF.jpg",
               "id": 556920,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d19251416c9103f64b",
               "name": "Fyodor Khitruk",
               "profile_path": "/Hsf2Ou6IIo439kmQ27fDJPry8h.jpg",
               "id": 550475,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59c3076ac3a3681403003e6f",
               "name": "A. A. Milne",
               "profile_path": null,
               "id": 77545,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "59c30774c3a3681403003e8d",
               "name": "Boris Zakhoder",
               "profile_path": null,
               "id": 1892005,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59c3077a9251415b87003900",
               "name": "Fyodor Khitruk",
               "profile_path": "/Hsf2Ou6IIo439kmQ27fDJPry8h.jpg",
               "id": 550475,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59c30783c3a3681430003cca",
               "name": "Moisey Vaynberg",
               "profile_path": null,
               "id": 1568323,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "59c3078ac3a36813ed003c79",
               "name": "Nina Klimova",
               "profile_path": null,
               "id": 1892006,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59c307919251415b87003931",
               "name": "Nina Mayorova",
               "profile_path": null,
               "id": 1563383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59c30798c3a36813a90039f0",
               "name": "Eduard Nazarov",
               "profile_path": "/61vho8kE3WgAQfRynUMUXZCca1c.jpg",
               "id": 565332,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59c3079fc3a36813ed003cb8",
               "name": "Vladimir Zuykov",
               "profile_path": null,
               "id": 1563384,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.457877,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 36161,
      "vote_count": 37,
      "budget": 0,
      "overview": "With a cheeky, down-to-earth charm that appeals to both children and adults, the series – beginning with 'Vinnie-Pukh (1969)' – has since developed something of a cult following, and are considered by many to decisively surpass their Disney counterparts, however uneasily they may fit into the official canon. The animation itself is somewhat coarse and minimalistic, but this all adds to the charm of it all, with the story and characters coming to life as though they have just stepped out of a picture-book.",
      "similar": [
         36163,
         411,
         2454,
         1593,
         14160,
         73723,
         381719,
         406997,
         82650,
         430447,
         8844,
         309809,
         1265,
         854,
         283366,
         25475,
         11674,
         218778,
         250480,
         16523
      ],
      "original_title": "Винни-Пух",
      "runtime": 11,
      "poster_path": "/5eIeWYJPgJih1iSV1B8OcEiLulM.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Soyuzmultfilm",
         "id": 14599,
         "origin_country": ""
      }],
      "release_date": "1969-01-01",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/vsHksV4Gup4p0VPPXMIKygR8utt.jpg",
         "name": "Winnie-the-Pooh (Russian)",
         "id": 198987,
         "poster_path": "/6hY1kuEhzcnxo4YHqB6QZPt3MKB.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fyodor Khitruk"],
      "runtime": 11,
      "synopsis": null,
      "writers": [
         "A.A. Milne",
         "Boris Zakhoder"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0211729/",
      "coverLink": null,
      "actors": [
         "Evgeniy Leonov",
         "Iya Savvina",
         "Vladimir Osenev"
      ],
      "reviews": [
         "I remember one day, at my local Library and while I was looking for some foreign cult titles in the Video/DVD section, I came across some anthology of animated titles from Russia and former Soviet Countries and one of them, were three \"Winnie the Pooh\" titles. I had to check them out, to see what they were like. And to my surprise, most of the stories in these three animated shorts, are closely based off the original A.A. Milne books. The only thing missing was the Christopher Robin character (rumor has it by request that the real life Chris Milne, whom this character was based on, was uncomfortable with his fame and thus, wanted the studio to exclude Christopher Robin). But it is very good and nice details in the drawings and animation. I was rather pleased. But I just wish that all three of the Russian \"Winnie the Pooh\" films would be more available to the public outside of Russia and the former Soviet countries. That would be sooooo nice!",
         "Having just read Amid on Cartoon Brew about this Russian animated version of Winnie the Pooh, I just had to click on the YouTube link to see if Woolie Reitherman was right about this one being better than his for Disney. It certainly is! While I was often charmed by Sterling Holloway's voice in the Disney version, hearing the lines spoken from the former Soviet Republic and listening to the original songs from the old country brings such an otherworld feeling that I can't help thinking how livelier the Russian version was compared to the conventional American take of an English author's tale. Only Pooh and Piglet are in this story of the bear flying in a balloon with Piglet trying to get him down with his pop rifle while bees surround the stuck-in-the-air bear! No Christopher Robin which makes the story better! And great abstract-like drawings gives this short more individual personality than the more faithful-to-original-drawings one from Disney (though the Disney shorts have their own charm). Well worth seeing for international animation buffs.",
         "I don't mean to generalize, but if you really want to get some sense of the difference between Russian and American animation (with many many exceptions, obviously), just compare this phenomenal Vinni Pukh with the wretched Disney Winnie the Pooh. The Disney one is sentimental, pandering, unsophisticated, and dumb. Winnie himself lethargically stumbles along like a middle-aged man with a developmental disability. Vinni, however, is vigorous, adventurous, and witty. He's sly and he has attitude. He is no longer a disposable \"silly old bear,\" he is a worthy protagonist. Pyatachok is not a pathetic, feathery-voiced ball of pink. He is vibrant and fun, and their friendship, so beautifully rendered by Milne and made sappy and idiotic by Disney, is here authentic and moving once again. Soviet animation at its best.",
         "This series of cartoons is loosely based on the A. A. Milne's story of Winnie-the-Pooh as brilliantly retold (rather than simply translated into Russian) by Boris Zakhoder. The scriptwriters created three 15-minute masterpieces by discarding all the boring and irrelevant characters (most notably Christopher Robin, Tigger, Kanga and Roo) and beefing them up with original graphics (sooo superior to Disney's!), wacky songs and hilarious jokes. Quotes from the Vinni Pukh cartoons and humor based on them (much of it R-rated or worse) have become deeply ingrained into the culture of Russian-speaking people - probably even more than the Star Trek's \"Scotty, beam me up!\" in the United States. A must-see for any foreigner who wants to socialize with Russians.",
         "Animators in the Soviet Union never really cared about copyright. Their work was typically destined to be released only in their own country, and so there seemed little reason to bother with gaining permission from the likes of Dr. Seuss {as in Alexei Karaev's 'Welcome (1966)'} or A.A. Milne. Fyodor Khitruk's series of animated Winnie the Pooh adaptations was not the first, Wolfgang Reitherman at Disney having already directed two shorts several years earlier, but they are nonetheless well-remembered by Russians who grew up watching the cartoons on television. With a cheeky, down-to-earth charm that appeals to both children and adults, the series \u0096 beginning with 'Vinnie-Pukh (1969)' \u0096 has since developed something of a cult following, and are considered by many to decisively surpass their Disney counterparts, however uneasily they may fit into the official canon. The animation itself is somewhat coarse and minimalistic, but this all adds to the charm of it all, with the story and characters coming to life as though they have just stepped out of a picture-book. The first film runs just 11 minutes in length, and follows the efforts of Winnie and Piglet to steal precious honey from a hive of fiercely territorial bees. Demonstrating a keen sense of creativity, Winnie decides to borrow a blue balloon from Piglet's home, the idea being that, after the balloon carries him to the top of the oak tree, the bees will mistake the balloon for a piece of sky, and Winnie for a darkened rain cloud. It was a good idea\u0085 in theory. One doesn't usually associate Winnie the Pooh with intelligence, but the Russian version does exhibit a sharp sense of wit, and Evgeni Leonov brings a wonderful amount of humour and character to his voice-acting. Piglet (or Pyatachok, voiced by actress Iya Savvina) is placed cute and innocent, enthusiastically submitting to Winnie's every command, and occasionally lamenting at the loss of his beloved blue balloon. For fans of Soviet animation, or animation in general, 'Vinnie-Pukh' is a charming and witty moving storybook.",
         "Unless you've read any of A.A. Milne's original works, then your image of Winnie the Pooh is the treacly cartoons released by Disney. But there was another set of cartoons depicting the honey-obsessed bear. This set got produced by Soyuzmultfilm, a studio in the Soviet Union, and their Pooh looks more ursine than the Disney one. The first one was \"Vinni-Pukh\" (the Russian pronunciation of the bear's name). In this one, Pooh wants to get some honey out of a beehive, and so he enlists Piglet's help (Piglet is called Pyatachok in Russian). Naturally there are a few snags. I particularly liked Pooh's nonsense singing. This particular cartoon doesn't include the rest of the characters. It's all about Pooh, Piglet, and the bees. Anyone interested in the history of animation can't afford to miss this short.",
         "I can't really compare this to any other version of Winnie the Pooh, simply because I haven't seen any of them, except for maybe a few prints on some of my mother's tea mugs... But Vinni-Pukh is just wonderful, as a cartoon and as a character. He is an energetic little bear with nothing between his torso and feet, who sturdily chants his songs (still in the making, a lot of the time) while skipping through the woods, getting into small adventures. I've seen three episodes, and I'm afraid there aren't any more. Vinni-Pukh's close friend Pyatachok is a great character also, the rabbit and donkey Eeyore. The owl was my least favorite, but since she brought back Eeyore's tail... The animations are colorful, fresh and invigorating, the story lines simple, but with plenty of room for melancholy and clever musings. I'd say it's suitable for children anyway, because these more mature elements never predominate. Recommended for anyone! A big 8 out of 10.",
         "I don't think the Soviet Winnie was considerably better or worse than the American, even if only the American version managed Oscar glory. It's clearly different and though it's interesting to compare the two. I'd clearly succeed more in that if it hadn't been quite a while since I saw the American version, but some things come to mind. First of all, the one here has much darker fur while the American is pretty much in the color of honey, which, however, both really love. Also the Soviet Winnie is way more active, almost hyperactive compared to the lazy lethargic Disney Pooh, but equally good-natured and naive. Also his singing was pretty funny and, in contrast to the rest of the story, you won't need subtitles to adore his voice. Winnie doesn't wear the famous red shirt here and beyond his appearance, it should be noted that the surroundings totally look different compared to the character, pretty much like a picture painted by a child, which adds a lot charm to this film. It only goes for 10 minutes and is the first of a trilogy by Fyodor Khitruk, who died not too long ago being way into his 90s. One of my favorite moments was Pooh's reaction when he looks into the camera early on and spots us watching him. Piglet, cute as always, joins Pooh here in his quest for robbing a honeycomb, but these bees sure know how to put up a fight and the fact that Winnie isn't the smartest exactly surely doesn't help. The original Pooh-bear is a must-watch for animation lovers and an entertaining choice for everybody else as well. Also we find out where his name comes from. Recommended."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Soyuzmultfilm"],
      "summaries": ["Winnie Pooh finds a beehive on the top of a big oak tree and tries to get to the honey with the help of Piglet."],
      "budget": 0
   },
   "movielensId": 163072,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1969-01-01",
      "dvdReleaseDate": null,
      "directors": ["Fyodor Khitruk"],
      "runtime": 11,
      "movieId": 163072,
      "title": "Winnie-the-Pooh",
      "mpaa": "",
      "actors": [
         "Evgeni Leonov",
         "Iya Savvina",
         "Vladimir Osenev"
      ],
      "imdbMovieId": "0211729",
      "originalTitle": "Винни-Пух",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["_ZjhuoS6oao"],
      "plotSummary": "With a cheeky, down-to-earth charm that appeals to both children and adults, the series – beginning with 'Vinnie-Pukh (1969)' – has since developed something of a cult following, and are considered by many to decisively surpass their Disney counterparts, however uneasily they may fit into the official canon. The animation itself is somewhat coarse and minimalistic, but this all adds to the charm of it all, with the story and characters coming to life as though they have just stepped out of a picture-book.",
      "tmdbMovieId": 36161,
      "avgRating": 3.94624,
      "releaseYear": "1969",
      "numRatings": 93,
      "posterPath": "/5eIeWYJPgJih1iSV1B8OcEiLulM.jpg"
   }
}