{
   "tmdb": {
      "original_language": "nl",
      "keywords": [],
      "imdb_id": "tt1800372",
      "video": false,
      "title": "Cool Kids Don't Cry",
      "recommendations": [
         149099,
         73123,
         427095,
         56835,
         242250,
         193418,
         277190,
         87035,
         51886,
         147513,
         51837,
         24523,
         217011,
         29602,
         63784,
         33021,
         28011,
         59424,
         81707,
         28827
      ],
      "backdrop_path": "/2MzurGSVFFwVbTAolDw5Lmm2LJQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Akkie",
               "gender": 1,
               "credit_id": "52fe4b7fc3a36847f820691d",
               "name": "Hanna Obbeek",
               "profile_path": "/oVyb2YR94y6y9H9e6yXkPjrY69u.jpg",
               "id": 225046,
               "order": 0
            },
            {
               "cast_id": 19,
               "character": "Joep",
               "gender": 2,
               "credit_id": "52fe4b7fc3a36847f8206967",
               "name": "Nils Verkooijen",
               "profile_path": "/tVvcB30tIAOTsJ5eEWazR5bGmt9.jpg",
               "id": 225048,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elise",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206921",
               "name": "Fiona Livingston",
               "profile_path": null,
               "id": 1064501,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Laurens",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206925",
               "name": "Bram Flick",
               "profile_path": null,
               "id": 1064502,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Brammetje",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206929",
               "name": "Amin Belyandouz",
               "profile_path": null,
               "id": 1064503,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Juf Ina",
               "gender": 1,
               "credit_id": "53955abe0e0a266dce005f12",
               "name": "Eva van der Gucht",
               "profile_path": "/z8Vk9ND15Eo7Cs0wqXLHKFKX6lY.jpg",
               "id": 228589,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dokter Snor",
               "gender": 2,
               "credit_id": "52fe4b7fc3a36847f8206931",
               "name": "Loek Peters",
               "profile_path": "/xwq85p23vhDrs0wJH7ld1DqJSol.jpg",
               "id": 228327,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Afida (as Chrisje Comvalius)",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f820693d",
               "name": "Chris Comvalius",
               "profile_path": null,
               "id": 1064507,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Meester Henk",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206941",
               "name": "Xander Straat",
               "profile_path": null,
               "id": 1064508,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Frankie",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206945",
               "name": "Bram van der Hooyen",
               "profile_path": null,
               "id": 1064509,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Tamara",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206949",
               "name": "Lea Vlastra",
               "profile_path": null,
               "id": 1064510,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Christel",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f820694d",
               "name": "Renee de Graaff",
               "profile_path": null,
               "id": 1064511,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Nico",
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206951",
               "name": "Lucas Dijker",
               "profile_path": null,
               "id": 1064512,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Moeder van Akkie",
               "gender": 0,
               "credit_id": "546b6bb2c3a3680d7f001ef1",
               "name": "Johanna ter Steege",
               "profile_path": "/fWY2HuHSORn5EnPqFJ8sSJia2ME.jpg",
               "id": 55851,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Vader van Akkie",
               "gender": 2,
               "credit_id": "55c21fa2c3a3682379005031",
               "name": "Reinout Bussemaker",
               "profile_path": "/g0XgcYDjbNEdHdKArOREBOxtcsr.jpg",
               "id": 13516,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206957",
               "name": "Dennis Bots",
               "profile_path": "/5Fum7rwj2xQSsxuVX6XjUw20Cl8.jpg",
               "id": 1111685,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f820695d",
               "name": "Karen van Holst Pellekaan",
               "profile_path": "/lalEy1w2JFiz5CpxTi3qmCrPZgb.jpg",
               "id": 87905,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b7fc3a36847f8206963",
               "name": "Jacques Vriens",
               "profile_path": null,
               "id": 1111686,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.589559,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 115929,
      "vote_count": 54,
      "budget": 0,
      "overview": "Adaptation of one of Benelux most famous children's novels. Tough prime school girl Akkie loves soccer and can be a real bully. Love is the only thing she's scared of. When Akkie is diagnosed with Leukemia, she has to fight for her life. On the verge of going to high school, Akkie has to allow love to enter her life, and thus gain courage to accept the inevitable.",
      "similar": [],
      "original_title": "Achtste Groepers Huilen Niet",
      "runtime": 105,
      "poster_path": "/cv9lfFQDeCjgHx9GkRZSxuX5yyh.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "2012-02-15",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.achtstegroepersdefilm.nl/",
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dennis Bots"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Karin van Holst Pellekaan",
         "Jacques Vriens"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt1800372/",
      "coverLink": null,
      "actors": [
         "Hanna Obbeek",
         "Nils Verkooijen",
         "Fiona Livingston"
      ],
      "reviews": [
         "Many children's films, when dealing with a difficult subject, tend to become a little preachy, or try to put some sort of message of hope or purpose into it. Not this film. I watched it with my daughter this afternoon, and was pleasantly surprised by its sincere approach. Akkie is a popular girl in class. She's a rough 12 year old who likes playing football and gets into fights. When she is diagnosed with leukaemia, she is admitted to the hospital. Determined to get better before the school football tournament, she puts on a brave face and tries her best to get better. We follow Akkie as she's in and out of treatment, and we watch how this affects her relationship with her friends and her parents. Achtste Groepers Huilen Niet (Eighth Graders Don't Cry) doesn't hide the truth when it comes to dealing with such an awful disease as leukaemia. Akkie, her parents and her friends all have to deal with the uncertainty of whether or not she will pull through. Though initially brave-faced, the seriously weakening and drawn-out nature of the disease cause her to feel anger, sadness, despair and resign, all quite believably played by Hanna Obbeek. This is not a happy children's film, because it is not a happy subject. It doesn't use movie magic to give you a warm fuzzy feeling. It's a story about a girl who gets leukaemia. Of course it's gonna get ugly. What'd you expect?",
         "I don't remember a lot of the book, as I've read that a long, long time ago. I've read it three times, actually. And every time, I cried. So did I during this movie. Multiple times. I had to pause the movie to calm down, but maybe I'm just a bit of a 'cry baby' when it comes to movies. The movie started out great. The strong, 11/12 year old 'Akkie' is a fierce girl, willing to fight for what she wants. She's pretty popular, and only has one 'enemy'; Joep. When she gets in a fight with Joep and she gets a nosebleed after it had stopped already, they take some blood from her. She is diagnosed with Leukemia. She gets a nice doctor. 'Doctor Mustache'. He's a great person. Akkie is destined to become better. She has a strong will to live. She wants to play in the soccer tournament and represent her school. Things get better and she goes to school again. Only half days. After a while, things worsen. She makes Doctor Mustache PROMISE to cure her... And if he doesn't, he'd have to shave off his mustache. This and that happens, and she's back in the hospital again. That's when Doctor Mustache walks into the room. Akkie stares at him for a while, before saying: \"Hello Doctor Mustache... Without a mustache...\" (this is where I started crying SO bad.) You now know she is not going to make it, and that just breaks your heart. It's just a movie, I know, but thinking about an eleven/twelve year old girl with Leukemia, who will never know about all the great things that are in the future of all the other kids... It just breaks me. The soccer tournament will take place at a small patch of grass from the hospital, so Akkie can watch, through a window. After her team has won, she is smiling. Then, her smile fades slowly and her eyes close. Seeing Joep cry was also something that really got to me. The boy that bullied her so much, said 'girls can't play soccer' and even made fun of her when she got out of the hospital for a while and was bald... Cried... This movie, I gave a ten. Why? Because it's a family movie, but without the happy ending. Without the \"and she got better and they all lived happily ever after.\" They made a movie about the real deal. About how bad it can get. About how even the strong will to live is not enough sometimes. It's about someone who will never know what it's like to graduate high school, get married, have kids. It's breathtakingly, heartbreakingly beautiful, how even enemies are your friends when you're at such a low point in life. It may seem like pity, that they 'suddenly care for you.' But who really cares? At least they ARE there for you. It shows how even the people we think have no feelings at all, can be the most heartbroken of all of them. I love this movie, I love the book and I will never forget about it.",
         "When I was young I read the book \"Achtste groepers huilen niet\" I cried my way trough the second half of the book. In late 2012 I noticed they made a movie about it, I was very curious to see if they could turn such a sad story into a good movie. I was astonished. One of the best Dutch books I have ever read became my favorite Dutch movie. Normally i'm not a big fan of Dutch movies, most contain bad acting and a poor storyline, of course with exceptions (Zwartboek and Oorlogswinter). This movie is outstanding. Casting was done properly, looking at the characters in the book. The movie centers around Akkie, a fierce girl, a fighter. After being diagnosed with leukemia the quest for health starts. Akkie fights and fights but the leukemia becomes more severe. This is when she makes her doctor, who she refers to as doctor mustache, promise he will make her better. She makes him swear on his mustache. When later in the movie the doctor walks into the room with a clean-shaved face I couldn't stop crying for pretty much the remainder of the movie. What makes this movie great is the fact that this is a very realistic story. This happens all the time around the world, and is such a sad fate for the people who suffer from leukemia and other fatal diseases like this. This is for me, without doubt the best Dutch movie so far.",
         "\"Achtste Groepers Huilen Niet\", \"Eight graders Do not Cry\" and titled in Mexico as \"Los chicos cool no lloran\" is a good dramatic and poignant film that shows part of the life story of Akkie, a 12 y.o. girl that likes to play football at school where also is a popular girl with a good heart and given to his studies. Her life takes a turn when she is diagnosed with Leukemia and begins the ordeal that turns out to be the cancer treatment in pediatric oncology ward of the hospital where she is treated. She and her colleagues and friends miss each other but her health continues to deteriorate, so her colleagues organized a friendly football encounter in the hospital grounds where Akkie is the main spectator from the window of her room. The outcome is predictable from the middle of the movie but incredibly good performance of Hanna Obbeek playing Akkie, along with the rest of the cast have excellent acting combination and makes the movie is really touching, able to touch the heartstrings of moviegoers. This is a good movie. 8/10"
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Bijker Productions",
         "Rinkel Film",
         "Evangelische Omroep (EO)"
      ],
      "summaries": [
         "Adaptation of one of Benelux most famous children's novels. Gutsy middle school student Akkie loves soccer. When Akkie is diagnosed with leukemia, she has to fight for her life. As Akkie grows weaker she also grows closer to the boy she has liked all along.",
         "Akkie is a pretty schoolgirl who is good at soccer and doesn't let boys mess with her, until she is diagnosed with leukemia and has to start her battle to stay alive."
      ],
      "budget": 0
   },
   "movielensId": 163052,
   "movielens": {
      "languages": [
         "Nederlands",
         "Deutsch"
      ],
      "releaseDate": "2012-02-15",
      "dvdReleaseDate": null,
      "directors": ["Dennis Bots"],
      "runtime": 105,
      "movieId": 163052,
      "title": "Cool Kids Don't Cry",
      "mpaa": null,
      "actors": [
         "Hanna Obbeek",
         "Nils Verkooijen",
         "Fiona Livingston",
         "Bram Flick",
         "Amin Belyandouz",
         "Eva van der Gucht",
         "Loek Peters",
         "Chris Comvalius",
         "Xander Straat",
         "Bram van der Hooyen",
         "Lea Vlastra",
         "Renee de Graaff",
         "Lucas Dijker",
         "Johanna ter Steege",
         "Reinout Bussemaker"
      ],
      "imdbMovieId": "1800372",
      "originalTitle": "Achtste Groepers Huilen Niet",
      "genres": [
         "Romance",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Adaptation of one of Benelux most famous children's novels. Tough prime school girl Akkie loves soccer and can be a real bully. Love is the only thing she's scared of. When Akkie is diagnosed with Leukemia, she has to fight for her life. On the verge of going to high school, Akkie has to allow love to enter her life, and thus gain courage to accept the inevitable.",
      "tmdbMovieId": 115929,
      "avgRating": 3.3,
      "releaseYear": "2012",
      "numRatings": 10,
      "posterPath": "/cv9lfFQDeCjgHx9GkRZSxuX5yyh.jpg"
   }
}