{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4743562",
      "video": false,
      "title": "The Last Heist",
      "recommendations": [
         418930,
         381041,
         356895,
         347127,
         356334,
         347757,
         340185,
         416149,
         324264,
         370464,
         283327,
         464001,
         385309,
         362373,
         83857,
         434593,
         291347,
         381170,
         412111,
         395925
      ],
      "backdrop_path": "/ig1nVZx6FgOv82Kfi0Kgd9EEX2h.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "57c3f3b8c3a3680864002479",
         "content": "With some more money, some better talent a little more forethought, _The Last Heist_ could have been something truly miraculous. As it stands, it is instead just \"Not bad\". I like these flip-the-script type crime thrillers. Of course no one's done it quite as well as _Dusk till Dawn_, but I'm always willing to give them a chance (this year's \"_Don't Breathe_\" looks like it has potential in that category as well).\r\n\r\nHenry Rollins is outstanding, but otherwise the cast is pretty low quality. It's understandable, within the confines of a movie like this, but it still has a negative impact on the tale overall. Like when a machine gun is firing but has no recoil. It doesn't make or break the movie, but it does take you out of the moment, and all these little things add up.\r\n\r\nAlso had a little bit of a _Payday_ vibe, which I appreciate.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._",
         "url": "https://www.themoviedb.org/review/57c3f3b8c3a3680864002479"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Bernard",
               "gender": 2,
               "credit_id": "55812c74925141613c0012e4",
               "name": "Henry Rollins",
               "profile_path": "/2E0cZdoJsdt1Lv4waG3s6fsfJeU.jpg",
               "id": 9290,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Paul",
               "gender": 2,
               "credit_id": "55812a67c3a368164b0015be",
               "name": "Torrance Coombs",
               "profile_path": "/sVs354uPEdgDyp3xDJejcz0vKH4.jpg",
               "id": 495827,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pascal",
               "gender": 1,
               "credit_id": "55812a8592514112f40002bb",
               "name": "Victoria Pratt",
               "profile_path": "/wBolQdZliosbe0i54o3kGFmxIYn.jpg",
               "id": 20980,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ally",
               "gender": 0,
               "credit_id": "55812ab892514144a3001358",
               "name": "Camilla Jackson",
               "profile_path": null,
               "id": 1478021,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Manager Mark",
               "gender": 0,
               "credit_id": "55812c28c3a368164b0015ee",
               "name": "John O'Brien",
               "profile_path": null,
               "id": 1226457,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Danny",
               "gender": 2,
               "credit_id": "55812c5a92514144aa001454",
               "name": "Michael Aaron Milligan",
               "profile_path": "/1R9ugwrM39pgUti4iDzuJjy4SGe.jpg",
               "id": 1473957,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Washington",
               "gender": 2,
               "credit_id": "59085c40925141646c00b3e1",
               "name": "Mykel Shannon Jenkins",
               "profile_path": "/aOsFS6teHEoxLxaVzilpVRxVNZU.jpg",
               "id": 61856,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Biggs",
               "gender": 0,
               "credit_id": "59085c40925141643300b3fc",
               "name": "Nick Principe",
               "profile_path": "/hJFweTaWa3KB23tvWYEGZyHpd3t.jpg",
               "id": 223050,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "AJ",
               "gender": 2,
               "credit_id": "59085c40c3a368585900ad63",
               "name": "Mark Kelly",
               "profile_path": "/7TEzD5ix20IUJSiGB5VzWNci8h.jpg",
               "id": 84897,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Rick",
               "gender": 0,
               "credit_id": "59085c41c3a36858dd00b463",
               "name": "Ken Lyle",
               "profile_path": null,
               "id": 73620,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Tracey",
               "gender": 1,
               "credit_id": "59085c41925141646c00b3e3",
               "name": "Kristina Klebe",
               "profile_path": "/8vFonAbOtAjPAKdsh0ocn4Drq7.jpg",
               "id": 21321,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Harris",
               "gender": 0,
               "credit_id": "59085c41925141646c00b3e5",
               "name": "Zo Zosak",
               "profile_path": "/8Jg9hI2qx18bsQAZ6CrWaRQoA2v.jpg",
               "id": 1790733,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Santiago",
               "gender": 0,
               "credit_id": "59085c42c3a36858dd00b465",
               "name": "Ace Marrero",
               "profile_path": "/znmFZdLVnkD0TeXk71CbRWjWDsi.jpg",
               "id": 1325939,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Sinclair",
               "gender": 2,
               "credit_id": "59085c42925141647200b3dc",
               "name": "John J. York",
               "profile_path": "/o4YK42F2DWvLljWLtxOKLfxnHUv.jpg",
               "id": 137421,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Jones",
               "gender": 0,
               "credit_id": "59085c42c3a36858d600a14c",
               "name": "Guy Stevenson",
               "profile_path": null,
               "id": 1478018,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Mrs. Waxman",
               "gender": 1,
               "credit_id": "59085c42925141644a00b6bb",
               "name": "Fay DeWitt",
               "profile_path": "/10trHkyA6zuHoWfZWOttK1xqjiI.jpg",
               "id": 85837,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Cynthia",
               "gender": 0,
               "credit_id": "59085c43c3a36858b800aa40",
               "name": "Courtney Compton",
               "profile_path": null,
               "id": 1367946,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Smith",
               "gender": 2,
               "credit_id": "59085c43925141649200b647",
               "name": "Cris D'Annunzio",
               "profile_path": "/rj26vCO2dxuCzVkkHMaa3Xv8OIl.jpg",
               "id": 1050090,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Franklin",
               "gender": 2,
               "credit_id": "59085c43c3a36858a700b8be",
               "name": "Robert Craighead",
               "profile_path": "/kq461XlGRom39FXhueeD7Hi2xDD.jpg",
               "id": 949345,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Chen",
               "gender": 0,
               "credit_id": "59085c44c3a36858b800aa43",
               "name": "Steve Suh",
               "profile_path": null,
               "id": 1808610,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Vendor",
               "gender": 2,
               "credit_id": "59085c44c3a36858d600a14f",
               "name": "Lombardo Boyar",
               "profile_path": "/7zmk3iK1liMrbCnstNtbmYY3zFN.jpg",
               "id": 4992,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Tech",
               "gender": 0,
               "credit_id": "59085c44c3a368583b00b249",
               "name": "Graham Denman",
               "profile_path": "/jYuR1xctvCFrfhrLBSifL9yg8WN.jpg",
               "id": 1072143,
               "order": 21
            },
            {
               "cast_id": 26,
               "character": "Cop #3",
               "gender": 2,
               "credit_id": "59085c45c3a36858a700b8c1",
               "name": "Johnny Rey Diaz",
               "profile_path": "/a6jSuVp2j2e7to1IWwfdVSWK7Em.jpg",
               "id": 1632090,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5581296bc3a36816590011a8",
               "name": "Mike Mendez",
               "profile_path": null,
               "id": 73409,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5581299392514144aa001412",
               "name": "Mike Mendez",
               "profile_path": null,
               "id": 73409,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "558129d492514112f40002a8",
               "name": "Guy Stevenson",
               "profile_path": null,
               "id": 1478018,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "558129fdc3a3684a4d001447",
               "name": "Jan-Michael Losada",
               "profile_path": null,
               "id": 1478019,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 2.898935,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 344906,
      "vote_count": 33,
      "budget": 0,
      "overview": "A bank heist descends into violent chaos when one of the hostages turns out to be a serial killer. Trapping the well-organized team of bank robbers in the building, the killer is now picking them off one by one.",
      "similar": [],
      "original_title": "The Last Heist",
      "runtime": 84,
      "poster_path": "/bEWg8x25wTCysai22ruQR5DDAig.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "DH Films",
         "id": 55686,
         "origin_country": ""
      }],
      "release_date": "2016-06-17",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Mendez"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Guy Stevenson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4743562/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjAzMjk2MzI2Ml5BMl5BanBnXkFtZTgwMjM0OTM3ODE@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Henry Rollins",
         "Torrance Coombs",
         "Victoria Pratt"
      ],
      "reviews": [
         "Don't waste your time! 1.5 hours of total garbage and they want at least 10 lines of review where I have the difficulty of writing even one line. Don't waste your time! It tells the tale of a gang of unlucky bank robbers who, mid-job, find themselves trapped on the premises with a serial killer who gleefully embraces the opportunity to slaughter a smorgasbord of new victims. The psycho, Bernard, dubbed \"The Windows Killer\" due to his propensity to remove the eyes of his victims—he takes quite literally the idea that they're the window to the soul—is played by Henry Rollins. Clad in a nondescript dark suit, Clark Kent-style glasses and sporting a gray buzz cut, the rocker/spoken word artist/actor is supremely creepy as the deceptively calm madman who has mastered his craft. After slashing one unlucky robber's femoral artery, he authoritatively informs her, \"I estimate you have 9 minutes to live,\" although not without adding the caveat, \"I'm no doctor.\" After eagerly inquiring how it feels to have the life draining out of your body, he considerately points out, \"I'm not laughing at you\u0085I'm laughing with you.\"",
         "This Movie would pass as a semi-okay student Project. Feels like that there was no money for a good script, good actors, better cameras, good special effects, and no money at all for post production. But this isn't a student film, this is not even Mike Mendez's first film. And i don't see why Netflix payed money for this, waste of time, predictable bad movie! I feel sorry for Henry Rollins, and what has happened to him. writing 10 lines here feels like more work, than Guy Stevenson put into the Script. The Best thing about this Movie is the Poster!",
         "This movie was a complete joke, the only reason I gave it the luxury of 2 stars was because once you get past the initial shitty acting,pan shots,close ups and stupid story line you have to have to just laugh it off whilst your brain is trying to comprehend what is going on because of the amount of plot twists it has. The Australian women had a crap attitude and accent along with the Mexican taco stand man and the Asian rifle dude \"Chen\". I think these characters added a nice racial hint to the movie. At most times you could predict what was going to happen and if not then it just didn't make sense, I don't even know what to say I think I have just grown a brain tumour from watching this movie so I will leave it at that.",
         "Heat, Heist, Ocean's 11, The Score. Some great heist movies. Then there's \"The Last Heist\", which has Henry Rollins in it. You'd think that a man who's so opinionated, is a recognized actor, musician, man of thought would make sure what he's starring in is a decent film. Unfortunately either Henry is out of money, or so desperate to be in a movie that he'll take anything. A promising beginning, a confrontation between sketchy van driver and Rollins set the stage for a possibly interesting watch. Unfortunately this movie is so cookie cutter, with every cheesy cliché line you can imagine written in. It's so cliché I couldn't even watch another minute past about 20 of them. The script itself isn't very good, its exacerbated by powerful, powerful overacting by women whom I assume are very good on the casting couch, as based on their talent, I wouldn't cast them in a tampon commercial. Amazingly enough this dog seems to be a straight to video release. I can't see anyone paying for a seat for this.",
         "I have just finished sitting through what i assume is the worst movie to come out in the last 6 years. The plot twists are heinous, the acting is worse than having a ruptured spleen and that woman is definitely not Australian. I have seen a few heist style movies and this by far the worst. The movie is all together pointless, the plot is easy too follow but the acting is so poor it's hard to remember what was going on. Also, might i add that none of this movie made sense. After watching it you're just left baffled as to why this was even shown in cinemas. I would have sat down and written a proper review but I've already wasted more than enough time on this movie. I am not being overly harsh, this movie is actually terrible. If you are intentionally having a \"horrible movie night\" with the lads I suggest you add this to the list. It's full of cliché crap that doesn't follow the plot and just bleh, I'm done. 1/10 wouldn't recommend.",
         "This movie is a waste of time. The acting is subpar. The actors are melodramatic. The basic actions of the police are dumb. If you are taking fire you call for backup. You don't just keep delivering your poorly written lines. Get some basic firearm training for your cop actors. I saw a cop trying to throw bullets out of his gun. This movie in concept had the possibility of being really cool. Rollins did a great job of being creepy but the mess going on around him really wrecked his performance. I would say as long as you don't pay a dime to watch this movie aka wait till it hits Netflix. Then it is worth a couple hrs of your time.",
         "Look... so many of the other reviews slam this movie so hard, it's as if they were strapped down and forced to watch it. I doubt that was the case, so don't be so butt-hurt. The reason anyone watches flicks like these is simple: you have some time to kill and you are looking to be entertained. You know these movies are not going to be Oscar material, so don't climb up on your high-horse to condemn it. You were actually expecting a serious heist movie? shame on you. (plus, this movie isn't really about the heist at all). You were actually expecting a serious movie of any kind? you must be new to watching movies. Stop writing reviews and log a few thousand movie hours under your belt first. Then come back and try again... There are always some givens when you watch these movies: 1) the acting, by and large, will be sub-par at best for at least 99% of the actors (if not all). Don't be so indignant, you sound ignorant. 2) the plot and story will be pretty thin and weak, full of holes, and even nonsensical. more to the point, it's usually by design, as these folks know going in when they roll cameras... it's entertainment, not a holocaust documentary. lighten up. I watched the trailer for this movie, saw Henry Rollins was going to play a serial killer, and I was hooked. I expected fun and schlock, and lo and behold, I got what I came for. Hank has been doing a bang-up job in his film roles lately, and I absolutely love every minute of it. The man deserves bigger and better roles, but alas, Hollywood always seems to relegate him to bit parts. The man gives his all, and he earns every single accolade thrown his way (and deserves much more). So, to sum up: It's a fun, B-movie with Henry Rollins playing a die-hard serial killer. Pop some popcorn, grab a soda, and just chill. Enjoy it for what it is.",
         "This is by no means the worst movie of the year. That honour befalls Sniper: Special Ops. No, The Last Heist is an entertaining thriller with a pretty nifty twist. A local bank is on the verge of closing its doors for good, and has invited its vault customers to remove their possessions. In comes Henry Rollins as Window, a serial killer who has been saving mementos of his kills in the vault. However at the same time as he is tidying up, a team of armed robbers storm the bank also looking to make a specific withdrawal. The look of the film is unfortunately pretty drab, but as the film is set in a bank in the middle of getting rid of its office furniture etc it just about works. Another issue is the climax is shot in a dingy corridor with bad lighting, making it unclear what is happening. I will agree that this film contains a number of clichés, and some pretty dreadful characters, especially the two female robbers, but that didn't stop me enjoying the mayhem. For every bad character there was someone interesting to follow, such as Victoria Pratt as Detective Pascal and Mykel Shannon Jenkins, who keen eyed action fans will recognise as Turbo in Undisputed 3, as Washington Rollins is a lot of fun as the bespectacled killer and the murder scenes are plentiful and bloody, with some commendable blood squibs at work. The Last Heist has a great premise and is gorily entertaining enough but really could do with some polish to make it more appealing.",
         "The movie is real bad...I won't say they used every cliché I'm sure they missed one or two. The first thing I noticed being a Veteran was the gun usage and the visual effect of them firing and the firing modes. Right off the bat I was purely confused how they later talked about serving in the corps...and rangers...and you pray and spray...what? Horribly done by the actors and writers we'll throw the director and producer in there too because oh my god. Besides the either 2nd rate actors or the 4th rate writing Henry Rollins did a damn good job, it's really sad to see him in this horrible movie. He should sue them for how bad this movie is. To top it all off the graphical effects were better in the 70's than they were in this movie. I urge everyone to stay away from this one unless you just want to see Henry Rollins act the crap out of being a psychological serial killer!",
         "It's funny reading the 1 star reviews. Like \"they didn't spend a dime to make this movie\". Funny. Really do you know how much even independent films cost to make? The acting was terrible as some say. Maybe they need to watch TITANIC again. The acting was par. IT HAD ITS MOMENTS. It was good pace. Good quality and sound. They might of tried to hard with the Web effect. It definitely made the movie more interesting on what's going to happen next. Definitely worth a watch. This is just to add 10 lines even though I already have ten lines in. Good effort. Locations were simple. Primarily a old bank, a few rooms in the bank, and the exterior.",
         "In the main, cardboard characters collide with wooden acting. That said, Henry Rollins demonstrates that he can overcome the obstacle of ropey material and still deliver a decent performance. What a shame he don't recognise ropey material in the first instance. Dressed like an undertaker, he does a capable job of playing the creepy, serial killer. Giving the best performance of all he elevates himself above cliché. The story doesn't really hold together. In places, purpose-wise some of the characters' actions don't make any sense. They place themselves in harm's way to achieve no, apparently, useful goal. Both the good guys and the bad guys seem to be trying to trip themselves up in places. A good heist, in the movies at least, should be tight and methodical, think Heat (1995). They get in, get rich and get away. Most robbbers don't want to run into the police and get caught. Presumably. These guys take all day. There is no sense of impending deadline, so there's no tension. Conflict be shouldn't delivered in a way that makes characters unsympathetic. The robbers swear and gesticulate at one other too often to seem mature enough to be professional. Acting like juvenile delinquents makes them even more unsympathetic. This carry-on produces a sense of conflict but an irksome one. I could go on but it's too depressing. Overall, this lacks sympathetic characters and, because you cannot care about any of the characters, any real tension. It's slow, clumsy and clichéd. Television does it better.",
         "Evil upon evil in a bank robbery gone very wrong. Director: Mike Mendez and Writer: Guy Stevenson offer up a good mix of tension, suspense, horror, and mystery in a setting that slowly becomes a bloody mess! The bank robbers are out witted by a more sinister and conniving force they did not plan on in their well planned out bank heist. I read some of the other reviews here and I disagree with their low rating and opinions. This may be a low budget movie but I found the plot contagious and the suspense thrilling. Yes it's bloody and full of gore but what horror movie would be a horror movie without blood and gore? In this story you also have police and a swat team not knowing exactly what is happening in the bank and the police don't realize how they are actually helping the evil within the bank and outside the bank. This budget flick isn't for everyone. But often cheap and horror can turn out to be an entertaining story.",
         "I had a good time watching this film. All one needs to do is go into it with the right attitude. I think it's destined to be a camp classic. I read all the bad reviews and I think they are trying to compare with David Cronenberg or Quentin Tarantino type high budget, horror thrillers. The plot and story line moves along quite nicely and keeps you waiting for things to unfold while getting some gory laughs along the way. The idea of mixing a serial killer with bank robbers is intriguing and creative. It's not a $100 million dollar budget film and I think they did a darn good and entertaining job with the $10 million they had. Good entertainment.",
         "After the excellent Big Ass Spider! and the tedious TV movie Lavalantula, director Mike Mendez changed the road with The Last Heist, a hybrid of criminal thriller and visceral horror which, inside the modest niche of \"B-Movies\", fulfills with the minimum requirements of coherence and violence in order to keep us moderately entertained without making us feel we wasted our time. However, The Last Heist suffers multiple problems which darken the experience. Some action scenes feel too ambitious for the limited resources Mendez had to work with; the locations are bland and ordinary; and there are technical fails which end up being too distracting (example: the digital flashes of the guns; I could almost see water springs falling from the cannons). Fortunately, we have a slightly original premise compensating that to some point; we have seen uncountable bank robberies out of control, but the addition of a serial killer breaks the monotony. Sure, we have to swallow the huge coincidence of both things happening the same day (the robbery and the killer's visit), but it's appropriate as a catalyst of the story. Oh, and when the killer is played by Henry Rollins, we can be sure that he will exude intensity and threat. So, in conclusion, The Last Heist is a mediocre film, but it made me have a moderately entertaining, even though not lacking of frustration, time, and I can give it a slight recommendation specially to followers of \"B\" cinema who can appreciate a film mainly for avoiding the capital sin of this cinematographic niche: being boring. The Last Heist wasn't so, and that was enough to validate my time.",
         "A for effort on the filmmakers part who make a interesting tangle web as, a group of bank robbers decide to take a safety deposit bank on the eve of it's closing, only to have their plans seriously compromised when a serial killer needs to take out his stuff from the bank before it closes as well. It has it's moments of suspense as you never fully know what's going to happen next as the bank robbers try to get what they came for and the Serial Killer called the window man only sees an all you can eat of mass murder. The Last Heist is OK made possibly better because of Henry Rollers as the Window Man. Rollins has the charisma that makes the Rock a star (I'm sure all other hardcore fans wo8uld agree). Definitely a great role for him and adds interest to the picture. A funny movie to catch on Netflix. http://cinemagardens.com",
         "This is an Ultra-Low-Budget Horror-Heist Hybrid from the Director of \"Big Ass Spider\" (2013), a Big-Bug-Comedy Hybrid. It's not as Good but manages to be Watchable if Wantable for more of, well, something. The Heist Angle is Lethargic, Slowly Paced, and Amateurish. The Horror-Serial Killer on the Loose Twist is Better but is slightly Underused. The Gore-Fest that is Unleashed behind the Cops and Robbers Plot gives it the Feel of the Different. It goes for the Juggler at times and Henry Rollins as \"Windows\" shows No Restraint in His Restrained \"Polite\" Insanely Religious Character and it makes for some Disturbing Quirks in a Movie that needs more of that in the Heist Scenes. Out in Front the Band of Robbers are a Dull Bunch as are the \"Cops\" who Show Up to Foil what is a Boring Story of Military Brothers, Drug Money, and assorted \"Vigilante\" Types. These Back Lot Movie Makers almost make it all Work, but not Quite. Worth a Watch for B-Movie Lovers, the DTV Curious, and Gore-Hounds. Others are Taking a Chance and will Require a High Tolerance that these Types Demand.",
         "I literately, wasted my time. The worst movie ever. It is bad acting. Period.",
         "If The Asylum made a heist movie, this would be it. That should tell you everything you need to know.",
         "This movie is far from the worst film I've ever seen. A lot of the other reviews are being a bit harsh in their assessments. If you have better things to do, then you should probably do those things. But If you have some time to kill there are worse ways to spend it. While I enjoyed it overall, I do wish that someone else would've made it. It's an interesting concept, and Rollins fit the bill, but most of the actors were pretty bad and the overall production was lacking. Keep the concept, keep Rollins and let a major studio produce it and I'd probably leave a 7 or 8 instead of a 5 star review.",
         "This is a genre mixing film with a number of twists. The Windows Killer (Henry Rollins) removes the eyes of his victims in an effort to save their souls as directed by God. He is in a safety deposit box building that is closing down. This is the site of \"The Last Heist\" as our \"gangsters\" enter the building to rob a particular box. The Windows Killer becomes someone we root for, but then again we don't. Bad guys become good guys, and good guys bad guys. The characters and dialogue could have been a little better, but I loved how they were able to blend genres to give us a tale that looks original. Guide: F-word. No sex or nudity.",
         "It's like a Die Hard knock off, but Bruce Willis is a serial killer. These reviewers discount the effort a good Die Hard rip-off takes. Henry Rollins is John McLane (sic, maybe) with air vents included. Alas, we don't see him crawling through with witty one- liners but you get the idea. If you've seen the New World/Corman produced heist flicks from the 1990's you know what you've got here. One star reviewers need to get off their cinematic high horses and stop taking cinema so seriously. This was a great waste of time. Better than an episode of Criminal Minds!",
         "This is one of those movies that's hard to rate because on a storytelling level it's really bad, but for that very reason it's highly entertaining. Chock full of so bad it's good moments. Before things go south the killer manages to intimidate a woman into butting in line to use a safety deposit box, right in front of a guard and the manager. A robber frisks a woman for a phone but doesn't check her back pocket. A robber manages to fight energetically while bleeding out. At a point where the robbers know there's a serial killer roaming around, a robber agrees to take an old lady to the bathroom, thus separating them. A robber steps outside while the police are there and isn't immediately arrested. There's a still-working elevator that's been walled off. And I haven't even gotten to the twists that happen near the end. Other than it being way too recent to be in the public domain, it would be a perfect movie for Mystery Science Theater 3000. Get a group of friends together and have fun riffing on this.",
         "I wish i could give negative stars , the whole movie was bad and weak , casting so poor , stunts was like school play , i think they didn't spend a dime on this movie . how i wish i could reverse back my wasted time .it was like Bollywood movies , action seen were so weak the shootings were so unnatural.they could use some help from cop advisers as some cops involved in this movie they looked like some idiots.i don't know if they use a writer for this movie or they start shooting without any script and whole idea was a line length script .it was like a bunch of friends turn on the handy cam and started to film .characters were so unreal and unbelievable.",
         "The worst movie I've seen in a very, very, very long time. (And I've seen several Nic Cages ones). The acting is very weak, the script is terrible, the premise of the story is a complete joke, but what really pulls this into the garbage- can is the low production-values. The viewer is expected to believe that bank business (which apparently only has two employees), and is located in a crappy building with no security, in a courtyard, off a backstreet, has deposits worth tens of millions of dollars kept in safety-deposit boxes that look about as secure as a lunch-box. It just goes downhill from there.",
         "(I originally made this post on a social media platform, I just copied and pasted it to here. Regardless, this is my review.) So I'm watching some movie called \"The Last Heist,\" and I noticed that the majority of the robbers are literally carbon copies (asides from their names) of characters from PayDay 2. You have the leader (Dallas, or in this case Danny.. Or is it Denny? I really don't care either way...), the (no offense) black guy (Chains, no clue what is name is in the movie), the Aussie (Sydney, no clue of this characters name), and I guess the girl version of Wolf (Because the character really likes chaos and destruction, spoiler, some serial killer slits an artery in her leg and she bleeds out and then he literally takes her eyes), The getaway driver does coke, obviously linking him to Jimmy (But his name is Rick in the movie, he gets shot, haven't seen if he dies yet), and then two oddball characters who don't have much of a role. Some old dude and some other guy who kinda looks like Key from Key and Peele (It's not him by the way). It's overall a REALLY bad movie. I mean, it's a heist movie where the robbers take off their masks.. In the bank... Mid heist... Like, 30 minutes into the movie (That's a generous time assumption, btw). I can't find the budget online, but considering there's A: Only one setting, taking place in literally a run down bank with only four civvies, one of them turning out to be some serial killer who takes people's eyes, masks you could buy off of amazon (here's a link to one of the masks used in the movie https://www.amazon.com/OutdoorMaster-Airsoft-Metal-Protection- Captain/dp/B00STAS9HO/ref=sr_1_9?ie=UTF8&qid=1484525318&sr=8- 9&keywords=payday%2B2%2Bmask&th=1&psc=1 ), an extremely small cast, one ongoing joke of \"Oh wow I didn't even know you could text 911\", and some of the most lame and slow paced story line elements I have ever seen. B: Only an 84 minute run time, and C: Ripoff Payday 2 characters, it's safe to say that this movie is (to put it lightly) pretty bad. BUT: If you want to laugh at bad acting, masks you could get off of amazon for less than $50, a terrible plot line, and dumb characters getting what they deserve in a horribly cliché story line, then watch this movie. My rating of The Last Heist: 2/10. It had potential in it's hands, got up, and threw it off the top of the Stratosphere.OH I ALMOST FORGOT: Henry Rollins (Yes, the rocker dude turned actor) is the serial killer. You're welcome."
      ],
      "genres": [
         "Action",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Benattar/Thomas Productions",
         "Parkside Pictures",
         "Tadross Media Group"
      ],
      "summaries": ["A bank Robbery goes terribly wrong when one of the hostages turns out to be a wanted serial killer"],
      "budget": 0
   },
   "movielensId": 163048,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-06-17",
      "dvdReleaseDate": null,
      "directors": ["Mike Mendez"],
      "runtime": 84,
      "movieId": 163048,
      "title": "The Last Heist",
      "mpaa": "",
      "actors": [
         "Henry Rollins",
         "Torrance Coombs",
         "Victoria Pratt",
         "Camilla Jackson",
         "John O'Brien",
         "Michael Aaron Milligan",
         "Mykel Shannon Jenkins",
         "Nick Principe",
         "Mark Kelly",
         "Ken Lyle",
         "Kristina Klebe",
         "Zo Zosak",
         "Ace Marrero",
         "John J. York",
         "Guy Stevenson",
         "Fay DeWitt",
         "Courtney Compton",
         "Cris D'Annunzio",
         "Robert Craighead",
         "Steve Suh",
         "Lombardo Boyar",
         "Graham Denman",
         "Johnny Rey Diaz"
      ],
      "imdbMovieId": "4743562",
      "originalTitle": "The Last Heist",
      "genres": ["Action"],
      "youtubeTrailerIds": ["fEWoA6INhd4"],
      "plotSummary": "A bank heist descends into violent chaos when one of the hostages turns out to be a serial killer. Trapping the well-organized team of bank robbers in the building, the killer is now picking them off one by one.",
      "tmdbMovieId": 344906,
      "avgRating": 2.07143,
      "releaseYear": "2016",
      "numRatings": 7,
      "posterPath": "/bEWg8x25wTCysai22ruQR5DDAig.jpg"
   }
}