{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0082893",
      "video": false,
      "title": "La pelle",
      "recommendations": [],
      "backdrop_path": "/dppXIAYYHh9TrVfkIRu5hxE8Df0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Curzio Malaparte",
               "gender": 2,
               "credit_id": "52fe469fc3a368484e09ab13",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Principessa Consuelo Caracciolo",
               "gender": 1,
               "credit_id": "5564e7c0925141130e006ca4",
               "name": "Claudia Cardinale",
               "profile_path": "/trBLcdRy1jr6DJ46aV28UrG2ObW.jpg",
               "id": 4959,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Generale Clark",
               "gender": 2,
               "credit_id": "52fe469fc3a368484e09ab23",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Jimmy Wren",
               "gender": 2,
               "credit_id": "52fe469fc3a368484e09ab17",
               "name": "Ken Marshall",
               "profile_path": "/zaFq0rDgyYi1870hpB9EL7ruEZf.jpg",
               "id": 12811,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Deborah Wyatt",
               "gender": 0,
               "credit_id": "52fe469fc3a368484e09ab1b",
               "name": "Alexandra King",
               "profile_path": null,
               "id": 236581,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Eduardo Mazzullo",
               "gender": 0,
               "credit_id": "52fe469fc3a368484e09ab1f",
               "name": "Carlo Giuffrè",
               "profile_path": "/8Ecg5atpafJi6TPf5dUUF2xa6ZT.jpg",
               "id": 33926,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Amante di Jimmy (as Maria Rosaria Della Femmina)",
               "gender": 1,
               "credit_id": "58a856c4c3a3686679008bb6",
               "name": "Rosaria della Femmina",
               "profile_path": "/7KtXFAFVoUXbPOpKVOHjDzc4KfM.jpg",
               "id": 1760382,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe469fc3a368484e09aaf7",
               "name": "Liliana Cavani",
               "profile_path": "/840kv5t9eE9lW8jnf7o18unPsxd.jpg",
               "id": 67750,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469fc3a368484e09aafd",
               "name": "Curzio Malaparte",
               "profile_path": null,
               "id": 236579,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe469fc3a368484e09ab03",
               "name": "Robert Katz",
               "profile_path": null,
               "id": 26208,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe469fc3a368484e09ab09",
               "name": "Armando Nannuzzi",
               "profile_path": null,
               "id": 24665,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe469fc3a368484e09ab0f",
               "name": "Dante Ferretti",
               "profile_path": "/nKAB8edn2JxVpnyfQAvfQnDJkVd.jpg",
               "id": 2366,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe469fc3a368484e09ab29",
               "name": "Liliana Cavani",
               "profile_path": "/840kv5t9eE9lW8jnf7o18unPsxd.jpg",
               "id": 67750,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe469fc3a368484e09ab2f",
               "name": "Catherine Breillat",
               "profile_path": "/2oV2Jx2VbtC975ZZQshxuAarlTu.jpg",
               "id": 6295,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5564e879c3a36874e2001e54",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5aa688d60e0a263dc400a466",
               "name": "Piero Tosi",
               "profile_path": "/bTE02wqXfOBOFlAcNlpWnVfcUHO.jpg",
               "id": 32055,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.022587,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 63186,
      "vote_count": 4,
      "budget": 0,
      "overview": "Naples, year 1943, in the middle of World War II. The city has just be liberated by American troops in an era in which nobody knows just when the war or where begins the peace; winners and losers face...",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "La pelle",
      "runtime": 131,
      "poster_path": "/b4RRHjBSuwp3sxXKghawfc4SUvF.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
            "name": "Gaumont",
            "id": 9,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Opera Film Produzione",
            "id": 1549,
            "origin_country": ""
         }
      ],
      "release_date": "1981-08-27",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Liliana Cavani"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Curzio Malaparte",
         "Robert Katz"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0082893/",
      "coverLink": null,
      "actors": [
         "Marcello Mastroianni",
         "Ken Marshall",
         "Alexandra King"
      ],
      "reviews": [
         "This movie is based on the true memoirs of the main character (Curzio Malaparte) during his time when he acted as diplomatic liaison between the Allied forces and the Italian in the newly occupied Italy. The book is a collection of short stories depicting the collapse of the Italian society under Allied occupation. There is no story line between those short stories. The movie puts them in chronological order, but the reigning chaos and lack of moral message (the message is exactly the lack of morality) can confuse the spectator. This is a very original war movie, in that the main theme is the not the war front. The Allied are not viewed from their own perspective, which is one of true liberators. Instead, the movie shows the Italian people courting the Allies as liberators in order to escape from starvation. The Allies themselves are caught in a trap where they know the Italian hospitality isn't sincere, but are unable to understand why. They don't realize that before them, the Germans were courted as liberators too, and that in this context of food shortage and general poverty, the only way the Italians have to secure their survival is to play that game. Malaparte (played by Marcello Mastroiani) acts then as a translator, helping the Americans as a guide would help a tourist, by explaining in each situation why people are acting in this seemingly dishonorable way. La Pelle (The Skin) would make more sense if compared to Malaparte's twin book on the occupied Europe (Kaputt, or Broken to Pieces). In the latter, he portrays the Nazi way of oppressing through violence. In La Pelle, he shows how the Americans achieve a similar result through economic means, while refusing any responsibility. In Kaputt, Jewish women are made prostitutes by the German Army to escape death by the bullet; in La Pelle, Italian women become prostitutes for the American Army to escape death by starvation.",
         "I'd like to say that all these comments against this movie are inaccurate. La Pelle is a great movie. Hollywood would never make a movie like this. This movie has nothing to do with `Pearl Harbor'. La Pelle is a work of art, this is not another US war propaganda designed for a public brain wash. This movie is realistic, funny and sad at the same time. The story is very cleaver, intelligent. Perhaps, Americans don't like it because this movie depicts the US army involved in prostitution and in a certain disregard for the Italian people. Anyway, it's the best war movie I've ever watched in my life. There is no lies like in `Rambo', there is no hate like in `Platoon' (in which is good movie too). I recommend , I would say that it's excellent.",
         "In 1943, in Naples, Germans have just left the city when the Americans arrive, commanded by Gen. Mark Clark (Burt Lancaster), having the Italian Captain Curzio Malaparte (Marcello Mastroianni) as the liaison. The population is starving, with women and children prostituting themselves for food. Principessa Consuelo Caracciolo (Claudia Cardinale) is a noble Italian friend of Malaparte, and seems to be very adapted to all situations. Private Jimmy Wren (Ken Marshall) is the support of Captain Malaparte, and falls in love with a local girl. Honorific Colonel Deborah Wyatt (Alexandra King), an arrogant pilot and wife of an American Senator, comes to Naples to be promoted and get votes for her husband and the American president. Malaparte is assigned to show her the situation of the city. This movie is very strange, bizarre and violent. But although paradoxical, it is also fascinating. It shows a defeated people, needing to sell sons and daughters to survive. The last scene, when a tank passes over a local and Jimmy comes to apologize to Malaparte is fantastic. It shows the relation between winners and losers in a war. The cast has Burt Lancaster, Marcello Mastroianni and Claudia Cardinale, among others good actors and actresses. I like very much the work of Liliana Caviani, but this film certainly is not indicated for all audiences. My vote is seven. Title (Brazil): `A Pele' (`The Skin')",
         "As a member of the US Air Force stationed in Naples during the movie I had the opportunity to appear in the film. I think I had 26 appearances in the film, all as a non-speaking extra. I got to know some of the actors, Ken Marshall was a really decent guy, Burt Lancaster (had a photo with him) always took 2 or 3 takes to get it right, Marcello Mastroiani was amazing, he spoke his lines like he was telling a story over dinner, just flawless! Claudia Cardinale was really nice the couple times we talked. It was really an adventure doing the film, there were many hours of just sitting around waiting for something to happen. Months later when the film was released they had two showings at the NATO base. It was a sell out both times and all you could here was everyone (along with me) saying things like: \"Hey there I am, That was me, Look look, there I am again\"! Someday I would like to see it again so I could hear what it was about. One last thing, the most memorable part of the film for me was when the American tanks (Korean war vintage) went through the town and the Italians all came out and cheered. That scene had to be done twice and then spliced together. Once the director yelled (in Italian) \"cut\", Bert stood up in his jeep, with his hands on his hips, looked at a now silent cast and proclaimed in his strong voice \"In my 35 years of movie making, this is the most f***ed up fiasco I have ever been involved in\"! Maybe that made it in the directors cut!",
         "This movie, which is situated in Italy in 1944, when the Nazis were being driven out by the American army, drew a lot of attention in Italy when it came out in 1980. I watched it in an Italian cinema the year after its release and did not like it. In my opinion, under the pretext of realism, the director tried to attract a large audience by producing a movie wíth a maximum of shocking scenes, hoping that it would lead to a lot of discussion and, thereby, publicity (in which she certainly succeeded). The movie perspires, however, such a negative atmosphere, that even the presence of such famous actors like Marcello Mastroiani and Claudia Cardinale cannot save it. That a war movie presents some shocking scenes is quite natural. But in La Pelle » they are not balanced by any scenes perspiring humanity and positive sentiments. That a movie about the same violent period can be an enjoyment to watch is shown, for example, by the brothers Taviani in « La Notte di San Lorenzo », a film that I can warmly recommend. I would not recommend « La Pelle » to anyone.",
         "This movie, which is situated in Italy in 1944, when the Nazis were being driven out by the American army, drew a lot of attention in Italy when it came out in 1980. I watched it in an Italian cinema the year after its release and did not like it. In my opinion, the director tried to draw a large audience by producing a movie wíth a maximum of shocking scenes, hoping that it would be discussed a lot (which was the case). The movie perspires, however, such a negative atmosphere, that even the presence of such famous actors like Marcello Mastroiani and Claudia Cardinale could not save it. That a war movie presents some shocking scenes is quite natural. But in « La Pelle » they are not balanced by any scenes transpiring humanity and positive sentiments. That a movie about the same period can be an enjoyment to watch, is shown, for example, by « La Notte di San Lorenzo » by the brothers Taviani, a film I can warmly recommend. I would not recommend « La Pelle » to anyone.",
         "I enjoyed the movie but I am a bit biased since I had a bit part in it. I was in the US Army and serving in Naples when Cavani came looking for extras. The books is pretty good, so if you read that you will appreciate the movie even less because quite frankly, although it tries to follow parts of the book, it doesn't do a good job. I agree with another writer who said that it was pretty disjointed. I felt that. It seemed to jump from one scene to another and often there was no order to them. Also, I don't remember Alexandra King's part in the book - a US pilot with a US senator husband. That was pretty ridiculous! The best thing about the movie, I feel, was the soundtrack. By all means see the movie if you have a couple of hours (or whatever the running time is) to kill or if, like me, you were an extra. (PS - if anybody can find a copy of the movie for me in English please contact me. Thanks!)",
         "My father was in this film as the \"Veterinarian\" and therefore I was able to be on the set for a couple of the scene's being filmed. This was a great experience and being up close to the filming, the director and the cast was really a fantastic opportunity and then to see the film when it was released in an Italian movie theater as a finished product was a real treat. Over the years I have had contact with a few of the American's that were cast for \"La Pele\" (most of them as extra's). Many of the American's were from the NATO base in Naples, Italy and were friends with or knew my father. This may not have been the greatest war film ever made but the experience that I had was great and will always be remembered. Mike Cohen / mikesc99@hotmail.com",
         "We're still stunned. Such actors, Marcello Mastroianni, Burt Lancaster, Claudia Cardinale. And then such a bad, bad movie, unbelievable but true. There's no story line at all. We're jumping from one non plot into another very unclear little not important plot. What a mess it is. Very strange thing happen, for example an American tank is torn apart by about 10 boys in 5 minutes. When the soldiers come back there's nothing left. Offcause: it's very logical and believable. Mastroianni explains to another American officer that this is the way it goes in Naples, Italy. And then there's discrimination. What?! Yes, discrimination. Of black American soldiers, called different, searching for blond... Of soldiers from Morocco, who always have one thing on their mind and only want one thing, the French officer explains to the American general (Burt Lancaster). I'm sorry to write this, it's so stupid: but that's what this movie is! Please don't watch it!"
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Opera Film Produzione",
         "Gaumont"
      ],
      "summaries": ["After the Allies liberate Naples in 1943, the life for the locals is not much easier, especially for women. Many sacrifice their dignity and morale to survive."],
      "budget": 0
   },
   "movielensId": 163110,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1981-08-27",
      "dvdReleaseDate": null,
      "directors": ["Liliana Cavani"],
      "runtime": 131,
      "movieId": 163110,
      "title": "La pelle",
      "mpaa": null,
      "actors": [
         "Marcello Mastroianni",
         "Claudia Cardinale",
         "Burt Lancaster",
         "Ken Marshall",
         "Alexandra King",
         "Carlo Giuffrè",
         "Rosaria della Femmina"
      ],
      "imdbMovieId": "0082893",
      "originalTitle": "La pelle",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["fVbmfcdOPKI"],
      "plotSummary": "Naples, year 1943, in the middle of World War II. The city has just be liberated by American troops in an era in which nobody knows just when the war or where begins the peace; winners and losers face...",
      "tmdbMovieId": 63186,
      "avgRating": 3,
      "releaseYear": "1981",
      "numRatings": 1,
      "posterPath": "/b4RRHjBSuwp3sxXKghawfc4SUvF.jpg"
   }
}