{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "motorcycle gang",
         "id": 14736
      }],
      "imdb_id": "tt0067559",
      "video": false,
      "title": "The Peace Killers",
      "recommendations": [
         40359,
         63317,
         86527,
         84062,
         90040,
         90042,
         72984,
         40350,
         34573,
         27505,
         29394,
         12602,
         44698,
         19201
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rebel",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2e99",
               "name": "Clint Ritchie",
               "profile_path": "/8lEiJ3sHOznsp8cArd9IdxTBRBz.jpg",
               "id": 87473,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kristen",
               "gender": 1,
               "credit_id": "52fe49479251416c750c2e9d",
               "name": "Jess Walton",
               "profile_path": "/i9FRLMOCdHfGDKXYHJMF3sJkhUf.jpg",
               "id": 167365,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2ea1",
               "name": "Paul Prokop",
               "profile_path": null,
               "id": 29209,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2ea5",
               "name": "Michael Ontkean",
               "profile_path": "/6IEe5QuVb1FKjPZahGtSDD3TcLQ.jpg",
               "id": 6678,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Black Widow",
               "gender": 0,
               "credit_id": "52fe49479251416c750c2ea9",
               "name": "Lavelle Roby",
               "profile_path": "/1UO7DE0zXEHBKZ3QJB8cVVnbU8I.jpg",
               "id": 43869,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Snatch",
               "gender": 0,
               "credit_id": "52fe49479251416c750c2ead",
               "name": "Nino Candido",
               "profile_path": null,
               "id": 117407,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Whitey",
               "gender": 0,
               "credit_id": "52fe49479251416c750c2eb1",
               "name": "Jon Hill",
               "profile_path": null,
               "id": 1144178,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Gadget",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2ec1",
               "name": "Gary Morgan",
               "profile_path": "/oqlGC4bi8TO9owbEcg78d4ZqRvT.jpg",
               "id": 1217505,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2eb5",
               "name": "Robert Cornthwaite",
               "profile_path": "/zmZinTik9rWwl54rz7jd5TKoFys.jpg",
               "id": 56444,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Carol",
               "gender": 0,
               "credit_id": "52fe49479251416c750c2eb9",
               "name": "Kres Mersky",
               "profile_path": null,
               "id": 161560,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Blackjack",
               "gender": 2,
               "credit_id": "52fe49479251416c750c2ebd",
               "name": "Albert Popwell",
               "profile_path": "/ywlCVvQ2Z6UnnIoiCLcpPhGSsg9.jpg",
               "id": 21925,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49479251416c750c2e95",
            "name": "Douglas Schwartz",
            "profile_path": null,
            "id": 56131,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.419602,
      "production_countries": [],
      "id": 94055,
      "vote_count": 6,
      "budget": 0,
      "overview": "Siblings Kristy and Jeffrey are buying supplies at a remote desert gas station when some members of a biker gang come cruising in. The bikers recognize Kristy, who used to be the main squeeze of the gang's leader before she ran away. The pair get away, but the bikers find out that they're living in a nearby commune, and start making their battle plans to bring Kristy back.",
      "similar": [
         9659,
         71676,
         11199,
         189260,
         2252,
         5925,
         36648,
         1948,
         97367,
         20526,
         8810,
         699,
         714,
         2503,
         28696,
         923,
         17689,
         14746,
         238636,
         1885
      ],
      "original_title": "The Peace Killers",
      "runtime": 88,
      "poster_path": "/rq4y3VQRQisVy3a2xygfquf8aHX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1971-09-29",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "They ride to love... They ride to kill!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Douglas Schwartz"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Michael Berk",
         "Diana Maddox"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067559/",
      "coverLink": null,
      "actors": [
         "Clint Ritchie",
         "Jess Walton",
         "Paul Prokop"
      ],
      "reviews": [
         "What more could you ask for in a biker flick? The Peace Killers features hairy hippies, Jesus freaks, pot smoking pill popping baddies, gratuitous psychobabble, a fuzztone driven score...everything adds up to one of the best (and least known) entries in this entertaining genre. Directed by future Baywatch creator Doug Schwartz, the film features an attractive lead in fresh-faced Jess Walton, who plays ex-motorcycle mama Kristy. She's being pursued by her former paramour Rebel (Clint Ritchie, who looks like a gone to seed James Brolin), a biker with a HUGE stars and bars flag flying from the back of his hog. This is a very violent film--the pencil skewering scene is unpleasant, and a rape sequence early on quite nasty--but a well made one, with good location photography by the director. (Incidentally, I think the Topanga gas station in this film is the same one utilized in Ray Dennis Steckler's The Thrill Killers--but I may be mistaken.) Add in some great folk-pop numbers from singer Ruthann Friedman and an unforgettable crucifixion scene, and you have a real winner! Side note: future Terrence Mallick cinematographer and husband of Sissy Spacek, Jack Fisk, was the gaffer on this film.",
         "A young woman (Jess Walton), who is the former \"old lady\" of the vicious leader of a motorcycle gang, is living in a rural hippie commune with her brother (Michael Ontkean) when she is spotted by several members of her former gang. The bike gang (\"Death Row\") shows up at the commune, \"crucifies\" the pacifist leader of the group on a peace symbol (some heavy symbolish here), and takes off with the girl, planning to \"teach her a lesson\" by gang-raping her. She escapes again with the help of a bizarre interracial rival biker gang, which is led by a black woman(!). They return her to the commune with the \"Death Row\" gang hot on their trail, and the brother tries to convince the pacifist leader to fight back this time. This biker vs. hippie movie is no masterpiece, but it's surprisingly entertaining. Whatever message it is making about violence and pacifism seems a little confused, but I still find movies like this vastly preferable to the mindless, simplistic movies that have dominated the action/revenge genre since the era of Reagan and \"Rambo\". In real life, of course, the bikers actually got on pretty well with the hippies, despite their diametrically opposed politics and attitudes towards women, mostly due to their mutual interest in drugs (which said a lot about the priorities of the hippie movement). It's also a little hard to believe anyone still regarded hippies as naive, gentle pacifists after the Manson Family murders. The lead actress Jess Walton is absolutely beautiful (and has nude scenes). She kind of reminds me of British actress/singer Jane Birkin. This is her only major movie, but she would go on to a long television career. The director Douglas Scwartz would also go to a long television, uh, career (he later created \"Baywatch\"--oh, the horror, the horror!). Michael Ontkean though is the most recognizable talent having appeared in both famous movies (\"Slapshot\") and TV series (\"Twin Peaks\"). This is definitely worth a look.",
         "WOW, is all I can say after watching this - amazingly in both a good and bad way. Expecting a simple clichéd biker movie, instead I discovered a movie that somehow manages to encapsulate every major theme from early '70s filmmaking, from the counter-cultural bikers of \"Easy Rider\" to Southern California commune hippiedom, blaxploitation, and even the ultra-violent vigilante-ism of Sam Peckinpah (\"Straw Dogs\"), \"Death Wish,\" \"Last House on the Left,\" \"Switchblade Sisters,\" and \"Billy Jack.\" So much crammed into one movie, Quentin Tarantino must have seen this at some point and been at least somewhat inspired in his own style of multi-themed filmmaking. By no means a great film, and really not a good one either, I still found myself glued to this amazing cultural artifact. I'm really surprised that this movie has basically been forgotten, having never been released on DVD; amateur B-movie connoisseurs and midnight movie-houses would eat this one up if they got their hands on it. The director, Douglas Schwartz (this was his first feature film) would soon go on to make the excellent forgotten film \"Your Three Minutes Are Up\" starring Beau Bridges, and \"Baywatch\" many years later. The tone of these two movies (\"Your Three Minutes...\" was a light comedy with serious undertones) could not be more different, yet in both of them Schwartz displays a near-brilliant ability to evoke the socio-cultural milieu of Southern California in the early-'70s (even early Baywatch episodes carry some of this skill in his feel for settings.) If you are in the least bit turned off by violence, I recommend not watching this, as there is blood, mutilation, rape, and plenty of general nastiness. On the other hand, if you can laugh along with the irony of \"serious-themed\" pictures like this one and \"Billy Jack\" (released the same year) portraying \"pacifism through the barrel of a gun,\" then you should have yourself some trashy drive-in good times.",
         "Kristy used to be the 'old lady' of the leader of a biker gang. However, after seeing another woman brutally raped, she'd had enough and ran off--even though they promised to track her down and kill her if she did. Some time has passed and by chance, a member of this old gang sees her in a general store--and not surprisingly, he goes to get the gang. As for Kristy, she's being hidden by a group of annoying hippies--annoying because they promise a lot but won't lift a finger to fight. What will become of her? I sometimes enjoy an old biker film--mostly because they are so cheesy. However, \"The Peace Killers\" was not a film I particularly liked since it went farther than most films in the genre. For most of the films, the gangs looked mean, talked mean and even did a few mean things. These folks, in contrast, really are evil--and the film is pretty vivid in its depiction of rape and nudity. I just felt uncomfortable with a film glamorizing or exploiting rape...and never actually finished watching this one. See it if you like--I just think it crosses the line from entertainment to sleaze. Not enjoyable--just nasty.",
         "It is nice to look back on an older movie and see the fun these people had when they were making it. Sure I would not pay $10 at a Theatre today to watch it, but I will pay the $19.99 to go buy it on DVD! This is definitely bound to be one of the cult classics. From the symbolism to the graphic fight scenes, this movie has everything except powerful actors and a strong plot. I would HIGHLY RECOMMEND THIS TO EVERYONE! Perhaps being somewhat young (30) I have a different perspective on things, but it seems to me like movies today have been struck by the disease of Political Correctness in every aspect of life. A movie like this today would only bring about riots and protests. It is very refreshing to watch a movie which demonstrates a time when women are both powerful and submissive. This movie has it all and even though its story is taken from another, you have to appreciate the style and perspective of this director.",
         "Biker gang terrorizes hippie commune. This is pure cult biker flick fun from the seventies. Before they arrive, we witnessed a gas station owner tortured with a pencil, and the gang rape of Kristen (Jess Walton - Jill Foster Abbott from \"The Young and the Restless\") after she tried to leave the gang. She did get away, so they track her down to a nest of real hippies. They finally catch her and have another gang rape planned. But she escapes and is brought back to the commune by a rival gang. Now we have a war brewing. After the brawl is almost over the commune's guru (Paul Prokop) finally tires of turning the other cheek and smashes Rebel (Clint Ritchie) up against a tree.",
         "It's not Easy Rider, but it's an excellent example of a late 60s/early 70s youth culture drive-in movie experience. Terrifying and disturbing with a message of peace that makes the violence even more distressing. The conflict between a life of mindless violence and a life of intellectual peace is not wasted in a thin story. There is a thoughtful intent in the script and the film's direction. The fight scenes were a bit soft, but pacifists don't have that much butt-kicking training. The uses of original songs to convey the inner life or lack of an inner life of certain characters seems corny by today's standards, but the songs themselves are nice. For what it is, it's well done.",
         "A commune of hippies run into trouble with a brutal gang of bikies, and their blissful pacifist future is in grave danger. As luck would have it, along comes another gang of bikies, who team up with the hippies, who discover a latent bloodlust, so we get to see a gory fight. The hippies even file their medallions so that they are sharp enough to slash throats. Heartwarming.",
         "Every now and then one must set aside the horror and Kung Fu in order to watch a little sleazy Bikersploitation and, to my surprise, Comcast's Action On Demand channel 'Impact' not only offered this film but featured it in HD! It still looked crap. That's not the point though, right? What we want from a film called The Peace Killers is a violent, sleazy biker flick and that's just what we get here. Mixing equal parts Hicksploitation and Blaxploitation, \"Thunder in Paradise\" and \"Baywatch\" creator Douglas Schwartz created a nasty little steamer of a film worth checking out, if you're a fan of exploitation. The Peace Killers isn't a great film by any means; the acting was acceptable for low budget acting, the fight sequences were poorly choreographed and the deaths were completely unconvincing. In other words, it's the type of exploitation we've all come to know and love with just the right amount of nudity, rape and hot hippie ass to keep viewer's from setting down the remote and walking away or turning the channel. While all of this may sound negative, it isn't. I found myself slightly entertained despite this film's shortcomings. I can't recommend this film to those unfamiliar with Bikersploitation, or exploitation in general, but those \"in the know\" will probably want to check it out. Cowboy's crazy eye commands you!",
         "Siblings Kristy and Jeffrey are buying supplies at a remote desert gas station when some members of a biker gang come cruising in. The bikers recognize Kristy, who used to be the main squeeze of the gang's leader before she ran away. What is the deal with hippies versus bikers? I presume this trend was inspired by \"Easy Rider\", but it seems like there is a large (but still obscure) subgenre of films about hippies who get attacked by bikers. Some from Roger Corman, and some from even lower budget producers. In this film, the hippies are so obsessed with love, with their leader being a perverted sort of Christ figure. I could not decide if I was supposed to sympathize with them or not. While the siblings are obviously the protagonists, the \"new age\" factor was just a bit too much for me."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Damocles Productions",
         "Transvue Pictures"
      ],
      "summaries": ["Siblings Kristy and Jeffrey are buying supplies at a remote desert gas station when some members of a biker gang come cruising in. The bikers recognize Kristy, who used to be the main squeeze of the gang's leader before she ran away. The pair get away, but the bikers find out that they're living in a nearby commune, and start making their battle plans to bring Kristy back."],
      "budget": 0
   },
   "movielensId": 163116,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-09-29",
      "dvdReleaseDate": null,
      "directors": ["Douglas Schwartz"],
      "runtime": 88,
      "movieId": 163116,
      "title": "The Peace Killers",
      "mpaa": "R",
      "actors": [
         "Clint Ritchie",
         "Jess Walton",
         "Paul Prokop",
         "Michael Ontkean",
         "Lavelle Roby",
         "Nino Candido",
         "Jon Hill",
         "Gary Morgan",
         "Robert Cornthwaite",
         "Kres Mersky",
         "Albert Popwell"
      ],
      "imdbMovieId": "0067559",
      "originalTitle": "The Peace Killers",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Siblings Kristy and Jeffrey are buying supplies at a remote desert gas station when some members of a biker gang come cruising in. The bikers recognize Kristy, who used to be the main squeeze of the gang's leader before she ran away. The pair get away, but the bikers find out that they're living in a nearby commune, and start making their battle plans to bring Kristy back.",
      "tmdbMovieId": 94055,
      "avgRating": 2.5,
      "releaseYear": "1971",
      "numRatings": 1,
      "posterPath": "/rq4y3VQRQisVy3a2xygfquf8aHX.jpg"
   }
}