{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "based on video game",
            "id": 41645
         }
      ],
      "imdb_id": "tt1394259",
      "video": false,
      "title": "Street Fighter IV: The Ties That Bind",
      "recommendations": [],
      "backdrop_path": "/70zFffSmWuNw2B41xa9gLfBoZ7c.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ryu",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081edb",
               "name": "Hiroki Takahashi",
               "profile_path": "/wmzysldCM041UPoIrwBT9RJlv2D.jpg",
               "id": 219752,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Ken Masters",
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081edf",
               "name": "Yuuji Kishi",
               "profile_path": null,
               "id": 1149050,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Chun-Li",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081ee3",
               "name": "Fumiko Orikasa",
               "profile_path": "/2kfzSkZ9bPyrZ3iJkgroDJeLWbC.jpg",
               "id": 23988,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Guile",
               "gender": 2,
               "credit_id": "52fe46bd9251416c75081ee7",
               "name": "Hiroki Yasumoto",
               "profile_path": "/ymjuSuBHkQ0uT1awBpxvnWPaHPC.jpg",
               "id": 216448,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Sakura",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081eeb",
               "name": "Misato Fukuen",
               "profile_path": "/4AF8snoeYKKcErxko7pwmILMTy7.jpg",
               "id": 219575,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Crimson Viper",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081eef",
               "name": "Mie Sonozaki",
               "profile_path": "/6hCmJAClF1SuWKN16RwnGnzUbIr.jpg",
               "id": 210350,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Gouken",
               "gender": 0,
               "credit_id": "53eccbe10e0a261935000028",
               "name": "Toru Okawa",
               "profile_path": "/uHMclppYBmWxivA2Gkwr1bwYkKw.jpg",
               "id": 9719,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Akuma",
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ef7",
               "name": "Taketora",
               "profile_path": null,
               "id": 1149051,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Cammy White / Eliza Masters",
               "gender": 1,
               "credit_id": "52fe46bd9251416c75081efb",
               "name": "Miyuki Sawashiro",
               "profile_path": "/uXnEBFwtq2Un0ripVQIBSscDzjp.jpg",
               "id": 186341,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081eb9",
               "name": "Jirô Kanai",
               "profile_path": null,
               "id": 80210,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ebf",
               "name": "Hirohisa Soda",
               "profile_path": null,
               "id": 80211,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ec5",
               "name": "Takuho Takemoto",
               "profile_path": null,
               "id": 80212,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ecb",
               "name": "Hideyuki Fukasawa",
               "profile_path": null,
               "id": 80214,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ed1",
               "name": "Jirô Kanai",
               "profile_path": null,
               "id": 80210,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bd9251416c75081ed7",
               "name": "Keiji Inafune",
               "profile_path": null,
               "id": 995035,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 0.618482,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 16257,
      "vote_count": 5,
      "budget": 0,
      "overview": "After the fall of Shadaloo, things went quiet and everyone continued with their daily routine. However a new evil is lurking on the horizon and the fighters that battled against Shadaloo must take up arms once again. Meanwhile a mysterious detective, whose motives are unknown, is going to any extent to find the lonesome wanderer Ryu, who appears to play a big part in the scheme of this new evil.",
      "similar": [
         9053,
         11841,
         55292,
         140300,
         9461,
         146,
         605,
         24,
         604,
         682,
         9502,
         11770,
         7549,
         9312,
         42194,
         37724,
         2024,
         861,
         862,
         9335
      ],
      "original_title": "ストリートファイターIV 新たなる絆",
      "runtime": 65,
      "poster_path": "/jhkfOqW1zCqogyzgjm7JCe3BifD.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Studio 4°C",
         "id": 11671,
         "origin_country": ""
      }],
      "release_date": "2009-02-17",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/kkUdnFLEwzHPU8medJE2Vn4pm1B.jpg",
         "name": "Street Fighter (Animated) Collection",
         "id": 190435,
         "poster_path": "/zrX0hsl3ny8WWCe5ww5PZlHgjjc.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jirô Kanai",
         "Kôji Morimoto"
      ],
      "runtime": 65,
      "synopsis": null,
      "writers": [
         "Hirohisa Soda",
         "Takuho Takemoto"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1394259/",
      "coverLink": null,
      "actors": [
         "Hiroki Takahashi",
         "Yûji Kishi",
         "Fumiko Orikasa"
      ],
      "reviews": [
         "A 65 minute OVA released together with the collector's edition of the new Street Fighter IV game. It serves as a lead in to the game's main storyline which is a sequel to the Street Fighter II game. OK so it is a prequel of sorts to the game, but even so, the story is less than interesting. Other than the character driven subplots of Ryu and the dark Hadou, Ken and his wife, the other plot threads are thin and boring. The main storyline about some experimental molecule destroying weapon plays out like a pre-teen adventure spy storybook with minimal intrigue or sense peril to the characters involved. One can't help but feel that the climax is a throwback to the cheesy 1994 Jean Claude Van Damme Street Fighter movie with the main characters joining forces to invade the enemy stronghold and defeat the power mad main bad guy. The characterization and personalities are give and take at best but if they are keeping true to the characterizations in the game, then i can only blame the source material since many of the characters in the game have been based on cultural and one dimensional personality stereotypes. Now on to the animation itself since this is what sets this apart from the game. The animation is bad. The quality is inconsistent, looking more like a low budget TV series than a OVA. The coloring is flat, shadows and shading are present but only in the simplest form and on close-up shots, and the animation movement is very stiff. There are many scenes which involves just long boring pans over landscape or a single talking head with monologue looped over it. Characters stand as still as statues throughout lengthy conversations without so much as a twitch aside from very basic mouth movements(yes the mouth movements and word shaping aren't even properly synced to the voices in both the Japanese and English versions) The fights are brief and utilize a lot of animation short cuts and a low frame rate resulting in jerky punches and kicks. The art leaves much to be desired with many of the characters sporting a \"puffed\", roundish, cartoony look. A far cry from the muscular gritty look in the game. On the other hand, There are a few scenes of well used 3D CGI and the \"special power\" scenes aren't too bad. In summary, this OVA prequel is not worth the extra 20 bucks for the collector's edition. Even fans of anime itself may be put off by the lousy production values of this show. Only the most hardcore of Street Fighter fans, or those put off by how much the latest Street fighter movie deviates from the game, will be able to sit through this. A silly, shoddy mess of a show with numerous production flaws, shoddy voice acting in both language tracks and juvenile storytelling.",
         "It's overall better than the live-action movie, but that's not saying much. The only really memorable part is the one were Cammy gets electro-groped by C. Viper. No, I did not just make that up. One of the most biggest femme fatals of the video game industry, gets defeated in less than a minute, but also in one the most humiliating and embarrassing defeats in film. For a tribute to the game, why are two of the four new characters completely absent from the film all together? Sure Rufus and El Fuerte were absolutely retarded, but they still deserved to be at least featured in someway. So all that we have left is Abel and C. Viper. Abel is barely in the film, and it is C. Viper who is the one who takes up the most screen time. This wouldn't be a problem ...if she wasn't such an unlikable character. Technically she's not a \"villain\" so to say, but her actions are so despicable that she might as well be the villain. Not only does she electro-rape Cammy, but she also threatens to murder Cammy, and also kidnaps Ken's wife, for her own purposes. And we're suppose to sympathize with her, because she's a single mother? Yeah, not buying it. The other characters are faithful to their video game counterparts, but that still doesn't make them good characters. Admittedly, the movie can't be blamed for this so much as the game series itself. It's no secret that most of the characters in the Street Fighter universe are based on cultural stereotypes, but that doesn't automatically make them bad characters. Mostly they're just one-dimensional, and uninteresting. For the fight scenes, there's not really much to talk about, as they are just okay. They lack any of the grittiness that made the fight scenes in the animated movie so good. Overall, it's superior to the live-action film, but is inferior to the animated movie. I'd recommend that you go back and watch the animated movie. It includes most of the characters from Ties That Bind, and thankfully lacks C. Viper.",
         "I stumbled upon this Anime on Wikipedia's list of Anime based on video games page by chance and thought that it would be as good as the original Streetfighter Anime from 1994. Sadly however, Streetfighter IV: The Tide That Bides is no where as amazing as its previous effort as this one is disappointing. The plot takes place before the Streetfighter 4 game so it's a prequel to it. Characters in Guy, Dhalsim, Fei Long, Blanka, E. Honda and Dee Jay to Streetfighter 4 newcomers El Fuerte, Rufus, Juri, Hakan are all absent and are nowhere to be seen. However, it makes one wonder why is this actually called Streetfighter 4, when in which one say one third of the characters from the game are in it? It makes no sense. Much of the movie involves the characters spending a large chunk of the film having a conversation- and less on the fighting and action sequences. The main storyline involves Ken, Ryu and Crimson Viper with Chun Li and Guile playing second fiddle to the trio and although it was the writers attempt to make this watchable, it became overdrawn and turned out to be a snooze fest. It got to me that the writers or whoever it was decided to make Crimson so annoying, arrogant and obnoxious. Because when I played Super Streetfighter 4, as she is a CIA agent, I assumed she would be a tough character with a heart. Viper in the games is a cool chick, but here she could've been easily mistaken as one of the villains. The animation is OK at best, although the colours look muted and drab. The character designs I thought are somewhat good - Anime standard that is, but they're not great. I still dislike the live- action Streetfighter flick of 1994 with Van Damme more and would rank this below that and the recent legend of Chun Li movie in third place. If they put more time and effort into it, it would've been a terrific Anime; but alas, this was a waste of an opportunity & a waste of the Streetfighter 4 franchise. In all, a huge disappointment and inferior to the Streetfighter 2 Anime, which is still class 17 years on.",
         "they actually ended it. In simple words, it was as if they quickly assembled an anime to coincide with the video game and didn't bother developing it properly or ending it properly. it has some good elements in it though, e.g when ryu is able to finally control the dark hado (it's called something else in the film) that was quite a moment. ken storyline was good, and some of the minor action scenes were watchable. the story wasn't brilliant, but wasn't bad either. they just needed to spend more time on developing it properly and finishing it off. if your following the film in regards to continuity, then it takes place a while after street fighter II. overall, OK movie, but a disappointing way to end it, if that is where it ends.",
         "This movie was 105 min of my Life I\"ll never get back. The Over compensating Story Line takes a way from a Movie with the title called \"Street Fighter\". I thought this movie lacked good fighting scenes, Failed on implementing special Moves for the characters and try to make a world in Peril out of special Fighting skills... this movie dragged and Just Just.... JUST DISAPPOINTED ! ! ! ! Compared to the Street Fighter 2 (Sutorîto Faitâ II gekijô-ban(1995) ) movie which I Loved, the animation in this Movie was a step down. It had a Horrible Cute Cartoon network type anime Look which took Away from the gritty fighting scenes that they did manage to slip into the Movie. SPOILER*** Kinda****....Surprisingly KEN MASTERS goes the Entire movie without throwing his signature Upcut ? Guile goes Through the Movie throwing one sonic boom and no Flash Kick ? Chung Li throws a punch and kick here and there ? Cammy ...ummmm gets owned ? I mean with the Slew of characters And signature moves you'd think a Street Fighter movie would be enjoyable to the fans and game go'ers... apparently I was mistaken ! Just to Give fellow movie Watchers a heads up Cause I know whether I trash this Movie or not street Fighter fans will Watch it regaurdless lol....Its an 105 min long.... The Movie didn't have Action or at least a decent fight scene till 55 min into the Movie....BORING to say the Least !",
         "Every Street Fighter anime that has come out after Street Fighter 2: the Movie has been such a disappointment to me that I sincerely hope they just don't keep making them anymore. It has been remarked that the animation itself was obviously rushed to coincide with the game's release, as was the story, but what I find most disappointing about it is *SPOILER WARNING* that this is a Street Fighter anime with no actual fights in it. Yes, you read that right: there are no fights here. What there is, is two beatings. First the new character, Crimson Viper, gives Cammy a horrible beating. Then the villain, Seth, gives Ryu a horrible beating until Ryu throws *one* Hadouken at him, and defeats him. That's it. Unless you count Sakura and Chun Li kicking some random thugs, that's all the action this anime has. Also, of the new characters, only Viper appears in the anime, unless you count the two seconds where Abel shows up at the end. Rufus and El Fuerte are nowhere to be seen. This thing might as well be called \"The Crimson Viper Show\", and I find her extremely unlikeable, to boot. Don't waste your time and look for an anime with some actual action, instead."
      ],
      "genres": [
         "Animation",
         "Action",
         "Fantasy",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Studio 4°C"],
      "summaries": ["An anime OVA based on the Street Fighter IV Video game."],
      "budget": 0
   },
   "movielensId": 163106,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2009-02-17",
      "dvdReleaseDate": null,
      "directors": ["Jirô Kanai"],
      "runtime": 65,
      "movieId": 163106,
      "title": "Street Fighter IV: The Ties That Bind",
      "mpaa": "NR",
      "actors": [
         "Hiroki Takahashi",
         "Yuuji Kishi",
         "Fumiko Orikasa",
         "Hiroki Yasumoto",
         "Misato Fukuen",
         "Mie Sonozaki",
         "Toru Okawa",
         "Taketora",
         "Miyuki Sawashiro"
      ],
      "imdbMovieId": "1394259",
      "originalTitle": "ストリートファイターIV 新たなる絆",
      "genres": [
         "Action",
         "Animation"
      ],
      "youtubeTrailerIds": ["ArOYR3ltDW8"],
      "plotSummary": "After the fall of Shadaloo, things went quiet and everyone continued with their daily routine. However a new evil is lurking on the horizon and the fighters that battled against Shadaloo must take up arms once again. Meanwhile a mysterious detective, whose motives are unknown, is going to any extent to find the lonesome wanderer Ryu, who appears to play a big part in the scheme of this new evil.",
      "tmdbMovieId": 16257,
      "avgRating": 3,
      "releaseYear": "2009",
      "numRatings": 1,
      "posterPath": "/jhkfOqW1zCqogyzgjm7JCe3BifD.jpg"
   }
}