{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "fish",
            "id": 1357
         },
         {
            "name": "aquarium",
            "id": 2269
         },
         {
            "name": "mermaid",
            "id": 5938
         },
         {
            "name": "magic trick",
            "id": 172365
         },
         {
            "name": "neptune",
            "id": 209420
         },
         {
            "name": "rabits",
            "id": 209421
         }
      ],
      "imdb_id": "tt0215992",
      "video": false,
      "title": "The Mermaid",
      "recommendations": [
         49298,
         130015,
         44330,
         44327,
         188069,
         104706,
         193411,
         106806,
         185494,
         104480,
         195584,
         196123,
         49272,
         188080,
         49277,
         104473,
         106031,
         108269,
         106024,
         106815
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "",
            "gender": 0,
            "credit_id": "5498888ac3a3681cf400024c",
            "name": "Georges Méliès",
            "profile_path": "/cjQ3IvPbkNArGjhj4dkGqEwOgdW.jpg",
            "id": 11523,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4684c3a36847f810349f",
            "name": "Georges Méliès",
            "profile_path": "/cjQ3IvPbkNArGjhj4dkGqEwOgdW.jpg",
            "id": 11523,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Fantasy",
         "id": 14
      }],
      "popularity": 1.406065,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 44328,
      "vote_count": 15,
      "budget": 0,
      "overview": "A man performs tricks with an aquarium and a mermaid",
      "similar": [
         1865,
         587,
         699,
         10144,
         12429,
         36970,
         10402,
         11019,
         38577,
         266775,
         289624,
         49067,
         5701,
         281343,
         282468,
         192354,
         501859,
         501873,
         461345,
         446129
      ],
      "original_title": "La sirène",
      "runtime": 4,
      "poster_path": "/cenE4ItaT8zP1p4rjkgYFWYKZM8.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Star Film Company",
         "id": 45867,
         "origin_country": ""
      }],
      "release_date": "1904-01-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Georges Méliès"],
      "runtime": 4,
      "synopsis": null,
      "writers": [],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0215992/",
      "coverLink": null,
      "actors": ["Georges Méliès"],
      "reviews": [
         "This Georges Méliès short feature has some pretty good visual effects once it gets going. Some of the special effects are very familiar from other Méliès features, but there is also some original material that is at times quite creative. As do a number of Méliès films, this one starts with a stage performer doing a routine. This part of it is rather bland, and although there are a couple of interesting tricks, it is really only a preface to the main sequence underwater, which is thematically set up by some tricks with fish. Once it gets to the actual \"Mermaid\" sequence, the movie really hits its stride. There are a couple of times when the camera tricks are a bit obvious, and maybe not quite up to Méliès's usual standard, but most of the other shots are rather nice. As it goes along, the visuals get more elaborate and more creative, so it's worth watching all the way through despite the slow start.",
         "There's something a bit 'samey' about this four minute short from French wizard Georges Melies. It takes place on a stage containing an aquarium from which Melies scoops water which he deposits into an upturned top hat. Melies then proceeds to fish in the hat, placing his catches in the aquarium. Later, he pulls rabbits from the same hat before placing the aquarium centre-stage and closing in on it so that we can see the mermaid living inside it. Although the use of trick photography throughout means a lot of preparation and planning must have gone into the film's making, it has the feel of being thrown together. Melies changes from a well-dressed magician to a rustic looking tramp and back again for no apparent reason and the rabbit trick seems pointless, wandering, as it does, from the aquatic theme of the rest of the film.",
         "Georges Méliès' 'The Mermaid' is a good change from a lot of the straight \"magic act\" films of his that I've been reviewing of late. It starts out like many of his shorts, as a magician (played, as usual, by the director himself) wearing a silk top hat approaches an empty aquarium, examines it for a few moments and then places his hat upside down on a table. Scooping up glassfuls of water from the aquarium, the magician pours the water into his hat and subsequently goes fishing in it. Miraculously, whenever he lowers his hook into the hat a fish bites upon it and is transferred across to the water tank, where it swims around idly. He then inexplicably pulling rabbits from the suddenly-dry silk that (this special effect, in particular, is done surprisingly well). Only later does this Méliès short display some uniqueness. As the magician wheels the tank towards the centre of the stage, we zoom in upon it to see that a beautiful mermaid, hovering above the ground, has taken residence within it. To demonstrate that she is floating above the ground, Méliès shuffles beneath her excitedly. Then, taking his place on a godly throne, the magician is suddenly transformed into Neptune, the Roman god of the Sea. Not particularly special in any real way, 'The Mermaid' is a decent Méliès short, with enough variation from the filmmaker's usual style to be well-worth watching.",
         "Mermaid, The (1904) *** (out of 4) aka La Sirène Once again Melies plays a magician who fills up an aquarium tank only to put some of the water into his top hot where he then goes fishing. The second part of the film deals with the title character who also appears out of no where. This is a pretty good little film that manages to have some nice laughs and some very good trick shots. Some of the special effects are obvious but there are others, like the one on one fishing scenes, that hold up very, very well. The mermaid stuff I didn't care too much for but the visual beauty is certainly there.",
         "This short silent film is part of the DVD collection entitled \"The Magic of Méliès\" and is the fourth volume of THE MOVIES BEGIN series from Kino Video. Unlike copies of Méliès' films that are posted on the internet, the prints for these short films are exceptionally crisp and clean and feature wonderful musical scores. Oddly, though, is that aside from a few films such as THE BLACK IMP and THE IMPOSSIBLE VOYAGE, most of the shorts chosen for this DVD are actually not among the best of Méliès' films--having a strong tendency to show is \"stagy\" material as opposed to the films that have elaborate sets and plots. In particular, my favorites such as BARBE-BLEUE and LE VOYAGE DANS LE LUNE (his most famous film) are not on this DVD. This is a pretty dull film, as much of it is simply a movie of Méliès performing magic tricks. In person this might be interesting, but on film (where it's no trick to use camera tricks to make a magician seem great), it just doesn't impress. Then, when the mermaid enters the picture, she is pretty sloppily integrated compared to the camera tricks in many of the director's other short films. All in all, among the worst and least inspiring films of this film genius and pioneer.",
         "There is indeed a mermaid who is trying to deal with humans who can't seem to get along. There are goldfish and other wet things. We are treated to a lot of running around and going nowhere (or at least not too far). The mermaid has unique qualities. The stop action tricks are haphazard at best and have been done by this man so often.",
         "During the dawn of cinema, no filmmaker was more creative and fantastic than the French magician turned director Georges Méliès, the man behind countless classic fantasies. \"The Mermaid\" is among his many efforts and it enraptures his style more so than most of his other movies can. Méliès, himself, plays the lead role as a magician who shows off some of his finest tricks before finally summoning a mermaid as a sort of climax to his act. The film is comical and light in tone and is likely to leave most viewers with a bright, shining smile across their lips, and many will be able to find that stem in their brain that encourages all of the wonderment and excitement of childhood. The editing here is clearly revolutionary for its time, although it may seem ridiculously flawed and obvious nowadays, back in 1905 it was anything but. Classic camera tricks are constantly being used to their full advantage as Méliès playfully shows off his skills in the crafts of magic and cinema (or, should I say, cinemagic).",
         "I watched this as one of the shorts on The magic of Melies video cassette released by Kino on Video, 1994. Image quality was good. Music matched the mood of the film. No color was added. Cropping did not appear to interfere with the film. Frame speed appeared to be adjusted. This should give an idea of the technical quality of the release I watched. This film was pretty. Some of the special effects in it are extremely good. I could'nt pick out exactly where the editing was done when the clown pulls rabbits from a hat. If it did'nt go so quickly I think that many of the effects would come off as cheesy and played out, given that they have been used in so many films since. As it is the dizzying pace keeps things interesting. I think that an interesting aspect of the film is Melies experience as a magician. He directs eye movement away from the effect much as a magician distracts the eye to perform a trick. I recommend watching this. It has an intriguing feel. I don't know that one should go to a great deal of trouble to find this film, but it's worth a look."
      ],
      "genres": [
         "Short",
         "Fantasy"
      ],
      "productionCompanies": ["Star-Film"],
      "summaries": [
         "In his crisp and impeccable suit, a conjurer of dreams and illusions enters the stage wearing his narrow-brimmed top hat. As he fills his hat with water from an empty aquarium nearby, the magician summons up fish of all sizes to inhabit the tank, and much to our amazement, he works his way up, to finally conjure a gracefully mysterious young mermaid. Is she real or is this one of the illusionist's tricks?",
         "A man in a silk top hat stands in front of an empty aquarium. He pours water into his hat and goes fishing, hooking a small one. He becomes a hobo and catches more and more fish from the hat. Then he starts pulling out rabbits. The backdrop becomes the sea, and a mermaid appears. She flirts and beguiles us. The mermaid becomes a woman who leaves the sea and joins the magician, who becomes Neptune.",
         "A magician conjures up a mermaid while fishing."
      ],
      "budget": 0
   },
   "movielensId": 163286,
   "movielens": {
      "languages": [""],
      "releaseDate": "1904-01-01",
      "dvdReleaseDate": null,
      "directors": ["Georges Méliès"],
      "runtime": 4,
      "movieId": 163286,
      "title": "The Mermaid",
      "mpaa": null,
      "actors": ["Georges Méliès"],
      "imdbMovieId": "0215992",
      "originalTitle": "La sirène",
      "genres": ["Fantasy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A man performs tricks with an aquarium and a mermaid",
      "tmdbMovieId": 44328,
      "avgRating": 3.125,
      "releaseYear": "1904",
      "numRatings": 4,
      "posterPath": "/cenE4ItaT8zP1p4rjkgYFWYKZM8.jpg"
   }
}