{
   "tmdb": {
      "original_language": "ml",
      "keywords": [
         {
            "name": "kung fu",
            "id": 780
         },
         {
            "name": "photographer",
            "id": 1003
         },
         {
            "name": "magazine",
            "id": 4620
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "photography",
            "id": 6025
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "malayalam",
            "id": 193685
         },
         {
            "name": "vow",
            "id": 210107
         },
         {
            "name": "sandel",
            "id": 225661
         }
      ],
      "imdb_id": "tt4851630",
      "video": false,
      "title": "Maheshinte Prathikaaram",
      "recommendations": [
         442000,
         430521,
         422603,
         427012,
         411279,
         388088,
         441182,
         224057,
         381374,
         364776,
         440858,
         402217,
         398786,
         124052,
         450045,
         302638,
         120149,
         428658,
         494480,
         268660
      ],
      "backdrop_path": "/k4VIFJoLmyiW5Sev12W3Bh7jfN7.jpg",
      "revenue": 230000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mahesh",
               "gender": 2,
               "credit_id": "56b8296192514136f2000365",
               "name": "Fahadh Faasil",
               "profile_path": "/wmkwZWFHqMptqdt4HacMIAe8OBP.jpg",
               "id": 1072750,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jimsy Augustine",
               "gender": 1,
               "credit_id": "5739654ec3a3685aa4003998",
               "name": "Aparna Balamurali",
               "profile_path": "/tdpfnEAzxtd8dLSC2NbijrwPHiY.jpg",
               "id": 1620957,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Babychan",
               "gender": 2,
               "credit_id": "56b82989c3a36806ec01062f",
               "name": "Alencier Ley Lopez",
               "profile_path": "/gWammRTzSJiyK9TROHWkoM9AqzS.jpg",
               "id": 1574335,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Chrispin",
               "gender": 2,
               "credit_id": "5739656492514177b00003fc",
               "name": "Soubin Shahir",
               "profile_path": "/fdnEcB1wPWmYM4iHFLHDIxFy1NX.jpg",
               "id": 1470729,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jimson",
               "gender": 2,
               "credit_id": "573965e792514178000003b5",
               "name": "Sujith Sankar",
               "profile_path": "/n7Z4ezEpDvhG3NyeYN9K1ULjVdW.jpg",
               "id": 1620960,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Soumya",
               "gender": 1,
               "credit_id": "56b82975c3a36806f100e2c4",
               "name": "Anusree",
               "profile_path": "/8ceRfb1p1CnmctS7XSg8bExJsAn.jpg",
               "id": 1115745,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Kunjumon",
               "gender": 0,
               "credit_id": "573965bec3a36813e2000d78",
               "name": "Jaffer Idukki",
               "profile_path": "/ufvlOH4JUut9QKym3hG6EgO0y5w.jpg",
               "id": 584777,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Eldho",
               "gender": 2,
               "credit_id": "573965d2c3a3686bfb001e1e",
               "name": "Dileesh Pothan",
               "profile_path": "/hLBY5DCH6lzdWqdgSZPCSevsZEg.jpg",
               "id": 1574334,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Soniya",
               "gender": 0,
               "credit_id": "573965fa92514178000003bc",
               "name": "Lijomol Jose",
               "profile_path": "/99Ci1ZLIwWWLLFQCt3yBiae0KhO.jpg",
               "id": 1620961,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Vincent Bhavana",
               "gender": 0,
               "credit_id": "5739661492514179170035c7",
               "name": "K. L. Antony",
               "profile_path": "/xVMOhLApw9RoPX94mC5Ogm6h583.jpg",
               "id": 1620962,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Saju",
               "gender": 0,
               "credit_id": "573966429251417f18000326",
               "name": "Saiju Agustine",
               "profile_path": null,
               "id": 1620963,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Martial Arts Guy",
               "gender": 0,
               "credit_id": "591ae867925141583c06a48e",
               "name": "Vijilesh",
               "profile_path": "/y96hD1ljwpy7LWP6fp73vbLXQ2i.jpg",
               "id": 1787693,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Baby's Sister",
               "gender": 0,
               "credit_id": "599aac64c3a3683a07013665",
               "name": "Manju Sunichen",
               "profile_path": "/kCyZ1r7mzE9jNKjgLS49FGndJ9A.jpg",
               "id": 1665414,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56b828ef92514136f2000356",
               "name": "Dileesh Pothan",
               "profile_path": "/hLBY5DCH6lzdWqdgSZPCSevsZEg.jpg",
               "id": 1574334,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56b829039251415b4b002300",
               "name": "Aashiq Abu",
               "profile_path": "/3FEuXoEXOkc36nKRePoWLWja6be.jpg",
               "id": 979284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57396715c3a36831620008ef",
               "name": "Shyju Khalid",
               "profile_path": "/AulXdcmPcrhhXSANKxrfAm1TYxD.jpg",
               "id": 1118112,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57396724c3a36831620008f6",
               "name": "Bijibal",
               "profile_path": "/wwbuUFRnir8hiRntQ6IPZkHYSdL.jpg",
               "id": 979287,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 0,
               "credit_id": "5739673ac3a3681919000aba",
               "name": "Saiju Sreedharan",
               "profile_path": null,
               "id": 1620964,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5739677592514123410014f8",
               "name": "Ajayan Chalissery",
               "profile_path": null,
               "id": 1620966,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "573967d492514136560011de",
               "name": "Sameera Saneesh",
               "profile_path": "/kDqo5q5wETTJ9ZkFrp4ctMimCU3.jpg",
               "id": 1464562,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "573968509251417800000421",
               "name": "Ronex Xavier",
               "profile_path": null,
               "id": 1620968,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 2,
               "credit_id": "5a697177c3a3685a7600ba94",
               "name": "Shyam Pushkaran",
               "profile_path": "/8OCR2emeKZ51Sj9iJrV1GWyXtnD.jpg",
               "id": 1101392,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.414222,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 381691,
      "vote_count": 12,
      "budget": 0,
      "overview": "Mahesh, a studio photographer and owner of the studio. As the story moves on, Mahesh encounters an anonymous fight ending up with taking revenge that leads to certain realizations in his life.",
      "similar": [
         140300,
         24,
         8456,
         101,
         9502,
         2288,
         4638,
         55292,
         241554,
         458741,
         281957,
         806,
         1939,
         116745,
         445954,
         226,
         9654,
         605,
         1369,
         604
      ],
      "original_title": "മഹേഷിന്‍റെ പ്രതികാരം",
      "runtime": 121,
      "poster_path": "/hmK9QUWpOaSs1H7tarzlMNqT60H.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "ml"
      }],
      "production_companies": [{
         "logo_path": "/tSypmEIBOZyiuYZG0qF99eyFtdB.png",
         "name": "OPM Dream Mill Cinemas and Entertainments PVT LTD",
         "id": 77133,
         "origin_country": "IN"
      }],
      "release_date": "2016-02-05",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "https://www.facebook.com/MaheshintePrathikaaramMovie/",
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dileesh Pothan"],
      "runtime": 120,
      "synopsis": null,
      "writers": ["Syam Pushkaran"],
      "originalLanguage": "Malayalam",
      "imdbLink": "http://www.imdb.com/title/tt4851630/",
      "coverLink": null,
      "actors": [
         "Fahadh Faasil",
         "Aparna Balamurali",
         "Soubin Shahir"
      ],
      "reviews": [
         "\"Maheshinte Prathikaaram\", what else could fit for a revenge drama other than this title? Maheshinte Prathikaaram is a portrait of Mahesh and everything related to Mahesh. A place playing a prominent role in a movie is something rare. And only few directors tried to do so, like Rajiv Ravi did in \"Annayum Rasoolum\" and \" Njan Steve Lopez\". Here, director Dhileesh Pothan also presented \"Idukki\" as a main Character. The primary aim of Maheshinte Prathikaaram is to make people laugh. Comedy is the main ingredient here. But, sometimes it is romantic. Sometimes very thrilling. The makers didn't used anything artificial to make us laugh, all the comedies were very realistic and situational. I felt a freshness in the presentation of this film. All the technical departments raced in the same pace. Shyju Khalid's photography, Bijibal's music and Saiju Sreedharan's editing, all these acted with mutual understanding and mutual respect. 100 marks for these departments. I have no more words to praise the performance of the cast. Fahadh Faasil played the lead character Mahesh with such an ease. No doubt he's the best actor among the youngsters in the industry. He's an actor with tremendous potential. The Soubin - Alancier combo just made the theater hall crazy. Anusree also did a great job. All the actors in this film just rocked. Maheshinte Prathikaaram is the best Malayalam movie released this year so far.",
         "This is the first Malayalam film after Drishyam (2013) where some of the audience got up and applauded during the end credits. And the another great thing about this sweet little dramedy is that an evening show in the cinema theater (INOX) was houseful, which is a rare occurrence in Mumbai. Mahesh (Faasil) is a small-time photographer who lives with his aging father in a town located in the hilly district of Idukki in Kerala. In love with a girl (Anusree) whom he wishes to marry and settle down with, things are going generally good for Mahesh until when he fatefully gets involved in an unrelated street fight, ultimately gifting him a black eye and several bruises along with ounces of shame for having been beaten up by a nobody in front of his own people in the middle of the town where his studio sits. What follows is an unabashed intention of seeking vengeance, but has Mahesh got the balls? The most interesting element about the film is inarguably the butterfly effect which causes the street fight. And watching it unfold is the most delightful thing you will see in a Malayalam film all year. How Mahesh gathers courage to find the guy who beat him up and to retaliate just to show that he's a man with dignity. Aggressive as it may sound, the screenplay is nothing but comic. The humor timing is perfect, and with the characters delivering one crispy dialogue after another, you will surely roll down the aisle laughing. The first act is full of genuine and creative comedy, while the second act takes a virulent turn but still keeping us hooked. By virulent, do not visualize gore or violence, but Mahesh's audacity to challenge his nemesis as he prepares to fight him and settle scores. The film even teaches you two or more things about love and photography (or any profession for that matter), educating you that if you move forward with your heart and wait for the right time, things WILL happen in your favor. What a person goes through when life turns upside down and when reality hits that one is nothing but a loser in life is the central theme of the film. How Mahesh bounces back is a pleasure to watch. Faasil is fantastic as he plays the typecast role with great finesse. Happy to see Anusree climbing up the ladder, and lesser-known Aparna Balamurali doing a good job. However, it is not because of the performance of one or two cast members that the film ejects pleasure bulbs, but because of how well the supporting cast have been directed. Soubin Shahir is amazing, no doubt. The use of silence between and during the sequences is another highlight of the film as the story maneuvers between comedy, drama, romance, and thrills. Nicely composed songs and fine camera work drives the 2-hour long film into a palpable work of art. Special mention for the titles and a sorta ambiguous ending, providing the audience a sugary taste in the mouth to relish the whole subject later. BOTTOM LINE: Débutante Dileesh Pothan's Maheshinte Prathikaaram is a highly entertaining comedy drama that will make you rave about it to your friends just because you can go watch it again with them. Worth the ticket price. Can be watched with a typical Indian family? YES",
         "A veritable breath of fresh air, this has to be one of the more hilarious movies I've seen in a long time, especially one that does not think you have to make things dumb in order to make your audience laugh. Thematically speaking, this has more to do with something of a butterfly effect, where the director actually shows something like that in motion for the audience to get used to how he plans to use it to propel the movie forward, and then goes and does it. Kind of dumbing-down a concept, but that's not the sound of me complaining, especially since the 1st instance of that is a veritable laugh-riot (many bouts of unexpected humor help too - especially the one with the flash mob, and the background conversations....hilarious!). While the 1st instance of said effect is on play, the makers also take the time to gradually setup the lives and real-time situation of the main characters, almost placing us within their lives, allowing us to begin caring for their fates. There is remarkable consistency, and looping back into previous instances, in a deceptively not all that engrossing fashion, but end up taking almost center-stage later in the movie. Kinda forces us to keep everything that's unfolding in perspective. Fahaadh Faasil, of 'Iyobinte pusthakam', 'Annayum Rasoolum', 'Bangalore days', '22, female, Kottayam' and many more, does a bang- up job, as always, with his natural responses to occurring stimuli, ably supported by everyone around him, especially Soubin Shahir ('Premam'), Aparna Balamurli (kudos to doing away with makeup), Aparna and Lijo Mol Jose (as also the actors who play his friend/business+home-neighbor) and father, respectively. The makers have taken care in fleshing out almost every character that surrounds our leads, and the actors are definitely lucky to get that on their drawing boards, getting actually mea that they can build upon. The cinematography deserves special mention, and I'm always fond of actual location work dictating the product and set designs, that Malayalam movies (other than the likes of something like '2 countries', which, for all its strengths, does not do well in this department) do so well. Both the background score and the songs are relevant and appropriate (courtesy Bijibal, somewhat of a legend like Rajesh Murugesan or Shaan Rehman), and this is an album worth listening to, on repeat mode. The fight choreography goes for something more realistic (albeit simple) that something mainstream Indian audiences are used to viewing, and though it is not in the league of 'Iyobinte Pusthakam', it definitely passes muster, and almost gets the tone that (I suspect) 'Action hero Biju' aspired to (but ultimately did not get, succumbing to finally using wire-fu). Not to be missed, and perhaps worth multiple viewings, at a large screen cinema close by...",
         "It is a 'Super' film with the amazing acting from Fahad Fasil, Aparna, Soubhin, Alancier, Jaffer Idukki and Antony Kochi. It is also a 'Natural' film with the amazing nature of 'Idukki'. *After watching this film, I decided to go to meet my relatives in Idukki when I get to Kerala. Especially, the slang and language in Idukki is beautifully used in this film. And the song 'Idukki' with lines, Ividuthe Kaattanu kaattu.... is very nostalgic. No words to express my feelings about this film. I'll surely suggest this film to anyone who love Malayalam Cinema. Simply, \"Beautiful\".",
         "The movie revolves around a simple story which is portrayed amazingly by fahad fazil. He has done an amazing job of his role and the comedy contained in this film is different from the usually seen type of jokes. The movie does an excellent job of telling a simple story in an interesting way which does not get the viewer bored. It is my belief that it is difficult for a director to keep the audience interested without any twists or turns which this film lacks. Still the film provides a visual treat which in itself is amazing. Cudos to the team behind the film. I also loved the perfectly normal way in which mahesh was portrayed. Mahesh is throughout put to shame from his love affair to street fights which is not usually seen in the usual films. It tells a tale which us therefore similar to the consequences faced by a normal human being. This film feels like it is a story happening next door which is what i think the director tried to do in the first place.",
         "Maheshinte Prathikaaram.. A different sort of a film when you compare it to the movies Fahad Faasil has done. The studio photographer Mahesh is a simple person without any high ambitions in life. His dad.. The most silent person you would see in that film.. But conveying his message through his silence beautifully. Mahesh likes a girl called Sowmya who is his childhood friend and the same applies to her. Unexpected turn of events leads to Mahesh engaging in a fight with a thug called Jimson who ends up beating Mahesh in front of the crowd. Mahesh gets all embarrassed in front of everyone. The following events that occur in Mahesh's life have been put together really well and is presented to you by Dileesh Pothan in a very good manner. Soubin's timely appearance along with the evergreen music of Bijibal make the film an absolute treat to watch. Special credits to Fahad Faasil for bringing out Mahesh so well. Overall rating:9/10",
         "I went with my family to the theater on the 75th day of Maheshinte Prathikaram. Though I went with high expectations I was welcomed with a huge crowd in the hall (The day was also the release of Batman V Superman) I clearly doubted that it must be the viewers of BvS but surprisingly most of the youngsters and families were in the line for Maheshinte Prathikaram. I went on to watch the film with this in mind. First Half : The film starts with the 8 size lunar's chappal, introduced as symbolic of his coming revenge. the first half was mostly interesting. It revolved around Mahesh, his friends, family, love and Idukki. The Song 'idukki' gave the spectators a glimpse of the life and beauty of Idukki. The director had done well to indulge deep into the characters, but failed to cast a thrilling sensation between the fight. The audience became silent when the fight began, but I found one or two still laughing at the previous frame's joke. The first half ended with hilarious jokes and Mahesh's vow for revenge. Second Half : I saw in the first half one of the most well scripted story and I would definitely say that this film breached my expectations far beyond(better than Premam I would say). The second half did not lose its momentum but slightly lost its balance during the middle of the second half. The film mainly concentrated on comedy. But the first half love failure was also cast as a comedic genre.The second half, as I said was a bit laggy. I felt that most of my near spectators were becoming sleepy.But the film carried on, Fahadh's and Soubin's performance's being the most enjoyed. Babykuttan portrayed by Alancier Lay was the most laughed at character. The female lead roles's performance, was not up to the mark, I would say. The second half sparks in to life (nearing the end) when Mahesh (after learning Kung Fu and investigating about his avenger) returns to take his revenge. The Fight choreography and cinematography was superb, full marks for them. Breaking out of traditional fights, this film concentrated on realism and hand-held visuals.The fight was about 7 to 8 Min's, but that was worth it, Mahesh surely and splendidly avenged him. The film's climax and ending was a bit surprising for everyone. But I expected it to end any time, considering that it is a drama genre. I am not spoiling everything for you, left some twists and turns for you, the romantic scenes and of course his father. Verdict : One Of The Most Dramatic Films Released In Malayalam Ever. 8 / 10",
         "most the people who saw the movie says that the story is about revenge. And why should anyone think otherwise ; Even the titles literal translation is \"Mahesh's revenge\". But the film is not mere a revenge story , but is more about redemption. At the end of the first half we see that the protagonist is deceived by his long time love and his honor being lost because of the thrashing which he receive from the antagonist. the story is mostly about how the finds back love - love for a girl , love for his profession . His beating back of Jimson is followed by mahesh's visit to hospital .there the jimson says \" i would have beaten you, if i hadn't ...\".the silence by mahesh to this taunt ,shows that he is in peace with the Jimson situation.. he then proclaims his love at the last scene in the film . Here he doesn't care whether Jimson grants permission or not.(the actor doing the role of jimson wast brilliantly cast ) Like thoovanathumbikkal where rain itself metaphor for the unrequited love, the locality/nature is the metaphor for inner peace and redemption. he turns to nature for inspiration for photography and begins to see the world as his father sees it... it is a simple film with about the tales we hear in a village tea shop but has been narrated brilliantly",
         "Dear Dileesh Pothan, I enjoyed Maheshinte Prathikaram. Everyone else in the movie theater also seemed to enjoy it. They clapped when the film ended. I liked the film's plot. A lovable and devote loser called Mahesh lives with his senile father. He goes through a bad patch in his life when he is beaten up in public, ditched by his girlfriend and criticized for being bad at his job (as a photographer). Mahesh seeks a revival in his life. He refuses to wear sandals until he takes revenge on the person who beat him up in public. It reminded me of Warren Oates vow of silence after his chicken is killed in a cockfight in Monte Hellman's Cockfighter. The film works as a character study with the upwardly mobile Christian community of Idukki as a background. Fahadh Fazil as Mahesh turns in a very respectable performance as usual. I hope he finally scores a hit with this one. Soubin Shahir had some of the best dialogs in the film. He really stole the show as Fahad's sidekick. Aparna Balamurali as the feisty and flirtatious young Christian girl is the perfect foil for the sober and humble Mahesh. Alancier Lay and Jaffer Idukki were decent without being spectacular. The actor who played Jimson had great body language, he brought back memories of Salim Ghose the villain in Bharathan's Thazhvaram. Dileesh, I would not have made the film the way you did. You did have some good ideas. But Mahesh's desperate attempts at regaining his confidence and masculinity could have been more interesting. But you seemed to be intent on making a feel good film without lingering for too long in the dark side. Why does every new Malaylam film have to eventually turn into a feel good film? Anyway I am glad that people like yourself are making films about some of the interesting people living in Kerala's villages and small towns. While the films made by some of you new generation filmmakers are not masterpieces, they are a lot better than the superhero films of Mammooty/Lalettan/Sureshgopi or the mediocre slapstick films of Jayram and Dileep. I also noticed that you and writer Sham Pushkaran adhered to the the \"New-gen directors manifesto\" containing the golden rules for New-gen filmmakers: 1) Your film must contain one or more references to Lalettan or Mammukka or some film of theirs. 2) Your film must contain a few scenes where the characters consume alcohol. 3) Your film must have a few scenes related to food - usually meen/fish curry or some obscure \"appam\" eaten by the people of that area and not known to people living in other parts of Kerala. 4) Your film must portray extreme religiosity (like carrying a wooden cross to the top of Malayatoor Mala) as exotica. 5) The hero must live in an extremely run down and dirty house with a dirty kitchen. You may use lighting or clever cinematography to take attention away the basic squalor of the house/kitchen. This would help in strengthening your ghetto credentials. I look forward to your next film. Best Regards, Pimpin. (7/10)",
         "Maheshinte Prathikaaram (2016) : Malayalam Movies are mostly known for their simplicity and natural feel.They have lot of exotic locations which is the major attraction for even the dumbest films to brilliant masterpieces.Maheshinte Prathikaaram (Revenge of Mahesh) is a comedy drama starring Fahadh Faasil which got rave reviews and considered as one of the best Malayalam films of 2016.So how is it? Plot: Mahesh Bhavana from Idukki runs a photo studio and leads a happy contented life living along with his aging father, his darling pet dog, his friends & his lady love with whom he maintains a long distance relationship. One fine day, his rosy life is turned upside down when he fatefully gets involved in an unrelated street fight, where he is severely beaten up in front of his own people of village. He swears that he will wear his slippers only when his revenge is fulfilled.So how did he fulfilled his revenge forms rest of the story? Plus Points: 1)Performances: Fahadh Faasil is brilliant in his role as Mahesh. We don't see him as an actor or a star, but the character living a life and going through real life experiences.His dedication and commitment as an actor is there to be seen in every scene.Alencier Ley Lopez is hilarious and gave awesome performance.Anusree and Aparna Balamurali, who play the leading ladies have got solidity of writing in their characters which give their characters complexity and depth that is rarely found these days. They illuminate the film with their performances. 2)Second half: Second half of the film is very good and engaging.The love story between Mahesh and Jimsy is different and shot brilliantly with good humor.Climax is very good and shapes a perfect end. 3)Interval: The scene where Mahesh gets beaten up followed with Interval twist is so engaging.It is the only highlight of first half, 4)Cinematography: You will definitely fall in love with Idukki place after watching this movie.It is so beautiful and a treat for nature lovers.Idukki Dam is one place one should definitely visit.Its scenery is breathtaking. 5)Duration: Movie is just 2hr long.A perfect duration. Minus Points: 1)First half: First half is mostly filled with unnecessary scenes except love story of Mahesh and Interval.Except few moments most of the first half is uninteresting and filled with messed up scenes. So,Maheshinte Prathikaaram is a decent entertainer with brilliant performances,exotic locations,nice second half and striking Interval bang.Sloppy First half is a major drawback. My rating 6.5/10",
         "My review may seem hyperbolic, but trust me, it is not. In my book, Maheshinte Prathikaram, is one of the greatest Malayalam movies ever made. The characters live and breathe. The realism in even the smallest of things, like Mahesh cleaning his slippers in the beginning or his daily routine or every single relationships in the movie, is mind- boggling. The attention to detail is scary. Dialogues are original, yet close to life. The screenplay is the centerpiece, it simply is marvelous, a kudos to the writer. The directing was spotless. Cinematography was flawless. The casting was picture perfect, and Fahad once again proves, he is one young actor to reckon with. The movie never tries hard enough to do anything, it just simply and brilliantly does what it means to do."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": [
         "Mahesh Bhavana from Idukki runs a photo studio and leads a happy contented life living along with his aging father, his darling pet dog, his friends & his lady love with whom he maintains a long distance relationship. One fine day, his rosy life is turned upside down with what could only be called a manifestation of the often quoted butterfly effect!",
         "Mahesh, a studio photographer and studio owner gets into a fight and loses. He ends up taking revenge which leads to certain realizations in his life."
      ],
      "budget": 0
   },
   "movielensId": 163422,
   "movielens": {
      "languages": [""],
      "releaseDate": "2016-02-05",
      "dvdReleaseDate": null,
      "directors": ["Dileesh Pothan"],
      "runtime": 121,
      "movieId": 163422,
      "title": "Maheshinte Prathikaaram",
      "mpaa": "PG",
      "actors": [
         "Fahadh Faasil",
         "Aparna Balamurali",
         "Alencier Ley Lopez",
         "Soubin Shahir",
         "Sujith Sankar",
         "Anusree",
         "Jaffer Idukki",
         "Dileesh Pothan",
         "Lijomol Jose",
         "K. L. Antony",
         "Saiju Agustine",
         "Vijilesh",
         "Manju Sunichen"
      ],
      "imdbMovieId": "4851630",
      "originalTitle": "മഹേഷിന്‍റെ പ്രതികാരം",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["_KY8Du4WWew"],
      "plotSummary": "Mahesh, a studio photographer and owner of the studio. As the story moves on, Mahesh encounters an anonymous fight ending up with taking revenge that leads to certain realizations in his life.",
      "tmdbMovieId": 381691,
      "avgRating": 3.83333,
      "releaseYear": "2016",
      "numRatings": 6,
      "posterPath": "/hmK9QUWpOaSs1H7tarzlMNqT60H.jpg"
   }
}