{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt5312612",
      "video": false,
      "title": "The Amityville Terror",
      "recommendations": [
         260602,
         41848,
         390991,
         89609,
         335753,
         27549,
         418808,
         55300,
         55377,
         350616,
         454546,
         46695,
         259246,
         396152
      ],
      "backdrop_path": "/dqz8cWCHICic5tf0CwT5o6HSFcJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Hailey",
               "gender": 0,
               "credit_id": "581ee4259251412562000b03",
               "name": "Nicole Thompson",
               "profile_path": null,
               "id": 1528495,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Todd",
               "gender": 2,
               "credit_id": "581ee450c3a36860c9000ac7",
               "name": "Kaiwi Lyman",
               "profile_path": "/5H63NaGfhYGRDrQkanUI3k9x9HQ.jpg",
               "id": 968742,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Jessica",
               "gender": 0,
               "credit_id": "581ee4709251412846000af1",
               "name": "Kim Neilsen",
               "profile_path": null,
               "id": 1704842,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Shae",
               "gender": 1,
               "credit_id": "581ee494c3a3685afd000c50",
               "name": "Amanda Barton",
               "profile_path": "/cgerhzQQzX59vbRNYZrrlKXgarO.jpg",
               "id": 30064,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Brett",
               "gender": 2,
               "credit_id": "581ee4b09251412846000b22",
               "name": "Trevor Stines",
               "profile_path": null,
               "id": 1670804,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Theresa",
               "gender": 0,
               "credit_id": "581ee4d69251412325000c70",
               "name": "Christy St. John",
               "profile_path": null,
               "id": 1704843,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57a8ee8ac3a3682617009253",
               "name": "Michael Angelo",
               "profile_path": null,
               "id": 1615503,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "57a8ee9c925141777c009a84",
               "name": "Amanda Barton",
               "profile_path": "/cgerhzQQzX59vbRNYZrrlKXgarO.jpg",
               "id": 30064,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "581ee33ec3a36860b90009e9",
               "name": "Michael S. Ojeda",
               "profile_path": null,
               "id": 372442,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "581ee36f925141279a0009d2",
               "name": "Larae Mychel",
               "profile_path": null,
               "id": 1704840,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "581ee390c3a3685afd000bab",
               "name": "Darren Morze",
               "profile_path": null,
               "id": 1018757,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "581ee3d5c3a36860b1000aa7",
               "name": "Philip Day",
               "profile_path": null,
               "id": 1061756,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "585e5fcac3a3681a7200d44e",
               "name": "LaRae Wilson",
               "profile_path": null,
               "id": 1727203,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "585e5f4f92514115c400cb60",
               "name": "Justin Jones",
               "profile_path": null,
               "id": 109943,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "585e5f67c3a3681a6f00c12e",
               "name": "Zeus Zamani",
               "profile_path": null,
               "id": 1522313,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "585e5f8c92514115c400cba5",
               "name": "Brynna Yentz",
               "profile_path": null,
               "id": 1727202,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "585e5fa6c3a3681a6b00c27c",
               "name": "Michael S. Ojeda",
               "profile_path": null,
               "id": 372442,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "585e5fe3c3a3681a6200ca6d",
               "name": "Scott Anthony Gould",
               "profile_path": null,
               "id": 105278,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "585e5ff992514115c700c649",
               "name": "Scott Anthony Gould",
               "profile_path": null,
               "id": 105278,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "585e6017c3a3681a6800d6cb",
               "name": "Jay Dallen",
               "profile_path": null,
               "id": 1502934,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "585e602e92514115cd00c128",
               "name": "Arun Kapoor",
               "profile_path": null,
               "id": 1727204,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "585e604092514115cd00c140",
               "name": "Juan Frausto",
               "profile_path": null,
               "id": 1004777,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "585e60c092514115d300c079",
               "name": "Jorge Hernandez",
               "profile_path": null,
               "id": 1727205,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "585e60d892514115be00c015",
               "name": "Kara Siebein",
               "profile_path": null,
               "id": 1727206,
               "department": "Lighting",
               "job": "Best Boy Electric"
            },
            {
               "gender": 0,
               "credit_id": "585e60efc3a3681a6b00c37a",
               "name": "Felipa Cabitac",
               "profile_path": null,
               "id": 1727207,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "585e610092514115be00c032",
               "name": "Frederique Barrera",
               "profile_path": null,
               "id": 1704837,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.613157,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 410537,
      "vote_count": 16,
      "budget": 500000,
      "overview": "When a new family moves to an old house in Amityville, they are tormented and tortured by an evil spirit living in the home while trapped by the malicious townspeople who want to keep them there.",
      "similar": [],
      "original_title": "The Amityville Terror",
      "runtime": 84,
      "poster_path": "/2Wqb3NGJ5scvLiUsvSD7XWwFNid.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Thriller Films",
            "id": 82773,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "AZ Film Studios",
            "id": 82774,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Marquis Productions",
            "id": 21678,
            "origin_country": ""
         }
      ],
      "release_date": "2016-04-01",
      "vote_average": 4.4,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Angelo"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Amanda Barton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5312612/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgzNTZmYjktY2YyOC00NmY4LTllZWEtMGIyZjFlYTNmOWU3XkEyXkFqcGdeQXVyMzI5MjU0Mw@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Nicole Tompkins",
         "Kaiwi Lyman",
         "Kim Nielsen"
      ],
      "reviews": [
         "First, despite the title this film has nothing to do with anything remotely Amityville. The effects were so poor. Come on folks, CG software is cheap and there are plenty of out of work effects people that could have done better with freeware. Of course there is always the story line. Except in this movie. Did these people make this up on the fly? So with no effects, no story line and no script how could you expect anything more? THere is always a place for mindless sex and violence on the screen, but here you won't find mindless, just useless. I must admit I am something of an Amityville Horror snob. I owned my first home in Nassau SHores only 1 mile from the actual Amityville Horror house. Yup, there really is a house that the first movie was based on. It was on a side street and the traffic got so bad the town of Amityville had to post no parking signs for a couple of blocks and post cops to keep the traffic moving. Well, the house in this movie was probably owed by the producer and he got a write off to use it for the film. I think that's the best thing that could have ever come form this piece of trash. To sum it all up.... don't waste your time on this treasure.",
         "I checked spoiler, just to be on the safe side, but not sure if this will contain one or not, but I have to definitely agree with John Zappulla's review!!! OMG!! WTH???? This movie had nothing at all to do with Amitty!!! At least all the other ones they made had the original story line SOMEWHERE in the movie, be it someone mentioning the houses history, etc...but this movie has a new story line, no mention at all about the original, they even had the gull to make a new original and wow.....very very disappointing, not to mention, changing the entire original, making it up, that was bad on its own, but the actors/actresses were ........well, they seemed like they were making up lines or reading them from far away!!! It was awful, it was an insult to the original and all the sequels. Do yourself a favor and skip this movie all together, please!!!!! It wasn't even scary....me being the optimist I am, I tried to finish it thru all the way to the end, but....wow!! I am a huge movie buff and love my horror movies, but even kids would laugh at this one!!! LOL...If u do watch this, just for giggles....because that's what you will get, make sure to remember, you have been warned!! LOL",
         "I am a big fan of the previous Amityville movies, and I suppose this lame (straight to) DVD (?) production was targeting fans like me. This movie has some of the worst sfx I have ever seen. It is the kind of sfx quality a 16 year old produces on a PC for a you tube videos. Scenario ? Basic stuff, written by someone who obviously has no idea how teens talk nowadays, and had no intention of actually trying to write something even remotely interesting. I have seen many movies trying to cash in on popular franchises over the years, and this is one such movie. Do not even try watching it on DVD ...huge waste of time and money!",
         "The Amityville Terror finally ends a long lasting series that spawned seventeen sequels beating out any other franchise, though paranormal activity is well in its way, to be limped along without a coherent story line or interesting material. Once again all ties to the series are cut where the famous legend of the house can be forgotten without an explication and a new family moves unaware of its history. Where New York has palm trees, residents all are in a conspiracy together like a small village and the house burns down instead of being destroyed by demons. It feels like another remake to the first with a dysfunctional family, an unorthodox triangle with the husband, possession (wouldn't be Amityville without it) and the Defaoe murders being discovered again. It even rushes up the story lines rather it made since or not and the family becomes stronger for it. Lol, I kid you not. The effects for the most part were awful from strings visible when Windows open, the creepy noises sound like constipation and the fire burning the living room seems like a red bulb lit up. While the actors try to make the most out of the script none truly reach heights not seen before or beat any of the previous poorly written entries caste members. When in doubt it could get worse the music was none existent or flat making you hang your head in shame for renting it. No more Amityville sequels to ruin an amazing series I thoughtfully enjoyed for the most part. The bad is starting to outweigh the good ones.",
         "A new family moves into the infamous house which doesn't look anything like the original house ( I guess it did burn down a few times). It doesn't take long for the mayhem to start and we get to see the crappy CGI. Compared to the last couple of Amityville outings like Amityville Playhouse (2015) and Amityville Death House (2015) this one is a masterpiece which isn't saying much. There is a couple different spins in the story and way more nudity and violence than the Amityville house is used to. I thinks its best to stay away from Amityville films for a bit. I say that but as soon as something like Amityville Zombies comes out I'll probably watch it.",
         "man,this thing was awful.brutally awful.bad acting.bad writing.bad everything.it was not realistic.the characters were not believable in the slightest.this film uses the tag line \"based on true events\".that is such a cliché nowadays and means absolutely nothing.it is simply a marketing ploy to lure consumers in.there's really not a lot of positive things I can say for this piece of work.i just found the whole thing ridiculous and tedious.of course that's subjective.others may find this to be good movie.i did see a positive review on this site.the current rating of this movie on this site is 3.3/10.but for me,Amityville Terror is a 2/10",
         "Not to be confused with Amityville: The Awakening (which is still due for release) Terror, is everything I hate about bad horror movies. It tries to piggy-back on a concept and story that has been done so much better before. Add to that terrible special effects (CG that you can do with Windows at home) and nothing acting by people you can't wait to see die (yet they take forever to do so). Plus, this movie takes 45 MINUTES BEFORE ANYTHING EVEN HAPPENS! The really sad part is, I was gonna give this film props for the concept (an entire town aware that the house is haunted and evil, yet they allow people to move in, so that they can benefit) and then I remembered, THEY TOTALLY RIPPED THAT S%@T OFF from a much, much, much better movie called We Are Still Here. Do not waste your time with this. Go watch any other Amityville movie and I promise you, even the crap ones are more entertaining that this.",
         "The only good thing I can say about this Amityville movie is the actress playing the mom is very hot. Everything else sucks. Story stinks, acting is terrible, direction is juvenile. Women in their late 20s and early 30s playing high school kids?? An entire town that is evil? Nothing about this movie bears any resemblance to the original story although supposedly this takes place in Amityville. Boring, boring, boring. How did this movie get made?? How can the cast consider themselves actors and actresses? Like I said the mom is very good looking but other than that I had zero interest in this. Seems entertainment industry makes films to feed their own egos because nothing about this is worth watching. Like much of today's films this one just plain stinks and insults the audience's intelligence.",
         "Why? That is the question. Why? I am a huge follower of anything relating to the Amityville Haunting case, especially 112 Ocean Ave. This movie has NO RELEVANCE whatsoever to this topic. It seems that they added the name Amityville into the title to encourage people to watch. I wouldn't bother! I bet the Defeo and Lutz families are turning over in the grave at this awful movie. Poor acting Poor story lines Poor everything. If you are looking for a scary, jumpy haunting movie, them I am afraid this is not what you'll be looking for. I was very excited when I sat in the movie theatre seat, coffee and popcorn all ready. The curtains opened, the lights went down, and the hairs on my neck stood tall. Fast forward half hour, and people around me were not taking any notice, nodding off to sleep, some even yawning.",
         "I went into this with hopes of it being decent. As I've always been a fan of the Amityville films since I was a young kid. However, this left me cringing. Painful cringes. I thought my bones would snap from how hard I was cringing. The acting is terrible. Actually, terrible isn't even the right word for how bad the acting is but it's the best one for now. The characters are unlikable. The pace of the film is excruciatingly slow. It's just all around, BAD. If you are a fan of horror then my best advice is to Stay Away From This Film. Stay FAR Away! Rob Zombie makes better horror than this. And THAT'S saying something.",
         "Worst movie decision ever. My roommate and I were expecting more scarier scenes like the conjuring or sinister type of horror/pop-out/ makes you jump, sadly that didn't happen at all in the movie. Our interest for this movie went from a 100 to 0 real quick. The movie effects weren't the best. Some of the scenes made no sense at all, so yeah. Also this is definitely not a kid/family/teenage(16 and under) movie, some nudity will appear. So please don't watch as a family. Overall, I wouldn't So don't waste your time or money on this movie.",
         "I read some of the reviews going into the movie. But I still decided to watch. Everyone has different tastes after all....... Except for this little gem. I don't think anyone could sit thru this movie (if they managed to make it to the end) and say WOW that was great. Heck they wouldn't even say it wasn't that bad. There are absolutely NO redeeming qualities in this movie. The acting. The special effects. The plot. The script. All were so bad that all you wish is to go back in time to the video store and when you are about to pick this movie the wall of DVDs crash down knocking you out for a few hours. Seriously you would enjoy that more. If you are, like me, thinking surely these people jest. Go ahead. Watch it. Then come back here and write how you wish you would have listened.",
         "In all of the worst new horror movies a funny thing is happening, zero likable characters. When my friends and family and I everyone wants a horror movie we all have our favorite style one wants monster another slasher, someone else wants vampire and so on so it my take a while to pick and when we see a movie is shaping up to be crap we salvage movie night whit a sort of bad movie version of clue. The great thing about modern crap horror you hate almost all characters so It makes it very to root for how, when, and by who the characters are done away with. As you see I said nothing about this god awful piece of crap, I set out to savage this garbage movie but all that work had been done by others.",
         "Probably the worst installment of the franchise and that is saying something. This film should never have been made. \"The Amityville Terror\" is an even bigger dud than \"The Amityville Curse\" (1990). The original three films (1979, 1982, 1983) weren't great works of cinematic history but they were professionally acted, well directed and had good production values. This installment had NONE of those things. Hollywood et al just need to stop with creating additions to this franchise. Its played completely out.",
         "Amityville Terror seems hell bent from the start to check of every box on the cliché' horror movie list. That being said, it did manage to check them off in good fashion. For the most part well acted, but again, they were well acted cliché' characters. The story, while checking its boxes, does a good job of ramping up the tension as the story progresses. As the answers and the truth of what is happening unfolds it does manage to depart from its predictable ways, a bit, and there is a rather nice payoff in the end. I find it interesting, personally, that I did enjoy Amityville Terror quite a bit more than the general genre' shlock one typically finds in today's horror fare. It reminds us that cliché became cliché for a reason and, walked correctly, a pre trodden road can still deliver one to a desired destination. Really a 6.5 from me but a gave it a seven because I am a round up kind of guy.",
         "My quick rating - 4,5/10. Just a standard demon in the house movie. It deeps into every cliché possible for this. Not saying it is done poorly, it is just there. The stereotypical characters of a small town are all present, usual romance, and people who don't leave a house that is clearly out to kill them. Expect everything you have seen before so if you enjoy these types of movies, it is just fine. One thing that really bothered me, the massively cheap, amateur burn effects. I swear for an extra hundred bucks they could've bought the upgraded plugin to make it look a bit more real then the free version they used. This distraction aside and you have a mediocre flick that won't bother you or make you want to see more. Bring on Amityville The Awakening.",
         "I've been binge watching the Amityville films and they've ranged from below average to absolutely dire (More of the latter) I expected them to continue this trend until the end and then Amityville Terror came along. With a name like that and a generic cover like it has I expected the worst but within moments I realised this was different. For a start it has a budget, it looks great and has been well cast. Next it actually has a decent enough plot, far exceeding anything I've seen before in an Amityville film. I didn't think that any Amityville movie would come out better than the original (And remake) but I can confidently say that this is the best of the bunch by far. Don't get me wrong it's not perfect, but it's a well delivered effort and I personally enjoyed it. The Good: Decent opening Competent cast Good soundtrack The Bad: Fumbles a bit in places Things I Learnt From This Movie: Clearly filmmakers think people don't know what the Amityville house looks like There may be hope for the Amityville name after all",
         "The Jacobson family, the only ones in America who don't know the Amityville story, move into \"the house.\" The house needs to be occupied and to kill people. Many of the townsfolk want them to stay there. The film centers around Haley (Nicole Tompkins) the daughter, who does the investigation work while dealing with the \"Mean Girls\" at high school, and oh yea, a boy. Compared to the rash of independent low budget films with Amityville in its title, this one was a breath of fresh air, although not the most intense entertaining \"B\" horror out there. Crystal magic (or is it with a \"k\"?) seems to work against it. Guide: 1 F-word. Sex. Nudity (Amanda Barton, Tonya Kay) Filmed in the section of LA that looks like Long Island. 8 stars on the Amityville scale.",
         "The Amityville Terror (2016) ** (out of 4) When her family moves into a new home in Amityville, teenager Hailey (Nichole Tompkins) begins to think that there's something not quite right. And guess what? She's correct. THE AMITYVILLE HORROR became a smash hit throughout the world and ever since then there have been countless rip-offs and cheap films that used the \"Amityville\" title to try and sell a picture. Quite often they have nothing to do with the original movies, which is the point here. If you're looking for some sort of continuation to the story then it's best to look elsewhere. I've seen a handful of these Amityville knock-offs and for the most part I found this one to at least be entertaining. Again, if you're looking for some scary horror movie or some ground-breaking work then you're not going to find it here. What you will find here is a decent low-budget movie that offers up some gore and nudity while having at least a couple good actors that keep you interested in the film and their story. I thought Tompkins was good enough in her role and I thought she handled the part to where you take a liking to her character. The actress at least managed to make you enjoy watching her go through the story. As far as the story goes, it's pretty much your typical demon-in-the-house story without any scares or much of anything else. Again, THE AMITYVILLE TERROR is mildly entertaining for what it is but if you go in expecting anything more than a low-budget horror movie then that will be on you.",
         "This has to be one of the greatest work of cinematography ever!!! Never in my life have I ever seen a greater depiction of eastern European folklore in a Hollywood production. This movie sent chills down my spine and my legs and my toes (and other parts of the body that can not be mentioned). It's clear that the writers have studied ancient eastern philosophy and theology, mysticism and the art of culinary. I was somewhat surprised with casting, but it all made sense in the end. I highly recommend this movie for all fans of the work of Andy Warhol!!!",
         "Admittedly,it had its fair share of having cliché scenes&moments,compared to even the re-makes,yet a somewhat \"Homage\"to the movies made through the years,Id think.But truthfully yet unfortunately too,it wasn't quit up to par,which Im REALLY guessing that they didn't have much for a\"Movie Budget\"that made the difference,&isn't on the same level-as in how well the Director did&how well w/knowing whats needed from the Actors,which as I go on further(Or if you watch this yourself),I think the Actors each played their characters great,&worked w/what they had avail. to 'em,which is why,&what made this more of a decent&watchable film!! (If You REALLY wanna see a badly done film thats also of the well- known Horror flicks&re-makes of\"The Exorcist\",the bad&really tacky couldn't bring myself to finish watching film made this year is\"Accidental Exorcist\"!Definitely this is a\"B--/B-Minus Minus\"film!!) If theyd had more $$ to work with,the Effects,even movie scenes&sets overall wouldn't likely have it come together and be as I put it,your typical\"B-/B-Minus\"movie instead of being either the term\"Blockbuster Hit Movie\",or the worse version of a \"B-\"Movie is ones I call a \"B--/B-Minus Minus\"movie thats just SO BAD,or FLAT OUT Terrible that I cant bring myself to finish watching it type of thing!! I just think that w/watching this it was along the general same known story&plot more so than less,yet is just a different \"Low Movie Budget\"version I guess is an easier way to put it,along w/some added twist to the rules w/the movie,like in the summary on here,the townspeople are per say,secretive..."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "AZ Film Studios",
         "Marquis Productions",
         "Thriller Films"
      ],
      "summaries": ["When a new family moves to an old house in Amityville, they are tormented and tortured by an evil spirit living in the home while trapped by the malicious townspeople who want to keep them there."],
      "budget": 500000
   },
   "movielensId": 163561,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-04-01",
      "dvdReleaseDate": null,
      "directors": ["Michael Angelo"],
      "runtime": 84,
      "movieId": 163561,
      "title": "The Amityville Terror",
      "mpaa": "",
      "actors": [
         "Nicole Thompson",
         "Kaiwi Lyman",
         "Kim Neilsen",
         "Amanda Barton",
         "Trevor Stines",
         "Christy St. John"
      ],
      "imdbMovieId": "5312612",
      "originalTitle": "The Amityville Terror",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["S01Em2-vGO0"],
      "plotSummary": "When a new family moves to an old house in Amityville, they are tormented and tortured by an evil spirit living in the home while trapped by the malicious townspeople who want to keep them there.",
      "tmdbMovieId": 410537,
      "avgRating": 2.23077,
      "releaseYear": "2016",
      "numRatings": 13,
      "posterPath": "/fCVc6CK34R3cewehBFIMxmmLRCx.jpg"
   }
}