{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "based on true events",
            "id": 185722
         },
         {
            "name": "wartime romance",
            "id": 196671
         },
         {
            "name": "1930s",
            "id": 214548
         }
      ],
      "imdb_id": "tt2556114",
      "video": false,
      "title": "Guernica",
      "recommendations": [
         32546,
         367499,
         110909,
         99880,
         68774,
         259045,
         73738,
         350846,
         80141,
         253020,
         100098,
         80540,
         391617,
         62077,
         42626,
         331641,
         356270,
         387940,
         329718,
         254129
      ],
      "backdrop_path": "/aWlpWNzH9tARgWIdn8HUz0F2MLW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Henry",
               "gender": 2,
               "credit_id": "561de73ec3a3686cc3001355",
               "name": "James D'Arcy",
               "profile_path": "/geQAp8kKkMDXE5iCcC3rf7z4Fx3.jpg",
               "id": 19655,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Teresa",
               "gender": 1,
               "credit_id": "561de755c3a3686cc900142c",
               "name": "María Valverde",
               "profile_path": "/43KOwPxXeQUxVb7vkzDI2BJQAUP.jpg",
               "id": 77122,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vasyl",
               "gender": 2,
               "credit_id": "561de798c3a3686ccc001159",
               "name": "Jack Davenport",
               "profile_path": "/4asp2xBJS98Tx8yKTLyWn7fjLKj.jpg",
               "id": 1709,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "María (as Natalia Álvarez)",
               "gender": 0,
               "credit_id": "561e39f59251410648000213",
               "name": "Natalia Álvarez-Bilbao",
               "profile_path": "/iqsPWbTD7g544VCqZl0w7iL4uof.jpg",
               "id": 1522373,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Cousin Isabel",
               "gender": 1,
               "credit_id": "571fdd1ac3a3686ec5003bcc",
               "name": "Irene Escolar",
               "profile_path": "/ecNcoFaMySBfZYTS7m37g8GJjrH.jpg",
               "id": 962249,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Consul",
               "gender": 0,
               "credit_id": "5804e9ec9251414962000400",
               "name": "Burn Gorman",
               "profile_path": "/qpdtwkUJ5cG1zxql7xXomGgcTMc.jpg",
               "id": 39659,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "561e3b68c3a3686cc30020b6",
               "name": "Carlos Clavijo Cobos",
               "profile_path": null,
               "id": 1522376,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "561e3b7f92514142bc001ea4",
               "name": "Barney Cohen",
               "profile_path": null,
               "id": 1522377,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "584780aac3a3681411004322",
               "name": "Koldo Serra",
               "profile_path": null,
               "id": 225971,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5885659bc3a3684d6a0003f2",
               "name": "José Alba",
               "profile_path": null,
               "id": 1522267,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.615104,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 363841,
      "vote_count": 53,
      "budget": 6229577,
      "overview": "The fates of Henry - an American correspondent - and Teresa, one of the Republic's censors during the Spanish Civil War.",
      "similar": [
         324786,
         279641,
         374720,
         746,
         625,
         15121,
         4421,
         1369,
         676,
         227306,
         424,
         22972,
         228150,
         354287,
         4515,
         369885,
         9667,
         137113,
         271110,
         10592
      ],
      "original_title": "Gernika",
      "runtime": 110,
      "poster_path": "/h0L2vBa0MjtamyrG36h0KvrTzQA.jpg",
      "spoken_languages": [
         {
            "name": "euskera",
            "iso_639_1": "eu"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pterodactyl Productions",
            "id": 65428,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pecado Films",
            "id": 65429,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Travis Producciones",
            "id": 65430,
            "origin_country": ""
         }
      ],
      "release_date": "2016-04-26",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "In love and war the first casualty is truth",
      "adult": false,
      "homepage": "http://www.sonypictures.com/movies/guernica/",
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": null,
      "budgetCurrency": "€",
      "directors": ["Koldo Serra"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Barney Cohen",
         "Carlos Clavijo Cobos"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2556114/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg2MzcyNzI5N15BMl5BanBnXkFtZTgwMDgxMTk1NzE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "James D'Arcy",
         "María Valverde",
         "Jack Davenport"
      ],
      "reviews": [
         "Here in Spain, every time we see a movie about the Civil War the first thought is \"oh no, same old story\". Well, this is broken by this story made by Mr. Alba, Mr. Clavijo and Mr. Serra. Without paying attention to political issues, the film describes the happenings of that awful day of the bombs in Gernika through a love story and being respectful to the real events. It is wonderful to see a film carried out so carefully, with so much passion and looking for the spectator's heart. It is impossible not to see this movie without throwing a tear at the end. Furthermore, the Original Soundtrack is awesome, it lays under the story always making the perfect accompaniment; it is worth to listen to it while reading a book ;)",
         "Guernica could have been one of my all time favorites but unfortunately, as it happens too often these days, the culmination was badly executed. The first act is wonderful, a perfect setup for the upcoming events in the movie, with breathtaking cinematography, decent script and superb acting. The sets and the costumes were top notch, whoever could pull this off with 5 million deserves utmost respect. The first 30 minutes really feel like you're watching one of those great classics and I was pretty convinced that this movie is going to be ten star material. Unfortunately, as the movie progresses past the second act, it starts to lose its charms. The focus turns on the love story, which somehow manages to be underdeveloped, despite the huge screen time that it has. From there on, we have a cascading chain of blatant clichés which, combined with a final act that feels disjointed, really ruin the whole experience. Now if you pay attention, you'll notice that the final act is where we lose the German perspective. A scene on a bomber, a pilot reaction or even the German colonel watching the ongoing bombardment from a far would've kept this perspective alive and could've added some needed dramatic effect. Instead, the focus falls entirely on the events occurring in Guernica, which wouldn't be so bad if the whole act wasn't filled with severely overused clichés. All in all, this is a pretty decent war drama, which could've been something really special, had the writers come up with more original ideas.",
         "James D'Arcy plays an American journalist who is stationed in Guernica in 1937. The German Condor Legion is active and the war is raging all around, but the Republic have strict orders to only allow good new3s out and as such all journalists are censored to the point of mere mouths for propaganda. Meanwhile he sort of falls for Teresa who is one of the censors, but her Soviet boss, Vasyl (Jack Davenport) is also romantically committed to her and does not take kindly to the dalliance. We also have the brilliant Burn Gorman playing a NKVD agent who is deliciously ruthless (great piece of casting too) and he brings some welcome spice to the proceedings. What follows are the events that put Guernica on the map – 'for all the wrong reasons'. This is a really well made film with some great performances (accents aside) and high class CGI and a nice attention to detail. The love interest is good but not really going to be legendary and some could say that the bombing was under done, but I found it to be about right – we don't need loads of screen time of people suffering to make the point. In English, Castilian, Basque and some German with good to average sub titles, this is a film that is very much worth checking out.",
         "\"Guernica\" is a very good film and it's well worth seeing. However, I also assume that most folks just aren't that interested in seeing a film about a town leveled in 1937 during the god-awful Spanish Civil War. Not exactly a crowd-pleaser of a topic for a movie in 2016...but still a well made and interesting film. To really understand the movie, you should know a bit about this war--things you may not clearly understand when you watch. In 1936, the Spanish people elected a socialist government (often called 'Republicans'). However, a coup soon broken out when right-wing nationalist generals decided to depose their leader and create their own government. It wasn't a quick nor easy process, however, and the bloody war raged on for several years. Soon the Soviets began aiding the government and the Axis powers (Germany and Italy) began sending support to help General Franco and his Nationalist forces ultimately win the war. The destruction of the town of Guernica by the Luftwaffe was soon made famous by Picasso's enormous mural named after this city. When the film begins, Henry (James D'Arcy) is an American news correspondent who working in Spain during this war. He soon finds frustration in covering the events, as often the Republican Spanish government heavily censors his stories--making them, essentially, bland propaganda. What he doesn't realize is that the Soviets advisers in the country are essentially running both this propaganda campaign as well as a Stalinist system by which 'enemies of the state' are ruthlessly purged...whether or not they are guilty of anything. Because Henry has a habit of stepping on toes, he soon is the subject of one of these purges...and this ends up not only affecting him but his lady, Teresa (Maria Valverde). But just as this trap is sprung, the infamous bombing begins. While this is a romance, I must emphasize that the romantic portion is not primary. Additionally, the plot will not satisfy romance junkies--it doesn't follow the formula of a romance and is more tragic than heartwarming. Instead, the film is more about the events leading up to the carpet bombing of the town of Guernica as well as a vivid recreation of this...and this fictional romance is woven into this. History junkies, however, will be happy with this choice in focus, as the film did an excellent job trying to get the look right of the German planes, uniforms and costumes. It also didn't portray either side as the good guys or bad guys--a mistake many films often make when they discuss the war. Think about it...Stalin on one side, Hitler and Mussolini on the other! About the only thing that didn't work for me in the film was having Henry knowing absolutely no Spanish...none...which was very odd for a news man living in Spain and investigating what's going on in the war. Odd...but not a serious problem with the film. Overall, an interesting and occasionally powerful film about a seldom discussed topic.",
         "The goal of the film was to put a human face on the tragedy of Guernica, the market town in Northern Spain that was destroyed by German bombers during the Spanish Civil War. Unfortunately, the romantic narrative was far-fetched, and the dialogue was often strained in this labored, slow-paced drama. The filmmakers were successful in conveying the complexity of the Spanish Civil War. The opposition of the fascist \"loyalists\" supporting Franco versus the \"republicans,\" who were allied with Stalin, was well presented. But the film failed to convey the idealism of the Republicans. It was the passion of the Republicans to preserve their government against a military coup that captivated the world in the 1930s. Yet the passion was inexplicably missing in the film. The main character was an American journalist named Howell, who was evidently modeled on the British writer George Steer who broke the story of the atrocities at Guernica. But Steer, along with other like-minded writers like Ernest Hemingway and George Orwell, also witnessed the passion of ordinary people resisting the forces of fascism in the 1930s. Where was the passion in this film? The character of Teresa, who was a censor, was essential for demonstrating the uses of propaganda. But her character did not demonstrate to Howell why the cause of the Spanish Civil War was important in taking a stand against European fascism. The filmmakers seemed unaware of how important it was in the 1930s to resist another nation turning to fascism. That SHOULD have been the main focus of this drama. In the final analysis, the romantic intrigue was not compelling or believable. And despite the beautiful photography of Northern Spain, the true soul of the nation was not captured in \"Guernica.\"",
         "The film is a love story set amidst the Spanish Civil War just before the bombing of the Spanish city of Guernica. In 1937 German airplanes bombed the city; killings over 1,600 and reducing the city to ashes. The bombing was immortalizing that same year in Picasso's famous painting. The film suffers from poor direction, wooden performances, and a script which is both confusing and unfocused; featuring an implausible love story that's tacked on to make the \"historical\" part of the film more personal. The film is pure fascist propaganda; produced to vilify the democratically-elected Republican government. The film attempts to blame the causalities of the bombing on the Republic's news censorship; Shifting the blame away from the Germans. In essence blaming the victims. However, the Spanish government had no prior knowledge that the Germans planned to raze the city of Guernica to the ground. The Nazis didn't advertise their war plans. German Nazi soldiers are depicted as ordinary men just carrying out orders; while the democratically-elected Republican government officials are shown as evil, devious men beholden to the Soviet Union setting up innocent people for incarceration and torture. The Republic needed every man and woman it could use to fight the Fascists. The barbarians were literally at the gates. It had no time or interest incarcerating innocent people when real enemies of the state existed; paid mercenaries known as 5th columnists trying to take down the country from the inside. Many young men throughout the world volunteered to serve in Spain; fighting to save the world from Fascism, such as the Abraham Lincoln brigades from the US. This film is an affront, not only to the democratically-elected government of the Republic in Spain, but to the thousands who fought and the thousands who died fighting against Fascism. Long live the memory of the Spanish Republic!",
         "The fates of Henry - a cynical American correspondent who has lost his soul - and Teresa, one of the Republic's censors and in charge of overseeing the news that journalists can send abroad, cross in Gernika. Although this movie talks about romance in a time of war there is no heart at all, the acting is so so and the whole movie is a big bubble from another based on true events film and in this case drama, war and romance doesn't work that great and some of the characters were pretty retarded this isn't a film to recommend to see or even buy just skip it and go watch a much better war film for example Fury or something that has good direction, actors and script. Guernica gets an 3 out of 10 by me.",
         "This interesting film results to be a romance story along with an exciting dramatization of the bombing of Guernica (26 April 1937) , it was an aerial bombing of the Basque town of Guernica during the Spanish Civil War . It was carried out at the behest of Francisco Franco's nationalist government by its allies, the Nazi German Luftwaffe's Condor Legion and the Fascist Italian Aviazione Legionaria, under the code name Operation Rügen . The town was being used as a communications center behind the Frontline . Advances by Nationalist troops led by Generalísimo Francisco Franco had eaten into the territory controlled by the Republican Government . The Basque Government , an autonomous regional administrative body formed by Basque nationalists , sought to defend Biscay and parts of Guipuzcoa with its own light Basque Army. Meanwhile , a journalist Henry (James D'Arcy) writes news that are strongly censored by rigid censors as Teresa (María Valverde) in charge of overseeing the news that reporters can send abroad and Vasyl (Jack Davenport) . Then , their fates are tragically crossed during the Gernika massacre . There are also Stalinist advisers (Burn Gorman) who following Joseph Stalin's orders pull off bloody purges . As in love and war the first casualty is truth . The plot is plain and simple , an enjoyable as well as intimate love story in war times . This dramatic film about an unresolved romance , is well narrated and reminisce about a triangular love story , including an intense dramatization of the Gernika bombings . Breathtaking final scenes when there takes place the bombing , being confined to the film's last fifteen minutes and the ending images will determine the surprising denouement . The movie utilizes an often-used plot of the war movie genre which has two young people , here the cynical American correspondent James D'Arcy and the jealous Jack Davenport in love with the same woman , Maria Valverde , one of the Republic's censors from leftist wing government . It contains an atmospheric and thrilling musical score by Fernando Velázquez . Colorful and evocative cinematography by the splendid director of photography Unax Mendia . The movie was professionally directed by Koldo Serra (The backwoods , Distopia). The film had several nominations ASECAN 2017 as Nominated Best Editing , Best Sound ; Gaudí Awards 2017 Nominated Gaudí Award Best Costume Design : Millor Vestuari and Goya Awards 2017 Nominated Goya Best Special Effects : David Heras . The picture is based on real events , these are the followings : At the time of the raid, Guernica represented a focal strategic point for the Republican forces. It stood between the Nationalists and capture of Bilbao. Bilbao was seen as key to bringing the war to a conclusion in the north of Spain. Guernica also was the path of retreat for the Republicans from the northeast of Biscay. Prior to the Condor Legion raid, the town had not been directly involved in the fighting, although Republican forces were in the area; 23 battalions of Basque army troops were at the front east of Guernica. The town also housed two Basque army battalions, although it had no static air defenses, and it was thought that no air cover could be expected due to recent losses of the Republican Air Force. It happened on Monday 26 April , there was a noisy market day ; there were more than 10,000 people in the former Basque capital . The attack gained infamy because it involved the bombing of civilians by a military air forcé . The number of victims is still disputed; the Basque government reported 1,654 people killed at the time, while local historians identified 126 victims . An English source used by the Air War College claims 400 civilians died. Russian archives claim 800 deaths on 1 May 1937, but this number may not include victims who later died of their injuries in hospitals or whose bodies were discovered buried in the rubble. The bombing is the subject of a famous anti-war painting by Pablo Picasso, commissioned by the Spanish Republic. It was also depicted in a woodcut by the German artist Heinz Kiwitz, who was later killed fighting in the International Brigades. The bombing shocked and inspired many other artists, including a sculpture by René Iché, one of the first electro-acoustic music pieces by Patrick Ascione, a musical composition by René-Louis Baron and poems by Paul Eluard : Victory of Guernica , and Uys Krige : Night of the Fascist Bombers . There is also a short film from 1950 by Alain Resnais entitled Guernica.",
         "The film is a fictionalized drama of a true story, based on the events that took place April 26, 1937 in Guernica during the Spanish Civil War. The movie follows the life of famed American reporter Henry Howe (James D'Arcy) as he attempts to get out stories while being censored. He is embedded with the rebels in Basque country, aided by Russian communists. The rebels are fighting for a Democratic Spain against Franco, supported by Germany and Italy. A new war technique is going to be used on that said day as the film starts a week earlier, giving us enough time to develop a love story. This is a film on the Spanish Civil War that doesn't involve Hemingway, the Abraham Lincoln Brigade, or a labyrinth...although Hemingway was mentioned. Like a Hemingway novel on the Spanish Civil War, the film is a bit laborious to get through and there is a bell that tolls. This is not a documentary it is a historical novel and does not involve zombies. The film is done in multiple languages, English, Spanish, German, Russian, and maybe Basque, French, and Italian. You might want to make sure you get something with subtitles. It is mostly a drama with a protagonist that wasn't that likable and sees the war through his hip flask. Not for everyone. Guide: No swearing (In English anyway). Brief nudity (María Valverde)."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Pecado Films",
         "Travis Producciones",
         "Sayaka Producciones Audiovisuales"
      ],
      "summaries": ["The fates of Henry - a cynical American correspondent who has lost his soul - and Teresa, one of the Republic's censors and in charge of overseeing the news that journalists can send abroad, cross in Gernika."],
      "budget": 5800000
   },
   "movielensId": 163541,
   "movielens": {
      "languages": [
         "euskera",
         "English",
         "Deutsch"
      ],
      "releaseDate": "2016-04-26",
      "dvdReleaseDate": null,
      "directors": ["Koldo Serra"],
      "runtime": 110,
      "movieId": 163541,
      "title": "Guernica",
      "mpaa": "R",
      "actors": [
         "James D'Arcy",
         "María Valverde",
         "Jack Davenport",
         "Natalia Álvarez-Bilbao",
         "Irene Escolar",
         "Burn Gorman"
      ],
      "imdbMovieId": "2556114",
      "originalTitle": "Gernika",
      "genres": [
         "Drama",
         "War",
         "Romance"
      ],
      "youtubeTrailerIds": ["EgEADDlSo2E"],
      "plotSummary": "The fates of Henry - an American correspondent - and Teresa, one of the Republic's censors during the Spanish Civil War.",
      "tmdbMovieId": 363841,
      "avgRating": 3,
      "releaseYear": "2016",
      "numRatings": 18,
      "posterPath": "/h0L2vBa0MjtamyrG36h0KvrTzQA.jpg"
   }
}