{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "urn",
            "id": 5602
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "death of father",
            "id": 10201
         }
      ],
      "imdb_id": "tt1870543",
      "video": false,
      "title": "Cruel Will",
      "recommendations": [
         341035,
         312131,
         228915
      ],
      "backdrop_path": "/am0tKxUGF22MZ2fbh32yDNKy09I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Paul",
               "gender": 0,
               "credit_id": "58ca92ce9251415da400bd36",
               "name": "Arron Kinser",
               "profile_path": null,
               "id": 1347589,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Lily",
               "gender": 0,
               "credit_id": "58ca92d99251415d9900c05f",
               "name": "Marissa Pistone",
               "profile_path": null,
               "id": 1433400,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Fredrick",
               "gender": 2,
               "credit_id": "58ca92e59251415d9500c2d4",
               "name": "Spencer Garrett",
               "profile_path": "/gzhIgjFtWeAhfp2yZsiUpD0XAaX.jpg",
               "id": 49275,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Dr. Frances",
               "gender": 2,
               "credit_id": "58ca92f09251415da400bd4f",
               "name": "Harry Lennix",
               "profile_path": "/uwpRytLjzz1IvjNanYNlplPVal9.jpg",
               "id": 9464,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Adrian",
               "gender": 2,
               "credit_id": "58ca93039251415da400bd60",
               "name": "Doug Jones",
               "profile_path": "/rpvvWATYWHGjedJea0G97XufOwU.jpg",
               "id": 17005,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "58ca93319251415d9500c305",
               "name": "Arthur Romeo",
               "profile_path": null,
               "id": 1777518,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58ca9337c3a368412a00b3b9",
               "name": "Arthur Romeo",
               "profile_path": null,
               "id": 1777518,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58ca93479251415d9900c0a8",
               "name": "Alex Kornreich",
               "profile_path": null,
               "id": 1451882,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58ca9351c3a368418200bb29",
               "name": "Arron Kinser",
               "profile_path": null,
               "id": 1347589,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.546736,
      "production_countries": [],
      "id": 273856,
      "vote_count": 4,
      "budget": 80000,
      "overview": "Tragedy strikes married couple Paul and Lily, when Lily's father dies. Lily has her father cremated, brings the urn home and now Paul has to come to terms with the death of his father-in-law whom he had despised. The situation gets a bit frayed when the lid to the urn mysteriously disappears, and Paul begins to experience happenings no one else is aware of.",
      "similar": [
         3134,
         11564,
         298312,
         8810,
         281,
         948,
         133805,
         22323,
         12162,
         1359,
         431,
         10285,
         101,
         562,
         339692,
         261023,
         292280,
         241,
         170,
         681
      ],
      "original_title": "Cruel Will",
      "runtime": 90,
      "poster_path": "/azBdoDgTtRKOw1acJg7L7i7InU4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-12-30",
      "vote_average": 3.4,
      "belongs_to_collection": null,
      "tagline": "Ashes to Ashes, Dust to Dust.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": null,
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arthur Romeo"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Arthur Romeo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1870543/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjAyMzcyMDQwNF5BMl5BanBnXkFtZTgwMzU3MDc1MTE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Arron Kinser",
         "Marissa Pistone",
         "Spencer Garrett"
      ],
      "reviews": [
         "After the death of her abusive father, Lily and her husband Paul begin to experience strange happenings throughout their small suburban home, but have the pair fallen under the sinister influence of Lily's father's spirit, or have each of them begun to slip into a state of delusion brought on by their own repressed feelings? It is only by the cruel will of writer and director Arthur Romeo that this piece of garbage would actually be intended for human eyes. CRUEL WILL starts off boringly enough as we delve into the death of Lily's father, and her own dysfunctional marriage. Shortly there after, Paul is forced to question his own sanity as ghostly visions overtake him. The ambiguity here sets up for a decent mystery that pays off in the worst of all possible ways. When Paul finally loses his mind, actor Arron Kinser loses all remaining credibility what is easily the most absurd performance of the year. Kinser is laughably bad, but his supporting actors do their best to distract from his ridiculous display with their own poor portrayals of the other characters. CRUEL WILL is not the least bit terrifying or entertaining. It is a trial in patience that no viewer should ever have to endure.",
         "Imagine a movie where you wanted all the characters, producers, director, extras and anyone else responsible for making it necessary to follow through with this project to die a slow, painful death. this is that movie. another piece of junk. the acting was filled with over the top and inappropriate reaction to simply situations I read that the female lead Marissa Pistone Graduated magna cum-laude from Chapman University in Orange, California in 2010 with a Bachelor of Fine Arts Degree in Theatre Performance. What a waste of time, money and recourses, hope you have a strong minor. Arron Kinser, what can I say? He reminded me of those old Kung-Fu flicks from Hong Kong with the over acting - don't watch this movie!",
         "I thought \"Apocalypse Earth,\" \"Alien Uprising\", \"Dino Shark\" and \"The Uprising\" would never be surpassed in the category of \"Most horrible bad movie ever\", until I saw this monstrosity. \"Cruel Will\" is a low-budget indie horror. You can notice that surely after a while. Absolutely everything in this film doesn't make sense or is terribly wrong. The content, the storyline, the performances, the thrills and the intense atmosphere ... Really all of this is either bad or totally absent. You can hardly call this creation a horror movie. Even thriller is not applicable. Better you call it a tragedy. Paul and Lily are a married couple and one day disaster strikes. Lily's father dies suddenly and is cremated. Lily is obviously quite devoted to her father (and afterwards I had to conclude that she really had no reason to) and takes the urn back home. From that moment on, disturbing phenomena start to happen in their house. Paul experiences paranormal visions which the others can't see. He didn't have such a good relationship with his father in law and perhaps that is why the lid of the urn disappeared and his father in law returned to haunt Paul about the past. Or Paul is losing his mind ! That's also possible. Who knows? The film won't point that out. What a terribly original story. As empty as the urn after a while. There's no sign of tension or any scares. A shadow that reflects in a puddle or a mirror and a shape standing in a corner won't scare you silly. The aunt who stays over after the funeral, and retreats in the evening on the coach with a bottle of liquor, looks in the morning more terrifying than any other scene in this film. Even the moments that Lily undergoes a metamorphosis and suddenly looks like a zombie-like bloodthirsty creature couldn't stop me from yawning. So don't be fooled by the movie poster. That poster looks pretty intriguing. That intriguing part is completely lost in this film. But mostly it's the acting that gives you the creeps. I've seen roles played by a local theater company even better. This was so terribly bad and amateurish. The stupid look Paul had on his face the whole time. The portraying of feelings is so badly done that you're tempted to think that this is a video montage of a teen club that has amused itself making a hobby-horror movie. The friend of Paul is such an annoying nerd who is constantly babbling gibberish. You would like to hit him so hard with something so he would finally shut up. Most hilarious and ridiculous fragment was the moment that someone comes riding along with his jeep together with his girlfriend, and sees Paul lying unconscious on the ground. The change from being helpful to fairly aggressive defensively, was downright sad to see. The conflict that arises afterwards between Paul, Lily, Paul's boss and the totally crazy friend, is too terrible to put into words. Painfully bad. At one time it seemed as if the entire cast was trying to outdo each other in a contest for \"the most ridiculous acting ever\" ! There's only one brilliant moment and that's at the final scene. Had the complete movie looked like this excerpt, then it might have been something worth while to watch. Stunning slow-motion images, a hallucinatory scene and a rather surprising end. But the horse had bolted already ...... Good advice. Don't even bother to put on this absurdity. I would just give it half a star, purely for myself for my stamina! More reviews at http://opinion-as-a-moviefreak.blogspot.be/",
         "Paul and Lily are sweethearts who have been in love since high school. They married and moved away to live a life free of rules and boundaries. Lily is studying to be a master chef and is doing remarkably well. However Lily learns some disturbing news as she is home practicing for an exam. She learns that her father has passed away. After the funeral and the devastating blow to Lily that she never got to say goodbye to her father, Paul realizes that the separation has taken a violent effect on her. Paul must come to terms with the death of Lily's father as she brings the urn of her father's cremated remains back home. Strange things occur when Paul realizes the lid to the urn has gone missing and strange things have been happening since the lid's disappearance. The movie is beautifully shot and visually looks like studio quality from this critic's standpoint. Precise angles and cutaway's paint a very pretty but scary picture of what is about to happen. Paul begins to lose his mind and images appear and things slowly get worse over time. Paul's guilt over how Lily is handling her father's death is getting to him and the decent into madness is very clear through the depiction by the director. Acting out these kinds of scenes are always difficult as you are transitioning from one state of mind to another. The fear may seem a bit cliché with these kinds of movies but the chemistry between actors Arron Kinser and Marrisa Pistone leaves you always wondering and feeling a bit disjointed. The actors do well to betray the feelings of the audience and its not your normal cheesy scary flick. The dialog is simple but enough things are going on to emphasize the truth of the matter; Paul's guilt and the realization of what Lily's father's death really means. This movie is a virtual roller-coaster that can not be missed!",
         "I recommend it to see for yourself because there are actually good scenes and bad scenes on the movie at the same time. I don't understand why they didn't find a certain way to execute this. With current scenes and editing it looks like a put together movie. For example bathroom scene was good but a particular fight scene on the living room was bad. On some scenes acting was good and on some scenes it was bad. It could be a really good movie though. I feel like everyone who worked on that movie has a great potential to do something really really cool. I always enjoy and prefer horror flicks based and expands around female lead characters so I actually watched this for Marissa Pistone. I didn't know her before this movie though... I hope to see more horror movies with female leads. Mr. Harry Lennix is one of my favorite actors for a LONG time. And I'm happy to see him supporting this kind of labor of love. It's a low budget movie but just like almost all other low budget horror/thriller movies I've seen, its passionate. And obviously everyone involved is loving what they do."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Larsen Bay Entertainment"],
      "summaries": ["Tragedy strikes married couple Paul and Lily, when Lily's father dies. Lily has her father cremated, brings the urn home and now Paul has to come to terms with the death of his father-in-law whom he had despised. The situation gets a bit frayed when the lid to the urn mysteriously disappears, and Paul begins to experience happenings no one else is aware of."],
      "budget": 80000
   },
   "movielensId": 163551,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-12-30",
      "dvdReleaseDate": null,
      "directors": ["Arthur Romeo"],
      "runtime": 90,
      "movieId": 163551,
      "title": "Cruel Will",
      "mpaa": "",
      "actors": [
         "Arron Kinser",
         "Marissa Pistone",
         "Spencer Garrett",
         "Harry Lennix",
         "Doug Jones"
      ],
      "imdbMovieId": "1870543",
      "originalTitle": "Cruel Will",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": ["qTtUy9db54A"],
      "plotSummary": "Tragedy strikes married couple Paul and Lily, when Lily's father dies. Lily has her father cremated, brings the urn home and now Paul has to come to terms with the death of his father-in-law whom he had despised. The situation gets a bit frayed when the lid to the urn mysteriously disappears, and Paul begins to experience happenings no one else is aware of.",
      "tmdbMovieId": 273856,
      "avgRating": 1,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/azBdoDgTtRKOw1acJg7L7i7InU4.jpg"
   }
}