{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "afghanistan",
            "id": 3541
         },
         {
            "name": "war",
            "id": 6091
         }
      ],
      "imdb_id": "tt4911408",
      "video": false,
      "title": "Citizen Soldier",
      "recommendations": [],
      "backdrop_path": "/h28jzvF0LubwATK75r6WjEMGcTF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself (as CPL Alex)",
               "gender": 0,
               "credit_id": "57cc551dc3a36830ae001729",
               "name": "Jordian Alex",
               "profile_path": null,
               "id": 1673281,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself (as 2LT Brown)",
               "gender": 2,
               "credit_id": "57cc552792514126280018b3",
               "name": "James Tyler Brown",
               "profile_path": null,
               "id": 1673282,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself (as SGT Colson)",
               "gender": 0,
               "credit_id": "57cc554dc3a368308d00197c",
               "name": "Jared Colson",
               "profile_path": null,
               "id": 1673283,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself (as SSG Floyd)",
               "gender": 0,
               "credit_id": "57cc5560c3a368309300165f",
               "name": "Colt Floyd",
               "profile_path": null,
               "id": 1673284,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself (as SGT Eran Harrill)",
               "gender": 0,
               "credit_id": "57cc55689251412619001926",
               "name": "Eran Harrill",
               "profile_path": null,
               "id": 1673285,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Himself (CW2 Kruse)",
               "gender": 0,
               "credit_id": "57cc5574c3a3683090001670",
               "name": "Nathan Kruse",
               "profile_path": null,
               "id": 1673286,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself (as TSgt Viel)",
               "gender": 0,
               "credit_id": "57cc5595c3a368309c0017f8",
               "name": "Raymond Viel",
               "profile_path": null,
               "id": 1673287,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Himself (SFC Wolff)",
               "gender": 0,
               "credit_id": "57cc559ec3a36830a0001a08",
               "name": "Erik Wolff",
               "profile_path": null,
               "id": 1673288,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Himself (as SFC Byrne)",
               "gender": 0,
               "credit_id": "591f8bcd9251414a5703878e",
               "name": "Martin Byrne",
               "profile_path": null,
               "id": 1819960,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself (as SGT Smith)",
               "gender": 0,
               "credit_id": "59c6bcb2c3a36813a9047b8f",
               "name": "Justin Smith",
               "profile_path": null,
               "id": 1893642,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57c8bdd992514148de000e8e",
               "name": "David Salzberg",
               "profile_path": null,
               "id": 954783,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57c8bdfbc3a3685be6000f5a",
               "name": "Christian Tureaud",
               "profile_path": null,
               "id": 964702,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.542836,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 406231,
      "vote_count": 4,
      "budget": 0,
      "overview": "CITIZEN SOLDIER is a dramatic feature film, told from the point of view of a group of Soldiers in the Oklahoma Army National Guard's 45th Infantry Brigade Combat Team, known since World War II as the \"Thunderbirds.” Set in one of the most dangerous parts of Afghanistan at the height of the surge, it is a heart-pounding, heartfelt grunts' eye-view of the war. A modern day Band of Brothers, Citizen Soldier tells the true story of a group of young Soldiers and their life-changing tour of duty in Afghanistan, offering an excruciatingly personal look into modern warfare, brotherhood, and patriotism. Using real footage from multiple cameras, including helmet cams, these Citizen Soldiers give the audience an intimate view into the chaos and horrors of combat and, in the process, display their bravery and valor under the most hellish of conditions.",
      "similar": [
         374720,
         324786,
         4421,
         1369,
         137113,
         22972,
         228150,
         369885,
         6415,
         279641,
         676,
         12162,
         9667,
         227306,
         429351,
         1911,
         252178,
         12437,
         34851,
         19995
      ],
      "original_title": "Citizen Soldier",
      "runtime": 105,
      "poster_path": "/uqXFqZT1cT3Q6fHYilPSnBUJAp5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-08-05",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Real People. Real Heroes.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "David Salzberg",
         "Christian Tureaud"
      ],
      "runtime": 105,
      "synopsis": "CITIZEN SOLDIER is a dramatic feature film told from the point of view of a group of soldiers in a United States Army Infantry Company, part of the Oklahoma National Guards 45th Thunderbirds Brigade. A modern day Band of Brothers, Citizen Soldier set in one of the most dangerous parts of Afghanistan at the height of the surge is a heart-pounding, heartfelt grunts eye-view of the war. The film tells the true story of a group of young men and their life-changing tour of duty in Afghanistan. It gives the audience an intimate view into the chaos and horrors of combat as well as the bravery and valor these Citizen Soldiers display under the most hellish of conditions. The film further highlights the extraordinary and unprecedented role that the National Guard has played in post 9/11 wars since September 2001. These Citizen Soldiers are patriotic men and women, one day working 9-to-5 jobs, the next day deploying to the front lines of war. One of them is Sgt. Eran Harrill a born leader, devoted single father, and head of his local Chamber of Commerce. Eran is also a college student. However, when his unit is called up, he defers his education and instead deploys and fights for his country. Using multiple cameras, Eran and his fellow soldiers capture the daily life of their unit, a unit that encountered some of the most violent fighting of the war. Citizen Soldier offers an excruciatingly personal look into combat, brotherhood, and patriotism. This is the true story of the National Guard fighting Americas war when called upon, building global partnerships when asked, and protecting the homeland at all costs.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4911408/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzA5Njg1NjI2N15BMl5BanBnXkFtZTgwNjI4MjA1OTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jordan Alex",
         "James Tyler Brown",
         "Martin Byrne"
      ],
      "reviews": [
         "Would rate this a definite worth a watch, let's say 7 (put a 10 in to offset Mr 1/10 who clearly doesn't u sweat and the point of a review- just that he thinks war is a waste of money which is a different question) But yea a refreshing no bs account of what wars are really like told from the human perspective (albeit from one sides perspective only). The pov footage was not detrimental at all in my opinion and really did immerse you in the situation at least as much as possible from the couch. Gripping for the most part and completely devoid of the standard 'murica yeah! mentality that is often conveyed in war documentaries/movies. And no I'm not American.",
         "This film shows the reality of armed conflict for everyday people, no propaganda, just a documentary showing the realities of army reserve part time soldiers with normal civilian lives in the thick of the Afghanistan war. Afghanistan is one of the most volatile places on this earth and the documentary covers the rawness of its actuality. It isn't just a video of their job, but a film depicting the real emotions of the war such as the loss of a fellow solider or the high emotions of adrenaline filled firefights. If you want to see something that depicts the war for what it really is, without any dramatizations or additional patriotism, then this is a perfect documentary for you. Being a ex soldier of the Australian Army with a combat deployment to Afganistan and currently in Baghdad, Iraq as a private contractor this films relates to me in many ways. It also helps people that are unaware of the situations and the reality of what veterans have encountered whilst on combat operations. Absolutely recommended. David Salzberg has done wonders again to show the reality of war. Well done.",
         "Current war narrative focuses almost exclusively on the plight of the armed forces juxtaposed with the plight of the civilians trapped in the war zones we in the West vote for. As far as I know, this is the only film that focuses on the ever growing Civil defense force, those people who used to be \"Weekend Warriors\", but who are now thrown into the hell holes of the world for months at a time. These are people who used to spend their Saturday nights doing pointless drills and occasional firing range sessions, now suddenly finding themselves sent to the far end of a horrifying firefights for half a year at a time. This film had me in tears so many times I cant count. It's the single most powerful and moving documentary I have ever watched. These are real civilians, driven by selfless need to provide service, suddenly thrown into the meat grinder for months at a time with a 10th of the training professional soldiers receive, yet thrown into the same grinder as our professional soldiers. If every Trump Tastic war mongering armchair General around the world was shown this, we'd have world peace by the weekend. These are \"normal\" relateable people like you and I, facing a hell we should pray each night we never have to see, and facing it with the kind of courage we should be thankful we don't have to find. This is the only film I will ever give 10/10 and I do that with the utmost respect to the people I have watched die tonight. Don't watch this film - BUY this film as many times as you can afford and donate to the charities supporting veterans with PTSD. Review written by a UK Pacifist who hopes for the day Afghan and Western can join together and stop being killed for the benefit of Wall Street. I'm not some jingoistic Trump wallah, this film is important and should be required viewing.",
         "Citizen Soldier is set in post-9/11 and is about a group of Oklahoma men and women in the National Guard who get deployed to fight in the most menacing areas of Afghanistan. Go-pro helmet cameras were used incredibly in the making of this documentary because it gave a more personal look in to the soldier's tour of duty. This film included honest and genuine interviews from the National Guard members, which added a more inclusive and emotional element to the film. It stands out amongst all other military films because it is not simply a documentary about violent warfare or pro-war propaganda, but instead it shows the dramatic transformation of average civilians to National Guard soldiers fighting tirelessly in Afghanistan. It is focuses on the brotherhood and bond shared between these brave soldiers and defines what it truly means to have a fellow soldier's back while on the battlefield. The leadership and bravery that the armed troops of our country possess truly amazed me. I thought it was a heartfelt film.",
         "I loved both The Hornet's Nest & Citizen Soldier & rated them 10/10 The only \"parts\" I did not like are where young brave soldiers tragically lost their lives at too young an age.I have super respect for anyone who has the bravery to go & defend their country & fight for those they love. David Salzberg & Christian Tureaud are wonderful Christian men & produced excellent documentaries with these 2 movies.This movie is very haunting & leaves footprints in your heart when you remember each soul that died.They were so very brave & when the song \"Chariot Awaits\" plays I my heart breaks & I cry every time.You should respect & honor all those who were in both movies.They walked away from their families & from their children & from their loved ones to go on a dangerous mission to protect & serve.Not many choose to walk that path as stated in the Bible. John 15:13 There is no greater love than to lay down one's life for one's friends.Imagine how these soldiers felt on the battleground.Imagine how they felt as their eyes were closing to this world & they left all those they loved behind.Imagine how their families friends & children feel now that their loved one is no longer with us.I have watched many a war documentary & none are as powerful as these 2 movies.God bless everyone in both movies & keep you safe.Thank you for taking time out of your lives to share your stories with all of us.You will always be loved & will never be forgotten.",
         "What we saw in this film were just endless shaky camera works, even worse than those \"Jason Bourne\" movies or \"Hardcore Henry\". Guess the two so-called journalists following these soldiers into the battleground were also feared for their lives, other than had to climb up and down in the mountain rocky terrains. We saw a bunch of civilians, a group of the National Guards of America, called for duty to go to war against the insurgents in Afghanistan. These guys only had about 39 days each year to re-familiarize their memory about the military training. They were just a bunch of family guys wearing uniforms and holding rifles. When they went into the war zone, they usually panic and didn't actually know how to deal with the firefights. All they knew was keep shooting to certain direction without any specific target, they just blindly pull their rifle or machine guns' triggers without knowing anything. They just wasted lot of bullets to get the low return of American tax payers' hard earned money. Most of the time, they needed air support to suppress the enemy's fire. One of their guys died by bullets shot from remote insurgent hideout. They felt so sorry about the death.... This documentary film is no better than most of the others that tried to portray and record American soldiers battle experiences. What we saw in these films were just bunch of poorly trained and always scared-to-death American young or middle aged soldiers shooting blindly to some opposite directions and nothing else. When watching this film, it reminds me the script of another 'Based on True Event\" then dramatized 2016 film, \"War dogs\". I just quote part of it to let you know how we are so naive about freedom, patriotism, sacrifice for your country, etc, etc: Quote~~ \"What do you know about war? They'll tell you it's about patriotism, democracy\u0085 Or some sh@t about the other guy hating our freedom. But you want to know what it's really about? What you see? A kid from Arkansas doing his patriotic duty to defend his country? I see a helmet($578), fire-retardant gloves ($165), upper-body armor($1,585), lower extremity body armor(LEBA) and a M16($6,275), tier 2 pelvic protection system, Kevlar upper legs protectors, thermal weapon sight, ammunition, boots, backpack\u0085Machine gun($6,800), Abram tank($8.58 million)\u0085 I see $17,500 on each and every soldier's body. That's what it costs to outfit one American soldier. Over two million soldiers fought in Iraq and Afghanistan. It cost the American taxpayer $4.5 billion each year just to pay the air conditioning bills for those wars. And that's what war is really about. War is an economy. Anybody who tells you otherwise is either in on it or stupid. But I didn't know that yet. Back then, I didn't know anything.\" ~~Unquote I have nothing further to say. Amen.",
         "I recently watched this film that was nothing short of superior. It was a true portrayal of the bravery, spirit and brotherhood of our soldiers fighting for our country. No propaganda, no crafted protagonists, no censorship - just raw footage of ordinary citizens being extraordinary heroes. Post 9/11, a group of Soldiers in the Oklahoma Army National Guard was deployed to one of the most dangerous parts of Afghanistan. This is not only their story; it's their reality. When I watch classic war movies such as Saving Private Ryan and Full Metal jacket, they definitely prove to be entertaining, however I always wonder how close to reality they touch. In Citizen Soldier, there is never a doubt. As seen from a helmet cam, you not only watch the constant danger and uncertainty these soldiers face but also experience it. The reoccurring theme of comradery is prevalent in the periodic interviews with the soldiers as they recollect their thoughts and feelings. Each soldier had one thought on their mind, and that was to keep each other safe. Citizen Soldier is an incredibly crafted documentary with real depth that will give you an overwhelming sense of appreciation for our military.",
         "Whether you are a bleeding liberal or a conservative, this documentary will provide more education about war, about troops serving overseas, about what happens after war, and the bond forged by our men and women who serve than any history book or newscast. This should be added to curriculum taught in schools so students and people in general see an unbiased version of what war is - not the politics, but the day-to-day events. I will watch any documentary I can find to get an unfiltered understanding of war so I better appreciate the freedoms I have because of the volunteers (full time and civilian troops). I gave this documentary 8 stars because I feel like some things might be missing (possible op sec), but I really enjoyed the honesty the film makers demonstrated.",
         "In the documentary Citizen Soldier, Directors David Salzberg and Christian Tureaud deliver an astonishing film about the Oklahoma National Guard's deployment in one of the harshest regions of Afghanistan. This film transcends the boundaries of a typical military film by using footage from helmet cameras to provide audiences with an immersive look at life and war overseas. As I watched from their perspectives, I couldn't help but feel like I was a part of their fight. Audiences get to see seemingly ordinary citizens transform themselves from strangers into a family of brave men and women known as \"Citizen Soldiers\". It amazed me to see what these men and women experience while deployed. They're thrown into hostile environments and must deal with adversity as a team. The most moving part of this film was watching these real people, in real combat, willing to put their lives on the line for their fellow soldiers. Through all of the victories and losses, they form an unbreakable bond that lasts long after they return home to their civilian lives. Not only is Citizen Soldier a moving documentary, but I think it's also an outstanding way to show appreciation to these soldiers, and all citizen soldiers. It's a fantastic film and I highly recommend it.",
         "My favorite thing about \"Citizen Soldier\" is its originality and honesty. This documentary film was not about politics or promoting any kind of agenda and I really appreciated the raw honesty with which the movie unfolded. The incredible directors, David Salzberg and Christian Tureaud, really let the story be told by the men and women who were serving our country as part of the National Guard. The story the soldiers told was filled with a strong sense of brotherhood and connection with each other. Made me feel proud of our National Guard and the people who had to unexpectedly serve our country with bravery and valor in its time of need.",
         "Citizen Soldier is a fantastic documentary that fully immerses you in the American National Guard experience, showing both the soldier's mundane daily activities as well as the terrifying realities of combat. Following an infantry-brigade's tour through Afghanistan, the film brilliantly displays the bond that is forged between men and women serving their country: a bond that gives them the strength to keep fighting. In addition to all this, the film smartly follows its' brave subjects after the war, allowing viewers to get a feel for soldiers' struggles adjusting to civilian life. The film is a powerfully moving tribute to American soldiers that respectfully shows what they sacrifice for this nation without being sappy about it. I would highly recommend this documentary. It doesn't matter if you are a bleeding heart liberal or a hawkish conservative: this film is that good.",
         "The film Citizen Soldier is a great, war documentary that follows a brigade in the Oklahoma National Guard while deployed overseas for 96 days in Afghanistan. My favorite aspect of this film and what I think makes it different from most documentaries of it's kind, is the unique way it was shot. With only the use of GoPros and cell phones, the soldiers film themselves as they journey through one of the most dangerous battlefields in Afghanistan. I thought that the directors, David Salzberg and Christian Tureaud, took an interesting approach by choosing to have the soldier's film it from their point of view allowing me to feel fully immersed in the film. Through the personal interviews and intense footage I was able to not only see what it is like to be on the front lines but what it really means to have a band of brothers willing to sacrifice their lives for you. Although they may go home to somewhat normal civilian lives, these men and women are forever changed. This is a touching tribute to our troops that everyone should see if they haven't already.",
         "Citizen Soldier takes us right into the heart of the battle with the Oklahoma National Guard, in a true immersive experience. Unlike many documentaries that I have seen, filmmakers David Salzberg and Christian Tureaud employed the use of helmet-cams to gather footage from the first person perspective, truly capturing the bravery and camaraderie of our men and women currently serving in Afghanistan. We are able to see and hear everything that they are in those moments, from bullets flying and shattering their glass covers to just having conversations about their lives in humvees as they navigate the terrain. This raw action footage, intercut with interpersonal stories, sends a strong message about brotherhood overseas. These courageous soldiers share a bond like no other and that is conveyed by their language with each other in the field and in the interview segments. They are serving overseas to protect our country, but it is clear that their priority while fighting on the front-lines is to protect each other and make sure their brothers make it home safely to their families.",
         "This is real and these are real guys fighting and digging in ... some making the ultimate sacrifice and their brothers in arms grieving afterwards. Citizen Soldier is an important film, trying to tell at least some of the heroic story of our communities' guard and reserve units who go out and do the job that few are willing to do, yet we all ultimately benefit from.",
         "I don't give many films, of any sort, a 10 out of 10. For this I will make an exception. This movie is a real inside look at what our leaders today ask of men, in this case a unit from the OK National Guard. I can attest from first-hand experience that Iraq, the vast majority of burden was put on National Guard units from all over the country. These are not professional soldiers, these are men who volunteered to do what most others would not: Be both a member of society and a warrior. This duality does make for a different type of military unit; Different, but not necessarily less competent. So seeing this Oklahoma Guard unit fighting in the hills of Afghanistan, suffering and losing men on the pointy end of the \"GWOT\" spear did not shock to me. I know this is what these folks do, I've seen them do it. What is shocking is how this film was made - it appears that several soldiers had cameras (GoPros?) mounted to their helmets, so very nearly every facet of the \"soldier experience\" is captured. This includes horseplay, boredom, stress, fear, pain and horror. Seeing young, hard men sobbing with grief over fallen comrades isn't easy, but we, the American voter, sent them there and put them in harms way. We owe it to them to see what the cost of our choices are. Considering the equipment used, the film quality is amazing and the editing is, to my eye, top notch; The intelligent use of subtitles for dialogue that is hard to comprehend (particularly radio traffic) and the very subtle use of music is well executed. Whoever was involved with this really knew what they were doing. I'm shocked that I had not heard of this film until it appeared on Amazon, as I am shocked that it isn't reviewed higher on IMDb. I suspect that might be due to how hard this movie is to watch. Seeing a mother bend over the flag-draped casket of her son broke me, and I've seen this stuff first hand. Not everyone likes to cry at the movies, I suppose. So see this, if you can. It is not an easy thing to watch but I think we owe it these men to at least get a glimpse of what we ask of them."
      ],
      "genres": [
         "Documentary",
         "Action"
      ],
      "productionCompanies": ["Strong Eagle Media"],
      "summaries": ["CITIZEN SOLDIER is a dramatic feature film, told from the point of view of a group of Soldiers in the Oklahoma Army National Guard's 45th Infantry Brigade Combat Team, known since World War II as the \"Thunderbirds.\" Set in one of the most dangerous parts of Afghanistan at the height of the surge, it is a heart-pounding, heartfelt grunts' eye-view of the war. A modern day Band of Brothers, Citizen Soldier tells the true story of a group of Soldiers and their life-changing tour of duty in Afghanistan, offering an excruciatingly personal look into modern warfare, brotherhood, and patriotism. Using real footage from multiple cameras, including helmet cams, these Citizen Soldiers give the audience an intimate view into the chaos and horrors of combat and, in the process, display their bravery and valor under the most hellish of conditions."],
      "budget": 500000
   },
   "movielensId": 163615,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-08-05",
      "dvdReleaseDate": null,
      "directors": [
         "David Salzberg",
         "Christian Tureaud"
      ],
      "runtime": 105,
      "movieId": 163615,
      "title": "Citizen Soldier",
      "mpaa": "",
      "actors": [
         "Jordian Alex",
         "James Tyler Brown",
         "Jared Colson",
         "Colt Floyd",
         "Eran Harrill",
         "Nathan Kruse",
         "Raymond Viel",
         "Erik Wolff",
         "Martin Byrne",
         "Justin Smith"
      ],
      "imdbMovieId": "4911408",
      "originalTitle": "Citizen Soldier",
      "genres": [
         "Action",
         "Documentary"
      ],
      "youtubeTrailerIds": [
         "-d-BcfRGl7c",
         "bGEvSfAEvWo"
      ],
      "plotSummary": "CITIZEN SOLDIER is a dramatic feature film, told from the point of view of a group of Soldiers in the Oklahoma Army National Guard's 45th Infantry Brigade Combat Team, known since World War II as the \"Thunderbirds.” Set in one of the most dangerous parts of Afghanistan at the height of the surge, it is a heart-pounding, heartfelt grunts' eye-view of the war. A modern day Band of Brothers, Citizen Soldier tells the true story of a group of young Soldiers and their life-changing tour of duty in Afghanistan, offering an excruciatingly personal look into modern warfare, brotherhood, and patriotism. Using real footage from multiple cameras, including helmet cams, these Citizen Soldiers give the audience an intimate view into the chaos and horrors of combat and, in the process, display their bravery and valor under the most hellish of conditions.",
      "tmdbMovieId": 406231,
      "avgRating": 3.4,
      "releaseYear": "2016",
      "numRatings": 5,
      "posterPath": "/uqXFqZT1cT3Q6fHYilPSnBUJAp5.jpg"
   }
}