{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "german",
            "id": 2349
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "german agent",
            "id": 209305
         }
      ],
      "imdb_id": "tt0035114",
      "video": false,
      "title": "Nazi Agent",
      "recommendations": [],
      "backdrop_path": "/rU4fAw3fCqEXxphgn0ulRlAsPV3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Otto Becker / Baron Hugo Von Detner",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125069",
               "name": "Conrad Veidt",
               "profile_path": "/AkRjkTKXIUoPlczpPegaiFeg4lu.jpg",
               "id": 3001,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Kaaren De Relle",
               "gender": 1,
               "credit_id": "52fe4721c3a36847f812506d",
               "name": "Ann Ayars",
               "profile_path": "/mJnMFwraBXp7Hntu4Y7e1hAXfED.jpg",
               "id": 138145,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Fritz",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125071",
               "name": "Frank Reicher",
               "profile_path": "/cKBUmGq3LUnR4BsaaNFDpbUTNCn.jpg",
               "id": 3245,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Miss Harper",
               "gender": 1,
               "credit_id": "52fe4721c3a36847f8125075",
               "name": "Dorothy Tree",
               "profile_path": "/fACHDRtL7PiuLQQanDj8O1NvBNq.jpg",
               "id": 96141,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Professor Sterling (as Ivan Simpson)",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125079",
               "name": "Ivan F. Simpson",
               "profile_path": "/m2UzOBSAe71qpm7CiWJu7IcKTLu.jpg",
               "id": 132536,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Ludwig",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f812507d",
               "name": "William Tannen",
               "profile_path": null,
               "id": 29626,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Kurt Richten",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125081",
               "name": "Martin Kosleck",
               "profile_path": "/m2uXKNNtWmcO8UY9J5xTjTPtYyL.jpg",
               "id": 29142,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Joe Aiello",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125085",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Arnold Milbar",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125089",
               "name": "Sidney Blackmer",
               "profile_path": "/ijI8tIlurlyyVTZYgZvoiifrMi3.jpg",
               "id": 12022,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Brenner",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f812508d",
               "name": "Moroni Olsen",
               "profile_path": "/20iaFC3qnVA9t77SFYnjVuJas1P.jpg",
               "id": 18586,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Grover Blaine McHenry",
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125091",
               "name": "Pierre Watkin",
               "profile_path": "/s9Z72wx6hJ2BwG6feVC6s4TcWrb.jpg",
               "id": 30216,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4721c3a36847f8125041",
               "name": "Jules Dassin",
               "profile_path": "/v7DZOtLE1i6S7UjLNjkHq85JPEu.jpg",
               "id": 14227,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125047",
               "name": "Paul Gangelin",
               "profile_path": null,
               "id": 129083,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4721c3a36847f812504d",
               "name": "John Meehan Jr.",
               "profile_path": null,
               "id": 138143,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125053",
               "name": "Lothar Mendes",
               "profile_path": null,
               "id": 138144,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125059",
               "name": "Irving Asher",
               "profile_path": null,
               "id": 115373,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4721c3a36847f812505f",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4721c3a36847f8125065",
               "name": "Frank E. Hull",
               "profile_path": null,
               "id": 70982,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "592c94459251417bff001e02",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.239051,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47155,
      "vote_count": 1,
      "budget": 0,
      "overview": "The story of identicial twin brothers -- one loyal to Nazi Germany and the other a loyal American who get involved with Nazi agents.",
      "similar": [
         954,
         369885,
         1771,
         424,
         14574,
         289,
         637,
         228150,
         37724,
         36955,
         5925,
         2253,
         16869,
         213,
         646,
         681,
         374720,
         36669,
         49517,
         339259
      ],
      "original_title": "Nazi Agent",
      "runtime": 83,
      "poster_path": "/zW8drxft96EQTQdZeUAJUvzYSrl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1942-03-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The Girl and the Gestapo! Hidden enemies! It's thrilling!!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jules Dassin"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Paul Gangelin",
         "John Meehan Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035114/",
      "coverLink": null,
      "actors": [
         "Conrad Veidt",
         "Ann Ayars",
         "Frank Reicher"
      ],
      "reviews": [
         "Conrad Veidt's career in European (and American) film from 1919 - 1939 was one as a notable star. He had played Cesar the Sonabulist in THE CABINET OF DR. CALIGARI in 1919, and been a star ever since. In the silent film period it was easy for him to have an international audience as Gwynplaine in THE MAN WHO LAUGHS and as King Louis XI of France in BELOVED ROGUE (with John Barrymore). But he was anti - Nazi and Veidt left Germany in 1933 and settled in England, where he remained a star. His last film in England of greatness was as the evil vizier Jafar in THE THIEF OF BAGHDAD. Then he went to Hollywood. Most Americans recall him for his American films, although he did not make many in his last three years (1940 - 1943). These included a comic villain in WHISTLING IN THE DARK, a selfish Swedish scoundrel in A WOMAN'S FACE, and Nazis in CASABLANCA (his best recalled performance - as Major Strasser), ESCAPE, and ALL THROUGH THE NIGHT. Twice he portrayed anti-Nazi Germans: ABOVE SUSPICION (where he is aiding Joan Crawford and Fred MacMurray, and the villain is Basil Rathbone!), and this film - probably the most interesting of the movies he made in Hollywood. The plot is simple. Veidt plays twin brothers, one of whom has been living in the U.S. since World War I, having gotten sick of the militarism and racial crap at home. The younger brother remained behind as a dedicated careerist Nazi. The younger brother has been sent to the U.S. as a \"diplomat\" but in reality to head a sabotage ring. He uses some of his agents to locate the older brother, and blackmail him into acquiescing into working for the Vaterland again. The older brother is forced by circumstances (relatives in Germany may be executed or tortured if he refuses). But when he learns of the various sabotage acts planned, and when the ring members kill one of his closest friends, the older brother fights back. He confronts and kills the younger brother, and pretends he is the younger brother. Then he proceeds to destroy the sabotage ring. Veidt's Nazis were quite convincing, as he obviously based them on the people he met in Berlin in the 1920s and 1930s. Major Strasser, for example, is very businesslike - see how he confronts Rick with his file at the start of CASABLANCA and shows little concern when Rick starts reading it - and usually intelligent. He is also ready to turn into a subtly deadly threat, as when he tells Elsa about the cheapness of life in Casablanca. So the young careerist is quite true to form. But the older brother is fascinating. The issue of the \"good German\" was difficult to get across after 1941, as most Americans saw Hitler's Germany as a real, viable threat. It was rare, in the movies of those years, to think of making a film about Germans who were decent (it was actually easier to show Italians who were decent - see Forunio Bonanova's Italian general in FIVE GRAVES TO CAIRO). If a German was good or sympathetic, he or she might have been Jewish. But Veidt's two brothers are upper crust junkers. They are part of the establishment. The older brother was in the army (unlike the younger one), so he knew what was expected of the German nobility. But he got to dislike the arrogance of the class towards all others. So he fled his native land to escape what he hated. Veidt's not the only good German in the film. For every younger brother, and Martin Kosleck, and Deborah Tree, there is a Frank Reicher and Anna Ayars who supports the decency wiped away by the Nazi regime. Veidt's older brother fall for Ayars, and in one sweet moment one sees what the Nazis have destroyed. They are seated in a car alone, and have put on the radio. The moon is out, and it is a moment for love-making. But the radio plays a piece by Felix Mendelsohn (who was Jewish, and whose music was forbidden by the Nazi regime in Germany). Ayars, sadly, says \"Verboten.\", and starts turning it off. Veidt gently stops her and says, \"Just this once.\" They cuddle listening to the music. Veidt also demonstrates a trait which (oddly enough) he can share with the Nazi Kosleck. The older brother's hiding spot in America was discovered by Marc Lawrence, who has sold his services to the Nazis. But later (after the older brother has begun impersonating the dead younger one), Lawrence returns to squeeze more money out of his German employers. Kosleck tells this to Veidt (and it is obvious that Kosleck is disgusted by this greedy American). Veidt says he'll speak to Lawrence. He does open the safe and give Lawrence the money without a word. Then after Lawrence puts the money in his pocket, Veidt grabs him around the neck and with a fierce look in his eye tells him never to ask for another extra cent beyond his salary again if he knows what is good for him. Lawrence is thoroughly frightened of his \"employer\" after that - and the viewer actually sides with Veidt at that moment even if he had been the younger brother instead of the older one. NAZI AGENT was a programmer, but it shows what would have been Veidt's ability to play a hero in American films. If he had survived World War II he probably would have been a star along the lines of his French contemporary Charles Boyer, playing good characters as well as bad ones. He did not have the fortune to survive, but we know what he might have been like.",
         "Nazi Agent presents a rare opportunity to see the great Conrad Veidt play a lead role (as twin brothers with opposite personalities and values, no less) in a well-preserved sound film with a solid, serious theme and lasting value. Although this is obviously a \"B\"-level production made on a low budget, the brisk direction by Jules Dassin, the tight and literate script and some very good supporting players, make it as satisfying as many an \"A\" effort. Otto is a gentle expatriate German bookseller whose quiet life in America is disrupted when his Nazi twin, Baron Hugo von Detner, threatens to reveal his illegal immigrant status to the US authorities unless he allows the Nazi spy network to use his bookstore as a message center. Otto desolately goes along for a while but when he finally resists, Hugo comes to shoot him. They struggle. Otto shoots Hugo instead, then assumes his identity and proceeds to sabotage the saboteurs, who include the memorable Martin Kosleck, whose presence in many films from this time screamed \"Nazi.\" With his marionette-like features, lacquered hair and fey efficiency, he was a top scene stealer. Another excellent performance comes from the prolific Frank Reicher as Fritz, Hugo's aging valet who quickly realizes that his master isn't really his master. But it's really Veidt's movie, playing warm and cold, frightened and bold, kind and cruel \u0096 all with shading, subtlety and expertise. The movies suffered an irreparable loss in April 1943 when this man died on a California golf course at the age of 50. This quietly powerful film is an adventure of ideas and ideals. The ending, though not as well shot as it might have been, is both stirring and heartbreaking.",
         "This was a nice little programmer from the '40s that played the lower half of double-features. CONRAD VEIDT is interesting (as always) as a pair of identical twins, one of whom is a Nazi agent. When the bad brother is killed, the good brother takes his place and has to convince everyone that he is the loyal Nazi. Only gradually do a couple of people come to realize who the man really is. Veidt excels in the kind of role he always fared well in, especially riveting as the bad twin. Not the leading man type, he nevertheless manages to hold the screen with his histrionic finesse at playing either smooth villains or men with deeper convictions of honor. ANNE AYARS is the lovely romantic lead and the supporting cast, which includes MARTIN KOSLECK as a fierce Nazi (a role he's played so often and so well) is more than adequate. Good entertainment of its kind, it's a low-budget film directed by Jules Dassin.",
         "In 1926 Veidt made another film in which he played a good brother and a bad brother--The Brothers Schellenberg. They both came from an educated but penniless class; the good brother founded a commune and the bad one was a ruthless, social-climbing capitalist. The good brother, as I recall, had a beard and wore rumpled clothes, while the bad one was clean-shaven and and had an elegant wardrobe of evening clothes.... In Nazi Agent, the two brothers have similar physical distinctiveness but now they of the landowning class: the gentle academic driven from Germany by the Nazi aversion to historical truth, and the potently Nazi German Consul in \"State City.\" The twist is that the good brother must disguise himself as the bad brother in order to make his contribution to the anti-Nazi effort by breaking up a nest of spies. It seems to me that the twin-substitution plot usually involves women, not men--with the notable exception of Dead Ringers...? Veidt gets to do what Jeremy Irons did, play twin A pretending to be twin B in such a way that the audience, but not twin B's associates, sees the difference. Even old Fritz, who has known the twins from childhood, recognizes Otto by a scar, not by his manners. The film seems to have been made before Pearl Harbor and released afterwards; in the world it depicts, Canada has joined the war but the U.S. is still on somewhat friendly terms with Germany. Another viewer commented that Veidt is not sexually attractive. Hmm. I think that the character he plays in this film is not supposed to be very sexually aggressive--the big romantic scene does not even involve a kiss, and the bookseller twin has been up to this time someone who is more interested in rare stamps than in women. But one might check out his two films for Michael Powell, or Escape, or A Woman's Face, in all of which his character is supposed to be, and is, extremely sexually attractive. It is interesting that in both Escape and A Woman's Face he at first appears as sexy and charming, in different ways, a real Prince Charming for the very different heroines of the two films. Then, towards the end of the films, he reveals himself for the ruthless Nazi he is, showing extreme cruelty of various kinds. So although Veidt could turn on and off the sexiness and otherwise vary his characters, he made three films in this period in which he is the good German (OK, Scandinavian in A Woman's Face) and the bad Nazi: Escape, A Woman's Face, and Nazi Agent. By this time, I believe, he was a British citizen, contributing generously to the war effort, but it's interesting that he was not playing The Hun who tosses babies out the window, as Von Stroheim did during WWI, but two men, one who loves music and women and knowledge, the other who sees Nazism as the only path to success and riches, and who has been utterly corrupted by it.",
         "Conrad Veidt plays twins, one good, one evil, in \"Nazi Agent,\" a 1942 film directed by Jules Dassin. Veidt plays Otto Becker, a bookstore owner, and his twin brother, Baron Hugo von Detner, who heads up the German consulate in the U.S. Hugo wants to use Otto's bookstore as a message drop for his agents. Otto is in the country illegally, so with Hugo hanging this over his head, he has to go along. When a fight ensues between the two, Hugo is killed. Otto takes his place in the consulate and as head of the spy ring. Veidt is very good in both roles, that of a sweet, generous man, and the usual Veidt persona - a cold, authoritarian, but charming Nazi. The supporting cast includes Ann Ayars, Dorothy Tree, Frank Reicher, and Martin Kosleck. Entertaining. I did wonder about why Otto made the decision that he did at the end of the film, though.",
         "After fleeing to the United States because of the repressive Nazi government in Germany, Conrad Veidt made quite a career for himself playing evil Nazis in American propaganda films dedicated to boosting support for the war effort. In this case, however, Veidt plays TWO roles! And, the film goes a direction I never had anticipated. The film begins with Veidt working for the German consulate in America as a leader of a unit of spies. He has a brother who's lived in the US for several years because this brother hates the Nazis. Surprisingly, the nice Veidt gets a visit from his evil twin with the consulate--and it's to blackmail the nice one into working for the Nazis. This continues for a bit, but when the evil Veidt pushes too far, his patriotic and America-loving twin kills him--and assumes his identity in order to undermine the Reich's efforts to destroy America. Where all this goes next, you'll need to see for yourself--but it was surprisingly sentimental and understated. Well made and interesting compared to the average propaganda film--and made a bit better since Veidt was such an excellent actor. Worth seeing.",
         "(Some Spoilers) Checking the production dates for the movie \"Nazi Agent\" I noticed that it was finished filming on December 16, 1941 just five days after Germany's Fuhrer Adolph Hitler declared war on the US. That was in accordance with Hitler's Germany military alliance with Japan that bombed Pearl Harbor just four days earlier. This would make the movie \"Nazi Agent\" the first WWII film produced by a Hollywood studio that was released when the US was actually at war with the Nazi Regime! Unlike the many other anti-Nazi Hollywood made films, like \"Confession of a Nazi Spy\", that were released before the US was even at war with Germany. Thus making them subject, by anti-war and US isolationists groups, to accusations of being nothing more them warmongering propaganda in an effort, by Hollywood, to get the natural US into the war in Europe on the side of Great Britain and later the USSR. The film has kindly bookstore owner and stamp collector Otto Becker, Conrad Veidt, try to start a new life in the US after he was forced to flee his homeland-Germany-after the Nazi's took over. Living the American dream Otto's life is turned upside down when his brother Hugo, also played by Veidt, who's a die in the wool Nazi pops into his house. Hugo a German diplomat is working undercover to damage US shipping in the Atlantic in an effort to get Great Britain, who at the time is getting military aid from the natural US, to give up its fight against the Nazis. Playing alone with Hugo's demands who's blackmailing his brother, in having him possibly deported back to Germany if he doesn't go along with him, Otto tries to tip off the FBI in what Hugo and his fellow Nazi's in America are up to. This sham on Otto's part falls apart when Hugo confronts him in his home and pulls a gun on him in order to get him back into line. Hugo who's killed in the struggle with Otto has his brother, his identical twin, take over Hugo's identity and infiltrate the Nazi spy & sabotage ring that he was in charge of. Working on the inside Otto uses his disguise as Hugo to stymie the Nazi's in their attempt, through short-wave radio contact, to have their fleet of U-Boats in the Atlantic sink US shipping. Otto does this by secretly tipping off the authorities to what exactly the spy & sabotage ring are planning to do. Not acting like the mindless and comical buffoons as their almost always depicted in most movies made about them at the time the Nazi's that includes Otto's assistant in the German consulate Kurt Richten, Martin Koslek,realize that there's a spy in their mist and start to zero in on Otto. Caught with his hands in he cookie jar Otto tries to save himself in implicating, for what he actually did, US hoodlum-who's working for the Nazis-Joe Aiello (Marc Lawrence) in the stopping of the US supply ship SS Farrington from parking itself in the locks of the Panama Canal. The Nazis planned to use the explosive laden SS Farrington, with an explosive timer hidden in it, to blow the canal sky high! Thus cutting off the US Pacific and Atlantic fleets from each other in the event of the US entering into the war. ****SPOILERS*** With his cover blown Otto could have just taken off to the Federal Authorities for protection but instead agreed to go back to Nazi Germany, and certain death, to save his lover-who works for the German consulate in New York- French fashion designer Karren De Relle, Anne Ayars. You see Karren wasn't really a Nazi but was forced, with her family back in Nazi occupied France, to go along with them in order to save both her and her families lives or, even worse, from being sent to a Nazi concentration camp. It was this quite an courageous act on Otto's part, willingly giving up his life to save the one that he loves, that sets him apart from the the usual blood and guts heroes that Hollywood depicted in it's movies in fighting WWII, at home as well as abroad, all over the globe. This act of unselfish courage made Otto the most unique and believable, as well as tragic, of all war or peace time movie heroes coming out of Hollywood.",
         "Conrad Veidt plays two roles here, as a self-assured Nazi and a mild-mannered Ally. The brothers confront each other and the Nazi is murdered, but now the surviving brother must impersonate the Nazi in order to deflect attention from his crime and also to gather information that can help the Allies. This is an intense movie to watch, and thanks to being made by MGM it is very polished. I saw it screened at Cinevent in 2013 and remember it vividly a year later. Conrad Veidt could have ruined the movie if he were a lesser actor, but he handles both parts remarkable and never gives the audience a reason to doubt him.",
         "I saw this movie as a teen (they used to show it on T.V.) a lot and always loved it. Conrad Veidt plays twins - good versus evil. I taped it last year (2002)from Turner Classic Movies (after calling them and asking them to play it). It's still a wonderful movie. Conrad Veidt is a Nazi you love to hate. (Casablanca, Escape, A Woman's Face, All Through the Night) Playing twins, you see the angst in the good brother (Otto Becker) knowing his twin (Herr Baron) is a Nazi trying to destroy the U.S. - precisely why Otto left Germany. Herr Baron seeks out his brother in N.Y. to use his bookstore as part of his Nazi operation. Of course, Otto refuses to no avail and winds up a powerless pawn. He lives above the store under constant surveillance. One night, Herr Baron gets lonely and pays Otto a visit alone. An argument/struggle ensues, and Otto kills the Baron. Thinking fast, he decides the only way out is to impersonate his brother to save our country. He manages to fool everyone, except for the Baron's man-servant Fritz who came over with him. Otto's cover is blown when he emerges from the shower and Fritz spots a tell tale scar on his back. When Otto emerges in a bathrobe, Fritz has a glass of warm milk waiting for him, as in the old days. Otto's fears are unnecessary as Fritz' loyalty to him is undying. Otto succeeds in foiling all Herr Baron's plans but subsequently pays the price when he has to give himself up in order to save someone's life. Watch his face when he is being deported back to Germany and he passes the Statue of Liberty. The pain and tears he fights back are real.",
         "I saw that there was a couple of Nazi films on TNT last night and decided to give them a viewing. Sometimes these old black and whites can really have interesting stories. This was true to my expectations. This was a Jules Dassin film. He was one of the most important directors in post-WWII America. Unfortunately he got caught up in the Red Scare led by Senator McCarthy and was blacklisted. he moved to Europe, where he continued to make movies. His most influential film was the heist movie Rififi, which inspired a genre of movies including Ocean's Eleven and Mission: Impossible. The movie stars Conrad Veidt, who is himself a very interesting character. Most movie goers would remember him as Gestapo Maj. Strasser in the classic Casablanca. This is interesting because he was a staunch anti-Nazi who was himself chased out of Germany under threat of assassination. He was to play Dracula in 1931, but Bela Lugosi got the job. His performance in The Man Who Laughs, was used as the basis for \"The Joker\" in the early Batman. Veidt give a good performance as a twin whose brother is a Nazi agent. he kills him and takes his place to fight against the Nazi underground in America. It is not a terribly exciting film, but it was suspenseful, and a chance to see one of the great American directors and a great German/British actor.",
         "Remember the 1964 Bette Davis thriller-Dead Ringer? In that one, Bette killed her identical twin sister who was quite bad and assumed her identity and by the end went on trial for killing the evil sister's husband as everyone thought she was the lady. I see almost the same premise in this 1942 film with the exception that the horrible Nazis are involved. Conrad Veidt did not look well in this film and in fact, the following year, he succumbed to a coronary at age 50. In this film, he shoots his Nazi brother and assumes his identity in order to destroy the spy ring. Ironically, in the end, he is returned to Germany for whom he is really is. The reason why this occurs shall remain a secret to you until you view this film. The story is definitely one that is intriguing. It will hold your interest in the never ending saga of good triumphing over evil. The end was just too ironic. We had a real American hero here.",
         "As Nazi Agent came out of MGM you might get fooled as even their B pictures such as this look like A films. The lack of any stars would give it away, but this is a great example about how MGM could make any of its product look like quality. Of course it helps here that Conrad Veidt gives a pair of performances, come to think of it three of them in this film. First as American professor and naturalized refugee from Nazi Germany, second as the new German Consul twin brother and fanatical Nazi and third as the American brother impersonating the Nazi. It all starts when Nazi Veidt decides to force American Veidt to help with the cause making his place a drop for espionage messages. But the good Veidt kills the bad Veidt and then takes his place at the German consulate and does his own little job of sabotaging the operations. Because of Conrad Veidt this World War II era propaganda flick holds up well still today. In essentially three roles the professor has to tread very carefully to find out who can be trusted. Besides Veidt performances to watch are Marc Lawrence as an Italian gangster working for them and all around rat, Ann Ayars as a French dress designer and Vichy sympathizer who has a change of heart, Martin Kosleck who was always cast as Joseph Goebbels but here is Veidt's ferret faced aide at the consulate and Dorothy Tree as a Nazi agent planted with Professor Veidt. Tree had blacklist problems and never returned to Hollywood, in fact left acting altogether. But this film is really a salute to Conrad Veidt's versatility. The plot is taken somewhat from the Ronald Colman classic The Masquerader, but the ending is straight out of that other Colman film A Tale Of Two Cities. Catch this one when it's on and be prepared to see how well it holds up.",
         "This is a minor motion picture. MGM has put together a fairly simple story of a good German-American who takes the place of his evil twin, who is the German Counsel and runs a spy ring. The good German (Conrad Veidt) worms his way into the nest of evildoers, exposes all of them, is betrayed by a pet canary, and allows himself to be taken back to Berlin for punishment in order to save his girl friend. If the plot sounds implausible, that's because it is. There are some solid supporting players (Ray Teal, Moroni Olsen, Marc Lawrence, Martin Kosleck) but Veidt is no one's idea of a romantic lover. Not with that pinched face and those thin lips that seem to have been painted dark, as if he were a madman who just stepped out of somebody's cabinet. He does the long-haired, bespectacled, pipe-smoking good twin adequately, but his evil twin seems much more natural. Anne Ayars speaks in a way that seems to have been endemic to women in the 1940s. There has definitely been a change in women's supersegmentals. Contemporary women are rapidly losing their vowels, so that \"sure\" becomes \"shr\", which is actually Chinese. I've kind of made fun of the movie but I enjoyed it. It's in black and white, the score is no more than functional, and Jules Dassin has directed unpretentiously. It's not gripping so much as reassuring somehow. It's nice to contemplate a movie made during a time before movies became \"films\", before there were movie critics (except James Agee, who was a Franciscan fool), before movies could be entertaining without being blockbusters and costing a zillion dollars. When you watch this, you can almost smell popcorn.",
         "In one of his last roles, Conrad Veidt plays both the GOOD twin and the EVIL twin, during WW II. The \"bad\" twin tries to talk the \"good guy\" into helping the dark side, but he doesn't want to. According to IMDb, this was released in March of 1942, so just a couple months after the U.S. was dragged into WW II, in December of 1941. Just like the Bette Davis films, or every other \"twins\" movies, one of them poses as the other. Veidt would die quite young at age 50.....heart attack. Mostly slow. Predictable. No big surprises here, but an entertaining WW II film. The suspense of watching him maneuver as he tries to avoid being found out as an imposter. This could have been a Hitchcock, but its not. This was Jules Dassin's second film as director, making him the young age of 31 when the film was made. Not bad.",
         "Conrad Veidt plays twins – Hugo is the bad Nazi German diplomat in the USA who tracks down his kindly brother Otto, a book-store owner. Hugo wants Otto to use his shop as a front for Nazi activity and presents a convincing case as to why he should. However, there comes a point where Otto has to go against his kindly nature and take things into his own hands. The lives of Americans are threatened and he can put a stop to it. It's an interesting spy story that I would have scored more highly if it had a different ending. I felt dissatisfied. Why did the good guy make that decision? Great honour but complete idiocy. The film has a few other unrealistic moments, eg, the idea that the parrot talking could give the game away! Suspend belief and go along with things and the film entertains. What would you rather have – a glass of warm milk in the evening or a glass of brandy? I think I'm evil coz I'd go with the brandy. A final word goes to Bernadene Hayes who pops up as prostitute \"Rosie\". I've just watched \"This Gun For Hire\" (1942) where she pops up as \"secretary\" to an assassination victim. Both times, although her role is brief, she captures the attention. So, she gets a special mention.",
         "Summary: Patriotic But not Soapy *** This review may contain spoilers *** This is the story of twins who may have looked identical and grown up in the same household in pre-WWII Germany, but who are worlds apart, well, in just about everything. One immigrated to America while the other remained in Germany to serve the Nazis. While Otto was kind and caring, loving his adopted country, Hugo was more than eager to carry out Nazi plans to sabotage American interests. It must have been amazingly difficult to produce a movie which shows true patriotism without making the moviegoer roll his eyes. Somehow, most of us seem to have been programmed against such films. But this film was patriotic without being soapy. SPOILER ALERT: The last scene tore at my heart. Okay, the music in the scene was a little too much, but if you'll mute your TV and watch the look on Veidt's face when on the way to his death he sees the Statue of Liberty, well, it made me remember that America really is worth fighting for. I needed to see that movie. Perhaps you need to as well. And how ironic. Conrad Veidt had few opportunities to play anything other than an evil Nazi (this film being one of them). And yet all the while, most of his paychecks were spent to support the allies against the forces of his own native land, Germany! As I read a little about Veidt after watching the movie, I wondered if perhaps this film was the only real opportunity the man ever had as an actor to display his incredibly strong love of freedom.",
         "Directorial Debut for Jules Dassin and it Shows a Talent in the Rough as the Film has Flourishes that Enhance its Low Budget. It has Style. Conrad Veidt is Excellent in what Starts Out as a Dual Role. The Film was Made Early in the Turmoil of the Beginning of WWII and as such was Able to Show a Sympathetic German. The Implausibility of the Story is a Suspension of Disbelief but Nevertheless it is Intriguing and Suspenseful with Good Performances All Around. An MGM B-Movie with Class. Dassin would Dismiss All of His MGM Output in Later Years. Worth a Watch because of the Director and Veidt and for an Early Hollywood Effort to Rally the Citizenry.",
         "Jules Dassin already shows great flair in his first full-length feature film. From the opening montage, you know you're in the hands of a director who has a strong visual and dramatic sense. Conrad Veidt does double duty as two contrasting characters, and pulls it off with aplomb. The supporting cast is also strong. However, NAZI AGENT suffers from a hackneyed and completely implausible script. It relies heavily on coincidence, and on what Roger Ebert would call an \"idiot plot.\" (That's a plot that would unravel early on if even one character would behave logically...in this case, Otto Becker.) The first 20 minutes or so is promising. Even later in the movie there are some nice ideas and plenty of tension. But the overall idiocy of the central concept spoils the effect. Do you believe that a humble old stamp dealer has enough makeup in his office to turn himself into a different character on the spur of the moment, while thugs wait at the bottom of the stairs? Do you believe that anyone would blindly assume the character of a man without having the faintest clue about his job, his colleagues, or who and what he might be expected to know and do? Or that a meek-mannered little man can successfully pose as a cold-blooded Nazi? If you can believe all this, you'll probably give NAZI AGENT a ten.",
         "Conrad Veidt delivers a solid performance as twins--one who is a Nazi in America, and the other who became an American citizen. In this tale of espionage and betrayal, Veidt is convincing as both the evil, scheming brother (Baron Hugo) the passive stamp dealer (Otto). When Otto impersonates his brother, his every move can mean death for his friends or for countless others . This mid-war drama plays on the fears of the time. Released only three months after the terrible attack on Pearl Harbor and the U.S. entry into WWII, when American imaginations could see conspiracies and hidden plots around every corner, \"Nazi Agent\" is, ultimately, a heroic story of self-sacrifice. The final act is unrealistic and overblown, but its feel-good twist no doubt gave American viewers the morale boost they were seeking."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["A story of German-born identical twins (both played by Veidt), one a loyal American and the other, a Nazi official. The American is forced to help a group of German spies, but eventually rebels, kills his brother, impersonates him, and exposes the ring."],
      "budget": 0
   },
   "movielensId": 163863,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-03-01",
      "dvdReleaseDate": null,
      "directors": ["Jules Dassin"],
      "runtime": 83,
      "movieId": 163863,
      "title": "Nazi Agent",
      "mpaa": "",
      "actors": [
         "Conrad Veidt",
         "Ann Ayars",
         "Frank Reicher",
         "Dorothy Tree",
         "Ivan F. Simpson",
         "William Tannen",
         "Martin Kosleck",
         "Marc Lawrence",
         "Sidney Blackmer",
         "Moroni Olsen",
         "Pierre Watkin"
      ],
      "imdbMovieId": "0035114",
      "originalTitle": "Nazi Agent",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of identicial twin brothers -- one loyal to Nazi Germany and the other a loyal American who get involved with Nazi agents.",
      "tmdbMovieId": 47155,
      "avgRating": 3,
      "releaseYear": "1942",
      "numRatings": 1,
      "posterPath": "/zW8drxft96EQTQdZeUAJUvzYSrl.jpg"
   }
}