{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0054008",
      "video": false,
      "title": "Fighting Delinquents",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sadao Matsudaira",
               "gender": 0,
               "credit_id": "5443d375c3a3683df2005151",
               "name": "Kôji Wada",
               "profile_path": null,
               "id": 21502,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kazuko Izeki",
               "gender": 0,
               "credit_id": "5443d383c3a3683e0100504c",
               "name": "Mayumi Shimizu",
               "profile_path": null,
               "id": 1003173,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kanjuro Mizoguchi",
               "gender": 2,
               "credit_id": "5443d3900e0a26633300549c",
               "name": "Eitarô Ozawa",
               "profile_path": "/xWAn0r6pD2nbw3h7gcue9lmWvUI.jpg",
               "id": 97203,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Miyo",
               "gender": 0,
               "credit_id": "5443d39b0e0a26633000525d",
               "name": "Yoshiko Nezu",
               "profile_path": null,
               "id": 1375611,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Yuki Maehara - Nanjo's Secretary",
               "gender": 0,
               "credit_id": "5443d3a8c3a3683e01005050",
               "name": "Emiko Azuma",
               "profile_path": null,
               "id": 17541,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ikuyo Matsudaira",
               "gender": 0,
               "credit_id": "5443d3b3c3a3683e01005053",
               "name": "Chikako Hosokawa",
               "profile_path": null,
               "id": 581143,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Uchiyama",
               "gender": 0,
               "credit_id": "5443d3bfc3a3683e0e00509c",
               "name": "Toppa Utsumi",
               "profile_path": null,
               "id": 134297,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "The Person in Charge of the Accident",
               "gender": 0,
               "credit_id": "5443d3cdc3a3683dfb005054",
               "name": "Hiroshi Hijikata",
               "profile_path": null,
               "id": 1200869,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sanshiro Izeki, clan retainer",
               "gender": 0,
               "credit_id": "5443d3d90e0a26633000526b",
               "name": "Kaku Takashina",
               "profile_path": null,
               "id": 548041,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "Kodaira",
               "gender": 0,
               "credit_id": "5a3c21de0e0a265f7702e276",
               "name": "Saburo Hiromatsu",
               "profile_path": null,
               "id": 551804,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Nanjo - Kyokuto Kanko CEO",
               "gender": 0,
               "credit_id": "5443d3f0c3a3683e0e0050a8",
               "name": "Hiroshi Kondô",
               "profile_path": null,
               "id": 138426,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Sanpei",
               "gender": 0,
               "credit_id": "5443d3fdc3a3683e0e0050ab",
               "name": "Yasuhiro Kameyama",
               "profile_path": null,
               "id": 1375613,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Shige",
               "gender": 0,
               "credit_id": "5443d409c3a3683e05005036",
               "name": "Hajime Sugiyama",
               "profile_path": null,
               "id": 1375614,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Chikunen (as Naoyoshi Ozawa)",
               "gender": 0,
               "credit_id": "5443d4160e0a2663330054b0",
               "name": "Naoyoshi Ozawa",
               "profile_path": null,
               "id": 1375615,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5443d422c3a3683e0e0050b8",
               "name": "Ryusei Ito",
               "profile_path": null,
               "id": 1176901,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49f99251416c910bef2d",
               "name": "Seijun Suzuki",
               "profile_path": "/fGZPvvEYaO1RLdW4PEcYp3IJcOW.jpg",
               "id": 82461,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5443d43fc3a3683e0100506a",
               "name": "Kenzaburo Hara",
               "profile_path": null,
               "id": 1375616,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5443d44c0e0a26633a0052f7",
               "name": "Gan Yamazaki",
               "profile_path": null,
               "id": 21493,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "595eaee8c3a36828a10a0203",
               "name": "Hideo Koi",
               "profile_path": null,
               "id": 21494,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595eaef19251415a400600cd",
               "name": "Seitarô Ômori",
               "profile_path": null,
               "id": 1846294,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "595eaef7c3a3680d59064ca6",
               "name": "Kazue Nagatsuka",
               "profile_path": null,
               "id": 82469,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "595eaf01c3a36828fc08345b",
               "name": "Akira Suzuki",
               "profile_path": null,
               "id": 70632,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "595eaf089251410c5608a58c",
               "name": "Akiyoshi Satani",
               "profile_path": null,
               "id": 1439863,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "595eaf10c3a368265d08c0ce",
               "name": "Shôgorô Nishimura",
               "profile_path": null,
               "id": 1038477,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "595eaf19c3a36828a10a0245",
               "name": "Toshio Nakamura",
               "profile_path": null,
               "id": 1502217,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.001648,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 88528,
      "vote_count": 0,
      "budget": 0,
      "overview": "This rarely seen gem from master Suzuki casts teenage heartthrob Koji Wada as a young misfit who suddenly finds himself the unwitting pawn in an escalating family feud that ultimately leads to tragedy.  Lean, mean, and stylish as always, this tale of youth-gone-wild is both vibrant and touching. Suzuki contrasts tranquil glimpses of traditional regional life with the emergence of the new rock 'n' roll youth culture and the greed and seething cynicism of encroaching Westernism.  Also released under the title \"Go To Hell, Hoodlums!\", this is a melodrama as colorful, shocking, and exhilarating as one would come to expect from Japan's master filmmaker.",
      "similar": [],
      "original_title": "くたばれ愚連隊",
      "runtime": 80,
      "poster_path": "/qH1YkfKWgpuWbfJMhHsgXqGF8yN.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
         "name": "Nikkatsu",
         "id": 955,
         "origin_country": "JP"
      }],
      "release_date": "1960-11-23",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Seijun Suzuki"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Kenzaburo Hara",
         "Iwao Yamazaki"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0054008/",
      "coverLink": null,
      "actors": [
         "Kôji Wada",
         "Mayumi Shimizu",
         "Eitarô Ozawa"
      ],
      "reviews": [
         "Fighting Delinquents (1960) - also known as Go to Hell, Roughnecks! - is an odd film from director Seijun Suzuki, one that exists almost entirely within the context of the time in which it was created, with none of the audacious visual experiments or notions of narrative transcendence found in later films, like Tokyo Drifter (1966) and Branded to Kill (1967). Instead, the filmmaker offers up a largely straight melodrama with obvious emphasis on the teenage demographic, with the film juxtaposing traditional Japanese values such as honour, family and nobility, against the more contemporary, late 60's ideas of pop art, rock music, young love and defiance. There's also a criminal aspect, with the central character taking on a devious Yakuza syndicate who plan to take over the quaint, island community owned by his family, with the eventual confrontation presented by this set up delivered in a very spirited but sanitised series of fight scenes, with none of the gunplay or stylised violence found in the two better films aforementioned. However, despite the lack of that typically Suzuki sense of stylistic overload, the film remains a great deal of fun; brimming with youthful energy, strong performances and a plot that is immediately comprehensible. It also benefits from a touching, if overly melodramatic final that seems to underline the film's wild spirit and freewheeling sense of joie de vivre. It might be notable to some viewers, already familiar with Suzuki's later work, for a number of early signifiers to the style that would ultimately follow. Firstly, the theme song is very much an early version of the catchy tune eventually heard in Tokyo Drifter, only here it is given a different arrangement and performance by the film's likable lead actor, Koji Wada. It also has some of the director's earlier experiments with colour, most notably in the incredibly camp nightclub that features as the central location in a several scenes, where middle-aged Japanese salary men rub shoulders with the mob amidst an onslaught of very 60's style surf guitar music and a barrage of hip-shaking, belly dancing bikini girls. The influence on Tarantino here is clearly not lost. There's also Suzuki's great use of cinemascope photography, unique use of wipes and dissolves, and bold juxtapositions between the traditional and the very much radical aspects of iconography. In keeping with many of the filmmaker's earlier works, Fighting Delinquents is obviously a B-picture, and as the previous reviewers suggest, it certainly isn't any kind of masterpiece. However, the film is incredibly agreeable and does hold up to repeated viewings. The reason for this is mostly down to the enjoyable plot, which is something that rewards with interesting characters and believable emotional depth, but at the same time, can be enjoyed at a relaxed pace without all the jarring editing structures that Suzuki would eventually develop. On one level its camp and kitsch - the kind of thing that can be enjoyed with tongue firmly in cheek - but at the same time, offers such a bold and striking evocation of the period in which the traditional values of Japan were confronted by the radical ideas and ideologies of progressive, western world to render it a completely worthwhile experience.",
         "With every film of his I see, Seijun Suzuki becomes a greater and greater favorite of mine. This is a teen-centered film. Koji Wada stars as a young juvenile delinquent working for criminals in Tokyo when he finds out that his long-lost father has died and he's up for an enormous inheritance. He's taken to the island of Awaji, a very traditional part of Japan, and with his jazz- and rock-fueled buddies, it's a case of West meets East. This is a colorful, rocking flick. In particular, I love the nightclub performance, where a woman sings a song entitled \"Little Transistor Chick.\" I realized that one of the major reasons I love Suzuki is his depiction of the swinging 60s in films such as this, Detective Bureau 2-3: Go to Hell Bastards! (where Jo Shishido sings a musical number) and Tokyo Drifter. Speaking of Tokyo Drifter, the theme song to this one is virtually identical to that one, note for note until the chorus.",
         "For a large part of this fairly short film I sat feeling indulgent but gradually loosing patience in the thing making any real sense, until in the end I gave up and just enjoyed whatever there was to enjoy. It appears that Suzuki was very much a director for hire and a B movie director to hire to make things worse, or better. Clearly he had to tow the line telling the pretty daft story of betrayal and revenge but increasingly one is aware of him having his own bit of fun. By the end one is smiling at the over the top reactions, wild chases and gorgeously mad lighting. Not to mention the lead bursting into song every now and again. Coming to this with low expectations and with little regard for the depth of the story there are many cinematic pleasures just imagining the gleeful director slipping in one more audacious wipe, dissolve or jump cut. It may be a good example for film students as how not to make a film but it can still be fun to watch, in the right mood.",
         "This is one of a number of B-Movies made by Seijun Suzuki for Nikkatsu. These movies were made quickly under strict studio guidance, with stars and scripts outside of Seijun Suzuki's control. Suzuki would later be famously sacked for rebelling and making his freewheeling sixties yakuza masterpieces. For this movie however Suzuki sticks quite closely to his instructions except for a few moments of trademark brilliance. This movie's clunking script is about a tokyo punk (played by an uncharismatic teen idol) who finds he is heir to the matsudaira clan and so must go the isle of Awaji and claim his birthright, fight yakuza for the preservation of the clan, and discover his mother. The themes are big, the acting and dialogue unfortunately completely lousy. This is a movie where problems are solved in the wish fulfillment manner of children's entertainment. But it lacks the pace and innocence of a children's classic. We are left with anaemic yakuza and clichéd teen rebellion. This is the kind of Japanese film that kinji fukasaku and the new wave pioneers thankfully killed off. The movie is not a dead loss as Suzuki engages in quite a few playful moments. Sound and music plays a prominent role in this movie and musical interludes provide most of the better moments. There is a halfhearted chase which then thrillingly weaves across and around a noh theatre performance. There are some audacious jump cuts and abbreviations to the narrative. Awaji itself makes a brightly coloured setting and island traditions are interestingly recorded. The ending is also a highlight when Suzuki undercuts the appalling script and restages the action in a wild west quarry pit. In final judgement, this movie is probably just one for Seijun Suzuki completists. It is however excellent to see it released on Uk DVD allowing us to see how Seijun Suzuki subverted the formulas of a studio programmer. Suzuki would return to similar themes and a similar style in \"Fighting Elegy\". Of the two \"Fighting Elegy\" is infinitely superior due to an excellent script, performances and satirical distance."
      ],
      "genres": [
         "Action",
         "Crime"
      ],
      "productionCompanies": ["Nikkatsu"],
      "summaries": ["Suzuki's first color film."],
      "budget": 0
   },
   "movielensId": 163907,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1960-11-23",
      "dvdReleaseDate": null,
      "directors": ["Seijun Suzuki"],
      "runtime": 80,
      "movieId": 163907,
      "title": "Fighting Delinquents",
      "mpaa": null,
      "actors": [
         "Kôji Wada",
         "Mayumi Shimizu",
         "Eitarô Ozawa",
         "Yoshiko Nezu",
         "Emiko Azuma",
         "Chikako Hosokawa",
         "Toppa Utsumi",
         "Hiroshi Hijikata",
         "Kaku Takashina",
         "Saburo Hiromatsu",
         "Hiroshi Kondô",
         "Yasuhiro Kameyama",
         "Hajime Sugiyama",
         "Naoyoshi Ozawa",
         "Ryusei Ito"
      ],
      "imdbMovieId": "0054008",
      "originalTitle": "くたばれ愚連隊",
      "genres": [
         "Crime",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This rarely seen gem from master Suzuki casts teenage heartthrob Koji Wada as a young misfit who suddenly finds himself the unwitting pawn in an escalating family feud that ultimately leads to tragedy.  Lean, mean, and stylish as always, this tale of youth-gone-wild is both vibrant and touching. Suzuki contrasts tranquil glimpses of traditional regional life with the emergence of the new rock 'n' roll youth culture and the greed and seething cynicism of encroaching Westernism.  Also released under the title \"Go To Hell, Hoodlums!\", this is a melodrama as colorful, shocking, and exhilarating as one would come to expect from Japan's master filmmaker.",
      "tmdbMovieId": 88528,
      "avgRating": 4,
      "releaseYear": "1960",
      "numRatings": 1,
      "posterPath": "/qH1YkfKWgpuWbfJMhHsgXqGF8yN.jpg"
   }
}