{
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 45,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4460878/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYzAyZTk1OTUtYzJiZS00NmZkLWE1MWEtZWE4NjEzMDA2ZTBjXkEyXkFqcGdeQXVyMjYwNDA2MDE@._V1_UY268_CR11,0,182,268_AL_.jpg",
      "actors": [
         "John Jarratt",
         "Lucy Fry",
         "Dustin Clare"
      ],
      "reviews": [
         "I am a huge fan of the Wolf Creek movies, John Jarratt does a great portrayal of outback killer 'Mick Taylor', when I first saw the preview for this it got me genuinely excited. It looked a lot more deeper than the conventional slasher type Wolf Creek movies, this one had the vibe of being more psychologically involved. The show started off fantastic, we were thrown right into the action, meeting front runner Lucy Fry, depicting the main character whose family gets brutally murdered which ultimately sends her on a revenge trip to kill Mick Taylor. The suspense was great for the first 3 episodes, building slowly until we got to see the final showdown, the predictability was okay, it was entertaining so that is what kept me enthralled. But after the 3rd episode the show took a turn for the worse, from what was a 7/10 show went directly down to a 3/10 show, mostly because of the filler scenes that made absolutely no sense and may as well have not been put in there. The portrayal of the 'Aussie Outback' is shown like something from a Mad Max movie, like it was a post apocalyptic wasteland...but really it was meant to be 2015. The nonsensical parts of the story started to gather up and it started to make the show very unbelievable and frustrating, all of the injuries that the main character suffered seemed to have gone away shortly hours after, when any normal person would have simply died from them. This show had so much potential, leading on from the great legacy of Mick Taylor it could have gone many different ways. But the way in which the director chose definitely wasn't the right one. The show started fantastically and I honestly could not fault it for the first 3 episodes, but after that it became very cheesy in it's story-line and if you were an Australian watching this it was enough to make you cringe. If the director actually portrayed Australians as normal civilians like we actually are, Mick Taylor would have been seen as more menacing and frightening. But apparently the director decided that all Australians act in a caveman manner and dress like the apocalypse had happened. This was Wolf Creek, not Mad Max! Hopefully the director can learn from the mistakes he had made in this show and bring it to his next project. Such a shame for a show that had such great potential. 3/10",
         "Mick Taylor is a hidden gem in the serial killer horror genre. An Australian marksman who prowls the outback looking for unsuspecting tourists to unleash his brand of sadistic torture and psychological mind games upon. This monster of a human is played to perfection by John Jarratt, and from his dirty hat to his terrifyingly sardonic laugh, you don't disbelieve for a moment that this guy is bad news. This TV mini-series had a lot of potential to become a yearly vehicle showcasing Mick Taylor's crusades against a wide variety of victims. The first season delivers a modicum of brilliance you'd expect from another Wolf Creek installment, followed by inconsistencies and unnecessary plot points that drag down what we really want to see in Wolf Creek - Mick Taylor in his native glory. The premiere's pre-credit sequence sets up the season in a superb fashion. It mirrors some of the greatest moments from the Wolf Creek films; Mick Taylor sharing an innocent chat with his unknowing victims, cracking jokes, laughing inappropriately, and sharing hunting stories to earn their trust before he strikes. Unfortunately, nothing else in the season lives up to the first twenty or so minutes. The final showdown in particular is an enormous disappointment, feeling highly derivative of the movies and severely lacking in tension. This is mainly because the final episode delves into Mick's backstory, a huge no-no for horror villains. In fact, the flashbacks to Mick's childhood reminded me a lot of Rob Zombie's Halloween, which is a terrible, terrible thing. We don't need to know Mick Taylor grew up in a broken home (i.e. why he's doing what he's doing) for him to be scary. He's already bloody terrifying. The less we know about him, the more psychotic he seems, and the finale sucked all the intrigue away by force-feeding us his backstory through broken flashbacks and breaking the tension building in the main narrative in the process. Aside from Jarratt's arresting performance, the acting is nothing to write home about. The protagonist is bland; she runs into forgettable characters in her journey to search for the man who killed her family. The officer investigating the case could have been handled much better, and he's given subplots that do absolutely nothing to advance the plot (e.g. his family life). As it is, the only reason to watch Wolf Creek is to see Mick Taylor, and aside from the beginning and end, you don't see very much of him. It makes me yearn for Wolf Creek 2's approach of having the entire story revolve around him, since that's far more interesting than him sitting on the sidelines for the majority of the story while we follow a boring heroine run around the continent searching for him. Hopefully the second season, or third movie, gives Jarratt the screen time he rightfully deserves. I'd support a Luther-esque approach in a second series; maybe have Mick terrorize a certain set of victims for a couple episodes, then move on to another group for the next two, then another, etc. Following one character for over five hours is simply not engaging enough, especially when one of horror's greatest and most charismatic antagonists is involved. If you're a fan of the Wolf Creek movies, I'd recommend watching the first episode and stopping there. It's not a bad series by any means, it just hasn't found its proper footing yet. Hopefully it's given the chance to; or maybe Mick Taylor is just better suited for the big screen.",
         "This contains Spoilers: Watched half of this series and had hoped that it would entertain and be as dramatic and a psychological thriller as the WC1 & WC2 films. The writers have Mick Taylor using his trademark blue Ford F100 which was destroyed in WC1 then this series must be a prequel. The series starts and teases with great promise. In the WC! & WC2 it showed how Mick Taylor offered tainted top end water to drug his victims, but this time he is out of his normal environment and the targets are drinking their own liquid refreshments. The subsequent initial attack comes as a surprise, especially when Robert Taylor is quickly written out. And that is the only surprise, the rest of the series is cliché where the writers must have just graduated from writing school. Unfortunately then this series quickly dwindles into standard run of the mill television with many unnecessary scenes used to pad out the time and fails miserably to deliver any psychological thrills. Many areas of scenes that were poorly written include: a) The tourists jumping into a Billabong without any thought of saltwater crocodiles gives an indication that the writers did not put much effort into this. That didn't make any sense, it would be like Australians being noisy, stupid & careless (as an example with food) in American woods populated with grizzly bears. b) The writers make the police look like the keystone cops, as an example where Eve can just walk into a manned police station, go into a detective's office and ruffle through files and then steal them. And what were the writers thinking when they create the one sided romantic interest of the police detective with Eve. Why was Eve not arrested for theft of police material? c) Strangely Eve whilst on foot was able to chase down a car, then \"somehow\" track down bank robbers and then being able to \"sneak\" into their house and \"somehow\" discover the bank loot that was still strangely left in the bag is pathetically contrived. But then when a bank robber tracks her down to get back the money then forgets the stolen money instead proposes to Eve just highlights how ridiculous the series becomes. Moreso when the bank robber then allows Eve to shoot/murder him! d) The writers have made a very poor attempt to divert Mick Taylor's character into a second rate Freddy Krueger - very embarrassing too. e) The writers also make a strange attempt to make Eve look like Mad Max 2 character when they bring in a dingo as her side kick which quickly becomes a household pet! Even the recasting of Andy McPhee who played Bazza in WC1 is now the character Beard - guess there must be a shortage of actors. It is meant to be a psychological thriller - but it hardly gets anywhere near that, in fact it kills all psychology and gets closer to being how psychologically ridiculous can we make this. Such a sad waste of a great opportunity to continuing the premise of Wolf Creek. Maybe series 2 will be better but the writers will definitely need to be changed.",
         "Kept me on the edge of my seat! I got frightened, sad , and angry! I mean kill this dude already! I'm never going to Australia!",
         "I was leery of watching this series but found it to be far better than both films. There is quite an arc from Episode 1 to Episode 6 and gives the young protagonist ample opportunity to shine as a kind-hearted, smart, yet tough deliverer of justice. There is something so satisfying, watching a character grow the way Eve does. Along the way in the narrative, she has to toughen up even more and grow up quickly to achieve her objective. And there's hardship and a lot of pain along the way. I appreciated that this is not merely a slice and dice horror series (the films are fine and offer an effective urban legend, but the overwhelming gore and terror wore me out), but something with nuance and back story. The episodes give you time to really care about the people involved in Eve's journey. And how refreshing there is a love story that transcends physical lust; more like two souls that found each other but ultimately couldn't be together. As to the acting, mostly quite good. Lucy Fry, who has the gravitas and strength of a young Robin Wright, excels as Eve, out to avenge her loss. She is ably supported by a number of characters, particularly Dustin Clare as Sullivan, the police officer compelled to help her at any cost, a kindly female truck driver, and an escaped prisoner who becomes an ally. John Jarratt does his usual believable, sinister performance as the game-playing butcher, Mick, the guy you never want to run into in a dark alley, the Outback or anywhere else. Great job.",
         "Was really looking forward to this series but found myself getting angry at many of the plot points. Whole series seemed very rushed and there were many big gaps in story line the biggest one being between ep4 and ep5 it seemed like months had passed then all of a sudden both the bikers and Mick caught up with her almost at the same time.... Although Mick loves to play games there were too many missed killing opportunities that didn't make sense. Not sure why she didn't use his truck or why the cop let her walk off at the end either rather then trekking 1.5hrs with a deep knife wound in her chest... Script writer should be Micks next victim. Heh-heh-heh- heh-heh-heh bloody tourists!!!",
         "Being a huge fan of Wolf Creek and part 2 the movies - then just last week discovering a MINI SERIES had been made..... I was absolutely jumping for joy. I binge watched this yesterday. Mick is back and (had to be) played by the incredible John Jarrett. His one liners, gory kills and general nastiness makes Wolf Creek. He is a terrific nasty piece of work you love to hate.... a true bad guy in every sense. So this is a mini series - six parts. That my friends is one flaw to start with - the six parts are muddled and full of unnecessary filler material. The kicker is it starts off with SUCH promise - Mick is introduced within the first 10 minutes with a BANG - from then on the story of one survivor recovering from that ordeal then slowly seeking revenge begins. Along the way this portrays the Ozzie outback in a very nasty crude way - by god if you plan to travel there NEVER speak to ANY man at all - according to the writers and director ALL men are murderous vile inbred rapists - or members of gangs with a below zero IQ. This does not paint a nice picture of the outback. Should the Australia tourist board watch this they should be enraged. God forbid if they endorsed this? Forgetting the tourist side of things the problem with Wolf Creek the series is you could easily have condensed it into a 3 parter. Filler and side plots with silly characters and for me personally not enough of MICK. To sum up begins well - lots of ridiculous filler - On a positive note it ties things up nicely and you do get some flashback footage on Mick as a child and why he became a savage ill feeling cold blooded killer. Maybe just a Wolf Creek 3 would have been a better idea?",
         "This series all starts well, then they seem to run out of ideas very quickly. apart from John Jarret who is as usual brilliant but not used enough,the rest of the cast performances tends to be lackluster or typecast. There are some very bad American accents,the obliquity outback landscapes with kangaroos crocs snakes and spiders. Every Australian male is portrayed as a as either a sex offender, a complete idiot or both and the woman are all portrayed as complete bitches. The story line is where thing get patchy, for a 19 YO girl who was shot and and left for dead and whose family had just been slaughtered, not one relative or government official from the USA bothered to head to Australia to inquire and escort her home, no, she's dropped off at the airport and told take care of yourself and have a nice life.No major homicide investigations,no media, just one country cop to take care of the lot and who seems to think it was a all a big accident.Dozens of tourist missing in the top end and no one is slightly suspicious there is something odd happening up there. I would have thought a large homicide investigation may have given this show a bit of credibility and interest. They try to focus on the two main characters the Cop and the Girl with the bad American accent , unfortunately they're are not interesting enough to hold attention or interest. It seems to want to portray the top end and the outback as some kind of wild west or Mad Max type scenario. It is very frustrating that Australian film produces have to resort to the clichéd Aussie Drongos and instead to try to portray Australians as having some intelligence and sophistication. This series had so much potential but wasted on poor performances, scripts and plots.",
         "Based on the Wolf Creek movies: \"Wolf Creek (2005)\" and \"Wolf Creek 2 (2013)\" which I liked so I had high hopes for the series, but unfortunately it didn't quite deliver. It has it's moments particularly in the first and last episodes but the road there is a bit sketchy with far too many detours adding multiple characters to the mix which takes away from the main story. John Jarrat is back as the bad guy Mick Taylor and that's great but for some reason the creators doesn't think that he's enough of a threat in the series so they randomly throw in a biker-gang as well. Lucy Fry is our heroine in the saga, everything about her just screamed \"model\" to me when I saw her, from the lack of emotion in expression down to her walk, so it was unsurprised when I now googled her and found out that she in fact was a model before she took up acting. I mean she's not at like Claudia Schiffer level of acting or anything but the character she plays undergoes a transition that need to be dealt with by an actress with a little more experience. A direct quote from hers in real life is \"I am enough - you don't need to do anything. The simplicity of how easy acting can be.\" And that would explain why her performance became what it is and I would probably tell her to rethink that idea. Anyway, overall the series is okay but in the end somewhat pointless and it could have been a lot better if they didn't lose focus as often as they did.",
         "I created an account here just to leave a review of this as I need to rant! Never have I watched a TV series that had the potential to be so brilliant, but is in actual fact utter rubbish. It's a perfect example of high production values and cool cinematography trying to shroud a total lack of substance. Plus it's monumental stereotyping of the citizens of the Australian outback is like nothing I have ever seen. Not to mention the fact that it portrays almost every male character as either rapist, thug, thief, or psycho (unless you are a policeman or a priest... and even then.... erm....) The main character has a total lack of depth, coupled with cringe- worthy levels of melodrama (EVEN when taking into account the horrific situation she has been thrown into) and either can't act or is extremely suppressed by awful direction (I'm sure either the actress or the director, or both, or SOMEONE, must have watched too many of those despicable films about melodramatic teenage vampires or something). The plot has so little meat on the bone and is largely implausible, and there is an endless onslaught of purely ridiculous and frustratingly stupid decisions by the main character. I know you are supposed to shout at the protagonists in slasher films for being dumb, and yes they are under pressure and the adrenaline and the blah blah blah, but SERIOUSLY! And not only that, she repeatedly makes the SAME mistakes to the point where I ended up being \"on the side of the villain\", who is the only well executed character in the entire series. Although there are some cool side characters, who needed far more screen time and development. The ridiculousness coupled with the lack of character depth/building (which makes you not give a s**t about them) honestly resulted in it being the first serial killer themed affair where I have actually wanted the killer to end up triumphing (apart from Hannibal Lecter, but we're pretty much supposed to want him to triumph) (and maybe some dodgy sequels to some classic originals, but that's par for the course). It is a well executed production, but the lifelessness of the plot and characters ruins it. I did watch the whole series as I did want to know what the outcome would be, although more because I had fun laughing at it with my girlfriend. They get 3 stars from me for good cinematography and production values, but for the entire duration of this series I just kept imagining the \"ding\" of the CinemaSins tally bell racking up and up to dizzy heights.",
         "In the genre, decades ago, the original movie was well made. For this TV series remake, I launched first episode last night and stopped after brief viewing. Rare for me to do so. Why? 1. acting is very poor; below B series. 2. within the beautiful dry Australian landscape, action moves directly into some lush tropical environment. No connection between the two. 3. the kids jumps into the pond as if the travelers had never heard of salt crocodiles in Australian Northern Territory's water bodies. Crocodile attack was laughable. 4. The fight between daughter and father was very poorly scripted and played. From there I could see the series not moving beyond C grade stuff. Not for me.",
         "Why people would write a negative review about this mini series is a mystery to me. I truly enjoyed it from the beginning till the end. Especially the performance from John Jarratt playing the villain Mick Taylor. To me he's the absolute star of Wolf Creek. With his sadistic laughter and his crazy personality he's the guy you hope you'll never cross on a desert highway in the outback. The rest of the cast was also good with their respective performances. All the characters are fun to watch, so I really don't get why people aren't satisfied with the story. Because the story is everything you ask for when you watch a horror series like this one. The only critic I would have is that it is very unlikely to find people that don't want to be found in the outback. And most of the characters cross paths all the time. But then again if they wouldn't you would not have a decent story. The filming is excellent, especially with the great nature shots. I hope there will be another season.",
         "The first 4 eps really got me excited for the epic showdown between Eve and Mick, but some really poor writing in the last 2 eps harms what could have been one of the great Aussie TV series. Lucy Fry is pretty damn great. She is vulnerable, beautiful, fragile when we first meet her, and one of the series greatest strengths is seeing her grow tougher, stronger and more self reliant. However she has to deliver some cringe lines, and some of her actions in the last eps make no sense at all. But Lucy was great, really enjoyed her character. The other characters.....not so much. Mick is the boogeyman. An unstoppable force who just goes around indiscriminately killing anyone he comes across for no reason other than he is a killer. We get a little backstory about his childhood but this is not really enough to flesh out such a one dimensional monster. Jarrett obviously has fun with the role but he's too normal to be a mythical Jason/Michael Myers monster, yet too unbelievable to be a truly scary serial killer. The side characters and their stories too are fairly pointless and are pure filler for the most part. Great actors like Deborah Mailman and Gary Sweet have small arcs which are completely inconsequential within the greater Eve vs Mick story. Little B-stories like the cop's relationship troubles with his wife pop up every episode and truly offer nothing but filler. We also have other poorly written characters as Jesus, the bikies, the escaped con and the list goes on. This is the weakest aspect of Wolf Creek by far. The direction and cinematography on the other hand are superb. Every episode is filled with beautiful sweeping shots of the outback. They really captured the beauty but also the scary isolation of living in the remote parts of WA/SA/NT. So yeah....its a mixed bag for sure. But in the end i think its definitely worth a watch. It definitely stumbles towards the end but overall it could have been a lot worse.",
         "I read, before I watched episode 4 that a viewer felt that it went a bit off list; flashbacks and fragmented scenes from the past; everyone is different and I felt they needed that to bulk out the story, which I did not want to end - ever . I noticed that the prisoner whose hand was sticking out of the ground, had on it a gold band, but if that was meant to be the escaped prisoner, he had cut that hand off? The police man was wearing a gold band. Later when we saw him hung up, he didn't appear to have lost his hand??? She was awesome . The kicker for me was when her father was knifed at the beginning in the thigh, didn't see that coming at all, no warning just strike!! It had a decent story line, often missing in these kind of horror stories; but of course it was an Australian film and to me they are truly top film makers in their own right. Watch this series binged out on Saturday night until 1am !!!!",
         "As an American, I enjoyed seeing a part of Australia that rarely gets seen. Southern Australia offers an incredible landscape with wonderful vistas...and it would seem, a great many flies. The acting is first rate. The story is compelling. This series offers us a world we do not often see. But like Jason Voorhees, Freddy Kruger and Michael Myers before him; Mick Taylor has one flaw that I find irritating. Why is it these serial killers simply do not die at the end? Could it be as simple as that the storytellers want to make a sequel? Please, someone, kill the bad guy off just once! Despite this, I enjoyed Wolf Creek the series almost until the final shot.",
         "\"Wolf Creek\" (2005) and \"Wolf Creek 2\" (2013) are among the most chilling and effective horror films out there. (They can be difficult for even seasoned fans of the genre to watch.) And last year's follow-up television series faithfully channeled so much of their mood, tone and atmosphere that it should have been just as effective. What a shame that its first season falls short due to tremendous problems with pacing and story structure. I'd rate it a 6 out of 10. The six-episode arc has the feel of the films. It was written, directed and produced by Greg McLean, as they were. Once again, the forbidding Australian outback is itself a central character, gorgeously captured and lovingly presented by the show's cinematography. I think it's been a long time since I saw a horror film or series so successfully project a mood. Also returning, of course, is John Jarrett in his perfect and perfectly frightening portrayal of the serial killer Mick Taylor. Lucy Fry's young American antihero, Eve, is the latest to face off against him, but there's a twist — after surviving the slaughter of her family, she resolves to find and kill him. Fry is just great in the role; Dustin Clare is well cast as the nice-guy cop who alternately pursues and tries to rescue her from danger. The rest of the cast is also roundly terrific. The soundtrack and scoring are beautifully atmospheric. Unfortunately, though, all of these elements appear within a plot that moves at a snail's pace. We actually don't see much of Mick for many episodes — the story focuses on Eve's haphazard, calamitous odyssey through rural Australia, encountering criminals, good Samaritans and just plain lunatics. McLean scripts a protagonist that is compelling and cool, and Fry is a good actress. But many of the events of her journey are only tangentially related to the story's central conflict, which is her duel with Mick. I get the sense that fans might tune in to see a horror film, but might be disappointed by a moody, loosely plotted travelogue through McLean's brutal fictional interpretation of the Australian outback. I wondered how the screenwriter here could make such a major miscalculation. Then I remembered that the \"Wolf Creek\" films, despite their brilliance, were also quite slow. They contained what seem like lots of supporting or ancillary material connected with Mick's victims, which were ultimately interspersed with the intense violence that made them terrifying movies (not to mention Jarratt's flawless portrayal of a violent sociopath). But those movies both had an hour-and-forty-minutes running time. These six episodes add up to four full hours. The slow pace of films was a forgivable flaw — it even came across as deliberate pacing. It's frustrating, though, for any on screen story lasting more time than that. I honestly think I would have enjoyed Season 1 much more if it had been edited down to half its length — into maybe three episodes or one feature film. Oh, well. This series is still remarkably well made, and I do think it will please many fans of the films. If you enjoyed those, I would recommend giving this series a shot.",
         "A YANK GURL WITH NO CLUE TO THE OUTBACK AND MAP, SEEMS TO BE BETTER TRACKER THAN MOST WHO LIVE THERE. A DOG THAT LAYS THE PART OF A DINGO, DOESNT SEEM TO PLAY MUCH OF ANYTHING BUT A MOOCH. TRADITIONAL AUSSIE TALK FROM THE 80'S, WHERE SHELAH IS THE ONLY WORD FOR WOMAN. ALL WE NEED IS PAUL HOGAN TO POP OUT AND SAY THROW ANOTHER SHRIMP ON THE BARBIE. WELL WE ALL KNOW MOST AUSSIES WOULD THINK WHEN THEY HEAR SUCH WORDS... TOSS PRAWNS AT PLASTIC DOLLS,... WHAT WILL THE YANKS THINK NEXT, FOR ENTERTAINMENT? HECK, I GET MORE FUN OUT OF MAKING NEW DIALOG TO MAKE THE STORY LINE MORE INTERESTING THAN SEEING ANIMALS BE SKINNED AND GUTTED. AT LEAST ONE GETS IT IN EVERY EPISPODE. WELL ANYWHO, SHE (YANK GURL) SEEMS TO WOUND AND KILL OFF ENOUGH MEN WITH OUT BEING IDENTIFIED AS THE CULPRIT, KINDA LIKE A TWO FOR ONE BADDIE MOVIE. I TAKE THIS TV SERIES AS PART X FILES (A CLUELESS OUTBACK OFFICER THAT PIECES THINGS TOGETHER AS HE GOES) , À BIT OF KILL BILL. IF IT WERE NOT FOR THE SUCH ES OF THE ORIGINAL MOVIE, AND YANK LOVE FOR THE MYSTERIOUS OUTBACK, IT WOULD BE RIGHT UP THERE WITH YOUTUBE RED AND HULU SHOWS, WHICH BORE THE LIVING BAJEEBUS OUT OF ME.",
         "I did enjoy watching it and the story line was interesting and kept me engaged but the acting wasn't great. Though Mick was excellent as in the movies. There were lots of lame cheesy lines and long winded slow motion scenes which irritated rather than entertained. But still worth watching. Lots of Gory scenes, blood and guts so if you're squeamish I wouldn't recommend. I think though it probably needed more time and or a bigger budget. A few times the story got a bit slow and other times it felt like something was missing. The end was too drawn out and it got to a point where I just wanted it to be over. I'm still left wondering what happened to Bernadette as the end didn't completely clarify that.",
         "The series has been much better than I thought it would be. One thing tho it doesn't really set Australia's outback up as being a particularly safe place. Seems almost everyone out there is crooked, violent or a killer. Maybe she was just having bad luck. Def recommend to have watch if you enjoyed the film's, not as gruesome.",
         "Painful to watch and an insult to the movies,very poor writing, acting and plot holes galore,typical Aussie rubbish, how anyone could rate the first series is beyond me,the young American actress had to be related to someone because she was totally unbelievable in her role ,really terrible,the second series is even worse ,why Stan is funding these rubbish series I can't understand, try an original idea not turning great movies into crap series or just buy more HBO showtime content that is quality ie: Ray Donovan ,the Borgia's ,billions ect this is what people want to see well written watchable drama.wake up",
         "Now i'm a major fan of the wolf Creek movies i love the Mick Taylor character i'd definitely put him up there above the freddy Krugers and Mike Myers in the top serial killer categories on film. So i wanted to check out the Wolf Creek TV series.Didn't like it,totally unrealistic.For starters the Mick Taylor character is hardly in it.It mainly focuses on this young woman out for revenge for the murder of her family by Mick Taylor and all the highly unlikely scenarios she gets herself into while on her quest for revenge.For starters a young American woman running about by herself in the outback totally vulnerable she'd have been dead within a week she wouldn't have stood a chance .Now i'll just have to wait for Wolf Creek 3 to come out.",
         "It's hard giving a show a rating. You have to take into account all the seasons and in this case it is tough. Loved the first season! The heroine was amazing ( intensity, vunrability, resolve etc). Mike Taylor was sharp, ruthless and creepy in a was that gets under your skin! Season 2 was beyond sloppy...bad acting from all involved...premise was weak and ending was lackluster! My advise; watch season 1 as a stand alone, it's that good. Stay clear of season 2!!",
         "Loved the first series and the first movie. But it's not even worth watching this tripe to see the ending. Note to filmmakers: If you keep making your scenes so visually dark NO ONE CAN SEE ANYTHING. Mick Taylor has well and truly worn out his welcome, same old same old, no plot, please Stan spend your money on better drama/ thriller/ anything for us to watch. This was a waste of money and oxygen."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Emu Creek Pictures",
         "Screentime"
      ],
      "summaries": ["An anthology series which centers on different characters being targeted by crazed serial killer Mick Taylor in the Australian outback."],
      "budget": 0
   },
   "movielensId": 163921,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-06-16",
      "dvdReleaseDate": null,
      "directors": [
         "Greg McLean",
         "Tony Tilse"
      ],
      "runtime": 240,
      "movieId": 163921,
      "title": "Wolf Creek",
      "mpaa": null,
      "actors": [
         "John Jarratt",
         "Lucy Fry",
         "Dustin Clare",
         "Deborah Mailman",
         "Miranda Tapsell",
         "Jessica Tovey",
         "Richard Cawthorne"
      ],
      "imdbMovieId": "4460878",
      "originalTitle": "Wolf Creek",
      "genres": [
         "Crime",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["z8GLidddu8I"],
      "plotSummary": "Eve, a 19-year-old American tourist is targeted by crazed serial killer Mick Taylor. She survives his attack and embarks on a mission of revenge.",
      "tmdbMovieId": 388131,
      "avgRating": 3.3913,
      "releaseYear": "2016",
      "numRatings": 23,
      "posterPath": "/qRrxX4LSwPaviznJmUhxlRTrQcV.jpg"
   }
}