{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1592502",
      "video": false,
      "title": "8",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "X",
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276ae7",
               "name": "Nicky Naude",
               "profile_path": "/7o0JhUIHRd7R0A5yY6g0blNNQNf.jpg",
               "id": 370383,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "O",
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276aeb",
               "name": "Guillaume Tavi",
               "profile_path": null,
               "id": 1267015,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276af1",
               "name": "Acim Vasic",
               "profile_path": null,
               "id": 1267016,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276af7",
               "name": "Arnaud Carney",
               "profile_path": null,
               "id": 1267017,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276afd",
               "name": "Khaled Salem",
               "profile_path": null,
               "id": 1267018,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df6c3a36847f8276b03",
               "name": "Acim Vasic",
               "profile_path": null,
               "id": 1267016,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "War",
         "id": 10752
      }],
      "popularity": 0.125479,
      "production_countries": [{
         "iso_3166_1": "CH",
         "name": "Switzerland"
      }],
      "id": 231762,
      "vote_count": 3,
      "budget": 0,
      "overview": "In the depths of a snowy forest in an unknown wartime, two soldiers from opposing armies try to outwit each other in a perilous game of cat and mouse - until they find themselves outplayed by destiny.",
      "similar": [
         4995,
         401898,
         376867,
         84892,
         398818,
         449176,
         306819,
         244772,
         258480,
         152532,
         1391,
         455661,
         468,
         540,
         451945,
         82390,
         11000,
         234200,
         338189,
         266773
      ],
      "original_title": "8",
      "runtime": 9,
      "poster_path": "/kEI29YsVloJxIyCVM3Zlj1Er3fU.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Turbulence Films",
         "id": 17927,
         "origin_country": ""
      }],
      "release_date": "2010-04-30",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Switzerland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Acim Vasic"],
      "runtime": 9,
      "synopsis": null,
      "writers": ["Acim Vasic"],
      "originalLanguage": "None",
      "imdbLink": "http://www.imdb.com/title/tt1592502/",
      "coverLink": null,
      "actors": [
         "Nicky Naudé",
         "Guillaume Tavi"
      ],
      "reviews": [
         "I saw this film on a festival in Italy, where it won the 1st prize. It's like a small explosive. Starts slowly and carefully, but ends with a big awesome bang. It's always difficult to make a good short film, as the time is compressed. This one used the time and space exactly how short films should. Actors are good enough and carry out well their characters and the character of the film, which is unique in a way and very amusing. Many times I didn't know if it is all supposed to be serious or funny. It was all on the edge of both. Very sarcastic. The short film is visually great, amazing location, and costumes, and some unexpectedly beautiful shots, among which ones is surely the best reloading shot in cinema history, in my very humble opinion. Watch it if you have a chance, you won't regret, I promise.",
         "A soldier patrols a snow clad forest . A plane's engine is heard spluttering and a plane crashes . The soldier comes across the pilot and takes him prisoner but the pilot doesn't want to end up in POW camp There's a fair bit wrong with this short . There's no dialogue and it tries to be ambiguous by taking place In an unnamed setting and time frame because the uniforms and aircraft with turbo prop engines suggest it's the Second World War , but that said it's near impossible to visualise on screen a generic war that is timeless and could be taking anywhere or at anytime But this is not what 8 concerns itself with . Instead director Acim Vasic and the production team entirely concentrate on the audio , an often overlooked part of film making . There is no dialogue and everything is told by action and sound . It is impressive and even if you can work out what the pay off is going to be as I did the technicalities of sound mix and sound editing kept me engaged within the film",
         "When an enemy fighter pilot is shot down behind enemy lines he is captured by a soldier and transported through the snowy woodland. This is the start of the short film which sees the conflict between the two play out in a series of small but engaging ways. As a plot it is simple perhaps but I enjoyed it and the style of delivery helped it. Although there is no comment on the war or soldiers, there is a certain absurdity to the plot and the delivery but at the same time the director has managed to capture the look and feel of a \"proper\" war movie. Shooting in the snowy wood is very well done and the film looks very good and plays well with many shots where you are not sure if it is a comedy or a drama (but in a good way). The acting is solid although I personally did not like the noise the soldier made in place of dialogue – I think the decision to have no dialogue or language was a good one, just not sure about that noise in particular (as opposed to a whistle or something less abrasive and odd). Despite this the delivery is very good and it manages to be dramatic while being absurd and I found it quite enjoyable in its content and style.",
         "Acim Vasic should be applauded for this 10 minute short film set in a snowy forest in an unknown country, mainland Europe, I guess and an unknown war, the second world war I reckon. O is shot down behind enemy lines. X captures him and marches him through a snowy forest. Each time O gets an opportunity to escape, he is gunned down by X. There is an opportunity to turn the tables when X steps on a landmine and O grabs the rifle. It is a simple plot with not dialogue apart from a clacking sound made by X each time he wants O's attention. The short is regarded as absurd but I did not view it as a comedy. A game of noughts and crosses played out in real life. Very well photographed, lovely sound effects and the director showed a lot of skill in making this short.",
         "as witness of a confrontation who seems the right manifesto against war. because, in fact, this is the motif who gives to this short film a special charm. two soldiers. a sort of cat-and-mouse game. and perfect landscape. the change of roles. and the captivity . and, sure, the owl. it is impressive the manner to give, in less than 10 minutes, a subtle, powerful and convincing message, using the black humor as basic tool. because it is one of films who are surprising for the smart solution to a crisis who seems a chess game."
      ],
      "genres": [
         "Short",
         "War"
      ],
      "productionCompanies": ["Turbulence Films"],
      "summaries": [
         "Amidst a senseless and perpetual war, an armed aircraft crashes behind the enemy lines in the middle of the unending and snow-covered Tundra and its downed pilot is taken hostage by a self-contained soldier. As the two men pass through the pathless and desolate forest with the hostage always at gunpoint, a game of wits and perseverance will begin to unfold. Who has what it takes to outsmart his opponent?",
         "In the depths of a snowy forest in an unknown wartime, two soldiers from opposing armies try to outwit each other in a perilous game of Tic-Tac-Toe, until they find themselves outplayed by karma."
      ],
      "budget": 0
   },
   "movielensId": 164031,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "2010-04-30",
      "dvdReleaseDate": null,
      "directors": ["Acim Vasic"],
      "runtime": 9,
      "movieId": 164031,
      "title": "8",
      "mpaa": null,
      "actors": [
         "Nicky Naude",
         "Guillaume Tavi"
      ],
      "imdbMovieId": "1592502",
      "originalTitle": "8",
      "genres": ["War"],
      "youtubeTrailerIds": ["He9FeJZua20"],
      "plotSummary": "In the depths of a snowy forest in an unknown wartime, two soldiers from opposing armies try to outwit each other in a perilous game of cat and mouse - until they find themselves outplayed by destiny.",
      "tmdbMovieId": 231762,
      "avgRating": 3,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/kEI29YsVloJxIyCVM3Zlj1Er3fU.jpg"
   }
}