{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt5436082",
      "video": false,
      "title": "One Kiss",
      "recommendations": [
         392832,
         413730,
         182415,
         362637,
         64509,
         158947,
         96092,
         81949,
         108768,
         341544,
         62819,
         215739,
         265717,
         394260,
         363757,
         381615,
         40421,
         163706,
         43738,
         389365
      ],
      "backdrop_path": "/faccYsNO4Oxf5nS8gVloYRp5J7Y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "56fcedecc3a3684817001e38",
               "name": "Rimau Grillo Ritzberger",
               "profile_path": "/p7VmsIhGx9rS6RbzBSG01coWJLo.jpg",
               "id": 1598947,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "56fcedf49251415fa3001c27",
               "name": "Valentina Romani",
               "profile_path": "/suRakoKnARTstrBJ9W8vl9y1k3n.jpg",
               "id": 1598948,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "56fcedffc3a368480f001e56",
               "name": "Leonardo Pazzagli",
               "profile_path": "/fGR9GAIPTs7TUsiFpnXVl6jVRWU.jpg",
               "id": 1598949,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "56fcee079251415f9e001e78",
               "name": "Simonetta Solder",
               "profile_path": "/fhgGjYGpE4nXgX6hoHZ6Gn3fF10.jpg",
               "id": 109336,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "56fcee0e9251415f9a001d31",
               "name": "Giorgio Marchesi",
               "profile_path": "/NKlrZnQ7Kw3tWcYEj1S8Ms00xv.jpg",
               "id": 124627,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "56fcee16c3a3684809002052",
               "name": "Susy Laude",
               "profile_path": "/dYqT0oj2Rh246X1xHcvLEweZsvQ.jpg",
               "id": 120181,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "56fcee1dc3a368481b001ede",
               "name": "Thomas Trabacchi",
               "profile_path": "/ky0EBXtwsilS1BbpV3Ssg7k2RP9.jpg",
               "id": 296690,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "56fcee259251415f9a001d38",
               "name": "Laura Mazzi",
               "profile_path": null,
               "id": 1598950,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "56fcee2b9251412c85000034",
               "name": "Sergio Romano",
               "profile_path": "/blEs4ebKnLEyz5CNGj2veITfNit.jpg",
               "id": 1491567,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56fced709251415f98001e1d",
               "name": "Ivan Cotroneo",
               "profile_path": null,
               "id": 111427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56fced7dc3a36848280020f4",
               "name": "Ivan Cotroneo",
               "profile_path": null,
               "id": 111427,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56fced87c3a3684809002034",
               "name": "Monica Rametta",
               "profile_path": null,
               "id": 35121,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56fceda39251415f9e001e66",
               "name": "Luca Bigazzi",
               "profile_path": null,
               "id": 7560,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56fcedb69251415f98001e2c",
               "name": "Mika",
               "profile_path": "/5JaOc5RiMLTRLWrOqnylABXcMbA.jpg",
               "id": 1224964,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56fcedc49251415fa3001c22",
               "name": "Nicola Giuliano",
               "profile_path": null,
               "id": 933274,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56fcedcec3a3684812001e2a",
               "name": "Francesca Cima",
               "profile_path": null,
               "id": 933273,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56fcedd8c3a368481d002179",
               "name": "Carlotta Calori",
               "profile_path": null,
               "id": 1341584,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.046992,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 390669,
      "vote_count": 130,
      "budget": 0,
      "overview": "Lorenzo, Blue and Antonio have a lot in common: they are sixteen, attending the same class in the same school in a small town in the northeast, each have a family that loves them. And all three, though for different reasons, have come to be isolated from other peers. Their new friendship helps them to resist, until the mechanical attraction and fear the judgment of others do not grasp them unprepared.",
      "similar": [],
      "original_title": "Un bacio",
      "runtime": 101,
      "poster_path": "/eQw1JGdeMzaAADZVZPbFm6OKowR.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "2016-03-31",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ivan Cotroneo"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Ivan Cotroneo",
         "Ivan Cotroneo"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt5436082/",
      "coverLink": null,
      "actors": [
         "Rimau Ritzberger Grillo",
         "Valentina Romani",
         "Leonardo Pazzagli"
      ],
      "reviews": [
         "Set in a provincial Italian school where a teenage boy has just been adopted by progressive thinking parents. They need to be as this is Lorenzo and he is 'as gay as Bloomingdales at Christmas' (I nicked that from 'Will and Grace'). Once there he meets Blu who is the offspring of hippy type parents and whose good name is besmirched as a result of a 'full on party gal' reputation. They are outcast and everyone hates them. There is also the dashingly good looking and painfully unaware Antonio, he is great at basketball and so is tolerated but as he spends so much time with the ghost of his dead brother, he is not seen as 'cool kid' material. They soon form up as three friends and set about righting a few wrongs. Thing is it does not take much to break the fragile and fledgling new found friendship. Now this is just brilliant. I loved it from the start, there are dance routines, there is animation, there are fabulous outfits, there is humour, pathos and it is all wrapped up in great acting, a powerful yet simple story and a moving narrative. This like Lorenzo deserves a lot more attention and for fans of LGBT cinema there is much here to admire, but moreover it is a simple story of love, longing, friendship, fear and truth – simply can not recommend enough and now my gush is over.",
         "I'll start with the bad notes. Acting and scene design might have been much better. Sometimes they appear a bit amateurish: while a simple, real-life style might not be out of place given the themes, it's clear the attempt to be polished and refined in most of the film. Unfortunately a lot of times photography, action and dialogue delivery are not as sharp as expected, giving a bad feeling of fiction. This said, the movie is great. The untold topics are social conflict, integration, exclusion, hate. The context is the life in a high school for 3 teens with a complex background (and who hasn't one?). Drama, comedy and tragedy (and even musical scenes) alternate effortlessly maintaining a level of depth, sensitivity and intelligence that can be rarely spotted in other \"coming of age\" productions. Strongly advised.",
         "The Italian movie Un bacio was shown in the U.S. with the translated title One Kiss (2016). It was written and directed by Ivan Cotroneo. This is an interesting film that will grab your attention from the opening shot, and will hold your attention until it ends. (Actually, it has two endings. We all prefer one ending to the other, but we can't say which one is \"real\" in the context of the film.) Rimau Ritzberger Grillo plays Lorenzo, a flamboyant, openly gay high school student. Naturally, he attracts homophobic criticism, but he is able to shake it off. Leonardo Pazzagli portrays Antonio, a straight, but different, classmate. Antonio is a star basketball player, so the other young men pretty much leave him alone. They don't like him, but they respect his athletic abilities. Sadly, Antonio doesn't like himself very much. He compares his own quiet character with that of his dead brother. His brother was outgoing and well liked, and Antonio is standing the the shadow of the brother he loved and admired. Valentina Romani plays Blu, a young woman with the reputation of being a slut. (How she developed this reputation is one of the film's denouements.) She looks a little like Emma Watson, and she plays the Hermione role in the movie. She is the friend of both, and both of them adore her. All of the three protagonists are outcasts, but they stand together and defy the world. This stance works until it doesn't, and that's what we watch in the second half of the movie. We saw this film at the excellent Little Theatre, as part of the wonderful ImageOut, the Rochester LGBT Film Festival. It was one of 22 films to have its East Coast or New York State premiere in Rochester. Un bacio carries a 6.8 rating on IMDb. That's not too bad, but I think it's better than that. It will work well on the small screen. It's worth seeking out and watching.",
         "This little flick has it's own reality! It's a mix of cheerful hopefulness and sad truth. Three young teenagers, two boys and one girl, who don't exactly fit in with the other students their age, befriend one another and develop a close bond. Lorenzo is naturally positive, happy, and pays no mind to the other classmates who reject him. Antonio is an ace basketball player but emotionally damaged by his brothers death. Blu is her own person and secure in her decisions and behavior. These three find one another and their friendship brings light into their lives. All is well until their sexual desires enter the picture and their relationships begin to fracture. Antonio is still very insecure and cannot break his need to be accepted by his peers. His damaged emotional self-image turns the happy threesome upside-down. The story has two endings the real one and the idealized one that Lorenzo and Blu would have preferred.",
         "First, let me say that I will have to disagree with the people who have raved about this movie. It was not horrible but I don't think it was as good as some have made it out to be. Having said that, allow me to clarify that there is only one ending. Antonio shoots Lorenzo. The \"other\" ending is simply the way Blu tells her story. Remember she's writing to her older self and she tells her that if only things had been different (hence the scene where Antonio reacts differently to Lorenzo's advances), all the tragedy could have been avoided and things would have turned out much better. It's how she tells her older self to try and spread tolerance and education to avoid what actually happened when she was young. Now, for the things I didn't like. For a movie with such a macabre ending, I thought the musical numbers were not the best way to develop the film. I also didn't really like how some themes were overdeveloped while others were given very little attention or resolved in 2 minutes. Antonio was obviously a troubled teen with psychological problems so won't excuse in any way his actions but I think the movie could also have made a point of explaining to gay teens (I'm gay myself, so this is not a homophobic remark) that coming on to another guy by making physical advances is simply not something to be done lightly and most times there are consequences. Lorenzo paid a very high price for his actions and although they didn't warrant his death, it would be good to point out that if he had simply talked to Antonio instead of trying to put his hand down his pants things might have been totally different. The acting is quite amateurish at times, with bad transitions between scenes, dialogue that at times seems out of a book, and characters that are sometimes stereotyped in ways we've seen in movies several thousand times before",
         "When I first decided to watch this movie, I did so knowing that it could end up being an Italian The Perks of Being a Wallflower. But this film is something entirely different, regardless of how similar some aspects might sound. It tells the story of three teenagers, all rejected from their peers and for different reasons. Blu, a confident, openly sexually active girl. Antonio, who regardless of being a brilliant basketball player is made fun of for being unintelligent. And Lorenzo, an eccentric and openly gay boy. He moves from Turin and into a town that is way to conservative and small for his ambitions. Regardless of the dance scenes, eccentric clothes and the \"cartoonish\" edits, this film was quite realistic, and successful in capturing the troubles of teenagers without making it look overly \"angsty\" or melodramatic. Some of the soundtracks were a bit off, and some scenes could have been avoided completely, but overall a great film. I have no idea why Un Bacio (One kiss) hasn't boomed in the LGBT community yet. It definitely should get more attention.",
         "Seen at the Movies That Matter film festival 2017 in The Hague. Disappointing, storytelling-wise as well as how the fantasies of main protagonists were visualized. The clearest example of the latter is Lorenzo's arrival at his new school. We see him drop his backpack and dance his way into the building with the other pupils applauding. Another example, not much better than the former, can be found in Lorenzo's dialogues with his dead brother. Plot and developments overall are not involving, and as such not as moving as the film makers apparently had hoped for. The composition of the threesome is a bit artificial, seemingly only setup to expose and thus emphasize their differences, their sole binding factor being that all three were treated as outsiders by their peers. The story around Blu does not receive the attention it deserves. It leaves unclear why she still hangs out with one of the guys who filmed her while she was sedated and seduced by him and his three friends, something that appears later to be a full-fledged gang-rape, less consented than Blu herself tells everyone repeatedly. The rest of the school has earmarked her as \"easy to get\", words like sl*t are graffiti-d on walls all over the area. The footage itself was not made public, yet the seduction was known all along by other means (gossip?? hearsay??). Near the end of the movie when Blu happens to see the whole footage and learns what really happened with her and the foursome \"friends\", it triggers her to take formal steps against them, together with her parents and eventually involving the police. How and why that developed is covered in only a few minutes, hence left us wondering. When our three main protagonists are taking a swim at a deserted place outside, Lorenzo makes his move to Antonio and touches him, something that Antonio apparently does not take well and he leaves without saying anything, despite Blu calling after him to learn why he left. I cannot reveal further developments, in fear of spoilers. But in the end, also somewhat artificial, we see the very same scene where Lorenzo touches Antonio, with a totally different outcome, leaving us outguessing how it will develop. This is where the movie ends with showing the final credits, leaving us wondering again. All in all, I feel a bit lost because of the generally positive reviews, by non-critics as well as critics. None of them even touches the objections I outlined above. In other words, this is a minority viewpoint. Most probably, my age (67) will be deemed the culprit."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Indigo Film",
         "Titanus",
         "Lucky Red"
      ],
      "summaries": ["The story of three teenager friends not accepted by their peers."],
      "budget": 0
   },
   "movielensId": 164057,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "2016-03-31",
      "dvdReleaseDate": null,
      "directors": ["Ivan Cotroneo"],
      "runtime": 101,
      "movieId": 164057,
      "title": "One Kiss",
      "mpaa": null,
      "actors": [
         "Rimau Grillo Ritzberger",
         "Valentina Romani",
         "Leonardo Pazzagli",
         "Simonetta Solder",
         "Giorgio Marchesi",
         "Susy Laude",
         "Thomas Trabacchi",
         "Laura Mazzi",
         "Sergio Romano"
      ],
      "imdbMovieId": "5436082",
      "originalTitle": "Un bacio",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lorenzo, Blue and Antonio have a lot in common: they are sixteen, attending the same class in the same school in a small town in the northeast, each have a family that loves them. And all three, though for different reasons, have come to be isolated from other peers. Their new friendship helps them to resist, until the mechanical attraction and fear the judgment of others do not grasp them unprepared.",
      "tmdbMovieId": 390669,
      "avgRating": 3.375,
      "releaseYear": "2016",
      "numRatings": 4,
      "posterPath": "/eQw1JGdeMzaAADZVZPbFm6OKowR.jpg"
   }
}