{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "blaxploitation",
         "id": 10601
      }],
      "imdb_id": "tt0072759",
      "video": false,
      "title": "The Candy Tangerine Man",
      "recommendations": [],
      "backdrop_path": "/dTIC8tfLyvHIk9I3S4zSxXhd0Rk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Gordon (as C.D. La Fleuer)",
               "gender": 2,
               "credit_id": "586016fe92514115cd021228",
               "name": "George Buck Flower",
               "profile_path": "/xHzW4GszCLTZLNxvTcKL9ICuLIc.jpg",
               "id": 54564,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "The Baron",
               "gender": 2,
               "credit_id": "52fe49879251416c910b0391",
               "name": "John Daniels",
               "profile_path": null,
               "id": 88150,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dempsey (as Edward Roem)",
               "gender": 2,
               "credit_id": "52fe49879251416c910b0395",
               "name": "Richard Kennedy",
               "profile_path": null,
               "id": 52616,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sugar",
               "gender": 0,
               "credit_id": "52fe49879251416c910b0399",
               "name": "Meri McDonald",
               "profile_path": null,
               "id": 935752,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Clarisse (as Tracy King)",
               "gender": 1,
               "credit_id": "582b7ea09251417b23045c93",
               "name": "Marilyn Joi",
               "profile_path": "/gNSt5ORLeL6431q7n65EmhjN20T.jpg",
               "id": 52615,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Midge",
               "gender": 1,
               "credit_id": "582b7eac9251417b18047f76",
               "name": "Tallie Cochrane",
               "profile_path": null,
               "id": 99840,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Big Floyd",
               "gender": 2,
               "credit_id": "582b7eb8c3a36823580102af",
               "name": "Patrick Wright",
               "profile_path": null,
               "id": 45615,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Vincent Di Nunzio",
               "gender": 0,
               "credit_id": "582b7ec3c3a368038103a489",
               "name": "Mikel Angel",
               "profile_path": null,
               "id": 104452,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hooker on Couch (uncredited)",
               "gender": 1,
               "credit_id": "582b7ed9c3a3683608041752",
               "name": "Brenda Fogarty",
               "profile_path": "/oj44KcMDPwwB1QneK2kCH6wZaL9.jpg",
               "id": 104947,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49879251416c910b0389",
            "name": "Matt Cimber",
            "profile_path": null,
            "id": 140086,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.069843,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 86462,
      "vote_count": 1,
      "budget": 0,
      "overview": "Sunset Boulevard is a lucrative place to work for the Black Baron, a pimp with a distinctive red and yellow Rolls Royce and plenty of girls on his books. He don't take no mess from his girls, his madam or his competitors and viciously defends his patch. First, he clobbers the Mob who attempt to move in on his patch. Second, he tracks down one of his girls who runs off with a suitcase full of his cash. Third, he disposes of two policemen. But by now he knows his pimping days are numbered, so after a final explosive gun battle he switches to being his alter ego, mild-mannered businessman Ron who lives out in the leafy suburbs with an unsuspecting wife and family.",
      "similar": [
         17006,
         26196,
         5822,
         56539,
         29515,
         84062,
         46018,
         83222,
         26389,
         50270,
         22311,
         1554,
         466,
         22021,
         11657,
         1626,
         49010,
         24804,
         13855,
         21301
      ],
      "original_title": "The Candy Tangerine Man",
      "runtime": 95,
      "poster_path": "/6kdLMEYWARCi2gIfcUl6B3IZ4HJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1975-05-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Git Back JACK--Give him no JIVE...He is the BAAAD'EST Cat in '75",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matt Cimber"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Mikel Angel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072759/",
      "coverLink": null,
      "actors": [
         "John Daniels",
         "Eli Haines",
         "Tom Hankason"
      ],
      "reviews": [
         "Awesomely good little blaxploitation jewel features more stilted 70s fashion, gun violence, and pimp/whore sensationalism than possibly any other example of its subgenre. Inner-city King-Pimp leads an exhausting double life...by day, he's your average, picket-fence suburban family man with a mild nature. Surrounded each night by beautiful hookers eager to \"treat him right\", he declines each shapely temptation and remains faithful to his wife(who is unaware of what his real \"job\" is). As reticent a character as this man may seem, don't doubt for an instant that there is a mean-streets edge that comes shining through when necessary roughness is condign for maintaining order within the ghetto underbelly. A plentitude of hard-ass action and snap-crackle dialog make CANDY TANGERINE MAN one of blaxploitation's best...a technically on-the-ball production for a movie of its breed, but not at all lacking in glorious B-grade edginess. Recommended 7.5/10",
         "Mack daddy by night. Suburban grass-cutter, pipe-smoker, and front-porch-newspaper-picker-upper by day. THE CANDY TANGERINE MAN is, among other things, a turning of ghetto romanticization on its ear: this King Player really likes the quiet of the suburbs more than the yowls of his stable. This movie is no one-liner, however: it doesn't just dabble in outrageous situations, it bats them out of the park. This movie cost about nineteen cents and is known only to diehards. Spread the cult.",
         "You got to see it to believe it. Shot in Hollywood on the strip in the middle of the sleazy, anything goes 70s, this cheaply made flick must of really packed the inner city theatres back in the day. Then again, I bet it had a one week run. Actually, its pretty hilarious. The acting is dreadful, the direction non existent, but the hair, clothes, rotten pre disco music and the general out and out sleaziness of the story are mind boggling. Sleazy, its very sleazy. Highly recomended (if you can find it)",
         "One of the more imaginative Blaxploitation films I've seen... This movie would make a good Windows theme, with dialogue where a \"chalky, honkey\" cue ball is blamed for the loss of a bet, and the CTM's car is a Rolls with painted-on flames and pop-up machine gun headlights (the scene where those are revealed is truly the high point of the whole movie). The whole \"slum superhero\" bit has been done before, but never quite as comically. If your video store doesn't at least have \"The Mack\" don't even bother looking for this one.",
         "Here's one of the more pleasingly scuzzy 70's blaxploitation grindhouse items; it's a pervasively low-rent pimp opus which comes across like a sleazier version of \"The Mack.\" John Daniels, the studly womanizing hairdresser hero Mr. Jonathan in the immortal \"Black Shampoo,\" gives an excellent steely portrayal of the Baron, a ruthless, business savvy, forever on the make all-powerful flesh peddler who much to the dismay of his bitter, brutal Italian rivals reigns supreme over the Sunset Strip. When not locking horns with his fellow no-count criminal pals or doing his best to avoid being busted by the local vice cops, Daniels is leading a sweetly average existence as your standard garden-variety suburbanite dude (complete with caring wife and loving kids!) in some typically humdrum California small town. The glaringly absurd premise alone promises top-rate trashy greatness of a decidedly Grade B schlock picture variety (George Theakos deserves kudos for his hilariously ludicrous script). Matt Cimber's commendably tactless and tasteless direction delivers the junky goods by the slimy bucketful, thus making this film a hugely enjoyable serving of celluloid grime. Among the assorted squalid delights to be savored herein are plentiful gratuitous female nudity, coarse dialogue, beautifully gaudy Me Decade threads (halter tops, felt hats, sparkling Day-Glo jewelry, loud seersucker suits), an intensely funky R&B score by Smoke, some hopelessly pathetic acting (the little old lady who lives next door to Daniels is excruciatingly shrill), a memorably nasty turn by Patrick Wright as a sadistic goon, a couple of cool action set pieces (the climactic slow motion barroom massacre seriously cooks), more lurid travelogue footage of the Sunset Strip than you can shake a feather boa at (said footage allegedly includes \"the actual hookers and blades of the Sunset Strip in Hollywood\"), effectively dark'n'dingy cinematography by Ken Gibb, a few sicko sexual fetish tableaux, some raw explicit violence (a prostitute has one of her breasts cut off!), and amusing supporting performances by familiar schlock feature perennials Richard Kennedy and George \"Buck\" Flower as a pair of racist, corrupt, browbeating police detectives. Sure, this movie ain't art, but it's certainly artless enough to qualify as a deliciously grungy chunk of entertainingly sordid cinematic swill.",
         "A favorite of both filmmaker Quentin Tarantino and his frequent cast member Samuel L. Jackson, \"The Candy Tangerine Man\" is simply primo exploitation. It stars the unfortunately little known John Daniels (\"Black Shampoo\") as \"The Baron\", a smooth as hell pimp who leads a double life. On weekends he goes home to a wife (Marilyn Joi) and kids in the suburbs! Trouble brews for The Baron when brutal mobsters insist on moving in on his territory. When his hookers take a powder, The Baron comes up with a new way to make money, but the bad guys just won't leave him alone, and he's obliged to indulge in a little old fashioned revenge. Cult director Matt Cimber (\"The Witch Who Came from the Sea\") based the main character on a man he knew, who'd left school at a very early age but who was still quite savvy. This was a man who could have gone far in life had he stuck with his education. Cimber enlisted his friend, Mikel Angel (a writer and actor also known for such things as \"Psychic Killer\" and \"Angels Die Hard\") to write the script. Angel also plays the role of ruthless white mobster Vincent Di Nunzio, and served Cimber and the viewers with an amusing and fun scenario that's just full of all the sex and violence we could want. And what glorious sex and violence it is. The sadism includes a pair of breasts being cut off (!) and a goon getting his hand mangled in a garburator. There's a respectable amount of lovely ladies here to show off the goods. It's too bad Daniels isn't more popular. He had enough charisma and presence on screen to have been more of a star. He's ably supported by a couple of familiar faces for fans of 70s trash cinema: Ms. Joi, Richard Kennedy and George 'Buck' Flower as a pair of racist detectives who regularly hound The Baron (Kennedy really goes to town on the scenery), Tallie Cochrane as Midge, and Patrick Wright as volatile thug Big Floyd. John F. Goff appears unbilled. The fashions and visuals are nice; the title comes from the fact that our hero pimp drives a brightly colored Rolls Royce. And there are hearty helpings of great soul music, composed by \"Smoke\". This is one to seek out if you're not already aware of it. Eight out of 10.",
         "When will this blaxploitation classic get the cult reputation it so richly deserves? John Daniels is a suburban businessman by day who becomes tough, garish pimp \"The Black Baron\" by night. Surrealy bad acting from the cast, (apparently) real hookers (with their breasts cut off) and more nasty violence rules the day as the Baron battles Italian gangsters. He also drives around in a candy-coloured Rolls Royce with a set of machine guns behind the headlights. Films don't get much more fun than this, i just wish i could have seen it in a theatre. With Marilyn Joi and George \"Buck\" Flower. Theakos also wrote LADY COCOA and THE BLACK SIX for Ottaviano (a one-time Jayne Mansfield husband). Movie reviews at: spinegrinderweb.com",
         "A FILM NOT TO BE MISSED! This is a bigger than bizarre (poor directing on a shoe-string) style of a movie. Totally and most wholeheartedly WELL WORTH WATCHING for all the wrong dum-ass reasons. Gangster hot heads and stiff pimping galore. Staring John Daniels as super-hero style pimp, 'THE BARRON.' A respected, well known family man by day and by night becomes a money making slap ma \"HOSE\" dood, with attitude. This film has it all. Jokes in all the wright places and jokes in all the wrong places. Classic ahead of its time, obscene language. Witty lines like, 'Mr B is gona run the 1-2-3....' or 'You xxxxxxxx xxxx xxxxxx xxxx xxxx you were gona xxxx xx xxx xxxx, I did it...' The movie concludes with a pure GUNSMOKE ending. THE BARON finally reveals he to has more moves than ever expected. (SEE POSTER)"
      ],
      "genres": [
         "Adventure",
         "Action"
      ],
      "productionCompanies": ["Moonstone Entertainment"],
      "summaries": ["Sunset Boulevard is a lucrative place to work for the Black Baron, a pimp with a distinctive red and yellow Rolls Royce and plenty of girls on his books. He don't take no mess from his girls, his madam or his competitors and viciously defends his patch. First, he clobbers the Mob who attempt to move in on his patch. Second, he tracks down one of his girls who runs off with a suitcase full of his cash. Third, he disposes of two policemen. But by now he knows his pimping days are numbered, so after a final explosive gun battle he switches to being his alter ego, mild-mannered businessman Ron who lives out in the leafy suburbs with an unsuspecting wife and family."],
      "budget": 0
   },
   "movielensId": 164037,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-05-01",
      "dvdReleaseDate": null,
      "directors": ["Matt Cimber"],
      "runtime": 95,
      "movieId": 164037,
      "title": "The Candy Tangerine Man",
      "mpaa": "",
      "actors": [
         "George Buck Flower",
         "John Daniels",
         "Richard Kennedy",
         "Meri McDonald",
         "Marilyn Joi",
         "Tallie Cochrane",
         "Patrick Wright",
         "Mikel Angel",
         "Brenda Fogarty"
      ],
      "imdbMovieId": "0072759",
      "originalTitle": "The Candy Tangerine Man",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sunset Boulevard is a lucrative place to work for the Black Baron, a pimp with a distinctive red and yellow Rolls Royce and plenty of girls on his books. He don't take no mess from his girls, his madam or his competitors and viciously defends his patch. First, he clobbers the Mob who attempt to move in on his patch. Second, he tracks down one of his girls who runs off with a suitcase full of his cash. Third, he disposes of two policemen. But by now he knows his pimping days are numbered, so after a final explosive gun battle he switches to being his alter ego, mild-mannered businessman Ron who lives out in the leafy suburbs with an unsuspecting wife and family.",
      "tmdbMovieId": 86462,
      "avgRating": 3.5,
      "releaseYear": "1975",
      "numRatings": 1,
      "posterPath": "/6kdLMEYWARCi2gIfcUl6B3IZ4HJ.jpg"
   }
}