{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "saving the world",
            "id": 83
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "werewolf",
            "id": 12564
         }
      ],
      "imdb_id": "tt1266121",
      "video": false,
      "title": "Wolvesbayne",
      "recommendations": [
         41237,
         48871,
         27896,
         36213,
         28593,
         42280,
         19010,
         30780,
         105772,
         408149,
         95609,
         24246,
         24555,
         293093,
         17004,
         35429,
         42302,
         60671,
         36737,
         59229
      ],
      "backdrop_path": "/aQjIA79GJ9J0l7M7lvxcUNi830i.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "592270a6c3a368774e068ca3",
         "content": "Too much going on and nothing going on. Couldn't capture my attention for more than a moment at a time.\r\n\r\n_Final rating:★ - Of no value._",
         "url": "https://www.themoviedb.org/review/592270a6c3a368774e068ca3"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Russel Bayne",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fdd9",
               "name": "Jeremy London",
               "profile_path": "/mPrdf7ypTQ4MBc9YcUgYlfopA0T.jpg",
               "id": 23646,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alex Layton (as Christy Romano)",
               "gender": 1,
               "credit_id": "52fe44aac3a368484e02fddd",
               "name": "Christy Carlson Romano",
               "profile_path": "/3qtwgZBEqGRej10SkNW5AtgA6Ye.jpg",
               "id": 76241,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lilith",
               "gender": 1,
               "credit_id": "52fe44aac3a368484e02fde1",
               "name": "Yancy Butler",
               "profile_path": "/emcS8cLp5aEEMdJS4Am0TLiX6WA.jpg",
               "id": 20759,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Von Griem",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fde5",
               "name": "Mark Dacascos",
               "profile_path": "/3wf7YSgHSEGzEJ3z7q0tL4Q4LZv.jpg",
               "id": 18702,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jacob Van Helsing",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fde9",
               "name": "Rhett Giles",
               "profile_path": "/hDJRbI9MVxlkMHX6tMS4S5G3U1T.jpg",
               "id": 30066,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Konstantinos",
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fded",
               "name": "Marcus Lyle Brown",
               "profile_path": "/gTD4oCMELMEXZ7wzoPqL01iNRGH.jpg",
               "id": 16460,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bryce",
               "gender": 0,
               "credit_id": "52fe44aac3a368484e02fdf1",
               "name": "Joseph Diaz",
               "profile_path": null,
               "id": 92650,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fdf7",
               "name": "Griff Furst",
               "profile_path": "/rRAtuKLOq27DFZ0MWu6FCVbbhS8.jpg",
               "id": 76021,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aac3a368484e02fdfd",
               "name": "Leigh Scott",
               "profile_path": null,
               "id": 30052,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aac3a368484e02fe03",
               "name": "Miles Hankins",
               "profile_path": null,
               "id": 564111,
               "department": "Crew",
               "job": "Compositors"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.180491,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24799,
      "vote_count": 18,
      "budget": 0,
      "overview": "The film is pretty much a \"by the numbers\" thriller that follows Russel Bayne (London) - who is bitten by a werewolf and quickly finds himself in the middle of a supernatural war between vampires, werewolves, and human hunters. To make matters worse, it seems the vampires are having a civil war with a clan breaking from the others in a quest to return the vampire goddess back to power.",
      "similar": [
         7131,
         6404,
         36647,
         36648,
         277,
         8698,
         6114,
         24021,
         49017,
         29095,
         10577,
         246741,
         138,
         2907,
         18239,
         834,
         50619,
         52520,
         76492,
         159824
      ],
      "original_title": "Wolvesbayne",
      "runtime": 87,
      "poster_path": "/nIZD4oIwpNuE51wYeINVeAkKdkD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2009-10-12",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Griff Furst"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Leigh Scott"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1266121/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTM5ODg2ODYwOV5BMl5BanBnXkFtZTcwNTQ4MDQ4NA@@._V1_UY268_CR14,0,182,268_AL_.jpg",
      "actors": [
         "Mark Dacascos",
         "Yancy Butler",
         "Rhett Giles"
      ],
      "reviews": [
         "Which goes for the plot, but also for the fact, that guy like Marc Dacascos would sign up for something like this. Of course it might have sounded better on paper (script). Still, if this were your first movie to see with him, you'd be excused if you thought, he shouldn't ever act again. That he actually has something to say, and also is not that bad in fighting (in movies), would be a fact that you'd miss out on. Maybe you should rent \"Drive\" instead. Apart from the thin characters and the very cliché story (no surprises here), there's also the weak FX and the poor production values. While everyone is of course trying to do there best, there is quite a few other films out there, that are worth to be noticed.",
         "In 1887, the powerful vampire Lilith (Yancy Butler) is vanquished by a vampire council and four amulets avoid her return to the world of living. In the present days, the greedy Realtor Russel Bayne (Jeremy London) is pressing Alex Layton (Christy Romano) to sell her store of esoteric products to him. While driving back home, Russel stops his Ferrari to help a young woman that has troubles with her Volkswagen Beetle in a lonely road. However, they are attacked by a werewolf and Russel transforms into one a couple of nights later. Meanwhile, a vampire clan led by the evil Von Griem (Mark Dacascos) is retrieving the ancient amulets to bring Lilith back. When Von Griem's minions try to abduct Russel, Alex helps him and Russel teams up with Jacob Van Helsing (Rhett Giles) and his peer group to avoid the return of the devilish Lilith. \"Wolvesbayne\" is a flawed but entertaining vampire movie that seems to be the pilot of a TV series. The story has a promising beginning, but suddenly the plot becomes a collection of clichés and special effects. The prosthesis of vampire teeth seems to be bothering Mark Dacascos and his grimaces and Yancy Butler is unrecognizable with a terrible performance. My vote is five. Title (Brazil): \"Anjo das Trevas\" (\"Angel of the Darkness\")",
         "Jeremy London is a greedy real estate developer who falls victim to the curse of the werewolf. A lot of vampire backstory is discussed before the story gets off to an interesting start, but then plunges downhill in a bunch of vampire clichés that would embarrass Anne Rice. The script is a muddled mess, full of full-blooded action scenes with predatory vampires guzzling on blood when they aren't trying to slay each other over the quest for some amulets. Everyone seems intent on overacting which only emphasizes the bad dialog. In the course of learning how humans fight vampires on their own turf, our hero undergoes a reformation of sorts. He leaves us with the departing words: \"There are more important things than making money. I'm off on a higher calling.\" Most outrageously hammy performance is delivered by YANCY BUTLER as Lilith. Most understated is RHETT GILES as Von Helsing. As for Jeremy London, I couldn't help think what a strong resemblance he bears to Brendan Fraser. He's okay and even manages to get some humor from his role, but the characters are all cardboard and not really worth caring about.",
         "Despite it being SyFy, Wolvesbayne did have a decent premise going for it. But for me it fell well short. Wolvesbayne isn't completely terrible, the werewolf transformation is decent, Jeremy London does what he can with an uninvolving leading role(in terms of character that is) and Yancy Butler as the evil vampire queen is sexy and seems to be enjoying herself even if she does verge on hammy in places. However, the remainder of the acting is not great at all, Mark Damascos is badly used with his big scenes very poorly written and anti-climatic, while a lot of the female roles read of looking as sexy as possible but little else. There are cheaper SyFy movies out there certainly, but the special effects are dire and some of the make-up is cheesy looking. The editing is choppy, even in the battle sequences. The battle sequences themselves are a disaster, there is no tension or anything compelling, there are too many characters on screen, the camera work is often incomprehensible and so fast in construction that it is difficult to make anything out and they also go on for far too long. The random shots of models are also very hokey and add absolutely nothing to the movie. The scenery is not necessarily bad, though they do lack atmosphere, but because of the rest of the visuals being so bad I couldn't enjoy it. What also matters hugely into making a good film also fails utterly. That is especially true in the story. This story had a lot of potential as there are some good ideas here. What was frustrating however was the case with most SyFy movies that have good ideas, Wolvebayne does next to nothing with these ideas. Any important parts are rushed through, and a lot of not so important parts are ridiculously dragged out. I also struggled to see if there was a story at all, it took forever to get going and when anything did happen it just didn't make sense for me. The script is incredibly clunky, while the characters are cardboard cut-outs that we know nothing about by the end of the film. The lead role is no exception here, he had potential also but his progression goes nowhere. Overall, fell well short despite its initial promise. 3/10 Bethany Cox",
         "Several hundred years ago the vampire Lilith (Yancy Butler) was banished into six amulets by her own kin, who were too disgusted by her vision of total dominance and human subservience. The council of vampires agreed to dispose of her threat, but a small following existed led by von Griem (Mark Dacascos) and this grouping is set to release her back onto humanity. Keeping watch over the peace is vampire-slayer extraordinaire Jacob van Helsing (Rhett Giles). Meanwhile hidden among humanity are werewolves like Alex Layton (Christy Carlson Romano), who are fully in control of their powers and transformations. Into the midst of all this comes mild mannered industrialist Russell Bayne (Jeremy London), who is trying to buy up Alex's small novelty shop for his new building project... Really needn't waste to much time on pointing out the weak spots in this movie, as almost everything is quite pathetic. This especially goes for nonsensical plot point or characters as well as some very rushed soap-opera style build-up. Some scenes are OKish, but in general a hack-job is in progress trying to mimic and home in on the success of Underworld. To no avail. The characters are not as 'cool' and the action sequences are mostly disappointing. Even Dacascos is severely misused and although he shows his potential in one or two scenes most of his fights are an anticlimax, as he has to cope with ultrabad screen partners. Any good points? Most actors manage to pull off a decent performance with Dacascos and Butler showing real promise (even though the really clichéd the role). The werewolf transformation was rather good and one vampiress is really sexy... And that's it folks... Really - if you have any say in the matter pass on this movie.",
         "Wolvesbayne is yet another entry in a long series of B-science-fiction movies produced by the now aptly-called scyfy channel. While their films have been getting ever-so-gradually better, albeit at a very gradual pace, this film does some things right and other things wrong. Originally described on an epic level, the film actually felt like a lukewarm introduction to a series. Enter a world where vampires live alongside humans and the like on a relatively peaceful level but a few vampiric dissenters wish to raise an old vampire goddess to reign-in humanity under vampire rule once again. Fans of the werewolf genre will be interested in knowing that the main protagonists are werewolves but that fact plays little if any part in the progression of the film and little is seen of either character's wilder side. These characters team up with an incarnation of Bram Stroker's Van Helsing to stop the occult vampire clan from taking over the earth, but mostly do so while on the sidelines. It all sounds good on paper, but the film is ultimately a disappointment with a somewhat disjointed and lengthy progression of the story and characters that don't appeal much to the audience. Jeremy London as the mild-mannered and yet irritably selfish realtor turned werewolf protagonist does a fine job in acting out his role but ultimately turns- out in being an otherwise dis-likable and incredibly uninvolved character. It would've been nice to see more of Christy Romano as the bad-ass lycanthropic vixen Alex Layton but she too serves little in the story's progression. On the vampire side of things, I actually liked Yancy Butler's cheesy role as vampire queen, and Dacascos' did a sinister but equally cheesy take as the leader of the Germanic vampire clan. Otherwise, the film also featured some minor plot-holes: such as an un-explained werewolf minion of the vampires and other unexplained origins. In the end the film was well filmed and featured a fair amount of violent action alongside some decent yet brief special-effects, but ultimately barely entertained you as it led to a mostly expected and unremarkable finish that suggested either a sequel or series.",
         "Supposed back door pilot TV movie(something I read connected to the film mentioned its the origin film for a new hero) about the battle of the werewolves with the vampires with an \"everyman\" cursed by there werewolves getting caught in the middle, or should I say muddle? This is another one of those SYFY films that lays out a great deal of material and then goes nowhere with it simply because the supposed continuation (in this case I'm guessing a series) never materialized. Allowing for the film's loose ends the real question is why are we bothering with the vampires and werewolves yet again? Actually what I'd like to know is which writer brought the supposed battle to the forefront and are they getting any money from all of the retreads? This is not bad as SYFY films go, but at the same time the material has been so done to death in the last four or five years that one has to wonder why we care any more. I was bored because the film brings nothing to the table and I had no idea why I was watching.",
         "Turned into a werewolf, a man teams up with a group of hunters tracking down a race of vampires looking to reincarnate a vicious vampire queen that will overthrow humanity and bring them back to prominence. All-in-all, this one was pretty decent but could've been a lot better. One of the biggest strikes is the rather jumbled plot here, with a lot more going on than what really should be happening and hardly any of it makes any sense or really feels justified in it's inclusion. Even more troubling is the fact that there's not a whole lot of plot discussion given out as time goes on, rather it's all given at the end and never really does a good job blending it all together. That is somewhat made up for by the rather fun amount of confrontations here, since it appears to be a war going on with both sides and it definitely feels that way here, especially given the amount of bloodshed given on both sides as several of the extended encounters get quite bloody. While there is some fun to be had here with the resurrection scenes as well, it really can't overcome the jumbled mess of a story though. Rated R: Graphic Violence, Graphic Language and Brief Nudity."
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Active Entertainment",
         "Bullet Films",
         "FIWI Entertainment"
      ],
      "summaries": ["In 1887, the powerful vampire Lilith is vanquished by a vampire council and four amulets avoid her return to the world of living. In the present days, the greedy Realtor Russel Bayne is pressing Alex Layton to sell her store of esoteric products to him. While driving back home, Russel stops his Ferrari to help a young woman that has troubles with her Volkswagen Beetle in a lonely road. However, they are attacked by a werewolf and Russel transforms into one a couple of nights later. Meanwhile, a vampire clan led by the evil Von Griem is retrieving the ancient amulets to bring Lilith back. When Von Griem's minions try to abduct Russel, Alex helps him and Russel teams up with Jacob Van Helsing and his peer group to avoid the return of the devilish Lilith."],
      "budget": 2000000
   },
   "movielensId": 164234,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-10-12",
      "dvdReleaseDate": null,
      "directors": ["Griff Furst"],
      "runtime": 87,
      "movieId": 164234,
      "title": "Wolvesbayne",
      "mpaa": "",
      "actors": [
         "Jeremy London",
         "Christy Carlson Romano",
         "Yancy Butler",
         "Mark Dacascos",
         "Rhett Giles",
         "Marcus Lyle Brown",
         "Joseph Diaz"
      ],
      "imdbMovieId": "1266121",
      "originalTitle": "Wolvesbayne",
      "genres": [
         "TV Movie",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The film is pretty much a \"by the numbers\" thriller that follows Russel Bayne (London) - who is bitten by a werewolf and quickly finds himself in the middle of a supernatural war between vampires, werewolves, and human hunters. To make matters worse, it seems the vampires are having a civil war with a clan breaking from the others in a quest to return the vampire goddess back to power.",
      "tmdbMovieId": 24799,
      "avgRating": 3.5,
      "releaseYear": "2009",
      "numRatings": 2,
      "posterPath": "/nIZD4oIwpNuE51wYeINVeAkKdkD.jpg"
   }
}