{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "slice of life",
            "id": 9914
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "storm",
            "id": 14527
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt5294966",
      "video": false,
      "title": "After the Storm",
      "recommendations": [
         315846,
         389972,
         25050,
         177945,
         79382,
         309028,
         287503,
         8937,
         38013,
         2517,
         98631,
         47748,
         176650,
         334991,
         400114,
         26935,
         296449,
         382170,
         60098,
         375315
      ],
      "backdrop_path": "/iHmuxmwRmFQHAuXZmDKVUO1GMo0.jpg",
      "revenue": 272132,
      "reviews": [{
         "author": "Reno",
         "id": "58b34302c3a368528d00b0e0",
         "content": "**A mother's one final push to save her son's marriage.**\r\n\r\nRemarkable consistency in delivering great dramas. If you are a drama film fan without the language barrier, then you must have seen at least a couple of films of Hirokazu Koreeda. Less than a year ago I saw his new arrival 'Our Little Sister'. Despite not overwhelmingly impressed with that, I won't say that I did not enjoy it. I always fascinated with the realistic portrayal, but the points should be executed so well than leaving empty scenes and dialogues, and calling it an art film. This one was much better. The first impression was okay, but after giving some time between my watch and writing this review, I kind of started to like it more.\r\n\r\nFirst of all, this story was not new for me. I have already seen a few similar themed films from other parts of the world, particularly in Hollywood. But none of them were as serious as this one while narrating its tale. The storyline was simple, entirely focused on a family, fighting on stumbling marriage. It was a long introduction, particularly aimed at a father, like how he messed up in his life with gambling. But opening few minutes made him look like a man of example. Only in the following event you would know how deep his troubles are.\r\n\r\nOther than his family, his work field was introduced to us. Being a writer, but for a few quick bucks working as a private eye on his part time, he misuses the opportunity with his loyal friend. Once the film reaches the half way mark, the focus shifts back to the family where the remaining story takes place. It was a stormy day and they all gather in his mother's apartment. This is where everything will be cleared out, whether the marriage will be saved or not. But the mother's one final push as it seems planned perfectly, would it deliver a result is what you should watch it to learn.\r\n\r\n> ❝I wonder why it is that men can't love the present. Either they just keep chasing whatever it is they've lost, or they keep dreaming beyond their reach.❞\r\n\r\nYou can't doubt Hiroshi Abe's presence. He was perfect along with Kirin Kiki, whose a few films I've seen before, but only started to notice recently with her amazing performance from 'Sweet Bean'. The casting looked great, and the locations. I always like films about elderly people, especially to highlight their struggle. And most of the Japanese films I have seen on that concept were just like the way I wanted. Maybe because there are lots of aging people in Japan than anywhere else. Just kidding.\r\n\r\nObviously dialogues are very important for a film and there were many good lines spoken. At one point in the final stage, it flips towards sentiments. Very touching conversation, particularly coming from an old and experienced woman, which is definitely worth taking heed. This is a family film. Despite about a marriage crisis, there is no speculation, like twist and turns. Interesting enough with its plain narration. True to its title and when the title part comes into play, that's where it gets its peak. With its nearly two hours runtime, the pace was acceptable, but patience needed for those got trouble with long films.\r\n\r\nThis is the film about our life, that we can try for what we want to be, but achieving it not easy, not everybody would succeed that. Accepting the fact, as life my go on was the message. Incredible writing and direction. Feels like straight out of a book, it's an original screenplay though. Surely you don't want to miss this film, from this director. Because if you do, it is equal to failing to watch the latest Woody Allen film. Only he's a Japanese version. My final words are the director already made his masterpiece(s), but still it is near to one compared to the international cinemas. So I'm not saying it is a must, but surely worth a try.\r\n\r\n_7½/10_",
         "url": "https://www.themoviedb.org/review/58b34302c3a368528d00b0e0"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Ryota",
               "gender": 2,
               "credit_id": "56816a0d9251414f6300a293",
               "name": "Hiroshi Abe",
               "profile_path": "/a2vyZunjEClKkP6e8QWy9aS0M9d.jpg",
               "id": 66155,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Yoshiko",
               "gender": 1,
               "credit_id": "56816a259251417ddd010fdc",
               "name": "Kirin Kiki",
               "profile_path": "/coAuKp7a67X44gyqJwVYTK4urVk.jpg",
               "id": 43663,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Kyoko",
               "gender": 1,
               "credit_id": "572fa0b292514108a900063f",
               "name": "Yoko Maki",
               "profile_path": "/i7ftZi8zm8mZcydTW0qU5fMGTJQ.jpg",
               "id": 592147,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Shingo",
               "gender": 2,
               "credit_id": "572fa10992514108a900064d",
               "name": "Taiyô Yoshizawa",
               "profile_path": null,
               "id": 1616970,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Chinatsu",
               "gender": 1,
               "credit_id": "583ac4149251416f6900f378",
               "name": "Satomi Kobayashi",
               "profile_path": "/hFt0MxUAHaZrPrsgqE7Amsk0OMd.jpg",
               "id": 238498,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kento Machida",
               "gender": 2,
               "credit_id": "58d520ec9251411fc502bf20",
               "name": "Sosuke Ikematsu",
               "profile_path": "/AtraZUobtnkTxhlxtPZP3EKyEs3.jpg",
               "id": 1116510,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Koichiro Yamabe",
               "gender": 2,
               "credit_id": "58d5212a9251411fdc02d473",
               "name": "Lily Franky",
               "profile_path": "/8T3I7KQX0SH6twXsuqe12Sc7Hxr.jpg",
               "id": 123739,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mitsuru Niida",
               "gender": 2,
               "credit_id": "58d52150c3a368125f02a8f3",
               "name": "Isao Hashizume",
               "profile_path": "/feeDRBuNzFzWfpgcHgUy79ZCYI2.jpg",
               "id": 554573,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56816a3ec3a3684be9010706",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57e99d34925141108400345a",
               "name": "Yutaka Yamazaki",
               "profile_path": "/gW8dR1Tb06MVqqG9e8Cayym4OBy.jpg",
               "id": 25646,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "58dea99d9251411ba600f979",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.907219,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 374671,
      "vote_count": 81,
      "budget": 0,
      "overview": "Ryota is an unpopular writer although he won a literary award 15 years ago. Now, Ryota works as a private detective. He is divorced from his ex-wife Kyoko and he has an 11-year-old son Shingo. His mother Yoshiko lives alone at her apartment. One day, Ryota, his ex-wife Kyoko, and son Shingo gather at Yoshiko's apartment. A typhoon passes and the family must stay there all night long.",
      "similar": [
         8065,
         146238,
         36557,
         83770,
         8052,
         10220,
         309242,
         910,
         17813,
         64689,
         273271,
         299,
         190469,
         886,
         12706,
         541,
         16269,
         28047,
         32044,
         11307
      ],
      "original_title": "海よりもまだ深く",
      "runtime": 117,
      "poster_path": "/lvan1AoDI7HDIJN9M6a6Lm19hs1.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fuji Television Network",
            "id": 3341,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "GAGA",
            "id": 3656,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bandai Visual",
            "id": 5844,
            "origin_country": ""
         }
      ],
      "release_date": "2016-05-21",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://gaga.ne.jp/umiyorimo/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hirokazu Koreeda"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Hirokazu Koreeda",
         "Hirokazu Koreeda"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt5294966/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM2NzU3NjAyMl5BMl5BanBnXkFtZTgwOTc3MjIwMTI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Hiroshi Abe",
         "Yôko Maki",
         "Satomi Kobayashi"
      ],
      "reviews": [
         "Most films these days do not have something to 'say' anymore. They don't have a deeper meaning. And if they do, it's mostly superficial or so complex you don't really understand. 'After the Storm' by Hirokuzu Kore-eda has something to say, it's like a condensed moment of life. You will be dumbstruck by it's beauty. The story deals with Ryota, struggling with financial problems, and trying to keep contact with his son after divorcement. He works as a private detective, spying on affairs and looking for lost cats while his real passion lies in writing literature. The entire film is built around a central story part where they take shelter from a taifun, it involves scenes of such profound beauty, you will be moved to tears. The beauty lies in the things that are not spoken out, yet linger in the air like rain: the missed opportunities to be happy, love gone by and yet - still there. To say the film deals with abandoned dreams in the face of reality is wrong, it's the contrary. The film says: If you keep waiting for beauty in life, you will not realize that it has already arrived. Just not the way you thought it would.",
         "There are not many directors whose films I greet with enthusiasm, let alone Japanese ones. I think Hirokazu Koreeda is the only one. His films are a different breed - simple in design, but brilliant in architecture and sublime in closure. Koreeda is the leading exponent in contemplative cinema. Under his minimalist approach, the essence of familial life and couplehood is distilled into abstract thoughts lingering like warm tendrils wrapped around your mind. The movie may be over but it refuses leave the confines of your consciousness and you would want to surrender to its warm lull again. The tone of After the Storm is pitch-perfect - nobody screams in your face, there are no pointing fingers, no low brow soap-opera. The acting is exquisite and nuanced. What is not said speaks louder than what is uttered. There is humour of the familiar kind; it is the kind of humour you laughed heartily because it is so familiar and you recognise the situations because you have gone through them before. There are not many filmmakers who are as sensitive as Koreeda. Above all else, this is a director who listens to characters' inner thoughts and emotions like an old master piano tuner and he knows how to calibrate the performances for everlasting emotional heft. For Koreeda, it is always about the small moments leading to the big truths. After the Storm is not one of Koreeda's best films (it needlessly took too long to establish Ryota's character) but it easily transcends way above all the flashy films that inundate our cinemas like ants to candies. I wish I had a notebook last night because some of the metaphors are amazing. Here is one, asseverated by the grandmother Yoshiko, \"The longer a stew sits, the more flavour it develops, just like people.\"",
         "After The Storm is an absolutely brilliant film, as it deals with the trials and tribulations of a father & perceived loser in the face of challenging life circumstances. Hiroshi Abe plays the role of Shinoda Ryota, a detective that is financially broke, divorced and living in the illusion of his past glory as an award winning author. He struggles to make ends meet and often resorts to gambling, stealing and backhand deals that involves extortion in order to support himself and to pay child support for his only son, Shingo. Another eye-catching performance to look put for is by Ryota's mom, Yoshiko, played by Kirin Kiki. She absolutely nails the role of a bewildered, lonely and regretful single grandmother, often dwelling on the unfortunate circumstances of the past and blaming her late husband for how her son turned out. She provides most of the comedic moments in the movie, as her tendency to be over-bearing and cheapskate at times, will make you giggle in the very least. She also seems obsessed and resigned to the idea that she will die alone, hence she keeps requesting her son & daughter to keep her company as much as possible. On top of that, she also harbors the faint hope that her son can be re-united with his ex-wife, and tries to set them up to sleep together during a night of storm. Overall, the theme of After the Storm is dealing with the present circumstances in the face of unrealized dreams and broken hopes. This theme is strong in the characters of Ryota and Yoshiko. Additionally, Ryota's ex-wife, Kyoko (played by Yoko Maki) also plays an important role as she embodies the person whom manages to focus her life solely in the present times. Whilst Ryota still perceives himself as the father responsible for Shingo's journey through his current childhood phase, Kyoko has moved on and has accepted the fact that Ryota was never cut out to be a responsible father. She has even found a new boyfriend and except for the monthly visit, would rather Shingo not be spending time with his actual dad. What really catches the eye about this movie, is that even in a fully developed country like Japan, with is high standards of living and apparent high-culture, there exists people like Ryota; someone who is left behind by the fast-moving economy and rebels against the norm of participating in the corporate rat-race to succeed career-wise. He can be pictured as someone who is very defensive whenever questioned on his life choices and habits. However, just like a starry-eyed young graduate, Ryota had dreams of his own for a stable government job, which somehow never came to be. However, the pride in him never dissolves, as the once Award-winning author still feels he deserves recognition for his past work.",
         "Fear that your children may mimic your worst qualities is the driving force in Hirokazu Koreeda's (\"Our Little Sister\") After the Storm (Umi yori mo mada fukaku), a compassionate look at the struggles of a Japanese family. Its title derived from the lyrics of an old pop song, the film is set in Kiyose, a city near Tokyo where it is beautifully shot in the housing compound where Koreeda grew up by cinematographer Yutaka Yamasaki. Ryota Shinoda (Hiroshi Abe, \"Everest: The Summit of the Gods\") is a novelist who has not had a story published in fifteen years and is forced to work for a private detective agency, which he claims is solely to do research for his next novel. Using his detective job to spy on Kyoko's new boyfriend with the help of his young detective-partner (Sosuke Ikematsu, \"Mubansô\"), he learns that she is dating a wealthy businessman who is intrusive in Shingo's life. A gambling addict who squanders much of his earnings, Ryota's relationship with his young son Shingo (Taiyo Yoshizawa) is in jeopardy as his ex-wife Kyoko Shiraishi (Yoko Maki, \"Like Father, Like Son\") threatens to keep him from seeing Shingo until he catches up on his child support payments. The first time we see Ryota we are not impressed. He is going through his recently deceased father's private belongings to see if he can find anything that he could sell. It seems, however, that his father was also a gambler and Ryota's search might have been better conducted at the local pawn shop. While it is clear that he is not a role model for parenting, Ryota is man of considerable charm and Koreeda does not stand in judgment of his actions but depicts his travails with warmth and humor. We see that in spite of his dubious habits, his sister (Satomi Kobayashi) and his employer are both willing to lend him money. With the help of his own mother, the spunky and very astute Yoshiko (Kirin Kiki, \"Our Little Sister\"), Ryota has his sights set on reuniting with Kyoko and Shingo. His love for his son is very real but he seems incapable of breaking from his demons, the same ones that dominated his father's life. Attempting to win back Shingo's love, he takes him out for a hamburger, buys him new shoes, and visits Yoshiko, the boy's beloved grandmother. Knowing that a typhoon is on the way, the family comes together to spend the night and to wrestle with the direction that their lives will take. \"Why can't men ever love the present,\" Yoshiko wonders, highlighting an important message of the film, that people must accept the reality of how they really are. While there is truth to the idea that we must accept who we are, there is a thin line between accepting your limitations and recognizing that you have the power to transform your life, to live the life you want rather than the life you are resigned to. Also, while the idea that sons will always take after their father is accepted without question, the reality in my experience is that sons will either take after their fathers or make very sure that they do not. After the Storm is one of Koreeda's best films and, as always, he elicits exceptional performances from children as well as brilliant takes by Kiki and Hiroshi Abe, but, in my view, its message is debatable.",
         "In a relatively short time span, I've seen three films by Hirokazu Kore-Eda, and I'm planning to see many more. It seems most of his work is focused on family relations, and his films are touching, heartfelt real life dramas. The raw material for Kore-Eda's films are emotions, and the ways his protagonists express them in words and by their behaviour. Like the two other films I've seen ('Our Little Sister' and 'Like Father, Like Son'), 'After the Storm' deals with parents, children, grandchildren and siblings. In this case, the central character is a divorced writer with financial problems, who has taken a job as a private detective to make ends meet. To keep up appearances, he pretends the job is a way of doing research for a new novel, but everyone knows there is no book. His young son is very fond of his grandma, so they go visit her. But typhoon number 24 is approaching fast, and when the writer's ex-wife comes to the apartment to pick up the boy, the bad weather conditions prevent them from going home. They have to spend the night at the grandmother's house, just as if they were a normal family. And in a way, they almost are, during that one special night. After the storm, everything has returned to normal, except that the four of them are closer than they were before. The last shot is full of symbolism: the sun shines, but several broken and abandoned umbrellas are the witnesses of the stormy night. It takes superior film making skills to turn such a story into a good movie. The emotions have to be measured out with care, in order to prevent it from turning into a tearjerker. The dialogue has to be natural, but at the same time not superficial. And the actors have to be completely believable. Just leave it to Kore-Eda: every scene is a joy to watch. It's those little things that make his characters so real: when his mother starts pleading him to stay the night, the writer says: oh, mother, please don't use this voice like you're almost dying. These are exactly the things mothers and sons say to each other, with a mix of affection and irritation. The director also gives little hints and references which you only fully understand after a while. At the very beginning, the writer's mother remarks that a neighbour has moved to a bigger house. Only much later we learn that this has always been her own dream, and that she's tired of her own tiny apartment. I think it takes a second viewing to get all the tiny hints sprinkled throughout the story. Are we what we hoped to be? And what was it exactly we hoped to be? Those are the questions 'After the Storm' deals with. There are no clear cut answers. But thinking about the questions makes this film worthwhile.",
         "Remarkable consistency in delivering great dramas. If you are a drama film fan without the language barrier, then you must have seen at least a couple of films of Hirokazu Koreeda. Less than a year ago I saw his new arrival 'Our Little Sister'. Despite not overwhelmingly impressed with that, I won't say that I did not enjoy it. I always fascinated with the realistic portrayal, but the points should be executed so well than leaving empty scenes and dialogues, and calling it an art film. This one was much better. The first impression was okay, but after giving some time between my watch and writing this review, I kind of started to like it more. First of all, this story was not new for me. I have already seen a few similar themed films from other parts of the world, particularly in Hollywood. But none of them were as serious as this one while narrating its tale. The storyline was simple, entirely focused on a family, fighting on stumbling marriage. It was a long introduction, particularly aimed at a father, like how he messed up in his life with gambling. But opening few minutes made him look like a man of example. Only in the following event you would know how deep his troubles are. Other than his family, his work field was introduced to us. Being a writer, but for a few quick bucks working as a private eye on his part time, he misuses the opportunity with his loyal friend. Once the film reaches the half way mark, the focus shifts back to the family where the remaining story takes place. It was a stormy day and they all gather in his mother's apartment. This is where everything will be cleared out, whether the marriage will be saved or not. But the mother's one final push as it seems planned perfectly, would it deliver a result is what you should watch it to learn. ❝I wonder why it is that men can't love the present. Either they just keep chasing whatever it is they've lost, or they keep dreaming beyond their reach.❞ You can't doubt Hiroshi Abe's presence. He was perfect along with Kirin Kiki, whose a few films I've seen before, but only started to notice recently with her amazing performance from 'Sweet Bean'. The casting looked great, and the locations. I always like films about elderly people, especially to highlight their struggle. And most of the Japanese films I have seen on that concept were just like the way I wanted. Maybe because there are lots of aging people in Japan than anywhere else. Just kidding. Obviously dialogues are very important for a film and there were many good lines spoken. At one point in the final stage, it flips towards sentiments. Very touching conversation, particularly coming from an old and experienced woman, which is definitely worth taking heed. This is a family film. Despite about a marriage crisis, there is no speculation, like twist and turns. Interesting enough with its plain narration. True to its title and when the title part comes into play, that's where it gets its peak. With its nearly two hours runtime, the pace was acceptable, but patience needed for those got trouble with long films. This is the film about our life, that we can try for what we want to be, but achieving it not easy, not everybody would succeed that. Accepting the fact, as life my go on was the message. Incredible writing and direction. Feels like straight out of a book, it's an original screenplay though. Surely you don't want to miss this film, from this director. Because if you do, it is equal to failing to watch the latest Woody Allen film. Only he's a Japanese version. My final words are the director already made his masterpiece(s), but still it is near to one compared to the international cinemas. So I'm not saying it is a must, but surely worth a try. 7½/10",
         "I watched this movie yesterday at the Bengaluru International Film Festival. I walked into the movie with absolutely no expectations, the movie started off on a good note. I was really impressed with the way the characters of the movie have been crafted. Each of them very relevant to middle class families struggling to meet their ends. I absolutely loved the humour and I so badly wished I knew Japanese. It is a different thing to get the gist out of subtitles. The people in the cinema hall enjoyed at the subtle moments between the characters. The actor playing the hero was a class apart. He was very lovable and I could feel myself experience the troubles and tribulations along with him. The kid has played the role very sincerely. Overall I would definitely recommend the movie to any fan of Asian cinema. Kudos !!",
         "\"After the Storm\" is another great Hirokazu Koreeda movie. It is touching, it gives time to the characters and the plot to breathe and develop, and it gives food for thought. And all in a movie that doesn't try to over-complicate things. Ryôta is a failure. He started as a writer, published a book that got an award, and married and had a child. However, nowadays he just believes he writes, he's divorced, with a non-existent relationship with his son. He also tries to steal money from his mother. On top of that, he uses his 'job' in a detective's agency to extort people and to stalk his ex-wife. And all the money he gets he loses on bets or pachinko. What we get from here is Ryôta and his relationships with the people that surround him. And Koreeda does a great job in creating great moments from little moments. It helps that the plot keeps things straightforward but non-stop and that he has surrounded himself with great actors, from the always amazing Hiroshi Abe to funny and ironic Kirin Kiki. Just having the actors delivering the lines and their banter make for a great time. And it doesn't forget the more serious moments, as Ryôta's problems with gambling or his inability to deliver on the responsibilities and decisions he takes. Totally worth checking out.",
         "A few months ago serendipity brokered a meeting between me and an exquisite film from Japan entitled Our Little Sister. I was totally captivated so much so that I watched it again within days and bought the DVD as soon as it appeared. This week another film by the same director - who also, it appears, works on the screenplays of his movies - was released in London. I found it had already been written about in glowing terms here on IMDb and I noted with interest that the comments came from several different countries around the world, testifying to the universal appeal of this minimalist filmmaker. It's difficult to conceive that this virtually invisible style of acting co-exists in the world of, say, Robert de Niro, Dennis Hopper, etc, where the goal seems to be last one to be sectioned is a sissy. After The Storm is yet another sublime essay about ordinary people coping with everyday traumas or not, as the case may be. Though it's churlish to single out any one actor it's equally hard not to wallow in the beautiful performance of Kirin Kiri as the mother/grandmother coping with the dysfunctional son and his fractured family. A true gem.",
         "In modern times, foreign language movies have made a huge and long lasting impression on cinema and have pulled many viewers towards them. With movies such as Children of Heaven, A Separation, The lives of others and Incendies, foreign cinema has contributed a lot to the film industry. Iranian and Japanese cinemas, in specific, have amazed us with some masterpieces in the past. After the Storm is one of many Japanese movies which not only have entertained us with its solid screenplay but have also raised a lot of questions to put our minds to some exercise. After the Storm, directed by Hirokazu Koreeda, circles around a private detective who loses his money in gambling and then struggles to pay child support money. He undergoes several problems and issues to reconnect with his son and ex-wife. Hirokazu have made some very good movies in the past such as Nobody Knows and After Life but After the Storm is the best of his work. The movie doesn't include any major plot twist rather it's entirely based on family dynamics and it's a domestic melodrama, filled with emotional speeches and ferocious acts of parental selfishness. Ryota, the lead character, works for a private detective agency and has a son but after the death of his father he seems to have lost the control of his life, wastes all his money on racing tracks and ends up as same kind of father as the man who raised him. His ex-wife Kyoke is also shown as a confused individual who is worried about her future prospects and Shingo, his son, seems to be on the same path of uncertainty and struggle as his parents. The best thing I have extracted from the movie is the idea that there are so many things of great value in our life but we never realize their true significance till we lost them. It also reminds us that nothing is more important than the moment you are currently in. Koreeda's After the Storm is slow-paced, sad and apologetic. The movie questions one of the basic human behavior that how to move forward amidst all the frustration and loss and leaves it to the viewers to find their own answer. The character of Ryota tells us a lot about how time can change so drastically and how things go wrong for you all at once. A former prize winner for his novel ends up as a failure to his own self, to his son and his family. But life isn't about giving up rather it's about standing up every time it tries to keep you down. And Ryota tries to overcome his loss although he falls short every time. The movie tells us that even if we lose control of our lives we can take it back, it's all about our attitude towards our loss. Life demands a lot from us, sometimes it tests our resolution and calls for our persistence because we can try for what we want, but achieving it not easy as it is exhibited by Hirokazu through his masterpiece. After the Storm is about the intimate struggle of moving forward and brings forward the lesson of keep on trying, no matter how hard the life is, because you can only achieve when you're ready to endure the pain beyond your limits. What is lost can be won again, it's only the matter of belief and grit. Screenplay of After the Storm is beyond any admiration as Hirozaku has beautifully portrayed the life of a common man and have magnificently summed up the struggle of moving forward in this life. The story doesn't have any loopholes in it, it connects the characters with such perfection that viewers never lose the plot. It binds its viewers with such strong force that make them able to both enjoy the movie and listen to the truth the movie speaks. Although the direction of the movie is flawless but its screenplay has come out as the most promising production element. Above discussion can be concluded with the biggest truth we learn from the movie, life is less about getting what you want than it is wanting what you get.",
         "Loved the raw picture of a modern culture in which people are getting by with 1000 year tradition behind them yet battling new world problems. As if a piece of a puzzle, you witness just one unit of this society politely confronting each other with themes of death, separation, ego, love, and trust. The film's tone, tempo, picture was pleasant and the story unfolded well. I guess I'm the target audience age group so the resonance struck well with this film.",
         "I had high hopes for this movie but found it very lackluster and slow. While the promotional information about the movie sets out the background for the story, it never really got off the ground. The start and bulk of the storytelling is focused on the Ryôta, the Father at the center of the story. The pace of the story telling is very slow and really goes in to a lot of minuscule and non-necessary detail and scenes that are not really relevant to the overall story. While there were some humorous dialogue and lines, the delivery of these and the timing from the actors was not that great. I really struggled to find something positive to say about this movie but I kept being let down as the movie progressed. While I understood the story that was trying to be told, I just felt it left you wanting and empty.",
         "Some of the Japanese films not adapted from the clueless, childish and absurd Japanese comics books like this one and \"Aruitemo aruitemo(Still Walking) 2008\" were the living proof that Japanese can still make normal, more down to earth, serious enough movies. They are instant classic. Thanks to IMDB's Trivia, allowing me to know that the title of this film was originated from the lyrics, a beautiful song sang by the immortal Teresa Teng. Also, what I'd like to point out here is, Kirin Kiki's, the \"Mother\" role she played in both of the films are just speechlessly superb!! One of the very best supporting female actors I've rarely found in recent years. Her performances had made these films look more real and natural. Every act moment by her in these films should be seriously studied if you want to know what is the ultimate \"Performing Art\". I wish both the Japanese and American movie industries could abandon doing movies adapted from their comics books, especially away from those unrealistic fantasies as those ridiculous \"Super heroes\" violent junk, and return to the real world.",
         "This film tells the story of a failing novelist who turns to be a private detective to make ends meet. He has a gambling problem unfortunately, therefore his salary goes to gambling instead of child support. His ex wife is less than happy, and threatens to stop monthly visits if he doesn't pay. The story is slow and uneventful, even though a storm is approaching. Viewers get a glimpse of the novelist's failing life, and it can be seen that he still lives in his pride from his award winning novel from over a decade ago. His interpersonal relationships are quite messed up, as he alienated his family members with his previous financial failures. On one hand, I do wish that his life will pick up and be great again, but on the other hand, I can't really care less. Most of the screen time, especially towards the end, I just wished​ the film would end soon because I was quite bored.",
         "Hard to find anything to say in favor for this two hour long, badly acted and poorly directed offering. I would like to because I saw it with the director sitting more or less next to me and he spoke for a while before the showing, and seems a nice chap. But his movie was nothing more than a soap opera. The lead had a couple of faces he pulled. Sad. Perplexed. That was his limit as far as acting goes. His old mum played at being an old mum and the ex wife went through the routine of the ex wife, who might or might not still love the hubby. And please don't get fooled like me. This film has nothing to do with a detective. Or an author. That's just the press trying to get you interested because detectives are good box office. The director, to make things worse, has only four shots. Mid shot with actors in the foreground talking to actors behind without looking round. Close ups of inanimate objects. A pan of soup. A cup of tea. Then into a close up of a head about to say something 'important'. And exterior shots where actors stand facing the camera and talk and talk and talk. And there is a lot of talking. But nothing gets said. This movie had the same effect on me being forced to listen to someone talking non stop on their cell phone. I don't buy different countries have their own way of doing things. Outside Hollywood, the rest of the world have a common approach to movie making. This film fails miserably to reach any of the standards set by this common community.",
         "While not yet proving to be quite as prolific as the great masters Ozu, Mizoguchi and Naruse at their most busy, there is becoming something routine about another year and another trip to Cannes for perhaps Japan's best current working director, Kore-eda Hirokazu. There is a clear progression from his bleakly haunting first three films, 'Maborosi', 'After Life' and 'Distance' to a more routine playground of 'shomin-geki' (lower-middle class family drama), moving from more complex ennui to a more mainstream exploration of various unusual family scenarios. 'After the Storm', the most recent lover he took with him to southern France, certainly feels like a follow-on from his previous works 'Still Walking' and 'Kiseki'. Here, the family get-together of 'Still Walking' is replaced by the impromptu night-in to weather the storm, with Kirin Kiki and Hiroshi Abe reprising their roles as mother and prodigal son; and 'Kiseki's' Koichi is replaced by Abe's Ryota: a grown man who can't move on from his divorce from his wife and son, Kyoko and Shingo. With the cast also featuring other now established Kore-eda 'family' members, in the form of Lili Franky and Yoko Maki, this could all start to feel a little too familiar. Though he would not be the first great director to embrace this approach. Suitably unshaven, Ryota is a recent divorcée, struggling to come to terms with his new position. A former novelist, enjoying some minor success with his novel 'The Empty Table' fifteen years previous, he now finds himself working as a private detective, betraying the trust of both his boss and untrustworthy clients; gambling heavily, living alone. Not only losing his wife and son, he has lost the respect of others, and even himself. His ex-wife can't rely on him to pay child support; his sister believes he is only after their mother's meagre funds; and his boss knows he is moonlighting behind his back. The only ones showing any positivity towards him are his mother, in the form of witty banter about how useless he has become, much like his father; his work colleague, Kento, who begrudgingly lends him money to gamble away; and his son, whose indifference to him is as good as he can get. His attempts to win Kyoko and Shingo back, in his sly, underhand manner, therefore, are never going to work. By purposefully taking Shingo to his mother's small apartment as a typhoon approaches , he hopes to lure Kyoko to spend the night as a family with his deceit, unable to grasp that it is acts such as this that pushed her away in the first place. He is a man above his station, and in pursuing his second novel, that everyone can see will never happen, turns down lucrative offers to write more mainstream manga, as he believes it compromises his artistic integrity which died long ago. His profession now to watch others, Ryota has become completely unaware of himself and the impact of his actions on those around him. Playing the victim, he is never the bad guy. Comparisons are often made to his father, harking to Kore-eda's previous title 'Like Father, Like Son'. Kyoko can see the future she would be offered with Ryota, in the form of her former mother-in-law's cramped apartment where she is forced to spend the night: As an elderly woman, left alone and near penniless by her husband's rash actions. Whereas Ryota can only see the past. Eventually realising that he is only deceiving himself (urgh, I just wrote that!), as the storm passes and the fresh morning awakes, he starts to come to terms with this. This may all seem quite obvious and light, wondering if Kore-eda has lost a bit of spark, getting too comfortable in his work. And indeed, you may wish for a more dark perspective as in his earlier days. But the realism holds, and the wit of the script raises a smile. The cast perform their roles in a way that is believable, avoiding soap opera clichés and social stereotypes; and the stark soundtrack steers it away from melodrama. Yes, this is more of the same, but in the same way that Ozu remade his own 'Late Spring' with 'An Autumn Afternoon'. The formula is working, and with enough bite to keep it away from the daytime TV nicety, ensuring that the familial isn't too familiar just yet. politic1983.blogspot.co.uk",
         "I read some reviews and with a 7.5 score I went to see this movie. The movie was terrible, one of slowest, most meaningless movies I have ever seen in my life. No dialogue, no emotion, no plot of any kind. Just a bunch of meaningless conversations that last for hours and hours. I didn't get anything away from this movie, just 2 hours of complete boredom.",
         "the trailer is great. the film, not as much. ryoto, (abe hiroshi), a divorced father, is behind in everything, including life. at 35 he had 15 minutes of fame for publishing a novel. at 49, he hasn't written anything in years and is living a rudderless existence. he is at least two months behind in child support payments. he spies on unfaithful partners for a living and that includes spying on his ex wife and her new boyfriend. he pumps his son for information about his mother. he is surrounded by enablers, who, of course, keep him afloat. and at 1:57 minutes, the movie seems long. this is not to say I didn't like the movie. the pace is slow, though."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Aoi Promotion",
         "Bandai Visual Company",
         "Fuji Television Network"
      ],
      "summaries": [
         "Dwelling on his past glory as a prize-winning author, Ryota (Hiroshi Abe) wastes the money he makes as a private detective on gambling and can barely pay child support. After the death of his father, his aging mother (Kirin Kiki) and beautiful ex-wife (Yoko Make) seem to be moving on with their lives. Renewing contact with his initially distrusting family, Ryota struggles to take back control of his existence and to find a lasting place in the life of his young son (Taiyo Yoshizawa) - until a stormy summer night offers them a chance to truly bond again.",
         "After the death of his father, a private detective struggles to find child support money and reconnect with his son and ex-wife."
      ],
      "budget": 0
   },
   "movielensId": 164204,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2016-05-21",
      "dvdReleaseDate": null,
      "directors": ["Hirokazu Koreeda"],
      "runtime": 117,
      "movieId": 164204,
      "title": "After the Storm",
      "mpaa": null,
      "actors": [
         "Hiroshi Abe",
         "Kirin Kiki",
         "Yoko Maki",
         "Taiyô Yoshizawa",
         "Satomi Kobayashi",
         "Sosuke Ikematsu",
         "Lily Franky",
         "Isao Hashizume"
      ],
      "imdbMovieId": "5294966",
      "originalTitle": "海よりもまだ深く",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["i0lr6hfRG9s"],
      "plotSummary": "Ryota is an unpopular writer although he won a literary award 15 years ago. Now, Ryota works as a private detective. He is divorced from his ex-wife Kyoko and he has an 11-year-old son Shingo. His mother Yoshiko lives alone at her apartment. One day, Ryota, his ex-wife Kyoko, and son Shingo gather at Yoshiko's apartment. A typhoon passes and the family must stay there all night long.",
      "tmdbMovieId": 374671,
      "avgRating": 3.48649,
      "releaseYear": "2016",
      "numRatings": 37,
      "posterPath": "/lvan1AoDI7HDIJN9M6a6Lm19hs1.jpg"
   }
}