{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "korea",
         "id": 10586
      }],
      "imdb_id": "tt2086953",
      "video": false,
      "title": "Dangerously Excited",
      "recommendations": [133983],
      "backdrop_path": "/uFmMpXlspwFMZmttEzBcMfa8Eu1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Han Dae-hee",
               "gender": 2,
               "credit_id": "52fe4ae49251416c750f18d1",
               "name": "Yoon Je-moon",
               "profile_path": "/3IIcZsGsgwv1hqsyGx2rx8JNPOA.jpg",
               "id": 141541,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mi-seon",
               "gender": 1,
               "credit_id": "52fe4ae49251416c750f18d5",
               "name": "Song Ha-yoon",
               "profile_path": "/3jzVlSKFDHMOPT7ChqNPJ8yHceo.jpg",
               "id": 1046862,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Min-gi",
               "gender": 0,
               "credit_id": "5309fa609251411108003617",
               "name": "Sung Joon",
               "profile_path": "/cCnqoNMWGebMG3qHZ1lqorA43aj.jpg",
               "id": 1254579,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Yeong-jin",
               "gender": 0,
               "credit_id": "54622bc9c3a3686f2e0023a1",
               "name": "Seo Hyeon-Jeong",
               "profile_path": null,
               "id": 1384537,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Soo",
               "gender": 0,
               "credit_id": "54622bd2c3a3686f2b00256f",
               "name": "Kwon Soo-Hyeon",
               "profile_path": null,
               "id": 1384538,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Saku",
               "gender": 1,
               "credit_id": "56ba5edac3a3687ca1000a02",
               "name": "Kim Hee-jung",
               "profile_path": "/nUHpI1cqUhDl1qlijJxqsO2ysOb.jpg",
               "id": 1334718,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ae49251416c750f18db",
               "name": "Koo Ja-hong",
               "profile_path": null,
               "id": 1117483,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5309fb7b9251415e71000a34",
               "name": "Koo Ja-hong",
               "profile_path": null,
               "id": 1117483,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5309fded925141110e003968",
               "name": "Jaeho Oh",
               "profile_path": null,
               "id": 1295759,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.614027,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 142533,
      "vote_count": 4,
      "budget": 0,
      "overview": "HAN Dae-huei, a public official in charge of residential pollution of Mapo district. No one can disturb his composure: a man who never loses his temper: a man of tranquility; the apotheosis of snobbery. He is a typically unenthusiastic public official up to his bone. Never expect him to try a new thing or change anything.",
      "similar": [
         59421,
         10253,
         160704,
         252067,
         396535,
         491329,
         72190,
         11423,
         113,
         11658,
         200085,
         437068,
         388757,
         2440,
         242452,
         13855,
         1963,
         363579,
         407887,
         293670
      ],
      "original_title": "나는 공무원이다",
      "runtime": 101,
      "poster_path": "/c01AYWMMO6OAdy01NJlQh7AVjiu.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mapofilm",
         "id": 38099,
         "origin_country": ""
      }],
      "release_date": "2011-02-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ja-hong Koo"],
      "runtime": 101,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt2086953/",
      "coverLink": null,
      "actors": [
         "Je-mun Yun",
         "Ha-yoon Song",
         "Jun Sung"
      ],
      "reviews": [
         "I know how the hero of South Korean film \"Dangerous Excited\" initially feels about the disturbance he has to live with. During my undergraduate years, I always spent my time at the campus library in the evening after the lectures were over, and I frequently heard the noise from the basement level of the building right next to the library. We had one or two campus rock bands at that time(we still have, by the way), and they kept making lots of noise whenever they were practicing with their instruments. When I came out of the library to buy some snacks or drinks at the store on the first floor of that building, it was common to see the building vibrating with the noise from the below. I was sort of curious about what exactly they were doing on the basement level, but I did not want to go there because it was already quite loud enough to annoy my eardrums on the first floor. Han Dae-hee, deftly played by Yoon Je-moon, finds himself surrounded by such a noise problem like that after when he comes across the members of a college rock band named '3X3=9'(don't ask me what that name means). At first, he comes to them as a public servant taking care of the petitions from neighbourhood due to the noise they make during their practice, and they look like just another work in his daily life. He notifies them that they are making too much noise and they can be evicted because of that, so they try to find another place for their practice. However, they get swindled by a broker, and they come to Dae-hee for help, and he reluctantly lets them into their house. He soon finds that it is nearly impossible to sleep during night because of their constant practice in the storage room below his bedroom; even with the ear plugs in his ears, he can hear and feel the noises generated from their practice. He is annoyed, but Dae-hee is a rare case of South Korean male – a man of calm, contented life style. In South Korean society, you can often come across many unpleasant sights of guys openly letting out their anger and stress to others, and Dae-hee and his co-workers sometimes encounter such people like them while working as public servants. Dae- hee always deals with them with courteous calmness, because he knows that it is a waste of time to be angered by these angry jerks. When one of them shouts at him on the phone, he quietly asks him to say less loudly(\"When you lose your temper, you lose\", he says to us). In addition, he is a very good employee; he is very talented in preparing presentations with Microsoft Powerpoint program, and, as a graduate student who has to make a presentation for weekly lab meeting, I would be glad if he told me one or two valuable lessons on making a good presentation file. His private life is nearly insulated from outside. His house is quiet and barren except few furnitures and some books for gaining trivial knowledges to impress his co-workers. But he is not that lonely, and he has been satisfied with his life style. He sometimes has a drink with his close friend who works in the same department, but he prefers to spend his free time at his house when the work time is over, and he usually enjoys watching TV shows in the living room, where only furnitures seem to be his big sofa and TV. When his comfortable life is getting disrupted by the noise from his unwelcomed guests, Dae-hee tries to find a way to deal with it while maintaining his usual calmness. But the noise keep emanating from the below, and something is gradually excited somewhere in his mind. He studies rock music in his own way through those cheap encyclopedic books you can find at bookstores in South Korea, which can tell you many trivial things about Rolling Stones or Bob Dylan while not teaching you anything about music itself. He finds old rock music records owned by his younger brother in the attic and attentively listens to them. When the band is on the verge of being broken up, he becomes their unlikely supporter – and their bassist, though he knows nothing about how to play instrument. As a man who finds the possibilities outside his daily life, Yoon Je- moon, who has been a supporting actor in several South Korean films including \"Mother\"(2009), gives a wonderfully nuanced performance at the center of the story. Dae-hee is an interesting character to observe because he has his own way of living along with a funny view on his society and its people, and I enjoyed the insightful observations in his narration. Yoon effectively conveys the small changes inside his character to us while rarely emphasizing them; his life is not changed a lot in the end, but we can sense that he is a little happier than before. I must say the music in the film is not that impressive, but that is intended as another funny part in the movie. The band members may have passion toward their music, but, to be frank with you, they will probably be bound to be a second-rated rock band if they fail to improve themselves(Spinal Tap looks not so lousy compare to them). Some of them are hopelessly naive about their future, and others know how mediocre they are as a group. Dae-hee is no big help to them except helping them as a substitute bassist; he knows a lot about the famous rock singers thanks to his 'study', but he really has to learn how to play bass in an adequately presentable way in the concert they will participate in.",
         "A boring, non-eventful, very content lower level civil servant in a local government employee got involved an exciting event inadvertently. The leading character is very good showing an earthly life rather pursuing non-lucrative dreams; even he despises any who pursues their dream without economic means. The movies mocks fast moving money oriented society and it mixes with comedy. No traditional happy-end but a realistic message in the movie. Highly recommended. The leading character is a strong character actor in many Korean movies. He is good at his comic act and many other roles as bad guy."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": ["Mapofilm"],
      "summaries": ["Han Dae-huei, a public official in charge of residential pollution of Mapo district. No one can disturb his composure: a man who never loses his temper: a man of tranquility; the apotheosis of snobbery. He is a typically unenthusiastic public official up to his bone. Never expect him to try a new thing or change anything."],
      "budget": 0
   },
   "movielensId": 164520,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2011-02-01",
      "dvdReleaseDate": null,
      "directors": ["Jahong Koo"],
      "runtime": 101,
      "movieId": 164520,
      "title": "Dangerously Excited",
      "mpaa": null,
      "actors": [
         "Yoon Je-moon",
         "Song Ha-yoon",
         "Sung Joon",
         "Seo Hyeon-Jeong",
         "Kwon Soo-Hyeon",
         "Kim Hee-jung"
      ],
      "imdbMovieId": "2086953",
      "originalTitle": "나는 공무원이다",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ZZUbdvGGci8"],
      "plotSummary": "HAN Dae-huei, a public official in charge of residential pollution of Mapo district. No one can disturb his composure: a man who never loses his temper: a man of tranquility; the apotheosis of snobbery. He is a typically unenthusiastic public official up to his bone. Never expect him to try a new thing or change anything.",
      "tmdbMovieId": 142533,
      "avgRating": 4,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/c01AYWMMO6OAdy01NJlQh7AVjiu.jpg"
   }
}