{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "true crime",
            "id": 33722
         }
      ],
      "imdb_id": "tt5952332",
      "video": false,
      "title": "Amanda Knox",
      "recommendations": [
         376228,
         390520,
         407806,
         356332,
         430826,
         373072,
         373472,
         319152,
         376234,
         354870,
         334679,
         356335,
         367215,
         438446,
         376261,
         15584,
         376426,
         324253,
         393443,
         385738
      ],
      "backdrop_path": "/4LROmlDNDMm6hNPNgJr0LRo2cF1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b18bc3a368054e0023d5",
               "name": "Amanda Knox",
               "profile_path": null,
               "id": 1689396,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b1a1c3a368055900287b",
               "name": "Anderson Cooper",
               "profile_path": "/iOjPVShHF4EQfYhC02FZQSLDsTa.jpg",
               "id": 1217309,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b1b69251411c7500285d",
               "name": "Arline Kercher",
               "profile_path": null,
               "id": 1689397,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b1c7c3a368054e0023ed",
               "name": "Curt Knox",
               "profile_path": null,
               "id": 1689398,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b1dac3a368054900254e",
               "name": "Giuliano Mignini",
               "profile_path": null,
               "id": 1689399,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Self",
               "gender": 0,
               "credit_id": "57f4b1ed9251411c6f002671",
               "name": "Raffaele Sollecito",
               "profile_path": null,
               "id": 1689400,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Self",
               "gender": 2,
               "credit_id": "57f4b201c3a3680540002670",
               "name": "Donald Trump",
               "profile_path": "/gP73QwYUzskedHNFzQsEfJ7pLzP.jpg",
               "id": 33663,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57ada7fbc3a36820750051fc",
               "name": "Brian McGinn",
               "profile_path": null,
               "id": 1083730,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57ada8069251415889004d68",
               "name": "Rod Blackhurst",
               "profile_path": "/t6lSuBMhfbZ8itrn7EQkkOHUrJd.jpg",
               "id": 1043983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57d41858c3a36855720050d5",
               "name": "Matthew Hamachek",
               "profile_path": null,
               "id": 591401,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57d4186bc3a3685577004a56",
               "name": "Matthew Hamachek",
               "profile_path": null,
               "id": 591401,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57d41877c3a368556a004db4",
               "name": "Brian McGinn",
               "profile_path": null,
               "id": 1083730,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57d41885c3a368556a004dba",
               "name": "Rod Blackhurst",
               "profile_path": "/t6lSuBMhfbZ8itrn7EQkkOHUrJd.jpg",
               "id": 1043983,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57d418bac3a3685568004939",
               "name": "Saunder Jurriaans",
               "profile_path": null,
               "id": 984513,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57d418c492514160990049be",
               "name": "Danny Bensi",
               "profile_path": null,
               "id": 1208226,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 7.315302,
      "production_countries": [
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 411009,
      "vote_count": 183,
      "budget": 0,
      "overview": "This gripping, atmospheric documentary recounts the infamous trial, conviction and eventual acquittal of Seattle native Amanda Knox for the 2007 murder of a British exchange student in Italy.",
      "similar": [
         357096,
         15069,
         984,
         11423,
         4771,
         96,
         75780,
         281,
         948,
         979,
         807,
         395834,
         281957,
         445954,
         8090,
         25376,
         21484,
         3134,
         2832,
         1586
      ],
      "original_title": "Amanda Knox",
      "runtime": 92,
      "poster_path": "/1mdW2sL08fMe6jst372t8g9EZRF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/wwemzKWzjKYJFfCeiB57q3r4Bcm.png",
         "name": "Netflix",
         "id": 59811,
         "origin_country": "US"
      }],
      "release_date": "2016-09-10",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Either I'm a Psychopath in Sheep's Clothing, Or I Am You.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Rod Blackhurst",
         "Brian McGinn"
      ],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Matthew Hamachek",
         "Brian McGinn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5952332/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTY5NjE4MTQyNF5BMl5BanBnXkFtZTgwMzg1NjEwMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Amanda Knox",
         "Meredith Kercher",
         "Raffaele Sollecito"
      ],
      "reviews": [
         "\"The media is the most powerful entity on earth. They have the power to make the innocent guilty and to make the guilty innocent, and that's power. Because they control the minds of the masses.\" Malcolm X Knox maintains that she was at Sollecito's address at 110 Corso Garibaldi watching Amelie at the time of Meredith's murder. Not even Raffaele supports this version of events and it begs the question why Blackhurst and McGinn have omitted the fact that Marasca and Bruno who acquitted the pair state in their motivation report \"her (Knox) presence inside the house, the location of the murder, is a proved fact in the trial.\" The acquitting Judges go on to explain their reasoning that Knox was the first person to offer a sexual motive before there was any cadaver or autopsy reports available. They also make mention of Amanda's description of \"the victim's terrible scream\" which was confirmed some time later by witnesses Nara Capezzali, Antonella Monacchia and others. How could a person who wasn't present know these details of the crime? Knox goes on to describe an idyllic evening, smoking pot and making love yet makes no mention of who was listening to music on Sollecito's computer at 05:32 in the morning, a time that both Knox and Sollecito claim to be blissfully sleeping. Knox can't comprehend why there is a knife with her DNA on the handle and Meredith's DNA on the blade. There is no mention in the documentary of Amanda's recorded prison conversation with her parents in which she says \"I am very worried about this thing with the knife, because there is a knife of Raffaele's\" *Reference Massei report page 292. Neither do they address Sollecito's claim that the reason Meredith's DNA is on the blade is because he \"accidentally pricked her while cooking.\" He later admitted this was a total fabrication, Meredith had never attended his home. Knox claims that she accused Diya Lumumba after long hours of questioning yet we know that due to the time recorded on her signed, voluntary statement that she had fabricated a story swapping Guede for Lumumba in under 2 hours and only did so upon learning Sollecito was no longer supporting her alibi. There is no mention in the documentary that Amanda had provided Diya Lumumba's name to Rita Ficarra in a list of persons of interest prior to learning Raffaele was not corroborating her version of events. There is no mention of the sample of Knox's blood recovered from the faucet of the bathroom she shared with Meredith which Amanda herself dated in her court testimony to the night of Meredith's murder. There is no mention of the mixed DNA sample of Knox and Meredith, recovered from a luminol revealed bloodstain in Filomena Romanelli's room. This is where the alleged burglary occurred, it is worth noting there is no biological trace of Rudy Guede in this room. Addressing the bra clasp, the Netflix documentary fails to address the only other sample of Sollecito's DNA identified in Via Della Pergola 7 was on a cigarette butt in an ashtray in the kitchen. This was a mixed sample containing Raffaele and Amanda's DNA. The documentary emphasises the farcical views of the so called \"independent experts\" Stefano Conti and Carla Vecchiotti. It fails to mention that Vecchiotti confirmed that contamination at Dr Patrizia Stefanoni's laboratory was not possible if there was a six day gap in the testing of materials during cross questioning at the Hellmann appeal hearing. PROSECUTOR COMODI: \"Is six days a sufficient interval to rule out contamination?\" CARLA VECCHIOTTI: \"Yes absolutely\" Neither to they address Conti's explanation as to how and why Sollecito's DNA was located on the hook of Meredith's bra clasp PROSECUTOR COMODI: \"How would Sollecito's DNA accidentally arrive on the hook of Meredith's bra?\" STEFANO CONTI: \"Anything is possible\" During his input in the documentary Conti implies that DNA is easily transferable, he gives an example of running his fingers along his arm. If this is the case I would like to pose a few of questions to him. 1, Why is the only other sample of Sollecito's DNA located on a cigarette butt in the kitchen? 2, Why is there no genetic trace of Guede in the small bathroom or in Filomena Romanelli's room? 3, Can you provide a figure for the statistical probability of Sollecito's solitary sample of DNA (other than the mixed trace on the cigarette butt) innocently finding it's way on to Meredith's bra clasp? Blackhurst and McGinn predictably make use of Rudy Guede's Skype conversation with Giacomo Bendetti in which he states Knox wasn't there, yet do not address the letter Guede wrote to his lawyers in which he refers to \"a horrible murder of a splendid, beautiful girl that was Meredith by Raffaele Sollecito and Amanda Knox\" Why have the documentary makers chosen to ignore these facts? The answer in my opinion is simple and evidenced by Blackhurst and McGinn's long standing support of Amanda Knox. Their production was never intended to be an objective documentary. It is nothing more than a PR exercise, it does what it says on the tin and tells the Amanda Knox story while omitting key facts. It is a blatant attempt to influence their targeted \"banked on\" audience and create sympathetic feelings towards Knox. Ironically towards the end of the documentary there is an interview with Curt Knox, he states \"I'm not looking at her as a hot property.\" Yet Curt Knox enlisted David Marriott of Seattle based PR firm Gogerty Marriott within days of his daughters arrest. And nine years later Amanda Knox is still attempting to be \"hot property\". Read my full review at http://perugiamurderfile.net/viewtopic.php? f=1&t=461&p=131314#p131314 Rest in peace Meredith Kercher",
         "Amanda Knox, a Netflix documentary directed and exec produced by two ardent Knox supporters, Rod Blackhurst and Stephen Robert Morse, who have been campaigning for Knox since 2011, (which included harassing journalists who actually covered the case far more thoroughly than they did), opens with lingering almost gleeful close ups of the bloody crime scene and goes downhill from there. The documentary begins by trying to shape a false narrative of handy villains who all seemingly came together like the stars aligning to make innocent Amanda look so screamingly, beyond a reasonable doubtingly guilty. (and not the overwhelming behavioral circumstantial and hard physical evidence against her which the documentary brushes over in a cursory manner.) Villains first were the cops then prosecutor, and now according to Netflix,the tabloid media,anyone except Amanda Knox herself. The film makes out that Rudy Guede, the sole person convicted for Meredith Kercher's murder, left his DNA all over the crime scene, with funky arrows pointing here there and everywhere. The problem is this simply isn't true. Rudy Guede was convicted on less DNA evidence (five samples) than Amanda Knox(six samples). As for the featured so-called \"independent DNA experts\", Conti and Vechiotti, well, they were found \"Objectively biased\" and \"Objectively deceptive\" in court by the Nencini appellate. Specifically because Vechiotti falsely claimed that the technology did not exist to re- test the murder weapon. It did indeed exist in 2011. Vechiotti was also filmed by the BBC shaking hands with Sollecito's father in court no less, hardly appropriate behavior for so-called independents and neither's expertise is in forensic DNA anyway (Vechiotti is a pathologist & Conti's expertise is um, \"computer medical science\" whatever that's supposed to be). You'll notice in this review how I've rarely mentioned the victim Meredith Kercher. That's because she barely gets a mention in this sad excuse for a documentary. Not even an RIP. Meredith, the victim is relegated to a mere footnote and indeed a foot under a duvet. Reprehensibly, the doc also displays close up autopsy photos of Meredith. Yet the autopsy photos were never made public. Considering only the Kerchers (who didn't take part in Netflix's PR makeover) and the defence- and by extension the two former defendants- had access to such material, this begs the very pertinent question- who provided two ardent Knox supporters with autopsy photos of the murder victim? The filmmakers should be ashamed of themselves for this alone, utterly contemptible behavior which comes across as needlessly and despicably taunting the victim's family or at the very least exploiting their daughter and sister purely for lurid effect to make their documentary more \"gritty\". So what's the verdict on Amanda Knox the documentary? Well it's a terrible, false and ultimately immoral exercise in innocence fraud and here are some facts that Knox's PR infomercial left out: 1 The Supreme Court's acquitting report states that Amanda Knox was present during Meredith's murder and may even have possibly washed the victim's blood from her hands afterwards but it STILL can't be proved that she did it. (which begs more questions, namely why didn't innocent Amanda call the cops for her friend and why wasn't she done for accessory at least?) The same Supreme Court do not make the same allowance for the black guy though, had he had have washed the victim's blood from his shoes for example. The court also states that there's \"strong suspicion\" that Sollecito was there. 2 The Supreme Court's acquitting report states that the burglary was staged. 3 The Supreme Court's acquitting report states that Meredith was murdered by three attackers and that Guede had two accomplices. (And you really don't have to be Stephen Hawking to figure out who these two accomplices were, when you view the evidence in its totality) 4 The Supreme Court's acquitting nonetheless finalizes Knox's calumny/ criminal slander conviction, which she got for falsely accusing her innocent employer of rape and murder, leaving him in prison for two weeks and never retracting her statement, despite false reports that she did, meaning that Knox's status is still that of a convicted criminal felon. 5 In finalizing Amanda Knox's calumny/criminal slander conviction, The Supreme Court's acquitting report states that Knox blamed her boss to protect Rudy Guede as she was afraid that Guede could \"retaliate by incriminating\" her, which of course begs some more very interesting and pertinent questions, such as how could Guede incriminate innocent Amanda to begin with? 6 The Supreme Court's acquitting report does NOT exonerate Knox, it acquits her due to \"insufficient evidence\",like Casey Anthony, OJ Simpson and that nice man Robert Durst. RIP Meredith Kercher, who along with her stoic dignified family (who have been subjected to absolutely abhorrent abuse and attacks by Knox's supporters online) and Knox's employer Patrick Lumumba are the only victims here. May the truth shine in your case one day and the facts and truth come to light. Neither Amanda Knox or Raffaele Sollecito are fooling anyone familiar with Ms Kercher's case & facts are available at the murder of Meredith Kercher .com and in the Nencini and Massei reports.",
         "That's my verdict of this so-called documentary -- Guilty! Guilty of re-writing history and whitewashing Amanda Knox. Look, there are too many reports that have been done about all this, and just one of those reports is way more honest that this piece of trash film. It's clear from all the evidence, blood evidence, and Ms. Knox's constantly changing stories at the time, that she's guilty as hell. She's a sociopath at best, a psychopath at worst. But then is that any surprise, really, when it's estimated that 4% of the population is sociopathic/psychopathic? That's 1 in 25 people. It's surprising we don't see more like Amanda Knox making the news, frankly. The makers of this film have attempted to whitewash Amanda Knox -- and maybe it will work on some, but it's garbage. Just read her prison diaries (barely even mentioned in this \"journalistic\" story). She's guilty, and no amount of filmmaking like this is going to resurrect her as some upstanding citizen of society. Never going to happen.",
         "I saw the film at the Toronto International Film Festival. As a passionate lover of movies and documentaries, I respect the right of ANYONE to create a documentary or film through the prism of their own POV. On the other hand, they owe us, the audience, a modicum of honesty in their reporting. Otherwise, as some one once complained about deceptive editing and reporting in one of Katie Couric's documentaries, it prevents \"democratic discourse\" and this is what we ask. By all means, engage with us, but do so honestly. Having followed the case for many years as well as attending the earlier Supreme Court hearing in 2013 I can add the following: -Rudy Guede's lawyer Valter Biscotti had a lot more to say about his client being convicted 'in conjunction with others'. This was edited out, as well as the caption Knox put alongside her blog when she posed with a machine gun,\"The Nazi Within\". Something the media reported correctly at the time, McGinn and Blackhurst not. The Producer Stephen Robert Morse hid his involvement in the project with Brian McGinn and Rod Blackhurst since 2011. They had ALL made inflammatory comments in favour of Amanda Knox over the years, with Morse hastily deleting some (but not all) as the Netflix sale came up. He even called Nick Pisa \"a POS\" in Perugia in 2011. It was the Danish production company head Mette Heide that approached Mignini and Pisa, who didn't know of Morse's involvement, but that gives the background to this biased 'documentary' and why some may feel it is less than fair or balanced in its portrayal of the protagonists. Mignini was referring to the Monster of Florence case when he talked of people coming up to shake his hand, the film makes it look like they were congratulating him for putting away Amanda Knox. He was referring to it being an inside job when he said an \"unknown\" man (edited out to make him seem misogynistic) would not have covered Meredith with a blanket. The film emphasized his Catholic beliefs to make it seem he was making a moralistic judgment about her. As he pointed out, the evidence was somewhat overwhelming. It also made it seem like his love of Sherlock Holmes was proof of him following a hunch. Um, that's what investigators sometimes do, especially when faced with the numerous prevarications and failed alibis of Amanda Knox. Obscuring the evidence to match your narrative is dishonest to the extreme. The 'independent' DNA experts Conti and Vecchiotti were given lots of room to claim contamination though that was never proved in court, only inferred. Also left out: Vecchiotti's sentence for not maintaining sterile conditions in HER laboratory. Her switching a suspect's DNA with another in one of Italy's worst murder cases in order to falsely exonerate someone with 'connections'. The tests had to be redone to obtain a conviction. As they make fun of Nick Pisa for 'not fact-checking', should they not have fact-checked before they placed her on camera? The biggest laugh the Toronto audience gave was WITH Nick Pisa when he said \"I mean, she's (Knox) a complete and utter loon\". This follows the Netflix template of creating reasonable doubt as it did with \"The Making Of A Murder\". By over emphasizing the defence case, and ignoring the prosecution's, it reads like propaganda. This is neither fair nor balanced, nor is it original. It adds nothing to our knowledge, being a rehash of her book and numerous TV interviews, and already covered in Michael Winterbottom's \"The Face Of An Angel\" in his fictionalized 'the making of a movie within a movie' adaptation of reporter Barbie Nadeau's book. Oh, and producer Morse insulted HER too. There were several prosecutors and judges helped convict her, not just prosecutor Mignini. Nor was it an exercise in misogyny, the case was driven by three women, prosecutor Manuela Comodi, Scientific Police DNA lab technician Patrizia Stefanoni and homicide Inspector Monica Napoleoni. This exercise in PR looks like an Amanda Knox Production, with her playing the lead role, director, producer and writer. Yet she fails to see how she comes across with her melodramatic styling and emotive pauses and outbursts. She is neither believable nor sympathetic, no matter how hard they all try. Two stars out of ten for production values and slick cinematography, none for the film itself. In the end, the picture belongs to Meredith Kercher, remembered by her family with a grieving Arline Kercher, her mother saying how she just could not understand how there could be two convictions and two acquittals; justice denied. And a haunting video of Meredith, taken in the full bloom of her youthful promise by Amanda Knox. She didn't want Knox to film her, as admitted in her book, she took it anyway. Meredith Kercher, RIP. Disclosure: I'm an editor at the Meredith Kercher case files website The Murder Of Meredith Kercher .com and co-administrator of one of the Perugia Murder File sites.",
         "I vaguely remember hearing about this case when I was in college. I remember her name, that she wasn't the only one involved, the murder was of her roommate, and it took place in Italy. I didn't even remember the verdict before watching this and I didn't look anything up before watching it. Going in with basically no information, I have made several observations. 1. The way Knox talks about herself (either I'm the most dangerous...I am a wolf in sheep's clothing, or I am you). First off, Amanda, if you are guilty, you're not the most dangerous anything. There are hundreds of murder cases involving couples that otherwise would not have killed on their own. There's a whole phenomenon regarding this behavior studied in criminal justice classes at every university ever. It came across as very narcissistic. I was immediately suspicious. 2. The evidence was pretty conclusive. The fact remains that, even if the men in this case weren't the perps, I didn't see how there was any evidence to suggest Amanda wasn't responsible. Perhaps she did it with them, or with two other guys (since they mentioned two other male samples from Meredith). Perhaps Meredith slept around like Amanda did. Perhaps Meredith slept with Rudy, left, and then Amanda, with two other guys (one of whom could have been Raffaele), and they escalated from there. Perhaps Amanda was jealous and killed Meredith after the guys were all gone. I don't know, but no matter how much you can make the case of which guys were or weren't involved, Amanda is still in the center of all of this. 3. Her behavior. Who kisses their boyfriend in front of a crime scene? Who smiles at cameras and laughs and winks in court? Not innocent people on trial for murder in a foreign country. I'd be freaking out and not at all in the mood for any of that behavior. She only brought on the tears when she'd been in prison a while and probably hated prison life. Bring on the waterworks. She doesn't seem genuinely remorseful at any point during the trial or documentary. 4. She offers no plausible alibi. Since it is likely Raffaele was at Amanda's apartment that night (and possible an accomplice), her alibi goes out the window. She NEVER offers an alternate explanation. Even when her lies are exposed, she clings to them. Overall, I didn't have an opinion one way or the other going into this and just based off of this documentary alone, I strongly believe she is GUILTY. If her goal was to look innocent in this, she failed. If her goal was to subtly suggest she is guilty and she's bragging about getting away with it and being a bada** (er, most dangerous person), she succeeded. You won't get that lucky again, Amanda. I suggest you stop killing people.",
         "The film presents itself as a 'neutral objective' documentary of the events surrounding the murder of Meredith Kercher in 2007 and the consequent acquittal of the accused pair, Amanda Knox and Raffaele Sollecito. The directors, Blackhurst and McGinn, and producer, Stephen Robert Morse, claim they gave it the title, as it became 'all about her'. This is part of the case they wish to put to the viewer, that the pair were only convicted because of the prurient press interest – as represented by 'villain hack for the DAILY MAIL', Nick Pisa, a cockney 'wide boy' who giggles as he describes his excitement of a \"girl-on-girl' crime (which it was, given both Meredith and Amanda are female) and arch villain, the mad Roman Catholic prosecutor, Guiliano Mignini, supposedly obsessed with good and evil, Sherlock Holmes and who took a dislike to Amanda Knox, victimising her because he considered her immoral. What they do not tell you is that they were longtime campaigners for 'Free Amanda Knox', since at least 2010. The truth hides its face in this documentary. The directors claim in their promotional material and supporting 'blurb' they went to great pains to ensure balance and to 'let the protagonists speak for themselves'. These claims given the above, are less than candid. In addition, the film promotes only facts that support their fervently biased views. How then is the deception carried out? There are several techniques to engage an audience, not dissimilar to a novel, film or memoir. 1. Make the narrator likable In the Amanda Knox film, this is done by showing clips of Amanda's and Raffaele's younger days. This is not done for the other defendant, Rudy. we are reminded that Amanda and Raffaele are warm people who were once cute kids. This encourages the viewer to empathise with the subject of the documentary. We even see Amanda and Raffaele seeming to flirt with each other, each lighting up and smiling as they recall fond memories of the other during their brief affair. 3 Be selective in what you tell the viewer We are not told about Amanda's previous disturbing short stories about murder and rape, nor about Raffaele's wayward behaviour that caused his father to threaten to put him into rehab. He bragged of his drug taking on social media and posted bizarre images of himself dressed as a maniac wielding a meat cleaver. The viewer is not informed of Raffaele's obsession with knives and vast collection. If this had been mentioned, Nick Pisa's observation that the knife pricks below Meredith's chin showed she had been taunted and tortured with a knife, would make more sense to the viewer. There are many salient and incriminating facts and evidence, which the directors leave out completely. Thus, we are only informed of the knife and the bra clasp, but not of the luminol-enhanced footprints of the pair, nor Raffaele's presumed footprint in Meredith's blood on the bathmat. We are shown the same diagram, more than once, of Rudy's eight circled biological spots with just one for Raffaele, and none for Amanda, when the truth is, there was more DNA evidence found of Amanda at the murder scene than Rudy. So, we the viewer are led to believe the 'evidence' is flimsy against Amanda and Raffaele and are encouraged to believe there is much more against Rudy. We are told more than once, 'the DNA evidence of the knife and bra clasp is crucial'. 4. Appeal to Authority Here DNA scientists, Conti and Vecchiotti appear; the pair proclaim the DNA of the bra clasp and the knife were contaminated and therefore, the 'result of Meredith's DNA on the blade and Raffaele's on the bra clasp is inconclusive.' The directors conceal from the viewer that the court (Hellmann) who commissioned them was later expunged by the Supreme Court and Vecchiotti and Conti heavily criticised as, 'intellectually dishonest'. 5. Adopt an Anti-Hero The anti-hero for the filmmakers is Rudy Guede. We are reminded about how his damning evidence is more prolific than Raffaele's or Amanda's. We are reminded that 'evidence still points to Rudy's guilt', whilst the couple are 'exonerated'. This in itself is untrue, as the pair were NOT exonerated. They were acquitted due to insufficient evidence, the US equivalent of the conviction being 'vacated', or the Scottish Law, 'not proved'. At no time did the Supreme Court declare the pair 'innocent', yet the filmmakers constantly claim they were. 6 Lead the viewer to the epiphany This is a technique popular with Hollywood filmmakers who churn out popular 'feel good' movies. The feel good 'happy ending' here is that the baddie, that is Rudy, remains the only guilty party and, victory, the heroes, Amanda and Raffaele are vindicated. The next step is to ask, 'How did this happen?' The viewer is invited to look to the other villains of the piece, Mignini and Pisa. We are encouraged to hate them, and 'boo and hiss'. And thus, the viewer goes away with the filmmaker's intended message, 'Amanda and Raffaele are innocent', 'exonerated', 'vindicated' 'there was no evidence' and that they suffered 'a miscarriage of justice. The viewer goes a way with a 'feel good' feeling that right has prevailed over wrong. The Reality The real life reality, as usual, is very different from the idealised Disney vision, as set out by Blackhurst and McGinn. There is nothing wrong in holding an opinion, of course. The question is, is it an honest one? I would argue, no. 'Amanda Knox' 2016, is not honest, transparent or even ethical. ———–",
         "I don't know if Amanda is guilty or innocent. Apparently, the Italian courts had trouble making up their mind as well. In watching this \"documentary\", I had hoped to view a balanced picture with all of the evidence discussed. Instead, I saw a film that was written to promote Amanda Knox's profile as spokesperson of the wrongly convicted. It was so blatantly one-sided that it convinced me of nothing and left me with only more questions. If you feel strongly that Amanda is innocent, you will enjoy this lovely piece of marketing. And if you feel she is guilty, you will be creeped-out by her final smile, which is incongruous with the speech she had just delivered.",
         "Let me put it this way. I had little to no knowledge regarding this case before watching the film, and it still left me strongly convinced of Knox's guilt. It gave me the feeling that it wasn't telling us everything, but I didn't know or get the impression that the filmmakers thought she was innocent, and were trying to portray her as such. Like already mentioned, I knew next to nothing about the case and I was still very easily convinced that Knox had at least some form of involvement. I found out after watching it that the directors think she's innocent. The problem is the film leaves out multiple pieces of incriminating evidence, yet has convinced some people that Knox is innocent. The film claims itself to be neutral, and for a while it is. But it eventually puts too much emphasis on a supposed lack of Knox's DNA found in Kercher's room, and leaves out forms of DNA evidence against both of them, a number of different testimonies from the night of the murder and the following morning, as well as many other things INCLUDING what I think might be the strongest piece of evidence against Knox and Sollecito; what happened when authorities first arrived to the crime scene. The film makes it look like they phoned authorities who then quickly arrived, and then the odd behavior began with Knox and Sollecito noticeably expressing a suspicious amount of affection towards each other directly outside the murder scene. But clear reasoning to suspect Knox's guilt actually started even before that. The postal police ironically arrived first, due to having found both of Kercher's phones. Knox and Sollecito then show no concern for Meredith's safety and make no mention of her door being locked. Eventually Knox claims that it was normal for Kercher to leave her door locked, which has been refuted by all of the other roommates. Now, that may not seem like much at first, but think about what her story is. She claims that before phoning police and anyone else arriving, she began to panic, knocked multiple times on Kercher's door, eventually climbing the balcony to try to see into her window, and even getting Sollecito to try to kick the door down. So we're trying as hard as possible to peak into windows and bust the door down to make sure she's okay, but when authorities suddenly arrive due to finding her phones in a random backyard, they don't freak the hell out? Or even mention her door being locked?! It was mentioned in the phone call! The phone call to police that oddly did not happen until after the postal police had arrived. They claimed otherwise, but the full timeline for that morning has been established based on several different testimonies and phone records. If they were innocent, there's no doubt that they would have instantly entered a stronger state of panic when realizing her phones had been ditched, and directed the postal police's attention to the locked door. Instead, Knox diverts their attention away from the door after it's discovered to be locked, with the flat-out lie that Kercher commonly left it that way. Everybody else claims that she had never once left her door locked before. You may ask, well why would Amanda do this? It's pretty simple. Cold feet. Authorities arrived even quicker than they had planned, before they phoned them themselves, and reality set in. Knox got nervous and wasn't ready for authorities to find the body, so she tried to buy more time and shift their attention away from her room. Unlike a lot of users who are convinced of Knox's guilt, I would still recommend the film. It really upsets me that it has convinced people that she's innocent, but due to the scale of her role, believing Knox is guilty makes it an even creepier and more memorably haunting experience. Imagine how amazing of a documentary this would have been if it had actually been a neutral exploration that presented allllll of the significant evidence and allowed the viewer to decide on their own. It feels like a rare opportunity to make a documentary that very largely features new interviews from two people convicted twice of murder (that many people still believe are guilty). Their footage should have given everyone that haunting, at least suspicious sensation that it gave me, but I see now how the filmmakers irresponsibly structured the film to have you ultimately be on their side and feel sympathy for them. I'd still recommend it. It's creepy, gorgeous, and quite thought-provoking in many aspects. But I stress that you go to themurderofmeredithkercher.com afterwards and read into all of the evidence. Knowing what the film leaves out, makes it more enjoyable and less enjoyable at the same time. I don't know why the directors are convinced of Knox's innocence, but there is significantly more to the case than what the film shows. And that is an understatement. With all things considered, the idea that Knox and Sollecito had zero involvement is absolute insanity. Unsavory qualities you may see in a journalist or detective are irrelevant. Yes, the media acted ridiculous. I don't disagree. But at the end of the day, that really changes none of the hard evidence. Ultimately, a technically proficient documentary that exploits very interesting and personal aspects, but without giving you the whole story. It's cool that Knox is in it, but all forms of significantly incriminating evidence against her and Sollecito still should have been provided, and that clearly isn't what they did. It still serves as an essential fact that Guede did not act alone and that a lot of evidence (including eye-witness testimonies that the film excludes) points to three people being involved. I would love to know who the directors think the other two are.",
         "People with only a casual interest in the case my find this documentary interesting. It's well-made and presents the basic facts well. The filmmakers made a number of pro-Knox tweets and comments prior to making the film, so it's not unbiased. I won't go over the evidence and its presentation in the film except to say that the case against Knox is very well presented on the website themurderofmeredithkercher.com. Also, the trial transcripts (highlights at least) and \"sentencing reports\" are online in English (in Italy the judge issues a kind of term paper explaining how the verdict was arrived at.) The final sentencing report is the Marasca Report. That report explains why Knox was found not guilty by insufficient proof, a weaker status than the alternative form of not-guilty. Reports are also online from earlier trials in which Knox was found guilty (Massei and Nencini) and not guilty (Hellmann.) I will make just two points: 1) Kercher's family, friends, and surviving roommates seem to think Amanda and Raffaele are guilty. They did not participate in the documentary except via old footage. 2. Prosecutor Mignini is portrayed as biased against Knox by his Roman Catholic religious views and Knox's alleged sexy, druggy lifestyle. That is unfair. No devout Catholic would think it right to judge unfairly an accusation of murder because the defendant had engaged in pre-marital sex. That would be a grave sin as any priest would tell you.",
         "This white trash BS PR fake \"documentary\" is not worth watching for even one second. The reason why is because it's now legally certain that Knox and Raffaele were both \"there\" at the crime scene at the time of the murder, and proved that Guede assaulted Meredith and helped kill her with accomplices, are we now to assume that the lying Knox and Sollecito were not the accomplices, but that one or two other criminals were also on the premises at the same time and were helping Guede kill Meredith? That stretches credibility. This ruling is unfathomable. I can only imagine the reaction of the Kerchers and of their Attorney Maresca. This ruling defies common sense. It seems to imply that Rudy committed the killing but that Knox and Raffaele were too afraid of him to tell the police, and instead helped him hide the crime at the risk of themselves being prosecuted for it? That fear alone was the inducement to run an eight year long charade of lies and dissimulation, not to mention years of prison? When Raf's father is connected to important people and when Knox's family could afford a PR campaign to reach television? Yet Knox is so afraid of Guede counter-accusing her and of Guede being believed, that she has denied everything and even covered for Guede? Preposterous. Does Cassation think that Rudy set up the false burglary for his cover story, but then Knox and Raf lied to police about it for him? If Knox and Raf weren't complicit in the crime but were there during its commission, what were they doing during the murder? Playing guitar and smoking weed? Knox and Raf overlooked Guede tracking blood around the cottage, heard Meredith's scream but did nothing to aid her, too afraid to aid her and later ashamed of their cowardice? Were they threatened by Guede with the same fate? Or if they were hurting her along with Guede so that she did scream, they are still innocent? And why would Knox be washing Meredith's blood off her hands into the bidet and washing up blood from the murder scene rather than call police and denounce Guede as the killer? Knox could have begged for police protection She had the USA to flee to. Raf's father could protect him, his sister was Carabinieri! No. If Knox was washing Meredith's blood off her hands, Knox was hiding her part in the murder. This ruling contradicts its own reasoning. It has proved the greater yet says it can't prove the lesser. Please watch a much better film entitled \"New Amanda Knox Documentary\" on YouTube.",
         "On the morning November 2, 2007, 21-year old Meredith Kercher's lifeless body was discovered in the room of a house that she shared with 3 other women while attending school as part of the Erasmus student exchange program in Perugia, Italy. She'd only been in Perugia a few months. One of the housemates present at the scene of discovery was 20-year old Amanda Knox of Seattle, Washington, also a student and the person from whom this Netflix documentary takes it's name. Can't say that I was really looking forward to watching this, especially after finding out that it's producers were somewhat deceptive in their claims of showing what they had said would be an unbiased and neutral take in what has been one of the most divisive cases to emerge in the age of the internet and social media. Turns out they'd been advocates for Knox's innocence since at least 2011, when Judge Pratillo Hellmann acquitted Knox and co-defendant, Raffaele Sollecito at their first appeal. Why not state your pro-innocence bias upfront? Nothing wrong with that, if you truly believe it, but why state otherwise? And why also state you've got new revelations about the case when you really don't? In fact there was more left out than was put in, but then 90 minutes couldn't possibly cover the roller-coaster of the 3-tiered Italian judiciary system, so the documentary must be selectively streamlined. And boy was it. In a week that started with the first 2016 Presidential Debate between Donald Trump and Hillary Clinton, and the question rises about the inability of the news media to \"fact-check\", \"Amanda Knox\" finishes the week off with the same question; Did anybody bother to fact-check? Sure, there's a few facts sprinkled here and there, but they're mostly sugar-coated or given short thrift. But short thrift on facts is one thing, glaring omissions of them is another. People are given short thrift as well, most noticeably Meredith Kercher. The documentary almost treats her like an inconvenience to the main story of superstar celebrity Amanda Knox, who herself can't even get facts straight and contradicts her own documented statements several times throughout. Her personal script seems to change almost as much as her alibis did in 2007. And then there's her on screen, um, presence. She doesn't really have any and looks uncomfortable, all the while making her come across as very unlikable. How much is acting and how much is real emotion? With Knox it's hard to tell. Same goes goes for Knifeboy, excuse me, Sollecito. He's almost as unlikable as Knox. And was he stoned when they filmed his interviews? As for Nick Pisa, I had him pegged for scummy trash-journalist years ago and the documentary confirms this, but I don't think the makers of \"Amanda Knox\" realized that they would be proving his point as well. They're actually doing what he'll be blamed for and that's creating a \"story\" to mislead while omitting facts (like the fact that Italy's highest court did not exonerate Knox by any means, but that's another documentary) in order to grab headlines and cheap soundbites. The words are different, but the story's the same. They also don't quite pull off their efforts in dichotomy with Giuliano Mignini. The uninformed will see him as the other main villain, but anyone who has followed this tragic case knows better. Overall, \"Amanda Knox\" is a bad piece of Pubic Relations propaganda that certainly won't sway anyone who believes that Knox, Sollecito and Rudy Guede all participated in the murder of Meredith Kercher, but will certainly convince the selfie generation that, \"OMG, she's so totally innocent, I can't believe it\". And neither do I.",
         "Except for some nice cinematography showing the architecture of Italy, this is a poor documentary sharing no new insights and giving far too much airtime to Amanda Knox's rehearsed interviews. The intro to the documentary included part of the media crusade in the wake of Amanda Knox's release but the documentary from then on is clear in its bias. Amanda is clearly innocent just look at her. Cue staring at camera with sorrowful eyes. It is difficult to know what happened to Meredith Kercher, but this documentary does nothing to help uncover what happened to the minor character of Kercher or even give more of an insight into the character of Amanda Knox. Those meaningful stares at the camera from each of the characters...my god. We hear little of the actual trial other than biased reports of the evidence presented. The documentary limps along feeling like it is about to get started properly before it eventually ends. The talk of Amanda Knox not wanting the attention from the media is not questioned despite the fact she has done so many interviews and why did she do the goddarn documentary just as people were probably beginning to forget about the whole saga? The Knox interview itself is definitely the worst part of the film. So blatantly rehearsed. Everything she says looks completely unnatural. What is the viewer supposed to take away from an interview that is scripted? The tabloid journalist's interview also looks to be scripted with him proudly taking on the role of the villain. Even the Policeman talking about people recognising him on the street is accompanied by a staged shot of him walking along the street and surprise surprise being recognised. The final, obviously rehearsed, line from Knox to end the documentary is a blatant attempt to get the viewer thinking but all it does is leave the viewer questioning does it count as a documentary if the narrative is scripted? And where did that hour and a half go? An interesting story but a very poor telling of it.",
         "If you're looking for a piece of media to clear the confusing facts for you - this is not it. The documentary is clearly very biased towards Amanda, making her the sole focus of the documentary and not the case - I am aware that it is titled after her name and therefore about her, but I feel the documentary unjustly shifted the focus of finding the truth from the case to a more \"we're trying to prove she's innocent\" film. Would recommend to anyone looking for a good entertainment documentary, but in my opinion it does nothing but feed into the idea that Knox is innocent and absolves her of any involvement within the crime, feeding in to her dramatics.",
         "4 million dollar book deal...good promotion...make money for slicing someones throat...it's a west coast thing OJ...el libbo netflix' obsession with Trump has to be in there as well...pathetic....she's not married? go figure..good night hubby, don't worry about this knife here...now go to sleep mofugga..",
         "this documentary,narrated by Knox(who is is also seen screen) focuses on her arrest for a brutal murder,her conviction and acquittal of the crime not once,but twice.she was convicted twice and acquitted twice.i found this documentary fascinating and illuminating.no matter which side of the fence you're on regarding her guilt or innocence,her story is captivating.the most compelling evidence points to her innocence.there is evidence that the case was bungled by both the police and the prosecutors.and the media seems to be held responsible for her acquittal,according to the authorities.Knox herself seems genuine and truthful,although some of her behaviour during the whole ordeal was a bit strange,that alone is not enough to make her guilty of murder.on the other hand,even if the authorities bungled the investigation,that does not mean she is innocent.for me,Amanda Knox (2016)is an 8/10",
         "This is a good documentary for a brief look into the infamous story of Amanda Knox, and I particularly like the way they have this led by interview pieces to camera with Amanda herself. However, I feel as though the documentary was almost slightly biased and didn't spend enough time looking into the other avenues of how the situation came about. It's worth a watch for sure, Amanda is an odd and interesting character to watch, but don't expect edge-of-seat gripping.",
         "Wtf...that was my first thought when I saw the journalist describing the scenario like it was book of fiction or something. Even if he was satisfied with getting the scoop...a normal (emotional) person wouldn't laugh and in the same time describe it like a perfect \"media-story\". He seems to be an awful human being...!...and a bad journalist admitting he wrote articles in the case without doing any background check...just like many others do in social media today. A young girl died and that laugh, that was the most disturbing in this documentary! It was good that the chaos at the crime scene was recorded, that was enough to realize how non-professional the police was. And the the evidence they found after 48 day...wtf again...really!?! A good example of bad police work and how awful media can be...shame on both police and media!",
         "SPOILERS: I was on the fence about Knox for many years, but after hearing that pompous atrocity, Sherlock Holmes wanna-be prosecutor, in his own words; and hearing the slimy tabloid hack who came up with the name \"Foxy Knoxy\", actually refer to himself as a 'journalist', I am no longer on the fence. This girl was railroaded. Smeared. Run through through the gauntlet of media exploitation for ratings. This case is an utter embarrassment to the Italian justice system and media. At one point the prosecutor rolls out this bizarre titillating story of kinky sex and murder .... then you realize this garbage coming from his own sick imagination. There's no evidence for any of what he's saying! He's making up the entire crime. The man is twisted. Incompetent. And he was punished by being promoted. I thought our judicial system was f*cked up. And the press is just as guilty. They helped crucify her with sensational stories void of any journalistic merit or responsibility. I actually fell for a lot of that stuff because that's all we were getting. At one point the hack who thinks he's a journalist blames the fiasco on the police and actually asks what did we expect him to do, look deeper into the story?... Uh, yeah, that's JOURNALISM, you freekin poser. Sorry, but I'm angry. I just finished watching. Anyway, this is a great docu about a modern day witch-hunt. I wouldn't have been surprised if the prosecutor tried to throw her into water to see if she floats.",
         "There is so much Meredith Kercher related material out there that one could create a mini-series not just one documentary. But, somehow the filmmakers managed to miss it all and deliver a shallow, uninspired film which moves at snail's pace. Perhaps they were afraid of the overly aggressive Amanda-haters. That group in itself is worthy of a film. Better to stubbornly stick to an illusion than admit that you've been had. They cannot understand that someone could be close to a victim and be perfectly innocent, because as they demonstrated, an opportunity to hurt another who is down, should not be missed. Let's see what else the filmmakers missed: The prosecutor Mignini was himself charged and given a suspended sentence for abuse of office. Even more importantly, and you could get a glimpse of this if you were watching carefully, Mignini (the prosecutor) has a penchant for fantastic stories that he invents while sucking on a pipe like he is the very reincarnation of Sherlock Holmes, his childhood hero. Mignini was in charge of an investigation of series of murders in Florence, for which he developed a theory of \"Cult Murderers\". Based on that theory he arrested many innocent people and kept them in jail until the real serial killer was arrested by someone else. That whole story inspired many newspaper articles and at least one or two books, whose authors were then persecuted by Mignini himself! A good documentary would then proceed to ask: how did a person of obviously low moral standards and half a dozen serious psychological aberrations (low IQ being one) be a prosecutor? How did he get to do such a bad job and keep it at the same time? Who benefits from having obviously incompetent and corrupt prosecutor? Italy, as we all know, is the seat of mafia. Here is what a cursory search reveals about Perugia, the town where Amanda Knox was arrested: \"Police said the arrests (of 61 mafiosi) stemmed from \"widespread infiltration\" by the 'Ndrangheta of Calabria of the local economy in the province of Perugia.\" And there you have it. Nothing is simply an accident. In a mafia infested place, it is mafia that benefits the most from bad prosecutors. The next point to investigate would be what influence mafia may have on who gets to be a prosecutor in Italy. The last point that I was fully expecting to see in this film, but that was not presented at all, was the most damning evidence of police complicity. The main suspect, Rudi Guede, was not just caught running away from the scene of the murder, as this film shows; he was caught in another country! His explanation? \"I got scared seeing her being killed\". In his initial testimony he repeatedly said that Amanda Knox was NOT at the scene of the murder. He said that some other male person did it but that he could not see his face. Then, he said, he ran out in fear, and continued running all the way to Germany. A country that is on the other side of Switzerland. But that's far from all. What this documentary does not reveal is that Guede was a police informant. This point was hinted at when he called his friend in Italy, who is also a police informant. That conversation was recorded. Now why is that important? Because as a police informant, Rudi Guede enjoyed certain privileges: he could deal drugs even do an occasional break-in robbery himself, all with impunity. Guede was a drug-addict whose crimes were becoming more and more violent. The last break-in looked very much like Kercher's murder: he broke a window, entered a house, threatened a woman there with a big knife... but she escaped. Guede's identity was not hard to figure out as he is black, among 99.9% of whites. Due to that violent attack there was an arrest warrant for Guede. But police never arrested him. And therein lies the key to this saga: the police is guilty as sin for not arresting a violent criminal. If they had arrested Guede in time, Meredith Kercher would have been alive. To cover their tracks they needed a scapegoat. In comes a prosecutor to save the day by inventing a story of sexually fueled murder. This was enough to shift the focus onto a perfectly innocent couple of youngsters who could never be a match for the rotten system that was eager to destroy them, in order to save itself. The only reason I did not give this sorry excuse for a documentary a one star is the wonderful opportunity to see the two most despicable characters - Mignini the prosecutor and Nick Pisa, the British journalist largely responsibly for fanning the flames of hatred against Amanda Knox, speak for themselves. Those two are so deeply in love with their \"work\" that they brag about it. Pisa even goes so far as to say that his job is just to \"report what I heard\", but not to double check the facts. And reported he did - not only what he heard, but anything else that could help get his story on the cover page which he brags about with a devilish smile. All at the expense of an innocent couple. The story should have been about the bottom feeders who could not care less if they destroy a life or two in their blind pursuit of \"success\".",
         "As humans, we just can't resist a juicy story. And the infamous Meredith Kercher murder case had it in spades: the gruesome killing of a beautiful young girl, a picturesque Italian village, a throwback Sherlock Holmes-style detective-philosopher, and an interconnected web of young, multicultural, possibly sex-addicted suspects, headlined by a knockout American student with icy blue eyes - the titular Amanda Knox. Somebody had to make a documentary about it, and here we are. Netflix covers the bases: they get all of its principal actors on camera, stylishly photographed, as is the norm today for true crime; they weave in surprisingly detailed case footage - including that of the actual crime scene, moments after the murder had taken place; and they let the story unfold chronologically, making sure the intrigue is as strong as ever. What emerges is the dissection of a modern-day witch hunt. The main adversaries are \"hot property\" Amanda and the pipe-smoking Italian lead investigator, who are both captivating in their own right, even if for completely different reasons. But the crucial insights come from Nick Pisa, the British journalist who broke the internet with his scoops during the case. Halfway, he sheepishly smiles at the camera, and then sums up the whole mess in one line: we just can't say no to a juicy story. Recommended if you like true crime, done well.",
         "I have read a lot about this case and watched anything available on it. I personally believe that Rudy Guede committed this crime alone. Amanda and Raffaele were only 20 and 23 (both in early 20's - my ages may not be exact) - there is NO way they could have pulled this off without leaving a mountain of evidence. Not speculative DNA or theories or circumstantial evidence - real evidence would have been everywhere. They were KIDS, stupid idiotic kids who could not hide a crime like this - their involvement would have been BEYOND obvious. Oh, and remind me to never - ever - get arrested in Perugia Italy. That prosecutor is disgustingly stupid and arrogant. This is simply my opinion - not trying to argue and won't engage if you do. ALL that said - I was extremely disappointed in the Amanda Knox Netflix Doc for a couple reasons. First - I still, to this day, know VERY little about Meredith Kercher. One reviewer said she almost seemed like an annoying afterthought to the producers of the doc - I agree completely. I wanted to see Amanda say \"Meredith was my friend\" and to talk about her like a real person - we got none of that. I did enjoy the way the media was portrayed - as terrible, which it was (is). I personally feel the media in general is to blame for a lot of unrest in the world - the sensationalizing of EVERYTHING - gross. I came away from Amanda Knox the Doc with little knowledge I didn't already have, an annoyance at Amanda for not even talking about Meredith at all and a great confusion over the legal system in Italy. I still wonder....who was Meredith? I feel for her family and would like to see a documentary that supports them and celebrates the life of their daughter, sister and friend.",
         "If you know something about Mario Spezi and Amanda Knox, then you also know Giuliano Magnini. You CAN NOT even begin to understand Amanda's case without knowing and understanding who the monster of Florence is, Giuliano Magnini. I came across Amanda's case while reading a book called \" the monster of Florence\" an amazing chronicle of mediocrity and corruption during one of the most well know cases of serial murders in Italy. Giuliano Magnini, the prosecutor fabricated evidence, played with it, invented a orgy/drugs/sex/blood sect, (sound familiar?) sent a respected reporter to jail, for reporting, tapped phones\u0085.Magnini was even given a conviction and jail time ... and guess what, due to the system in Italy he can still be a prosecutor and worst, can do the same all over again ! A famous articled titled \"You're my enemy? Then I will indict you.\" is a must read \u0085 if you do not understand Giuliano, you only understand 50% of this senseless story. He landed Amanda's case and with it, he tried to create a smoke curtain to erase his past, how unfortunate this young lady was, to fall victim to this monster, to get a mentally unstable man as her prosecutor, a man that will do and lie shamelessly to make his point, a man that even refused to accept other man's innocence because it contradicted his case. The real criminal is Giuliano Mignini, a monster that in the USA will be locked for life for what he has done, yes ... he is the one who prosecuted Amanda. Do yourselves a favor, read The Monster of Florence by Douglas Preston and Mario Spezi and get to know who Giuliano and once you research well you will be shocked",
         "I feel like it was all too acted, the interviews with Amanda felt written and rehearsed. Feels a little like this documentary was made to profit on Amanda's celebrity. Amanda, by the way, certainly doesn't look like a warm, caring person, but that does not mean she is a murderer. The documentary manages to put together a revolting piece of the \"justice\" system in Italy, where the prosecutor Giuliano Mignini makes very clear that there is not a lot of evidence against Amanda but A LOT of conviction that she is a slut and sluts must be punished. Mignini is disgusting and doesn't realize how bad his claims sound. The expression \"slut-shaming\" is not mentioned, but it occurred in my mind multiple times over the course of these 92 minutes. \"Trial by media\" was mentioned close to the ending of it, as it should be.",
         "The movie and the reviews here show how people can be so adamant about the need to punish somebody for a crime that they buy into the most ludicrous theories. Amanda Knox was persecuted by the police in Perugia for committing the transgression of being a \"loose woman\". What do we know about this case? - Rudy Guede's DNA was at the scene, a fact that makes no sense unless he was involved in the murder - In a Skype chat with a friend, Guede said Amanda wasn't there. - Guede had a history of violence and breaking in to homes. - High pressure tactics were used by the police to get Raffaele to change his alibi for Amanda, and to trick Amanda into a vague confession - The vague confession by Amanda implicated her boss, but this theory was discarded by the police. Instead, Guede was inserted into the case while the confession by Amanda was treated as evidence of her guilt. - the treatment of the DNA evidence by the Italian police was atrociously sloppy Many 1-star reviews are being given by people who are convinced of Amanda's guilt. They say that the film is \"biased\", apparently because the filmmakers didn't give equal weight to a pro-guilt side. Well...that's not what \"biased\" means. Yes, the filmmakers clearly feel that Amanda Knox is innocent. You know who else does? The Italian courts. To make claims of bias, you have to go further than to say that a person has an opinion you disagree with. You have to show that they view evidence in a partial fashion: discarding evidence that disagrees with predetermined conclusions while overstating the importance of evidence that agrees with them. There is bias in this case, as the documentary clearly shows. The prosecutor pursued a case against Amanda Knox for clearly irrational reasons, and the theories he uses are inconsistent and often ludicrous. His interviews are the most painful parts of the movie. He says things like \"A female murdered covers the body of a female victim; a man does not. That's why I suspected a woman from the start.\" This is ludicrous. Amanda Knox and Raffaele Solecitto lost years of their lives to this nonsense - emotionally driven aversion to evidence-based pursuit of the truth. Bravo to the filmmakers for giving this story the care and attention it deserves. One final note: shame on all the tabloid journalists who fed the frenzy of insanity. The interview of the journalist who published Amanda's diary shows that he feels no shame at what he did - that he feels comfortable with the violation of her privacy. I wonder if he'll ever figure out what he did wrong here.",
         "A person who followed the case closely might feel a variety of emotions. Because the film approaches the crux of the situation very directly, it's not for the faint of heart, and it's not entertainment. Several participants in this case tell the story in their own words, with their own observations about what went wrong -- interwoven with news reports from the case. These first hand accounts include empathy for what the other side may have been thinking. They don't speak guardedly, I think. It's very blunt. The story, as told in this film, leaves out a lot of details which would add up to an epic if ever told fully; but with the omissions, we get a stream of useful and direct insights. I agree with critics who feel the film was too easy on the prosecution mistakes. It's just probable this softball approach was necessary in order to make the film. The prosecutor is allowed to allege, after the final verdict, many things he was unable to prove or even demonstrate during the trial. He says Amanda's a liar etc. That's how his system works -- no accountability, no four years of prison for Mignini. The prosecutor still seems to believe his intuition might just be better than all the evidence. Every character is revealed in more depth. A low-information viewer might still believe the prosecutor's delusions. The film's weak point was not trying to expose the uncomprehending, privileged corruption of mind & process which were the prosecution's ( & sensational media's ) whole approach. Surely these were omitted for diplomatic reasons, but the point still oozes through the speakers."
      ],
      "genres": [
         "Documentary",
         "Crime"
      ],
      "productionCompanies": [
         "Netflix",
         "Plus Pictures"
      ],
      "summaries": ["American exchange student Amanda Knox is convicted and eventually acquitted for the 2007 death of another student in Italy."],
      "budget": 0
   },
   "movielensId": 164540,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "2016-09-10",
      "dvdReleaseDate": null,
      "directors": [
         "Brian McGinn",
         "Rod Blackhurst"
      ],
      "runtime": 92,
      "movieId": 164540,
      "title": "Amanda Knox",
      "mpaa": "",
      "actors": [
         "Amanda Knox",
         "Anderson Cooper",
         "Arline Kercher",
         "Curt Knox",
         "Giuliano Mignini",
         "Raffaele Sollecito",
         "Donald Trump"
      ],
      "imdbMovieId": "5952332",
      "originalTitle": "Amanda Knox",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "NueLjUNB-GM",
         "9r8LG_lCbac"
      ],
      "plotSummary": "This gripping, atmospheric documentary recounts the infamous trial, conviction and eventual acquittal of Seattle native Amanda Knox for the 2007 murder of a British exchange student in Italy.",
      "tmdbMovieId": 411009,
      "avgRating": 3.46875,
      "releaseYear": "2016",
      "numRatings": 208,
      "posterPath": "/1mdW2sL08fMe6jst372t8g9EZRF.jpg"
   }
}