{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "blow job",
            "id": 3405
         },
         {
            "name": "pot smoking",
            "id": 11488
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "illegal drugs",
            "id": 156117
         },
         {
            "name": "shoes",
            "id": 233048
         }
      ],
      "imdb_id": "tt4254584",
      "video": false,
      "title": "Kicks",
      "recommendations": [
         332748,
         245930,
         99503,
         312101,
         215960,
         165027,
         291874,
         32119,
         297275,
         339258,
         62006,
         230846,
         48114,
         285851,
         95700,
         338353,
         344039,
         54934,
         31142,
         226639
      ],
      "backdrop_path": "/xZyMANVGk6cZuFHKm7ZSuyPvCa7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marlon",
               "gender": 2,
               "credit_id": "56d9622bc3a3681e36021845",
               "name": "Mahershala Ali",
               "profile_path": "/waUvfhRSpVe4vk0hGVcsr0dhpK6.jpg",
               "id": 932967,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Flaco",
               "gender": 2,
               "credit_id": "56d9624a9251414291009b34",
               "name": "Kofi Siriboe",
               "profile_path": "/4qxcHkPIMUMZCW7UNH9kIfRndgS.jpg",
               "id": 1451543,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Rico",
               "gender": 2,
               "credit_id": "56d962a59251416ff200640f",
               "name": "Christopher Meyer",
               "profile_path": "/3tzJccVs2keCKlgMmbH1SXPlKv1.jpg",
               "id": 1310670,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Girl at School",
               "gender": 1,
               "credit_id": "570f143192514102b9001a8a",
               "name": "Natalie Stephany Aguilar",
               "profile_path": "/6ovWRtaMctCPmj2iQzvECyLyUDT.jpg",
               "id": 1605499,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Albert",
               "gender": 2,
               "credit_id": "56d962749251412e28004796",
               "name": "Christopher Jordan Wallace",
               "profile_path": "/3vV8kVZhfIztmIUYw1Hq6JEiAJB.jpg",
               "id": 82163,
               "order": 4
            },
            {
               "cast_id": 1,
               "character": "Brandon",
               "gender": 0,
               "credit_id": "56d96214c3a3681e44024c11",
               "name": "Jahking Guillory",
               "profile_path": null,
               "id": 1586110,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "The Astronaut",
               "gender": 0,
               "credit_id": "570f143192514102af001830",
               "name": "Molly Shaiken",
               "profile_path": null,
               "id": 1502294,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ryan",
               "gender": 0,
               "credit_id": "570f1431c3a3685378001abb",
               "name": "Donté Clark",
               "profile_path": null,
               "id": 1605500,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Shoe Store Mom",
               "gender": 0,
               "credit_id": "570f1431c3a36853730019ab",
               "name": "Dyendis Davis-Jones",
               "profile_path": null,
               "id": 1605501,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Lila",
               "gender": 0,
               "credit_id": "570f143292514143da00007b",
               "name": "Kyndall Ferguson",
               "profile_path": null,
               "id": 1605502,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "House Party Girl 1",
               "gender": 0,
               "credit_id": "570f143292514102b9001a8e",
               "name": "Tina Gilton",
               "profile_path": null,
               "id": 1502271,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "570f87e992514102b9002c20",
               "name": "Tomas Vengris",
               "profile_path": null,
               "id": 1583652,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56d961f392514162b700a437",
               "name": "Justin Tipping",
               "profile_path": null,
               "id": 1354959,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "570f8705c3a3685373002a23",
               "name": "Joshua Beirne-Golden",
               "profile_path": null,
               "id": 1447274,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "570f870d925141016f001c8a",
               "name": "Justin Tipping",
               "profile_path": null,
               "id": 1354959,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "570f8727c3a368538b002e48",
               "name": "Michael Ragen",
               "profile_path": null,
               "id": 1321105,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "570f87d992514102b9002c1e",
               "name": "Brian Reitzell",
               "profile_path": null,
               "id": 40839,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "570f87f992514102b9002c25",
               "name": "Dominic LaPerriere",
               "profile_path": null,
               "id": 1475289,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "570f881a92514133f3001376",
               "name": "Adele Romanski",
               "profile_path": "/7albgSdV3st5kof9W1gbDtP2xBn.jpg",
               "id": 969845,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "570f882bc3a3685370002e04",
               "name": "Michael Angelo Covino",
               "profile_path": null,
               "id": 1175743,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570f883a92514143da0010e0",
               "name": "Geoffrey Quan",
               "profile_path": null,
               "id": 1605632,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "570f885ac3a3685370002e0c",
               "name": "Joshua Astrachan",
               "profile_path": null,
               "id": 43387,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570f8869c3a368538b002e7e",
               "name": "David Kaplan",
               "profile_path": null,
               "id": 1397717,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570f889b92514102b9002c43",
               "name": "Erik Rommesmo",
               "profile_path": null,
               "id": 937872,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570f88bb925141016f001ccf",
               "name": "Brenda Moreno",
               "profile_path": null,
               "id": 1605634,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "570f88c7c3a3685373002a75",
               "name": "Erin Magill",
               "profile_path": null,
               "id": 1605635,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 2.4024,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 385736,
      "vote_count": 34,
      "budget": 0,
      "overview": "When his hard-earned kicks get snatched by a local hood, fifteen-year old Brandon and his two best friends go on an ill-advised mission across the Bay Area to retrieve the stolen sneakers.",
      "similar": [
         8961,
         11282,
         37136,
         9679,
         9388,
         627,
         938,
         15092,
         9428,
         337170,
         171274,
         192102,
         340485,
         100,
         83770,
         37257,
         9589,
         11134,
         1715,
         303991
      ],
      "original_title": "Kicks",
      "runtime": 80,
      "poster_path": "/tDgSxVWVuGDdvLUUlp5FsUnD3vu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bystorm Films",
            "id": 2903,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Animal Kingdom",
            "id": 26995,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bow and Arrow Entertainment",
            "id": 37432,
            "origin_country": ""
         }
      ],
      "release_date": "2016-09-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "They aren't just shoes",
      "adult": false,
      "homepage": "http://www.focusfeatures.com/kicks",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Justin Tipping"],
      "runtime": 80,
      "synopsis": "Fifteen-year-old Brandon, from a rough part of Richmond, California, has always been picked on. He has survived by running away from trouble all his life. But after getting jumped over a new pair of kicks, Brandon recruits his two best friends to join him on a mission to get his shoes back. The odyssey they embark on is at once the night of their lives and a gamble with life and death stakes.",
      "writers": [
         "Joshua Beirne-Golden",
         "Justin Tipping"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4254584/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgzMTk0ODc5OF5BMl5BanBnXkFtZTgwMTAyMTc0OTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jahking Guillory",
         "Christopher Jordan Wallace",
         "Christopher Meyer"
      ],
      "reviews": [
         "\"Kicks\" (2016 release; 80 min.) brings the story of Brandon, a 14 or 15 yr. old kid in \"East Bay\", as we are reminded at the beginning of the movie. Brandon has a hard time fitting in, dreaming that \"sometimes I wish I had a spaceship\", so that he wouldn't have to worry about being chased or fitting in. He pines for Air Jordan sneakers (a/k/a \"kicks\"). After saving up and earning extra dough selling candy, Brandon is finally able to buy the much coveted black-and-red Air Jordans, but within a day, he is savagely ambushed and robbed by a gang in the hood. Brendan is determined to somehow get his sneakers back... To tell you more of the plot would ruin your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: this is the feature length debut from writer-director Justin Tipping. He brings us an insight look at the African-American culture in the Oakland/Bay area, where image and perception apparently are paramount. To not have decent sneakers is to not belong. To not be a 'tough' guy is to be dismissed by girls and guys alike. BEWARE: the movie does not hold back on anything, not in the least the violence that apparently is rampant in those circles. The ambush of Brandon, where a gang robs him of his newly-purchased Air Jordans, is vicious and repugnant. It almost made me leave the theater. Then a strange thing happened: Brandon's quest to regain his sneakers becomes a journey towards self-discovery that becomes mesmerizing, aided along the way by his imaginary/alter ego spaceman who guides him when he desperately needs help. Whether the movie accurately reflects what life is like in that segment of the African-American community, or simply stereotypes it, I couldn't possibly tell you, but what I saw displayed on the big screen made me shake my head on more than one occasion. It's possible, if not likely, that these things are simply incomprehensible for a middle-class white guy like myself... \"Kicks\" debuted with critical acclaim at the Tribeca Film Festival earlier this year. It opened this weekend without any pre-release fanfare or advertising at my local art-house theater here in Cincinnati. The Friday evening screening where I saw this at was attended poorly (only 2 people besides myself), and I can't see this playing very long in the theater. If you are in the mood for a tough \"boys in the hood\" tale that exposes/clarifies the importance of sneakers and other bling, this might just be the movie for you, be it in the theater, on Amazon Instant Video, or eventually on DVD/Blu-ray.",
         "Definitely not for everyone, this brutally stark drama centers on 15- year-old Brandon (Jahking Guillory), who's mired in poverty in the East Bay, Richmond, California. He's constantly bullied for his diminutive size and for the fact that his footwear is so poor, in a culture where sharp sneakers mean status. Brandon finally gets enough money together to purchase his dream sneakers from a street vendor, a pair of original red and black Michael Jordan's. As soon as he begins to wear them, he can see his confidence soar, as well as his status among his peers. However, soon thereafter a bunch of thugs confront him, beat him, and steal his new shoes. Brandon decides he's going to get them back no matter what the cost. Thus, he embarks on a dangerous odyssey, with his two best friends, to Oakland to retrieve his sneakers, which will result in lots of tragic violence. There's pervasive explicit and raw language here, lots of on screen drug usage, and various sexual situations. The acting in the movie is incredibly realistic on all fronts, and I read that director and co-writer (with Joshua Beirne-Golden) Justin Tipping grew up in that area, which would account for this stark realism. All in all, if one has the stomach for it this film can be painfully intense, yet it left me with a lingering sense of sadness as well.",
         "I was fortunate enough to be in the audience of the first screening of Kicks at the Tribeca Film Festival. It's an incredibly fresh and original film that addresses issues of masculinity and violence in modern times. I was actually left in tears as the credits rolled at the end of the film -- contemplating how violent the world we live in is. Yet, there's hope in Kicks, a beautiful hope that we can change and choose to move away from violence represented by the youngest character's choice at the end of the film. The performances from the cast are astonishing, especially the three young actors that play close friends in a frightening world with an honest and humor that is essential in real life. It's entertaining and touching. The use of music and visuals -- all the tools at a filmmaker's disposal are embraced to their fullest. It's hard to describe in words. You just have to experience it. So, go see it. I'm excited to see what's to come from these filmmakers.",
         "Kicks allowed me to gain some very valuable insights into the mind of a kid growing up in Ridgemont, Oakland. When you hear of all the blood being spilled in those most violent and godforsaken places of the US you begin to wonder where it's all coming from. The movie is about a kid who longs for peace of mind and a firm social standing. Alas where our protagonist lives such a firm social standing is mostly determined by status symbols and more importantly by proving one has the power to acquire what others desire in order to show that eventually they will belong to the select few who find a way out of the hell they were born into. But those left behind have no role models left but those who left it all behind, those long gone from the moral vacuum that keeps holding younger generations captive. A vacuum that not only makes sure these young people remain right where they are, but further fuels their despair by sucking in drugs, guns and unprotected sex. The film tackles many subjects - lack of family identity, lack of moral guidelines, drug and gun availability, the media infusing our minds with questionable role models and the products that define them are only a few of them. At the same time it's a coming of age film about a boy who reaches a point where he has to learn what it means to stand up for himself as well as ask himself what is worth to be stood up for and how much it is worth. The kid's voice-over narrative reminded me of the pieces of prison wisdom presented by the guy in a wheelchair from Oz. These poetic moments bring some peace into the relatively loud, violent and fast-paced story. Aesthetically the movie was absolutely flawless, the trailer gives you a good idea what to expect in this department. The story is split into chapters and each chapter is introduced by a song that is descriptive of the content that is about to unfold. There's nothing bad to be said about the acting either. These kids do their job better than most adults can. The sexist elements and overstylization of the subculture presented might put some viewers off. I for my part felt they were essential tools that allowed us to peek into the minds of teenagers in poor urban American neighborhoods and that thereby allowed us to see what it is these kids desire - The simplicity of leading a life that has been promised to them.",
         "This film was a horror movie for me. It gave me nightmares, and it wasn't even scary, not in the traditional sense anyway. Yet, everything about the film was horrific for me. The language, the music, the neighborhoods, the culture; I could not relate, understand or accept absolutely anything that any of these children were referring to, and I felt like a better human being because of it. This movie shows how depraved certain parts of our society are, and how they exalt people and objects over the actual things that matter, like a career, a family, and not having a prison record. It is a glimpse into a depraved and diseased world that has no redeemable qualities, and would rather stew in its own fetid juices than actually rise above it. Let me walk you through it; A kid with crazy hair is the neighborhood punching bad. He is poor, and does not have money for the things that apparently make people popular, ie. sneakers. He decides that, in order for people to notice him, he should own a pair of sneakers (some Nike whatever's that are probably made for less than $10 in Vietnam). He saves up money to buy said sneakers, and suddenly, his friends are treating him better, girls are noticing him, and he is actually \"somebody\". Until the sneakers are stolen from his very feet. Feeling like a big man, he decides to get his sneakers back, and meets some of the most violent, belligerent degenerates the West Coast has to offer. Some people die, other's are seriously hurt, and a lot of blood is shed. All over a pair of ugly sneakers. In a nutshell, this is what the movie is about. Along the way, it glorifies the 'hood, gang violence, drugs, alcohol, under-aged sex, bullying, abuse, absentee parenthood, convicts, potheads; essentially, the worst that society has to offer. It makes it all seem like these people were having fun being social deviants, and this is what made me lose sleep. It's like when you grow up seeing the reality of such of a lifestyle, and how it offers nothing but heartache to everyone involved, why would you make a movie out of it? Why would you show the world the depravity that is ever present in the 'hood? California in 2016 looks like Brooklyn in 1983, and that is not freaking compliment. It looks like a cesspool, where the worst of the worst congregate to serve no purpose to society as a whole, and are simply taking up space and air. The film itself is competently directed, the acting ranges from mediocre to passable (even thought everyone was pretty much playing a version of themselves or someone they know), and the Sci-fi angle was interesting and unique. But none of it could equate to a wholly worthwhile film. To me, movies like this are scarier than any Exorcist, Paranormal Activity, or Descent. These people are real, they live among us, and it's the reason out society can never advance to greatness. I will never understand the mentality of those that come from these areas, and my mother should receive an award for keeping me out of that life. The sad part is, these people do not see the error in their ways, make no effort to make their lives better legitimately, and would rather earn respect through fear and intimidation than actually doing anything positive for themselves, their friends or their family. If that doesn't sound like a horrifying premise to a film for you,consider yourself a lost cause. I shudder to think of the people that see themselves in this movie and can relate to what was transpiring. I do not envy your life, or your disposition. Now excuse me while I go curl up in a corner until the horrifying images are scrubbed from my psyche.",
         "\"Sometimes I wish I had a spaceship.. Just hangout in space where it's quiet. And no one can f**k with me.\" Kicks starts out with us being introduced to Brandon, a 15 year old living in the East Bay. We meet his two best friends Albert and Rico. The three live a normal day to day life of school, chasing girls, and getting high. Brandon is small for his age and doesn't a hold a lot of confidence within himself. This is due to his size, his longing for and lack of experience with the opposite sex, and most of all his confidence and status among his peers. Brandon's sneakers are busted, and he can't afford a sought after pair of Jordans. Albert and Rico both have Jordans. And hot kicks mean status. This is a world where \"J's\" and other symbols give you a status.. Where others might look at you like you ARE someone. Where others admire and aspire for what you have. We see this when Brandon acquires a pair of J's from a street vendor, and soon thereafter is beaten up by a group of thugs led by a man named Flaco. He is forced to give them away. The three boys decide to embark on an adventure over the bridge to Oakland to get the kicks back. Don't get me wrong, this film isn't about Jordans. Or status. It's a coming of age film where we witness a boy at a point in his life where he learns to stand up for himself, and to truly realize what's important. This is director Justin Tipping's feature-length debut. Tipping's realistic vision of this world comes through full force in Kicks. The film is presented in chapters each with a title card featuring a song that is a bit of a hint at what's to come. The cinematography by Michael Ragen is beautiful and aesthetically the film is absolute. The acting by Jahking Guillory (Brandon) and Kofi Siriboe (Flaco) is memorable. The film is fast and harsh at times, yet so dreamy and alluring at others. The portrayal of how violent our world can be is disheartening, although at the end of the film you are able to corral a sense of hope. I would recommend this movie to anyone, and I'll be looking forward to Tipping's next project.",
         "Trigger Warning(s): Gun Shots and Blood Review (with Spoilers) Noted Actor(s) Brandon (Jahking Guillory) | Albert (Christopher Jordan Wallace) | Rico (Christopher Meyer) | Flaco (Kofi Siriboe) | Jeremiah (Michael Smith Jr.) Storyline Brandon is poor. So poor that while his friends Rico and Albert have a fresh pair of kicks, Brandon's look like he got them at least one or two years ago. So with him hustling candy bars to get some nice shoes, naturally when someone takes them he wants to get them back. Problem is, the person who took them is Flaco. A local hoodlum who is definitely about that life but can Brandon step up, either with help or on his own, and take back what's his? Or is he still a boy and not yet a man? Highlights This Movie Will Get You Hyped I'm not sure who of you out there may have gone to an urban movie, in a theater which mostly caters to Blacks and Hispanics, and had that one person who decided to vocalize or express how a particular scene made them feel. Well, let me tell you that person may end up being you with this movie. Something about the way violence happens, the way jokes go down, and how the characters interact is very authentic. To the point you almost one to join in and comment as if they going to look at you and laugh, tell you to shut up, or something like that. The Topic of Manhood, Friendship, and Innocence In the film, there are not real roles for women. Pretty much it is all about the friendships between men, loss of innocence, be it with sex or violence, and what it means to be a man. We see this in a few ways. The first, and unfortunate way, deals with the boys having sex or getting with a young woman. Like many a coming of age film, sex is a symbol of manhood but, unfortunately, the film is an example of toxic masculinity. Perhaps making you wonder why this is a highlight? Well, because in the movie you see how such a thing forms. Take Flaco's little brother, or son, Jeremiah. From what it seems, Flaco takes that kid with him everywhere. Be it him going to a party to get high, drunk, and maybe feel up on a shorty, or to watch people ride around in cars. The boy, who can't be older than 10, observes, absorbs, and with him singing a lyric, seeing how comfortable he is around guns and violence, you see how Flaco has normalized that in his life. Making it so, even at such a young age, his innocence is gone. Naivety about the life Flaco lives is not only non-existent but discouraged. Manhood is presented as taking what you want, defending and keeping what's yours, and violence is a norm and not a last resort. Criticism Ain't One Positive Depiction of Black Women in the Whole Movie When you watch the credits you'll see the name of a few girls like Alexa and Mercedez, but will have a hell of a time trying to remember who the hell was that. Reason being, women solely play the role of someone to mess around with in this movie. If they aren't grinding up on someone, they are as ghetto as possible. If they aren't in the process of having sex, they are about to. I mean, to my surprise we didn't end up seeing a crackhead saying they would suck one of the leads members for a dollar. But to add insult to injury, we don't even get to see Brandon's, Albert's, or Rico's mom. The only mother, much less woman, who isn't problematic is Brandon's grandma and she has a non-speaking role and is bed ridden. On The Fence It's All About Sneakers It all really boils down to sneakers. If you dig deeper you can find other things to note and talk about but, no matter how you look at it, Brandon's passage to being the local definition of a man came from some sneakers. Of which, so much nonsense happens that, paired with the negative depiction of women, it makes it hard to say, without pause, you like this film in such a politically correct world. Overall: Mixed (Home Viewing)",
         "Kicks verges on being a documentary in its presentation. With close and personal filming style, authentic dialogue and story line, Kicks tells a story that is all too familiar in hoods of any urban area. The bully is really nothing more than a guy who gets pleasure from preying on the tolerance and innocence of others. He carries a big gun and has his crew, but down deep he is nothing more than a punk. Brandon, a little frizzy haired boy, who buys his dream shoes, falls victim to the bully. With fearless intent, he confronts the bully and gets his shoes back. The story line could take many forms, but the result is always the same. Until the little guy takes a stand or someone reaches out to protect him, we all run the risk of becoming victims. Kicks has grit and always feels true. There is hope in the despair.",
         "A gorgeously done look at street life. Kid saves some money to buy the fresh new Jordans to put on his feet other than the holely skips he was wearing, his life already changes from the confidence boost with a new swagger that attracts the girls. It also attracts trouble when the local crazy dude steels his kicks. Now the kid becomes obsessed with taking the slippers he's now force to wear off his feet and getting back his kicks at all cost. I remember this life as a kid and how important Kicks were, and it sucks that Kids still have to worry about having their shoes taken. Then again, those 1st addiction Jordans could help pay someone's rent and put food on the table. At first glace, its a horrible look at the what happens when you introduced Jordans to this culture (it seems to me not coincidence that the movie is about the re editions of the 1st Jordans), but all of that is superficial to the message of what really is important in life. The young acting cast is very good, but I can't help but to give a shout out to Christopher Wallace Jr. not just because I'm a fan of his father Biggie Smalls, but I think it's cool that he's an actor and he's good at it. Overall, kicks gives me that colorful feeling I got when I saw Dope and Dear White People, although it has slightly more of a serious tone to it, and it needs that to get the message across. I like where all three of these films are going and how they are going there. Kicks is worth seeing.",
         "1. Jordan Bred 1's 2. Fresh perspective from director Justin Tipping. 3. The first film to my knowledge to incorporate BART as a character. 4. The first film to shine some light on the sneaker culture. 5. The film has characters who feel real to their environment. 6. My favorite character in the film was Flaco, I like flawed people who are more than what they seem on the surface, he had a certain presence that was haunting. 7. I loved the astronaut, once he appeared the film took on a somewhat surreal feel for me, it added a unique flavor to the picture. 8. I really admire the director Justin Tipping, he made the film he wanted to make and that's what I plan to do.",
         "Brandon (Jahking Guillory) is the 15 year old runt in his circle of friends. He is poorer than the other kids and basically indistinguishable. He believes if he gets a pair if Air Jordon sneakers i.e. \"kicks\" his whole life will change. He will be able to float on air like an astronaut...his dream persona. So not to give it all away, he gets them, they get stolen, and now he must venture into Oakland to get them back. This is one of the better produced urban films. Apparently someone on the set had an astronaut suit, so hey, let's put it in the script. It made the film more artsy, but didn't add anything to the plot. I wasn't sure of the theme. Risking your life for a pair of shoes is stupid? Or a rite of manhood? Where was the insight? The message? There are people who really love this film because it is so gritty and realistic and all the things I didn't see. To be kind to the film would be to describe it as \"uneven.\" The film is characterized as an 'adventure\" when I would call it a \"drama with an imaginary space suit.\" Flaco (Kofi Siriboe) and Marlon (Mahershala Ali) were interesting, more interesting than the main character. Engaging, but not exciting. Guide: F-word, implied sex, grinding, no nudity",
         "I do love a nice pair of Jordan basketball shoes but it's not that serious! After all they're just sneakers. As a kid growing up in the late 80s and 90s I remember hearing stories of people getting jacked or killed for a pair of nice basketball shoes. I was surprised to hear recently that this type of stuff still goes on today. That's basically what this film is about. A 15 year old named Brandon would give anything to get his hands on a brand new pair of retro Air Jordan 1s and when he finally gets a pair they are stolen by a hardened thug in his hood and he goes on a ghetto adventure with two of his friends to try and get the shoes back, a nice little story with some nice little twists and turns. This film isn't the best indie film out there but it is a nice one just to kick back and enjoy. I did like the acting coming from Kofi Siriboe, who played Flaco and Mahershala Ali from \"The Hunger Games\". I think these two gave the film what it needed to give it that extra boost into making it a decent film because these two are some talented actors. With that being said, I would recommend this film to anyone who enjoys a good indie film now and then.",
         "Full of suspense.... New actors with serious character profiles and personalities. Best to watch when alone cause you may react with mixed emotions. Great story line with creative twists. Movie is based in a documentary style with action movie imaging. Feels like a true story that Jordan paid for. Based in the projects and people you can relate with. Funny and motivating cheering for the good guy, feeling for the bad. Well worth watching and would recommend it even to the older aged person to watch. If you love Boyz in the hood, Friday, Menace To Society, Welcome to Compton. You will love this movie. Very Entertaining and life like story you can relate to.",
         "I appreciate the attempt to tackle a serious subject. Children are dying over something as simple as a pair of sneakers. I wanted to like this movie but the acting was horrible and over exaggerated. Yes, the N word, underage drinking, violence and drug use is rampant in an urban environment, but not the way it was depicted in this movie. It was so overdone that it was both laughable and depressing. If your not from this environment please understand that this is a terrible depiction.",
         "Special Notes:*(We are going to do this review a little bit different this time around. Inspired by the motion picture being reviewed, In a heading format, whatever heading is bold, make sure you listen to suggested song, during each segment of this review. Read, listen, and enjoy!)* INTRO-J. Cole (Album: 2014 Forest Hills Dr.) \"Sometimes I wish I had a spaceship. Just hangout in space where its quiet; and no one could f*ck with me.\" As the pulsating first frames of Justin Tipping's feature film debut Kicks begins, we see our main protagonist Brandon (Jahking Guillory) running from some kids in a basketball court in slow motion, during the dead of night. As the veins pop from Brandon's forehead, the sweat beads drip, and his pearly white teeth are clinch together desperately (in fear of being caught), one can't help but wonder, what exactly did Brandon do? A young, naive and innocent high school kid who just wants a pair of Jordan One's Bred (Black and Red), a kid who just wants to be accepted and treated equally as everyone else, and not be picked for his height, size, economic status and old, worn out sneakers, Brandon is tired of running. As the film unfolds, we never really know why Brandon is being chased, as one may quickly observe, there may very well be no good reason as to why he is being chased at all. In Big Bay, Richmond, California, Brandon runs away from everyone and everything. That is until, Brandon makes a fateful choice, which, in the course of two days, shifts his world in heart-beating and consequential ways. Brandon is an obvious target for bullies; his stature is frail, his body is small, his mannerisms are delicate and his look is quite feminine. Yet, Brandon knows that there is still a shred of hope for him among his schoolmates, peers and on the street; and that is getting the pair of shoes he wants. As a young boy growing up in Toronto, Canada, the subculture of sneakers could never be as understood as the subculture of sneakers then, the subculture of sneaker culture now, especially within the modern ghetto's of the United States. Once you have some worthy 'kicks' (slang for shoes or fancy sneakers), it doesn't matter who you are, where you come from, what your parents do or how you got them. All that matters is that, they're yours. As we become submerged into Brandon's world, we are introduced to some of the important people in Brandon's life; his best friends Rico (Christopher Meyer), a ladies man who has his way with women; and wannabe ladies man Albert (Christopher Jodan-Wallace, son of Notorious B.I.G and Faith Evans) who talks endlessly about his questionable conquests with women. It soon becomes clear that, in the world of high school and gangsters in Big Bay, California, parents and adults are absent in the roles in their children's lives, and that's usually because of their dedication to their entry-level and minimum wage paying jobs to keep their low-income homes and families afloat. No parents are shown or introduced throughout the course of the film, even within the homes of each of our protagonists. It can only be suggested that Tipping sees the presence of parents as unimportant in the world of adolescents, especially since the streets of Brandon's hood are run and dominated by the high school bullies and low-level gangsters of the street blocks, which rings even more true during the hours of school. The adolescents in the film, as well as the rawness of these very real situations happening in every slum in America, are the true stars of Kicks. Nikes- Frank Ocean (Album: Blonde) Tipping, who almost simultaneously introduces each and every new character by zooming his camera onto their feet and shoes, does a masterful job of associating shoes with personas. Which makes for an interesting allegory of character, especially in the case of Brandon. Brandon is an only-child, fifteen year old kid navigating through the rough terrain of ghetto America. So after countless rainy days spent on the corner of a busy intersection, combined with all the saved up \"emergency\" birthday money he has accumulated over the years, as well as the advice of his mother, the day that some hustling street salesmen by the name of Daryl (Mistah F.A.B), with a van full of Nike boxes entices Brandon over to his direction, Brandon is more than hooked. Left paralyzed with the idea of popularity and acceptance on the streets, in his school, with his friends and most of all, with girls, Brandon buys his dream Nike's impulsively, spending all of the money he owns, including his money hustling on the street, for his Nike Jordan One's. Once purchased, Brandon gazes at the shoe-box on top of a vintage vinyl player, like an astronaut gazing out the window of his rocket-ship, looking at the stars, Brandon is in complete and utter awe.",
         "Gym shoes and sneakers are often referred to as kicks in the urban community. The right kicks can take a young man from obscurity to being one of the popular/cool kids. Imagine being a poor and unpopular teen that does not have any luck with the opposite sex. Then one day your life is changed by the acquisition of a pair Jordan sneakers. This is the plot of the film Kicks. A poor teenager, Brandon, procures a pair of Jordan brand basketball shoes that are taken shortly after by a neighborhood thug, Flaco, and the movie follows Brandon in his pursuit to retrieve his stolen kicks. Kicks is a smaller budget film that was released directly to DVD and video streaming platforms. In spite of its smaller scale release, I found Kicks enjoyable. This motion picture employs the basic storyline in which the main character's property is stolen, and the film is spent following him as he attempts to reclaim the stolen goods. This time the property in question is a pair of sneakers. Now most material things can be replaced, but sneakers, especially these sneakers stolen in Kicks are irreplaceable. Exclusive sneakers are usually either sold in limited quantities, or the price of a reselling of the same shoes is so outrageous, a person might have to take out a second mortgage to purchase them! In the case of Brandon, having these shoes in the first place is happenstance because of his family's economic status. The biggest problem I had with this film is the pacing. Some of the story elements move too fast where I felt more time was needed. For instance, the build up to Brandon getting the sneakers should have been a slower process. The audience would benefit from seeing the struggle Brandon endures to get the shoes. I purchased my first pair of Jordan gym shoes when I was fifteen years old, the same age as Brandon. I was working my first job at a popular grocery chain, and I wanted the red and black Air Jordan number ones to wear on my first day of school; the same shoes that causes the conflict in Kicks. Even with my part-time job paying weekly, attaining the shoes was still a struggle. I saved for months and even waited in line early on a Saturday morning with the risk the shoes would be sold out before I made it inside the shoe store. Well, unfortunately for me, the shoes did sell out\u0085but luckily one of the salesmen had an extra pair he was willing to sell for an additional $25. The shoes were a half size smaller than I wore at the time. On top of that, they were not the original color-way I was so eager to purchase in the first place; they were navy-blue and white. At that point I did not care because returning home empty handed was not an option. After going through that experience, I would have been devastated if those shoes were stolen. A depiction that illustrates a struggle similar to my experience, or worse would have given the audience the context to understand why it was imperative that Brandon get his Jordan's back. With all that being said, there were a lot of things that work in this movie, namely, the casting. Kicks has a young cast, but they carry themselves like veterans in the industry. One of the characters I must highlight is Brandon's friend Albert, portrayed by Christopher Jordan Wallace, the son of the late great rapper Notorious B.I.G. Wallace cleverly portrays Albert as the comic relief in the movie and his comedic timing is impeccable. Kicks is a grittier film, so Albert balances the film out with humor, without it feeling out of place. I am not sure if Christopher is planning on following his father's footsteps with pursuing a career in music, but he has a bright future in the entertainment industry as an actor. Jahking Guillory was just right for the role of Brandon because he is actually the age of the character he is portraying; a rare occurrence in Hollywood portrayals of adolescents. He has a certain innocence that made me feel protective over his character which makes me root for him throughout the movie. Kofi Siriboe, who depicts Flaco is the perfect antagonist because he is the exact opposite of Brandon. Flaco is menacing with no remorse for his actions, and the viewer can tell he has been through some struggles in his lifetime. Although Flaco is a threatening character, the director Justin Tipping still manages to humanize him; a pertinent component in the creation of a good villain. This is the directorial debut of a full-length picture for Justin Tipping and all in all, I was thoroughly impressed. What he is able to pull off with a smaller budget is quite remarkable, and I look forward to seeing more of his work. If you are a fan of coming of age stories that deal with real world situations, I recommend Kicks for your viewing pleasure."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Animal Kingdom",
         "Bow and Arrow Entertainment",
         "Bystorm Films"
      ],
      "summaries": [
         "Fifteen-year-old Brandon longs for a pair of the freshest sneakers that money can buy, assuming that merely having them on his feet will help him escape the reality of being poor, neglected by the opposite sex and picked on by everyone - even his best friends. Working hard to get them, he soon finds that the titular shoes have instead made him a target after they are promptly snatched by Flaco, a local hood. Brandon goes on a mission to retrieve his stolen sneakers.",
         "Brandon is a 15 year old whose dream is a pair of fresh Air Jordans. Soon after he gets his hands on them, they're stolen by a local hood, causing Brandon and his two friends to go on a dangerous mission through Oakland to retrieve them."
      ],
      "budget": 0
   },
   "movielensId": 164604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-09-09",
      "dvdReleaseDate": null,
      "directors": ["Justin Tipping"],
      "runtime": 80,
      "movieId": 164604,
      "title": "Kicks",
      "mpaa": "",
      "actors": [
         "Mahershala Ali",
         "Kofi Siriboe",
         "Christopher Meyer",
         "Natalie Stephany Aguilar",
         "Christopher Jordan Wallace",
         "Jahking Guillory",
         "Molly Shaiken",
         "Donté Clark",
         "Dyendis Davis-Jones",
         "Kyndall Ferguson",
         "Tina Gilton"
      ],
      "imdbMovieId": "4254584",
      "originalTitle": "Kicks",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["LUhHNXzWja0"],
      "plotSummary": "When his hard-earned kicks get snatched by a local hood, fifteen-year old Brandon and his two best friends go on an ill-advised mission across the Bay Area to retrieve the stolen sneakers.",
      "tmdbMovieId": 385736,
      "avgRating": 3.5,
      "releaseYear": "2016",
      "numRatings": 14,
      "posterPath": "/tDgSxVWVuGDdvLUUlp5FsUnD3vu.jpg"
   }
}