{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "rock band",
         "id": 18001
      }],
      "imdb_id": "tt1714917",
      "video": false,
      "title": "Gimme Danger",
      "recommendations": [
         232824,
         287510,
         253139,
         283607,
         18893,
         410678,
         360030
      ],
      "backdrop_path": "/sLriwIGhwr8uuSONpMlsTlDEXtm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "570f9e3d9251416d7300010e",
               "name": "Iggy Pop",
               "profile_path": "/orkeTSZYiHVKqeTntsD6e6VHuqc.jpg",
               "id": 13604,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b0d3c3a3683604020a4c",
               "name": "Ron Asheton",
               "profile_path": null,
               "id": 1205153,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b0e3c3a3683604020a5b",
               "name": "Scott Asheton",
               "profile_path": null,
               "id": 1205154,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b123c3a368361401f729",
               "name": "James Williamson",
               "profile_path": null,
               "id": 1707669,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b149c3a368360801d8c1",
               "name": "Dave Alexander",
               "profile_path": null,
               "id": 1707670,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b192c3a368360801d919",
               "name": "Steve Mackay",
               "profile_path": null,
               "id": 1707672,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b19ec3a368360801d929",
               "name": "Mike Watt",
               "profile_path": "/At6Sbg6gG1XcU0rj1v28uCR8Sdd.jpg",
               "id": 1206524,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5827b1a9c3a368360101dc56",
               "name": "Danny Fields",
               "profile_path": null,
               "id": 1069723,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Herself",
               "gender": 0,
               "credit_id": "5827b1ba9251417b2c01f9e9",
               "name": "Kathy Asheton",
               "profile_path": null,
               "id": 1707673,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5827b1c49251417b2901ff4e",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Curt Wild (archive footage)",
               "gender": 2,
               "credit_id": "597573e192514157f702474b",
               "name": "Ewan McGregor",
               "profile_path": "/aEmyadfRXTmmR7UW7OXsm5a6smS.jpg",
               "id": 3061,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "570f9e5d9251416d5b000138",
               "name": "Carter Logan",
               "profile_path": null,
               "id": 1516841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570f9f439251416d73000139",
               "name": "Affonso Gonçalves",
               "profile_path": null,
               "id": 53713,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "597572ccc3a36821db004470",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5975730fc3a368221c003ddf",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 2.033262,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 392820,
      "vote_count": 38,
      "budget": 0,
      "overview": "No other band in rock'n'roll history has rivaled The Stooges' combination of heavy primal throb, spiked psychedelia, blues-a-billy grind, complete with succinct angst-ridden lyrics, and a snarling, preening leopard of a frontman who somehow embodies Nijinsky, Bruce Lee, Harpo Marx, and Arthur Rimbaud all rolled into one. There is no precedent for The Stooges, while those inspired by them are now legion.  The film will present the context of their emergence musically, culturally, politically, historically, and relate their adventures and misadventures while charting their inspirations and the reasons behind their initial commercial challenges, as well as their long-lasting legacy.",
      "similar": [
         302809,
         329083,
         786,
         1584,
         507023,
         128680,
         18947,
         333667,
         3902,
         2179,
         6575,
         10186,
         15037,
         23367,
         8873,
         18094,
         266639,
         13595,
         18892,
         74406
      ],
      "original_title": "Gimme Danger",
      "runtime": 108,
      "poster_path": "/lD14vyfCHHOwKOMtd0vBlzaySzU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-10-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.gimmedangerfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Jarmusch"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Jim Jarmusch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1714917/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYyOTc5NzI4Ml5BMl5BanBnXkFtZTgwMjIwNzczMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Iggy Pop",
         "Ron Asheton",
         "Scott Asheton"
      ],
      "reviews": [
         "I just saw this at Melbourne International Film Festival in my home town, and It completely lived up to my expectations. I am a big Stooges fan and first heard of this documentary collaboration between Iggy Pop and Director Jim Jarmusch a few years back and could not wait to see it. As a fan of the band and some of the Director's work, they are the perfect marriage to tell this tale. The documentary, told by most of the band themselves but primarily Iggy, covers the bands early inception and up to the 2003 reunion. Iggy is a fascinating interview subject, as are all The Stooges that offer insight,wit and humour in recreating the journey they shared. There is a definite brotherhood between these guys, that was at times as destructive as it was touching. The tributes paid to the fallen Stooges are moving in its unique way, and the documentary as a whole really captures the lasting impact this band has had on music and their influence they have left in their wake. Any fan of this incredible band, that were a statement that pre-dated punk and shocked so many at the time, will love this film. If you aren't a fan, then it also serves as a very entertaining document on a band that are unmistakable in their impact,the fascinating characters and is a chronicle of a turbulent time in music and the world that The Stooges so brilliantly encapsulated in their sound.",
         "If you're expecting another quirky, brooding Jim Jarmusch film, or even that Jarmusch signature here and there, you will be disappointed. Gimme Danger is still a great film, but Jarmusch doesn't do what he usually does - show that the conventional can be really far out if you excavate a little - because he gets that Iggy and the Stooges are already supremely avante-garde; they are already Jim Jarmuschy. So Jarmusch does the opposite - he brings that down to earth, and just showcases what's already naturally there rather than try to create something. Still, documentary filmmaking turns out to be well suited for at least a couple of Jarmusch creative sensibilities. There's a charming, amiable leading man (Iggy), and when Iggy speaks there's a subtly comedic element, and subtle comedy is essential in all Jarmusch films. When Iggy tells the story of contacting Moe Howard of The Three Stooges, there's no need for direction with a magic touch. Just let it be. Ultimately, Jarmusch forgoes being a director with a Jarmusch vision in Gimme Danger other than maybe hoping to convince the viewer to believe, after watching this film, that Iggy and the Stooges are the greatest rock and roll band of all time. He made Gimme Danger as a fan more than as Jim Jarmusch the auteur director, and it ends up being a \"normal\" kind of rock and roll doc/tribute, with plenty of great music and great footage, history, and lots of interviewing. So to repeat, don't expect Gimme Danger to be a typical Jim Jarmusch film. But if you expect it to be a loving and intelligent tribute to a rock and roll band that \"reinvented music as we know it\" according to their former manager, a band that wiped out the 60s according to Iggy, you won't be disappointed.",
         "Having read (re-read actually) 'Please Kill Me\", and having read a lot about Iggy Pop and the Stooges over the years, I didn't expect I'd maybe learn too much about them from this doc. Little did I know not only I would, but that I would be laughing much of the way (the story where Ron Asheton asks Moe Howard's permission to use the name 'Stoooges' kills, but not as much as Iggy's dead serious response when he is told he *willl* play Peter Pan on Broadway by David Bowie's seemingly scummy manager). It's also at times dark, at times harrowing, and the most welcome thing to me is how Jarmusch starts with the Stooges at their (first) end in 1973, when they were broke, Iggy was missing gigs and often showing up so wasted on heroin he could \"sometimes sing, sometimes not\", and it changes up how we usually see these kind of rock documentaries. It often will start with the adulatory remarks. Here, Iggy Pop in the 1973 footage looks like he's about ready to puke all over himself... while stage diving... while probably slathering himself with some substance of unknown origin... maybe genitals out too, who knows(!) This was an entirely fearless band, and they created art simply by virtue of only doing what *they* liked. F*** popular taste. Hell, if one follows Pop by his word (and how can you not?) there were many, many manufactured acts (Including CSNY? please not them) and that if nothing else the Stooges acted as a counterpoint to so much of what was going on in the late 60's and early 70's while being one of the hardest bands of the era. Jarmusch does an excellent job of showing us through Pop, the late Scott Asheton and other interviews, plus plenty of stock footage and, not unlike Julien Temple with Filth & the Fury, clips from old shows, movies and other rock acts (Soupy Sayles being one of them of course) that make joke of what we're seeing, or at least reference. Even as someone who thought he knew the Stooges, or at least Iggy Pop (real name Jim Osterberg), this gives as full a picture as you can get while, at the very end, showing us just how massive an influence they had. Think about it: they couldn't play (at first anyway, they got better as they went), and yet they changed things simply by the force of what rock and roll could do and has done when it's at its most pure. The film reflects the aggression, the commitment to absurdity, and Pop's own madness in performance, which was an act depending on the night (or it was all of a piece). FUN! And I never thought I'd see (or think about) the day when a Jim Jarmusch movie had animated sequences. Bonus!",
         "Early in the film, Iggy mentions how Soupy Sales taught him to keep his writing concise and to-the-point (the kid-show host instructed that letters sent by viewers be twenty-five words or less). The lesson is not lost on Jim Jarmusch, who promises a documentary about the career of the Stooges and delivers exactly that. We get a recap of how they came together, followed by a solid recounting of their brief moment in the spotlight. When they fall apart in '73, the story stops abruptly, then jumps ahead to the group's revival in 2003 (with just a couple of words about what the Ashetons and James Williamson did in the interim). Iggy's solo career is almost completely unmentioned; fitting, as this is a Stooges doc, not an Iggy bio. Though he does get the lion's share of screen time, his recollections here are centered on the band, not himself. Likewise, the interviews are limited to participants: the band members (minus original bassist David Alexander, who died in '75); manager Danny Fields; the Asheton brothers' sister Kathy; occasional sax sideman Steve Mackay; and late-period bassist Mike Watt. Ron Asheton passed in 2009 and appears via archival interviews. Blessedly, there are no rock critics, musicians or movie stars to expound in an overly fawning, sycophantic fashion about the group's importance to them, rock music, or the development of western civilization in general. The recent Beatles tour documentary \"Eight Days a Week\" was very nearly sunk by the inclusion of Whoopi Goldberg telling us how her mother bought her a ticket to the Shea Stadium show. Her memories and opinions are no more important (or even germane) than those of the other 60,000 people who were there that night. She's a celeb talking head who added nothing but her ego to the proceedings. Here, the laser focus is on telling a story through those who were part of the story, to the exclusion of third-party opinions (and you know what opinions are like - everybody has one...) An immense amount of audio and visual material is packed into the hour-and-three-quarter running time, as attested to by acknowledgments in the end credits. That it never seems overstuffed, hyperactive or rushed is a tribute to Jarmusch's sense of pacing. I went in with limited expectations of a run-of-the-mill rock bio, at best (the choice of film was made by my wife, who's a major Iggy fan). I came out more than impressed by a well-constructed, tightly focused exercise in documentary filmmaking that would have been outstanding no matter the subject.",
         "GIMME DANGER is worthwhile and interesting look at those perennial underdogs of rock music, The Stooges. Long time fans of the band should be mostly satisfied with this documentary about their rise, fall and brief rebirth in the 21st century to a far more appreciative response. The Stooges primal proto-punk was certainly before its time in 1969 and really wouldn't be embraced more fully until several decades later. The simplicity of their musical ideas may have evolved from their limitations rather than some grand design. The dark and confrontational sound they created together utilized into those basic elements that can make rock music so compelling. Jim Osterberg's transformation into the iconic Iggy Pop gave The Stooges an absolutely perfect front man. While the Stooges rhythm section hardly moved on stage, Iggy's spontaneous, lanky, almost awkward physicality gave their live performances a sense of danger and unpredictability that made their shows so captivating. Overall, this is an enjoyable enough film, but it does possess some notable shortcomings. One of my main criticisms is that there isn't quite enough focus on the music. There is ample time spent on the songs for The Stooges 1969 debut album, but the songs on FUN HOUSE are discussed only briefly. Even less is said about their landmark RAW POWER album, although though there is some discussion and audio from the early sessions at Olympic Studio. Besides \"Search And Destroy\", any meaningful discussion about the album or its release are virtually absent here! Instead, the story quickly moves on to the demise of The Stooges and release of Iggy & James KILL CITY project. Although the movie time is approximately 1 hour and 46 minutes, another 15 minutes of musical discussion would have been well worth the time spent. Early live performance footage of the band was either in short supply or the producers just didn't have the budget for the rights. For whatever reason, many clips are repeated throughout the movie, mainly the classic Cincinnati Pop Festival footage showing Iggy wandering off into the audience, smearing peanut butter on himself while being hold aloft by an adoring (or fearful) crowd. More vintage footage would have made this documentary a bit more compelling. Given that this movie is focused on the The Stooges (or Iggy & The Stooges), Iggy Pop's solo career is mentioned pretty sparingly. I respect the reasons for this decision, but it would been interesting to spend a little time talking about Iggy & David in Berlin or even just some highlights. But given how little time in the spotlight the Asheton brothers, Dave Alexander and James Williamson have enjoyed, it is admirable that Iggy's celebrity isn't allowed to completely overshadow their contributions. It was also a good decision to limit the interview sections to the band and a few insiders. Many rock documentaries are overfilled with a parade of contemporaries, critics and talking heads whom usually only add limited insight and too much hyperbole. Danny Fields slightly overstates the importance of The Stooges during his interview clips, but this is forgivable given that he was the person that basically discovered them. The newer interview sessions with Iggy back home in his parents trailer and James Williamson holding his Gibson Les Paul Custom Pro Black Beauty are each quite interesting and enjoyable. All in all, i would rate GIMME DANGER 7.5 and would recommend to anyone who wants to learn about the band. I applaud the spirit and well meaning intent of Jarmusch, but wish he'd not moved so quickly through certain eras. It's a very nicely done film, but also a missed opportunity in some ways.",
         "\"Gimme Danger\" (2016 release; 108 min.) is a documentary about the Stooges. As the movie opens, we are in 1973, with the band in a free fall and ready to call it a day, as we get Iggy, Steve MacKay, and other to comment about how bad it was. Pop, then 24 years old, moved back in with his parents in their trailer, After the movie's opening credits, we then go back in time, and we see the humble Ann Arbor roots of these guys, and the even humbler beginnings of the Iguanas and later the Stooges. Couple of comments: this is the latest movie directed by indie film maker Jim Jarmusch. Here he brings the story of the Stooges, as told to us by the band members themselves, although let's be clear: Iggy gets most of the screen time. Turns out Iggy is quite funny and self-depreciating, certainly as to the early years, when he switch from drums (\"I got tired of looking at butts\", ha!) to singer and front man. It is quite amazing how the Stooges' sound evolved from the early avant-garde sound (Iggy: \"it was like an airplane taking off\") to the punk sound of the latter days (the \"Raw Power\" album). The footage is okay but there is surprisingly not much high quality concert footage (one of the better clips is the classic from their 1970 set at the Cincinnati Pop Festival where Iggy smears peanut butter all over himself while he is crowd-surfing). The lack of high quality footage is more than compensated by the gazillion pictures, which frankly suit the legacy of the Stooges better than the archival footage. The documentary thankfully spends little to no time explaining the 3 decades between the 1973 demise and the 2003 \"reunification\" (as Iggy terms it, \"it's NOT a reunion\"), and even the years since 2003 are dealt with in 10-15 minutes. The documentary smartly focused on the key years in the late 60s and early 70s, and that is what makes it so enjoyable to watch. No major revelations, just a solid look at the Stooges. As of course Iggy has the documentary's last words: \"I don't wanna be metal, I don't wanna be alternative, I don't want to be punk. I just wanna be\". \"Gimme Danger\" premiered at the Cannes film festival earlier this years, and finally opened at my local art-house theater here in Cincinnati this weekend. I couldn't wait to see it. The Friday early evening screening where I saw this at was not attended well (2 other guys besides myself), but I know this: all three of us laughed a lot and thoroughly enjoyed ourselves, Hopefully \"Gimme Danger\" can find a wider audience via Amazon Instant Video and eventually on DVD/Blu-ray. If you are a fan of music and music history, you don't want to miss this. \"Gimme Danger\" is HIGHLY RECOMMENDED!",
         "This plodding, by-the-numbers doc manages to make the Stooges (of all bands) seem boring. I know a LOT about the band and their music, and I found this film to be stiff and fairly dull; I can't imagine anyone unfamiliar with the Stooges sticking it out. The first big problem is that Jarmusch proceeds with the assumption that the viewer reveres the Stooges as much as he does. The film doesn't really bother to make an argument for their greatness, or even discuss the specifics their music much, beyond the making of the first album. Instead, it focuses on superficial details like what city they were in at any given time; light music-biz gossip, etc. It's almost absurd how little is said about the aesthetics of \"Fun House\" and \"Raw Power.\" Usually, docs like this will have other rock luminaries and music critics talking about how the subject artist inspired them personally, made a mark on rock history, etc. That approach is absent here. Mike Watt is interviewed at length, but only to go over the minute details of how the band reunited in the 2000s. Much is said about how J. Mascis was instrumental in pulling the guys back together -- why is he not on camera, talking about what their music meant to him? (Danny Fields also shows up, to recount some stories told at greater length in the \"Please Kill Me\" book... this is cool, as far as it goes.) Instead of making a case for the Stooges' place in the pantheon, Jarmusch just plays a montage of \"punk\" album covers (y'know, because the Stooges \"inspired punk\"), followed by clips of younger bands covering their songs. It makes the Stooges seem like a smaller and much less consequential band than they were... you come away with the impression of a minor act that recorded a few songs people like. Another strange choice is to begin the doc at a \"turning point\" in the band's career, then go back to the beginning and tell the story up to that point (and beyond it). This is a very common approach in documentaries and biographies... but in this case, the \"turning point\" is the band's dissolution in the early '70s (after \"Fun House\"). The film begins by presenting a drugged-out, worn-out, falling-apart group of guys, and then expects the viewer to care how they got to that (not very interesting or unique) point(?) Once the chronological story line does kick in, it proceeds without tension or suspense. Jarmusch compensates for a lack of extensive archival footage by frequently throwing in old film clips, apparently in an attempt to \"humorously\" illustrate what interviewees are saying... I found this move to feel obvious and \"smug.\" A final problem is the extent to which Jarmusch relies on recent interviews conducted with Iggy. He seems to have simply turned on the camera and let Iggy drone on, and then included big chunks of the footage in the doc. Let's just say that it does not do the film, or Iggy himself, any favors. I can't remember ever before watching a documentary about a respected band or artist, and coming away less of a fan than I was going in... but somehow, \"Gimme Danger\" managed to achieve that.",
         "A friend of my recommended this documentary to me. Just randomly heard about it and was enough of a Jim Jarmusch fan to want to try it out, and he loved it, despite not being a fan of the Stooges, or having it change his mind about their music. As much as it was an in-depth look on Iggy Pop and the Stooges, it's just as much an in-depth look on Rock and Roll, and every Rock and Roll Documentary should be. I gave it a shoot, as I am a fan of the Stooges and what they have done. After all, I'm sure a lot of the music I listen to they directly or indirectly are responsible for. Going into the movie, I was expecting somewhat an adaption of the book Please Kill Me, which was an in-depth look at protopunk, which I herd the Stooges be described as before, plus they take up a big chuck of the book, but that's not what this doc is at all. It was so focus on the Stooges that it rarely expanded outside of the band members and those really close to them. As the only original surviving member at the time of this release, Iggy does a lot of the talking, but not in an egotistical way. He seemed very genuine in his stories about The Stooges and their history. Not that the other Stooges did not get to chime as it looks like Jarmusch had been working on this for a while with the drummer of the Stooges also able to tell his stories before his death. It is all about rock and roll and all about the music. I can see why Jarmusch selected and loves this band as they seem uncompromising to their love of the music. It's a great message on sticking with it. It also a great message about how it never dies within you, as the doc tells the story of the Stooges second guitarist James Williamson, who rolled with the band and Iggy until they dissolved got himself a pretty square life, but when Iggy calls to say come Jam with the band like 40 years later, he did just that. Not Just for those people who love the Stooges, it's for those who love a really good rock and roll story. This is one!",
         "Gimme Danger: Gimme Iggy Gimme Danger is about Iggy Pop and the Stooges, the unruly, undisciplined band of post-hippy rockers that, \"killed the sixties\" as Iggy says in one interview. There are several directorial and artistic choices made in the film that prevent \"Gimme Danger\" from being a spectacular film and places it in the middle of the list of good biopics, but not spectacular. In summary, I would rate the parts of the film thusly: First half: A+ Third Quarter: B End: C- The film doesn't address Iggy Pop's career from 1975 to 2003. What was happening during those years? What was happening is Iggy Pop was recording his successful solo album \"Lust for Life\" with the cult hit The Passenger on it. Why exclude this? Did the record label refuse permission? Did Iggy or Jarmusch insist on only including Stooges music? What about Pop's other solo music and his dabbling into acting? What about his lifestyle transformation from drug addiction to clean living? No, the film buried the real story: Iggy Pop. It was a poor choice and I wonder why they did it? Why not more about Iggy? Was he trying to \"Share the credits evenly?\" Why not interview some of the musicians Iggy and The Stooges influenced like Henry Rollins, Billy Joe Armstrong, among others? I would love hear what Neil Young thought of the Stooges, or Kim Gordon from Sonic Youth. Why not interview the family or others around the scene. Why not quote Bowie who produced some Iggy Pop music after the Stooges? Why take out the most interesting subject of the film? That was a bad choice, and even if Iggy Pop insisted, insist harder to include more about him. Perhaps that was a condition of filming, or otherwise, Pop would have refused? If it wasn't, Jarmusch did us a disservice. That said, they did include his early career as a drummer, the development of the band, growing up in a progressive town, Ann Arbor, and how that influenced them, their drug addiction and issues staying clean, his travels to record music from Detroit to Chicago to New York to London and finally L.A. Iggy is far more interesting, his transformation is more interesting, than the band. Imagine a Bourne movie spending half the film talking about Nicky Parsons. She's an important character, but you would be rightfully disappointed. That's how it is with Gimme Danger. Iggy is the attraction. Rating: Matinée, accrued score. First half: Pay full price, see it twice. Second Half: Rent it. The first half had me laughing and intrigued, the second half of the film was a big let down. Peace, Tex Shelters",
         "This is a shallow film about a shallow (albeit likable) man, full of shallow references to events that would only be interesting to people who are already fans of the band. As a documentary filmmaker myself, I would've left 75% of this film on the cutting room floor. Did you know Iggy once saw John Wayne driving down the street in LA? ...Well, he *thinks* it was John Wayne... I wouldn't put that drivel in a god damn Facebook post, much less a documentary film. I have to believe there was some depth to be found in the life and lessons of Iggy and the Stooges, but its all wasted on Jarmusch. This is nothing but a vanity piece made by fans for fans. It will be an utterly forgotten film with zero relevance for the world beyond Iggy/Stooges fans. This isn't to say that the Stooges weren't a very relevant band. I am convinced they were. But that doesn't make for an interesting film, and its essentially the only message conveyed. I enjoyed looking at Iggy's face for over an hour, but after 30 minutes being impressed at how well that man has aged, despite a lifetime of abusing his body, there was nothing left to ponder. Better to spend your time on films that don't simply elevate celebrity, but dig into deeper issues, like the \"Friends Forever\" documentary about a pair of musicians who never achieve any fame, unintentionally illustrating that life is about the journey, not the destination. That film was made by an auteur, not a fanboy, who exposes the emptiness of pursuing fame, sex, drugs, and everything else that Iggy and the Stooges seemingly glorified. Unless you're in the mood for a shallow fluff piece, that would be a better use of your time.",
         "Jarmush's passion to making films is insatiable and unmistakable. Gimme Danger opens with Iggy Pop sitting in a chair , interview style in a trailer home. Almost immediately you get sucked in the story , and you just watch what unfolds. Basically Iggy narrates the story , while various related archive footage is shown on screen. The greatness of this music documentary is that it isn't stiff. Jarmush is playful in his selection of footage, and many scenes are pure comedy. There's oldie movies from the 30's and 40's shown , there's hilarious animation , and of course archive footage from the Stooges and other musicians related to the story. I found Gimme Danger very entertaining and a successful music documentary , since you do learn about the band through this , you get a sense of their style as individuals and how they worked. I have to mention that Iggy Pop's speaking is very down to earth, very humble and true and to be honest I didn't expect such an abusive person to still have his mind on his shoulders. I was wrong though and that was also a pleasant surprise. It won't disappoint either fans or non fans who just feel like watching this.",
         "So what is this? A quite conventional musical documentary embedding a bands history within a bigger history of society and musical appearances and hereby constantly arguing the uniqueness, the coolness and the relevance of The Stooges and their professional anti-professionalism. It has the same sort of bohemian snobbish feeling to it I already found disgusting in ONLY LOVERS LEFT ALIVE: all this bitter mystifying praise of the \u0084real\", \u0084authentic\", \u0084good\", \u0084true\", etc., artistic stuff within a devilish sell-out Disneyland world is just soo much emphasized that it's actually ridiculing itself. But at the same time it is a fanboy work and a work of friendship, a film not only about the band, but a film in dedication for the band, a gift, an openly political and explicitly personal attempt to immortalize the musicians, communists, existentialists, drug users and drug abusers around Iggy Pop: \u0084The Stooges Forever!\", it says on the gong starting and finishing the film. And this is basically the sole purpose the film is made for and this is what adds quite a bit of intimidating intimacy to it, making it more like a letter to Iggy only masked as this educational musical documentary it is trying to be at its surface. This is no offense: The naive and sincere face under the mask is what turns the film into touching cinema, after all. And the sound, well, the sound made me heart jump around hard every once in a while.",
         "I've seen the movie two times within 3 weeks with two friends of mine who didn't know much about The Stooges but they were like \"well OK, whatever\". After the movie they had bright eyes and were totally excited and happy that I invited them. That says it all. I enjoyed it the second time even more. I'll start with a few of the negatives: I really missed some details about Iggy's time with Bowie in Berlin. I think it was a really productive and important part of Iggy's life and had an influence not only on him but on the band. On the other hand there were some scenes which I would have left out: for example the part with John Wayne or some stories about the trailer. They didn't add anything to the story. The music wasn't really in focus here so someone who doesn't know them, won't love their music after this nor will know anything about the process of making music, except a few details. Now the positive side: I love the fact that this is a documentary about The Stooges and not about Iggy Pop. He is a unique, eccentric figure, but he doesn't steal the show. Every member of the band share their stories and I was really happy to see and hear the Ashtons before they passed away. Jarmusch focuses on the history of the era, the history of The Stooges and the personal stories behind the stage and on stage. I adore him for not asking 200 critics and some distanced relatives to talk about them. He asks only people who were either in the band or in a close relationship with the band. I love The Stooges and I knew some things about them besides their music but Gimme Danger had some new information to share, it does a great job in organizing 40 years in 2 Hours, which is not a walk in the park, it was genuinely funny and sometimes also touching. The parts in the second half where the band comes together were like that. It was moving to see 50-60 year olds, some of them in a bad condition to be happy as a child because the band is together again. It was heartwarming watching Ashton play the drums for the last time. These guys didn't care much about the big money, they just wanted to play music. It doesn't matter that their lost their way, they always find a path somehow to play again. Overall Gimme Danger has some weaknesses but I would watch it over and over again, because it does justice in portraying The Stooges. It is also unique, because most of them are not with us and it would have been a huge missed opportunity to not interview them for the last time.",
         "Growing up in the sixties and seventies we were exposed to a ton of music and musical styles that seem lacking in today's world. At any time you could turn on the radio and find Frank Sinatra, Black Sabbath and Sly and the Family Stone all on the same channel. Today we tend to compartmentalize music into sub-genres and limit listening to only what we love without exposure to anything different. Had that been the case back then music would never have evolved and led to different styles. Such was the case with the Detroit band known as The Stooges. This documentary follows the early beginnings through to the last moments of the Stooges career along with their front man Iggy Pop. It runs like most rock documentaries in that it follows the timeline, shows them performing and combines that with interviews past and present to form a cohesive of the band start to finish. As with most bands that began in the sixties there is plenty of open talk about the drugs they took from marijuana to acid to heroin. It doesn't glorify the use of those drugs but it was a part of the lifestyle they lived. It was a part of the rock culture at the time and the fact they survived those days without serious overdose or multiple deaths shows it didn't always end that way. That they don't discourage or encourage the use of drugs shows a more even keel in the discussion rather than aging rock stars saying \"I did this but you shouldn't\", something most rock docs seem to do. It becomes a hollow piece of advice in those. The sound of the Stooges was raw and it was powerful and that's what drew fans to them and their music. I got the sense that this stemmed from their home base of Detroit, of being exposed to that working class atmosphere, of listening to the hammering of metal in factories in the area. Many bands that came from the area were exposed to the same thing and it is apparent in the sound of bands like Grand Funk, Alice Cooper, Bob Seger, Ted Nugent and The Stooges. But The Stooges sounds was rawer than most with the exception of perhaps MC5 who played a major role in their early years as seen here. This sound The Stooges created influenced so many bands and was also part of the foundation for the next big genre of rock music to come, punk. Their influence can be heard and is commented on in the film with their style replicating in bands like The Ramones, Sex Pistols, Sonic Youth and more. It was hard, it was fast, it was loud and it was raw. That word comes up a lot when thinking about The Stooges and deservedly so. The movie doesn't spend any time discussing the solo career of Iggy Pop and actually that turns out to be a good thing and goes along with what he says in the film. He talks about how the band were true Communists when they began, not in the sense of political ideology but in that they shared and shared alike. Money coming in was divided evenly. This extended to their return to the stage in 2003 at Coachella where he was offered so much to perform and said they'd have to triple the amount so each band member would get the same. To his surprise the backers agreed and they played. The movie does give a historical perspective of the band and that's great that a new generation will possibly find the band through the film. Many will be surprised at how influential they were. The biggest surprise in the film for me was that while directed by Jim Jarmusch his style of filmmaking isn't on display here making the film about himself instead of the band. Rather he sticks to the straight forward format used in most rock docs and it pays off in the end. As far as rock docs go this one is among the better that I've seen. It tells the story of its focus, The Stooges, rather than become a movie about stylistic choices of the director. It moves along from start to finish for the band and offers them in performance all along the way. It presents the band and its individual members in a respective tone allowing each to speak never giving one more on screen time than the rest with perhaps the exception in a small amount to Iggy. It doesn't glamourize nor demonize the band. It just lets the music do the talking. And what powerful talking it does.",
         "In my youth I did not seek out Iggy & The Stooges. They did not get much play even on the so- called \"progressive\" FM station I heard so much great music on in my teens. On occasion I'd read something regarding the band in a music magazine, but they flew below my radar and it was not until decades later I discovered I liked a few of their tracks. Apparently there were more of me than I knew as it took quite a bit of time for the band to be regarded as highly influential. So, here, almost 50 years, after the first banding of what would become The Stooges were formed there is this quite personal Jim Jarmusch film telling the band's story. As a rock music fan I had enough interest to seek it out. It was interesting and informative as to why they still sell records and acquire new fans. This was a band that was extremely unique with an iconic frontman. They obviously had it even tougher than The Ramones, another influential band that never quite got the sales or adulation they deserved while they were actually a band. The fact they survived for several reunions and found greater success so belated is almost equal to the power of the music which ultimately survives. They have finally got both critical and fan recognition. I'd say it is story than you don't have to particularly care for their music to find interest in. That is a pretty strong recommendation. I like rock music especially the best of the sixties and seventies, and I understand something I missed in that time now with more clarity. Sometimes being so different means the world at large needs time to catch up."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Low Mind Films",
         "New Element Media"
      ],
      "summaries": ["An in-depth look at the legendary punk band, The Stooges."],
      "budget": 0
   },
   "movielensId": 164655,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-10-28",
      "dvdReleaseDate": null,
      "directors": ["Jim Jarmusch"],
      "runtime": 108,
      "movieId": 164655,
      "title": "Gimme Danger",
      "mpaa": "R",
      "actors": [
         "Iggy Pop",
         "Ron Asheton",
         "Scott Asheton",
         "James Williamson",
         "Dave Alexander",
         "Steve Mackay",
         "Mike Watt",
         "Danny Fields",
         "Kathy Asheton",
         "Jim Jarmusch",
         "Ewan McGregor"
      ],
      "imdbMovieId": "1714917",
      "originalTitle": "Gimme Danger",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["ruqmemgLc2E"],
      "plotSummary": "No other band in rock'n'roll history has rivaled The Stooges' combination of heavy primal throb, spiked psychedelia, blues-a-billy grind, complete with succinct angst-ridden lyrics, and a snarling, preening leopard of a frontman who somehow embodies Nijinsky, Bruce Lee, Harpo Marx, and Arthur Rimbaud all rolled into one. There is no precedent for The Stooges, while those inspired by them are now legion.  The film will present the context of their emergence musically, culturally, politically, historically, and relate their adventures and misadventures while charting their inspirations and the reasons behind their initial commercial challenges, as well as their long-lasting legacy.",
      "tmdbMovieId": 392820,
      "avgRating": 3.38889,
      "releaseYear": "2016",
      "numRatings": 27,
      "posterPath": "/lD14vyfCHHOwKOMtd0vBlzaySzU.jpg"
   }
}