{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "holidays",
            "id": 209474
         }
      ],
      "imdb_id": "tt4434688",
      "video": false,
      "title": "The Spirit of Christmas",
      "recommendations": [
         369058,
         365756,
         365762,
         369059,
         311093,
         366631,
         253265,
         240911,
         437515,
         479048,
         474976,
         363484,
         289520,
         286071,
         299588,
         421629,
         410314,
         296456,
         234951,
         249062
      ],
      "backdrop_path": "/n3R7tnwjhPTBJavVMyiYcJaHJH8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Kate Jordan",
               "gender": 1,
               "credit_id": "5641312592514128a1000776",
               "name": "Jen Lilley",
               "profile_path": "/aa6cDg9egAxAnFq20cXBHW7GRKa.jpg",
               "id": 210344,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Daniel Forsythe",
               "gender": 0,
               "credit_id": "56413138c3a3685be20006fb",
               "name": "Thomas Beaudoin",
               "profile_path": "/fcWtY3iYEbUU1B9YyZa4xevG6ns.jpg",
               "id": 1533800,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Walter Rafferty",
               "gender": 2,
               "credit_id": "579677459251417dca000cfb",
               "name": "Robert Walsh",
               "profile_path": "/84a16bnJ3GZZtithLCnrONGmxGY.jpg",
               "id": 1171094,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Sheriff Noah Bell",
               "gender": 2,
               "credit_id": "56413144c3a3685be50007af",
               "name": "Bates Wilder",
               "profile_path": "/7qMxQfPusgH1e6T0qzOI7Xy1z5A.jpg",
               "id": 50588,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Lilly",
               "gender": 1,
               "credit_id": "579675229251417e31000cae",
               "name": "Kati Salowsky",
               "profile_path": "/bcASevWp73PU8U4NgoxiYoA0b6P.jpg",
               "id": 1289326,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Harry",
               "gender": 0,
               "credit_id": "579675539251417e00000c91",
               "name": "Brett Leigh",
               "profile_path": "/nl4eus0kRy4L1i6uma88zDpS9uZ.jpg",
               "id": 1439098,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Molly Bell",
               "gender": 0,
               "credit_id": "57967575c3a368292300baff",
               "name": "Joanna Herrington",
               "profile_path": null,
               "id": 1580086,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Oliver",
               "gender": 0,
               "credit_id": "579676d09251417d4a000dd2",
               "name": "Christopher Tarjan",
               "profile_path": null,
               "id": 1656520,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Charles",
               "gender": 0,
               "credit_id": "57967bdc9251417e0000104e",
               "name": "Steven A. Miller",
               "profile_path": null,
               "id": 1656530,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "579675b69251417dca000c3d",
               "name": "Tracy Andreen",
               "profile_path": null,
               "id": 1512119,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "579675cfc3a3680c9e000d1a",
               "name": "Andrea  Ajemian",
               "profile_path": null,
               "id": 1631599,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5796764a9251417dca000c88",
               "name": "David Jackson",
               "profile_path": null,
               "id": 44683,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59b03b1e92514107af072319",
               "name": "Claude Foisy",
               "profile_path": "/h51H4ThS9simFpcqy8SRYS1LmzO.jpg",
               "id": 52339,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.521881,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 367544,
      "vote_count": 61,
      "budget": 0,
      "overview": "A woman falls in love with a man who is somewhat unavailable.",
      "similar": [
         17979,
         11395,
         11881,
         1585,
         10147,
         9479,
         51052,
         2655,
         1581,
         201085,
         634,
         452507,
         338964,
         10510,
         13188,
         13673,
         5375,
         5255,
         620,
         8871
      ],
      "original_title": "The Spirit of Christmas",
      "runtime": 84,
      "poster_path": "/zaygsTCHe8f3ISHOHFxKMzKTpPF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2015-12-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "This holiday could be the start of a new beginning.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Jackson"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Tracy Andreen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4434688/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYzcyM2MxNzMtYzEzNi00MjRlLWI2YTItM2U0MWZlZDVkNjNhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTU5MjU5MTM@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Thomas Beaudoin",
         "Kati Salowsky",
         "Jen Lilley"
      ],
      "reviews": [
         "This is a unique take on TV Christmas movies. I enjoy watching most TV Christmas movies but so many are pretty predictable kind of like they are out of a box and just fill in the blanks and have an unnaturalness in the acting. But this movie is different and has a great plot and very good acting and very good sets. I challenge anyone to find a Christmas TV movie like this one. Fun to watch and very different from the Christmas TV movie standard formula. During the whole movie I was interested and not sure of how things were going to turn out, which is something I like in a movie. The lead female was very good and very believable and just a natural for the part. And the lead male was equally as good and well suited to the part. And the supporting cast fit very well. I never once lost interest or was able to jump to the ending in my mind.",
         "I actually really enjoyed this. It's well done as far as made-for-TV Christmas movies go, with a unique story and decent mystery attached. It also wasn't as corny or cliché as most holiday themed movies tend to be and I wasn't ever sure how the story was going to play out especially in regards to the happily-ever-after. The acting and sets were very good too, including real snow, as I've seen some Xmas movies which were obviously filmed mid summer. The story follows Kate, a lawyer who travels to Vermont to broker the sale of an inn and learns that the reason it won't sell is because it's haunted by a man who cannot move on until the mystery of his death (95 years ago) is solved. I have to admit one of the reasons I enjoyed this as much as I did was down to Thomas Beaudoin who plays the ghost. I've never seen him in anything before but he was excellent. Decent acting and super good looking. He really pulled off a man from the turn of the century. Daniel as our ghost only appears 12 days each year and then disappears back into his static between world again. He is grumpy and perpetually hungry for his 12 days at the inn, wanting just to be left alone. Despite Kate finds herself drawn to the ill-tempered spirit, determined to help him and they soon find themselves in an unlikely time crossed romance. 12/23/15",
         "This is actually the 2nd review I am doing for Christmas movie because I felt them both to be unique & not the typical cookie cutter movie you tend to see this time of year. During the holiday season tons of Christmas movies come out. They are purposely made to be feel good movies They are great to have on while you are putting decorations up - making cookies or anything to assist with that magical time of year. Which is a great thing especially that time of year. However you can only watch X amount of very expected guidelines with predictable repetitive story endings. Sometimes regardless of it being the holidays you want some substance. This offers just that. It is a great storyline that you really have to follow. Don't get me wrong it is still a feel good movie but part of that feel good you get is from when you walk away thinking WOW - that really was a great well thought nurtured storyline with an interesting story told!!! That is just my opinion - I say well worth watching & deciding yourself!!!",
         "This Christmas movie is definitely a different one because I never seen a film where a ghost falls in love with a modern girl 95 years later. It does remind you of Patrick Swayze's 'Ghost' or they took the past ghost idea of Charles Dickens 'Christmas Carol'. I really liked hearing Jen Lilley's voice, she has such a voice that you are immediately dying for. She's like so stunning for an actress that I never even knew she was in a few well known films! Since she is a singer, she should've sang a Christmas song in this, she would make this film more Christmassy! Thomas Beaudoin was excellent playing as the ghost, he really has the looks of a handsome gentlemen from 95 years ago. I say it was the make up and outfit that made him attractive! I like how this movie was also a mystery, we are able to dig deep into the time he was killed and what his life was like then. Throughout, the only thing I was questioning myself like why did his killer kill him? I could say it was pretty horrible for the poor guy to not know this for all these years! You would be thinking in the ghost world, what are the answers? I wish we could see people who have left us and that we would be able to help them figure out their past! This movie is absolutely stunning and brilliant! I would suggest this as a good film to take a look at :)",
         "What can I say about The Spirit of Christmas? It perfectly blends mystery, suspense, and romance into one fantastic holiday movie. Kate is the perfect character to assist Daniel in discovering the truth about his murder on that cold, winter night. Seeing the development of Kate's and Daniel's relationship throughout the story was truly heartwarming. They went from Daniel wanting Kate to leave the inn and never return to being the perfect match for one another, a true Christmas Miracle. I can't say enough about the writing and acting. Just superb. It was heartbreaking to learn that Daniel;s cousin was his murderer, but at the same time you felt compassion for the cousin due to his circumstances. The true character of Daniel was on display in this moment, however, when he forgave his cousin. Enormous growth from the Daniel we first met. I loved this movie and would recommend to anyone that is looking for a great, fun, loving Christmas movie for the holidays. Merry Christmas and a cooked goose for everyone!",
         "When I began watching this movie I expected it to be the typical ghost story type movie where woman falls for man then man vanishes and never returns plot but no, not the case. I also will say the scenery/filming location was simply magnificent, so beautiful. The acting was far better than I'd expected and the ending was a total surprise. This movie reminded me of movies way back in the 1970's/'80's when movies taught/reminded us of our values, taught us forgiveness and much more. Well done, I simply loved every minute of it. I'd encourage anyone to watch this movie, you won't be disappointed no matter your age. I usually pass on these lifetime or network Christmas movies but am glad I chose this one to begin the Christmas season with.",
         "Daniel is a little different from what you think of when you picture a ghost. The holiday season (the winter solstice) is 'a magical time of year,' which according to the Ancient Celts meant that the veil between this world and other realms and the veil that separates the living and the dead is thin (think of the ghosts in A Christmas Carol by Dickens). With that in mind, during the holidays, Daniel takes on a solid form. Like a vampire or a zombie, he's undead and has an insatiable appetite to fuel his unnatural body. Like a ghost, he doesn't sleep, he can't leave the property, and has unfinished business to take care of. He quite literally can choose to be ghostly or solid, and ultimately he has to choose one for the rest of his life. The ending is confusing but here's what I think happened. Daniel hadn't been around any Christmases after his death, but he managed to remain solid this time around for Christmas because he was starting to resolve his unfinished business/break his curse. Since he hadn't been around on Christmas before, he didn't see the residual haunt that happens at Christmas. That is, the murder happens every year (in ghostly form) just as it happened, like watching someone's memory. Spirits aren't really 'there' during residual haunts; you can't interact with them. Then Daniel finds out the other spirit in the bed and breakfast is the man who murdered him. Then Daniel lets go of his anger about his death. Thus, Daniel's former lover's spirit shows up to take Daniel to the other side. Since Daniel's somewhat alive, he chooses to stay alive and live out the rest of his life. A hard-working life in a legal line of work instead of the illegal high-life he had when he was alive.",
         "This Lifetime Christmas 2015 movie has everything, perhaps too much of everything: an attractive cast, love, romance, nostalgia, mystery, beautiful winter settings and a splendid, Victorian haunted house \"Hollygrove Inn\". It's the former home of the Forsythes,(not the same as in the \"Forsythe Saga\"), who have died without heirs. Ambitious,single and thoroughly modern attorney Kate (Jen Lilley)is sent from Boston to Vermont 12 days before Christmas to broker the sale of the inconveniently haunted mansion. She's promised a promotion if she can deal with the ghosts and the real estate before the year's end. Problems start to mount as soon as Kate gets there. The appraiser leaves in panic, his job undone, after having encountered a ghost. Plus, the innkeeper Warren (excellent actor Robert Walsh)is closing the Inn for the holidays.But spunky Kate tells him she will stay in spite of Warren's objections. Kate stays, meets the resident hunky ghost,impressive Daniel Forsythe (Thomas Beaudoin), who died by an unknown killer on Christmas Eve 95 years ago, as he approached \"Hollygrove\". The supernatural walks into our story right then in the unusual form of Daniel The Ghost, who likes to eat pancakes, imbibe drinks, and of course, likes women like Kate, in more than a spiritual way. At first, Kate and Daniel quarrel, but soon she succumbs to his manly ghost charms. Kate's love is also fueled by her empathy with Daniel's very sad, errant ghost story. Daniel is doomed to return to the house every Christmas and not to resolve his other-worldly status until he can solve the mysteries of his life, love and his death. Eventually, Kate will help him to solve the puzzle of his inconclusive ghost existence. This TV movie looks expensive, its production values are high, as we travel back to Hollygrove 1919,in stylish flashbacks. We learn Daniel thinks his wife Lilly (Katy Salowsky) was unfaithful with his brother, whom she married and had a daughter with, after Daniel died. We also find out, with curious Kate's help,that not one, but two ghosts inhabit Hollygrove, and the other one is Daniel's mysterious killer. Is it his bro, his wife, or someone else? Stay tuned to the end and find out. Another suspense element in this very complicated story, is his wife Lilly's love for Daniel. Did she or did she not betray him with his bro? Another subplot to solve is the future of Hollygrove. How can Kate sell the property and have her favorite ghost be homeless? Who will buy Haunted Hollygrove with the murder curse and the unwelcome ghosts? Finally and most importantly, will Kate and Daniel find a way to join flesh and spirit,to bridge the chasm between life and death, and fulfill their love? In many ways the unusual human-loves-ghost story gives origin to interesting, suspenseful and cute humorous situations. The lovely Hollygrove mansion and setting, plus the period flashbacks gives it romance and nostalgic texture. There's also several charming subplots like the romance between Molly(Joanna Herrington) a local pub owner, and Innkeeper Warren, who is also the ghost's best friend.\"The Spirit of Christmas\" requires that we forsake our logic and stretch our imagination into the realm of the supernatural. But think of Dicken's \"A Christmas Carol\"or of some Nicholas Spark's romantic stories,like \"Safe Haven\". Think of so many Christmas films in which Santa, elves, or angels do magical mysterious favors for humans. Christmas is that time when we are most willing to suspend logic and believe in spirits, the promise of an afterlife, and all things magical. The problem with \"The Spirit of Christmas\" is not that we can't accept its supernatural premises. It's that the crafted storyline doesn't work logically. At the end, the puzzle pieces don't fall neatly into place.Thus, it doesn't produce a fully pleasing feeling, a sense of artful satisfaction. It has too many loose ends and unexplained issues. I'll mention just one, not to produce important spoilers. How can Daniel be allowed to choose between staying on Earth or move to another life, once his curse is lifted? Analyze what the script says happened in 1919t; it's full of holes. The plot is too complicated and ambitious. Especially when it flashes back,the treatment of past events is shoddy, perfunctory and unreal. The film does much better when it covers the present, with more reality, wit, and humor. The cinematography is beautiful, with great winter landscapes and interiors. The acting is competent, especially by Ms. Lilley(Kate), Ms. Herrington (Molly), and Mr. Walsh (Warren). I also liked Mr. Beaudoin as Daniel whose impressive presence and light humorous touch seems just right for Daniel. That said, his lines fall flat in dialogue requiring more depth. \"Spirit of Christmas\"has many interesting parts, but the whole doesn't quite come together. Still,it's a film worth watching; but don't expect full satisfaction.",
         "This is a unique Christmas film. Most Christmas movies are pretty predictable,typical cookie cutter you see this time of year. All share the same uplifting purpose which is sorely needed. It has a great plot and very good acting. Keeping you mesmerized,wondering what would happen next and was there going to be a happily-ever-after. Put me in a teary eyed mood when it appeared Daniel was saying his goodbyes. Thomas Beaudoin,as Daniel, was excellent as a handsome gentleman playing the ghost. Jen Lilley, as Kate,an ambitious attorney sent from Boston to Vermont 12 days before Christmas to broker the sale of the haunted mansion. An absolutely stunning,brilliant film that has everything, romance, mystery,nostalgia, beautiful realistic winter setting at a gorgeous Victorian estate...Hollybrook Inn in Vermont. Highly recommended for those of us who enjoy these movies but would appreciate a change of pace without sacrificing the theme.",
         "This humorous supernatural Christmas tale is well written with humorous dialog and situations. A young lady travels to a picturesque snowy haunted inn to prepare for it's sale. There she meets a ghost who comes to solid form 12 days a year around Christmas. There is a fairly interesting mystery told in flashbacks about how the ghost had been killed. The cast is appealing. Jen Lilley has a doll like face - very pretty. Thomas Beaudoin looks and acts suitably like a character from about a 100 years ago. The only thing is the happy ending is welcome but not really explained well enough.",
         "If you look for a different Christmas theme film, by the mountains of Hallmark stories, this is an inspired choice. first - for the story who reminds old fashion mystery stories. second - for surprising performances. not the last - for the meaning of \"spirit\". sure, it is not original but the references to the known stories from a time when Christmas was not a piece from a brand represents one of magnificent virtues of this real special film who gives to classic ingredients of genre a delicate and powerfull ...flavour.",
         "This movie is quite enjoyable due to the fact that the story is so delightfully different then most christmas movies. Sure, thereæs the hot girl who can't find the lov of her live, there's the handsome fellow she falls in love with and of course the setting is in a peacefull beautiful inn on the countryside covered in snow but the story itself is now and then even spooky and grim. I will not blow it by adding spoilers, but if you're in to a christmas movie that is differnet and surprising with good acting of almost all the players, here's the one to watch.",
         "Loved this movie want to see a second part like so many Christmas Movies need to make second one.",
         "I agree with all the reviews posted here. I watched this on TV when it came out in 2015 but i could swear there was a alternate ending! Spoiler..... The alternate ending, Kate runs out to the edge of the property hoping to see that the figure walking towards her is Daniel. And we all think it is but really it's his son Daniel who came to see his parents property before it was sold. Kate realizes after a few questions that its his son and smiles as she offers to show him around the property. Honestly it's so clear in my mind. Maybe i'm crazy.... Great movie, not sappy although i do love a sappy holiday movie.",
         "Lots to like about this movie. An old New England Inn in the real snow. Flash backs to the early 1900's and a set of characters in that time period. A mysterious murder. A great performance by the lead actress Kate as a determined lawyer. I forget just how it ends- now I remember- I think- but it is good and happy. Look forward to watching it again. It was a great surprise. There was some good humor with the policeman coming to the inn. Kate explaining to her boss what she is up to. There was some real suspense thrown in to as you would experience in a horror film with the music and such. Really enjoyable.",
         "My recording of this movie shows \"Spirit of Christmas\" as the title. I looked and looked but could find no 2015 movie entitled Spirit of Christmas. Finally, I just looked up the lead character and thus came to unravel this little mystery. So, we have an aka, but I'm surprised that is not mentioned here. I have only just begun to watch this, but this gal is the broker sent to check out the property. The original owner has been missing and presumed deceased. Her first night in the inn,just after midnight, she hears some noised in the place.....falls on stairs, and awakens to find the \"spirit\" of the owner still living in the house and literally tosses her out... Here the story begins. I'm not much for super-natural, but it looks to be slightly entertaining and the actors are credible. Maybe an administrator can add an aka to the title for others benefit. My rating is to not disturb the existing one for those who have seen its entirety."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": [
         "Kate, a workaholic lawyer, has three weeks to get a haunted bed and breakfast appraised and sold. The uncooperative manager claims a spirit who lives there will not approve. With Kate's possible promotion resting on accomplishing this task, she checks in and haggles with the aforesaid Christmas spirit, who suspiciously seems awfully solid for a ghost.",
         "Emotionally frigid attorney Kate Jordan reluctantly accepts an end-of-the-year assignment to get a reputedly haunted inn appraised and sold by year's end. By and by she meets Daniel, the resident ghost who, for the past ninety-five years, inexplicably returns to life each December during the twelve days of Christmas. Kate has only one logical recourse for their mutual benefit: break the curse that binds him - but falling for a man almost a century her senior isn't among her plans."
      ],
      "budget": 0
   },
   "movielensId": 164709,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-12-19",
      "dvdReleaseDate": null,
      "directors": ["David Jackson"],
      "runtime": 84,
      "movieId": 164709,
      "title": "The Spirit of Christmas",
      "mpaa": "",
      "actors": [
         "Jen Lilley",
         "Thomas Beaudoin",
         "Robert Walsh",
         "Bates Wilder",
         "Kati Salowsky",
         "Brett Leigh",
         "Joanna Herrington",
         "Christopher Tarjan",
         "Steven A. Miller"
      ],
      "imdbMovieId": "4434688",
      "originalTitle": "The Spirit of Christmas",
      "genres": [
         "TV Movie",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["JrwC1NdRZw8"],
      "plotSummary": "A woman falls in love with a man who is somewhat unavailable.",
      "tmdbMovieId": 367544,
      "avgRating": 2.75,
      "releaseYear": "2015",
      "numRatings": 6,
      "posterPath": "/zaygsTCHe8f3ISHOHFxKMzKTpPF.jpg"
   }
}