{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fbi",
            "id": 1812
         },
         {
            "name": "gang war",
            "id": 2987
         },
         {
            "name": "surgeon",
            "id": 3262
         },
         {
            "name": "beautiful woman",
            "id": 9767
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "drug addict",
            "id": 18179
         }
      ],
      "imdb_id": "tt0119906",
      "video": false,
      "title": "Playing God",
      "recommendations": [
         36604,
         137566,
         113693,
         52855,
         23532,
         249169,
         19760,
         22318,
         253899,
         190967,
         171780,
         63945,
         12479,
         303793,
         138976,
         149592,
         2045,
         76297,
         99254,
         267931
      ],
      "backdrop_path": "/6HoX25QQpauFGFjZ8rr250cHy0L.jpg",
      "revenue": 4000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Eugene Sands",
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c4d",
               "name": "David Duchovny",
               "profile_path": "/tvgkGpKXMz7SzjUkTwZ0FMjQxlO.jpg",
               "id": 12640,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Raymond Blossom",
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c51",
               "name": "Timothy Hutton",
               "profile_path": "/ypC4mzLExwmG0QHfi8vFe9LTeSi.jpg",
               "id": 16327,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe450b9251416c75049c55",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gage",
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c59",
               "name": "Michael Massee",
               "profile_path": "/qbM7GWc86Lw5y6E6eCnokgVaHia.jpg",
               "id": 9289,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe450b9251416c75049c93",
               "name": "Stacey Travis",
               "profile_path": "/peARleY7mDjxph4fFfeWnV4LMFe.jpg",
               "id": 31714,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Dr. Clifford",
               "gender": 0,
               "credit_id": "52fe450b9251416c75049c97",
               "name": "Bob Jennings",
               "profile_path": "/iaOIeKW3Og5gYxNnsHpEJsnldBR.jpg",
               "id": 113506,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Vladimir",
               "gender": 2,
               "credit_id": "53e61bedc3a3684439000fd2",
               "name": "Peter Stormare",
               "profile_path": "/dDR0brp5L7fXDyEywrhjQv01LSg.jpg",
               "id": 53,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Flick",
               "gender": 2,
               "credit_id": "53e61c0dc3a368442d000f15",
               "name": "John Hawkes",
               "profile_path": "/bz4usMR7NWEgVgWTxVBLEjCo3Dv.jpg",
               "id": 16861,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Jim",
               "gender": 2,
               "credit_id": "53e61c32c3a3684433000fd9",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Cyril",
               "gender": 2,
               "credit_id": "59bb8d18925141323100b5a8",
               "name": "Andrew Tiernan",
               "profile_path": "/891RIqhOno9VLsYPIfzQsqytQZb.jpg",
               "id": 17290,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Yates",
               "gender": 2,
               "credit_id": "59bb8d3dc3a3680efe00bd91",
               "name": "Gary Dourdan",
               "profile_path": "/yGNXneJeb4Ug1iJ08lspzJocpN0.jpg",
               "id": 40276,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Perry",
               "gender": 2,
               "credit_id": "59bb8e20925141325400aa6b",
               "name": "Will Stewart",
               "profile_path": "/1U0NMEvIoiYt5oUpZUh8FF0l4ih.jpg",
               "id": 42720,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Casey",
               "gender": 2,
               "credit_id": "59bb8e62c3a3680ef000b5c4",
               "name": "Philip Moon",
               "profile_path": "/zY8zIFtctrFWlV7LT5Sz2lYoTjd.jpg",
               "id": 1235,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Andrei",
               "gender": 2,
               "credit_id": "59bb8ee5c3a3680efe00bf83",
               "name": "Pavel Lychnikoff",
               "profile_path": "/7vBY7AGXmgk1LG8zkzaPsRusQai.jpg",
               "id": 52762,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Sue",
               "gender": 1,
               "credit_id": "59bb8f27c3a3680efe00bfd1",
               "name": "Sandra Kinder",
               "profile_path": "/nxH6engClJ8ocvVoMpUMVNY2XVx.jpg",
               "id": 1686828,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Mr. Ksi",
               "gender": 2,
               "credit_id": "59bb90d3c3a3680ef000b8da",
               "name": "Keone Young",
               "profile_path": "/fidmDw0MYC9F6kfOwTsSviqCWJG.jpg",
               "id": 91387,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c5f",
               "name": "Andy Wilson",
               "profile_path": null,
               "id": 28487,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c65",
               "name": "Mark Haskell Smith",
               "profile_path": "/8QEN5BqkgSyTcWYxhAUTVMYvpLC.jpg",
               "id": 73278,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c6b",
               "name": "Marc Abraham",
               "profile_path": "/cpj3Rg8jmHPfqZxRaW2B36R5D91.jpg",
               "id": 15219,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c71",
               "name": "Armyan Bernstein",
               "profile_path": null,
               "id": 41587,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe450b9251416c75049c77",
               "name": "Laura Bickford",
               "profile_path": null,
               "id": 21706,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c7d",
               "name": "Thomas A. Bliss",
               "profile_path": null,
               "id": 58846,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c83",
               "name": "Richard Hartley",
               "profile_path": null,
               "id": 39023,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450b9251416c75049c89",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe450b9251416c75049c8f",
               "name": "Louise Rubacky",
               "profile_path": null,
               "id": 40151,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 3.170472,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12628,
      "vote_count": 33,
      "budget": 12000000,
      "overview": "Stripped of his medical license after performing an operation while high on amphetamines, famed LA surgeon Dr Eugene Sands abandons his former life only to find himself crossing paths with Raymond Blossom, an infamous counterfeiter. Employed as a \"gun-shot doctor\" when Raymond's associates cannot risk visiting a hospital, Eugene is lured deep into the criminal world and becomes entangled with his boss's girlfriend.",
      "similar": [
         4771,
         96,
         979,
         7516,
         281,
         1538,
         2142,
         9873,
         1266,
         6075,
         319,
         37094,
         320,
         562,
         1571,
         1572,
         184,
         680,
         64690,
         339692
      ],
      "original_title": "Playing God",
      "runtime": 94,
      "poster_path": "/mZLG1QdusU9IdtQTmLkdr5t3ilv.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1997-10-17",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Joining this deadly underworld was easy. But getting out...deadly!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andy Wilson"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Mark Haskell Smith"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119906/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NDA0NjgyM15BMl5BanBnXkFtZTcwOTM5MzcxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: David Duchovny, Timothy Hutton, Angelina Jolie | See full cast and crew »"],
      "reviews": [
         "Okay, truthfully, I saw the previews for this movie and thought to myself, what are the producers thinking? Hutton, Jolie, and DUCHOVNY? How could the monotoned actor possibly compete with Jolie's natural power on the screen? But surprisingly, the two had the kind of chemistry that showed intense caring without a kiss. Even David's humor matched up to Jolie's spark and fire. As for Hutton, he played the psycho very well, contrasting with David's calm delivery of life threatening situations. Overall, I was very impressed with the writing and character development. I gave it 8 stars.",
         "Eugene Sands is a drug addict doctor - although he has long since been barred from practicing medicine having been found operating high, leading to a girl's death. When he is at a club buying he witnesses a shooting and steps in to do enough to save a man's life. The owner of the club and criminal to boot, Raymond Blossom, takes an interest in Eugene and begins using him and his doctor. However the FBI are after Raymond and make moves to use Eugene to trap him. Coming off as a slightly upmarket video thriller, this film could have been much better but ultimately fails to engage or rise to it's potential. The plot is OK but the script doesn't manage to lift the story up into something that is really strong and engaging. The delivery is a big part of the problem - it isn't that well directed, nothing very wrong but certainly the feel of a video film as opposed to a big screen thriller. The decision to have a voice over narrator is always a gamble; sometimes it works but sometimes it really doesn't. Here the narration doesn't work for two reasons. First of all, the narrator has to explain or develop so much because the film fails to do it as part of the story being told. To make matters worse Duchovny delivery is so flat that it really sucks any energy out of the film. His actual performance is not as bad as his voiceover but he doesn't exactly manage to lead the film. This leaves the way open for Hutton's villain, but he struggles with a lack of character and eventually gives into overacting. Jolie is good but again suffers from having no character. Regardless of performances, not having any buy in with the main people meant that I wasn't into the story as I needed to be. Support from Massee, Stormare and Dourdan doesn't so much add quality as add familiarity. Overall this was very much a workmanlike thriller. It is passable but really it is difficult to overlook the fact that the film has major weaknesses in most areas. The plot is good but the script can't do anything with it, the narration is rubbish and the acting is only reasonable on the whole. Worth watching once but it's hard not to feel let down by it.",
         "Smart, funny script with interesting original premise of the doctor forced to work for criminals. The movie wanders, though, as there's no real central plotline. Great dialogue, but maybe the subsidiary characters are more interesting than the main characters. Script is dramatic/comedic; movie is played down, but the choice to do so seems to have robbed the movie of much-needed juice. The stakes don't seem to be too high for any character. Direction is competent, but doesn't match the script. Hutton is scary, but doesn't have much to do except act scary. Duchovny is fine, but I think he was cast mostly for his X-Files fame at the time. He's not exactly the most charismatic lead actor.",
         "Hollywood possesses the penchant for remaking old classic films, such as Gus Van Sant's re-working of Hitchcock's Psycho. Here's an idea: instead of remaking GOOD movies, why don't we remake bad ones, and try to improve them? In such a world, I would nominate \"Playing God\" for a treatment. The premise is interesting, and the script, although at times uneven, has moments of poetic lyricism and some nice touches. So . . . what happened? The finger must be pointed at the performances, which fail to capture the essence of the screenplay. David Duchovny is cast against type as a drug-addled ex-physician, and Timothy Hutton's portrayal of gangster Raymond Blossom borders on the plane of villainy and its cariacture. Duchovny, whose deadpan delivery and solemn glances work fine in the X-Files, must realize that the role he's playing here is NOT Fox Mulder, but a much more unsympathetic character. Grade: C",
         "David Duchovny plays the lead role in this film.Now a lot of people upon finding that fact out wouldn't even bother watching it.Very unfair to say the least.David made his name on the x-files and is a decent actor. Dr Eugene Sands(Duchovny)is a drug addicted doctor struck off for malpractice.By sheer accident he becomes a private doctor for criminal millionaire Raymond Blossom.However the FBI take an interest in using Eugene to snare Blossom. Angelina Jolie is cast in the supporting role of clare-the gangsters moll.She puts in a solid performance. Timothy Hutton playing Blossom is superb and immersed himself deeply into his character. Duchovny himself isn't as bad as many people would think and in the end i would rate his performance his credible.His familiar monotonous tone and straight face is present but dosen't detract too much from the film",
         "I enjoyed this movie. Unlike like some of the pumped up, steroid trash that is passed off as action movies, Playing God is simple and realistic, with characters that are believable, action that is not over the top and enough twists and turns to keep you interested until the end. Well directed, well acted and a good story.",
         "I didn't expect much from this movie, as I must admit I only watched it to see David Duchovny. I was pleased to find that David was not the only member of the cast to turn in an interesting and entertaining performance. Timothy Hutton was very convincing as the \"bad guy\" with a real weakness for his beautiful girl friend, played by Angelina Jolie. Angelina is both a beautiful and talented actress. I have seen her in several movies since this one and enjoyed her in all of them. I thought she gave an especially moving performance in Gia. I enjoyed watching Playing God as the story moved along at a good pace, there was plenty of action and I especially enjoyed David's narrative which lent some humor at just the right times to what could have been just another bloody movie. I would recommend this film to any David Duchovny fans as he is at this best here, and also to any of you who enjoy Angelina Jolie. I give this movie 8 stars.",
         "David Duchovney creates a role that he was to replicate somewhat in Californication - the troubled talent. And it is a role he plays well. This thriller starts off at a good speed and carries you through to the end. Timothy Hutton plays a fine villain and Angelina Jolie pouts. The story of a disgraced doctor finding his way into a criminal world is well scripted. Drug addiction and a desire for the sultry Jolie mix a heady cocktail. Unfortunately towards the end the story gets a little weaker and the relationships between villains and the FBI is muddled and rushed as if it was created only to develop the final scene. But, that aside, a movie worth seeing.",
         "This film started off seeming a little bit tv-ish but turned out as a very watchable and slightly tongue-in-cheek thrill-ride. David Duchovny is very watchable and provides multiple sides of his lead character, a geeky surgeon, a down-and-out druggy, a hard-balled hero and a hopeless Romeo. Fighting for the love of Angelina Jolie as the sexy and good-natured mistress of Tim Hutton. Hutton has loads-a-fun as the hip and ultra-slick Mob boss, very almost unconvincingly evil, but not quite. Peter Stormare is underused and loud roles with screaming obscenities certainly aren't his scene, roles such as the one in \"Fargo\" suit his style alot better. The narration is well-used and Duchovny's voice is interesting as he explains his past, feelings, opinions. But unfortunately there's a point where his slightly mono-style voice gets a little too much. Still, he proves a solid lead and leads the film into a successful finale, ending a worth-while and overlooked Thriller from 1997.",
         "Normally, I don't watch action movies because of the fact that they are usually all pretty similar. This movie did have many stereotypical action movie scenes, but the characters and the originality of the film's premise made it much easier to watch. David Duchovny bended his normal acting approach, which was great to see. Angelina Jolie, of course, was beautiful and did great acting. Great cast all together. A must see for people bored with the same old action movie."
      ],
      "genres": [
         "Crime",
         "Thriller",
         "Drama"
      ],
      "productionCompanies": [
         "Beacon Communications",
         "Club Pictures",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Stripped of his medical license after performing an operation while high on amphetamines, famed LA surgeon Dr Eugene Sands abandons his former life only to find himself crossing paths with Raymond Blossom, an infamous counterfeiter. Employed as a \"gun-shot doctor\" when Raymond's associates cannot risk visiting a hospital, Eugene is lured deep into the criminal world and becomes entangled with his boss's girlfriend.",
         "Eugene is a surgeon who has lost his job because of his drug addiction. His life is totally miserable, until one night an unexpected event changes everything. A man is shot at a club, and being the only doctor around, he saves his life. This event catches the attention of criminal Raymond Blossom who decides to place Eugene's skills at his service..."
      ],
      "budget": 12000000
   },
   "movielensId": 1647,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Pусский"
      ],
      "releaseDate": "1997-10-17",
      "dvdReleaseDate": "1998-06-16",
      "directors": ["Andy Wilson"],
      "runtime": 94,
      "movieId": 1647,
      "title": "Playing God",
      "mpaa": "R",
      "actors": [
         "David Duchovny",
         "Timothy Hutton",
         "Angelina Jolie",
         "Michael Massee",
         "Stacey Travis",
         "Bob Jennings",
         "Peter Stormare",
         "John Hawkes",
         "Tracey Walter",
         "Andrew Tiernan",
         "Gary Dourdan",
         "Will Stewart",
         "Philip Moon",
         "Pavel Lychnikoff",
         "Sandra Kinder",
         "Keone Young"
      ],
      "imdbMovieId": "0119906",
      "originalTitle": "Playing God",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["9hcA29wQKDc"],
      "plotSummary": "Stripped of his medical license after performing an operation while high on amphetamines, famed LA surgeon Dr Eugene Sands abandons his former life only to find himself crossing paths with Raymond Blossom, an infamous counterfeiter. Employed as a \"gun-shot doctor\" when Raymond's associates cannot risk visiting a hospital, Eugene is lured deep into the criminal world and becomes entangled with his boss's girlfriend.",
      "tmdbMovieId": 12628,
      "avgRating": 2.75972,
      "releaseYear": "1997",
      "numRatings": 720,
      "posterPath": "/udip0tPcopdx8AF77StrXJRkLb5.jpg"
   }
}