{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt5912454",
      "video": false,
      "title": "Blue Jay",
      "recommendations": [
         371449,
         324276,
         403579,
         311690,
         344134,
         381043,
         359870,
         333089,
         381041,
         333350,
         385738,
         372844,
         46283,
         333123,
         287499,
         209271,
         345170,
         214096,
         301629,
         319091
      ],
      "backdrop_path": "/ftyop3f1xkQ1pxfyLDTrtIwTft8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Jim",
               "gender": 2,
               "credit_id": "579a2d3ec3a3682da9004d20",
               "name": "Mark Duplass",
               "profile_path": "/pY2qE627sM0Wkx6HvQQWeZ6fd15.jpg",
               "id": 45407,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Amanda",
               "gender": 1,
               "credit_id": "579a2d4c92514112fb00346b",
               "name": "Sarah Paulson",
               "profile_path": "/v8NuPMfw0QSSpgeMuJp12Ijd52M.jpg",
               "id": 34490,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Waynie",
               "gender": 2,
               "credit_id": "57df5eecc3a368129800bdd6",
               "name": "Clu Gulager",
               "profile_path": "/bjmydNfO5v5LocgBGTmCcBSSe6A.jpg",
               "id": 62019,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Background",
               "gender": 0,
               "credit_id": "5827668fc3a368360401d9b2",
               "name": "James Andrews",
               "profile_path": null,
               "id": 1707541,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Background",
               "gender": 0,
               "credit_id": "5827668fc3a3680381014944",
               "name": "Harris Benbury",
               "profile_path": null,
               "id": 1707542,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Background",
               "gender": 0,
               "credit_id": "5827668fc3a368361401c941",
               "name": "Daniel Brooks",
               "profile_path": null,
               "id": 1707543,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Background",
               "gender": 0,
               "credit_id": "5827668f9251417b1a01d64d",
               "name": "Mary Brooks",
               "profile_path": null,
               "id": 1707544,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Background",
               "gender": 0,
               "credit_id": "58276690c3a368360601df51",
               "name": "Bill Greer",
               "profile_path": null,
               "id": 1707545,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Background",
               "gender": 0,
               "credit_id": "582766909251417b1801d48f",
               "name": "Cindy Greer",
               "profile_path": null,
               "id": 1707546,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Background",
               "gender": 0,
               "credit_id": "582766909251417b2c01cb81",
               "name": "Ana Iovine",
               "profile_path": null,
               "id": 1707547,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Background",
               "gender": 0,
               "credit_id": "582766919251417b1801d495",
               "name": "Leo Munoz",
               "profile_path": null,
               "id": 1707548,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Background",
               "gender": 0,
               "credit_id": "582766919251417b2301c7ca",
               "name": "Loretta Munoz",
               "profile_path": null,
               "id": 1707549,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Background",
               "gender": 0,
               "credit_id": "58276691c3a368038101494c",
               "name": "Brady Rice",
               "profile_path": null,
               "id": 1707550,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Background",
               "gender": 0,
               "credit_id": "582766929251417b2c01cb88",
               "name": "Karen Rice",
               "profile_path": null,
               "id": 1707551,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "579a2d8692514113280030d5",
               "name": "Alexandre Lehmann",
               "profile_path": null,
               "id": 1049745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57df5ecc9251413d6800b5a0",
               "name": "Mark Duplass",
               "profile_path": "/pY2qE627sM0Wkx6HvQQWeZ6fd15.jpg",
               "id": 45407,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.140262,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 408508,
      "vote_count": 107,
      "budget": 0,
      "overview": "Meeting by chance when they return to their tiny California hometown, two former high-school sweethearts reflect on their shared past.",
      "similar": [],
      "original_title": "Blue Jay",
      "runtime": 80,
      "poster_path": "/5RlPKu0QxtSwhtNTwq6e3mHunf7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Orchard",
            "id": 9286,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Duplass Brothers Productions",
            "id": 1974,
            "origin_country": ""
         },
         {
            "logo_path": "/wwemzKWzjKYJFfCeiB57q3r4Bcm.png",
            "name": "Netflix",
            "id": 59811,
            "origin_country": "US"
         }
      ],
      "release_date": "2016-10-07",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alex Lehmann"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Mark Duplass"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5912454/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM2Nzk4ODA2M15BMl5BanBnXkFtZTgwODA5MDExMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Mark Duplass",
         "Sarah Paulson",
         "Clu Gulager"
      ],
      "reviews": [
         "It's the first review I'm writing. Actually, I've never felt the need of writing a review- thought that the score I give is already a good contribution. But Blue Jay is something else. It's the most genuine feeling I've ever felt while watching a movie, in the sense the once I finished it, I didn't feel than it was far from my own reality at all. The way nostalgia was pictured is fascinating. The words that were used were so close to the words that I would have used myself in such a situation that sometimes, I've found myself saying out loud, at the same time, what one of them were saying. Magical, genuine, sweet, emotional, simple, true. Brilliant.",
         "I love this film. It's perfect. I would not change a thing. It's the gem I always hope to discover when I go to TIFF, and it's ironic that the large costly studio films seen earlier in the week fell flat\u0085 and here's this little two-character indie film shot in just 7 days\u0085 and it blows the heavyweights out of the water. Sarah Paulson is at the top of her game. She should be nominated and win many awards for her portrayal of Amanda. Yes, she is that good. The direction, acting, cinematography, editing, script, music... all coalesce to create this perfect little gem. It is bliss to watch and experience. MOVIE SYNOPSIS: Jim is back in his childhood home sorting through family belongings after this mother's death. Amanda is back in town to visit with her sister who's expecting a baby. Jim and Amanda run into each other at the local grocery store and have a difficult and awkward time acknowledging each other's presence. What is making them so uncomfortable? Grab your popcorn and watch their story unfold. That's it. That's all I'm saying about the film's story line. The less you know, the sweeter the experience of finding out about these two. But I fell in love with both of them.",
         "Beautifully written, directed, filmed, recorded and edited - this film brings forward a magical chemistry seldom seen on the 'big screen'. One can hardly but integrate with the wonderfully true performances of Sarah Paulson and multi-talented Mark Duplass through the firm-yet-relaxed direction of Alexandre Lehmann's unique cinematography, cemented ever so subtly by Christopher Donlon. Clu Gulager reminds us that true talent, like love, is ageless. Getting to take part in and leave a legacy like Blue Jay would be a dream come true for almost any actor, filmmaker or expressive artist. But anyone can take a trip into their own Universe of emotions with this masterpiece.",
         "Greetings again from the darkness. Mark Duplass is the master of awkward. As a writer he excels in awkward encounters, awkward conversations, awkward situations \u0085 and awkward people. He can even create awkward out minimalism – two people in a simple and normal environment. A bearded Mr. Duplass stars as Jim, a seemingly normal guy who has returned to his small hometown to pack up his mother's house after her passing. While at the local market, he bumps into his old high school sweetheart Amanda, played by Sarah Paulson, who just happens to be in town visiting her expectant sister. Their awkward grocery aisle reunion leads to a very unusual \u0085 and yes, awkward \u0085 evening. First time director Alexandre Lehmann uses his extensive experience as a cinematographer, and a black & white motif, to create a beautifully filmed story that is both simple and layered. Only one other actor appears in the movie \u0085 one scene with the great Clu Galager (\"The Virginian\", The Last Picture Show) as a local merchant who provides a link to the past for Amanda and Jim. The bulk of the time is spent in Jim's mother's house – a literal time capsule that allows for reminiscing for the two former lovers. Amongst the old familiar clothes, photos, letters, books and audio tapes, Jim and Amanda somehow progress to a bizarre form of role playing/play acting as if they had married young and were now celebrating their 20th wedding anniversary. You guessed it \u0085 awkward. Dinner, dancing, acting silly, jelly beans, Annie Lennox and cutting loose leads them to an awkward bedroom encounter. This moment finally produces an explosion of emotion which uncovers the long-buried source of their break-up \u0085 shutting down their fantasy game of recapturing the past. It would be pretty easy to compare the film to Richard Linklater's Before Sunrise (1995) or Before Sunset (2004), and though it has more in common with the latter, this one comes across more raw and melancholy than those more celebrated films. We never once doubt this situation could play out, but the only word to describe two former lovers exploring \"what could have been\" is \u0085 awkward. It's a captivating movie to watch and yet another feather in the cap of Duplass Productions.",
         "I didn't even know this film existed until today (thanks to the people mentioning it!). I think it's good. Something about it didn't completely hit me in the way the film wanted to. Sarah Paulson is definitely the best thing about it. She's a revelation, unsurprisingly. She's such a talented actress and I really hope she continues to get more film roles until she eventually wins an Oscar. On the flipside, I do like the writing from Mark Duplass, as I usually do. However, I'm just not too big on him as an actor, as usual (aside from Creep, the only time he impressed me). He's fine, but I feel like a better actor could have given more justice to the role. He's solid, for the most part. His breakdowns and emotional outbursts were not well acted at all and I could see him struggling to convey any deep emotion. I just didn't buy him, he was very surface-level and definitely wasn't in the same league as Paulson. I hope she gains some traction for this.",
         "4 settings, 3 actors, 2 colors, 1 day and 80 minutes that will warm your heart. An emotional story that develops between old school friends who meet again after 20 something years after their ways part. Mark Duplass and Sarah Paulson have an amazing chemistry together and deliver high class performance. With well-written dialogues, relatable story line, and good music, it is the one of the best Indie movies of 2016. Expect to be amused, sad, melancholic, and nostalgic throughout the movie. I gave it 10 and would recommend it to everyone who appreciates good movies.",
         "Mark Duplass has written a screenplay of subtle beauty that really is transfigured by both actors that grace the stage. I got this film for free and I must say that I feel a bit guilty for it. It heralds joy and nostalgia and reality in subtle measures. It is beautifully crafted; I think shooting in black and white was a strophe. I usually avoid b & w but I think it complimented the tone and the titillation here. The chemistry between the two main actors speaks of colour. I will buy this film or it will pass like a mandala. Either way, It is quietly beautiful, I hope someone reading this can enjoy it in new ways.",
         "Are you in love? Or, do you want to fall in love? Or, are you heart broken? Whatever the case may be, Alex Lehmann's Blue Jay is the perfect remedy. Here is a film so honestly made that it will make your heart melt. Blue Jay is essentially a two handler about two former high school lovers who bump into each other for the first time in two decades. It is an awkward situation at first. But soon it develops into a very memorable day for the both of them. There are moments of immense joy and pain as they revisit their past through their present. It's like experiencing catharsis. Indie films, when they are really good, can really pack a punch because they are not bound by the liability to placate the Studio bosses, thereby allowing greater liberty to the filmmaker. And, Blue Jay is a very well made indie film and certainly one of the better indies that I have ever seen. One of the greatest strengths of the film are the acting performances of Mark Duplass and Sarah Paulson. The two of them look so natural (the choice monochrome of course helps... color would have drastically toned down the intensity). Both the actors demonstrate a great range of emotions. Duplass looks the more volatile of the two but it is as per the demand of the character. As for Paulson, her smile seems capable of speaking a thousand words. Together, they create magic, which, I daresay, most Hollywood A- listers fail to create these days. The film has its share of flaws but overall it makes for a wonderful movie viewing experience. If you are a hopeless romantic then this film is certainly for you For more on the world of cinema, please visit my film blog \"A Potpourri of Vestiges\".",
         "This movie reminds me a very known quote by a Romanian author, Octavian Paler: \"Something you don't feel at the right moment, you will never feel it again.\" It's that kind of movie that motivates you to live your life as long as you have it and never forget about your old friends and the place you grew, especially the persons you once loved. I learned that something written is more powerful than spoken words. You can easily find out that if you are not surrounded with love, if you don't have someone you want to share your life with, you became lost, confused, sad and maybe depressive (Jim). I finish this movie with tears in my eyes, realizing that this story may be something true among us.",
         "Blue Jay is a soft film about everlasting love and reuniting with the version of yourself that you understand the most; one that you probably didn't realize you missed. It follows the same stream of consciousness that most Duplass Brothers film adopt, but it keeps it feeling fresh with the help of a luminous and scene stealing Sarah Paulson. Our characters are full of that common, but hard to capture on screen, insecurity and awkwardness that makes adulthood so difficult. They clearly want to spend time together but are unsure of the \"rules\" that they must follow. Their past weighs heavily on them but their affection overshadows, at least for a time, a dark corner of it. Duplass and Paulson have a fantastic and organic chemistry, saying more with their eyes and body language than most actors can say with a speech. You follow their trepidation with interest and root for them to find some closure or happiness, whether with or without each other, and aren't left unsatisfied. The movie's melodic rhythm drives its duration so smoothly that before you know it you are saying goodbye to characters who seem more like family than friends, both to each other and to the viewer. A throwback to the Golden Age of Hollywood, this movie is a gem to any movie lover who appreciates the art of storytelling. 7.5/10",
         "Sometimes we have the pleasure to watching a film that is simple and complicated and honest. This movie is fantastical in that it allows the viewer to experience wish fulfillment in a way that the \"adulting\" generation lacks. It is romantic and kind. Mark Duplass writes a simple and powerful script that allows Sarah Paulson to shine. Their chemistry is contagious and mimics the innocence of love in youth and life in adulthood. Filmed in shades of grey, it is an artistic homage to what life was like before it unfolded into adulthood. If anyone has strolled down memory lane and recognized where life experience has created the person they've become... then this film is for you. (All of the perfect 90's references don't hurt either.) Simple and beautiful, it is worth the watch. 7 days of filming - without colour - puts the blockbuster generation to shame. So much yes.",
         "I know black and white is supposed to be artsy and mood creating, but I'm a color kind of guy, sorry. I also felt like they both played the awkwardness too hard at the beginning. And, as usual for me, I'd like a bit more background details up front- about both characters, and more scenes from around the town. Finally the ending was not my kind...........maybe not a live happily ever after, but at least SOMETHING!",
         "I mostly didn't like 2016 movies ,specially romantic movies, but this one really got me.I really liked every bit of it ..the joyful moments, the awkward moments and the sad ones.Mark Duplass is a great actor i never seen him like this.Sara Paulson is such a beautiful great actress that was the perfect one for the role.The Writing is Incredible All the idea of Lost chances ..unsaid words ..the Nostalgia..the cinematography. Every scene was just beautiful and touching.Alex Lehmann is such a talented director and he will make more beautiful movies ..it's just the start Thank you Netflix for this movie.and thank u Mark Duplass for writing this simple great movie.",
         "Their relationship is very touching, you can tell they were very close and still are very close but circumstances have changed. You start to see that Amanda has found it hard learning how to become an adult and is not really sure when it all happened or when we learnt it all, Jim still feels immature (referring to a four year old as his soulmate) and we see them both tackle issues together or at least confront them and they just happen to be together. It is very obvious they will not be together, their lives are two very different things now and that hurts because constantly throughout the film, the way Amanda looks at Jim, you can sense there is something she feels and wants to say but it feels like she won't. It seems like Amanda feels sorry for Jim and she wants to help, she wants to know what has happened to him over the years and Jim simply has no direct answer to her questions all the time. The film breaks and shows beautiful scenery, landscapes, people and beautiful stills of them walking around, talking, It felt very natural, real and sincere, It felt like I had known these two people for years and now they reunite. It just feels very true to how this sort of situation would go. Amanda seems to have her life 'sorted out' or at least on track whilst Jim does not look very certain about his. He seems very lonely and looks like he is going through a difficult patch in his life at the moment and running into his closest friends is exactly what he needed. Every time Amanda mentions her husband it ruins the mood, any time they refer back to their present, the mood completely gets ruined, you can tell Jim gets a bit frustrated and quiet when she brings him up and it is obvious there is no likeness between them. There are moments that I feel they have nothing, but then there are moments where I know there is something, It is very strange, when films like The Notebook try to do something like this it ends up looking like bullshit rom com clichés because it didn't come from anywhere, the main characters of the Notebook suck and have no depth, these two characters have a personality, they have lives, they exist and I can see and understand that, I am willing to know these characters and that is what good writing and directing is. They have a moment where they are looking through his diary and she realises the past, she remembers again what it was like back then, reminiscing about when they used to be 'lovebirds', she finds a letter that is addressed to her and takes it before Jim finds out she had it, at this point I am heavily interested in what is happening, these character's pasts and their relationship, their lives and who they are now, when she finds the letter I am even more intrigued by what is in it, they kept me invested. At this point they find some old tapes and listen to them. It is an incredibly touching scene where they remember role playing and they have two kids, Jessica and Jason and at this point they remember who they thought they were going to be in the future, they remember the good days where they just had a good time, Amanda looks into the void and thinks of what it all was back then and what changed since, the expression on Jim's face when he hears them talking about their imaginary kids always gets to me because of how close they were to that reality but something changed. You can get the subtle hints that their personalities have changed, the people around them have changed who they are, Jim more or less stayed the same but just lost his footing, Amanda seems like she has it under control but it doesn't feel like she is truly happy. There is a moment where they are outside looking at the stars and Amanda finally tells the truth, she has been taking anti-depressants and claims she should be happy and that her life is fine, there have been hints from the very beginning that Amanda was not truly happy with her life, who really is but she just felt closed up, similar to Jim at the beginning. She discusses how things are changing, and how she has not told anyone about this, she feels this inner sadness and she is unaware of where it is coming from, I think it is because they are aware of the cruelty and the hardships of living within society, the constant changes and having to deal with life's constant issues and stresses and growing up, it is hard and challenging, hard to move past.When reality steps in and it starts to kick in that this is not going to last forever, this peace is going to fade and it will fade fast. Things have not been the same for them and things are changing quickly and ever since things moved forward, life hasn't been that way for the both of them. This entire film felt very improvised because it just felt so raw and genuine and that it is hard to come by nowadays in modern cinema, actual people on screen. Even TDOER felt disingenuous once or twice, this movie nails it from beginning to end. Beautiful, emotional, funny, reflective, sincere, honest.",
         "Blue Jay is a claustrophobic film that slowly drowns the viewer in a deeply intimate moment between two ex-lovers. Using a simple setting, a straight-forward premise, two character reminisce and re-live their lost love, maybe even trying to recreate it. Flirting with the lines of danger and further heart-break, the two characters learn about each other's lives and the story blossoms from the dialogue. It is simply written, well directed as Lehmann's debut, and Mark Duplass was very convincing in his role. It leaves a bittersweet taste throughout, as the undertone is soaked with regret and deep sadness, where on the outside, cavalier attitudes and laughter are rampant. Blue Jay has plenty of sweet and loving moments, but that underlying tone of poor life choices is the nail on the coffin, and the reason why this film is so beautifully bittersweet.",
         "I have just finished to watch it and I am completely overwhelmed by feelings right now. This movie hit me straight to the heart and I couldn't avoid to go back to my memories. The small and boring town, the old man of the shop, the same old habits. And the black and white that brings the illusion of seeing a story of the past, as it actually is. This is so authentic, you can easily feel the magic between two people who knows each other so deeply and for so long time that it seems like nothing has changed. But life sometimes is unfair, you miss a thing and everything takes a different road. Maybe a better one, maybe not. Who knows. One night to dive into the past. Then a deep breath, real life begins again.",
         "**small spoiler** This is an incredibly intimate film, in all the best ways. People often confuse intimacy with sex, so let me clear, I don't mean sex. There is a kiss and miss, but the words, and the emotions these two bring to life are deeper, and more meaningful than what some couples share in an entire life time. The chemistry is perfect, their interaction is superb as it burns you down and takes you back through memories of the life you once had, or always wished you had. It was like sitting by a stream on a quiet summer, day and letting the flowing water hypnotize and soothe you. There is nothing I didn't love about this wonderful film. It's streaming on Netflix now, and if you have some down time this holiday season, I recommend spending it with Mark and Sarah. You can hear their souls singing in their performances, and in his writing, and to me that makes Blue Jay a piece of art.",
         "It seems like the Duplass brothers had a free weekend and a handy black & white camera, so they said \"let's shoot something & see what happens\". The problem is what they shot was uninteresting, has no character chemistry and virtually nothing happens. It's obvious that almost all of the dialogue is improvised, and it comes out forced & banal. This is NOT another \"Before Sunrise\", which had a real script, great character chemistry & a fantastic locale. Instead it's the Duplass brothers indulging themselves & boring any viewers. There's a reason this had no major theatrical release, right? I guess it's arty & trendy to praise this half-baked effort, but it's nothing more than a waste of time. And for reference, I loved \"Togetherness\".",
         "I do not understand how anyone could give this bad excuse a \"10.\" Mark Duplass, who has some talent, owes an apology to all filmmakers who struggle to make their art. This exercise in bad judgment and self-indulgence is atrocious. As may be commonly known, there was no script for this film. That is painfully obvious as we watch Sarah Paulson, an otherwise fine actress, fake her way through this, following Mark Duplass's meandering lead. If we cared about these people and wanted to have an intimate look at their lives, this might have been a touching film. But because neither of them gave me any reason to care, all I could do was sit and watch in slack-jawed amazement. Sarah (as Amanda) and Mark (as Jim) stumble into each other at a supermarket after apparently not seeing each other for 20 years. Although Sarah has purchased ice cream for her sister, in addition to other items, she agrees to join Mark for a coffee at a place called the \"Blue Jay.\" This cafe does not have any other importance in the film and begs the question, \"Why was this film called 'Blue Jay'?\" We follow Sarah back to Mark's mother's house as he attempts to pack it up after her death. During this process, we understand that Sarah and Mark have history, and as the film unfolds, they have a fantasy moment of what their lives would have been like had they remained together. Although I will allow that there were several sweet moments during their imagining of \"what if,\" we had to endure endless stupidity having to do with them both doing \"rap\" music, making stupid sounds, doing stupid dances, and making up stupid dialogue. Again, if these two individuals were deeply engaging, I would have happily followed their story. Perhaps because I wanted a STORY (and not some out- of-control blabber-fest that felt like: Let's hit this point about 15 minutes in; let's hit the next point about 30 minutes in, ad nauseam...), it was hard to invest myself emotionally in the lives of two people that actually could have been interesting. Things get borderline maudlin with the discovery of \"the letter that was never sent\" and the \"confession\" from both sides about the \"tragedy that should have never happened.\" I'm sorry; for all of Mark's Oscar-winning (in his mind) crocodile tears, I didn't buy his performance for a minute. He seemed like a first-class wimp, a crybaby, an emotionally stunted a**hole who was apparently incapable of manning up for over 20 years and was, I guess, going to go on and live in anger and denial till the day he died instead of coming to terms with the past. Yes, there are people like that... and in the hands of a qualified actor, I would have felt those things. But Mark has a certain detachment about him that makes him come across as a failed stand-up comic or a serial murderer -- it's hard to tell. Bottom line: I could not like him. Sarah fared better, but because she spent the majority of the film under an absolutely ghastly ski cap, even her Hollywood smile couldn't help her in the wardrobe department. As another reviewer said, it seemed that the Duplass Brothers (or whoever was involved in this amateur 80 minutes) scored a camera (and Sarah) for the weekend and said, \"You know what? Why the hell not?\" And so... they made this mistake. I do not think it was brave or fresh or emotionally moving. I always felt that they were just about reaching for straws as they tried to \"improvise\" what they were going to say next. The further along it went, the more Mark dropped in my estimation (and I actually liked him in \"Your Sister's Sister.\"). He said at the beginning that his face \"leaked\" -- \"Leaked?\" Give me a break; was that supposed to be funny? By the time he really was supposed to be crying (and I'm sure he thought he was brilliant), I was looking for my barf bag. Last, who on earth goes around by the name of \"Waynie\" ? It's amazing that the prod co managed to press Clu Gulager into service as the manager of a liquor store. He actually seemed real and I would have much rather heard his story. But why did they have to name him \"Waynie\"? I found it borderline vulgar and insulting. Sorry, I went into this with an open mind, struggled to get through it, found a few entertaining moments, maybe even a twinge of sadness during Mark's big \"breakdown,\" but over all, this is like a demo of what the film COULD be following the FIRST draft of a screenplay. There could have been a much more polished version of it if some thought had been applied instead of saying, \"Yeah, hell, sure, let's go for it.\" Throughout the whole film, I kept asking my husband, \"But what about the ice cream that she bought for her sister?\"",
         "It caught me from the very first moment. It's B&W. This movie shows the true feelings. Emotions. Reaction. Have you met somebody, who used to be so close to you, after so many years ... I was fully in that movie. Listen to every dialog. There is nothing I would have changed. This is perfect example of how the movies about relationship should be filmed. Nothing else, just two of them.",
         "So this guy returns from Tucson to settle up the loose ends of his mother's estate after her passing. He ends up shopping for some groceries in his beautiful but perpetually dead-end hometown and bumps into his ex-childhood sweetheart. An awkward conversation takes place and before we know it, we're transported into the lives and shared history of the lovely but vulnerable couple. The black and white cinematography gives the film, which would normally be considered a perky romantic comedy, a sense of gravitas and loneliness. Be warned, this is one of those \"slow moving talkies\", where for many who crave Hollywood's violence, or crude humour, it feels as though nothing happens. This is not a film for the attention deficit disordered or cynical crowd. However, if you enjoyed the \"Before\" trilogy, Eternal Sunshine of the Spotless mind or other films that examine realistic human emotions under heartbreaking situations that arise from our messy human condition, Blue Jay is a very rewarding movie. Following the chance encounter at the grocery store, we follow Jim and Amanda to the Blue Jay diner where they have coffee and slowly reconnect. We can immediately sense there's still chemistry and unfinished business burning between the two - it sets up the second act with a yearning to discover what happened to the lovely couple. Ultimately we end up at Jim's mom's place where they reminisce about their high- school romance and slowly recapture the love and passion they once had for one another. The film isn't perfect, there are slightly cloying situations where the two play a \"let's pretend we're married game\", but it's a minor defect in a film that follows a beautiful and ultimately heart-breaking story with both Mark Duplass and Sarah Paulson giving us a glimpse into life, love and loss between two likable but slightly damaged mid-life 40 year old's. Highly recommended and if you love it as much as I did, you really need to see Wim Wender's masterpiece Paris Texas with Harry Dean Stanton and Natasha Kinski.",
         "The movie was a compelling story about lost love and a great evocation of the silly and endearing youthful love between a man and a woman. The acting was superb and utterly believable. The humorous and telling banter and the initial tension with underlying love and affection displayed by these former lovers was very well done. The writing is excellent and both characters were well developed and sympathetic. The two characters play out an entire life together in one day and one night. The chemistry between the two was remarkable and the playfulness, vulnerability and openness displayed was right on the mark for a couple in love that knows each other well albeit from 20 years ago The story line was believable and so very relevant across the ages. Who does not see some part of themselves in this film. Bravo!",
         "First I want to say I just read all reviews here and I love you people. You rekindle my hope in mankind. From Vancouver to Cairo to Rome. Great art does that. Bring together great people. Greetings. I just watched this MASTERPIECE. Not only of film, but of human creation, of human feeling. It made me realize there is such thing as a crime against MAGIC. Letting the chemistry between two beautiful souls die. It's like REALITY BITES meets Sex Lies and Videotape meets It's a Wonderful Life. And after all these years... there is still the most MAGNIFICENT power on Earth out there. If only hearts could turn on their WiFi. Mark Duplass, Sarah Paulson, Alex Lehman: please find my gratitude and admiration enclosed. From Paris with love Daniel",
         "I think it would only be fair for this film to come with a warning: \"Attention! It's just 2 actors talking in an apartment through all this low-budget black and white film. It's actually a theater play\". Maybe the paying spectator doesn't want a play, they want a movie. It won't matter the film is very good, actors are great: the spectator will feel they were cheated.",
         "Blue Jay is the kind of film which best exemplifies the virtues of \"mumblecore\" cinema, including its capacity to conjure realistic characters and simultaneously intense and subtle emotions clearly defining their actions. At the same time, Blue Jay reveals the inherent problems of this kind of cinema: some scenes feel forced, the screenplay occasionally loses its way and the whole film has a certain pretentious air which is difficult to ignore, something which might be a \"dealbreaker\" for audiences less open to the sensibility of movies like this one. However, I generally like the \"mumblecore\" films, and I have developed the necessary tolerance to appreciate its pros and overcome its occasional imperfections. That's why I enjoyed Blue Jay; the conversation between the two main characters has various ups and downs, and it isn't always as interesting as screenwriter Mark Duplass probably hoped so; but I can't avoid appreciating those revealing moments in which a subtle facial expression or minuscule variation in the dialog completely alter the tone of the situation, insinuating a dense emotional conflict which will change the relationship between the characters. Even though there aren't really spoilers in a film like Blue Jay, I prefer not to mention my favorite parts... because I'm not even sure that they will work the same for other spectators. I generally like the \"remembrance from the past affecting the present\" formula, and watching it brilliantly played by Duplass and Sarah Paulson was satisfactory and quite interesting (not to mention the cameo from the great Clu Gulager). And even though it won't be everyone's cup of tea, I recommend Blue Jay as a good distillation of cinema in its purest form: a camera, two actors and a simple but interesting story impulsed by talent and solid creative instincts."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Duplass Brothers Productions",
         "Netflix",
         "The Orchard"
      ],
      "summaries": [
         "Beginning - At first they seem very, awkward and of course they have nothing to say to each other, it's been years. They go out to get some coffee and they bond for a while, you start to see their friendship, Amanda seems reserved whilst Jim seems more forward and more talkative. It just happens that they both left their hometown, sort of symbolizes their fear of having to confront their past for years to come. But they both come back and happen to run into each other, just coincidental.",
         "Meeting by chance when they return to their tiny California hometown, two former high-school sweethearts reflect on their shared past."
      ],
      "budget": 0
   },
   "movielensId": 164899,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-10-07",
      "dvdReleaseDate": null,
      "directors": ["Alexandre Lehmann"],
      "runtime": 80,
      "movieId": 164899,
      "title": "Blue Jay",
      "mpaa": "",
      "actors": [
         "Mark Duplass",
         "Sarah Paulson",
         "Clu Gulager",
         "James Andrews",
         "Harris Benbury",
         "Daniel Brooks",
         "Mary Brooks",
         "Bill Greer",
         "Cindy Greer",
         "Ana Iovine",
         "Leo Munoz",
         "Loretta Munoz",
         "Brady Rice",
         "Karen Rice"
      ],
      "imdbMovieId": "5912454",
      "originalTitle": "Blue Jay",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["zZGg9wqKVxw"],
      "plotSummary": "Meeting by chance when they return to their tiny California hometown, two former high-school sweethearts reflect on their shared past.",
      "tmdbMovieId": 408508,
      "avgRating": 3.4697,
      "releaseYear": "2016",
      "numRatings": 66,
      "posterPath": "/5RlPKu0QxtSwhtNTwq6e3mHunf7.jpg"
   }
}