{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "barbie doll",
            "id": 33340
         }
      ],
      "imdb_id": "tt4955162",
      "video": false,
      "title": "Barbie in Rock 'N Royals",
      "recommendations": [
         316322,
         227200,
         361380,
         285733,
         255718,
         377897,
         415749,
         23566,
         21705,
         57737,
         129533,
         417047,
         73456,
         16418,
         196254,
         168903,
         34134,
         91342,
         13004,
         434757
      ],
      "backdrop_path": "/kNmnBuoUTCHUjnswMA60qR6tb3v.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "",
               "gender": 1,
               "credit_id": "55d35a7292514120070000a3",
               "name": "Kelly Sheridan",
               "profile_path": "/tDXbnXNhZjRsZu43WpvPVtjUMJd.jpg",
               "id": 74358,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "55d35a85c3a3683b860000a5",
               "name": "Jordyn Kane",
               "profile_path": null,
               "id": 1498028,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "55d35aa592514120070000ac",
               "name": "Chiara Zanni",
               "profile_path": "/7K9QMwQkRl7FRdrn7Y7guK3zexf.jpg",
               "id": 33053,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "55d35aaf925141200c0000ab",
               "name": "Bethany Brown",
               "profile_path": "/bMZj4u5cowaf6FBIkZevgzTkerV.jpg",
               "id": 569210,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "55d35abd92514120130000b6",
               "name": "Michael Dobson",
               "profile_path": "/rBzxqTsiJgu30mmdsW2J9IMtHGE.jpg",
               "id": 74362,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "55d35ac9c3a3683b890000ba",
               "name": "Rachel Harrison",
               "profile_path": null,
               "id": 582117,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "55d35ad0c3a3683b8f0000bf",
               "name": "Alessandro Juliani",
               "profile_path": "/f8pVEpYsRU30EsMoWcBsTkUN9e0.jpg",
               "id": 59312,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "55d35ad7c3a3683b890000bc",
               "name": "Peter Kelamis",
               "profile_path": "/cU03ci49oMj6cZ6glQqIJDrp49p.jpg",
               "id": 89551,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "55d35adec3a3683b800000b1",
               "name": "Nicole Oliver",
               "profile_path": "/czbvdAWjjsmN90Y5eZU0KGtZjv3.jpg",
               "id": 74370,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "55d35ae692514120100000b2",
               "name": "Kira Tozer",
               "profile_path": "/cv3b9YAR95mZShy8eHZRFDy0MC3.jpg",
               "id": 92076,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55d35b03925141200c0000b4",
            "name": "Karen J. Lloyd",
            "profile_path": null,
            "id": 1350796,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.258041,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 355111,
      "vote_count": 39,
      "budget": 0,
      "overview": "When royal Princess Courtney trades places with famous rock star Erika, two worlds collide while both learn to appreciate new friends and experiences.",
      "similar": [
         808,
         10882,
         809,
         38757,
         224141,
         10144,
         810,
         812,
         10530,
         11224,
         10020,
         10674,
         150689,
         5393,
         38319,
         37430,
         1417,
         57158,
         122917,
         4523
      ],
      "original_title": "Barbie in Rock 'N Royals",
      "runtime": 84,
      "poster_path": "/aCKWWQpEijagMEfIOz0vW0aTDmv.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Mattel",
         "id": 6220,
         "origin_country": ""
      }],
      "release_date": "2015-08-13",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": null,
      "color": null,
      "budgetCurrency": null,
      "directors": [
         "Michael Goguen",
         "Karen J. Lloyd"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Marsha F. Griffin"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt4955162/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjQxMDkwODk0MV5BMl5BanBnXkFtZTgwNDMzMDM2NjE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Kelly Sheridan",
         "Chiara Zanni",
         "Bethany Brown"
      ],
      "reviews": [
         "When I saw the other review, I KNEW I had to write one as well. I rated this movie a 9/10 because, while its not the best movie in the world- its EXACTLY what I want to see in a Barbie movie aimed at young girls. I watched this movie with my 4 year old daughter. I often suffer thru Barbie movies for her, because SHE loves them and I love her. I have been pleasantly surprised by the improving quality of these movies. the previous movie, Secret door was fun and the music was really catchy. Rock 'n' Royalty movie was even better, IMHO. It has GREAT music (I have even learned 'What if I Shine' on the piano to play for my daughter) The plot line is fantastic! There is no cliché villain who is just evil for evil's sake - EVERY character has an understandable motivation and their actions cause real conflict. The main characters act in a way that is commendable - I LOVE that there is a moment when they (Erica and Courtney) have the opportunity to choose an easy path, but they CHOOSE to stick with the course they are on and tough it out! Great message for young girls. Super fun and a great movie for young girls! I highly recommend it.",
         "If you're not a fan of synthetic Barbie dolls walking around like robots with limited movement, then this will probably be first on your Horrendous Movie List. But if you are a huge fan of pop music and you're a kid, this movie would be totally ideal for you. I have to be honest though, I was criticizing their way to polite movements the whole time. The laughter and hand movement especially seem forced.But the end part is always the best part--the outfit change and combined music, Rock 'n Roaylty. This movie taught me that we should always be open to new things, new opportunities. Sometimes traditions and old habits should be changed, especially in our modern society, changes are always made. Also, I learn that, you shouldn't label people on how they look like on the outside. You never know, that person you just criticized could have been a potential friend if you let her. Rock your own story - Barbie",
         "Animation was superb and the story was more original than the older Barbie movies, but it needs to create a little more emotional attachment to the main characters so that I can feel a bit more for the characters, more sadness more happiness more everything. All in all, a great movie to watch with your children.",
         "The movie is cheesy and I forced myself to watch it. Why can't there be a real villain anymore? Why should everything be too nice and colorful? Why is it always about princess vs pop star? Why does Barbie's face look bad? Go back to the roots!!! Use the old Barbie model too! I want Barbie movies to be like the old ones, classic. Not pop star stuff. It's just so boring. Bring better writers and better composers cuz the music is awful! Why not make Barbie as Snow White? or Barbie as Cinderella? Or Barbie as Sleeping Beauty? Beauty and the beast.......etc?? Make classic games with amazing music and plot. Bring real evil and villains. Don't be lazy with character models!",
         "Yes the plot was predictable (they pretty much revealed everything in the trailer after all) but the animation was beautiful. The fact that everyone's faces weren't the same model but having differences (wider, thinner, shorter faces than the usual heart shape) was a plus to myself and my younger sisters. Especially one of my sisters due to the fact she is rounder in the face and now can see such reflected in the film rather than all the same. The expressions were amazing as well considering how they aptly changed with practically every word (Finn Oxford is a good example of this) and all the little expressions made it much more enjoyable. The songs were catchy and there was funny movements, myself and my sisters included found it was a step up from the last movie (Princess Power) and we enjoyed the easter eggs (Lady Anne's office - see you can spot them.) As an enjoyer of Barbie Movies having watched them all with my younger sisters, this is not our favourite of the Barbie films but it is reasonably high up the list. We found it enjoyable and fun.",
         "I have to say, I'm disappointed. To be fair, when the Barbie movies first started coming out (2nd generation onward, I mean), I was already way older than the target audience LOL So yes, watching them now is really just for kicks and giggles. That being said, the quality of these movies has gone so far downhill it's rather cringe-worthy. The fact that this is the third movie to riff off the Princess and the Pauper storyline suggests that Mattel isn't even TRYING any more; they know as long as they slap 'Barbie' on it, it's going to sell. Something that was further reinforced when I noticed that the flautist in the movie is holding her flute wrong EVERY TIME SHE'S ON SCREEN. And yet, NO ONE CAUGHT THIS!! So yeah, maybe a decent movie by target-audience standards, but a sad effort by Mattel overall.",
         "I occasionally watch Barbie films for fun. They're always cheesy, but they can be enjoyable to watch, and I always laugh at the cheesier/weirder parts. Some I even enjoy unironically. But then there are the ones with absolutely no effort. And that's what Rock 'n Royals was. This movie is a mix of Barbie Princess Charm School, Barbie Princess and the Popstar, and both Camp Rock movies. The basic plot synopsis? Due to a mix up with the servers of two different summer camps, Camp Royalty and Camp Pop, a pop star named Erika ends up going to Camp Royalty while princess Courtney ends up going to Camp Pop. They find they each like the change of scenery, but the leader of Camp Royalty plots to get Camp Pop shut down by challenging it to a singing competition. The plot is so completely predictable, but that could be forgiven. However, what I refuse to forgive is the blatant ripping off of Camp Rock. I mean come on, one camp is called \"Camp Pop,\" and if you think that's just a coincidence, guess again. British camp leader who was an x-rock star? Camp Rock. (Seriously the Two characters have the exact same accent). Two competing summer camps on the same lake? Sounds like Camp Rock 2. Deciding which is the better camp through a singing competition at the end of camp? Again, that's Camp Rock 2. The two rival camp owners having a past together? Camp Rock 2. The really good female singer becoming a control freak because she wants to win the competition so badly? Camp Rock 2. And then there was the piano scene. Courtney sits at a keyboard and starts to play, turns her magic scepter into a microphone (Ripping off the magic microphone from Princess and the Pop star) and starts to sing about how she's had to hide herself all her life, but how maybe she wants to break free and be herself now. If you've ever seen Camp Rock, this should sound familiar. Because that exact same scene happened at the beginning of the first Camp Rock. The only difference in the Barbie version is that it happens later in the film and her friends immediately join in the song. (Also, the Camp Rock scene was missing the magic pink sparkly microphone). The song is even called \"What if I Shine,\" and one of the lines in \"This is Me\" from Camp Rock is \"Gonna let the light shine on me.\" These scenes are just too similar. If this sequence isn't a blatant rip-off I don't know what is. This is a lazy, lackluster, and obvious rip off. Not only are these movies ripping off cheesy old Disney Channel movies, but they're rehashing their own plot points. There was the previously mentioned magic microphone incident for starters. Then there's the fact that Camp Royalty is exactly like Princess Charm school. Both are royal academies that teach royal children how to be \"proper\" without actually teaching them how to run a country one day. The only difference is that Camp Royalty admits boys. Then there's the fact that this is the THIRD Barbie movie to take inspiration from the prince and the pauper. Clearly, these films are either running out of ideas or realizing that they don't need to put a shred of effort into these films. And then the cherry on top is the animation. Did Barbie seem off to anyone else? I can't tell if her eyes are too big, her face is too small, her forehead is off\u0085 but something about her face was straight out of the uncanny valley. When you can't even animate your titular character correctly, you know you've royally messed up. Long story short? Unless you want to see a bland, predictable, lazy, cheap, thoughtless, soulless rip off of Camp Rock, don't watch this film. Instead, go watch Camp Rock. It may be cheesy, but at least it had heart.",
         "It is very easy to meet the 'Barbie' films with a lot of dislike and scorn and they are all very lowly rated here (despite some favourable reviews). It is understandable to take issue with the dialogue (a fair few are ropy in this regard), the predictability of the stories, the odd annoying character, the animation in a few (not all are well animated) and whether there is enough for adults to keep interest. Despite not being the main target audience, to me they are mostly better than given credit for, easy to take them for what they are and don't deserve to be dismissed as baby-ish and for little girls only (a very narrow minded generalisation). Are they animation masterpieces? No. Are they among the best films ever made? Again no. Are they worth watching if taken for what they are? Absolutely for most of them. Most of them look good if not having the polish of studios specialising in computer animation (Pixar for one), often great music, good lessons and messages, a good deal of charm, have their heart in the right place and have entertaining characters well voiced (some had actors of considerable calibre like Tim Curry, Anjelica Huston, Martin Short and Kelsey Grammar, all of them terrific in their respective outings Curry especially) and a likable title character that particularly young girls can relate to. Was a bit nervous about 'Barbie in Rock 'N' Royals' at first before watching. Modern Barbie has rarely done much for me, and the more modern 'Barbie' films are among the series' worst. Was worried as to whether it was going to be one of those musically loud and intrusive films with few memorable songs and none of particularly good quality and whether it was going to do anything new with a story line that was anything but new. 'Barbie in Rock 'N' Royals' turned out to be somewhat of a pleasant surprise. It is a long way from flawless or great, it's not one of the best 'Barbie' films and there is still a preference for the original/traditional 'Barbie' films and the original/traditional Barbie herself. For a modern day 'Barbie' film however, it was pretty good and one of the better-faring ones, being one of the few times where the more modern atmosphere didn't feel as clumsy or as jarring and was instead interwoven neatly. There are problems here sure. The dialogue continues to be ropy, nothing as toe-curling as 'Princess Power' but it does sound rather cheesy, a bit sugary and bland and lack of natural flow can be a problem. The story certainly has more energy than most modern day 'Barbie' films, is more eventful and like more heart went into it this time round, that isn't enough to stop it from feeling like a tired Hodge Podge of old recycled ideas tried, tested and worn thin. Like can be said for the dialogue, nobody sees a 'Barbie' film for character depth. 'Rock 'N' Royals' is the same, the characters do have vibrant engaging personalities with clear motives and Barbie herself as Courtney is likable, resourceful and good role model but they are very black and white in a neat way. However, the animation is quite nice. Do much prefer the older original/traditional Barbie designs to here but the more modern look is more appealing here than most modern 'Barbie' films and isn't as much of an issue. This time the colours are not overly excessive in their brightness either. There are some beautiful bright colours, handsome and imaginative backgrounds and the character designs and movements have natural freedom rather than being stiff. It's not exactly imaginative and it's not as polished as Pixar, but when you have computer animation that makes you physically ill like the entire output of Video Brinquedo and Spark Plug Entertainment and the sequels to 'The Swan Princess' (the CGI ones) and 'Alpha and Omega' it's very clear which is better than them and this. Was expecting a generic and overly loud compilation of rock songs. Instead the songs are very upbeat and infectious, and actually capture the excitement and danger of the style. There is nothing here that makes you want to have a toilet break or wash dishes. The film choreographs these numbers with a lot of vibrant energy and ease. Story-wise 'Rock 'N' Royals' is not perfect, but it is more eventful than most modern 'Barbie' films and feels more lively. It is cute and charming, with its heart clearly in the right place, and doesn't feel saccharine or overly-simplistic, with enough freshness to stop it from being too heavy in repetition. The positive messaging once again was appreciated, messages that have been done to death before and since in 'Barbie' and in general but delivered in a way that's never heavy-handed or trivialised. Another appreciation point was having some conflict but not having it in the form of a standard villain. Voice acting is pretty good and done with a lot of spirit. Cannot imagine Barbie without Kelly Sheridan (the 'Barbie' films without her did suffer from her absence on top of even bigger problems) and she continues to grow. Michael Dobson is always worthwhile and he does a good job here too. Overall, not great and there are much better 'Barbie' films but pretty good and one of the better modern ones. Was not expecting to enjoy it but ended up doing so. 7/10 Bethany Cox"
      ],
      "genres": [
         "Animation",
         "Family"
      ],
      "productionCompanies": [
         "Mattel Playground Productions",
         "Universal Studios"
      ],
      "summaries": ["Get ready to rock! In this upbeat musical, Barbie stars as Courtney, a princess whose world is turned upside down when she switches places with Erika, a famous rockstar."],
      "budget": 0
   },
   "movielensId": 164957,
   "movielens": {
      "languages": [
         "Nederlands",
         "Český",
         "English"
      ],
      "releaseDate": "2015-08-13",
      "dvdReleaseDate": null,
      "directors": ["Karen J. Lloyd"],
      "runtime": 84,
      "movieId": 164957,
      "title": "Barbie in Rock 'N Royals",
      "mpaa": "PG",
      "actors": [
         "Kelly Sheridan",
         "Jordyn Kane",
         "Chiara Zanni",
         "Bethany Brown",
         "Michael Dobson",
         "Rachel Harrison",
         "Alessandro Juliani",
         "Peter Kelamis",
         "Nicole Oliver",
         "Kira Tozer"
      ],
      "imdbMovieId": "4955162",
      "originalTitle": "Barbie in Rock 'N Royals",
      "genres": [
         "Animation",
         "Music",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In this upbeat musical, Barbie stars as Princess Courtney, a modern princess whose world is turned upside down when she switches places with Erika, a famous rockstar. Two very different worlds collide when a mix-up sends Princess Courtney to Camp Pop and Erika, to Camp Royalty. While the leaders of the rival camps try to correct the mix-up, both Courtney and Erika learn to adjust to the different worlds and have fun while making new, unexpected friends. When the girls learn both camps are at risk of shutting down, they must embrace their differences, find their true voices, and come together for an epic sing-off that shows anything is possible when you dare to dream big!",
      "tmdbMovieId": 355111,
      "avgRating": 2.66667,
      "releaseYear": "2015",
      "numRatings": 9,
      "posterPath": "/aCKWWQpEijagMEfIOz0vW0aTDmv.jpg"
   }
}