{
   "tmdb": {
      "original_language": "ro",
      "keywords": [
         {
            "name": "lottery",
            "id": 4258
         },
         {
            "name": "road movie",
            "id": 167043
         }
      ],
      "imdb_id": "tt5700224",
      "video": false,
      "title": "Two Lottery Tickets",
      "recommendations": [
         341265,
         38779,
         56256,
         392812,
         374452
      ],
      "backdrop_path": "/pdmpC5dVTULpKjlswBxQ0T8aC9J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Police Officer Horatiu Guspenec",
               "gender": 0,
               "credit_id": "576cb93e92514169bc0015c6",
               "name": "Mircea Banu",
               "profile_path": null,
               "id": 1640622,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Dinel Petre",
               "gender": 0,
               "credit_id": "576cb952925141693300173a",
               "name": "Dorian Boguţă",
               "profile_path": null,
               "id": 1331483,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Vasile Gramada aka Sile",
               "gender": 2,
               "credit_id": "576cb961c3a3685b15001638",
               "name": "Dragoș Bucur",
               "profile_path": "/vxLQSeuQ7acqLE4hZsMsRcmfby.jpg",
               "id": 129565,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Pompiliu Bors",
               "gender": 0,
               "credit_id": "576cb9739251411540003c7c",
               "name": "Alexandru Papadopol",
               "profile_path": "/brM9P7qrw3KVaoPoAU8qYeqPlB.jpg",
               "id": 1163608,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "576cb982c3a3682574002f2e",
               "name": "Elisa Calin",
               "profile_path": null,
               "id": 1640623,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Mihaela Dorohoi (as Ina Dimitriu)",
               "gender": 0,
               "credit_id": "576cb991c3a3685c0e0019ad",
               "name": "Ioana Florentina Dimitriu",
               "profile_path": null,
               "id": 1640624,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Prezentator loto",
               "gender": 0,
               "credit_id": "576cb9ba925141695400171d",
               "name": "Elias Ferkin",
               "profile_path": null,
               "id": 1640625,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Blonde hair gangster",
               "gender": 0,
               "credit_id": "576cb9f0c3a3682574002f79",
               "name": "Codin Maticiuc",
               "profile_path": null,
               "id": 1480637,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Junkie",
               "gender": 0,
               "credit_id": "576cb9fd925141483d002e36",
               "name": "Alexandru-Victor Nemteanu",
               "profile_path": null,
               "id": 1640626,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Strutanu",
               "gender": 0,
               "credit_id": "576cba099251416954001759",
               "name": "Alexandru-Victor Nemteanu",
               "profile_path": null,
               "id": 1640627,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "Hitchhiker / Codruta",
               "gender": 0,
               "credit_id": "576cba2cc3a3685b150016b0",
               "name": "Irina Noaptes",
               "profile_path": null,
               "id": 1640628,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "The jealous boyfriend",
               "gender": 2,
               "credit_id": "576cba57c3a3682574002fb7",
               "name": "Șerban Pavlu",
               "profile_path": "/zRxb750VJrnlWs57kMXRNN3peFt.jpg",
               "id": 592227,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "Costel Dorohoi",
               "gender": 0,
               "credit_id": "576cba699251411540003cfd",
               "name": "Andi Vasluianu",
               "profile_path": "/lejdju4hMAg0m0Y1AnPEVZsCYcS.jpg",
               "id": 85230,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "576cba89925141695100165a",
               "name": "Paul Negoescu",
               "profile_path": "/7FOS8fhhwbMQ2kh2GHRHBL2Dynj.jpg",
               "id": 937514,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "576cbb63c3a36830b80033ef",
               "name": "Malina Ionescu",
               "profile_path": null,
               "id": 1337633,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576cbaa792514169330017f1",
               "name": "Paul Negoescu",
               "profile_path": "/7FOS8fhhwbMQ2kh2GHRHBL2Dynj.jpg",
               "id": 937514,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "576cbabbc3a3682fe0003250",
               "name": "Paul Negoescu",
               "profile_path": "/7FOS8fhhwbMQ2kh2GHRHBL2Dynj.jpg",
               "id": 937514,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "576cbac6c3a36830b8003381",
               "name": "Dragoș Bucur",
               "profile_path": "/vxLQSeuQ7acqLE4hZsMsRcmfby.jpg",
               "id": 129565,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "576cbad5c3a3683089003387",
               "name": "Ovidiu Dunel-Stancu",
               "profile_path": null,
               "id": 1640633,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "576cbae5c3a3685b15001729",
               "name": "Alexandru Papadopol",
               "profile_path": "/brM9P7qrw3KVaoPoAU8qYeqPlB.jpg",
               "id": 1163608,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "576cbb0b925141483d002eec",
               "name": "Ana Draghici",
               "profile_path": null,
               "id": 1586599,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "576cbb53c3a3685c0e001ac2",
               "name": "Alexandru Radu",
               "profile_path": null,
               "id": 1640635,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576cbb6ec3a368257400305d",
               "name": "Malina Ionescu",
               "profile_path": null,
               "id": 1337633,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576cbb7cc3a3683089003415",
               "name": "Ada Radu",
               "profile_path": null,
               "id": 1640636,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "576cbbc4925141695100170c",
               "name": "Florian Titus Ardelean",
               "profile_path": null,
               "id": 1640638,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "576cbbe1c3a3685bc50019d9",
               "name": "Flora Pop",
               "profile_path": null,
               "id": 1640639,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "576cbbedc3a3685bc50019e6",
               "name": "Alin Zabrauteanu",
               "profile_path": null,
               "id": 1640640,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "576cbc0dc3a368308900348b",
               "name": "Octav Chelaru",
               "profile_path": null,
               "id": 1640641,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.247113,
      "production_countries": [{
         "iso_3166_1": "RO",
         "name": "Romania"
      }],
      "id": 403429,
      "vote_count": 11,
      "budget": 0,
      "overview": "3 men from a provincial town who are in an urgent need for money so they decide to buy a lottery ticket. They win the lottery, but very soon, the ticket gets stolen.",
      "similar": [
         920,
         773,
         296099,
         340485,
         2898,
         158,
         11282,
         19908,
         100042,
         138832,
         212778,
         291870,
         8275,
         11637,
         924,
         4147,
         50456,
         277216,
         9285,
         11199
      ],
      "original_title": "Două lozuri",
      "runtime": 86,
      "poster_path": "/blWneZexxw47gCRyjXJxmupNHat.jpg",
      "spoken_languages": [{
         "name": "Română",
         "iso_639_1": "ro"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "ActorieDeFilm",
         "id": 25381,
         "origin_country": ""
      }],
      "release_date": "2016-10-07",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Paul Negoescu"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Ion Luca Caragiale",
         "Paul Negoescu"
      ],
      "originalLanguage": "Romanian",
      "imdbLink": "http://www.imdb.com/title/tt5700224/",
      "coverLink": null,
      "actors": [
         "Mircea Banu",
         "Dorian Boguta",
         "Dragos Bucur"
      ],
      "reviews": [
         "I can say that it's the best Romanian comedy which I saw. This movie is a real picture of living in Romania: Dacia cars, old ugly taverns and people who try to earn some money. I laughed 90% of movie. The story is not so original, because every country or culture has also this part of vision, but at least, this movie tries to give that special spirit of East. The way how they speak, cops and intertwined situations are worth to be watched. I heard how this movie was made, it's with small budget, and there aren't a lot of interesting cadres. It was filmed simply, but interesting part are locations and landscapes, roads and everything which shows a lot about Romania.",
         "I happened to watch the movie inside the TIF film festival. I wasn't expecting much, cause it seems Romanian movies tend to follow a pattern. This was not the case, and it was such a nice surprise. A good script, with awesome dialogues and interactions. At the end of the movies the crew came to salute everyone and were opened to questions. The second surprise wasn't the fact that they were friendly and answered all the questions, but by the age of the crew and the \"lack\" of experience they said they have, even though by watching the film you would never experience is a issue. I haven't had the opportunity to watch it again, but if the opportunity appears for either of you I highly recommend you check it out. I did and made my day, Cheers",
         "It's a brilliant movie! Funny, smart, really good and funny again. The best comedy I've seen in years. From the script to acting, bright and colorful image, sound quality, editing, everything has a quality it acquires international value. The disadvantage of it being so Romanian may diminish a lot of its humor for foreign viewers, but there is something universal about humor and this movie has that. Cause the policeman jokes are universal and every country has it's own conspiracy believers. It's not a dark/ gloomy/ tragic comedy as Filantropica, but is a sweet satire of the contemporary Romanian rural society. Not sure if it's Paul Negoescu manifesto, but this movie is setting up a new standard in Romanian cinema achievement. Just go and see it.",
         "I've seen already five times this movie and always I had a lot of fun. Is an unique comedy in the post communist era, with good humour and great characters created in the very personal styles of the three main Romanian actors that gave life to our three heroes. The filming style, with a bit lack of dynamism, in fact creates an original approach of the all funny situations that our characters encounter over their journey. This film is a very original kind of Romanian Road Movie. Also the rest of the casting and the overall mood contribute a lot at the final delivery of the all funny situations. I think this is a good opportunity for the all Romanian viewers to get back in love with the original spirit of Romanian Comedy. It's a must see!",
         "I have to say that this is the best Romanian movie I saw in the past years. You just have to go watch it to understand what I am talking about. I couldn't help myself from laughing. It is even greater if you are a car enthusiast! The actors' performance was just brilliant. This movie really catches the essence of being a Romanian average worker. The backgrounds are classical for Romanian suburbs. The car is greatly detailed and the story is just brilliant. Go and watch this movie, you won't regret it. Plus, for just 20 LEI(RON) or 4.50 EURO is a bargain. Besides that, with the tickets bought at the premiere, you can win the car in the movie. Still 10/10 from me. Note: It is subtitled in English.",
         "I personally believe that this is the best Romanian comedy ever made! It is true that I have seen good movies with a scent of comedy (Sieranevada is a very good example, Moartea Dlui. Lazarescu), probably because every Romanian movie that is not a drama in its essence has a scent of (local wise) comedy. Nevertheless, I feel that this is a new broken ground for Romanian movies in terms of comedy, it is like nothing I have seen before! And if not the best one of the very best comedies I have seen until now. Of course the story has its merit, but , I think, it's such a good movie because it's a genius one, from the way in which it's build and directed, to the building of the characters, to the chosen actors (that fit incredibly well in their characters), all in all, pure genius! I have laughed so hard that my face hurt after the movie, I laughed with all my heart and from the very deep of me! I loved the movie completely, I highly recommend it! And congratulations to the Romanian movies making industry, this year has been incredible good (with all its Ilegitim, Bacalaureat, Sieranevada, Caini, 6,9 pe scara Richter that I have seen at TIFF - looking forward to its premiere and last but not least even the short movies have been very good (Ninel & After 7 months ruled)! Congrats to our incredible new wavers!",
         "After reading the excited users' positive reviews, you go into that cinema room expecting to be amused or, at least, to have a laugh or two. And that is the exact number of laughs this movie elicited from me. The jokes were goofy and mediocre. Not to mention my amazement in hearing people laugh during the scene in which a man threatens to smash his daughter's head against the walls, shouting at his wife to shut up. At a certain point, one of the characters complains that Romanian films are usually gloomy and do not capture the essence of the Romanian people. If that essence is taking violence lightly, then no thanks. I'd rather sit and watch a darker, more serious film, than a comedy conveying (although involuntarily) a dysfunctional worldview that you're supposed to find funny.",
         "Haahah.I am only 15 but i can say this is a excellent movie.It's bad that some...can't swear but i can name them only idiots come here and give like 1 star, even they didn't see the movie.I am passionate about old movies, and saw a lot from my country and i am sure this will going to be a movie to remember and 20-30 years from now i will show it to my kids and told them about it. I think this is the best Romanian comedy that i ever saw.I know, there are a lot others Romanian movies, but from what i see so far this is the best one.Of course that are more movies that i like from Romania, but i say it again, this is the best one. Only the think that i see the real living in Romania: Dacia cars, people how try to earn money and the oldish style of the taverns; give me goosebumps.",
         "A lame, rather average comedy, using all cliche's of Romanian films from the last 25 years (poverty, countryside, policeman on duty, etc). Another movie aimed at making fun of the locals. Lack of creativity. It's not a happening that comedies are always difficult films, as the director needs to invest a lot of creativity, to make sure the characters are indeed credible, and as a result, the actors can play them well. In addition, the script can be better, as it is based merely on poor-rural daily facts, with no additions to a good directing. This is a mediocre movie, in line with other similar mediocre Romanian movies such as Comoara, that will rather make you feel bad for wasting the hours to watch it.",
         "Somebody keeps giving 1 to this movie. Don't mind, it's just a stupid game. The movie is a masterpiece in it's way. Every word, every look, every gesture has it's effect and a lot of humor. When you less expect a boost of laugh strikes the assistance and yourself. Briefly, three good stupid guys - like many - win the jackpot. But where is the ticket? Well, it has been stolen. These guys really need the money! You feel sorry for them and you have no choice but to accompany them in a journey to find the robbers and the ticket. Every step, every mile and every encounter is a reason of laugh. At the end of the day you may conclude that money is not exactly what they need - they are better than this. Why \u0084Două lozuri\" (Two Tickets)? You'll have to see the movie to find out the second one.",
         "I really had a lot of fun watching it in the cinema, mostly because it is a rare occasion to find good quality humor in Romanian movies lately (and in American movies either). It takes a story from Caragiale but it brings it in the modernity, reflecting a part of the society, with hopes, aspirations, problems and hilarious ways of solving these problems. Maybe not the best movie for foreigners who will probably miss most of the jokes and the humorous situations, but a good movie to watch on a Saturday evening with friends. Actors are funny, the story is relaxed, the director brought a bit of a nostalgic vibe, - thank God, not too much nostalgia after the communist times. I appreciate the good vibe and the warm tone of the story from Doua lozuri, compared to the offensive, vulgar, even raw movies that seem to haunt the modern Romanian cinema.",
         "If you're not Romanian and have seen any film from there at all, it's most likely a festival prize winner by a neo-realist director like Mungiu or Netzer. If you meet a Romanian and ask them what they thought about those, you will quite likely have heard that these films are not really that great, because they do not represent how people live. There is a scene just like that in this short and mildly black comedy, in which Dragos Bucur explains this to a hitch hiker, giving the plot of \"Stuff and Dough\" as an example, and how boring it was. The very Romanian irony is that Dragos Bucur was the star of \"Stuff and Dough\", it was his breakout film, so it's just plain hilarious to hear him trash-talk about it. There are lots of similar jokes in this little gem produced at a budget of just about \u00805000. If you're Romanian, you'll constantly snicker because you'll invariably know characters who act like those in the movie. If you're a Westerner, you get a chance to see what we are really like, even if you won't get much of the humor. This is the perfect film to watch for Eastern - Western couples if you've always found yourself unable to explain just what the difference between us is. It's light, it's fun and unlike most films these days not too long. And although it says so in the content description, this is not based on some British comedy, but (loosely) on a 19th century play.",
         "I'm not going to write about the story line, I just wanted to say that this is the best Romanian comedy I've seen, and, on top of that, with some of my favorite actors too. Congratulations to the director, it was a pleasure to watch it, definitely a must see. It will make you laugh for sure.",
         "The most elaborate structure is by far that of Pompiliu, the intellectual of the group. He is a clerk with the City Hall, a social category so superannuated in the classical comedy that there's hardly anything to add to the profile of this type of hero. Besides this (as I dare call it) typological disability, there's also the epical charge of the character as such, built according to a series of generic and cliché traits, as Pompiliu is at the same time a Dacian supporter, patriot, distrustful in the State structures and bucolically cautious. But these flaws as such are the ones which turn recognizable some of the individualities nowadays. Despite this encumbrance of the common flaws, the character not only refuses to remain stuck in the area of the penny dreadful melodrama, but he also magisterially lifts himself to the profile of a neoChekovian construction, of overwhelming complexity and sensible veracity. How is this achieved? Through an acting so refined, that it only exposes the simplest lines of structure of the character, revealing no glimpse of the huge effort this typology entails. These are a few aspects which do not come easy to the common director, or to the common actor. First of all, we can take into account that purity of character which preserves specific details without having the personality of the actor alter it to the smallest extent. Any part played by Rebenciuc, for example, or De Niro, bears the unmistakable stamp of the mentioned actors, which in fact represents the very charm of their characters. As technique, such a personal acting has nowadays become obsolete. As has the one of the actor who leaves no trace behind, because that means the person had assumed the part of a \"man without traits\" and feels that it's their duty to play blankly – ostentatiously lacking any type of nuance. Things are different with Papadopol. He highlights an amount of traits representative of a character obsessed with the general conspiracy theory, flawlessly avoiding the previous templates (the paranoiac, the exhilarated, the resigned etc). Pompiliu is a pure man, who is aware of the dangers as aberrant as widely spread of the ordinary environment, but he defends his ideas without intemperance or exaggeration. He is simply an ingenuous man, knowledgeable about some secrets. He does not plan on persuading anybody and does not set himself up as a guardian of justice. This representation of a frequent human type becomes difficult, as precisely the renowned techniques (exaggerating flaws, demagogy, exaltation) ease the work of the actor and usually lead to the success of the typology. However, Negoescu renounces that simple part, those successful comedy techniques, which in itself can be considered an indisputable triumph, since it is a well-known fact that all these elements have already been degraded by cheap performances, such as TV shows. He took the path of most resistance, with the typical character displaying dominant traits, credible to normality only through its manifestations. And Papadopol did not only understand this, but he also knew how to channel his talent into the same direction, creating a character cleansed of all previous clichés. He does not resemble anyone else. He's a character saddled with all the obsessions of the mediocre man, but without turning this burden into a caricature. Papadopol does not poke fun at his character, he actually loves it, an element which rarely reaches this level of perfection in performing as Papadopol as reached. That aspect bears the mark of Negoescu, but one that Papadopol accepted from conviction, driven maybe by a common perspective regarding the character. Pompiliu takes pride in the history of the Dacians, he disavows the films of the miserabilism brought by the year 2000, loathes superstitions and the lack of respect on the part of the passenger, who, from his point of view, had lied to him. He remains convinced that the game organized by the Lottery is corrupted. But all these are expressed in the reasonable manner of an ingenuous person, who is well-meaning not by circumstance or for the sake of film's aesthetics, but because the actor plays his part impeccably. Two lottery tickets is a fresh comedy, an intelligent film, where the social irony is edulcorated through a mature directional vision and through an acting performance of exceptional quality. Doina Ruști",
         "While the communist feel is still present in most of the scenes, the movie depicts very well the life of the average Romanians of the last two decades. \"Doua lozuri\" was made with a very small budget but the storyline is brilliant, I can't remember laughing so hard watching an eastern-european comedy. Acting is well done, Dragos Bucur steals the show for sure, the story is thrilling and the very end is somehow predictable but overall I totally recommend watching this movie. Also I can only hope for more similar happenings in the Romanian film industry."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "ActorieDeFilm",
         "Kirkland",
         "Papillon Film"
      ],
      "summaries": [
         "Three men from a provincial town are in urgent need of money and decide to buy a lottery ticket. They win the lottery, but soon after their ticket gets stolen. The three desperate men go on a journey to find their lost lottery ticket and experience all kinds of adventures...",
         "Three men from a provincial town are in urgent need of money and decide to buy a lottery ticket. They win the lottery, but soon after their ticket gets stolen."
      ],
      "budget": 40000
   },
   "movielensId": 164971,
   "movielens": {
      "languages": ["Română"],
      "releaseDate": "2016-10-07",
      "dvdReleaseDate": null,
      "directors": ["Paul Negoescu"],
      "runtime": 86,
      "movieId": 164971,
      "title": "Two Lottery Tickets",
      "mpaa": null,
      "actors": [
         "Mircea Banu",
         "Dorian Boguţă",
         "Dragoș Bucur",
         "Alexandru Papadopol",
         "Elisa Calin",
         "Ioana Florentina Dimitriu",
         "Elias Ferkin",
         "Codin Maticiuc",
         "Alexandru-Victor Nemteanu",
         "Alexandru-Victor Nemteanu",
         "Irina Noaptes",
         "Șerban Pavlu",
         "Andi Vasluianu"
      ],
      "imdbMovieId": "5700224",
      "originalTitle": "Două lozuri",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["KRjemUwr29g"],
      "plotSummary": "3 men from a provincial town who are in an urgent need for money so they decide to buy a lottery ticket. They win the lottery, but very soon, the ticket gets stolen.",
      "tmdbMovieId": 403429,
      "avgRating": 3.66667,
      "releaseYear": "2016",
      "numRatings": 9,
      "posterPath": "/blWneZexxw47gCRyjXJxmupNHat.jpg"
   }
}