{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "theater director",
            "id": 6521
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0171546",
      "video": false,
      "title": "Murder in a Small Town",
      "recommendations": [
         71007,
         16877
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Cash Carter",
               "gender": 2,
               "credit_id": "52fe4be29251416c75111145",
               "name": "Gene Wilder",
               "profile_path": "/7xQjm2yrqAVy4yPjGemWseo1Ovi.jpg",
               "id": 3460,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sidney Lassiter",
               "gender": 2,
               "credit_id": "52fe4be39251416c7511114d",
               "name": "Terry O'Quinn",
               "profile_path": "/o6zGsvhx8klAofq8No6f3jByR42.jpg",
               "id": 12646,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mimi",
               "gender": 1,
               "credit_id": "52fe4be39251416c75111151",
               "name": "Cherry Jones",
               "profile_path": "/vhJQCBWah9L84HefqvJt8fyf7y7.jpg",
               "id": 1956,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Martha Lassiter",
               "gender": 1,
               "credit_id": "58c9d643c3a36841a30008ae",
               "name": "Frances Conroy",
               "profile_path": "/mQsO4JrmYWKTXtFg7u3zhYGiXfM.jpg",
               "id": 4432,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tony",
               "gender": 2,
               "credit_id": "5341348ec3a36814ff0017cc",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kate Faxton",
               "gender": 1,
               "credit_id": "58c9d66f9251415dbf0009a7",
               "name": "Deirdre O'Connell",
               "profile_path": "/1dPJbDo3ghv7eTqNSeiTCWBwnWz.jpg",
               "id": 77013,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Billy",
               "gender": 2,
               "credit_id": "58c9d6879251415da10009af",
               "name": "Ebon Moss-Bachrach",
               "profile_path": "/ur1xAkenuiahTeQ8cIo20hwAvnm.jpg",
               "id": 21042,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4be29251416c75111141",
               "name": "Joyce Chopra",
               "profile_path": null,
               "id": 146150,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58c9d6c3c3a368419b000958",
               "name": "Gilbert Pearlman",
               "profile_path": null,
               "id": 1677861,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58c9d6cec3a3684150000ac5",
               "name": "Gene Wilder",
               "profile_path": "/7xQjm2yrqAVy4yPjGemWseo1Ovi.jpg",
               "id": 3460,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58c9d6e99251415dbf000a17",
               "name": "Antony Root",
               "profile_path": null,
               "id": 1247066,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Mystery",
         "id": 9648
      }],
      "popularity": 0.829546,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 149213,
      "vote_count": 5,
      "budget": 0,
      "overview": "A widowed theatre director moves to a small Connecticut town where he gets involved in solving the murder of a millionaire, who was the most despised man in town.",
      "similar": [
         357096,
         8090,
         10900,
         4771,
         979,
         807,
         395834,
         3134,
         25376,
         21484,
         30833,
         281,
         984,
         12150,
         2832,
         1586,
         65754,
         1949,
         3597,
         12619
      ],
      "original_title": "Murder in a Small Town",
      "runtime": 92,
      "poster_path": "/ta5MJkcsblq7uiM89BzpfRy8Qv5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Crystal Sky Worldwide",
            "id": 4077,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "A&E Networks",
            "id": 18441,
            "origin_country": ""
         }
      ],
      "release_date": "1999-01-10",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joyce Chopra"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Gilbert Pearlman",
         "Gene Wilder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0171546/",
      "coverLink": null,
      "actors": [
         "Gene Wilder",
         "Mike Starr",
         "Terry O'Quinn"
      ],
      "reviews": [
         "I love this movie.The time period sets & characters were very engrossing.I was truly surprised as to the outcome of this movie.I thought I had it all figured out.This film reminds me of the board game \"Clue\".I will probably purchase this movie.There is a little bit of \"CHINATOWN\" in the movie's plot.Terrific acting & use of guile to fool the viewing audience.Very entertaining.I hope WILDER reprises his role.",
         "It's been a long time since I have seen old Gene on the screen (couldn't resist). Gene Wilder's Murder is a class act all the way. Interesting characters, good mystery, overall very nice. The third act of the movie did feel hurried. I think it was less than 15 minutes (screen time) from second murder to conclusion. I also get the feeling that this was a prep for a series of movies. Some of the characters were given strong introductions only to disappear (like the daughter) and others were a little weak overall (Gene's girlfriend). I hope that they do more movies with these characters. I wouldn't mind revisiting the material.",
         "Gene Wilder is terrific in his over-the-top comedic triumphs (\"The Producers\", \"Young Frankenstein\", \"Blazing Saddles\", and more), but hasn't always been wisely used in more moderate roles. \"Haunted Honeymoon\" comes to mind! This one, though, is extremely enjoyable, and I hope it's the beginning of a series. His performance is smart, restrained, believable, professional, and witty. The movie, a lovely period piece murder mystery, is a surprisingly effective vehicle for him. It has everything for a satisfying couple of hours on the sofa: 1930s costumes and cars, detective work, romance, and light comedy. Let's have more of Wilder in this kind of role.",
         "In a mostly straight role, with only occasional moments of humor, Gene Wilder is surprisingly good; his warm and insightful theatrical director/amateur sleuth is like a more humane Hercules Poirot. The film is well-cast right down the line and has a reasonably intricate plot, but it suffers from the usual limitations of most TV productions, including bland cinematography and slow pacing. Enjoyable overall, but mediocre. (**1/2)",
         "Nothing too heavy, but a wonderful romp into the late 1930's. An A&E murder mystery true to all the marvelous classic conventions with fine performances by all. Plenty of humor, good feeling, and eccentric characterizations more than make up for a rather spartan plot. Just relax and enjoy.",
         "You can tell that Gene Wilder was doing exactly what he wanted to do when he wrote and starred in the 1999 made-for-TV film, Murder in a Small Town. Directed by Joyce Chopra and starring Wilder along with Mike Starr; Murder in a Small Town is a campy little TV movie set in the 20's reminiscent of the movie mysteries that commanded the screen in the era. When a string of murders begins to occur in the quiet Connecticut town, a widowed playwright will become influential in solving the crimes. I'm happy for Wilder that he became successful enough to do the kind of stories he wanted to do later in his acting career, Murder in a Small Town definitely fits into this category. After his wife was murdered, Larry \"Cash\" Carter left his successful post in Broadway churning out success after success as a playwright to move to the sleepy town of Stamford, Connecticut. Since his move, he transitioned to work in community theater as a writer/director which left him plenty of time to pursue other interests of his. With a superb eye for detail and a knack for getting into the mind of a criminal, Cash became fast friends with a local detective Tony \"Bologna\", even helping him solve some of his cases. When the wealthy town jerk, Sidney Lassiter (Terry O'Quinn) is found dead, Tony enlists Cash's help in order to solve the case. When a second, yet intertwined murder is committed, Tony and Cash must work quickly to solve the time and protect the small town before it becomes any smaller. Stamford Connecticut is where Gene Wilder moved to after he left Hollywood and all but retired from acting in the early 90's. It doesn't go unnoticed that this film takes place in Gene's hometown. He also worked on the script with his brother-in-law, Gilbert Pearlman. I've also seen enough interviews of Gene Wilder in where he admits that he enjoys watching mystery movies on TV. All of this data goes toward suggesting that Gene Wilder was doing exactly what he wanted to do with Murder in a Small Town. Although the movie is nothing to write home about, and although it's fun, you won't miss out if you skip it; it's still worth watching knowing that Wilder had worked up to the point in his life and career that he could only take on the jobs he really wanted to do. The later TV works of Wilder's, like this one, are a nice contrast to his more well-known work of the 70's and essential viewing for great fans of the veteran actor's.",
         "I'd wanted to see this since it first came out, but never had a chance since today. Gene Wilder turns in a nice, low-key performance, and there are several interesting character roles, especially Frances Conroy as the \"invalid\" widow. The scenes between Gene Wilder and the actress who plays his daughter are heartwarming. The '30's atmosphere is fairly realistic, with cars, costumes, and references to suffering Jews in Europe. I wouldn't say this is a masterpiece (I figured out who the killer was about halfway through), but it was a pleasant way to spend a Sunday morning.",
         "This is a delightful well executed period murder mystery. The suspects are developed in the traditional manner early in the movie. The interaction between the detective and a drama producer is done with understated humor. There is in fact a lot of between-the-lines humor which Gene Wilder plays off in a brilliant manner. It is great to see Wilder in a role such as this, contrasting with his more over-the-top style of comedy acting in his early films. So what is there not to like in a well written story, well acted and with an evocative 1930's setting?",
         "Set in the mid-1930's, this excellent diversion avoids the pitfalls of many films portrayed in this period by combining excellent atmosphere and impeccable art and set direction! This reminded me of the beloved 'Thin Man' series, in that a character who is NOT a law enforcement professional (indeed, Wilder's character is a stage director) assists the police in a murder investigation. This was consistently surprising, and had a way of making those old cliches work again! I HOPE this is the beginning of a series of films with this character! Gene Wilder has been under-utilized for far too long!! AND, the always excellent Mike Starr even gets a chance to display his operatic chops! Starr, one of the best character actors working today, was said to have designs on a career in opera before making his niche in Hollywood! He gets a surprising chance to demonstrate how talented he is in that area!!",
         "Having lost his wife in a violent crime, theatre director Larry \"Cash\" Carter moves to a small town in Connecticut to get away from the stresses of bigger city life. Looking for funding for his latest play, Cash comes into contact with local millionaire Sidney Lassiter who immediately rubs him up the wrong way by being anti-Semitic and demanding. And so Cash finds himself just one of many people that have a reason to dislike Lassiter. So later that night when Cash's friend Lt Tony Rossini tells him that he is investigating Lassiter's murder, Cash helps out and gets involved in the case. Having seen \"The Lady in Question\" and found it bland and undemanding fare, I still decided to give the other film in the stalled series a try. Like the second film this is very undemanding fare that will fit nicely with audiences that enjoy the basic mystery movies on Hallmark and the like (Mystery Woman, Jane Doe etc). The plot is interesting without ever getting going although the development of the case is reasonably engaging. Of course this means it lacks any depth which is rarely a problem when a film is slick and stylish, sadly this one tends to move sluggishly as if it has nowhere to go and nothing to do \u0096 an approach that rather flies in the face of face of the fact that a murder has occurred! The director does well if this was her aim but otherwise she plays it far too slowly and with a sense of urgency that was needed underneath. The cast match this meandering approach and with a bit more help could have pulled it off. As it is they are just reasonably good in an average film. Wilder is a bit more interesting here than in the second film (where it did feel like he was just moments away from falling asleep at times). Here he is actually pretty good fun despite the material. Starr's character doesn't make a great deal of sense but he is a fun character. The two men have a bit of chemistry but it is difficult to believe they know one another that well because they don't merge that well \u0096 I assume this is part of the reason that the series didn't catch on. The support cast features turns from Lost's O'Quinn and Six Feet Under's Conroy and others like Edison and Rosen. None of them have much to do though and generally their characters are just quite thin. Overall this is a mediocre or average film that might just be good enough to distract viewers who aren't looking for much more than that. The cast match the amiable and ambling mood which makes for some nice touches but generally just slows the film down further.",
         "Not being a Gene Wilder fan, the memory of Haunted Honeymoon being too fresh, I almost didn't watch this one. Glad, glad, double glad I did. The whole thing smacked of the 30's with all the hairstyles, props and settings, and all the well preserved cars. An excellent whodunnit that had me guessing all the way. The killer was suspicious, but I never....",
         "For all the Hype about this TV Film the dialogue, acting and script was very bad. First hour never paid any attention to trying to solve or find suspects in the murder. Loved Wilder in \"The Frisco Kid\". Wilder should also get a better hat."
      ],
      "genres": [
         "Crime",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "A&E Television Networks",
         "Crystal Sky Worldwide",
         "Fred Berner Films"
      ],
      "summaries": [
         "Due to a tragic incident Larry \"Cash\" Carter, a successful Broadway director, winds up in a small town in Connecticut working in community theater. With an eye for details and a view of the criminal mind, Cash soon finds that he is in demand by the local detective when the town's leading industrialist is found shot dead. While there were many people who may have wanted him dead, it is up to Cash to narrow the list of suspects. When the second murder is committed clues left at the scene lead Cash to the identity of the killer.",
         "Major Broadway director Cash (Gene Wilder) retreats to small-town Connecticut following the brutal murder of his wife. When a wealthy investor of his community theatre is found dead, the subsequent investigation leads to Cash's own life being placed in jeopardy.",
         "A widowed theatre director moves to a small Connecticut town where he gets involved in solving the murder of a millionaire, who was the most despised man in town."
      ],
      "budget": 0
   },
   "movielensId": 165097,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-10",
      "dvdReleaseDate": null,
      "directors": ["Joyce Chopra"],
      "runtime": 92,
      "movieId": 165097,
      "title": "Murder in a Small Town",
      "mpaa": "",
      "actors": [
         "Gene Wilder",
         "Terry O'Quinn",
         "Cherry Jones",
         "Frances Conroy",
         "Mike Starr",
         "Deirdre O'Connell",
         "Ebon Moss-Bachrach"
      ],
      "imdbMovieId": "0171546",
      "originalTitle": "Murder in a Small Town",
      "genres": ["Mystery"],
      "youtubeTrailerIds": [],
      "plotSummary": "A widowed theatre director moves to a small Connecticut town where he gets involved in solving the murder of a millionaire, who was the most despised man in town.",
      "tmdbMovieId": 149213,
      "avgRating": 3.66667,
      "releaseYear": "1999",
      "numRatings": 3,
      "posterPath": "/ta5MJkcsblq7uiM89BzpfRy8Qv5.jpg"
   }
}