{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt5946232",
      "video": false,
      "title": "Russell Peters: Almost Famous",
      "recommendations": [
         366692,
         105388,
         228009
      ],
      "backdrop_path": "/4GOTpBwdPIEBQUxoTM3zdwlaEQu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 2,
            "credit_id": "57e18ac7c3a36808c0001666",
            "name": "Russell Peters",
            "profile_path": "/zACDT51HnBvlA0WkcwuMKC5HscR.jpg",
            "id": 82417,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57e18ab3c3a36808bc001785",
               "name": "David Higby",
               "profile_path": null,
               "id": 108659,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57e18abdc3a36808cc0015e7",
               "name": "Russell Peters",
               "profile_path": "/zACDT51HnBvlA0WkcwuMKC5HscR.jpg",
               "id": 82417,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.486033,
      "production_countries": [],
      "id": 417026,
      "vote_count": 14,
      "budget": 0,
      "overview": "The comic comes home to Toronto to sound off on cultural quirks, furniture building and bathroom visits, reveling in all things ridiculously human.",
      "similar": [],
      "original_title": "Russell Peters: Almost Famous",
      "runtime": 73,
      "poster_path": "/djCYbBhclsEj8nIJ79qXxd5nQmx.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2016-10-07",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Higby"],
      "runtime": 73,
      "synopsis": null,
      "writers": ["Russell Peters"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5946232/",
      "coverLink": null,
      "actors": ["Russell Peters"],
      "reviews": [
         "I will make this review short and sweet. Remember the genuine laughs you had when watching a Russel peters special for the first time? You won't have them again. If this will be your first Russel peters special then i confidently say go ahead with it as not many have explored his range/style in comedy. For the rest of you, his material fails to progress as opposed to great comedians (george Carlin, Jerry Seinfeld, bill hicks etc). His focus is mainly STILL race, even though he was able to come out with some new jokes yet they still seem expected or repetitive after a while. The shows' area of strength remains the part were he interacts with live audience, making of fun of them in a light fashioned way highlighting how natural of a comedian he is . Overall, the show was okay given the same source of material he always used but never worthy of mentioning in the same list of great specials.",
         "Russel Peters has always used race as his primary choice of material and this time it is no exception. However, he usually focuses on outside (non north America) world to make fun of, specially Indians and over the years, Asian, African, and many other countries and continents. However, this time his focus was more on America and he has fall short. Except for the daughter and sleeping joke, nothing quite stands out and those too seemed very predictable. The stand up seemed very incoherent and non-cooperative audience members at times didn't help much; although talking to audience members is one of his strongest suits. I expected more out of this routine as it has been 3 years since his last outing. Either he needs to add more to his source material or reignite it somehow. It is still a good stand up but simply not up to his own high standards. To sum it all up in one word: disappointing!",
         "Working with the race topic wasn't the issue. The issue was his execution of the material and half a**ed stories with attention deficient follow-ups. Two spotlight materials were about a castle bed and differences in sleep..., other ones were not so engaging and strongly structured. He used to convince people even if what he says is laced with absurdity, this time around that isn't reflected and also what happened to his care-free observations and insights from cultural involvement (...maybe the peter joke). Range of topics is also an issue, it is time to evolve but this isn't attempted maybe its the love for laziness or LA might have changed him.",
         "I truly enjoyed some of Peters' earlier stand-up shows. He has several jokes that will live on for years to come. But, having said that, this performance left a lot to be desired. I made it about halfway through before I realized I wasn't laughing, just sort of zoning in and out while staring at the TV. It was then that I also realized the audience wasn't really laughing either. There was scattered laughter and chuckles here and there, but I'm thinking, \"If I'd paid for a ticket, driven, parked, stood in line and sat in a seat, I'd expect to be rolling on the floor\".... NOT just politely chuckling. The jokes were transparent. I could often guess the punch line. Really, it was a bunch of incoherent stories that set up an opportunity for him to use the accents and impersonations he's know for. I've read other reviews and some people pointed out the \"funniest\" jokes.... and they weren't all that great. Nowhere near his earlier stuff. Disappointed! Watch his earlier routines. Don't waste your time.",
         "Russel is known for his accent, and comedy about countries around the world. He showed alot of that in this special, and I was crying of laughter!",
         "The guy has some tired jokes, that draw a laugh, but otherwise he is plain unfunny. He attempts to engage the audience which is very hit and miss, some of it cringeworthy and embarrassing, for Russell himself. Its not like anyone would see this guy twice, i lasted 15 mins watching him and tired of him very quickly ,so im not sure an hour would be possible let alone half an hour It seems he just can't evolve, then again there are 7 billion people out there so he will always get fresh new suckers,ummm i mean audiences",
         "There's no doubt in my mind that absolutely gets genuine laughs. Not laughs at his jokes, but laughs nonetheless. I am disgusted in myself for actually watching this trash, and even more disgusted that this hack has the freaking audacity to make statements about the ratings being sabotaged by the alt-right, and that they're not a reflection of the quality of the show. Man, you stink. There's no vendetta."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Almost Famous"],
      "summaries": ["Canadian comedy star, Russell Peters, visits Toronto's Massey Hall for a homecoming stand-up comedy performance. Russell returns to his trademark material of ethnic jokes and audience interaction."],
      "budget": 0
   },
   "movielensId": 165155,
   "movielens": {
      "languages": [""],
      "releaseDate": "2016-10-07",
      "dvdReleaseDate": null,
      "directors": ["David Higby"],
      "runtime": 73,
      "movieId": 165155,
      "title": "Russell Peters: Almost Famous",
      "mpaa": "",
      "actors": ["Russell Peters"],
      "imdbMovieId": "5946232",
      "originalTitle": "Russell Peters: Almost Famous",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The comic comes home to Toronto to sound off on cultural quirks, furniture building and bathroom visits, reveling in all things ridiculously human.",
      "tmdbMovieId": 417026,
      "avgRating": 3.66667,
      "releaseYear": "2016",
      "numRatings": 9,
      "posterPath": "/djCYbBhclsEj8nIJ79qXxd5nQmx.jpg"
   }
}