{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "necrophile",
            "id": 202572
         },
         {
            "name": "apathy",
            "id": 210541
         },
         {
            "name": "loss of innocence",
            "id": 222029
         },
         {
            "name": "inspired by true events",
            "id": 228523
         },
         {
            "name": "kew gardens",
            "id": 229848
         },
         {
            "name": "kitty genovese",
            "id": 229849
         },
         {
            "name": "fictionalized history",
            "id": 229851
         },
         {
            "name": "genovese syndrome",
            "id": 229852
         },
         {
            "name": "bystander effect",
            "id": 229853
         },
         {
            "name": "indifference",
            "id": 229854
         }
      ],
      "imdb_id": "tt4882174",
      "video": false,
      "title": "37",
      "recommendations": [
         177298,
         188532,
         268297,
         138217,
         358927,
         22241,
         83373,
         349441,
         342550,
         329160,
         290283,
         34219,
         381041,
         30593,
         77368,
         324277,
         352200,
         267433,
         334026,
         215928
      ],
      "backdrop_path": "/jceuOtUFoM3hNnCDAeYwPugB1fL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Kitty Genovese",
               "gender": 1,
               "credit_id": "55e3960692514137e0001b80",
               "name": "Christina Brucato",
               "profile_path": "/cOUcnlgdOqqhZ2cNgzjTZHaWRtX.jpg",
               "id": 69483,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Archibald Smith",
               "gender": 0,
               "credit_id": "55e3b704c3a368419400240f",
               "name": "Michael Potts",
               "profile_path": "/vLL2yoKKUaT6fGD0iFgi1hEY3Gq.jpg",
               "id": 167566,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mary Cunningham",
               "gender": 1,
               "credit_id": "55e3b74c92514137e90022a3",
               "name": "Maria Dizzia",
               "profile_path": "/1DUT6oaHpkq0BoRJlt2IDsvj8YB.jpg",
               "id": 205797,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Bob Cunningham",
               "gender": 2,
               "credit_id": "55e3b7b492514137d700246c",
               "name": "Jamie Harrold",
               "profile_path": "/psJL3yck7Dd0EzlKnmXmJcCG6Ee.jpg",
               "id": 86919,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "George Bernstein",
               "gender": 2,
               "credit_id": "55e3b85592514137e600239e",
               "name": "Thomas Kopache",
               "profile_path": "/x7ef1rpmCE6rjeuJq30rw0zSQE0.jpg",
               "id": 9284,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Gonzales",
               "gender": 2,
               "credit_id": "56b47d009251415320003083",
               "name": "Adrian Martinez",
               "profile_path": "/zDnnzak4BLb5dNc9taqLNprkRvw.jpg",
               "id": 94432,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Joyce Smith",
               "gender": 1,
               "credit_id": "55e39680c3a3684197001c55",
               "name": "Samira Wiley",
               "profile_path": "/68zAC7KjSGFWC0INbiwmPatlmVz.jpg",
               "id": 1034197,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Florel Bernstein",
               "gender": 0,
               "credit_id": "55e3b80b92514137dd00234d",
               "name": "Lucy Martin",
               "profile_path": null,
               "id": 1241637,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sam",
               "gender": 0,
               "credit_id": "56b47d26c3a36806f1004284",
               "name": "Don Puglisi",
               "profile_path": null,
               "id": 172088,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Winston Moseley",
               "gender": 0,
               "credit_id": "55e3b86fc3a3684185002291",
               "name": "Mario Israel",
               "profile_path": null,
               "id": 1502231,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Debbie Bernstein",
               "gender": 1,
               "credit_id": "59b53ba292514120ab000516",
               "name": "Sophia Lillis",
               "profile_path": "/r62iGGF7ERQ0oJqq473lcBOVmVr.jpg",
               "id": 1481238,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55e39505c3a3684194001c3c",
               "name": "Puk Grasten",
               "profile_path": null,
               "id": 1502218,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55e3951c92514137e6001c25",
               "name": "Puk Grasten",
               "profile_path": null,
               "id": 1502218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55e39564c3a3684194001c47",
               "name": "Adam Jandrup",
               "profile_path": null,
               "id": 131807,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55e3958f92514137e6001c30",
               "name": "Giacomo Ambrosini",
               "profile_path": null,
               "id": 1436634,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.507454,
      "production_countries": [
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 356895,
      "vote_count": 11,
      "budget": 0,
      "overview": "On a March night in 1964, 37 neighbors in Queens, New York, witness the brutal murder of Kitty Genovese. None of them takes action or calls the police. 37 tells the story of a few of these people and what led up to the night when they unexplainably remained passive observers. The film is a convincing portrayal of a borough in change and a time characterized by racism, the Civil Rights Movement and political shifts. The actual event that inspired the film’s plot has been called a symbol for the moment when America lost its innocence. The director Puk Grasten skillfully weaves into her feature film debut various fates, dreams and family conflicts by leading us through an apartment building that comes to bear a collective failure.",
      "similar": [
         3134,
         281,
         979,
         4771,
         281957,
         357096,
         445954,
         133805,
         2142,
         11423,
         12143,
         18587,
         504,
         15069,
         26390,
         12150,
         75780,
         395834,
         1949,
         85206
      ],
      "original_title": "37",
      "runtime": 85,
      "poster_path": "/yNQvmwsfBzVfHbKtnISw1RuwWXF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Regner Grasten Film",
            "id": 3675,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Game 7 Films",
            "id": 35798,
            "origin_country": ""
         }
      ],
      "release_date": "2016-11-17",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "This Poster will Be Seen But Not Heard. This Film Will Be Seen and Heard.",
      "adult": false,
      "homepage": "http://www.37themovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Puk Grasten"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Puk Grasten"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4882174/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjA3OTIxNjU5N15BMl5BanBnXkFtZTgwMTc4MTgxMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Samira Wiley",
         "Michael Potts",
         "Maria Dizzia"
      ],
      "reviews": [
         "I generally don't take the time to write reviews however having just watched the documentary The Witness and the agonizing investigation her brother did to bring peace to himself regarding his sister's tragic death, this movie was completely weird and did not make one iota of sense! How the children depicted in this film would be up at 2:00 AM having dysfunctional issues with their parents is beyond me. This movie is like a psychedelic bad acid trip. The murder itself is belittled and was so irrelevant to a bunch of meaningless circumstances that supposedly had all 37 characters preoccupied at the same time and in the same neighborhoods. It is just a pathetic epic fail to sell to the audience. I felt like an idiot to have kept my nose stuck to the screen for the agonizing amount of time it took for this movie to finally end.",
         "This movie was a disjointed mess....The title and brief information given about the movie have nothing to do with the movie....I don't believe that victim's name was even mentioned during the film...I can't believe that this crap was funded...somebody had to be looking at this mess as it was being filmed and edited??? They should not pay the director for this garbage....Furthermore, I seriously doubt that there was one shred of truth to any of this film, with the exception of the opening title and information line....This film should be deleted from the planet....absolutely no redeeming qualities....it doesn't deserve a \"one\" it deserves a \"0\".....WOW what a piece of crap!!!!!!!!",
         "Barely references the murder or the things that were shouted by the victim. The directors pointlessly use whale noises all the way through to try and add atmosphere and try to force the film into being a point about racism. It feels like watching a bad art house picture and belittles the victim It's hard to find enough substance in the film to even meet the IMDb review minimum lines requirement. I definitely do not recommend you waste your time watching the film. I don't think the producers did any research into the crime that supposedly inspired it.",
         "I won't repeat all the justifiably outraged comments this film deserves by distorting not only the basic facts of the Genovese murder but also perpetrating misguided fiction. If you decide to make a movie based on any *real* case, at least do basic research. Even before \"The Witness\" (an amazing film) was released it was well-known that the Times had fluffed the apathy angle to stoke sales. No, what makes Puk Grasten's film irredeemable is it's utter lack of a story or any compelling (strike that --- NON-repellent), even interesting characters. These fantasy \"neighbors\" are all given stereotypical bad-sitcom dilemmas and we watch them yell, kick, scream, and drag for the longest 85-minute run-time I've endured this year. None of the subplots has any bearing on the crime (you could be watching a really dull Law and Order) and Grasten falls back on primitive symbolism such as the innocent all-seeing nature of the child vs. jaded self-absorbed adulthood. Maybe \"37\" is what it appears to be --- a glib, inauthentic, attention-seeking morality-play payday. But if \"37\" *is* a sincere attempt at making a meaningful or engaging film, its dismal failure doesn't make it any less a waste of anyone's time.",
         "Trigger Warning(s): Sexual Assault & Child Abuse Main Storyline In this one building filled with eccentric people, the focus primarily is on three families. One being 5-year-old Troy's (Marquise Gary) family comprised of his mother Joyce (Samira Wiley) and much older father Archibald (Michael Potts) who are struggling with how to raise Troy in 1960s America. Then there is Billy (Evan Fine) whose mom Mary (Maria Dizzia) is on edge, a housewife with a husband, Bob (Jamie Harrold) who may have lost her job, and while she is trying to keep her cool, between Billy's antics and how distant Bob seems at times, she sometimes seems on the verge of nervous breakdown. Leaving Debbie (Sophia Lillis). Debbie is an odd little girl who counts her steps in fear that one too many may mean a disaster. Because of this, and a rumor going around about her family and insurance fraud, only a nice tutor named Kitty (Christina Brucato) seems to take time with her. Not to imply her grandparents aren't kind, but the circumstances of them getting Debbie implies there is more going on than revealed to us. Highlights The Lives of The Three Children: To me, if you focus solely on the eccentricities of the adults in the film, then the film is a muddled mess. However, if you focus on the kids then you see how these adults and what they've been through, and are going through, are affecting their children. Take Troy for example. His father, despite the boy only being 5, is already trying to mold him into a man. Has him boxing with him, and trying to make it seem the dreams Joyce has for him, going to college, aren't realistic. Not because the boy isn't capable, but because of Archibald's upbringing and his understandings of race and opportunity. Much less, this pride in not having to ask for anything. The other children as well have parents whose issues with themselves are inflicted on their children. Debbie seems to be trying to figure out a way to deal with her mother's absence, lack of friends, and grandparents who just don't understand. She finds some solace in Kitty, who is sweet on Debbie, but unfortunately, Debbie is 12 and Kitty is an adult. Billy experiences something similar but rather than an adult being his confidant it is his older brother. For, you see, Mary is always giving Billy strikes for disobedience and if he gets enough he has to wear a sign that he has been bad and isn't supposed to be talked to. On top of that, he gets spankings, from his dad, when his mom really feels pushed to the limits. Low Points Too Weird For Its Own Good: An element of this movie is Billy's belief that aliens are going to come down and this is played up far too much. Almost to the point you'd think aliens really are going to come to this building in Queens and rather than this being a movie about 37 people who did nothing while someone was raped and murdered, it would be 37 people who hid from aliens as they abducted someone. Overall: Negative (Skip It) While arguably the analysis of the adults as parents, and how their parenting is affecting their children, can be seen as interesting, I must admit it took me a while to come up with that highlight. Reason being, for most of the movie I felt quite indifferent to it with its odd, sort of eerie, tone. A tone in which you do feel a bit curious as to who will be the victim that was ignored by 37 sets of eyes. However, once it became clear who the victim was and you saw everyone ignore or be distracted in their own way, and realized their distractions were not something of substance to drown out the screams and images burned into your mind, you are left with very little to take interest in. For even though the children all present interesting cases, the focus of the film is spread too thin to make any of their situations substantial enough to save this film from itself.",
         "I am glad I stopped it and read the reviews before wasting any more time on this movie that moves at a glacial pace and totally disrespects her life. Very upsetting. I love Samira Wiley, but even she couldn't save this.",
         "What... in the hell... did I just WATCH! Really? Really?? REALLY?!? Good God this was awful. I only watched this to see how well Sophia Lillis can act, seeing as how IT is coming out this Friday. She was good, that's all I have to say in regards to that. The other actors and actresses? Holy cow, awful, just simply awful. I really do hope the situation didn't actually go down like this in real life, what happened to that poor girl, with no one helping. If it did, what a bunch of weak and moronic people. The film itself? Horrible direction, camera work, editing, dialogue, pacing, and acting (save for Sophia Lillis). What a complete slap in the face to the victim, and insult to her family. I don't believe it's the actors and actresses fault one bit. If this director has any association with the Directors Guild of America, fire her from any and every future project. This is a high contender for The Golden Raspberry Awards. Huge thumbs down.",
         "On its face, I would give this film 7 stars because it has gripping characters and story telling. If it had just been a film about 3 children growing up in a lower middle class complex in Queens, it would be effective in showing the turmoils of their lives in 1962. The acting is great, the cinematography and directing are effective, and the characters are very engaging. Where this film failed, and the reason it lost 3 stars in my estimation, is in that it exploits the tragedy of the Kitty Genovese murder for no purpose other than to attract viewers. The attack is barely addressed at all, and there are huge holes in the story once \"it\" begins. Now, there's nothing wrong with making film based on, or inspired by, true events. However, this film does nothing for the story or what truly happened on that day to merit its use of those events as a way to draw an audience. There are a lot of lessons to be learned from what happened that night, and if this film addressed those issues, it would be a legitimate tribute to Ms. Genovese and would at least teach the audience about the bystander effect. Instead, this film does not teach anything as most of the characters, except one, are completely unaware that anything was happening (for different reasons). Shame on whomever used this tragedy as a marketing ploy.",
         "When I'm lying on my deathbed 1 of regrets in life will be the 120m I've wasted on this trash! I'd seriously rather jerk off with with sandpaper than revisit this BS. Seriously it was a hr of watching a story develop for it to suddenly end with just the neighbors closing the blinds and police lights in the background. The murder/rape was hardly even referenced. I rarely write reviews but i felt it necessaried to save the rest of the world 120m of their lives they'll never get back!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Regner Grasten Film",
         "Game 7 Films"
      ],
      "summaries": [
         "\"37\" is a powerful drama and a fictional account of the night Kitty Genovese was murdered in 1964, Kew Gardens, Queens, where 37 neighbors witnessed the killing and did not intervene. \"37\" examines the lives of a group of families during the day and night of a tragedy that shocked America.",
         "'37' is a powerful drama and a fictional account of the night Kitty Genovese was murdered in 1964, Kew Gardens, Queens, where 37 neighbors witnessed the killing and did not intervene. '37' examines the lives of a group of families during the day and night of a tragedy that shocked America."
      ],
      "budget": 0
   },
   "movielensId": 165175,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-11-17",
      "dvdReleaseDate": null,
      "directors": ["Puk Grasten"],
      "runtime": 85,
      "movieId": 165175,
      "title": "37",
      "mpaa": null,
      "actors": [
         "Christina Brucato",
         "Michael Potts",
         "Maria Dizzia",
         "Jamie Harrold",
         "Thomas Kopache",
         "Adrian Martinez",
         "Samira Wiley",
         "Lucy Martin",
         "Don Puglisi",
         "Mario Israel",
         "Sophia Lillis"
      ],
      "imdbMovieId": "4882174",
      "originalTitle": "37",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "WWxs_OIdTf8",
         "BaY-Bafjngw"
      ],
      "plotSummary": "On a March night in 1964, 37 neighbors in Queens, New York, witness the brutal murder of Kitty Genovese. None of them takes action or calls the police. 37 tells the story of a few of these people and what led up to the night when they unexplainably remained passive observers. The film is a convincing portrayal of a borough in change and a time characterized by racism, the Civil Rights Movement and political shifts. The actual event that inspired the film’s plot has been called a symbol for the moment when America lost its innocence. The director Puk Grasten skillfully weaves into her feature film debut various fates, dreams and family conflicts by leading us through an apartment building that comes to bear a collective failure.",
      "tmdbMovieId": 356895,
      "avgRating": 2.75,
      "releaseYear": "2016",
      "numRatings": 4,
      "posterPath": "/yNQvmwsfBzVfHbKtnISw1RuwWXF.jpg"
   }
}