{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "radio dj",
            "id": 208930
         },
         {
            "name": "hall of fame",
            "id": 208931
         }
      ],
      "imdb_id": "tt0120303",
      "video": false,
      "title": "Telling Lies In America",
      "recommendations": [
         25576,
         26176,
         40506,
         33379,
         27141,
         49803,
         14167,
         20863,
         61418,
         24275,
         33135,
         35886,
         13571,
         15720,
         15503,
         77223,
         46989,
         39806,
         97313,
         91930
      ],
      "backdrop_path": "/34MfrPkkfzYHKGN89L7FbHrlFtA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Billy Magic",
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d127",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Karchy 'Chucky' Jonas",
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d12b",
               "name": "Brad Renfro",
               "profile_path": "/t97fjAtDrBHTv9ABwwwHDzdKtpo.jpg",
               "id": 51214,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Dr. Istvan Jonas",
               "gender": 2,
               "credit_id": "547a3ae3c3a36835be000521",
               "name": "Maximilian Schell",
               "profile_path": "/xhjyQpOmwDwU48Kq2b1XCEO9G7E.jpg",
               "id": 12150,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Diney Majeski",
               "gender": 1,
               "credit_id": "547a3af29251417bd7000d96",
               "name": "Calista Flockhart",
               "profile_path": "/5aakb4I8YROp58LbCtie23SylxB.jpg",
               "id": 49148,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Father Norton",
               "gender": 2,
               "credit_id": "547a3b01c3a368737f000680",
               "name": "Paul Dooley",
               "profile_path": "/rnzvqo7oR2IwSfN2Ayh3ysc4WNt.jpg",
               "id": 15900,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kevin Boyle",
               "gender": 2,
               "credit_id": "547a3b109251412986002cc6",
               "name": "Jonathan Rhys Meyers",
               "profile_path": "/A6RyyQ4GeXl0ugnGrqGqBMQIgKh.jpg",
               "id": 1244,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Henry",
               "gender": 2,
               "credit_id": "547a3b1f9251412986002cc9",
               "name": "Luke Wilson",
               "profile_path": "/n7CRA7h1z3FVOzBJ5EjfSrPQbvl.jpg",
               "id": 36422,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d131",
               "name": "Guy Ferland",
               "profile_path": "/nfDOPMhegfSlQMAVHfR3M8Grxfl.jpg",
               "id": 43468,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "547a3ad49251412990002e56",
               "name": "Joe Eszterhas",
               "profile_path": null,
               "id": 10492,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.733579,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63437,
      "vote_count": 8,
      "budget": 0,
      "overview": "Karchy (Brad Renfro) is a boy in school who has moved from Hungary to America in the 1960's. He is struggling in school and trying to adjust to America's culture. He then hears about a radio DJ Billy Magic (Kevin Bacon) who holds a contest for a Student Hall of Fame every week. When Karchy finally wins after several weeks, he spends more time with Billy Magic...a man with money, girls, and glam. Karchy thinks that by spending time with Magic, he can become \"cool\". He then starts telling lies, to make himself seem greater than he really is. But when his lies begin hurting the people he cares about, he realizes that it isn't worth telling lies if it affects your friends. Afterwards, he learns to accept himself for the person he is, and gives up lying. And as for Billy Magic, it turns out that he pays his price for all the lies that he has told as well.",
      "similar": [
         858,
         949,
         801,
         838,
         44639,
         75656,
         4547,
         1585,
         7345,
         251,
         15,
         55,
         104,
         539,
         275,
         3933,
         59440,
         968,
         318846,
         60243
      ],
      "original_title": "Telling Lies In America",
      "runtime": 101,
      "poster_path": "/e5NBW6ztg1ZHqW8PZHfe2JTxMBS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kuzui Enterprises",
            "id": 2516,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Banner Entertainment",
            "id": 38764,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ben Myron Productions",
            "id": 39836,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-02",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Just don't get caught.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Guy Ferland"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Joe Eszterhas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120303/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQwOTQxMTM4M15BMl5BanBnXkFtZTcwOTIzNzUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Bacon, Brad Renfro, Maximilian Schell | See full cast and crew »"],
      "reviews": [
         "Yes, I live in Northeast Ohio, but that's not the only reason I truly enjoyed this movie. The daughter of an acquaintance, 'Giggly Girl' Angelique Osborne, had a tiny part and I originally watched to see her. Now every time Bravo plays this movie on IFC Fridays, the phone comes off the hook, the popcorn is popped and I get good and comfy. The sentiment portrayed here, although it's roughly 15 years before my time, pulls me right in. The struggles of wanting to feel important (or at least to fit in), where to draw the lines of loyalty and figuring out what makes any of us happy are timeless. It never occurs to me that I'm watching Kevin Bacon or Brad Renfro. They become their characters. (Kevin Bacon proves he has a range most people don't realize and Brad Renfro, although beautiful to look at, also has that un-namable quality that makes you feel you're watching a future legend. Let's pray he finds his way safely.) Just as you never think about the set or the camera during a genuinely good movie, all the components of Telling Lies in America flow beautifully. After reading some of the other reviews here, it seems some people can't be entertained with a good story and good acting. Some movies don't have to resort to the typical Hollywood recipe in order to leave a positive imprint in your mind. Too bad you have such a short attention span.",
         "This is a charming movie that touches upon payola in the 60's. Bacon takes money for overplaying a song on radio, thus boosting its ratings, and uses Renfro as a go-between for these dealings so that the money never goes direct from sponsor to Bacon. After a while Renfro becomes bolder as some of Bacon's attitude rubs off on him. He starts lying about his background, car and things he's done to impress those around him. But he finally quits when he realizes that these 'white' lies hurt as well as the 'black' ones. When the FBI decide to pressure Renfro into giving evidence against Bacon by speaking to the judge during his naturalization proceedings, things take an interesting twist as the judge, before the proceedings, speak to Renfro alone and have a little chat about George Washington and the cherry tree. Won't spoil it by telling you what it is, but watch and find out, as it has a bearing on the movie as well. Calista Flockhart puts up a pretty convincing performance as well.",
         "\"Telling Lies in America\" is a film that seems to have gone directly to video. It certainly deserved a wider audience because what Guy Ferland, the director does with the screen play Joe Eszterhas wrote for the film. Mr. Eszterhas is a man that can write, although some of his efforts have misfired. If you haven't seen the film, perhaps you should stop reading here. The basic problem with the film is the casting of Brad Renfro as the main character of the film. While this actor is not a bad actor, he seems miscast as this Karchy Jonas. Most comments in this forum focus on the fact Karchy has no accent, but having been in Cleveland for about seven years, explain that he already has a command of the language. Yes, he might stumble upon certain words, as shown in the film, but basically the character is believable. The only thing is that Mr. Renfro looks an older fourteen, rather than the seventeen he is in the film. This fact becomes painfully apparent in his relationship with Diney, and with the older woman Billy decides to have him experience sex for the first time. We are not saying it's not possible, because it can easily have been the case, which might have been derived from an experience of Mr. Eszterhas life. The other thing that doesn't ring true is the relationship between Karchy and his father. It appears that he can do whatever he wants and it's OK with the old man. Usually in the case of immigrant families, it's just the opposite. People immigrating to this country tend to be more protective, demanding discipline and obedience that is nowhere to be seen in the film. Also, Karchy's behavior in school would have probably grounded him forever, but it never comes into play. The marvelous Kevin Bacon is the best asset this film has going for itself. Not only is Mr. Bacon the most versatile of the current actors working in films, he brings such an intelligent take to his take on Billy Magic, the DJ of the local radio station that sees right through the lies Karchy Jonas tells. Being a liar himself, Billy can pick a liar whenever he sees one, as is the case when he meets Jonas. Billy Magic has no scruples. He takes money from the record companies, but he has Karchy pick the envelopes. The cast is good. Maximilian Schell, plays the father, Dr. Jonas, a man so decent, one wonders where did Karchy go wrong. He seems to be a loving father, albeit a distant one. Is it perhaps the fact that the son has embraced the American culture with too much gusto? That might explain the difference, although Karchy is never disrespectful to the old man. Calista Flockhart is seen as Diney, the mousy worker at the poultry shop where young Karchy works after school. Ms. Flockhart is perfect as the older girl that inspires love in the young man. Luke Wilson is seen as the man in charge of the shop. Paul Dooley makes a wonderful Father Norton, the man who dares put Karchy in his place. Notable in the film is the use of the popular songs that one hears in the sound track. It made perfect sense the use of those tunes since the background is a popular radio station that catered to teenagers. This is a film that should be seen by more people because of the good work the director and screen writer have done.",
         "Interesting and well done look at the American pop scene in the sexy sixties. Featuring a oversexed, insecure loser named Karchy who teams up with another oversexed loser disc jockey intent on preying and playing just one more gig in the nowhere business of top 40 music. The charismatic DJ, a burned out cynic, has a history of using unpopular teens to make illegal profits or to cheat them in business deals; which, of course, continues as he rolls into a new town amid a flurry of excitement and adulation. As the rollicking DJ and the impressionable teen play out their drama, another is occurring as Karchy tries to woo an older woman who, for some reason, shows an interest in the love struck teen. Different from most of the gunk coming out today: well worth seeing.",
         "Yes, the movie deals tangentially with the payola scandals of the 50's (truly a big problem in the entertainment industry), but only as one of the many lies hinted at in the title. The two main characters (Renfro and Bacon) do *nothing* but lie. They are balanced by the purity of the other characters (Flockhart and Schell). Schell's character was a little underwhelming and the work by Renfro was, at times, uneven, but both were generally excellent. My only other quibble was with the settings of the film. As a Clevelander (where the story takes place and the film was shot), it's easy to understand the where the scenes took place and how the story was built around them, but I'm not sure that an \"outsider\" would understand the implications to the story of those different locations (the neighborhoods, the market, etc.). The real find is Calista Flockhart. She gives a wonderfully nuanced performance, sweeter and deeper than anything you'll see on Ally McBeal. Interestingly, Flockhart spent time working on stage at the Cleveland Playhouse, so was well-suited for the role in a way. Joe Eszterhas is not exactly known for his subtlety, but this movie is a small triumph for him and portends better things from his pen in the future.",
         "In the early 1960s, Cleveland, Ohio immigrant teenager Brad Renfro (as Karchy Jonas) struggles with adolescence and assimilation. Mr. Renfro is working on eradicating the remnants of his Hungarian accent (his \"th\" sound). Meanwhile, slick disc jockey Kevin Bacon (as Billy Magic) arrives in town (one step ahead of the law), to spin \"sweaty collar and dirty fingernail music\" on the local rock 'n' roll radio station. Mr. Bacon is a payola player, who needs an underage kid to handle money illegal exchanges. When Renfro cheats on a radio contest, Bacon offers him big bucks to serve as \"unwitting accomplice\"... Bacon swaggers through his role with perfection. And, Renfro is incredible, in a very difficult role; capturing the vulnerability of youth, as he struggles to both adopt and resist Bacon's seductive persona. Calista Flockhart (as Diney Majeski) is very effective, as Renfro's \"older woman\" love interest. Their performances should have received some award consideration. Maximilian Schell (as Istvan Jonas) would have been more believable as Renfro's grandfather, to support the obviously wider than envisioned cultural gap between the characters. A few of the scenes are silly, but many more work, due to director Guy Ferland and his convincing cast. \"I make things up sometimes,\" Renfro reveals. Don't we all. \"Telling Lies in America\" certainly breaks no new ground - but, it revisits cinematic themes in great style. The film builds to a fine conclusion, and the music is terrific. ******** Telling Lies in America (8/2/97) Guy Ferland ~ Brad Renfro, Kevin Bacon, Calista Flockhart, Maximilian Schell",
         "Why this little gem didn't get major studio distribution is a real mystery. One terrific performance (Kevin Bacon)four very good ones (Maxmillian Schell, Calista Flockhart, Paul Dooley)and a solid, if not totally convincing one from Brad Renfro (where's the TRACE of an accent?) coupled with a right on script by Joe Eszterhas (rarely has the era been so well captured) makes for a surprisingly entertaining and accessible movie. No where does the movie cop out. The ending is convincing and slightly bittersweet. The dilemmas faced by the underpaid, exploited disc jockeys (in fact, most members of the musical profession) of the era is thoroughly examined. This is a great movie. Can you believe I got it as a bonus with my DVD MPEG Decoder card? Hey, see it for the CARS if nothing else?",
         "I'll try not to repeat all of what the other reviewers have written already. Kevin Bacon is unbelievable in this role, he wears his part as a slick, sexy, supremely confident and laid-back DJ so well. He makes it impossible to imagine any other actor in this role. Every scene he appears in is to be savored. His voice is ideally suited for the broadcasts he makes. Seeing his easy charm and friendly manner is no wonder the young, innocent Kartchie idolized him. Visually, the movie is beautiful, rich, with a great soundtrack, excellent screenplay, in short, 100% enjoyment. Very nicely photographed, with very good sound direction.",
         "You know in another time and in another age in Hollywood the story told in Telling Lies In America about the Fifties and the age of payola might have had Brad Renfro's character be a populist hero if it were Frank Capra doing it. Billy Wilder or Preston Sturges might have made Kevin Bacon's character one of their acid studies in cynicism. As it is Telling Lies In America is a good film with an accurate depiction of the times it's set in. But it falls way short of a classic. Brad Renfro plays a 17 year old high school student, a refugee from the Hungarian Rebellion with his father Maximilian Schell who would desperately like to fit in. The father who was a doctor in Hungary now working some menial job while waiting his citizenship spends a ton of money to get Renfro into some private Catholic school. Still with all the handicaps of an immigrant, Renfro who's now deep in America's rock and roll culture hits on a plan to gain instant popularity. Some radio station with disc jockey Kevin Bacon is running a popularity contest, the high school hall of fame. If someone has friends write in postcards suggesting a person they get into this high school hall of fame. So what does Renfro do, but forge a bunch of postcards and he gets his entrée with Kevin Bacon who offers him a job as an assistant, basically a glorified go-for. Of course it's all one big scam because Kevin Bacon is hip deep in the world of payola where he accepts all kinds of favors in sealed envelopes from agents to play their artist's records on his show. What he needed was a kid naive enough not to question what's going on around him and just be grateful for the relatively large amounts of money he's earning with Bacon as opposed to Renfro's previous job in a poultry market. It was the Fifties and I well remember a lot of rock and roll disc jockeys losing their careers over this, the most famous being Alan Freed. Kevin Bacon who has made a good career in villainous character parts is one cynical creep in this film. Two generations before, Kirk Douglas would have gone to town on this role. Maximilian Schell should also be praised as the wise father who because of the generation gap has different ideas about the American dream than Renfro. But there's no mistaking the bond these two have for each other. Telling Lies In America has a lot of good elements and it's an interesting story. But it's short of a master director to make it a classic.",
         "I definitely agree with those who think this is one of the best films of 1997. Great for Kevin Bacon fans. He is excellent as an AM rock DJ with a questionable past. I cannot believe Brad Renfro is only 16! He is already a skilled actor. Captures the late fifties very well. Those who remember the songs will love the soundtrack. A great collection of classic rock hits. Catholic school grads will also identify with Renfro's character and his predicament. The addition of Maximillian Schell is an added bonus. This is especially recommended for people who like good stories set in accurately depicted historical settings. I can't help but wonder if it is partly autobiographical for author Joe Esterhasz, who certainly redeems himself with this script."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Banner Entertainment",
         "Ben Myron Productions",
         "Kuzui Enterprises"
      ],
      "summaries": ["Karchy (Brad Renfro) is a boy in school who has moved from Hungary to America in the 1960's. He is struggling in school and trying to adjust to America's culture. He then hears about a radio DJ Billy Magic (Kevin Bacon) who holds a contest for a Student Hall of Fame every week. When Karchy finally wins after several weeks, he spends more time with Billy Magic...a man with money, girls, and glam. Karchy thinks that by spending time with Magic, he can become \"cool\". He then starts telling lies, to make himself seem greater than he really is. But when his lies begin hurting the people he cares about, he realizes that it isn't worth telling lies if it affects your friends. Afterwards, he learns to accept himself for the person he is, and gives up lying. And as for Billy Magic, it turns out that he pays his price for all the lies that he has told as well...."],
      "budget": 4000000
   },
   "movielensId": 1651,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-02",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Guy Ferland"],
      "runtime": 101,
      "movieId": 1651,
      "title": "Telling Lies In America",
      "mpaa": "",
      "actors": [
         "Kevin Bacon",
         "Brad Renfro",
         "Maximilian Schell",
         "Calista Flockhart",
         "Paul Dooley",
         "Jonathan Rhys Meyers",
         "Luke Wilson"
      ],
      "imdbMovieId": "0120303",
      "originalTitle": "Telling Lies In America",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": ["XhrT0SD69EQ"],
      "plotSummary": "Karchy (Brad Renfro) is a boy in school who has moved from Hungary to America in the 1960's. He is struggling in school and trying to adjust to America's culture. He then hears about a radio DJ Billy Magic (Kevin Bacon) who holds a contest for a Student Hall of Fame every week. When Karchy finally wins after several weeks, he spends more time with Billy Magic...a man with money, girls, and glam. Karchy thinks that by spending time with Magic, he can become \"cool\". He then starts telling lies, to make himself seem greater than he really is. But when his lies begin hurting the people he cares about, he realizes that it isn't worth telling lies if it affects your friends. Afterwards, he learns to accept himself for the person he is, and gives up lying. And as for Billy Magic, it turns out that he pays his price for all the lies that he has told as well.",
      "tmdbMovieId": 63437,
      "avgRating": 3.06051,
      "releaseYear": "1997",
      "numRatings": 157,
      "posterPath": "/e5NBW6ztg1ZHqW8PZHfe2JTxMBS.jpg"
   }
}