{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "superhero",
         "id": 9715
      }],
      "imdb_id": "tt1472584",
      "video": false,
      "title": "Max Steel",
      "recommendations": [
         262841,
         308531,
         305470,
         324670,
         354556,
         346808,
         403232,
         262982,
         384737,
         331313,
         408220,
         287948,
         262169,
         2102,
         205584,
         273756,
         16268,
         346079,
         44181,
         14666
      ],
      "backdrop_path": "/mH1DfgSjHxaxmO1RyxS9zZYtt4i.jpg",
      "revenue": 6272403,
      "reviews": [{
         "author": "Reno",
         "id": "58b33f7192514177b000b3c7",
         "content": "**A new kid on the block with the superpower.**\r\n\r\nI am not saying the film was terrible, but the timing was bad. There are loads of great sci-fi films were made recently and still coming out. So to compete with them, they have to go through alteration, even if they loose the origins of their film's theme concept. This story is same as many similar themed flicks. For me, it looked like a mini Superman film, but made for kids.\r\n\r\nThe best thing about it was, keeping everything simple. And then the pace, which actually somewhat saved the film. I hooked to it from the beginning till the conclusion, but familiarity is what killed my interest and entertainment. The characters were okay, not developed well enough. But keeping young audience in mind, it does good. Because going deep is unnecessary stretch.\r\n\r\nThe story of a high school boy who transferred back to a small town where has born. As he begins to hear a lot about his father from the local people, he becomes motivated to know more about him. But one day when something goes wrong, the next day he wakes up with great power. Not knowing how to handle it, he befriends with an unusual creature and together they fight those who are after them.\r\n\r\nInitially I thought it was related to 'Real Steel', but realised only while watching it it is completely different. From the director of 'Sorority Row', I think he did nothing wrong. Those who watch less films would enjoy it better. Visually okay, with all those graphics. Since it is PG13, I would say the target audience is the little ones. So from their perspective, it is acceptable. But I warn the grownups, stay away, or be like them while watching it, in order to get entertained.\r\n\r\n_5/10_",
         "url": "https://www.themoviedb.org/review/58b33f7192514177b000b3c7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Max McGrath",
               "gender": 2,
               "credit_id": "53eb37ff0e0a265f50000e6b",
               "name": "Ben Winchell",
               "profile_path": "/41kGdRerM4VZdRXux4BQ12JnxaZ.jpg",
               "id": 997369,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Steel (voice)",
               "gender": 0,
               "credit_id": "5806f493c3a3684e06011271",
               "name": "Josh Brener",
               "profile_path": "/hLZam8XDVqkjxBBhLE0TjjugqkM.jpg",
               "id": 1180979,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Sofia Martinez",
               "gender": 1,
               "credit_id": "5806f49c9251415ab0011401",
               "name": "Ana Villafañe",
               "profile_path": "/kBtzeyhOPlvxBCocbrk3RCjrrFy.jpg",
               "id": 1061053,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Dr. Miles Edwards",
               "gender": 2,
               "credit_id": "53eb38100e0a265f42000e77",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Molly McGrath",
               "gender": 1,
               "credit_id": "53eb38070e0a265f50000e6d",
               "name": "Maria Bello",
               "profile_path": "/tFkbad0JoWvYc6XYBITv6EfeLwR.jpg",
               "id": 49,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Agent Murphy",
               "gender": 0,
               "credit_id": "5806f4a39251415bbe00fc93",
               "name": "Billy Slaughter",
               "profile_path": "/5YykEE15cNzgexL7d5ewAu5M8XN.jpg",
               "id": 62784,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Jim McGrath",
               "gender": 2,
               "credit_id": "53eb38190e0a265f49000dad",
               "name": "Mike Doyle",
               "profile_path": "/bO1QCPRvbKu8ZxlbQDgjlncWcCn.jpg",
               "id": 27107,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Attentive Kid",
               "gender": 2,
               "credit_id": "5a54e50e0e0a2607e0010e95",
               "name": "Brandon Larracuente",
               "profile_path": "/tFQirOLL2dtQ1A0QXdQbTyRfnfK.jpg",
               "id": 1711179,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53ec7644c3a3682ac800099b",
               "name": "Christopher Yost",
               "profile_path": "/6v1wkHdEAuwD8M8i0yWa3LYvoxS.jpg",
               "id": 109542,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53eb383c0e0a265f42000e7f",
               "name": "Stewart Hendler",
               "profile_path": "/fEtto46PxSZjRrAZnfZPB5wKY3f.jpg",
               "id": 130837,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57125d5a9251413031000af6",
               "name": "Mark Edward Wright",
               "profile_path": null,
               "id": 1407019,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac41455c3a3682d1a03e62f",
               "name": "Daniel Hargrave",
               "profile_path": "/iLjQxDKgMP3Ou8T59800KSyyt0v.jpg",
               "id": 1825883,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 10.137009,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 286567,
      "vote_count": 296,
      "budget": 10000000,
      "overview": "The adventures of teenager Max McGrath and alien companion Steel, who must harness and combine their tremendous new powers to evolve into the turbo-charged superhero Max Steel.",
      "similar": [
         1924,
         1452,
         99861,
         155,
         141052,
         8536,
         9531,
         40662,
         379291,
         13640,
         1771,
         24428,
         272,
         364,
         49521,
         100402,
         299534,
         209112,
         11253,
         297762
      ],
      "original_title": "Max Steel",
      "runtime": 92,
      "poster_path": "/inFoGkUfzg56iuTBVDifzTq7jVx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mattel Entertainment",
            "id": 49983,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dolphin Entertainment",
            "id": 53592,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ingenious Media",
            "id": 290,
            "origin_country": "GB"
         }
      ],
      "release_date": "2016-10-14",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stewart Hendler"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Christopher Yost"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1472584/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTk2MTMwOTk3N15BMl5BanBnXkFtZTgwMDI5OTYxMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Ben Winchell",
         "Josh Brener",
         "Maria Bello"
      ],
      "reviews": [
         "Make no mistake, Max Steel, the Mattel toy property, turned Cartoon Network staple, turned full length movie has become the worst reviewed wide-release film of 2016. After a single weekend, the movie has garnered a staggering Metascore of 26, and a 0% on Rotten Tomatoes. Those are scores usually reserved for direct to DVD video game adaptations and the occasional Pauly Shore movie. I'll admit with so many metrics stacked up against it, my interest both as a critic and a connoisseur of junk cinema was piqued. I wanted to hate this movie; I came in with the expectation that this movie was a special kind of crappy. But alas it's just the regular kind of crappy. The plot of Max Steel promises the adventures of a middle-America teenager named Max (played by perennial kids-TV bit-player Ben Winchell) and his alien companion named Steel. Due to Max's seemingly inexplicable ability to conjure energy on a molecular level, Steel acts as a symbiotic techno-parasite consuming it with relative safety. In return, Steel (voiced by Josh Brener) enhances Max's physical abilities and protects him with a laser spewing bio- tech suit. Little does Max know that his new friendship with his alien buddy upsets a certain celestial balance, that holds the future of our world in the hands of a sinister enemy. The plot promises these things but in an election year, we should all be wary of false promises by now. While watching Max Steel I was less concerned about the fate of the world than the fate of those involved in this project and made the mistake of taking it seriously. The film co-stars award nominated actors Maria Bello and Andy Garcia whose natural gravitas threatens to give Max Steel more weight than your average Smallville (2001-2011) knockoff. I understand that veteran actors need to eat but most actors should draw the line when asked to put on a half-assembled Power Rangers outfit. The film itself is a cheap, shabby, impotent mess that tries oh so hard to ape the grungy self-serious aesthetic from recent superhero fare. But instead of finding a balance between pretension and moment- focused excess, the camera diddles through colorless scenes that look like they were shot through a layer of cellophane and Vaseline. This of course is when we get exteriors of antique pickup trucks chugging through amber-waved back-roads. When it comes to the heavy climaxes, the movie seems poised to give us the same blighted industrial zones we've seen in everything from low-budget horror movies to late-period Steven Seagal flicks. Only this time it's lighted like a neighborhood Zap- Zone to give the film's target audience (mainly toddlers and their misguided gamgams) the desire to whip out their video games. It's all so genuinely and quite unpleasantly sad to see a movie like Max Steel. Watching bloated, intelligence insulting, big-budget fare fall flat can give anyone a sudden jolt of schadenfreude. Yet watching something whose only real crime is being too big for its britches, well it's just not that much fun. The film and its makers are trying to mimic a certain style, a certain flow, a certain spirit yet it simply have none of the right tools to do so. So they patched this puppy up with as much exposition, flashbacks and Josh Brener inspired wisecracks to trick you into thinking it was all worth it. But it's not, it's really, really not. Max Steel is like going to the zoo, visiting the tiger exhibit and seeing a tiger born and raised in captivity. Many people arguably worked their best on this film, but because their best is inspired by the limited cultural echo chamber of comic books, blockbuster movies and Halo, we get a movie that lazes about, the fierceness in its eyes completely absent.",
         "One of the worst super hero movie of 2016. Extremely slow to tell a story, no action (except for the last few mins of the movie), too many annoying flash back. Seem like the director wasn't sure if he wants to make a sci-fi movie, chic flix, or comedy.. it turns out to be a big mess that drag on and on. People walking out in the middle of the movie, if it wasn't for my 11 year old, I would have done the same.. After the movie, my 11 year old even comment how bad the movie was! Here's an example of how slow the movie was.. the first min. of the movie, it also indicate Max has super power, it took about 30 mins of the movie to finally confirm his super power. Then another 40 mins of the movie to talk about nothing much with flash back.. and finally 5 mins of action (fight scene) to beat the bad guy. When you think it's all over.. they spend another 15 mins to put some unnecessary romance and filler to make the movie 92mins long, so that you don't think the movie is being too short.",
         "I actually enjoyed this. After reading a few reviews I expected it to be really slow and boring but was pleasantly surprised. Sure it took a little longer going places than some of the rushed non-stop explosion fests available but that's why I liked it. It felt like it was it's own film and not just a carbon copy of all other superhero style films out there, it actually took time to build a sense of mystery and develop the characters rather than just rushing from one plot point to the next. I felt like I got to know the main character and was intrigued to see more of the movie universe unlike many forgettable action/sci-fi movies out there. If you go into the film expecting non-stop action sequences go watch the avengers, if you want something with a little mystery and gradual exploration of that mystery watch this",
         "Was it great, nah but it was a fun ride and it WAS NOT A REMAKE OF THE CRAPPY SHAQ FILM. Max Steel was a kids series a few years back now being brought to the big screen: http://www.imdb.com/title/tt2748608/?ref_=fn_al_tt_2 Shaq's film was based on John Henry Irons AKA Steel from DC Comics that came to prominence when the Death Of Superman run was in full swing: http://www.imdb.com/title/tt0120207/?ref_=fn_al_tt_1 The reviews that I've read for the \"racist remake!\" or the \"Whitewashed retelling of a Black man's story!\" are baseless and ridiculous. Was the film Oscar worthy...Hell no it was for kids, tweens and ol Max fanboys that liked the cartoon...Cool CGI & fun. And to qualify, I am Black. I am 100% dedicated to what's good for Black people and I am 100% for the truth and honesty for all of us...Peace & love all!!!",
         "Well, I was completely disappointed. The only tip I can give to y'all is the movie, \"Max Steel\", is similar to \"Power Rangers\". Therefore if you are still into or starting to like those series, then go for it. Otherwise if you're trying to find a good time, this will make you cry tears in despair. Likewise, if you're a viewer like me who wants to explore, you'll probably enjoy the beginning, but puke toward the end. Here's some details into why the movie isn't a success for me: The protagonist is arrogant The villain is arrogant (oh... they're supposed to?) The movie skips a lot of character build ups Finally and most importantly... yelling solves EVERYTHING!!! These would be great in books/novels, but doesn't help movie production.",
         "I remember a cartoon that pretty much was the same deal, except that cartoon more had a base on action sports which was what I was expecting with this film but as it turns out there was another more recent cartoon, this movie was based on. Max is a kid who moved around a lot and he discovers why when he moves to the place were his mom and dad met and it triggers the energy spectrum that gives him super powers. The formula was straight forward and it should have worked but all it did was doze me off, literally snoozing. Thought the movie did have some interesting surprises, but I spent most of the flick trying to keep my eyes open to pay too much attention. Will say I enjoyed Andy García's role in this film. Far different than anything I've seen him in before and he most likely did it cause it was fun to do and he looked like he had fun. So that was enjoyable. Max Steel could have been so much better, but it's not. So it's not worth watching. Should have based it on the 1st cartoon I guess.",
         "Max McGrath (Ben Winchell) doesn't know much about his respected scientist father who died in a mysterious storm. His mother Molly (Maria Bello) brought him back to his father's old stomping grounds on the advise of colleague Dr. Miles Edwards (Andy Garcia). Max is a loner at school except Sofia Martinez befriends him. He's having strange effects and visions. Then an alien Steel escapes from his father's old lab and joins him. Max is emitting tachyon energy which, joined with Steel, is used to form the superhero Max Steel. Steel is an Ultralink alien and they end up battling other Ultralinks threatening to destroy the world. I wouldn't say that this is horrible or irredeemable. It's simply weak stuff. Firstly, the Mattel name does not fill me with confidence. While Marvel and DC have gained credibility through some good work on the page and on the screen, Mattel has no such background. The very name denotes cheesiness on the big screen. I don't know anything about this IP's origins. The story is nothing special. There are a couple of first rate actors. There are a few twists. One is obvious from the start. Another one is head-scratching and less than reasonable. As an origin story, this is no Spider-man, Batman, or Superman. It's really another Young Adult movie at its heart and not terribly good even on that level. There are a few too many problems to overlook.",
         "Alright so those thinking that this is a remake of Shaquile o Neal's Steel, they are wrong. First of all Steel and Max Steel are two different characters. Steel is a character from DC Universe and goes by the alias of John Henry Irons, and Max Steel's real name is Max McGrath and belongs to Mattel. This is an entirely new movie and character. But overall the movie is great! The film is based on the reboot of the series rather than the original one from the year 2000 and it shows Max McGrath's origins into becoming Max Steel. The movie is great and the special effects are awesome. However you should watch it yourself to judge it.",
         "You know those horror movies that start with a bunch of kids going away to have fun in a cabin in the woods and it takes about five minutes to know everything that will ever happen to them? It's like that, but lame sci-fi. It starts with the single mom moving back with her teenage son to their home town. He is young, sexy, but vulnerable and he's got superpowers and a friendly alien that he didn't know about. Oh, and a girl that is all but stalking him in order to be his boyfriend. And the mother knows something, but doesn't prepare him one bit, because he might not be ready. And the alien is amnesiac. So in order to be a bit interesting, they plug in a villain. A lame villain that makes no sense and has zero character development. In fact, that's the feeling you get from the movie as a whole: plug and play. Every piece of it, be it plot, special effects or actors just some refurbished bit of crap from some other film in the genre. It is worse than a failure, it is something that they made knowing it had no value. The more I think about it the lower I want to rate it, so I stop here.",
         "Based on an earlier review I saw on this movie (I'm hoping it was a joke, because it was seriously off the mark) I felt obligated to post an honest review! I went to see this movie tonight with my two boys who are 12 & 9 years old. They are both HUGE fans of the Max Steel cartoon that was out a couple of years ago that this movie is quite clearly based on. They both loved the movie & were so bummed when it ended. We are all 3 hoping this becomes a series & has at least 1 or 2 more movies to further develop the story. And, being a nerdy, comic book/super hero/sci-fi/fantasy fan, I enjoyed it myself! Good clean movie, a bit intense in some scenes with a \"Tornado\", and one \"almost\" swear word, but otherwise a good movie for kids!",
         "I downloaded this for my son who loves the animated series. I watched it in super fast motion to see if it will hold his attention. At 55 minutes you finally see Max's armor. He gets hit once by a... I don't know... some creature and the suit disappears. 17 minutes later, he gets his suit again and dukes it out against another dude in an armored suit. Didn't need to watch the fight scene. I can tell that this movie will hold the attention of a child for about 17 minutes, only because they can't wait to see Max Steel in his armor fighting creatures like in the series. Alas, it is a big pile of poop. I was watching at 10x speed and was still bored. Sad. What a waste. They should have made a 2 hour animated movie.",
         "Well lets take it one step at a time. 1) the movie starts well with a mystery going on around our main character and a good enough introduction of the rest of the characters. 2) the plot is good but it doesn't fit only to one movie so i hope for another one. 3) the end, well i am not gonna spoil this but the movie prepares the audience for the end (that makes the movie predictable -ish) but who doesn't like to say \"i knew it\". I liked max and defensively loved steel, i hope there was more about the background of steel and max but i put my faith on the next movie if there is going to be any. It's a movie decent enough to go on a sequel. So i am giving it a 10 because for the kind of movie it is it's very good.",
         "Alright, this movie does kind of su@k but it doesn't su@k any less than the teenage melodramas that Hollywood has been pumping out over the years. So yeah, I'm not sure why people are rage hating on this but all I have to say is why ain't you guys rage hating on all the other garbage out there? Maybe if you guys rage hated earlier we wouldn't be in this situation. Anyway, I think this film is more for viewers under the age of 15 years old. It is better than Twilight, I'm guessing. Chances are it is just as good as most Hunger Games movies, I'm guess. Anyway, the little robot thing is cute. Yeah, that's all I got and in the end, isn't that what really matters?",
         "People claim that this movie was a bit slow, but it's the first. So it has more of a story/background to cover than some of the other 'superhero' movies. I found it funny, exciting and entertaining. Because of how poorly it did, I won't be surprised if there isn't a sequel, but I wish there was! I'd love to see more 'Steel' Give it a chance, if you are open minded and in the mood to watch something goofy we thought it was worth it. We put it on just to check it out, ended up loving it and laughing out loud constantly. I remember watching the TV show (animated) a bit when I was younger, but couldn't remember the story line. So sure if you are hardcore animated show fans, you might be disappointed. But live actions are never like the cartoon. Cheers :)",
         "Please GOD why did you let me watch this awful awful attempt of movie. the TELETUBIES had more plot than this! The truth that I can't believe someone put money to do Something so but so bad and over spend fortunes in a Global advertising campaign on the internet or movie theaters of this piece of crap That I just witnessed! Please, it is very bad, like nothing you'll ever see again! believe me it is hard to resist. Devoid of all content, plot, effects, dialogues, performances. Luckily I don't think that they make a second part even if they put it on SiFi after sharknado 7",
         "This movie was pretty good, people who are saying this is a remake of Shaquille Oneal's movie Steele is completely wrong this movie has nothing in common or anything to do with the movie called Steele. First off the movie called Steele with Shaquille Oneal completely sucked and bombed and Max Steele is based on a cartoon called Max Steele and is 10x better than the crap movie called Steele. Max Steele has been a cartoon since 2001 and I have been waiting for a movie about the cartoon series. Of course it's going to not be a great movie but it is a good movie for families to watch. Maybe a console game would be good but not based on the cartoon.",
         "The adventures of teenager Max McGrath and his alien companion, Steel, who must harness and combine their tremendous new powers to evolve into the turbo-charged superhero Max Steel. Let me start this review by saying that i had no anticipation for this movie because the trailer was weird and mediocre and i didn't know how it was going to turn out because i'm not a really big fan of this version of Max Steel it's like Power Rangers meets Iron Man and we have this, i mean everyone remembers the old Max Steel with the weapons and lasers from the 90's and that villain who wore his face as a mask and his actual face looked like a Terminator rip/off but they chose to go with the modern version and i get it because half of this kids don't even know who Max Steel is and judging by half of this reviews many people thought this was a remake of the 1997 Steel that starred Shaquille O' Neal but it really isn't. This film had a lot of issues and the main protagonist was kinda of a retard he even goes to his computer at one moment and you see him write in google \"What Am I??????\" or even \"My Fingers throw energy\" or something along those lines, i mean really? Then when he meets Steel that space robot he asks him \"are you some kind of a robot? and you speak English?\" this film has some great lines like that and i'm not kidding. It also has some pretty weird parts where they try to built tension during a dumb dinner scene with Andy Garcia, Maria Bello and Ben Winchell and it was simply awful they went from talking to action and that continued for like 5 minutes pretty much the whole movie is a mess from the acting, to the villains to pretty much everything and once we meet our villain who turns out to be Garcia he just turns out to be another dude in a suit who wants to absorb the energy from Max's suit and explodes that's it. As for positives well the cgi was nice, the suits were good both for Max and Garcia although it was a bit disappointing that they couldn't use his suit more than just 3 scenes and the only real emotion was when they showed his dad dying and how he sacrificed himself for his son and his wife as for Maria Bello she and Steel i think were the only decent thing about this movie, Garcia seemed out of place as a villain but at least he was way better than he was in Flopbusters. To wrap this up this film had a lot of flaws and it didn't know what it was trying to be it was half of Teen Drama with Max trying to recover from his father's death and he had to face a new environment with his new School and his love interest which is a girl named Sofia Martinez (how original right?) then it tried to be an action movie and a science fiction adventure and it failed even more on that, Max Steel had some pretty good ideas and it was made only for to bring money but unfortunately it bombed on the Box Office and it brought an 0% from Rotten Tomatoes i don't think it's as bad as a 0% for me but it was still pretty bad, unoriginal and boring and i'm gonna give it an 4.0/10 you won't miss anything to be fair..",
         "Far from awful, as many reviewers would like to say, and nothing to do with the 1997 film by Johnson. Based on the Mattel toy and following cartoon series, which was in my childhood a firm favourite. I went into this film with low expectations, but I came out of it having enjoyed my time spent. Let me be clear, this is not an amazing film. But it is good enough to enjoy on a lazy day. The love interest is boring, the plot linear, and the film is let down by one liners that fall flat. Special effects were good, though that is something any film these days can claim. Though it is never going to be be a work of art, I enjoyed Max Steel far more than when I recently watched the critically acclaimed Captain America: Civil War (pro tip: Do not waste your time on that). Why? This film (unlike most superhero action flicks) is not saturated in a truckload of \"Merica!\" patriotic drivel, the character relationships are far from groundbreaking but they are realistic, and it is self-aware enough that it doesn't feel the need to take itself seriously every second. As Steel proclaims \"It's called Turbo Energy!\", Max just looks at him and says \"Really?\" It made me laugh, the relationship between Max and Steel was fun and realistic enough to make me empathise with them. I loved the voice acting by Josh Brenner, and Ben Winchell as Max was surprisingly good for the mediocre role of 'tween hero'. The story hinted at more to learn in the way of lore, which I think would've been great to see unfold, but sadly will not happen thanks to the commercial bomb that was Max Steel's theatrical release.",
         "I saw \"Max Steel\", starring Ben Winchell-Finding Carter_tv, A.N.T. Farm_tv; Maria Bello-Lights Out, The Mummy:Tomb of the Dragon Emperor; Andy Garcia-Ghostbusters_2016, Smokin' Aces and the voice of Josh Brener-Silicon Valley_tv, The Internship. This movie is based on a line of toys from Mattel. I am unfamiliar with the teen super hero action figures but the movie has Ben as the teen-aged son of single mom, Maria. Ben's father died years earlier but Ben doesn't know all the circumstances around his death. Ben and his mother move around a lot-I think this is their 8th or 9th move-and just as they begin to settle in from their latest move, Ben discovers a weird energy coming out of his hands. About that time, a little flying techno/organic alien shows up with some answers, but also has a little scrambled amnesia, so he doesn't have all the answers. Josh does the voice of the alien, whose name is Steel. Josh does remember that he can control the energy coming out of Ben and they sort of merge together to become Max Steel-their two names combined make their super hero name. To me, it looks like a mash up of the Power Rangers and The Guyver, especially since Ben just happens to know martial arts. Andy plays an old friend of Ben's dad that knows more than he is telling and the main bad guys are other aliens like Josh, only bigger and meaner. They look like tornadoes or maybe a small hurricane with a face and arms. It's rated \"PG-13\" for sci-fi action violence and has a running time of 1 hour & 32 minutes. It looks like a cheap attempt to cash in on a toy line and I would not buy it on DVD. I don't think I would rent it either. If you really want to see it, I would wait until it comes to cable TV.",
         "I'm baffled by some reviewers claiming that the ratings would be unfair, because they'd ignore the movie's limited budget. Let's see what Max Steel has to offer: Bad acting (Andy Garcia, wtf happened to you?). Bad script (\"I have a brilliant plan to beat the villain! It's exactly the same someone else had previously! The villain will never see it coming!\"). Dumb characters, who can't think straight forward for even a second. Annoying sidekick(s) with incredibly bad humor. At least I understand why the main character avoids listening to them. All fighting scenes are a f***ing joke. Max Steele is pure trash and that's all.",
         "I like this movie. Ýes it has humor, action and off course love the whole package. Clearly it's not for everyone.. But then again, what is?? It's such a stupid sounding, hipster kind-of statement.. -_-,. Tell me one movie that is for 'everyone'?! Then you can have my Ferrari anytime! (if i have one). Man, I love the fact that it's just plain old feel-good action movie with humor. And the idea of what you can do with this kind of tachyon energy. And well if this was a pilot, i would love to see how much more they can do with this concept. Mattel is clearly the underdog here. So if you think it's a big commercial for these toys.. well.. it's a toy from 1997.. Then they are not really doing a great job selling these things in 2016.. So.. Stop talking about \"it's not for everyone\" and it's a \"mattel commercial\".. Because i think more people will like this movie.",
         "I'm felt bad that it was not released here in my area or not in all cinemas(IN my country Philippines). I understand that most of the company theaters are reluctant to show this movie because it was unknown( Unknown artist or not well know comic stories) But when I bought a copy of this and saw the story. I would say it was awesome. Aside from the literal fantasy scenes, I was able to get lessons that can be applied and very important in life. \"Never run from your past but to face and enhance it\",\"Find who you really are and what you are capable of(in a good way)\", \"Never choose to fight alone but to fight with someone in order to move mountains\". I love the movie the movie, the comedy is there and also the actors delivered the role perfectly. Kudos to Ben and his buddy. ----- If only it was shown to all cinemas, the rate would be different because a lot of youngsters out there expecting to see this but sadly, it was not :) Thank god i was able to bought a copy of this, just now... Loving it!",
         "I have to give it more than one because my kids aged eight and nine quite liked it although the younger one did keep on saying \"when is something going to happen\". The older boy was just thrilled to see the cartoon characters come to life so tended to give the film a free pass when it came to plot and action. I do not believe that $10m was spent on this movie if it was it must have mostly gone on the licensing of the character because that money is just not on the screen. It is more like three episodes of a TV show stitched together. The pacing is atrocious the script is all over the place. They really would have been better to have just re-shot a couple of the cartoon scripts and stuck to what the kids liked about the show. I will admit I am only vaguely familiar with the most recent cartoon but did enjoy the first version which was a bright and breezy sports and spy's type series with a fair sized cast of characters for Max to interact with. This film is just a dull origin story that never gets going. I would wait until you can see it for free on TV rather than pay for it and only then if you are a fan of the character.",
         "I had never heard of Max Steel, I didn't think it was a comic book but they are running out of comic book characters to make movies out of so who knows what they will pull out next? I was bored and watched it. I'd say for the most part the movie frustrated me. It seemed like there were so many simple things that could have been done better. I wasn't crazy about Steel's voice, to me the voice was too recognizable and I couldn't get the actors face out of my mind. I wasn't very fond of the mother character, she seemed to 1 dimensional to me. I like Andy Garcia, he probably did the best job of all the actors in the movie but then again he is the most experienced. The guy who played Max is alright, he does a decent job but I did think all the shirtless scenes were a bit odd. I felt this story was too drawn out, an hour into it and I was looking at the time wondering when something interesting was going to happen. This would have been a pretty good TV pilot movie to introduce a series but as a stand alone movie it was lacking.",
         "If I was watching this in cinema, I would have left already. The movie is tagged as Action / Adventure yet 1 hr into the movie and i have yet to see an action scene. So far all i see is just a normal human being fighting with everyday life issues (his mother, his past, his girlfriend, his life). I mean so far, 90% into this movie, i have watched just a normal teenager struggling with past family matters. Is the audience supposed to be entertained by a flying toy that can talk ? Are we supposed to be entertained by a teenager that can make sort of electricity come out of his hands ? If you can count turning a car on by using his hand as action, then this movie is for you."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Dolphin Entertainment",
         "Ingenious Media",
         "Mattel Entertainment"
      ],
      "summaries": [
         "When teenage Max McGrath discovers his body can generate the universe's most powerful energy, he must bond with the only being able to contain it - a mysterious techno-organic extraterrestrial named Steel. United as the superhero Max Steel, the two friends must combat an alien menace and unlock the secrets of their past.",
         "The adventures of teenager Max McGrath and his alien companion, Steel, who must harness and combine their tremendous new powers to evolve into the turbo-charged superhero Max Steel."
      ],
      "budget": 10000000
   },
   "movielensId": 165219,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-10-14",
      "dvdReleaseDate": null,
      "directors": ["Stewart Hendler"],
      "runtime": 92,
      "movieId": 165219,
      "title": "Max Steel",
      "mpaa": "PG-13",
      "actors": [
         "Ben Winchell",
         "Josh Brener",
         "Ana Villafañe",
         "Andy García",
         "Maria Bello",
         "Billy Slaughter",
         "Mike Doyle",
         "Brandon Larracuente"
      ],
      "imdbMovieId": "1472584",
      "originalTitle": "Max Steel",
      "genres": [
         "Action",
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["FSfWGcD78v4"],
      "plotSummary": "The adventures of teenager Max McGrath and alien companion Steel, who must harness and combine their tremendous new powers to evolve into the turbo-charged superhero Max Steel.",
      "tmdbMovieId": 286567,
      "avgRating": 2.53846,
      "releaseYear": "2016",
      "numRatings": 65,
      "posterPath": "/inFoGkUfzg56iuTBVDifzTq7jVx.jpg"
   }
}