{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "volcano",
            "id": 3347
         },
         {
            "name": "volcanologist",
            "id": 7051
         },
         {
            "name": "history",
            "id": 9682
         },
         {
            "name": "worship",
            "id": 157963
         },
         {
            "name": "volcanic eruption",
            "id": 163398
         },
         {
            "name": "spiritualism",
            "id": 176561
         }
      ],
      "imdb_id": "tt4846318",
      "video": false,
      "title": "Into the Inferno",
      "recommendations": [
         53200,
         360030,
         48227,
         106134,
         55624,
         37637,
         381041,
         85556,
         97513,
         373453,
         28480,
         91471,
         174324,
         373339,
         204095,
         48218,
         165180,
         46504,
         247567,
         224414
      ],
      "backdrop_path": "/bHDMcFOGrzHMECNNTLRAWOLQmLT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself, Narrator",
               "gender": 2,
               "credit_id": "55f845759251416d96005c4f",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Himself - Volcanologist",
               "gender": 0,
               "credit_id": "55f845879251415852004403",
               "name": "Clive Oppenheimer",
               "profile_path": null,
               "id": 1510560,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Herself - Volcanologist (archive footage)",
               "gender": 0,
               "credit_id": "5816c61ec3a36873d901343d",
               "name": "Katia Krafft",
               "profile_path": null,
               "id": 1701875,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Himself - Volcanologist (archive footage)",
               "gender": 0,
               "credit_id": "5816c62b9251415cd10156ec",
               "name": "Maurice Krafft",
               "profile_path": null,
               "id": 1701876,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Himself - Volcanologist",
               "gender": 0,
               "credit_id": "5816c6369251415ab8015627",
               "name": "Sri Sumarti",
               "profile_path": null,
               "id": 1701877,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Himself - Paleoanthropologist",
               "gender": 0,
               "credit_id": "5816c64d9251415cd101570c",
               "name": "Tim D. White",
               "profile_path": null,
               "id": 1701878,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Himself - Fossil Hunter",
               "gender": 0,
               "credit_id": "5816c65e9251415d61015743",
               "name": "Kampiro Kayrento",
               "profile_path": null,
               "id": 1701879,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself - Archaeologist",
               "gender": 0,
               "credit_id": "5816c66ac3a36876690166a9",
               "name": "Yonatan Sahle",
               "profile_path": null,
               "id": 1701880,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55f8451e92514175f800757c",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5816c5aac3a36876690165d9",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5816c5cf9251415a7f015620",
               "name": "André Singer",
               "profile_path": null,
               "id": 54901,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5816c5dc9251415cd10156c0",
               "name": "Lucki Stipetić",
               "profile_path": "/z1zJRqjrAtcc8fuVqrARCPboaTT.jpg",
               "id": 27042,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5816c5ecc3a368767e01493a",
               "name": "Peter Zeitlinger",
               "profile_path": null,
               "id": 6826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5816c5f7c3a368767e01494c",
               "name": "Joe Bini",
               "profile_path": "/pc6xqYadNk9NePR5hvDICZQPLC4.jpg",
               "id": 6827,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58201a1292514168ad00d7c1",
               "name": "Adam Del Deo",
               "profile_path": null,
               "id": 62795,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58201a2092514168aa00d89e",
               "name": "Lisa Nishimura",
               "profile_path": null,
               "id": 1373056,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58201a2fc3a368556800d1f7",
               "name": "Jason Spingarn-Koff",
               "profile_path": null,
               "id": 1194840,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58201a3dc3a368555300e84a",
               "name": "Vanessa Dylyn",
               "profile_path": null,
               "id": 1327897,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58201a4c92514168ad00d7f5",
               "name": "Richard Melman",
               "profile_path": null,
               "id": 1361168,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.941434,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 360029,
      "vote_count": 54,
      "budget": 0,
      "overview": "Werner Herzog and volcanologist Clive Oppenheimer embark upon a global journey exploring some of the world's most mythical volcanoes in Indonesia, Ethiopia, Iceland and North Korea. Speaking with scientists and indigenous peoples alike, they seek to understand the complex and deeply rooted relationship between mankind and one of nature's greatest wonders.",
      "similar": [
         9619,
         10357,
         76649,
         294562,
         479475,
         47942,
         391975,
         272898,
         360992,
         497528,
         171429,
         17703,
         120360,
         477251,
         360916,
         360873,
         87966,
         361039,
         361046,
         480429
      ],
      "original_title": "Into the Inferno",
      "runtime": 104,
      "poster_path": "/tZJHp4k11uBpTwzW5cVqQ0J7047.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Bahasa indonesia",
            "iso_639_1": "id"
         },
         {
            "name": "한국어/조선말",
            "iso_639_1": "ko"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wwemzKWzjKYJFfCeiB57q3r4Bcm.png",
            "name": "Netflix",
            "id": 59811,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Matter of Fact Media",
            "id": 63383,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Herzog-Film",
            "id": 63384,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Werner Herzog Filmproduktion",
            "id": 843,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spring Films",
            "id": 9120,
            "origin_country": "GB"
         }
      ],
      "release_date": "2016-09-07",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "What we worship can destroy us",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Werner Herzog"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Werner Herzog"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4846318/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTAyNzYyNjg1NzJeQTJeQWpwZ15BbWU4MDY4NzE1MzAy._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Werner Herzog",
         "Clive Oppenheimer",
         "Katia Krafft"
      ],
      "reviews": [
         "You might think that this is a documentary about volcanoes\u0085 in which case you wouldn't be wrong. However you have to keep in mind that this is a Werner Herzog documentary about volcanoes. Herzog is not so much interested in the facts about volcanoes (I'm sure he'd tell you to read a book if you want facts) but what volcanoes can tell us about ourselves and about us as a species. So how does he do it, you might ask. Herzog reaches very far back, very far, in fact right back to the dawn of man – through an archaeological expedition in Ethiopia that aims to uncover a complete skeleton of such an ancient human beneath the blazing sand. And indeed Herzog captures something prehistoric with this documentary; amidst our digital age which often tricks us to believe we've conquered nature, he renders man once again so incredibly small and fragile against the (in contrast) everlasting thermal forces of the earth. Herzog explores this feeling of impuissance by traveling to tribal communities in the Pacific and by exploring the state of North Korea and the oppressive, propagandistic cult around their leaders (with some at times truly fantastic footage, you have to keep in mind that it's almost impossible to get a permit to film there). In both communities a volcano plays an important role and Herzog expresses multiple times his interest in how volcanoes \"create new gods\", once again questioning the permanence of our culture which we so often take for granted. In the end what makes this movie so special is that it's surprisingly contemporary despite being about a phenomenon (volcanos) that is almost as old as the earth itself and that Herzog found new ways to once again render the Vanitas motif from medieval times vividly alive. Herzog reminds us that even today with all out technological progress, we are still small, fragile animals against the mighty forces of nature. Memento Mori, they said in the Middle Ages, remember that you have to die. Some have commented that the film is really shattered; however I'd argue that it's actually really focused on its theme. Don't expect my review to follow the film chronologically though, it takes it's very own spins and turns. And don't expect the film to be sad, it's actually quite witty and filled with funny ironies. Likewise it assembles a large array of different great and fascinating footage from all around the world. However I'd still like to leave you with a famous old poem from one of Herzog's fellow countrymen (which I'm convinced he knows as well), here's Friedrich Hölderlin's \"Hyperion's Song of Fate\" (be sure to read it in its original German form if you speak the language): Up there you walk through the light on delicate grounds, Elysian Spirits! Shimmering breezes of Gods touch you as softly as the hand of the harpist touches her sacrosanct strings. Unencumbered by fate, like a slumbering newborn, are breathing the heavenly dwellers; chastely protected by a bud unassuming flowers for them eternal the spirit and their hallow'd eyes shine in serene clearness forever. But to us it was given never and nowhere to rest: we suffering humans vanishing, falling blindly from one hour to the next are thrown like the water cliff down to cliff, yearlong into the unknown abyss.",
         "Werner Herzog is a captivating man who has grand pursuits and a varied set of interests. He has made many films since his breakout hit, \"Aguirre, the Wrath of God,\" in 1972, and all of them have either been exceptionally interesting, complex, fantastical, or illuminating in nature. Herzog makes both fiction and non-fiction films that deal with issues as diverse as colonialism, the savageness of the wilderness, ecological disasters, opera, and ski flying. With his newest film for Netflix, Herzog once again shows us that fascination is an oft neglected but empowering feeling that can be applied to numerous aspects of life. He starts us off with the topic of volcanoes, but he becomes much more fascinated with humankind at large, evidenced by his own reticence to even get close to a volcano. Herzog reels us in with the help of Clive Oppenheimer, a Cambridge University volcanologist that he had previously worked with in the documentary, \"Encounters at the End of the World,\" which was a film about Antarctica. Oppenheimer is a playfully compelling, if timid, guide into the world of volcanoes. He and Herzog travel the world and study volcanoes in Indonesia, Iceland, North Korea, and Ethiopia. At each of these junctures, the cultural importance of the volcano is made the fixture of the film, rather than focusing on hard science. The peoples of these regions all seem to be in awe of volcanoes, and either have a deep fear or respect for what it's capable of. In Ethiopia, a nearby volcano is the key to finding fossils of Paleolithic hominids, the rarest of human fossils. In North Korea the region's fierce patriotism is linked with its local volcano where the leaders Kim Il-sung and Kim Jong-Il once stood, proudly displaying to their nation that they were strong and resilient in the face of outside vitriol. Though some of these excursions seem to undercut the fact that this is a film about volcanoes, this film never bores its audience. Between the panoramic shots of tropical foliage and the drone sequences that pan across villages and volcanoes alike, this is a feast for the eyes. There's a great contrast between the beauty of these regions and the oft-confusing shots of the magma that these ruptures expound with horrifying regularity. The inner regions of volcanoes look both like fire and water, and the magma often looks pitifully tame when it moves slowly down a mountainside, though it is actually a most dangerous force that will destroy all in its path. Herzog talks a bit about a couple who were volcanic photographers and were eventually killed by a fast moving cloud of volcanic ash (at 100 mph). While this tidbit is unprompted, it proves to be yet another interesting facet of these quaking mountaintops. Herzog finds many ways to look at these geographic forces, which can be seen as either benevolent or destructive in power.",
         "Werner Herzog proves again he is a monster of a documentarian. Into the Inferno is filled with stunning imagery and sounds that truly left me awestruck. The substance of the film itself was not quite what I was expecting, but it turned out that that was a good thing. This film goes places you would never really think of, and sheds light on many different cultural connections to volcanoes around the world. It more about people, societies, and culture than it is about science and geology, although there is some of that too. If you are at all interested in volcanoes and how people react and interact with them around the world, this film will pleasantly surprise you.",
         "Werner Herzog is nothing if not an obsessive film maker. This obsession leads to stark and beautiful sights captured through his camera, which serve more of a philosophical aesthetic than any true narrative. I went into this expecting a documentary about the history of volcanoes, perhaps a narrative on their cultural considerations. Instead what I got was a personal rumination on the discompassionate, violent nature of volcanoes, put into relief by the helpless, delusional stories primitive communities create about them. Herzog superimposes his trademark \"Man as nothing but subject to the indifferent forces of nature\" theme subtlety throughout the film, until the end it comes forward in full, with nothing short of an apocalyptic speculation about volcanoes annihilating the planet in synchronized eruption....K. I respect Herzog's view that man is a futile, helpless, and deluded organism at the mercy of the objective and inconsiderate forces of nature, but that is nothing more than a reflection of his personal view on humanity and nature. It is not inspiring, it is not particularly original, but it is vastly dark. To that I simply say, I prefer to see the world as something of beauty, something from which we are inextricably linked, that supports us, and provides this incredible experience called human life. I am thankful for the sometimes violent beauty of nature. Herzog does a good job of disguising his nihilism beneath gorgeous shots, imagery, and commentary, and slowly leaks it in as time ticks by. It's like a good magic trick, that if pulled off effectively might just leave the viewer feeling somewhat nihilistic at the end of the movie too. Nice try Werner, not this time.",
         "The first, but definitely not the last, documentary by Werner Herzog that I've seen, 'Into the Inferno' is a movie about volcanoes and the attitudes and beliefs people have toward them. For a documentary, the film isn't particularly informative. It's an art film, like you'd expect from Herzog. Most of all, it includes mesmerizingly beautiful footage of volcanoes. The sights feel otherworldly, chthonic, dreamlike: the red blood of the earth that flows from unfathomable depths. We are introduced to the volcanologist Clive Oppenheimer that Herzog met in Antarctica working on another documentary film of his. Together the two men traverse Indonesia, Africa, Iceland and even North Korea looking at volcanoes and interviewing people who live in their vicinity. The elements of science and religion are constantly intertwining. In addition to learning about prehistoric eruptions and various seismographic trinkets, we get introduced to cargo cults, ancestral spirits, doomsday prophecies and political cults of personality. Very interesting and thoughtful film. There are some very unexpected detours in the narrative: Herzog takes us where opportunity presents itself, not always focusing on the volcano theme but instead looking at paleonthology or the effects of propaganda on the human psyche.",
         "I live in Indonesia and i want to learn more about volcanoes and how they work but this movie is 99% about people and their prescriptions of life and 1% about volcanoes so i felt i it was a wast of time. When Werner was narration is so boring i felt like i wanted to give him a energy drink or a coffee! The movie still it got some amazing footage, but so horribly made in every sense! Its not educational any way, more then what people thinks of Volcanoes so i just Werner own vlog! The name of the movie could be \"People Prescriptions of Volcanoes\"",
         "Into the Inferno (2016) *** (out of 4) Werner Herzog narrates and directs this documentary, which takes a look at various volcanoes throughout the world. I should probably start off by saying Herzog is one of my favorite filmmakers and he might be my favorite documentary filmmaker. INTO THE INFERNO was a rather interesting idea but I'm not quite sure how well the end product turned out. If you're expecting a straight documentary from the maverick filmmaker then I'm going to guess that you're unfamiliar with his work. He's created some true masterpieces but none of them play like you'd expect them to. That's certainly true for this picture, which makes you believe that it's about volcanoes but you soon realize that the director is up to his bag of tricks and delivers more but I'll get into that in a bit. As far as the volcano stuff goes, it's extremely interesting to say the least. We're pretty much given a tour of the globe as we see various volcanoes as well as get to learn about their history and get to hear some stories about previous explosions. All of this stuff is brilliantly captured as the cinematography is downright terrific and the visual images of the lave are so beautiful that I could have easily watched them for hours. With that said, the film is also about various thoughts on life and other issues. I freely admit that I didn't think this segment of the film worked and sadly there's a lot of this stuff and I think it really brought the film down. The sequences in North Korea are a prime example as we get to hear stories of how the people there are basically hostages to their leader. What does this stuff have to do with volcanoes? All of it really seems like it should have been left for a different documentary but, as I said, Herzog likes to mix things up but I just don't think it was a success here.",
         "Loved this documentary! Always a fan of Herzog...but if I was going to give a criticism....don't do subtitles where it's not needed! That seismologists English was well beyond most hillbilly/trailer trash!! Felt a bit condescending to be honest! Other than that, good doc! I don't think that that was intended, but it needs to be mentioned!",
         "Is it possible for Werner Herzog to shoot a documentary that ISN'T interesting? So far my answer would be no; INTO THE INFERNO is every bit as thoughtful, idea-provoking, and thoroughly engaging as the rest of the director's output that I've had the pleasure to watch. This one's all about volcanoes and is a follow-up of sorts to ENCOUNTERS AT THE END OF THE WORLD. Herzog once again craftily mixes a variety of elements to keep this documentary fast-paced and eventful. There are the usual oddball characters acting in eccentric ways while others tell tragic stories and various slice-of-life stories. There's a travelogue aspect with globe-trotting in the Caribbean, Pacific, Japan, North Korea, and Antarctica. Herzog's voice may be softer now that the years advance, but he remains insightful and a pleasure to listen to. The footage of magma lava flows is incredibly beautiful and certainly the best you'll ever watch. As ever, this Herzog is a pleasure to watch."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Matter of Fact Media",
         "Spring Films",
         "Werner Herzog Filmproduktion"
      ],
      "summaries": ["An exploration of active volcanoes around the world."],
      "budget": 0
   },
   "movielensId": 165491,
   "movielens": {
      "languages": [
         "English",
         "Bahasa indonesia",
         "한국어/조선말"
      ],
      "releaseDate": "2016-09-07",
      "dvdReleaseDate": null,
      "directors": ["Werner Herzog"],
      "runtime": 104,
      "movieId": 165491,
      "title": "Into the Inferno",
      "mpaa": "",
      "actors": [
         "Werner Herzog",
         "Clive Oppenheimer",
         "Katia Krafft",
         "Maurice Krafft",
         "Sri Sumarti",
         "Tim D. White",
         "Kampiro Kayrento",
         "Yonatan Sahle"
      ],
      "imdbMovieId": "4846318",
      "originalTitle": "Into the Inferno",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["YoSmPkWmG4k"],
      "plotSummary": "Werner Herzog and volcanologist Clive Oppenheimer embark upon a global journey exploring some of the world's most mythical volcanoes in Indonesia, Ethiopia, Iceland and North Korea. Speaking with scientists and indigenous peoples alike, they seek to understand the complex and deeply rooted relationship between mankind and one of nature's greatest wonders.",
      "tmdbMovieId": 360029,
      "avgRating": 3.58333,
      "releaseYear": "2016",
      "numRatings": 48,
      "posterPath": "/tZJHp4k11uBpTwzW5cVqQ0J7047.jpg"
   }
}