{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "comeback",
            "id": 4610
         },
         {
            "name": "heavy metal",
            "id": 5540
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "quiet riot",
            "id": 204315
         }
      ],
      "imdb_id": "tt2560840",
      "video": false,
      "title": "Quiet Riot: Well Now You're Here, There's No Way Back",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "539e100dc3a3683b37004749",
            "name": "Frankie Banali",
            "profile_path": null,
            "id": 1330992,
            "order": 1
         }],
         "crew": [
            {
               "gender": 1,
               "credit_id": "55a5b2bc92514109990003e9",
               "name": "Regina Russell Banali",
               "profile_path": "/urR7EpxvExnpAQdgUmyRVW9wsoQ.jpg",
               "id": 42226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55a64db2c3a3682bad001092",
               "name": "Regina Russell Banali",
               "profile_path": "/urR7EpxvExnpAQdgUmyRVW9wsoQ.jpg",
               "id": 42226,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "55a64e17c3a3682bb20010c7",
               "name": "Regina Russell Banali",
               "profile_path": "/urR7EpxvExnpAQdgUmyRVW9wsoQ.jpg",
               "id": 42226,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55a6517792514109a70011f6",
               "name": "Regina Russell Banali",
               "profile_path": "/urR7EpxvExnpAQdgUmyRVW9wsoQ.jpg",
               "id": 42226,
               "department": "Camera",
               "job": "Additional Camera"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.133205,
      "production_countries": [],
      "id": 276833,
      "vote_count": 2,
      "budget": 0,
      "overview": "An inspiring documentary chronicling the rise, fall and resurrection of '80s metal band Quiet Riot. The career of Frankie Banali, the band's drummer, reached a serious crossroads when his best friend and bandmate died in 2007. Years later, Banali realizes he must forge ahead and make a new life for himself and his daughter and he goes on a quest to reunite the band and fill the immense void left by his bandmate.",
      "similar": [
         63973,
         20575,
         786,
         37896,
         27586,
         3902,
         40437,
         1584,
         27,
         254470,
         525,
         77282,
         6575,
         5123,
         450794,
         6477,
         9762,
         69,
         114150,
         243683
      ],
      "original_title": "Quiet Riot: Well Now You're Here, There's No Way Back",
      "runtime": 104,
      "poster_path": "/9DyuDg1h30upv0aXWgiwPANEiNh.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Double R Films",
            "id": 58108,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "PinkMermaid Productions",
            "id": 58109,
            "origin_country": ""
         }
      ],
      "release_date": "2014-04-29",
      "vote_average": 9.5,
      "belongs_to_collection": null,
      "tagline": "Some bands deserve another shot...and another...and another...and another.",
      "adult": false,
      "homepage": "http://www.quietriotmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": null,
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Regina Russell Banali"],
      "runtime": 104,
      "synopsis": "An unlikely and surprisingly personal narrative to conquer the loss of a friend emerges from an odyssey about the rise, fall and resurrection of an 80's metal band. The career of Frankie Banali, drummer of Quiet Riot, took a major sideswipe when his singer and best friend Kevin DuBrow died in 2007. In 2010 and at a cross roads in his life, Banali has to forge ahead and make a new life for himself and his daughter. The film follows him going through the emotional feat of trying to fill the void left by Kevin and get the band back together one more time. The 104-minute character-driven documentary goes beyond the guts and glory of the common getting the band back together tale. \"QUIET RIOT: Well Now You're Here, There's No Way Back\" reveals an unforgettable man who uses ambition, adaptability, relentless determination and principle to navigate through a business, and a series of obstacles that are attempting to control his fate.",
      "writers": ["Regina Russell Banali"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt2560840/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ1OTAxNDQ3M15BMl5BanBnXkFtZTgwMDc4MDAwNDE@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Steven Adler",
         "Frankie Banali",
         "Eric Buarque"
      ],
      "reviews": [
         "I was delighted to see the Quiet Riot documentary included in the program for the NXNE film festival here in Toronto! This film is a definite must for fans of the genre as well as non fans alike. It is a cheeky look back at the heyday where legendary excesses launched and killed the careers of many a great band. But it is so much more than that. It is a testament to friendship and loyalty, perseverance and passion, being true to yourself and following your path. It is filled with humour, affectionate teasing and a lot of love. Never did I feel bashed over the head with messages or emotionally manipulated but rather was presented information that I was allowed to process for myself. I was impressed by the candour, openness and vulnerability of many of those interviewed (most notably Frankie Banali himself) and also by the skill of Regina Russell in capturing it. I laughed, I cried, I was singing along in my seat.",
         "I see a lot of these rock and roll quasi documentaries and was particularly impressed with this one. Besides being a bear to edit I imagine, it also stayed clear of the very formulaic Behind the Music format. After subsequent viewings I was really impressed with a few things in particular. First was the apparent honesty. I felt the director addressing Banali's decision to move forward after an obviously grief stricken and bold proclamation of not performing under the QR banner to be interesting. He put his blood sweat and tears into the legacy and made the reformation decision. Director tackled what was viewed as hypocritical by detractors head on. The inclusion of the online criticism and Banali's eventual FU to the cynics was handled well and was very interesting. Secondly, I appreciated how savvy the director handled the traditional \"hero/villain\" scenario that plagues a lot of these docs. Everyone got their criticism, took their criticism and it was handled with tongue firmly planted in cheek without sacrificing the seriousness of said situations. Specifically Mark and the opportunity and eventual missed opportunity. Finally, I really appreciated the Jeopardy and Dancing With the Stars references showing the cultural impact the band has. Reaching my character limit but BRAVO! See this film now.",
         "I just finished watching this fantastic rockumentary and I'm so glad that I DVR'd it when it saw it come up on the guide the other night! The highs and lows this story takes you on make for an incredible tale of a legendary band. Part real life Spinal Tap, part real life Rock Star! This is a new title in the classic line up of great rockumentaries that gives insight into that crazy world that is 80's Heavy Metal. If you are a fan of Quiet Riot or any of the bands or songs from the decade of metal then you are sure to enjoy this movie. Thanks for the reminder of how much fun the music of the 80's was and still is. Great job by all involved on both sides of the camera lens. Rock on \\m/",
         "Had a great time at the premier of \"Well Now You're Here, There's No Way Back\". The movie was one of the best music documentaries I have seen. It was informative, sad and funny all at the same time. I am a Quiet Riot fan from the beginning,seeing them in Hollywood at the small clubs. I learned a little about the Quiet Riot members thing's that I didn't know. But I also was very entertained. (Maybe finally Chuck will get his recognition). It had a lot of laughing out loud moments. The scene's done with hidden camera's, caught some memorable funny and heartfelt moments. I can't wait for the DVD to come out. I will definitely purchase it. I just hope it is not cut apart and made smaller.",
         "In the early 1980s, Quiet Riot had hit it big time. In March 1983, their American debut album Metal Health was released. By November, the album had made its way up the Billboard charts at #1, becoming the first metal album to do so. Drummer Frankie Banali now tells the story of the LA hard rockers, as well as his own story in this new documentary. The movie- Well Now You're Here, There's No Way Back- is a heartfelt story about a rock band and the friendship at the center of it. While this movie documents the resurrection of Quiet Riot, we are also told of the band's history. The first half hour of the movie is devoted to giving history of Quiet Riot from the beginning till the 1980s. At certain parts in the movie, it will cut back to the 1980s. For the most part, the information given in the history segments is good. Even being a Quiet Riot fan, some of the information was new to me as were some of the archival videos used. While this isn't a complete history of Quiet Riot, it's still amazing how much director Regina Russell was able to fit in the movie's runtime of 104 minutes. For interviewees, we get to hear from a nice group of people. This includes former members such as Rudy Sarzo as well as other figures in the world of hard rock including Dee Snider, Glenn Hughes and That Metal Show host Eddie Trunk. We also get to hear from Rhoads' brother and sister, as well as singer Kevin DuBrow's mother and even his brother Dr. Terry DuBrow (a plastic surgeon who has starred in several E! Network reality shows). Quiet Riot members Chuck Wright and Alex Grossi even get some camera time, sharing memories of DuBrow and discussing the status of the new band. Watching the resurrection of Quiet Riot is quite entertaining. We get to see the band audition different singers in one scene before finally deciding on singer Mark Huff. The movie documents almost each and every show the band plays with Huff, which lead to some hilarious and even emotionally intense scenes. Overall, Well Now You're Here is a great documentary. The movie is also strengthened by the hard rocking tunes Quiet Riot delivered over the years. In the last few years, there have been a series of great rock documentaries: Anvil with Anvil: The Story of Anvil, Rodriguez with Searching for Sugar Man and Death with A Band Called Death just to name a few. Quiet Riot can now join that group with this movie. I highly recommend seeing this movie, whether you're a fan of Quiet Riot or not. This movie was also partially funded by Quiet Riot fans through Kickstarter in 2010. I was one of the many who donated some money so I could see this movie. After seeing this, I'm proud to say I had a small part in helping this movie become a reality.",
         "I went to the Newport Beach film festival to see the premiere of \"Well now you're here there's no way back\", it is one the best docs i have seen, it ranks up there with/ exceeds \"20 ft from stardom\",\"sound city and \"history of the eagles\". not being a quiet riot fan, i learned from Frank Banali( drummer), the history of how they came to be, the ups and downs of the band, the changing of lead singers after the untimely death of Kevin Debrow. the movie is very entertaining, it has its funny parts and its sad moments.it also shows the struggles that Frank Banali went thru,whether to end the band or to start it's resurgence, once he decided to keep the band going and the difficulty in replacing Kevin Dubrow. after viewing the movie i am now a Quiet Riot fan and also a fan of Regina Russell(director), a very well put together documentary!!",
         "This documentary went behind the glorified times of the 80's rock music scene only to unearth the roots of how the iconic Quiet Riot dealt with success, drug addiction, death & rebirth. This movie contained interviews and never before seen concert footage that captured why Quiet Riot became the groundbreaking band that changed the 80's music forever. This was an amazing movie that humanized everyone that has ever been involved with the Quiet Riot band from the start to current times. After seeing this movie, I now have a greater respect for this band that never gave up on the music or their fans even through all their obstacles. You think you know Quiet Riot? After this film....you will!",
         "Wow! What an entertaining movie, I was glued to the screen the whole time. Quiet Riot is one of the most legendary bands of all time. They were the original pioneers that brought metal into the mainstream and hit the billboards. The film contains amazing footage of the 80's metal scene that is incredible. It shows the ups and downs of Quiet Riot from their emergence onto the scene through the revival of 80's metal. Most importantly it shows the passion of drummer Frankie Banali and his relentless pursuit of his dreams. He showed raw emotion as he discussed his career, friendships and family. The movie brings you through a wide range of emotions from laughter to sadness and really gives the audience a true behind the scenes perspective of being a rock star. Fan or not you will enjoy this masterpiece from beginning to end! Congratulations to Frankie and the band for making a well put together documentary, my respect for a truly amazing musician doubled after having the privilege of watching it.",
         "First of all I am NOT a Critic! To be a Critic is to be Critical of some ones work, art, music etc... I do not care what a critic has to say about anything , personally. Those are just opinions to me and everybody has one, so what... So here is my opinion of this Doc. In a nutshell, I loved it! Yes! I thought is was a perfect example of the \"Never say Die\" attitude that has been kinda lost today. Of course These guys could have thrown in the towel, and rightfully so, but they didn't. They could have went on with other bands or produced other music or something all together different, But They Didn't! Instead, Frankie decided that this is what I do, and want to do, and will keep Doing. I respect that! That's what I am taking away from this movie. I will not quit. When you get right down to it is a good life lesson. A life lesson that I needed to hear. So, in my opinion, see this movie! Good Music, Great Band, life lesson and a positive future outlook. Oh, and if and when Quiet Riot comes to my town, I will be doing all I can to be there! I wish the guys all the luck in the world!",
         "There is a reason why I watched Quiet Riot movie, \"Now You're Here, There Is No Way Back\", twice!! It's just AMAZING!! I saw it the first time in Newport Beach and the second time in Hollywood. It shows all aspects of rock n' roll. It shows what happens on stage and outside the stage, the ups and downs of the band, the drug addiction, the reality, the friendship, and even the comedy. I sang, I cried, and I laughed. It simply touched on all the emotional aspects of what a rock n' roll band goes through to survive. I especially liked that they used real footage from the 80's all the way to recent years. They captured great moments. My best compliments to the producer and the editors on an well made documentary. I absolutely recommend it!",
         "I first saw the trailer to this movie a few years ago , a short clip of quiet riot singer Kevin Dubrow talking about a quiet riot movie in the future ? Cool trailer that interested me but I never heard about the movie again, flash forward a few years later and I hear \"the quiet riot movie\" will premiere at the Newport film festival , about an hour away from me, I go thinking I might see a cool rockumentary type movie, for 2 hours you get to see the history of quiet riot , the trailer I saw is now the start of the movie,you get to see the start of the band with Kevin and guitar great randy Rhoads , the rise of quiet riot ( the historic metal health album , the first heavy metal album to hit #1 on the billboard charts) the friendship between Kevin and drummer Frankie Banali ,the fall , quiet riot in the 90s , various member changes, and the death of Kevin , the movie never gets boring , it must of bin close to a 2 hr run time, their are funny parts , real sad parts, and parts that are uplifting , I was stunned how good this movie turned out,I just saw a short trailer a few years back and walked out of the theater having seen the best music movie Iv ever seen , I give this movie my highest possible recommendation , rating it 10/10, go see this movie!!! And it's not just a music movie its real life and how Frankie Banali struggled to keep the legacy of his best friend Kevin Dubrow alive and resurrect quiet riot from the ashes.long live quiet riot , bang your head!!",
         "Interestingly enough, I came upon the movie 'Quite Riot: Now You're Here, There's No Way Back' by accident. Not because I didn't know and/or have never heard of Quiet Riot, (in fact my band opened for theirs recently, and I myself have spent from 15 to 45-years old playing, recording and touring in metal bands), but because of the on again, off again- ness of the band itself, which leaves even hardcore fans having trouble following the swirl of chaos surrounding the band and its members...and about everyone famous in Hard Rock and Metal from the 70's and 80's worth their salt traveled in and out of Quite Riot - This thankfully is addressed and very educationally clarified and mapped out finally for we the viewer and/or the fan. Most people that pay attention within the music industry (being a career musician and owning a recording studio helps), are aware of QR's ever changing lineup, the bands ups and downs, and especially the differences in opinions on if the band should continue or not, ad nauseam. Truly though, if one looks aside at the rockumentary itself void of decided opinions of the band or genre, one will see a passion knowing no bounds from a musical group and members (and especially Frankie Banali whom guides us through the bands storied journey), that can rarely be matched by other bands spanning decades - This band just doesn't know the word 'Quit'. Even if you haven't slugged it out for years loading up your own bands-worth of equipment on a Saturday night, driven to a club you've never been to, setup said gear to play in front of a crowd possibly ranging from 20 to 2000, literally sweating it out to the bone on stage while playing your set, breaking down and re-loading the equipment, then speaking/meeting with the audience and taking photos afterwards, waiting until closing time wondering if and how much the band will be paid only to drive or fly to the next town to do it all again while looking past possible and sometimes inevitable stage problems all the while keeping optimistic that it can always get better and grow, can be taken as obsession, passion or clear insanity...or a combination thereof, which few bands can or could maintain. The viewer can definitely get the sense of the blood, sweat, tears it takes to make even a living in any art form you love by watching this movie. There is as much passion as sorrow in this film as well. Personal struggles are played out for the camera in often times awkward situations the average concert goer never is privy to witness. Personal interviews with the band members past and present are stripped down to the individuals cores where I myself felt many times as a viewer, immersed in its painful as well as exciting moments almost feeling strangely voyeuristic. This rockumentary is not just for the fan that bought the Mental Health vinyl album in 1983 at age 13 only in turn to share the stage 29 years later coincidently with his own original band for a show *raises hand*, but can definitely be viewed by any artist or non-artist for its exploratory nature and psyche showing what goes into building and maintaining a 4-5 person creative group, as well as delving into the rise, fall, then rise again of a much loved world-wide known band over several decades. Spinal Tap-esque, the film is a testament to 'life imitates art'. Consistently entertaining, inspiring, very often educational to any degree of fan or musician, emotional, fun, containing a lot of laughter and good times and hard memories, all packed into this rockumentary. There is hard truth within this film rarely exposed to the mass audiences. It is not be easy to be 'King of the World' playing your music to 50,000 people consistently to then be reduced to playing State Fairs (yes we know, 'they pay well') to rising back to playing a stadium within a 30+ year span...for ANY band or human psyche. For a band to carry on though is a testament to Quite Riots passion again, and inspiration for current and up-in-coming musicians that your dreams can come true. Yes, if I were to go back with the knowledge I have now to that 24-year old partying guitarist in a band that felt invincible myself and tell them to get their s#!t straight for their future benefit, I'd have probably laughed and flipped that guy off too...and I also wouldn't have a lifetime full of great stories and memories to tell and have experienced. The struggles and successes of a road musician or any creative artist committed to a life of it is displayed wonderfully from top to bottom in this movie. For the comrade in arms within the over-all world of music to the viewer whom has never heard the song 'Mental Health (Bang Your Head)', this film carries a consistent enjoyment to watch and learn through out. The moral of this story? Carry on Quite Riot to the grave at all cost because that's what they do and they do well for fans world-wide...and to all other musicians and artists, take note and learn from this rockumentary what real passion and commitment it takes to make your dreams come true, and to never give up and fight for your dream and make it happen so every day you can wake up and prove to yourself and everyone who said you couldn't, that you can and will. Rock on Quite Riot and here's to seeing and hearing more in the coming years - Keep on keeping on \\m/ Musician & Studio Owner (not associated with Quite Riot)",
         "My husband and I were lucky enough to see this movie premiere on the big screen, and honestly, we had no expectations whatsoever. Growing up in the 80s, of course we loved Quiet Riot and all the \"hair bands,\" but I'd never been a fan of rock-docs...until this one. It was just SO well done in so many ways; a perfect balance of comedy and drama mixed artistically with the all-American rock & roll success story. I literally went from laughing to crying several times during the film. The story itself is interesting (and quite educational!) enough to stand on it's own, yet it is so brilliantly pieced together; deeply humane, beautiful & hilarious.",
         "I would never believe anyone could achieve what this director has done. I attended The Hollywood Film Festival showing of Well Now You're Here, There's No Way Back. The Impossible has been achieved! Anyone familiar with the band Quiet Riot's history will tell you there is no way Anyone could put it together with integrity. Regina Russell has done just that. I feel as though I was hanging out with the guys of Quiet Riot! The Honesty, Love, Pain, Joy and ROCK & ROLL are right there, in your face & in your Heart! I am still shocked Ms. Russell did them Right & with Justice. Tough guys bring a tissue, you'll tear. Girls Rock Your Boys, you'll Love 'Em again! Quiet Riot Forever... I Can have Tha Faith because of This Film. Thanks To All involved. Couldn't have been easy, but nuttin worthwhile evah is! Rock On!!!!☆☆☆☆☆☆☆☆☆☆♡ p.s. Chuck Wright, a Hard Rocker and an unbelievably decent guy in this film when Many wouldn't have been. Well done, wish I'd known more about him. Now I do!",
         "If you don't go see it, you'll just have to take my word for it that you would hate yourself for missing some of the best story telling I've seen in a very long time. While being in your face real, the director is a genius at breaking it up and putting in some incredible funny moments. Whether you know anything about this band or era, or even didn't like it, the way I felt about disco, you'll still find this movie impossible to stop watching, because a good story is a good story no matter what the genre. Behind the music it is not, because this is unpredictable and will keep you impatiently waiting for the next scene.",
         "I enjoy some Heavy Metal music but I am not a major fan. My Musical taste is basically everything regardless of era or region. I started watching this and was thinking another fluff piece for an entertainment group but after 20 minutes I was sucked in by the honesty of what was being said and the depth of the soul searching that was done on all the key figures. There was some shockers as well which I did not expect. I loved that they included details as to what was motivating people at the subconscious level as well. I definitely have a better idea now of what it takes and the commitment needed to achieve the level of fame they reached.",
         "First, a standing ovation to Regina Russell for making the movie happen. According to a USC study, only 1.9 percent of the top grossing 100 films over the last two years, were directed by women. Not only did she direct this film, she wrote it and produced it, and put social media to work by raising $24K on Kickstarter. Having said that, this is a great documentary. It has all the things necessary to keep us watching: a sympathetic character, a compelling story, and of course, lots of rock stars and a great soundtrack. This film isn't just for Quiet Riot fans or lovers of heavy metal. This is a great example of the American comeback story.",
         "When I found out that this film was being made a year or two ago I was very excited. I have always loved documentaries that tell of the rock n roll lifestyle and stories behind the music. Quiet Riot was one of the bands that opened the floodgates to the LA metal scene of the 80's. The film does a fantastic job of telling about the rise, fall and redemption of Quiet Riot along with some fantastic archived live footage of the original line-up with Randy Rhoads. I think what I liked best about the film was the description of what happened after Quiet Riot reformed and how the band continued after Kevin DuBrow passed away. It is so touching to hear Frankie Banali describe how Kevin's death affected him and trying to maintain the quality of the music as a tribute to his late friend. The struggle is real people and the film does not shy away from that. The live performances are great, except for the inconsistencies of the singers. Another aspect of the film that I really enjoyed was there are a lot of humorous parts, which show the guys as regular humans with a great sense of humor. I have watched this film many times and enjoy it more and more each time. If you are a fan of 80's hard rock, this is definitely a film to watch.",
         "Back in the early 80s, there was a short time when Quiet Riot was one of the biggest bands in the world--thanks in part to a lot of airplay by MTV and a very catchy son, \"Cum Feel the Noise\". However, the band soon disappeared from the top and much of it was due to the arrogant off-stage antics of the lead singer, Kevin DuBrow. It got so bad that the band even eventually fired this lead singer...the very guy who started the band! Then, after a few years, the band reunited...along with DuBrow. In 2007, however, DuBrow died of an overdose. This history of the band makes up the first 40% or so of the film and I was stunned...wasn't the film all about HIM?! What follows is the eventual decision to recreate the band...and this makes up the bulk of the film. So, with DuBrow's mother's blessing the band recruits a new lead singer and the process is NOT a smooth one. So is it worth seeing? Sure...especially if you like the band. I love their music and liked hearing about their history. It also had a lot of material that I thought was oddly funny--such as seeing a couple of these middle-aged hair band rockers with tiny dogs (one with a Chihuahua wearing clothes and another with a Yorkie and in the final scene what looks like a cockapoo--You'd THINK they'd all have Dobermans or wolves!), eating gluten-free and acting so darn normal! Plus, the MANY lineup changes also becomes very comical. Well worth seeing....at least for the person who LIKES hair band music!",
         "This is one of the best music documentaries I've ever seen, and I've seen a boat load. A great behind the scenes, warts and all profile of Quiet Riot from the late seventies until the present time. Frankie Banali has put together a no holds barred look at the struggles of a fledgling band, then superstar million selling band and then back to the bars band, all over the last 35 years or so. Lots of behind the scenes dealings with the inner workings of an iconic touring rock band. They go back to the Randy Rhoads years through the Kevin DuBrow years and the struggles to find a proper replacement for lead singer, as DuBrow had some pretty big shoes to fill. Through it all, Banali steadfastly maintains his integrity in looking for the right singer. You'll want to stick around for the ending. One of the few rock docs worthy of repeated viewings. (The Foo Fighters one is another).",
         "Went to see this movie at the Cannes Film Festival with my colleague who had never even heard of the band before. We were blown away by the honesty of the movie - absolutely brilliant piece of documentary, following the history of the band, the revolving door of musicians who left, came back, left again and even died. The movie tells it like it is - warts and all, from Chuck Wright's endless bass rig gremlins to Frankie Banali taking charge of the band and on to a singer who can't remember the words of the band's biggest hit. With contributions from long time friend of the band Glenn Hughes, Rudy Sarzo and several other former members, the story is frustrating, hilarious, beautiful, heartbreaking and everything in between. See it!",
         "Well, This is now my Most Favourite movie, I am a huge hair metal/rock fan and I am so pleased they put this movie out, if you have at least a remote interest in music, rock metal, 80s music, this is for you , but not only that it also appeals to the mainstream public in the way a rags to riches, tragedy, downfall and rise from the ashes once more story appeals to most people, think Rocky but with a metal/rock band, I am not a huge fan of boxing as it is but I love the Rocky films for their excellent story and that is what you get here. The story starts with Kevin dubious formative years , getting his first guitar , forming a band, plowing away with gigs and writing until at last they finally manage to break it into the Billboard charts, we then see the rewards period and the lifestyle followed by the tragic part where Kevin Succumbs to his addictions and dies a tragic death. All through these parts we get a constant commentary from past and present band members and members of rock royalty, giving insightful glimpses into the life and times of the scene and being in quiet riot, Lark Kevin's wife gives a touching recollection of Kevin's last days and Franky Banali drummer and lynch pin of the band gives a fascinating rundown all the way through. At the very beginning we see Franky Banali living his day to day life sans quiet Riot and getting on with his life the best he can, but what is even more fascinating , we see him begin to rebuild the band and start auditioning singers, this is quite hard as even when he finds someone suitable he is in a strange angry place , as while playing in quiet riot , he has always had Kevin out there in front of the kit and he finds it difficult to deal with having a new face out there. Without giving too much away though it is a truly fascinating story and lots of things happen, probably that we don't expect, the ending leaves us satisfied for the moment but ready for the next installments , as there are plenty of years left yet for things to happen. I enjoyed seeing all the various personnel who have played in QR it really is a lineup of top names, Franky Banali, Rudy Sarzo, Randy Rhoads, Carlos Cavazo etc. I hope you will take this review for what it is , it is written from the heart from someone who lives for 80s hair metal, I am not a journalist/reviewer and have no experience of writing a proper review , but I am a major fan of 80s metal and it meant so much to me to see this film, I am your typical rocker, long hair cowboy boots cut-off , bandannas, eyeliner etc still handgun on to that 80s scene, I jam a bit in local bars enjoy finding new music and different versions of the old stuff, This film really speaks to me and I am lucky to have seen it , I am hoping they release it on DVD with extra bits like more commentaries etc. If so I will watch it over and over again as it is inspiring, it definitely has a spinal tap element but it is real and is uplifting, to see the band playing large festivals again, Like I said though you don't have to be like me to enjoy this movie , as a standalone story with a rock music theme it is a great story and it is still being written as the band continues, who knows if you are not already a fan of this type of music , it may open a whole new door to you, or it may provide you with a couple of good hours entertainment and a great story, For all you musicians and fans out there though it is a great very inspiring story and I would advise you to watch it at the earliest chance you get and KEEP THE SCENE ALIVE. keep Rockin Paul",
         "Not sure I am actually spoiling anything here, but just in case I checked the box. I saw this on Showtime when it first aired and it was terrific. I'm actually pleasantly surprised to see it now out in a theatrical release because usually it happens the other way around. There's a lot of heart and pathos and good old fashioned '80's-era rock goodness to it. But there's also the drama of seeing them find a new lead singer (that's not a spoiler for anyone who knows the band) which gives it a comedic turn. If you watch for no other reason than to enjoy some of the \"auditions\" for the band -- you will get your money's worth. At first I though it was funny how they showed all the terrible auditions before they show the one that works out (trying not to spoil) but then I realized that it was more of a statement on an attitude about 80's metal being all about hair & wardrobe -- when actually you really have to be able to SING to sing a Quiet Riot song. (I know I can't hit those notes!). Maybe I'm over thinking it, but it was on all the \"wannabes\" who will answer an ad thinking they can sing in an '80's rock band -- and show up in crazy outfits and with crazy hair and not be able to sing a note (or know lyrics) then you have the super-humble one who can bust it out for real. Seeing the journey and the pay off was very sentimental for this fan from the beginning.",
         "In 1983 Metal Health hit the airwaves. It was the first number one heavy metal album and went on to sell 6 million copies. It was a sweet victory for the long struggling L.A. band Quiet Riot. Now all these years later Quiet Riot are back in the documentary \"Well Now You're Here, There's No Way Back\". An often poignant look at one of the 80's biggest rock bands. From their humble beginnings in the clubs of L.A. during the mid 70's to the US festival in the summer of 1983. From the downfalls of success to rebuilding an American dream. Sex, drugs and rock 'n' roll wasn't just a slogan it was a way of life. And though the years have passed and the sex and drugs have become passé the true grit of American rock 'n' roll remains. Told from the perspective of drummer Frankie Banali, this documentary gives you an inside look at what it takes to bring the band back to the stage after the death of mouthpiece Kevin DuBrow. With rare footage of Randy Rhoads and interviews with Rudy Sarzo, Glenn Hughes, Dee Snider, Steven Adler. current Quiet Riot members and more. We are given an intimate look into a story a select few know. You will laugh, you will cry, you will Bang Your Head! At times so funny you can't help but laugh and be reminded of Spinal Tap. Other times your heart strings are pulled at the reality that lives at the heart of every band. But there are of course times when you want to raise your fist and yell. Being only 9 years old when Metal Health came out, I remember it being the first album that was mine that connected with me and made me a metal head. i still own that album with all of my childhood drawings on it and scratched so bad side one plays through in 10 minutes. I was lucky enough to see the \"classic\" lineup live in 2003 and get it autographed by the band. it was a bittersweet moment when Kevin looked up at me and said \"wow, this has a lot of miles on it\". All i could do was smile and say \"yes it does\". i guess i came full circle that night with my love for Quiet Riot and now 32 years after that landmark album, Quiet Riot have come full circle and you can watch it unfold in \"Well Now You're Here, There's No Way Back\". A documentary that is among the best out there based on a rock 'n' roll band. I would recommend this documentary to any music fan, especially the young generation, so they can see that even though \"it's only rock 'n' roll\" it can also be a bitch. But in reality, that's life isn't it.",
         "\"Well now you're here, there's no way back\" is a Comprehensive, entertaining & honest documentary of the band Quiet Riot. It is a well told story and superbly edited. It contains great old band footage as well as currant talks and Interviews with family, friends & band members past & present. A complete journey from Quiet Riot's beginning, right up to present day. Omitting nothing along the way. A must see for rock and metal music fans, but also so much more - Frankie Banali's passion and perseverance is commendable! This film also captures the loyalty and passion the fans of this genre of music possess. Showing their importance and role in keeping the music alive!"
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": ["PinkMermaid Productions"],
      "summaries": ["The rise, fall and near-resurrection of a 1980s metal band."],
      "budget": 0
   },
   "movielensId": 165827,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-04-29",
      "dvdReleaseDate": null,
      "directors": ["Regina Russell Banali"],
      "runtime": 104,
      "movieId": 165827,
      "title": "Quiet Riot: Well Now You're Here, There's No Way Back",
      "mpaa": "",
      "actors": ["Frankie Banali"],
      "imdbMovieId": "2560840",
      "originalTitle": "Quiet Riot: Well Now You're Here, There's No Way Back",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["fpO9kDOnB6g"],
      "plotSummary": "An inspiring documentary chronicling the rise, fall and resurrection of '80s metal band Quiet Riot. The career of Frankie Banali, the band's drummer, reached a serious crossroads when his best friend and bandmate died in 2007. Years later, Banali realizes he must forge ahead and make a new life for himself and his daughter and he goes on a quest to reunite the band and fill the immense void left by his bandmate.",
      "tmdbMovieId": 276833,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/9DyuDg1h30upv0aXWgiwPANEiNh.jpg"
   }
}