{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "night",
            "id": 3752
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "city",
            "id": 14828
         },
         {
            "name": "warsaw",
            "id": 212914
         }
      ],
      "imdb_id": "tt5146068",
      "video": false,
      "title": "All These Sleepless Nights",
      "recommendations": [
         314520,
         361069
      ],
      "backdrop_path": "/akZPui8RjkyIaglxLwnywczrOYK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Himself",
               "gender": 0,
               "credit_id": "56ac57f19251417e1a004d2d",
               "name": "Krzysztof Baginski",
               "profile_path": "/kQjRYwJ7rqQKArW7xsGJzfbTnpZ.jpg",
               "id": 1569939,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "56ac57f1c3a3681c3f005883",
               "name": "Michal Huszcza",
               "profile_path": null,
               "id": 1569940,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 0,
               "credit_id": "56ac57f29251417e110052df",
               "name": "Eva Lebuef",
               "profile_path": null,
               "id": 1569941,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "58dbde7ec3a3687d6300cd6a",
               "name": "Adam Repucha",
               "profile_path": null,
               "id": 1785998,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Herself",
               "gender": 0,
               "credit_id": "58dbde89c3a3687d1d00cd83",
               "name": "Kaja Kukuła",
               "profile_path": null,
               "id": 1785999,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Herself",
               "gender": 0,
               "credit_id": "58dbde9392514133c900d664",
               "name": "Małgorzata Piernik",
               "profile_path": null,
               "id": 1786000,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Herself",
               "gender": 0,
               "credit_id": "58dbde9dc3a3687d3100d0b5",
               "name": "Aleksandra Talacha",
               "profile_path": null,
               "id": 1786001,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Herself",
               "gender": 0,
               "credit_id": "58dbdea8c3a3687d6300cd9b",
               "name": "Natalia Atmańska",
               "profile_path": null,
               "id": 1786003,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57306b2792514179e3001e35",
               "name": "Michal Marczak",
               "profile_path": null,
               "id": 1136478,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "578286a7c3a3685d4c00064c",
               "name": "Michal Marczak",
               "profile_path": null,
               "id": 1136478,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "578286b8c3a36862ae0004f0",
               "name": "Dorota Wardęszkiewicz",
               "profile_path": null,
               "id": 1471582,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "578286c49251415624000e2a",
               "name": "Michał Marczak",
               "profile_path": null,
               "id": 1648283,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "578286cfc3a3685d4c000674",
               "name": "Marta Golba",
               "profile_path": null,
               "id": 1648284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "578286dc92514171a200056b",
               "name": "Lucas Ochoa",
               "profile_path": null,
               "id": 1107430,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "578286ecc3a368611f0005e2",
               "name": "Julia Nottingham",
               "profile_path": null,
               "id": 1648285,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58dbdebe925141337d00de47",
               "name": "Lubomir Grzelak",
               "profile_path": null,
               "id": 1786005,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "58f988c7925141587d0039a3",
               "name": "Michał Marczak",
               "profile_path": null,
               "id": 1648283,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58f988d19251415892003c11",
               "name": "Katarzyna Szczerba",
               "profile_path": null,
               "id": 1800411,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.608973,
      "production_countries": [
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 376386,
      "vote_count": 8,
      "budget": 0,
      "overview": "What does it mean to be awake in a world that seems satisfied to be asleep? Kris and Michal push their experiences of life and love to a breaking point as they restlessly roam the city streets in search of answers, adrift in the euphoria and uncertainty of youth.",
      "similar": [
         9777,
         19053,
         122081,
         8363,
         627,
         14484,
         2770,
         9029,
         109414,
         106646,
         4995,
         8456,
         9352,
         634,
         979,
         4247,
         195589,
         376659,
         12271,
         17899
      ],
      "original_title": "All These Sleepless Nights",
      "runtime": 100,
      "poster_path": "/osUPjUFURORZYzmgQAzFhGHvNQL.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Orchard",
            "id": 9286,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pulse Films",
            "id": 57430,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Endorfina Studio",
            "id": 79105,
            "origin_country": ""
         }
      ],
      "release_date": "2016-11-04",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.allthesesleeplessnights.com",
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michal Marczak"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Michal Marczak",
         "Katarzyna Szczerba"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt5146068/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjA0NDg5NTk5MF5BMl5BanBnXkFtZTgwOTcyMTkxMTI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Krzysztof Baginski",
         "Michal Huszcza",
         "Eva Lebuef"
      ],
      "reviews": [
         "This film is a documentary, but unlike any I have seen before. It follows primarily one (though at times, up to three) Polish 20-ish year olds (19-23 would be my guess) over the course of a year as they explore the night, usually at parties, music festivals, or wandering home through the streets - but the experience is captured so intimately that I did not realize I was watching a documentary until I read more about the film the day after seeing it (at Full Frame Film Festival). Above all else, All These Sleepless Nights overwhelms with its cinematographic and editing style - shot like an art-house blockbuster with 2.35 aspect ratio, 24fps flow, and a shallow depth-of-field, its stabilized shots lure you into that cinematic mode where you forget that you're watching a movie and begin to feel one with the characters. This is something I have never before experienced with a documentary - the cinematography is so fluid and characters so flawlessly apathetic to the presence of the camera that I was certain this was a strange scripted fiction. And of course, the degree with which Marczak interfered with reality when shooting this film is quite uncertain (were the relationships real? Was the dialogue pre-written?), but that really doesn't matter, because he absolutely succeeded in capturing the reality of a 20ish- year old's mind. And this is why the film was so stunning for me. I'm a 21-year old college student (in the USA, not Warsaw), and watching this film felt like scrolling through the memories of my past couple years. I have never felt a film so accurately capture a state of mind that I've experienced, and I believe Marczak was able to do this largely through two creative choices. First, the aforementioned cinematography and editing lead to a dreamy capture of the scenes, with diegetic sounds blending with non-diegetic enhancements that make everything feel like a perfectly accurate view of the scene not through a camera and microphone, but through the mind's eye, with some distortion from alcohol and memory. Second, Marczak lets on to very little of the subjects' lives beyond what we see in the nightlife, with every shot focused on the present (and perhaps the present thoughts of the subjects), and absolutely no hint of what the characters may do during the day, or what goals and aspirations they may have. When their relationships and musings enter their minds as they're partying at a club or lounging by the Vistula, Marczak lets these thoughts and words be seen, but even then he exercises a discipline in never letting the viewer know what these characters are doing in their 'serious' lives, or even precisely what age they are / if they're in college or the working world. Because of this, all we see is a series of present moments, none glorified or painted to look like anything other than what they are - memories pleasant and boring alike. And so all it takes to resonate with the characters is a similar mindset, a similar experience of night and thought and life, not necessarily a shared knowledge of Polish school or work life. Ultimately, this film does nothing more and nothing less than capture the mind and memories of a college-type urban youth, and so could easily be criticized for offering little in terms of commentary or guidance on these experiences. In fact, it all seems quite pointless at times, but this only serves to deepen the reality of Marczak's portrait - because any self-awareness or normative narrative in this film wouldn't make it a true portrait, a true image of the mind. If Marczak set out to get in the mind of myself and those with similar experiences to me when he made this movie, he has succeeded beyond my wildest expectations.",
         "\"All These Sleepless Nights\" (2016 release from Poland; 100 min.) brings the story of two college-aged friends, Krzysztof and Michal. As the movie opens, we are informed what the meaning of the term \"Reminiscence Bump\" is while massive fire works go off. We then watch Michal at a party interacting with Monika, who looks to be an ex-girlfriend. After that, we follow the two guys as they roam the streets of Warsaw, seemingly going from one party to the next, and the next after that, while they discuss love and the meaning of life. Then one day at yet another party, they run into Eva, who takes an immediate liking to the guys. What will become of the guys? And of Eva? To tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: this is the latest movie from up-and-coming Polish writer-director Michal Marczak, best known as a documentary maker. Which leads me to ask: is this movie a documentary or a fiction feature in which the characters happen to play themselves? (I didn't realize that until seeing the end credits.) When I said I should spoil more of the plot, you need to take this with a grain of salt, as there really is no plot to speak of, and much of what we see playing out appears to be improvised. In fact, this movie reminds me of the latest Terrence Mallick movie \"Song to Song. Let me admit that I struggled big time to make it to the end of \"All These Sleepless Nights\", as I never connected with any of these characters (or real people), I kept hoping that it would draw me in eventually, but it simply didn't happen. \"All These sleepless Nights\" opened this weekend out of the blue and without any fanfare at my local art-house theater here in Cincinnati. The Saturday matinée screening where I saw this at was attended poorly (4 people, including myself). Given the abstract-leaning and plot-less nature of this movie, I cannot see this playing more than one week in the theater. So if watching a mostly abstract film from Poland that may or may not be a documentary seems like your cup of tea, you'll most likely have to catch it on VOD or eventually on DVD/Blu-ray.",
         "This is a well photographed narrative film made by people playing characters who are acting out a life as if not being filmed. It's a moving photograph and not much more. People of this age like this are rarely interesting except to other people like this and of this age. The main character is exactly what he's supposed to be in his early 20s except he's a bit too destructive and self destructive. Kris is a self- involved early 20 something who parties every night of his life away. Cool - whatever, and boring. I felt that it's motivation was to show a glimpse of what it's really like when... I even had a few \"Oh Yeah I remember when I ...\" moments. I couldn't stay for the whole movie. I didn't care enough to hang in there. Those boys will be fine or not regardless of whether or not I care. It doesn't matter if I care and I didn't.",
         "It may be gorgeous, but it's superficial, repetitive and totally incohesive. Some say it's a hybrid of fiction and documentary, but nothing seemed real to me, it was more like a mix of two overrated directors, Gaspar Noé and Terrence Malick with pulsating music. I think the attention turns to the fact that it's a documentary, but that's not important, I don't think anyone would care about the real-life protagonist or a fictional version of him, no one would repeatedly watch him (totally sober) drinking, dancing, doing drugs and talking random things with friends (that is, literally, what happens 90% of the movie)."
      ],
      "genres": [
         "Documentary",
         "Drama"
      ],
      "productionCompanies": [
         "Endorfina Studio",
         "Pulse Films",
         "Studio PUK"
      ],
      "summaries": ["A new era is coming, and Warsaw stands uncomfortably at its edge. Art school classmates Christopher and Michal, on the precipice of their own coming of age, restlessly roam their city's streets in search of living forever inside the beautiful moment. Never content with answers, they push each experience to its breaking point, testing what it might mean to be truly awake in a world that seems satisfied to be asleep."],
      "budget": 0
   },
   "movielensId": 165841,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "2016-11-04",
      "dvdReleaseDate": null,
      "directors": ["Michal Marczak"],
      "runtime": 100,
      "movieId": 165841,
      "title": "All These Sleepless Nights",
      "mpaa": "",
      "actors": [
         "Krzysztof Baginski",
         "Michal Huszcza",
         "Eva Lebuef",
         "Adam Repucha",
         "Kaja Kukuła",
         "Małgorzata Piernik",
         "Aleksandra Talacha",
         "Natalia Atmańska"
      ],
      "imdbMovieId": "5146068",
      "originalTitle": "All These Sleepless Nights",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["toRRACvGp60"],
      "plotSummary": "What does it mean to be awake in a world that seems satisfied to be asleep? Kris and Michal push their experiences of life and love to a breaking point as they restlessly roam the city streets in search of answers, adrift in the euphoria and uncertainty of youth.",
      "tmdbMovieId": 376386,
      "avgRating": 4,
      "releaseYear": "2016",
      "numRatings": 10,
      "posterPath": "/osUPjUFURORZYzmgQAzFhGHvNQL.jpg"
   }
}