{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "live television",
            "id": 160424
         }
      ],
      "imdb_id": "tt5278592",
      "video": false,
      "title": "Kate Plays Christine",
      "recommendations": [],
      "backdrop_path": "/t5M22KgcyCj22MWRiWBJruIQpus.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Christine Chubbuck",
               "gender": 1,
               "credit_id": "555770df9251411e54005cb2",
               "name": "Kate Lyn Sheil",
               "profile_path": "/mQYnmIY2gGOOKaCxoxKzUue1E9u.jpg",
               "id": 582722,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57a20eccc3a3682e760004ba",
               "name": "Dr. Steven C. Bovio",
               "profile_path": null,
               "id": 1660852,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Herself",
               "gender": 0,
               "credit_id": "57a20ed89251415f2c0033f6",
               "name": "Stephanie Coatney",
               "profile_path": null,
               "id": 1660853,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57a20efa9251415c2400051b",
               "name": "Michael Ray Davis",
               "profile_path": "/giGdYEK7OnFnUnEvqExMgrgnCND.jpg",
               "id": 1318171,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57a20f099251415bd8000592",
               "name": "Zachary Gossett",
               "profile_path": null,
               "id": 1264607,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57a20f38c3a3682ecd000613",
               "name": "Rod Grant",
               "profile_path": null,
               "id": 1319055,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57a20f529251417847002aed",
               "name": "Holland Hayes",
               "profile_path": null,
               "id": 112101,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "555770ef9251411e5100631e",
               "name": "Robert Greene",
               "profile_path": "/TNpnVt3YNp60g08C1HUloTD0CC.jpg",
               "id": 929343,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57a20e3f9251417873002a5b",
               "name": "Robert Greene",
               "profile_path": "/TNpnVt3YNp60g08C1HUloTD0CC.jpg",
               "id": 929343,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e4d925141787f002a2a",
               "name": "Susan Bedusa",
               "profile_path": null,
               "id": 1001643,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e599251415bd8000529",
               "name": "Bennett Elliott",
               "profile_path": null,
               "id": 1660850,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e6b9251417847002a8b",
               "name": "Christos V. Konstantakopoulos",
               "profile_path": null,
               "id": 1095303,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e79c3a3682eca000519",
               "name": "Danielle Rosen",
               "profile_path": null,
               "id": 1001645,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e889251415bd8000550",
               "name": "Douglas Tirola",
               "profile_path": null,
               "id": 91186,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20e979251417805002aaf",
               "name": "Olivia Zimmerman",
               "profile_path": null,
               "id": 1660851,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a20ea8c3a3682ecd0005cf",
               "name": "Sean Price Williams",
               "profile_path": "/2NAYwfkuQ1p4i8gmzXOd464FnYr.jpg",
               "id": 1073579,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57a20eb3c3a3682e0f000593",
               "name": "Robert Greene",
               "profile_path": "/TNpnVt3YNp60g08C1HUloTD0CC.jpg",
               "id": 929343,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.639499,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 340484,
      "vote_count": 9,
      "budget": 0,
      "overview": "Follow actress Kate Lyn Sheil as she prepares for her next role: playing Christine Chubbuck, a Florida newscaster who committed suicide live on-air in 1974. As Kate investigates Chubbuck’s story, uncovering new clues and information, she becomes increasingly obsessed with her subject.",
      "similar": [
         36950,
         343,
         842,
         20453,
         284276,
         996,
         43923,
         9621,
         2048,
         59967,
         77949,
         746,
         221902,
         58857,
         590,
         2275,
         14537,
         168098,
         1427,
         4771
      ],
      "original_title": "Kate Plays Christine",
      "runtime": 112,
      "poster_path": "/v1bvMZjTjh95ZldRr2rlMrihCoy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Prewar Cinema Productions",
            "id": 30401,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "4th Row Films",
            "id": 14007,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Faliro House Productions",
            "id": 19246,
            "origin_country": "GR"
         },
         {
            "logo_path": null,
            "name": "House of Nod",
            "id": 80016,
            "origin_country": ""
         }
      ],
      "release_date": "2016-01-24",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.kateplayschristine.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Greene"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Robert Greene"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5278592/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTUyOTY4NjE1MF5BMl5BanBnXkFtZTgwMjU1NTA1OTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Steven C. Bovio",
         "Christine Chubbuck",
         "Stephanie Coatney"
      ],
      "reviews": [
         "It was a strange coincidence this past Sundance when two movies about the same subject - Christine Chubbuck - played in competition. Christine, the other movie, is a conventional biopic, one that I found to be the best movie I've seen so far this year; this take on Christine Chubbuck is a documentary approach. Kind of. Kate Plays Christine centers around Kate Lynn Sheil preparing for the role of Christine Chubbuck in a low-budget biopic. We follow her through the preparation period, which consists of research, getting a tan, getting fitted for a wig, calling Chubbuck's former news station in order to gain access to archive footage of Christine, and interviews with locals from Sarasota Florida about Christine. This all is interspersed with footage from this biopic in-the-making. This is where the film's premise is going to confuse an average viewer, this biopic that's being filmed isn't actually \"real\". There is no movie actually being made within this 'documentary' to be seen, though what little is seen, looks terrible. Kate Lynn Sheil also, I was surprised, by how bad her performance is in these scenes. Yet, as I continued to watch the movie, I began to realize, that was the point. In Christine, we see Rebecca Hall's take on Chubbuck as someone who wants to be a reporter in a bigger market, but her actual aptitude for being a reporter, as portrayed by Hall, leaves you wondering why she chose this particular field in the first place. A co-worker of Christine's even says, before presenting rare footage of the actual Christine Chubbuck giving an interview says, 'she wasn't the greatest interviewer'. Which leads me to believe that Kate Lyn Sheil is playing this part badly on purpose to imitate Christine Chubbuck's failure to be a reporter the way that she wanted to be. The \"movie\" within the documentary is bad as a statement that a biopic about someone truly unknowable, like Christine Chubbuck, shouldn't be made. Though the execution of this concept isn't perfect, it has enough to admire within it to give it a watch. Though I disagree with the statement that's most likely being made about Christine, and even to some extent, itself, I respect why the filmmakers would take that stance. Robert Greene and Kate Lyn Sheil are the reasons this movie works, with a lesser director and actress, this could've easily been a complete disaster, but somehow, this tricky material finds its way.",
         "SPOILERS Although I'm not entirely questioning the psychological hoops those in the field of acting have to go through, I do question just how much of this was either a) scripted b) pushed That is not to say they do not experience struggles of their own when they are playing such a deep, dark role. Add to that this role is true, not made up, has to mess with one's mind even more. But with re-enactments and the fact that Kate Lyn Sheil is 'auditioning' for a role for a film that doesn't even exist, it's hard to believe anything that is going on. It feels as though those involved are merely trying to drive the point home to the viewers- the same point Christine Chubbuck was trying to make when she attempted suicide on a live news broadcast on July 15, 1974. We are a society that cares less about the news that matters and more about the news that involves death and gore, even if it doesn't effect anybody but those directly involved. Ironically, Kate Lyn Sheil proceeds to reenact the shooting, which is filmed and shown to the viewer. But not until she's given a speech of her own about the interest in the gore by the public. Just like Christine Chubbuck did prior to shooting herself. I understand getting into the character, and making it believable. It just appeared too forced to believe this was all really going on.",
         "Chubbuck's death was a very deliberate performance. It was even scripted, with material provided for a subsequent newscaster to read out after her death. How did she prepare herself to be able to go through with this, to play this role? Enter actress Kate Lyn Sheil, ostensibly preparing to play Chubbuck in a TV movie (which, needless to say, doesn't really exist). The film carries us through her process, right up to that challenging final scene. Can she imitate what Chubbuck did, or will her increasing closeness to her character actually make it harder? In the curious absence of footage of the dead woman - to help her get her movement and intonation right. The more she researches Chubbuck's decidedly unremarkable life, the more she seems to slip into depression herself - and how much of this is Sheil-as-self or Sheil-as-actor is hard to determine - so that by that final scene, having seen her buy a gun, one can't help but wonder if she has dangerous plans of her own. Sheil increasingly questions the ethics of showing the death at all, even as a reconstruction. Why do we need to see it? Greene, however, has carefully primed the viewer, from that first scene all the way through a script peppered with references to it, deliberately piquing curiosity. It's easy to connect with Sheil's developing obsession, harder to walk the same path. In this way, Greene forces us to ask questions about ourselves as well.",
         "Christine Chubbuck, a small town Newscaster and local TV personality, is the subject of this doc, in which an actress tries to inhabit the persona of Christine during the last few days of her life, but never quite manages the task. Obviously this role would probably have been amazing in the hands of someone as talented as, say, Meryl Streep or Glenn Close, but the poor unknown actress who up to this point has had only minor roles, who is trying to play Christine, is WAY out of her league. The attempt here is to make the actress, Kate Lyn Sheil, a stand-in for Christine, by changing her makeup, adding a wig and colored contact lenses, having her re-live Christine's last days in her Sarasota FL location, but unfortunately Kate is just not strong enough to manage the difficulty of channeling Christine, a complex, driven, obviously manic depressive woman, who's message to humanity is completely misinterpreted. As almost everyone in the film mentions, the suicide was the inspiration for the brilliant screenplay of \"Network\" and is quoted many times throughout this doc. Of course, the storyline was changed significantly and the suicide was turned into an assassination, and the character that would have been a seriously manic young woman was turned into the unstable old man played by Peter Finch, so there is no real comparison between the two films. Additionally, the doc also suffers from a lack of insight into its lead character. Although the promo leads one to believe that there will be some insight into the mindset of Christine and the incident that the doc is based on, the on-air suicide, there is none present, except for a short interview with a local psychologist. As for Christine herself, we barely see her: All we get to see is a very short glimpse of the real Christine, for about 30 secs or less, during a very routine interview at what looks like a small-town public access TV station, and her voice is almost completely drowned out by the actress and the other former TV crew talking about her, instead of just letting the audience watch her conducting a meaningless interview -- the one time we get a tiny glimpse of Christine's soul, she is completely ignored. How ironic! Even in a doc about her, the filmmaker's egos trumped their own subject. Christine read a carefully worded statement but it seems as though none of the film's Producers or Director spent much time dissecting it, rather putting their effort into a misguided re-enactment which falls flat and is ultimately defeated by the film crew at the end cleaning up the actress and doing away with the mess. It is all washed away, just as Christine's statement was but an ignorant mass media. Kate, the actress, to her credit, makes a valiant attempt to give Christine a voice, gets to the edge and looks over, but never makes the leap. Even as the crew sets up the false studio and recreates the fatal newscast, Kate hesitates a few times before steeling herself for the final scene. But it's never satisfying -- it has an anti-climatic feel about it all. it comes off as being stagey, unrealistic and has a very low-budget feel about it. Although the film makes a great effort to interview everyone that Christine had contact with, there seems to be a lot of key people missing -- there are some side references to a pair of brothers who are never really addressed, and one wonders what happened to both of them? Did they also commit suicide? Or were they just never contacted? The film seems to create more questions than it answers. The actual tape of Christine's suicide, showing her putting a gun to her head and pulling the trigger, has never been shown after the day of the incident, and even though it is referred to by the other men of the TV crew, no explanation is given as to the present whereabouts of the tape, other than that it is not available. Apparently a tape of the actual event has now been located, and after all the efforts to get it released, it still remains to be seen whether the widow of the station owner will allow anyone to broadcast it ever again. Perhaps the tape may hold some hidden inner message that Christine wanted to impart to the world, but for whatever reason, the world wants to forget.",
         "I want to be diplomatic and not call this garbage but\u0085Ellie Kemper's less talented hipster cousin embarks on preparation of a role for a film that does not seem to exist (there is no record of it on IMDb and the news stories about the doc do not mention where it went. Did Greene set out to make the movie and then realize how awful all of his actors were and then change direction to salvage the footage by turning it into this \"documentary\"?) She looks nothing like the real Christine and any amount of spray tan and colored contacts aren't convincing enough to make us believe it. (The wig is the worst \"performer\" in this doc...as I'm typing this there's a scene where she TAKES IT SWIMMING. Girl, you want to be a real actress, don't be that much of a dumbass.) I'm confused why this got so much praise, I found it to be a frustrating watch.",
         "In 2016, two films about the late 1970's Florida newscaster Christine Chubbuck were released: this one, which is a nonfiction documentary, and another, which is more of a historical drama. It's surprising to me that the latter of the two was much better. The dramatization captured not only the Seventies psychedelic vibe very well with its muted yellow colours and its placement of fashion and music, but its portrayal of Christine herself was also more realistic. I don't know why the documentary was made. On the positive side, it points out that there really is no reason to seek out the gory tape of Chubbuck's tragic death other than for sadists to get off on, or for the public to turn into a morbid curiosity. It also gives viewers the chance to hear opinions from Steve Newman (WXLT's TV weatherman and close friend of Christine's) who talks more about Christine's life and personality than the actual suicide itself. Unfortunately 'Kate Plays Christine' comes off largely as a vanity project, focused less on Chubbuck herself and more on hipster-esque actress Kate Lyn Sheil, who looks absolutely nothing like Christine at all, anyway. Her voice is extremely different than Christine's, her eyes are blue instead of brown, and her hair is different. This two-hour documentary mostly features Kate making a ridiculous, self-indulgent spectacle by dressing up as what could only be described as a mannequin version of Chubbuck, with a fake spray tan, plastic-looking wig that keeps falling off, coloured contact lenses and fashions that are supposed to look like they're from the era but obviously never were. On top of that she acts like a nosy stalker, pestering Florida locals with morbid questions of suicide and even going into the gun shop where Cristine herself bought the handgun that did the deed back in 1974, dressed up as Christine with the purpose of buying a gun. The whole display, especially when she walks into what appears to be Chubbuck's final place of residence and creeps around, was rather tasteless. We also get badly recreated scenes of Christine's life, and while most of the background actors were quite good, Kate herself sounded worse than the drama productions that my own local high school does, speaking in a forced monotone that had me laughing when I should have been upset with Christine's plight. While the dramatization film also released this year starring Rebecca Hall at least dealt with the subject matter in a respectful manner, 'Kate Plays Christine' just felt like a mocking, distasteful display of rubbernecking and dredging up a story that those involved seem to want to let rest in peace.",
         "I was really excited to watch this film because experimental and meta are keywords that usually make me pay attention. Kate Plays Christine doesn't quite do it for me however. There were good moments, such as finding the people she worked with (there was no info to ground these on though, we just find out someone found them for Kate somehow). Kate preparing to get into Christine's mindset was also interesting to watch, if not then diluted by scenes of her somehow getting too into that mindset that I find myself suddenly questioning whatever is happening. That wig honestly could've been way better and was really distracting, especially at reenactments that also try to blur the lines between what was scripted and what was real. It and some of the acting made it hard to watch and hard to buy. By the end, everything just feels staged, scripted, and aimed to provoke the viewer, and I could not fall for it.",
         "The idea was great in that we see an actress study her art to be transformed into the tortured soul of Christine Chubbuck who shot herself live on local TV in the 1970's. Kate Lyn Shiel gets to try on some dresses and get a bespoke wig to be transformed into a living embodiment of the late news woman. She also delves into her past to meet some people to talk a bit about the woman they knew. This could have been insightful but instead of that it is all about Kate Lyn Shiel and what a true artist she is to do all this work for such an important role etc. This is self indulgent and pretty insulting. After seeing this I have absolutely no intention of seeing the actual film, a complete vanity project and one could say a cynical attempt to promote the actual product and or milk this project for all it is worth. Whilst it espouses to examine the futile act of sensationalism that Christine did in order to further the 'blood and guts' aims of her TV station – this does exactly the same with the naked furtherance of the projects' own profits and notoriety – shameful.",
         "One to avoid Greene's biography reads like a stalker's rap sheet The approach to narrative is narcissistic and reductive showing a penchant for abuse Sundance Festival's endorsement of Greene's work represents a new low for the movie industry Social media is unlikely to pick this one up In summary, this movie is artistic suicide We can only hope that audiences will vote with their feet Rating = 1",
         "There is some real controversy (among people who care about categories) about whether \"Kate Plays Christine\" is a documentary or not. It doesn't -seem- to be entirely scripted, and writer/director Robert Greene strenuously denies that it is merely scripted drama. But maybe it's in the same general category as \"Survivor\" or \"The Bachelor\", an \"unscripted reality movie\" or something. The blurbs tell you that it's about actress Kate Lyn Sheil's preparation to play the role of Christine Chubbuck, a Sarasota, FL journalist who took her own life on the air in 1974. Well, that's incomplete. I guess the following is a big SPOILER, possibly the biggest one: there is no other movie. This will save you some work if you are like me. Early on I paused the DVD and started checking up on what movie the other movie was that Kate was going to play that role in. There was a different movie in the same year about Chubbuck (\"Christine\"), but Sheil was not in it, was never going to be in it, and it turns out (so far as I know) that these were entirely independent and uncoordinated projects. Greene was never going to direct, and Sheil was never going to act in, a feature-length biopic about Chubbuck, which explains why you never see the kind of organization behind her that you would need for such a film, and answers questions like \"why is Kate going around Sarasota herself talking with old journalists and checking out the gun store? Didn't the author of the screenplay do this stuff?\" No, the subject matter of the film is Kate trying to alter her appearance and reactions to get into the role of Chubbuck, but the sum total of the scripted scenes with Sheil playing the Chubbuck role, along with some local actors, comes to twenty minutes at most, and that was always Greene's plan. I guess maybe this is supposed to actually dawn on you in the course of the film, but if that's what Greene intended I think that's unnecessary mystification, and he could have spelled out his intentions ahead of time. (By the way, this is one of the few cases in which I have actually troubled to go to the DVD features and play back parts of the film with the director's commentary before writing a review. Generally I think the movie should stand on its own without the viewer having to do additional digging. This is another reason why I think there should have been more transparency up front.) If you approach this movie with the idea that you are going to learn the real story about Chubbuck and why she killed herself, this movie is going to disappoint you. One of the early takeaways is that very few people in Sarasota remember her at all. There is no more information about her and her motives than the snippets that mostly came out at the time. Was her suicide really mainly about her not having found love, or a protest against her employer's supposed \"blood-and-guts\"-oriented editorial practices, or was it \"just\" a product of clinical depression, or maybe some other mental disorder(s) or states, and not (mostly) \"about\" any real-world stuff at all? Would it really have not happened if this guy hadn't rejected her, or if the videotape machine hadn't jammed that morning? Obviously no such answers can be found. More worthy of study, perhaps, is the question of anyone (notably Greene, as he is aware) devotes any time to depict or dramatize Chubbuck's suicide, much less persist in hunting for the videotape of the actual suicide, as some do. And what of us, the viewers of \"Kate Plays Christine\"? Are we better than consumers of \"blood and guts\" ourselves? It's not just me asking this question, by the way. Kate's physical transformation into Christine seems unlikely at first, as the two women are pretty dissimilar physically, but as she acquires a wig and colored contacts and studies Christine's mannerisms it becomes surprisingly effective. But even more uncanny is Kate's work at adopting what seems to be Christine's personality. I was struck by a scene in which Kate angrily berates herself for supposedly screwing up a scene, echoing what we think we know about Christine's ragefulness and detestation of failure. (How spontaneous was that rant by Sheil? Was it at all scripted? I didn't play back Greene's commentary for that, so I don't know for certain.) (I am assuming Greene is reliable in his commentary, but this is a judgment.) As the denouement approaches, Kate has obtained a revolver and has learned exactly where Christine put it to the base of her brain, but repeatedly says she doesn't think she can actually re-enact the shooting itself. The question of whether she can and will becomes invested with progressively more dramatic tension, and extends well beyond squeamishness or taste, well into the territory of morality: ought she to pull the trigger? What do we want her to do, and why? Ultimately Kate seems to be imbued with all of Christine's darkest emotions as she brings the film to a close. Greene assures us on the commentary track that this part of the film was not scripted, by him at any rate, and was Kate's own work, unexpected and unguided. As to whether the emotions she displays really have her in their grip, or whether she is deploying them in the service of the film, I could be convinced either way. While the credits roll, Kate removes her Christine-makeup, briefly flashing a smile which prompts Greene to insist on the commentary track that \"she's all right.\" There is no Kate Lyn Sheil commentary track to confirm this with.",
         "This was bad. It tried way too hard to be cool and edgy. And the way it switched back and forth from documentary to acting was just plain confusing and annoying. The other film about Chubbuck was far better and Rebecca Hall was brilliant in it and truly deserving of a nomination for her performance. I will say Kate looked a lot more like Christine than Rebecca did. A few times when she was tan it was actually eerie, but I give this movie one star for that, one for hearing from those who knew Christine, and one for showing some vintage footage of the real Christine Chubbuck. If you are interested in learning about Chubbuck, I definitely recommend the other film over this one.",
         "It seems strange that two films in 2016 were made about a long forgotten on-air suicide in Saratoga, Florida in 1974. It's a bizarre enough event that I was interested in seeing the films. There is a straight-up biopic starring Recca Hall called Christine, but the more interesting film was probably the documentary, Kate Plays Christine (2016). In this documentary by Robert Greene-the audience follows actress Kate Lyn Sheil research and work out how to play the elusive Christine Chubbuck of which there is little existing footage or facts remaining-let alone the infamous tape of the incident. We learn about guns laws of the 70s, the behind-the-scene life at a small local news station, and the private agony that Chubbuck was experiencing at the time of her suicide. Sometimes the pretentious musings of the actress were trying, but in general it was an interesting way to get into the head of this damaged woman who deiced to share her misery with the world.",
         "I think another reviewer here @nick94965 and a few other negative reviews (including one from the New York Times) misunderstand a few things that might put this documentary in a better light. First, I thought the actress was fine, and introspective in a way that made the film work for me. We are watching her work on the character, the raw material and not a finished product. And that's important, and intentional. This documentary is as much about the actress trying to understand through her craft the character of Ms. Christine Chubbuck as it is about the events that led to the latter's suicide. It is dialogic between the two: one seen, one remembered. In my view the director is saying any attempt to just recreate Christine Chubbuck is not going to be fair to her or successful for us, the audience. At several points the actress, Kate, concedes that she cannot grasp Chubbuck's story except in fragments. Of course if they were making a film like Christine (2016), the other film shown at Cannes, we would presumably see another edited and cut interpretation. We're instead looking at process as art imitates life. Second, another essay at the New York Times by Dave Izkoff points out that the movie Network was only marginally related to the events in Florida. The writer of that film added a line about \"the woman in Florida\" but then erased it. The idea behind Network was in fact conceived many years before the Florida tragedy. Nevetheless, the film was juxtaposed successfully within this documentary to illustrate some of the emotions Ms. Chubbuck may have felt about her profession. Third, there is a scene where the former colleagues of Ms. Chubbuck discuss her and show a videotape of Chubbuck engaged in an interview on her community program. One of them is adamant that he has refused to upload any of these old interviews to YouTube out of concern that people were requesting this less to honor Chubbuck's memory than to judge or exploit her memory. He stresses that Christine Chubbuck was opposed to packaging news as \"blood and guts\" sensationalism and yet ironically that's why everyone is interested in seeing these videos or films of her now. The actress at this point expresses sincere sympathy with this idea and holds onto it as a background emotion during the film's denouement. I personally disagree and think it would be fitting if the DVD included some full broadcasts from Christine Chubbuck's interviewing footage as a remembrance. But this camera operator/news professional knew her personally as a young 19 year old and that remains his opinion. *SPOILER ALERT* This sets up the actresses' decision to not pull the trigger. Now this is very likely staged, that is, the director and actress planned this storyline. In the end they're not going to give us the full blood and guts - at least not in a recreative way but in a way that maybe Christine Chubbuck would have appreciated. It is a defiant \"is this what you wanted to see?\" moment that is in keeping with Chubbuck's final message to the extent we can understand it. I found this a perfect resolution that allowed me to reflect on this young woman's tragic choice along with the young actresses' emotional journey without feeling like I was complicit in exploitation. Individuals decide to end their lives every day. It's not often public but it impacts those around them. As a society we should reflect on this. This documentary does not shy away from the positive and negative elements of such a choice. The only criticism I would make of the film is it relies heavily on a single well known Washington Post account by Sally Quinn. I can only assume that remaining family members were not cooperating. One brother is said to be dead and we aren't told how (maybe it's none of our business). But if the family didn't cooperate that fact should have made it into the narrative at some point. And if they were willing then we should have heard more from them directly. Perhaps related to the above, this film seems to have been made on a relatively low budget. It's professional, of course, but corners appear to be cut in choosing locations and sets. Now I'm not a film expert so perhaps I'm getting out from under my skis in saying that. It's my impression. I recommend watching this in conjunction with the 2016 film Christine and also reading the original Washington Post article by Sally Quinn. I like to imagine that perhaps in some other universe a 29 year old Christine Chubbuck made a different choice and went on to a pleasant life of rich memories. And I hope that that Christine Chubbuck would find this documentary respectful and worth watching. \"All men by nature, desire to understand.\" (Aristotle, opening to the Metaphysics)"
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "4th Row Films",
         "Faliro House Productions",
         "House of Nod"
      ],
      "summaries": ["Actress Kate Lyn Sheil prepares to portray the role of Christine Chubbuck, a real-life news reporter who took her own life on national television in 1974."],
      "budget": 0
   },
   "movielensId": 165837,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-01-24",
      "dvdReleaseDate": null,
      "directors": ["Robert Greene"],
      "runtime": 112,
      "movieId": 165837,
      "title": "Kate Plays Christine",
      "mpaa": "",
      "actors": [
         "Kate Lyn Sheil",
         "Dr. Steven C. Bovio",
         "Stephanie Coatney",
         "Michael Ray Davis",
         "Zachary Gossett",
         "Rod Grant",
         "Holland Hayes"
      ],
      "imdbMovieId": "5278592",
      "originalTitle": "Kate Plays Christine",
      "genres": [
         "Documentary",
         "Drama"
      ],
      "youtubeTrailerIds": ["buzA1KREcwk"],
      "plotSummary": "Follow actress Kate Lyn Sheil as she prepares for her next role: playing Christine Chubbuck, a Florida newscaster who committed suicide live on-air in 1974. As Kate investigates Chubbuck’s story, uncovering new clues and information, she becomes increasingly obsessed with her subject.",
      "tmdbMovieId": 340484,
      "avgRating": 3.16667,
      "releaseYear": "2016",
      "numRatings": 9,
      "posterPath": "/v1bvMZjTjh95ZldRr2rlMrihCoy.jpg"
   }
}