{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "brit noir",
         "id": 155451
      }],
      "imdb_id": "tt0040325",
      "video": false,
      "title": "Escape",
      "recommendations": [
         26663,
         26220,
         27446,
         26948,
         26666,
         32945,
         30196
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Matt Denant",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd123",
               "name": "Rex Harrison",
               "profile_path": "/nWFxAoYfFURmIxz9YJBQ9DLcDx6.jpg",
               "id": 35321,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Dora Winton",
               "gender": 1,
               "credit_id": "52fe45d5c3a36847f80dd127",
               "name": "Peggy Cummins",
               "profile_path": "/b8nfyYtJaG2m68zDl1XGAhPMas8.jpg",
               "id": 86001,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Inspector Harris",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd12b",
               "name": "William Hartnell",
               "profile_path": "/4vfk0bAtRoSnScLcNAYCXMwYzTI.jpg",
               "id": 73245,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Minister",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd12f",
               "name": "Norman Wooland",
               "profile_path": "/9LDf23dUsVySernQ3t6J7ILIF0a.jpg",
               "id": 31296,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Grace Winton",
               "gender": 0,
               "credit_id": "52fe45d5c3a36847f80dd133",
               "name": "Jill Esmond",
               "profile_path": "/6ycUNWGU6Du41sf9XhbO2llKApy.jpg",
               "id": 122910,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Brownie",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd137",
               "name": "Frederick Piper",
               "profile_path": "/g8O3r1EvBrnZu8MRTG3LVo9XmCO.jpg",
               "id": 3679,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Mrs. Pinkem",
               "gender": 1,
               "credit_id": "52fe45d5c3a36847f80dd13b",
               "name": "Marjorie Rhodes",
               "profile_path": "/g7wGXz09zYBFZL0wigEXEdWqZYU.jpg",
               "id": 127023,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Girl in Park",
               "gender": 0,
               "credit_id": "52fe45d5c3a36847f80dd13f",
               "name": "Betty Ann Davies",
               "profile_path": "/rRvbh8E1QLEg8Ri1iwpSmBdpfZA.jpg",
               "id": 106631,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Rodgers",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd143",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Salesman",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd147",
               "name": "John Slater",
               "profile_path": "/zRprk1DT6hMU87ddEafmdRWIvfk.jpg",
               "id": 107434,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Constable Beames",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd14b",
               "name": "Frank Pettingell",
               "profile_path": null,
               "id": 106626,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Detective Penter",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd14f",
               "name": "Michael Golden",
               "profile_path": "/emN5VF70xqHsR29BNXF5QWeRrSa.jpg",
               "id": 11139,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Judge",
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd153",
               "name": "Frederick Leister",
               "profile_path": null,
               "id": 127024,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd0f5",
               "name": "Joseph L. Mankiewicz",
               "profile_path": "/4nXrV7vGy3V6hgMVw7nTiVJhZpY.jpg",
               "id": 10601,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd0fb",
               "name": "Philip Dunne",
               "profile_path": null,
               "id": 116326,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d5c3a36847f80dd101",
               "name": "John Galsworthy",
               "profile_path": null,
               "id": 127022,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd107",
               "name": "William Perlberg",
               "profile_path": null,
               "id": 26024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd10d",
               "name": "William Alwyn",
               "profile_path": null,
               "id": 39054,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd113",
               "name": "Freddie Young",
               "profile_path": null,
               "id": 10079,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d5c3a36847f80dd119",
               "name": "Kenneth Heeley-Ray",
               "profile_path": null,
               "id": 91888,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a36847f80dd11f",
               "name": "Alan Jaggs",
               "profile_path": null,
               "id": 18665,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [],
      "popularity": 0.504061,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 41599,
      "vote_count": 4,
      "budget": 0,
      "overview": "Escape is a thriller about a World War II vet who goes to prison for murder and then escapes. He meets a woman who tries to get him to surrender.",
      "similar": [
         38103,
         38962,
         43461,
         44902,
         92429,
         54392,
         22334,
         31597,
         20806,
         73208,
         30784,
         13385,
         81185,
         60759,
         27112,
         259183,
         22925,
         3014,
         49334,
         74759
      ],
      "original_title": "Escape",
      "runtime": 78,
      "poster_path": "/yQ6btnIg1UAR1LheVxDcAOkJLOP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Twentieth Century-Fox Productions",
            "id": 11865,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1948-03-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Joseph L. Mankiewicz"],
      "runtime": 78,
      "synopsis": "Matt Denant, ex-RAF flier, sentenced to three years in Dartmoor for striking and accidentally killing a detective who was attempting to arrest a lady of the evening to whom Denant had been casually speaking. Rankling under the injustice, Denant flees prision and manages to dodge the police with the aid of a beautiful shire lass with whom he has fallen in love and whose ideas, like those of the freedom-loving Denant, are slightly unconventional. However, hounded by both an indomitable constabulary and a conventional citizenry, Denant, who has sought sanctuary in a village church, finally gives himself up in order to save its parson from lying.",
      "writers": [
         "Philip Dunne",
         "John Galsworthy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040325/",
      "coverLink": null,
      "actors": [
         "Rex Harrison",
         "Peggy Cummins",
         "William Hartnell"
      ],
      "reviews": [
         "This is a fairly elusive early film by Mank and it's nice to get the chance to catch up with it in the Mank season at the NFT - where, bizarrely, they're showing 19 out of the 20 movies he directed and inexplicably omitting Somewhere In The Night which is freely available on DVD. The original work was by John Galsworthy no less but brought up to date by Phillip Dunn in his third and last screenplay for Mank. The whole thing takes place in an England located not so much off the coast of France as on the shady side of Neptune and one that only viewers over sixty have even a ghost of a chance of recognizing. Rex Harrison plays the sort of man who, in the post-war austerity of 1948, thinks nothing of piloting a private plane, spending a day at the races and happily laying out £50 (a fortune in those days) on behalf of a mechanic at the aerodrome, who picks a horse that comes in last. Later, strolling through the park he falls into conversation with a prostitute and when she is apprehended by a detective Harrison, ever the gallant, lays him out. Alas, his head comes into contact with a park bench and he winds up with a tag on his toe. Harrison, ever the gentleman, stays around til the police arrive and winds up doing three years on Dartmoor. Naturally he is incensed and escapes at the first opportunity, runs across Peggy Cummins riding to hounds, who then becomes the friendly female helping a fugitive mandatory in such films. It's all good fun and Mank wraps it up in 78 minutes. For Mank completists it is, of course, a must, but others will probably enjoy it if they're fairly undemanding.",
         "The acting of the main characters - Harrison, Cummins and Hartnell - are convincing but generally lack a great deal of passion. Everyone behaves pretty much as one would expect. There are many twists and turns in the plot but these are often fairly predictable; one is rarely surprised. The settings - prison, village, moor, country cottage, are just what they're supposed to be, no more, no less. The dialogue is convincing, and also just what you might expect. There is variety of tone and many moments of humour, darker points, philosophical themes regarding justice, honour and life. Generally, the film takes its time making its points, just so you don't miss them. So it rolls along in an amiable manner and is enjoyable to watch; however, it does lack some of the sparkle of the 1930 version.",
         "An ex-RAF gentleman pilot (Denant) has casual speech with a girl in a park, a girl of the night. As he leaves, a heavy handed police detective attempts to roughly arrest the girl, and Denant turns back to politely intervene, a \"there's no need for that\". The detective is a petty tyrant, out to make his bust of a poor working girl, though she had only been on the bench, not on the game. The two men tussle—the long arm of the law and the stronger arm of the righteous gentleman. The law falls, Denant stays righteous and is sent down for his pains. Soon he breaks out and goes on the run, as a righteous matter of principle. He falls in with Dora, a daughter of a well respected family, whose family has fallen financially, and she is engaged for lucre not love. Stretching credulity, she very readily casts in her lot with him, defying the injustice of the law, and committing ever more until she's dropped her intended, exchanging lucre for love. For Denant's part, he comes to accept that human justice is imperfect, and if you don't like it it might be better to lump it. Some reviewer has strangely suggested that God's direct voice features. That misses a big point: at most, it's God's indirect voice through a church leader, who philosophises that hearing God's voice is often difficult, even for Christians, in a fallen world. In short, moral decisions aren't always perfect—even as in chess several different moves according to objective rules can be good, and a seeming good move might be ill-judged. Should the church leader, as a law-abider, turn Denant in, or as a God-abider should he conceal Denant who has claimed sanctuary? What sanctuary remains in the world? Should Denant willingly suffer the slings and arrows of outrageous fortune? The film is explorative. Its conclusion is clear about some decisions, but not clear about some conclusions, such as whether recapture will lead to extended jail time, or possibly a retrial, especially if a missing witness were to come forward. The imperfection of human justice, the futility of opposing it, the individual's freedom of choice even under Big Brother (sorry David & Teresa, lol), what it means to be human, all are looked at in this play.",
         "In the 1940s British country police were often portrayed in the visual media as slow & witless and \"Escape\"(1948) is no exception, what we in Britain called \"Plod\".They were portrayed as \"yokels\" working for underfunded constabularies by central government, when local police could only give chase on bicycles to criminals driving stolen cars.They made illogical assumptions that a man & woman in a vehicle \"must be Americans\" without checking the facts.The heroine Peggy Cummings' character comes over as too naive and too ready to believe Rex Harrison's (RH) story even suggesting to her sister they should let him use their car to escape!There is a pathetic shot of RH trying to fly off in a monoplane which then crashes and which only causes RH a sprained shoulder!In one scene he causes criminal damage by setting the monoplane alight.In another scene RH compounds the offence by assaulting George Woodbridge (who plays an armed farmer) as he attempts to evade justice. However, we viewers do have some sympathy for RH's character for being found guilty of manslaughter and being sentenced to 3 years in Dartmoor prison.Towards the end of his escape he tries to obtain medieval sanctuary meeting Derick de Marney who plays a priest (and who played a similar role as RH in Hitchcocks 1933 \"Young & Innocent).Derick proceeds to talk theology and philosophy to RH in the hope RH will surrender to the police.Peggy Cummings enters the church having previously unbidden told RH of her love & belief in him.With the police threatening to obtain a search warrant and before the priest can comment on RH's whereabouts, RH volunteers to surrender to law & order and is promptly driven back to Dartmoor, presumably to finish his sentence with I presume greater length added for all his further misdemeanors committed.The producers therefore leave moral questions in the air, just posing them.My rating just 6/10",
         "This is of course a remake of the 1930 film starring Gordon Harker.This was the second film made by Associated Talking Pictures at Ealing.It is therefore rather primitive when compared to this film which gives it a Holluywood makeover,notwithstanding the fact that it was made in the UK by Fox.Given the use of the quotation from Galsworthy at the end one can only assume that this film is somehow supposed to teach a moral lesson and inspire faith in the workings of the machinery of Justice.Ironic when you think of the miscarriage of justice that was going on at the time with the infamous Christie case just one example of the way justice was not working.The problem with this story is that since it would appear that the crime was committed ,the protestations of wrongful conviction rather fall on deaf ears.",
         "Although based on a play,unlike many Mankiewicz' s movies,this one is no \"filmed stage production\" style .It even sometimes recall Hitchcock's 'the thirty-nine steps \" for the bulk of the action is a chase . A strong performance by Rex Harrison (who would be the star of three other Mankiewicz works :\" the ghost and Mrs Muir\" \" the overlooked \"honey pot\" and the largely underrated \"Cleopatra \" in which he was the best Julius Ceasar in the history of cinema),who is sentenced to jail (three years!)for what he considers a just act.Actually what happened to him could happen to anyone .That's why it's so easy to identify with him and to feel he had been treated unfairly. \"Escape\" has two meanings :escape from jail for the convict ,escape from a world she does not fit in for Dora:she's going to make a money match ,because \"she's tired of being poor\" ,but she realizes ,after meeting the fugitive that she would live in a prison too. This is an offbeat story ;the conclusion is not what the audience is expecting and may be off-putting for some viewers.God himself intervenes ,and ,as the priest says ,only Him can judge man,only his justice is infallible.Besides ,one of the hero's friends betrays him to get Judas' thirty pieces of silver.",
         "\"Escape\" (1948) is an important film noir that is not yet available on DVD, despite its sterling cast (Rex Harrison, Peggy Cummins, Cyril Cusack, William Hartnell) and its high-grade production values. Philip Dunne and Donald Ogden Stewart worked on the script from the 1927 stage play by John Galsworthy. The movie also boasts music by William Alwyn, camera-work by Freddie Young, and it was brilliantly directed by Joseph L. Mankiewicz. For once in a Mankiewicz movie, the script is not top-heavy with dialogue (as are just abut all of Joseph L. Mankiewicx's other movies). In fact, at a neat 78 minutes, this film is at least 20 minutes shorter than any other Mankiewicz productions. Rex Harrison is perfectly cast as the unlucky hero, while William Hartnell interprets a cynical police inspector in fine style (one of the best roles he was ever handed). Peggy Cummins is effective too, although none too flatteringly costumed and photographed. (At this time, the movie does not seem to be available on DVD, but you may find it on VHS if you're lucky).",
         "In the hands of Joseph Mankiewicz, this version of John Galsworthy's play First produced in the West End in 1926 with Leslie Howard, and previously filmed in 1930 with Gerald du Maurier is predictably verbose but like Joseph Losey's 'Figures in a Landscape' works equally well as a location-shot thriller and as an existential drama. The law is depicting going about its usual business of persecuting the law-abiding when a boorish detective ends up hitting his head in one of those accidents so common in the movies; for this, war hero Rex Harrison gets three years in Dartmoor for manslaughter. The film doesn't make it clear how much of his time he's served when he makes a break for it in the fog, but his chances don't seem very good; and the evident irony of the title is compounded by plot contrivances like the way Peggy Cummins' path keeps crossing that of Harrison. Miss Cummins is obviously in a trap of her own, betrothed to a man she doesn't love; and she's given a lot of didactic dialogue which it seems as unlikely that a human being would actually say in conversation as some of the things the script requires detective William Hartnell to say. Never mind. Although you know this can't end well, there's plenty of action, enlivened by Freddie Young's location photography on Dartmoor; and it builds up to a satisfying - and moderately hopeful - conclusion for which we have been prepared by a tremendous scene with Norman Wooland as the sympathetic parson. He talks a lot of sense (\"The church was endowed by God, but is managed by men; and where there are men there are doubts and confusion\"); and since he has just said \"Our human laws are as fallible as the men who make them\", the quotation from Galsworthy with which the film concludes (\"The law is what it is - a majestic edifice sheltering all of us, each stone rests on another\") seems intended either to placate the censors or to be taken with a pinch of salt.",
         "A dark story of injustice, charting the hopelessness of a fugitive not from justice but from the law, which has failed in giving justice. Rex Harrison is a former war hero who defends a defenseless girl in a park and accidentally gets into more trouble than he bargained for, with fatal consequences, for a villain who deserved it, and for himself, who has to survive it. It's a great story by John Galsworthy with many instructive insights on the way. It's kind of an exploration of the problems of injustice. Anyway, risking his life and prolonged sentence by escaping, he does win something on the way, which he wouldn't if he hadn't risked everything for freedom. Joseph Mankiewicz' direction displays all the literary deserts of the story and communicates it well with clarity and detached poignancy. It's a small film but the greater for its spartan concentration, containing much more than what any film can show.",
         "Peggy Cummins (92 at this writing) is probably best known for her portrayal of a gun-happy gal in the classic noir \"Gun Crazy\" from 1950. After winning the lead in 1947's Forever Amber over 200 auditioners, she was replaced by Linda Darnell because the producers decided she wasn't famous enough. Here she is in a programmer, \"Escape\" from 1948, alongside Rex Harrison. Harrison plays Matt DEnant, convicted of manslaughter after an accident involving a policeman. It was a just act, defending a woman talking with him in the park; he punched the police officer, who hit his head on the bench and died as a result. Matt is sentenced to three years in prison which he doesn't want to spend for something he doesn't feel responsible for. He escapes during a thick fog and is caught by a young upper class woman, Dora Winton, as he's stealing her breakfast in her bedroom. She feels sorry for him and gives him a coat and hat, and he takes off as the police search her family's house. Matt runs into Dora again when a car he stole breaks down, and again, she helps him. Unfortunately, while she helps him, another friend does not, and he nearly walks into a trap. He learns that she's engaged to a man she doesn't love, strictly for money as her family has fallen on hard times. She doesn't think three years is all that long to serve, and points out that if Matt has to run and hide the rest of his life, isn't that prison too? Good story with good performances. There are a couple of messages here - there are different kinds of prisons, and different kinds of laws. As a priest tells Matt, God's law is infallible. Man's is not. The end is unexpected, at least it was by me."
      ],
      "genres": [
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Twentieth Century-Fox Productions"],
      "summaries": ["A convict sentenced to three years for killing a detective escapes from a prison and goes on the run aided by a local girl."],
      "budget": 0
   },
   "movielensId": 166273,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-03-01",
      "dvdReleaseDate": null,
      "directors": ["Joseph L. Mankiewicz"],
      "runtime": 78,
      "movieId": 166273,
      "title": "Escape",
      "mpaa": "",
      "actors": [
         "Rex Harrison",
         "Peggy Cummins",
         "William Hartnell",
         "Norman Wooland",
         "Jill Esmond",
         "Frederick Piper",
         "Marjorie Rhodes",
         "Betty Ann Davies",
         "Cyril Cusack",
         "John Slater",
         "Frank Pettingell",
         "Michael Golden",
         "Frederick Leister"
      ],
      "imdbMovieId": "0040325",
      "originalTitle": "Escape",
      "genres": [""],
      "youtubeTrailerIds": ["pT-jSwn2N_s"],
      "plotSummary": "Escape is a thriller about a World War II vet who goes to prison for murder and then escapes. He meets a woman who tries to get him to surrender.",
      "tmdbMovieId": 41599,
      "avgRating": 2.66667,
      "releaseYear": "1948",
      "numRatings": 3,
      "posterPath": "/yQ6btnIg1UAR1LheVxDcAOkJLOP.jpg"
   }
}