{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "movie business",
            "id": 886
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "makeup",
            "id": 17974
         },
         {
            "name": "space opera",
            "id": 161176
         },
         {
            "name": "injustice",
            "id": 163119
         },
         {
            "name": "george lucas",
            "id": 204894
         },
         {
            "name": "acting",
            "id": 208586
         },
         {
            "name": "fan convention",
            "id": 208663
         },
         {
            "name": "darth vader",
            "id": 209349
         },
         {
            "name": "convention",
            "id": 211768
         }
      ],
      "imdb_id": "tt2949296",
      "video": false,
      "title": "I Am Your Father",
      "recommendations": [
         338167,
         381043,
         429047,
         284550,
         369605,
         263945,
         362092,
         105379,
         253265,
         209320,
         335149,
         407588,
         224414,
         403011,
         329697,
         89762,
         90030,
         63091,
         3149,
         324421
      ],
      "backdrop_path": "/cQe8vhsR5wstptpJVhTzervay2V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5612287b9251416b56000504",
               "name": "David Prowse",
               "profile_path": "/cJtmBVrjYwawh2cCiAfZkEjPeqc.jpg",
               "id": 24342,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "561228489251416b560004fc",
               "name": "Marcos Cabotá",
               "profile_path": null,
               "id": 588181,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5612282a9251414feb00a789",
               "name": "Marcus Hearn",
               "profile_path": null,
               "id": 1518723,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "56122835925141478d00adbd",
               "name": "Jonathan Rigby",
               "profile_path": null,
               "id": 1380295,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "56122868925141061500760f",
               "name": "Lou Ferrigno",
               "profile_path": "/vDBZd0xCIl8l1tDLDxPqAHSViFS.jpg",
               "id": 19137,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56122872c3a36868170143e3",
               "name": "Kenny Baker",
               "profile_path": "/sdd9rgifNF9C51RejG7sUGU8Bka.jpg",
               "id": 130,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5893a10fc3a36831e40002a8",
               "name": "Gary Kurtz",
               "profile_path": "/q6tgPiNqzEOIYmHxMrpWoUirmmu.jpg",
               "id": 12401,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5893a1dec3a36831e4000366",
               "name": "Robert Watts",
               "profile_path": "/28BlqdvRGNAdbWuzdXAIYissbgZ.jpg",
               "id": 711,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5893a3c9c3a36831e40004d8",
               "name": "Ben Burtt",
               "profile_path": "/nfkHcZkAIGEyJ0m2jtOKaPyqNxu.jpg",
               "id": 670,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5893a46cc3a36831ec000574",
               "name": "Jeremy Bulloch",
               "profile_path": "/yRnHoDmmWKdoLdiscCFfRpzzqMa.jpg",
               "id": 33185,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "561228539251410d8000693a",
               "name": "Manuel M. Velasco",
               "profile_path": null,
               "id": 1195190,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5893a6d8c3a36831d8000734",
               "name": "Eduardo Biurrun",
               "profile_path": null,
               "id": 1385620,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5893a71cc3a36831dc00079f",
               "name": "David Ambit",
               "profile_path": null,
               "id": 1637481,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "5893b1ab9251416d560000ab",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5612277e92514106150075e0",
               "name": "Marcos Cabotá",
               "profile_path": null,
               "id": 588181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56122789c3a36868100149a0",
               "name": "Toni Bestard",
               "profile_path": null,
               "id": 936999,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56122798c3a3686814015854",
               "name": "Marcos Cabotá",
               "profile_path": null,
               "id": 588181,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "561227a3c3a368681f012e89",
               "name": "Toni Bestard",
               "profile_path": null,
               "id": 936999,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5612281cc3a368681f012ea0",
               "name": "Daniel Torrelló",
               "profile_path": null,
               "id": 1518722,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "584b64adc3a368397e0053b7",
               "name": "Tolo Prats",
               "profile_path": null,
               "id": 1518720,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5893add6c3a36831e8000db0",
               "name": "Nicolás Pinzón",
               "profile_path": null,
               "id": 1631627,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5893ae04c3a36831e0000d24",
               "name": "Saúl Benejama",
               "profile_path": null,
               "id": 1749459,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5893b1cfc3a368561b0000da",
               "name": "Marcos Cabotá",
               "profile_path": null,
               "id": 588181,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893b1dfc3a36856280000c8",
               "name": "Toni Bestard",
               "profile_path": null,
               "id": 936999,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893b1ed9251416d47000117",
               "name": "Miquel Verd",
               "profile_path": null,
               "id": 1052167,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.492498,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 362610,
      "vote_count": 25,
      "budget": 0,
      "overview": "David Prowse is an eighty years old actor, who has lived behind Darth Vader's mask during three decades. A group of Star Wars fans find out why he has been apparently forgotten by Lucasfilm during thirty years, and decide to give him back the glory he never had. This is their last opportunity.",
      "similar": [
         13532,
         15800,
         4539,
         91356,
         15302,
         14543,
         81899,
         75311,
         24703,
         37757,
         142988,
         355254,
         379040,
         378674,
         160220,
         276122,
         329697,
         376816,
         305346,
         234652
      ],
      "original_title": "I Am Your Father",
      "runtime": 83,
      "poster_path": "/nm1QIKcs3c8JjVrHgYM6PPmxAqH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Strange Friends",
            "id": 64810,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coproducción España-Reino Unido",
            "id": 64811,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nova Televisió",
            "id": 64812,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Singular Audiovisual",
            "id": 10084,
            "origin_country": ""
         }
      ],
      "release_date": "2015-10-05",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "You know the movies. You know the villain. Now meet the man.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": [
         "Toni Bestard",
         "Marcos Cabotá"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Toni Bestard",
         "Marcos Cabotá"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2949296/",
      "coverLink": null,
      "actors": [
         "Colm Meaney",
         "Lou Ferrigno",
         "Julian Owen"
      ],
      "reviews": [
         "The directors of this documentary, who are Star Wars fans from his childhood, have done a good homage to actor Dave Prowse, the man behind the mask of Darth Vader. Through several interviews with people directly involved in the making of the original Star Wars trilogy the film discovers the reasons that affected the relationship between Prowse and Lucasfilm after finishing the shooting of the original trilogy. Fortunately the film provides different opinions about this matter. Last but not least, their homage also extends to other great film actors that played evil roles behind a mask.",
         "I was in a bar in Nova Scotia when I first heard about this film. A friend of mine, someone who fully engages in his fandom for all things Star Wars, Horror and Conan the Barbarian mentioned over a pint of Guinness about this documentary concerning David Prowse called \"I am your Father\" and how he had been roundly and seemingly unfairly 86'd from the official Star Wars community. At that point I realized for the first time that \"yes, of course.. he's not been in attendance at any of the Star Wars Celebrations\". It seemed baffling, a white wash of an actor who played such an iconic character. I did not see this film until back in England and unceremoniously noticing it on Netflix gave it a click. What you have with \"I am your Father\" is not so much \"a\" documentary as two documentaries intertwined which tell a sad but also uplifting story of fandom, betrayal and ultimately redemption. Sort of. One story is that of Dave Prowse, his career, bodybuilding, Hammer Horror monster, cast as Darth Vader (and The Green Cross Code man at the same time) and how over the years and through misunderstanding, gossip and press intrusion his relationship with LucasFilm soured and he was ostracized from the George Lucas fold. The other story is that of a die-hard fan and an exploration of that fandom. Wanting to be close to the art, the artist, the players that you feel so close to. With that the director Marcos Cabota becomes part of the story, a sort of gonzo documentary if you will (in the Hunter S Thompson sense) with his actions affecting the plot and how the arc of Dave Prowse's relationship with the character of Darth Vader will eventually reach a better conclusion, rewriting history in a sense. What I sincerely appreciated about this film was that it was clear the film maker was genuinely a fan of Star Wars and of Dave Prowse and his portrayal of Darth Vader. This film didn't set out to tell the definitive story of David Prowse and his career (although I think it did a very good job of exploring his trajectory) but to reveal the trouble that can come out of something so wonderful. And how a seemingly innocent and well meaning actor can be treated poorly by the capricious nature of a gigantic media company. You leave the film I believe hoping that George Lucas would at some point see it, make amends and that Dave Prowse's own story would end with redemption in the same way that Darth Vader had its closure at the end of Return of the Jedi (Spoiler... and more about that scene in a moment). The director himself wants to recreate the end of Return of the Jedi with Dave Prowse in Darth Vaders death scene instead of the original actor. I had always found it baffling that they didn't use Dave Prowse as he had more than a passing resemblance to Mark Hamill and could have very well passed as his father with a little aging make up. As for the West Country accent... well that too could have been worked on. The intention of the director to recreate this scene speaks to the level of his fandom and for any massive fan of Star Wars, who wouldn't want to recreate scene or work directly with an actor in a shot for shot remake. And with the intention of righting a perceived wrong this adds to the veritable brilliance of the idea. Now this I can imagine with many people would seem self indulgent, making the director too much the focus and could even be seen as exploitative, but I would disagree. It for me solidifies fandom, completes the circle and gives Dave Prowse the chance to finish his work as that great character. All in all this is a documentary well worth watching if you are a star wars fan or just a fan of cinema in general. There are glimpses into the inner politics of film making/ marketing (it's a ruthless business by all accounts) and the power that LucasFilm holds. It does nothing to tarnish the love and adoration fans have for Star Wars but gives you insight into the life of an actor and thoroughly decent gentleman who could have been treated a lot better and deserves to be front and centre when it comes to Star Wars lore.",
         "I'm amazed by the low ratings and unkind reviews this documentary gets. It seems a lot of people didn't get from this documentary what they wanted, which is indeed different from what I felt the makers intended. It's not only about 'the actor that played Darth Vader' or 'the man behind the mask', it is about a man who has worked six years on a job and did it extremely well, but who, till this very day, was not given the chance to finish his hard work to his own satisfaction, dictated by misunderstandings and prejudice with his employer. It is about how everybody sees this man deserves rehabilitation and recognition but does not receive it from his former employer. Every good documentary has a story line: it has a starting point, often posing some sort of goal, a middle part where it is attempted to reach that goal, often with the introduction of a new set of problems that need to be solved first, and finally a conclusion, where the goal is achieved or where the gathered information raises new questions. The dissatisfaction that you might feel about this particular documentary didn't come from the makers, it is just part of the story they tell. I might not be happy with the conclusion, but I am very happy I got to hear this story.",
         "I agree wholeheartedly with another review which felt that the movie should have narrowed its focus. It could have been a film all about the life and career of David Prowse, the man who just happened to wear the Darth Vader costume in three Star Wars films among his many screen credits. After all, he was an incredibly interesting man and I had no idea he was a champion weightlifter and bodybuilder! Or, it could have been about the lost opportunity that Prowse had in not being able to play the face of the dying Vader...something which would have interested me very little. To cut to the chase, he wore a costume...and many folks could have done this. Sure it is sad he couldn't get the chance to be Vader's face...but that's life and he DID have other things about him that I wanted to learn about. The third area that the film went, and this annoyed me, is when it became all about the director of this documentary and his own personal quest to re-shoot the facial reveal of Vader in \"Return of the Jedi\"...something which interested me in no way whatsoever! In fact, in most documentaries, the less we see of the filmmaker and learn about their likes and dislikes, the better. So, to sum it all up, I loved learning about Prowse--he seemed like a nice guy and played a lot of interesting characters (including Green Cross Man)...but stop going on and on about what Marcos Cabotá wants....it just became tedious after a while. Give us a true biography of Prowse...and that's all, please!",
         "I don't write reviews on this website so this shows the extent to which I found the director so irritating. Don't get me wrong, I found the stories of David Prowse's career really interesting and his insights on the films decision to outcast his voice without telling him. I really felt sorry for the guy. However.... the director inserts himself in his own film and decides to intervene at several moments with his annoying personality. He tries forcing this theory that David came up with the idea for Vader to be lukes father and EVERYONE dismises it while the director makes himself out to be this mastermind. And don't get me started on his dumb idea to recast David in the scene he wasn't in. The whole time I was thinking, so what difference does that make?!. The scenes hardly gunna be put into the films nor would it give David the same sense of fulfilment of him being in the actual scene. It gets worse, we don't even see the f*****g scene! The entire idea of the film was dumb and yet they didn't even follow through with the premise of the documentary. They should have focused on David's story and the director should have kept his filthy hands off what could have been a really interesting documentary. Rant. Over",
         "First the good- -Great idea for a documentary. -David Prowse could have and possibly should have been the man behind the mask when the mask was revealed. -George Lucas is a jerk for blaming Prowse for info that was leaked by someone else on his crew. Good to oust George for that. Now the bad- To say at the beginning of the film, you intend to shoot the scene over with David rightfully playing Vader, and then never deliver said scene which you film, is a horrible horrible act. Horrible since you can now sit right next to George in the jerk chair, since not once but now twice were denied David acting that famous scene out, once by Lucas's, and two by yours, the guy making a film to right a wrong....which you failed miserably at. If Lucas says no, then don't shoot it, but of course you manged to get me to sit through the film which is far too long than it needs to be, only to be disappointed as I'm sure everyone dumb enough to sit through the film will be. All you had to do was say up front, we filmed it anyway, but only got to show it to a small audience in Spain and I honestly might have stayed through it, if for nothing else to listen to their emotional reactions. I was almost in tears at the respect this man was shown, so you as the director had me as a viewer in the palm of your hand, and you completely blew it! I'd give this movie a 1, except that wouldn't be fair to David Prowse since he acted well in this film, and as Vader in Star Wars. Don't stop making films, but do listen to your audience. The promise promise promise followed with the sound of crickets chirping isn't the way to go. Major fail-",
         "This documentary is a nice enough retrospective on the history and legacy of veteran British Hammer Horror film actor David Prowse, the actor who filled the dark shape of Darth Vader in the original trilogy of Star Wars films. However, the documentary teases throughout a particularly fanboy mind-blowing scene in which the director of the documentary allows Prowse to reprise the penultimate scene in Return of the Jedi in which Darth Vader, who lay dying, removes his mask and reveals his face to his son Luke for the first time. In the original film, Sebastian Shaw played the face of the man behind the mask, much to the chagrin of Prowse. The director of this documentary teases that he has reshot this scene with Prowse restored to the role of the dying Vader, and very nearly shows part of it, but cuts away before fans are treated to what they have dreamed of seeing since 1983. Given that Disney allows fan films to be made in the Star Wars universe, and that Lucasfilm has had a long history of doing so, showing this to the world would cost the director nothing. Granted, Lucasfilm did not give permission, but Lucasfilm doesn't give tacit permission to anyone who asked to do something specific with the Star Wars universe if there is a profit involved. For a not-for-profit cause, such as just showing the clip to all of us fanboys really want to see the scene, it would cost them nothing. All it does is tease your interest all the way through the credits, hoping you will see it in this documentary. Spoiler warning: you don't.",
         "Another reviewer incorrectly attributes the dubbed voice of Vader to that fine actor, Edward James Olmos. It was, in fact James Earl Jones who voiced the part. This documentary, although well intentioned was clearly hamstrung by being unable to use any clips from the first two Star Wars movies. It seems obvious that when Lucasfilm realized they were being painted as the villain they refused to grant permission. As a result, shadowy images of the main characters appear, hardly a replacement for the real thing. Prowse parlayed his body building skills into \"big men\" parts, mostly in low budget British horror movies and the part of Vader was a major one but hid his features behind a mask for the entire screenplay. In effect, fame without recognition. The young director felt that Prowse was robbed of a chance to BE Vader and be recognized, so he gathered a team to recreate the \"death scene\" where Vader, unmasked and dying utters those oft quoted words \"Luke, I am your father\". Once again, almost certainly due to copyright restrictions we are denied the chance to actually see the finished product, which rather defeats the whole object of the exercise.",
         "Actor David Prowse played the body of Darth Vader in the original STAR WARS trilogy and was shocked when he learned that another actor's face was to be used during the famous unmasking scene in RETURN OF THE JEDI. Documentary director Marcos Cabata decides to rectify this mistake by re-filming his own version of the scene and surprising Prowse by having him play Anakin Skywalker. This is his intention, which he states at the film's beginning, then pretty much forgets about it until thirty minutes from the end. Between those two moments, we get an hour of Prowse's career history and him complaining about how George Lucas did him wrong. This documentary fails for several reasons: 1. The underlying theme/story here should have been the recreation of the unmasking scene with Prowse, but Cabata doesn't even tell Prowse about the offer until near the end of the film, and Prowse's reaction is anti- climactic, to say the least; 2. Cabata seems to be promoting himself as much he is telling the story of Prowse, and it's noticeable and irritating; 3. Once Lucasfilm realized that Cabata was making them out to be the villains of the piece, they refused to have anything to do with the documentary, and didn't give their permission for Cabata to re-shoot the scene with Prowse, so, with this being the film's main drive, once the reshot scene is shown before an audience, WE DON'T GET TO SEE IT. Cabot doesn't even show the audience's reaction to it!! Absolutely ridiculous and a major fail on his part, making me question the intention of the documentary in the first place. And finally, the main reason for Prowse's getting snubbed by Lucas, the doc ascertains, is because before EMPIRE STRIKES BACK was released, he revealed to a newspaper that Darth Vader was Luke's father. Prowse denies that he talked to any reporter or spilled any such information, and Lucas blocked him from future Star Wars events because of it. The film says that this is the only way the secret could have been spilled. However, I never read that article and I knew going in to the film on opening day, that Vader was Luke's father. How? Because the novelization of the movie was released BEFORE the film opened! Yet the documentary makes no mention of this as another way to exonerate Prowse. Only for the hardest of Star Wars fans.",
         "Every aspect of this documentary feels contrived and scripted. The filmmaker just inserts Prowse interviews and dramatic music for the sentimental punches he clearly wants us to feel instead of following the natural flow of the interviews. Early on, the voice-over of the documentary promises us a great story from the man behind the mask of Darth Vader but it never delivers. Prowse seems like a lovely man but in the end its not he who is the story here, the story is about this random filmmaker. The filmmaker asserts his own beliefs and takes the opportunity to fullfil his own childhood dream of shooting a Star Wars scene, which is supposed to be climatic but instead fizzles out in a nothing scene because where we are not allowed to see the scene itself. The filmmaker obviousuly cant show us his recreated scene for copyright reasons, but maybe don't center your entire film about it then?",
         "For years and years I've read in the press and on the internet about the strained relationship between actor David Prowse and the people at Lucasfilm LTD, mainly George Lucas. What could Mr Prowse possibly do to completely be BANNED from anything Star Wars related for the rest of his life? Did he beat Lucas with a baseball bat? Apparently, it was much worse: Mr. Prowse had a tendency to talk to the press and give \"inside scoop\" on movies that were supposed to be top secret. I know Hollywood has something like a \"non disclosure\" agreement, where they literally \"warn\" actors, staff, crew members and directors from \"spilling the beans\" on an specific production. Stuff like \"Game Of Thrones\" surely has it as well as the newer Star Wars films, but back in the late 70s, there must've been something like that, right? Well, apparently not. Mr. Prowse argues that it was not him who spilled stuff to the press, he never did. A massive production like a Star Wars film has an amazing number of staff, crew members, secretaries, actors, and so forth. So why does Lucasfilm insist it was Mr. Prowse? And even if he DID spill the beans, little it did to stop \"The Empire Strikes Back\" and \"The Return Of The Jedi\" from becoming colossal box office hits. Spanish director and certified Star Wars geek, Marcos Cabota, made it a quest to finally know WHY Lucasfilm distanced itself from actor David Prowse, now in his 80s. If Lucasfilm was so angry at Prowse, why not replace him completely? The final major blow to Prowse came at the end of \"Return Of The Jedi\", when Vader finally gets unmasked. It was Prowse who the fans wanted to see, no some old crummy British actor. I felt cheated as a fan, but the most cheated person was Prowse himself. \"He looks too young to be his father\". Wait a second! Isn't Darth Vader in his late 40s? Wasn't Anakin Skywalker in his early 20s when he turned to the dark side to become Darth Vader? What kind of lame excuse is that??? For the mere 3 lines that actor Sebastian Shaw (Darth Vader unmasked) uttered, those same lines could've been uttered by Prowse, but NOOOO, it HAD to be someone else. Lucasfilm has even admitted that they didn't want Prowse's face at the end. Too young I ask? Have you heard of Dick Smith? Rick Baker? Rob Bottin? Special make up maestros that could've gotten the job done with outstanding ease and turn Prowse into an older, battered man. The only thing I regret not seeing is the supposed reenacted scene from \"Return Of The Jedi\", where Luke takes his father's helmet off to reveal the human Anakin Skywalker. Director Marcos Cabota kindly asked Lucasfilm permission to shoot this scene, to which he was given a resounding NO. Marcos went ahead and shot the scene anyway, with David Prowse revealing himself from beneath the helmet. The scene was shown to an exclusive number of people, but NOT to the audience of this documentary. So many \"rubbish\" takes on Star Wars float on the internet that I don't think Lucasfilm has given all of them their OK, so why this one in particular was given a no? Was it because of David Prowse being in it? Lucasfilm was never available for comment on the documentary. Not showing that filmed scene kind of waters everything down about this documentary. Still, I had a lot of fun watching it, and you get to hear the opinions of people who were in the high ranks of Lucasfilm when the original trilogy was in theaters: Gary Kurtz, the associate producer, Robert Watts, executive producer, Ben Burt, sound FX engineer, Kenny Baker, R2D2, etc. There were no Mark Hammill, Carrie Fisher or Harrison Ford interviews, to share their views on the matter, which is sad (unless all of them hate Prowse as much as Lucasfilm hates him). I was actually expecting a boring affair but was entertained and Spanish director Marcos Cabota did this documentary out of sheer respect and admiration to David Prowse, the one and only TRUE Darth Vader!",
         "Despite featuring some wonderful interviews and archival footage, I Am Your Father is ruined by the film-maker's senseless insistence on inserting himself into the film. The film has a fascinating story at its heart - that of David Prowse, who played Darth Vader in the original Star Wars trilogy and remained remarkably unrecognizable despite playing one of the most iconic characters in all movie history. Yet the central story - that of David's all too human journey and disappointment - is elbowed out of the way so the film-maker can indulge in some wish fulfillment. While I understand the temptation for the film-maker to become his story, particularly given Star Wars' place in the Pantheon, the Michael Moore approach weakened the film and turned what should have been a richly poignant piece into just another ho-hum documentary. Pity.",
         "There's some intriguing info and interviews in here if you don't know much about David Prowse. However... The filmmaker inserts himself as a main character, which is kind of annoying, especially since he obtained some GREAT interviews from a variety of people close to the Star Wars franchise...including Prowse himself. Those interviews could've carried it just fine had that been the agenda. Another small inconvenience (on the Netflix version anyway), there were no built-in subtitles for the two brief scenes that are completely in Spanish. If you can get past those minor annoyances, it is otherwise decent.",
         "I was previously aware of David's slips to the press and felt very little compassion for his having been ostracized from anything Star Wars since his portrayal. Having now watched this and realized the error that I had been exposed to, I can say I am very sorry for my error, and that I thoroughly enjoyed having my understanding corrected. Getting to know Prowse through interviews and snippets of his work was an experience I won't soon forget; nor the fact that I found the arguments that David wasn't responsible for the leaks as originally thought, and that David should have had the opportunity to be Darth Vader at the unmasking, both compelling and convincing. I saw Jedi at 13 and even then was never fully satisfied by Sebastian Shaw. He looked larger than Vader should have looked to my young eyes. It wasn't the face that I expected to appear under that helmet. This was solidified by the view of the bust in the movie of a younger David Prowse in the Darth Vader costume with the removed helmet. That person more closely matched my expectations and I'm sorry I haven't yet been able to fully enjoy that scene. As with others, I had hope that we might be allowed to view the re-shot scene where an older Prowse was unmasked as Darth Vader, but understand completely why I cannot at this time. For now, I am just happy that it is out there, that it exists, and that one day I will very likely get to see it, the world being as it is. I can wait, and I will love that moment when it comes.",
         "No disrespect to David Prowse, but this film is a poor excuse for a documentary. It attempts to combine two basic ideas: show a brief history on Mr Prowse's life history and with Star Wars, and fulfill some goofy idea on the director's part of re shooting the unmasking scene from Return of the Jedi with Mr Prowse inserted into the shot. The documentary on David Prowse would have been fine as it was, but there really is not enough material to fill a 90 minute movie with his info apparently, hence the rest of the picture's subject matter. What they should have done is just focus on all of the other actors (Jeremy Bulloch, Kenny Baker, etc) show the impact of Star Wars affected their lives. The parts with all of them speaking in interviews, at conventions, etc are the best parts of this film. The rest is utterly useless and not entertaining. As much as I love Star Wars, I can think of better ways to spend your time.",
         "The previous 2 reviews covered pretty much what I thought as well so I won't rehash any of that stuff. At the end of the credits it states \"HE (Prowse) IS STILL WAITING FOR AN INVITATION TO ATTEND AN OFFICIAL STAR WARS CONVENTION\"...well this is bogus because he was at the 30th anniversary 2007 Celebration 4 event in LA., the best STAR WARS con one can attend and thoroughly backed by Lucasfilm. It was not some unsanctioned convention set up at an empty Target store. I got his autograph two separate times (at that event) and both times he was miserable and left a bad impression on me. Perhaps it was this attitude that has kept him from any further official Star Wars events. That is only a speculation based on my own experience with the man. If it is true that Prowse was ostracized because of a 'false' rumour (years ago) that he leaked story plot lines, then he should be forgiven, obviously. But there is also proof that Prowse also likes to talk (back then) and did put forth a 'speculation' that Vader should be revealed as Luke's father (in 1977), which in fact we all know did unfold in the sequel in 1980. A total guess on his part but it does cross a line as a performer working within the series and Lucas did take umbrage with that faux pas on Prowse's part. Prowse' sour grapes at not being given the chance to be the actor under the mask when Luke pulls it off at the end of \"Return\", is just that, sour grapes. Far better actors have been replaced from a film during production, (Harvey Keitel from APOCALYPSE NOW, Eric Stoltz from BACK TO THE FUTURE, etc.) , it is not due to their lack of talent but that they do not fit that particular role as well as another performer. And lets face it, if Mr. Prowse was a stellar actor he would have been given better parts that do not require a big physique. He didn't join a theatre company and go on the road doing Shakespeare in his youth, he like many others we all know, but instead got into body building which became a ticket into film and TV work. He by-passed the usual tried and true route taken by 99% of the working actors in the world. Sebastian Shaw, who actually did the scene that Prowse covets, was an actor on stage since a child. Prowse's other gripe that his voice was replaced in the original trilogy is also based on the lack of dramatic punch his voice had at the time. Even the editors of Star Wars were shocked by the ill- suited voice coming out of Vader's mask on the dailies. If he wanted to be taken seriously as an actor then he should have spent less time in a gym and more time taking acting and voice lessons. Harsh but true.",
         "Not a documentary about David Prowse and his life. The douche-bag Marcos Cabotá is appearing more in this boring documentary than Prowse. About 70% of this incoherent mess consists of interviews with Marcos Cabotá and annoying fans dressed up as Star Wars characters at conventions. David Prowse who was in the costume of Darth Vader in the original trilogy, was replaced by another actor in the scene without the mask. The douche-bag director thinks this (and Prowse wrongfully accused of leaking that scene to the press), was a great injustice. He wants to re-shoot the scene with Prowse. Something I don't give a rats ass about it. And I suspect neither would even the most hard core fans. I fast-forwarded through most of this to avoid the countless interviews with Marcos Cabotá and his awful English pronunciation. It really pisses me off when directors of documentaries let themselves star in their own crap. This is the worst and most boring documentary I have ever seen. Avoid it!!",
         "Arguing that Darth Vador is the evilest villain of movie history and a universal figure, this wet dream of nerdy guerrilla aims at giving character actor David Prowse the place in the Star Wars pantheon that George Lucas, Hollywood's evilest villain, has denied him by replacing him with another actor when the time finally came, at the end of Return of the Jedi, to drop the mask off and die. The concept is to set the record straight by re-shooting the scene in question, this time with Mr. Prowse. The director of the piece is obviously very proud of his idea, so proud that he promptly becomes insufferably self-satisfied, but one can acquire a wealth of useless knowledge before pressing the stop button, which one is ashamed to confess he did. The first shocker comes with the fact that George Lucas was supposed to direct Apocalypse Now, but he dropped out to make Star Wars, which is a great loss if you imagine Apocalypse Now's final 30 minutes with Ewoks. The horror. the horror. A tall and muscular man, Mr Prowse was a personal trainer at Harrod's in 69, where he was scouted and cast to play the Frankenstein creature. Hé then played the Green Cross Man, a British superhero teaching children to cross at zebra lines. \"Walk straight across!\", he enthuses in a somewhat gayish voice at the end of a vintage TV ad. Through trials and tribulations, he got the role of Darth Vador, with one caveat: his West County accent sounded funny for a galactic villain. One has to side with George Lucas on this one: an universal villain from the future could only sound American, so Edouard James Olmos dubbed Mr Prowse, whose voice, he remarks with legitimate amusement, has become deeper with age and is now pretty close to Olmos'. Firmly establishing himself between a sycophant and a conspiracy monger, the director then gets to the heart of the matter: the father issue. No one knew about Darth Vador being Luke Skywalker's father during shooting, the soundbite having been added in post-production (no doubt one of the foundations of the legend according to which quite about anything can be fixed in post-prod). But wait! Mr Prowse had foreseen this development and mentioned it casually during an interview! He got ostracised by Lucas Films in retribution. Did one mentioned that George Lucas was evil incarnate? A scene at a Star Wars convention – event to which Mr Prowse is never invited – shows a crowd of whatever-they-are-called (Warsies?) wearing short pants, Superman t-shirts over beer bellies and heavy spectacles, questioning the bleebedeeblup midget about Darth Vador. So was Mr Prowse the man who talked too much? Interviews of two producers prove inconclusive. The nice guy says it was not right to deprive Mr Prowse of his big death scene, because an outside source leaked the father thing to the press. The bad guy says George Lucas has nothing to do with Mr Prowse's banishment, because outside people are in charge of the conventions and stuff. Hmmm. At that point, the ax unsurprisingly falls: Lucas Films does not approve of the re-shoot. The director gets all whiny while managing not to alienate Hollywood's most evil villain completely. At that point, one's thumb hits the Stop button. Not much of a Warsy\u0085",
         "This is a fun movies for any fans of the original films....there, enough said.... .......but I had to write here when i read some of the other reviews calling foul for not including in the film the alternative ending that they filmed, I mean seriously!!!! All it shows is how little these reviewers know about films, especially Lucas Film, who were never, never ever, ever, er ever going to allow a commercially produced film to include an alternative star wars ending. Enough said. Good film.......and that alternative footage will one day be worth a great deal of money....once Lucas Film decides to release a special edition version 1001.",
         "The producers had a great idea: find an irrelevant person that is well known in disguise and sell lots of tickets to the freak show in which we reveal you \"the real person\". Unpleasant way of presenting a human being, but the makers of this movie have to make a living too. It turned out freak show was the only part the producers were interested into. Darth Vader is a character created by Lucas. The script was written by several script writers. The costume was designed by two other people. There were several people manning the costume even if we restrict ourselves for the sake of argument to the original series. The voice is someone different. The stunts are done by a totally different person. The sounds were made by the special effects team. And the dishonest producers want the audience to believe their guy IS Darth Vader. They even bring in talking heads to say something about the acting. Acting? A human clothes hanger moving a big costume around? Not only that, but the world owes him recognition for his what? The guy got paid for his work and it was not charity. Sure the man was upset for not getting a bigger part. It's human. And the ego in every one keeps pointing out \"you're the main character\". But in this spirit why not make a documentary called \"I Am the Janitor on the Star Wars set\". Oops! Even the Star Wars name was out of reach for this production team. Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch",
         "The scene towards the end of \"Return of the Jedi\" where Darth Vader is de-masked is iconic in the Star Wars pantheon. Once Star Wars went from \"a franchise\" to \"a phenomenon\", that scene was dug into even further and scrutinized for that fact that David Prowse, the man behind the suit for the first three episodes, was not the face shown (that of Sebastian Shaw) when Luke removes the mask. In \"I Am Your Father\", filmmakers Toni Bestard and Marcos Cabota set out on a quest to find out what Prowse is up to these days and perhaps even re-create that iconic scene...this time with him in the mask. The reason this is a watchable documentary is because Prowse has been marginalized in the history of Star Wars, not welcome at many gatherings, reunions, and conventions. As such, he is a bit of a mystery that deserves a light being shed on it. I mean, this was the guy who played the actions of Darth Vader (perhaps the most iconic baddie in film history), and it takes an indy film director to find him? Hmmm. That being said, there are two major problems with \"I Am Your Father\" that keep it at a middling star rating: 1. The filmmakers really take some jabs at George Lucas, many of which are not deserved. To put it bluntly, the Star Wars creators had every right to choose Shaw over Prowse, and they had their reasons for doing so. Rumors also abounded (with some proof to that effect) that Prowse would often talk to the press about movie spoilers before premiere dates, so that could explain how he was treated when Shaw was indeed chosen. Is it perhaps a bit low that Prowse isn't invited to any LucasFilm functions? Maybe. But to even insinuate that Prowse was \"owed\" his face in \"Jedi\" is a bit far-fetched. 2. A lot of the documentary builds towards the re-creation of the Prowse scene...and then the climactic moment isn't even seen! Maybe I missed something, but I felt rather let down that I didn't seen the entire re-creation of the scene. Overall, while I enjoyed learning more about David Prowse in \"I Am Your Father\", it really deserves its three-star rating because of how it focuses a bit too much on old grudges/rumors that are \"he said, she said\" scenarios. The life of Prowse should have been the focus all along here, and when it is this doc shines."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "Nova Televisió",
         "Singular Audiovisual",
         "Strange Friends"
      ],
      "summaries": [
         "David Prowse, the actor who played Darth Vader at the first Star Wars Trilogy, never revealed his face during the films. He could have done it only once at \"Return of the Jedi\", but something happened. Another actor did that sequence and that fact marked David Prowse life for ever. Thirty years later, a young filmmaker discovers why the producers took that decision, and is determined to pay Dave a deserved tribute, almost impossible.",
         "David Prowse is an eighty years old actor, who has lived behind Darth Vader's mask during three decades. A group of Star Wars fans find out why he has been apparently forgotten by Lucasfilm during thirty years, and decide to give him back the glory he never had. This is their last opportunity."
      ],
      "budget": 250000
   },
   "movielensId": 166259,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2015-10-05",
      "dvdReleaseDate": null,
      "directors": [
         "Marcos Cabotá",
         "Toni Bestard"
      ],
      "runtime": 83,
      "movieId": 166259,
      "title": "I Am Your Father",
      "mpaa": null,
      "actors": [
         "David Prowse",
         "Marcos Cabotá",
         "Marcus Hearn",
         "Jonathan Rigby",
         "Lou Ferrigno",
         "Kenny Baker",
         "Gary Kurtz",
         "Robert Watts",
         "Ben Burtt",
         "Jeremy Bulloch",
         "Manuel M. Velasco",
         "Eduardo Biurrun",
         "David Ambit",
         "Colm Meaney"
      ],
      "imdbMovieId": "2949296",
      "originalTitle": "I Am Your Father",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["QbExdNBjOfQ"],
      "plotSummary": "David Prowse is an eighty years old actor, who has lived behind Darth Vader's mask during three decades. A group of Star Wars fans find out why he has been apparently forgotten by Lucasfilm during thirty years, and decide to give him back the glory he never had. This is their last opportunity.",
      "tmdbMovieId": 362610,
      "avgRating": 3.75,
      "releaseYear": "2015",
      "numRatings": 8,
      "posterPath": "/nm1QIKcs3c8JjVrHgYM6PPmxAqH.jpg"
   }
}