{
   "tmdb": {
      "original_language": "ml",
      "keywords": [
         {
            "name": "camera",
            "id": 1925
         },
         {
            "name": "resort",
            "id": 10793
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "mentalism",
            "id": 190567
         },
         {
            "name": "malayalam",
            "id": 193685
         },
         {
            "name": "zumba",
            "id": 200567
         }
      ],
      "imdb_id": "tt5436168",
      "video": false,
      "title": "Pretham",
      "recommendations": [
         427012,
         364776,
         422603,
         374232,
         332253,
         332830,
         440858,
         84967,
         411054,
         398786,
         371107,
         406162,
         338930,
         324496,
         234532,
         402217,
         450045,
         265420,
         412428,
         442622
      ],
      "backdrop_path": "/xNZSJQ1XmAQQCgZOcyCF4y79P4g.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "John Don Bosco",
               "gender": 0,
               "credit_id": "57b00f25c3a3682cb7001c76",
               "name": "Jayasurya",
               "profile_path": "/u6ig3G1Mx3poLSNJrlVWtoulROv.jpg",
               "id": 591070,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Denny Kokken",
               "gender": 2,
               "credit_id": "57b00f32925141171e0000f7",
               "name": "Aju Varghese",
               "profile_path": "/1kP34TpAdUt174VZWCaxHua2sy1.jpg",
               "id": 1130154,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Priyalal",
               "gender": 2,
               "credit_id": "57b00f3f9251413b0100190a",
               "name": "Sharaf U Dheen",
               "profile_path": "/1kLNFtI7skfe6t4K1r8wublXNOf.jpg",
               "id": 1473469,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Shibu Majeed",
               "gender": 0,
               "credit_id": "57b00f4e92514172c900865b",
               "name": "Govind Padmasoorya",
               "profile_path": "/k3odsOv8XGX3PB1uDmHjEPD4FOg.jpg",
               "id": 979234,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Clara",
               "gender": 0,
               "credit_id": "57b87ae3925141429500c0d6",
               "name": "Shruthi Ramachandran",
               "profile_path": "/mIl7WUFRUY5MO3mrwC53ePoAsVT.jpg",
               "id": 1668327,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Amritha",
               "gender": 0,
               "credit_id": "57b87abb9251410e1100893d",
               "name": "Sharanya Menon",
               "profile_path": "/yVLPt3nqL859ynEt6dXAvzJINWn.jpg",
               "id": 1668326,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Suhanisa",
               "gender": 0,
               "credit_id": "57b00f789251411761000122",
               "name": "Pearle Maaney",
               "profile_path": "/bk1yEanPLv71mFG0assyqOQwFR0.jpg",
               "id": 1463951,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "57b00f9a9251411af400004c",
               "name": "Sunil Sukhada",
               "profile_path": "/qgamc1v6ROT3zn6bSMs2vS6U7ht.jpg",
               "id": 1162629,
               "order": 7
            },
            {
               "cast_id": 4,
               "character": "Yesu",
               "gender": 2,
               "credit_id": "57b00f5ec3a3682cb7001c8b",
               "name": "Dharmajan Bolgatty",
               "profile_path": "/zkRpJGI7IGlVtU8TYeo4jweQFfq.jpg",
               "id": 1622877,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mary / Dakini",
               "gender": 0,
               "credit_id": "57b87b1d92514161740003d5",
               "name": "Sathi Premji",
               "profile_path": "/gVJ8X58RflPvM5xbZx3ow5U7pQZ.jpg",
               "id": 1657966,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Priest",
               "gender": 2,
               "credit_id": "57b87bb392514161610003e4",
               "name": "Hareesh Peradi",
               "profile_path": "/s6Et5mOEicOPGc3mk4vZLiDQVM6.jpg",
               "id": 1188530,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Principal of National Law College",
               "gender": 2,
               "credit_id": "57b87c0a925141429500c193",
               "name": "Devan",
               "profile_path": "/rFmsDmAqdh8u2XdIKl3OXf54dVM.jpg",
               "id": 283294,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Sub-Inspector of Police",
               "gender": 0,
               "credit_id": "57b87c19c3a36863dc00045b",
               "name": "Vijay Babu",
               "profile_path": "/8ThAZXd4Sjfopth5QhDpuJg7Z3q.jpg",
               "id": 580890,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Maya",
               "gender": 1,
               "credit_id": "57b87c26c3a3684f940080d5",
               "name": "Nyla Usha",
               "profile_path": "/3ztjsMzc8h4k6j6HMByrsgJvZcj.jpg",
               "id": 1202998,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Shalini",
               "gender": 1,
               "credit_id": "57b87c3cc3a36863dc00046e",
               "name": "Arya Rohit",
               "profile_path": "/44eAHE24evPuGQIVrJI7hRy3sRZ.jpg",
               "id": 1640766,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57b00fe7925141175e000170",
               "name": "Ranjith Sankar",
               "profile_path": "/xffr684uGEveO5vUDm5haY3pcQl.jpg",
               "id": 1105733,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57b00ff99251411af4000067",
               "name": "Ranjith Sankar",
               "profile_path": "/xffr684uGEveO5vUDm5haY3pcQl.jpg",
               "id": 1105733,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57b010059251411af400006d",
               "name": "Ranjith Sankar",
               "profile_path": "/xffr684uGEveO5vUDm5haY3pcQl.jpg",
               "id": 1105733,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57b0101dc3a368262b000161",
               "name": "Jayasurya",
               "profile_path": "/u6ig3G1Mx3poLSNJrlVWtoulROv.jpg",
               "id": 591070,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57b01050925141175e00019a",
               "name": "Jithu Damodar",
               "profile_path": null,
               "id": 1205420,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.557794,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 411279,
      "vote_count": 7,
      "budget": 0,
      "overview": "Three happy-go-lucky friends run a coastal resort till a series of mysterious events leave them worried. The plot thickens when a mentalist named John Don Bosco enters the fray to investigate the possibility of a paranormal entity.",
      "similar": [
         77949,
         288158,
         2655,
         620,
         91586,
         201085,
         452507,
         416160,
         10014,
         8839,
         19592,
         79694,
         291272,
         11618,
         335796,
         157547,
         10756,
         409297,
         134366,
         11601
      ],
      "original_title": "പ്രേതം",
      "runtime": 127,
      "poster_path": "/gzjXkR4nxfNz0AWCJgS7lZ49nlP.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "ml"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dreams N Beyond",
         "id": 70444,
         "origin_country": ""
      }],
      "release_date": "2016-08-12",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "How? Why? What did you gain?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ranjith Sankar"],
      "runtime": 126,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Malayalam",
      "imdbLink": "http://www.imdb.com/title/tt5436168/",
      "coverLink": null,
      "actors": [
         "Jayasurya",
         "Govind Padmasoorya",
         "Aju Varghese"
      ],
      "reviews": [
         "The ghost story has evolved over the ages in Malayalam cinema but most of them somehow end up still with many clichés .Similar tried and tested formula is used in Pretham also but is handled in a very different and in the so called New gen way. The last comic horror movie that comes to my mind is In ghost house Inn which was simply painful to watch. Adi kapyare was mostly a comedy movie with a hint of supernatural towards the end. But pretham is about exactly as the title suggests it.The first half has some spooky thrilling sequences and lots of laughs.There are many subtle comic references to Manichitrathazh which is nicely done. Jayasurya has done a good job as usual and his new look perfectly suits the mysterious character of a Psychic. Aju varghese and Sharafudden deliver decent comic relief without trying much. GP is simply out of place and provides mostly blank faces and forced dialogues. Kudos to the director for keeping things tight and for not including any songs as well. All in all a decent family watch and a nice addition to the comic horror genre in Malayalam cinema.",
         "Ranjith Sankar's 'Pretham' is an engaging watch which create a lot of laughs and a little spooks among the audience.This is a crisp little movie which never become a bore.The trio of Sharafudheen,Govind Padmasoorya and Aju Varghese as the residents of the flat succeeds in winning the hearts of the audience with their comic timing and one liners even though there were some cheap ones also. First half of the movie runs very smoothly as it is filled with several humorous scenes and when the movie focus on the main theme it slowly starts to build some atmospheric suspense and induce fear in the audience.Even though such scenes are small in number they create such an impact in the viewers as they are immersed into the movie and are curious to find out the mystery behind all those mishaps happening around the main characters. The reactions from the audience when Jayasurya comes into the screen shows that his position in the minds of the audience as an actor is now significantly higher and is on the way to becoming an established Crowd– pleaser, nowadays his movie choices became better as he is trying to do different avatars with different stories.One would be dubious about the inclusion of Govind Padmasoorya and Pearle Maaney in the cast as their reputation in this field is not that good , but fear not as they have done justice to their character and are tolerable to the audience.When coming to the coming to the comedy scenes Sharafudheen and Dharmajan Bolgatty are the ones to watch out for , who creates several laughs among the viewers,Aju Varghese was also not bad. On the whole, these kinds of movies are rare in Malayalam industry so it creates a breath of freshness,this movie also provides a message to the public and it engages with its comedies and thrills.For anyone who want to get entertained for 2 hours this movie would be an apt choice to be included in their Watchlist. Thank you for reading my review ☺",
         "Ranjith Sankar has given us two excellent films in the last two years. So, the expectations were naturally higher for Pretham, also considering that horror comedy is a rarity in the Malayalam film industry. But, all that hype surrounding the film in the past few weeks, and that dull trailer, should have been an inkling that the film could be a damp squib. Denny (Varghese), Priya (Sharafudheen), and Shibu (Padmasoorya) are three friends-cum-business partners who run a sea-facing resort together. It is when they start experiencing paranormal activities that they turn to the local priest, and then eventually to Jon (Jayasurya), a professional mind reader. The story follows Jon and the trio as they set out to connect with the ghost who may be seeking their help to settle some old scores... While the premise is promising, the plot isn't free from clichés we normally see in a suspense thriller, which is what the film largely is. The first half is rather poorly constructed, because lots of things happen here, although none of them reach a crescendo. The humor which is built up by the characters using slapstick never touches the zenith. The narrative is like broken pieces of cliffhangers sewn together, without any sign of advancement in the story. There are a handful of one-liner jokes here delivered by Varghese and Sharafudheen which may cause you to laugh, but their quality is so low they will be forgotten by the time you move out of the cinema hall. Talking about funny dialogues, the speech is not always in sync with the actions of the characters, as has been a notorious practice in Malayalam films for decades. This occurs during the dubbing session where the creative inflow is disrupted and artistes add one or two more lines (usually of comical nature) in addition to what they actually spoke during the shooting. (More about that on my blog.) After churning out trash for sixty minutes and only hinting at a paranormal presence in the resort, Jayasurya enters the scene like he's just come out of a stuporous sabbatical which mostly involved serial bouts of debauchery. The little-to-no horror references that are made in the first ninety minutes do nothing other than igniting a sense of mockery of the horror genre. Of course, the fantastic eerie score supported by some good camera work gives us a ride into the fears and anxieties of the central characters, but one cannot call door-knocking or phone screen flickering as elements of horror. That stuff is amateur and does not necessarily work in inducing fear. Hence, it soon becomes apparent that characters like that of Dharmajan's are intended as pillars of comic support should the audience detect the hollowness of creativity that is the film. It also makes a large number of references to classic Malayalam films, which is only funny to a certain point; and Pretham definitely overdoes it, corroborating the fact that is the previous sentence. The second half fades in terms of comedy, and briefly turns into a whodunit and is conveniently climaxed in that flow. The film runs for about 140 minutes and I can promise you, other than the score, there is ironically nothing horror in Pretham. 2015's Adi Kapyare Kootamani is much, much better both with the comedy and horror. While I wouldn't exactly call this experimental, new wave dash of cinema a blunder, there's not much novelty in any of the themes it chafes other than the interesting subject of mentalism. Jayasurya looks dull in his attire of a knowledgeable psychic. Expecting more from him now seems like a mistake, because although his character demanded a sort of eccentricity, the performance does not totally come out as natural. Sharafudheen is the primary source of humor, with Varghese and Dharamajan on toe. Padmasoorya and Maaney both look out of place with their Zumba fixations. Special praise for the only good thing about the film: the score. Had the content been more substantial with respect to mature horror, the whole effect would have been something else and better. Be that as it may, it goes without saying that Mr. Sankar has at least tried to do something different here, irrespective of the outcome. BOTTOM LINE: Ranjith Sankar's Pretham is a disappointment not because it does not deliver, but because it forgot to (or couldn't) add a good amount of half of the genre that it is credited to be of. Wait for DVD, and then rent it. Can be watched with a typical Indian family? YES"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["Dreams N Beyond Production"],
      "summaries": [
         "Three young men - Denny Kokken (Aju Varghese), Priyalal (Sharafudheen), and Shibu Majeed (Govind Padmasoorya) have been friends since college. Together, they work till they hit their 30s and starts their own business that they can enjoy in a semi-retired manner. They get together and invest all their money in a resort in Kerala. However, their happy beginning is thwarted by paranormal activities and they approach John Don Bosco (Jayasurya), a psychic who works as a mentalist in cruise ships and entertainment industry. John Don Bosco also assists the police as a human lie detector with his cold reading techniques. John informs the three hoteliers that their resort is haunted by a ghost who is seeking answers as to who killed her, why was she killed and what did they gain from her death. Through his investigations John reveals that the ghost is of Clara who was a bright and intelligent student from National Law College. Amrita (Devan's daughter) was jealous of Clara's popularity and the fondness of her father towards Clara. Amrita secretly films Clara's nude scenes while bathing (in the same resort owned by the three hoteliers) and leaks it online.Unable to bear the shame, Clara commits suicide.",
         "Three friends run a beachfront hotel leaving their jobs. Now their hotel is haunted by paranormal phenomenons. A cold reading psychic John Don Bosco enters their life and Clara's phantom realm to solve the troubling mystery."
      ],
      "budget": 0
   },
   "movielensId": 166595,
   "movielens": {
      "languages": [""],
      "releaseDate": "2016-08-12",
      "dvdReleaseDate": null,
      "directors": ["Ranjith Sankar"],
      "runtime": 127,
      "movieId": 166595,
      "title": "Pretham",
      "mpaa": null,
      "actors": [
         "Jayasurya",
         "Aju Varghese",
         "Sharaf U Dheen",
         "Govind Padmasoorya",
         "Shruthi Ramachandran",
         "Sharanya Menon",
         "Pearle Maaney",
         "Sunil Sukhada",
         "Dharmajan Bolgatty",
         "Sathi Premji",
         "Hareesh Peradi",
         "Devan",
         "Vijay Babu",
         "Nyla Usha",
         "Arya Rohit"
      ],
      "imdbMovieId": "5436168",
      "originalTitle": "പ്രേതം",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["u4WVmGn3VQ8"],
      "plotSummary": "Three happy-go-lucky friends run a coastal resort till a series of mysterious events leave them worried. The plot thickens when a mentalist named John Don Bosco enters the fray to investigate the possibility of a paranormal entity.",
      "tmdbMovieId": 411279,
      "avgRating": 2.5,
      "releaseYear": "2016",
      "numRatings": 1,
      "posterPath": "/gzjXkR4nxfNz0AWCJgS7lZ49nlP.jpg"
   }
}