{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0067431",
      "video": false,
      "title": "Millhouse",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "",
            "gender": 0,
            "credit_id": "52fe4606c3a36847f80e7ea1",
            "name": "Richard Nixon",
            "profile_path": "/gvHuKN0z2niRfC6PsAY1O4uXJy5.jpg",
            "id": 27765,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4606c3a36847f80e7ea7",
            "name": "Emile de Antonio",
            "profile_path": null,
            "id": 106239,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.052377,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42496,
      "vote_count": 1,
      "budget": 0,
      "overview": "Emile de Antonio's film decimates Richard Nixon and exposes him as a paranoid, power mad lunatic... de Antonio compiles (via video and film) what amounts to the \"best of\" one of the worst political figures of the 20th century. Nixon was a shameless self-promoter while trying desperately to convince everyone that he wasn't. Through Alger Hiss and the \"Checkers\" speech to the character assassination of Helen Gahagan Douglas (among others), there are few stones left unturned.",
      "similar": [],
      "original_title": "Millhouse",
      "runtime": 92,
      "poster_path": "/7nMVGmDiu0ZEjqbuOx09gI9M8OG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1971-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Emile de Antonio"],
      "runtime": 92,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067431/",
      "coverLink": null,
      "actors": ["Richard Nixon"],
      "reviews": [
         "Emile de Antonio's film decimates Richard Nixon and exposes him as a paranoid, power mad lunatic...and this was BEFORE Watergate! de Antonio compiles (via video and film) what amounts to the \"best of\" one of the worst political figures of the 20th century. This compilation of vignettes is brilliantly edited, often cringe-inducing but just as often laugh out loud funny. Nixon was a shameless self-promoter while trying desperately to convince everyone that he wasn't. Through Alger Hiss and the \"Checkers\" speech to the character assassination of Helen Gahagan Douglas (among others), there are few stones left unturned. It will leave you wondering how a country like the USA could possibly have allowed this man to not only run for office, but to win the White House! A true work of art that confirmed de Antonio's standing as THE master film-maker of the left wing. Astonishing.",
         "I saw this movie a mighty long time ago, and I laughed like hell. So did everyone else who saw it in those days. It´s a wonderful portrait of the notorious Richard Nixon, demonstrating to the world just how immensely stupid a top politician actually is allowed to be. His statement that \"My wife´s got a good republican coat\" almost became a proverb at the time, thanks to this movie. So even if it deals with \"vintage\" matters it has a lot to teach us about what politics is really about.",
         "De Antonio's films, while engaging and highly intelligent, are poorly dated primarily because they assume that their audiences are already very familiar with their subjects. (See his superior \"Underground\" or \"In The Year of The Pig\") Aside from that, the biggest problem with this film is that it was made pre-Watergate and for many people of my generation ('90s kids), Watergate was such a defining moment for the Ex-Pres it's hard to imagine a time when he wasn't tainted by it. Still, after the Swiftboat attacks on Kerry in 04 and the entire 08 election, the fevered criticism of Nixon's \"Checkers\" speech seems almost naive. Not as side-splittingly hilarious as its proponents suggest, this film of pre-Watergate Nixon is valuable as a supporting document but unfortunately, it doesn't quite, as a Time Out review exclaimed, \"completely expose the true horror of Nixon's personality\". Sadly, the world would have to wait another three years for that shock. Formally this film is excellent and is a good example of the agit-prop documentary. Micheal Moore learned a lot from De Antonio's process."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Turin Film Productions"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 166633,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-01-01",
      "dvdReleaseDate": null,
      "directors": ["Emile de Antonio"],
      "runtime": 92,
      "movieId": 166633,
      "title": "Millhouse",
      "mpaa": "",
      "actors": ["Richard Nixon"],
      "imdbMovieId": "0067431",
      "originalTitle": "Millhouse",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Emile de Antonio's film decimates Richard Nixon and exposes him as a paranoid, power mad lunatic... de Antonio compiles (via video and film) what amounts to the \"best of\" one of the worst political figures of the 20th century. Nixon was a shameless self-promoter while trying desperately to convince everyone that he wasn't. Through Alger Hiss and the \"Checkers\" speech to the character assassination of Helen Gahagan Douglas (among others), there are few stones left unturned.",
      "tmdbMovieId": 42496,
      "avgRating": 3.5,
      "releaseYear": "1971",
      "numRatings": 2,
      "posterPath": "/7nMVGmDiu0ZEjqbuOx09gI9M8OG.jpg"
   }
}