{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stand-up comedy",
         "id": 9716
      }],
      "imdb_id": "tt6209400",
      "video": false,
      "title": "Michael Che Matters",
      "recommendations": [
         437013,
         425003,
         456210,
         449359,
         432883,
         403173,
         423122,
         392891,
         348857,
         364877,
         446048,
         378137,
         408546,
         455601,
         443411,
         396292,
         460822,
         416867,
         341176,
         135717
      ],
      "backdrop_path": "/8CHueWbx5H0uXH4TqIqK0c8FzgS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Himself",
            "gender": 0,
            "credit_id": "582506259251417b2c0001c6",
            "name": "Michael Che",
            "profile_path": "/r4AqoKKIXUQS1Qagwc1D72WVwa7.jpg",
            "id": 1395347,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "583ed74dc3a3686691009d41",
               "name": "Osmany Rodriguez",
               "profile_path": null,
               "id": 1087686,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "583ed7bc925141153000ad31",
               "name": "Lorne Michaels",
               "profile_path": "/cWJv05hztH5jbiIvWfzMfjMX5fo.jpg",
               "id": 56158,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "583ed7cc925141152100ac34",
               "name": "Michael Che",
               "profile_path": "/r4AqoKKIXUQS1Qagwc1D72WVwa7.jpg",
               "id": 1395347,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "583ed7dec3a368668300b596",
               "name": "Erin Doyle",
               "profile_path": null,
               "id": 1226331,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.449631,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 425498,
      "vote_count": 22,
      "budget": 0,
      "overview": "\"SNL\" star Michael Che takes on hot-button topics like inequality, homophobia and gentrification in this stand-up set filmed live in Brooklyn.",
      "similar": [
         35595,
         200133,
         34001,
         31788,
         34497,
         416477,
         34505,
         34512,
         16290,
         62206,
         49013,
         703,
         812,
         270946,
         13015,
         34163,
         23483,
         51828,
         67308,
         34509
      ],
      "original_title": "Michael Che Matters",
      "runtime": 60,
      "poster_path": "/cBO0cszPyw5ZvT2Kph7fxiemohx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Broadway Video",
         "id": 1756,
         "origin_country": ""
      }],
      "release_date": "2016-11-25",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Osmany Rodriguez"],
      "runtime": 61,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt6209400/",
      "coverLink": null,
      "actors": [
         "Michael Che",
         "DJ Cipha Sounds",
         "Jeremy Gaddie"
      ],
      "reviews": [
         "Michael Che mines territory that is a faint 2010s echo of the late great Lenny Bruce. No, Michael Che is not Lenny Bruce, but he gets a lot of mileage out of making people uncomfortable when they want to laugh at something that is funny but crosses a line they've made for themselves. The other review of this show must not have a special ax to grind with Che, because gun control occupies a short segment, that going into statistics misses the whole point of humor--making us laugh at things that are uncomfortable or painful. Overall, Che does a pretty good job of this. I'd give this more stars if there weren't a couple of points where the pacing dragged. And I'd give it fewer stars if this were a fair rating system. I know though, that 8 is the new \"average,\" and if it isn't at least an 8 or a 9, people won't watch this, and it really is a pretty damn funny hour of stand up. For those used to Che as the anchor on Weekend Update or his brief turn on the Daily Show, this is Michael Che Unplugged. He's more raw, more raunchy, and he works slightly blue, but not to the exclusion of intelligent humor. He uses \"blue\" to good effect, keeping the audience in Brooklyn and the audience at home a little off balance.",
         "I love this show from Michael Che a lot of what he said had me laughing insanely. I loved his jokes bout when it came to controversial topics like race, religion and police violence. This had me in tears especially when he talked about porn. And how we make that such a taboo to be talked about although many of us like scary movies that include murder blood and gore and we talk about it as a normal topic.",
         "If you are able to put your sense of indignation aside, this will be one of the funniest stand ups you will ever see. I don't remember laughing so hard in a long time. thank you Michael Che, for making me gasp for oxygen and making my ribs hurt from laughter. I Highly recommend it.",
         "He's not a particularly funny guy, but why does he insert himself into the gun debate and politics when he doesn't do the research? People hire him for laughs and instead he does faulty research and then tries to turn faulty research into a joke. Michael Che has made himself into a partisan hack who uses comedy as a way to promote his political beliefs. I say this as a liberal who believes in many progressive policies, he's made himself into an extreme left-wing person who does poor research. AR does not stand for \"assault rifle\" and arguing against ownership of rifles is exactly what he claimed he never would do (previously, now he is fine with arguing against gun ownership). He says you can't own a rifle, but he doesn't understand that rifles are no different than handguns and rifles are 0.6% of gun-deaths per year. So why attack rifles when handguns murder over 10,000 people yearly? When heart disease kills 600,000 people yearly? When car accidents kill 35,000 people yearly? If you add up hands/feet deaths from DoJ statistics with club-deaths, you get more deaths than rifles. So why doesn't he want to ban hands/feet/clubs? It can't get any less logical than this. It's an emotional argument and emotional arguments make for poor comedy. When Michael Che tried to attack guns on Weekend Update SNL, he backed Hillary Clinton and claimed \"no one is trying to take away your guns.\" This is unequivocally false. It's a false statement because that's exactly what Bill Clinton's \"assault weapon ban\" did. It took away guns. Hillary herself has said she wants to review the Australian gun ban. Obama himself has said on CNN that China banned guns and everything is just fine there and the criminals have to use knives. He literally used that example. So \"no one is trying to take away guns\" is a LIE. Lies like this give fuel to right-wing movements. They can point to your lies, and gather recruits. So why is he lying, misinforming his audiences, and sabotaging the Democratic cause? It's only gonna hurt himself in the end. How can you turn falsehoods into comedy? Comedy and hilarity comes from TRUTH. It comes from Satire and irony based on the truth. He's not a very funny guy and he's trying to make a name for himself by being extremely left. Don't bother watching this on Netflix. Waste of time.",
         "Sorry, I've been a stand-up comedy addict since the Catch a Rising Stars days. The last thing comics go to when desperate for laughs is sex. Always a crowed pleaser. Unfortunately, you go there over-and-over again. Wish you the best of luck. I realize how hard stand-up comedy is and respect you for your work. I think you can do better.",
         "views, it's obvious who he's going after. The only problem is that his plan backfired, because he doesn't have enough backing from those who share her views -- they're also unwilling to stand behind this humiliating, self-destructive effort. I honestly don't know if he can recover from this and I honestly don't care."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Broadway Video"],
      "summaries": ["Jesus, Guns, Black Lives Matter. White girls dancing, Honest, uncompromising comedy where no topic is out of bounds"],
      "budget": 0
   },
   "movielensId": 166653,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-11-25",
      "dvdReleaseDate": null,
      "directors": ["Osmany Rodriguez"],
      "runtime": 60,
      "movieId": 166653,
      "title": "Michael Che Matters",
      "mpaa": "",
      "actors": ["Michael Che"],
      "imdbMovieId": "6209400",
      "originalTitle": "Michael Che Matters",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["BuWmelfSTHI"],
      "plotSummary": "\"SNL\" star Michael Che takes on hot-button topics like inequality, homophobia and gentrification in this stand-up set filmed live in Brooklyn.",
      "tmdbMovieId": 425498,
      "avgRating": 3.70455,
      "releaseYear": "2016",
      "numRatings": 22,
      "posterPath": "/cBO0cszPyw5ZvT2Kph7fxiemohx.jpg"
   }
}