{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0436728",
      "video": false,
      "title": "Romántico",
      "recommendations": [],
      "backdrop_path": "/vz2JBlYrftaeeaxOfTLg3VAzj6f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Arturo Arias",
               "gender": 0,
               "credit_id": "52fe4af4c3a36847f81ea607",
               "name": "Arturo Arias",
               "profile_path": null,
               "id": 1051817,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Carmelo Muñiz Sanchez",
               "gender": 0,
               "credit_id": "52fe4af4c3a36847f81ea60b",
               "name": "Carmelo Muñiz Sanchez",
               "profile_path": null,
               "id": 1051818,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5341f1760e0a2679bf002d39",
            "name": "Mark Becker",
            "profile_path": null,
            "id": 557007,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.047845,
      "production_countries": [],
      "id": 111261,
      "vote_count": 1,
      "budget": 0,
      "overview": "Romántico is a documentary about Mexican musician Carmelo Muñiz Sánchez, who returns home to his beloved daughters after years spent playing San Francisco’s taquerías and hipster joints. But once Carmelo arrives in his hometown, he finds himself immediately confronted with the struggles that led to his first border crossing. Despite working the mariachi circuit (weddings, funerals, quinceañeras) and at bars that cater to prostitutes and their clients, Sánchez soon realizes he can’t adequately support his family and plots a return to the U.S. At the age of 60, another border crossing begins to seem absurd, but Carmelo has not given up...",
      "similar": [],
      "original_title": "Romántico",
      "runtime": 80,
      "poster_path": "/gXQf11tYqaJzaCT08XGJfjrWNNM.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2005-01-01",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Becker"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0436728/",
      "coverLink": null,
      "actors": [
         "Arturo Arias",
         "Carmelo Muñiz Sanchez"
      ],
      "reviews": [
         "I would love to know what happen with Carmelo...is he back to San Francisco? This movie touched my soul, made me feel the frustration of Carmelo trying to provide for his family. This documentary is wonderful, how I wish all those people from the minuteman would watch this documentary and see the illegal's reality ...they are only people trying to survive and that is not a crime!!!. I am sure if the minuteman was in Carmelo's shoes he would do the same thing for his family. I wish they could make another documentary about his life and what happen to his daughters. I am a native of South America and I was able to relate with Carmelo's idea of making a sacrifice for a better future for your own family. Is not easy to leave your family behind and live in another country in order to get ahead is very painful.",
         "This is the kind of film that Hollywood-hungry documentary makers seem to be avoiding these days. Romantico is storytelling at its best: craftsman-like and engrossing. It relies not on narrative bells and whistles but rather a steady, patient camera that captures the deep strength of the human spirit. Too often we are besieged with stories of immigrants via newspaper headlines and the nightly newscasts. But these reports are often one-dimensional and merely a backdrop to the political battles being fought (supposedly on their behalf) in our nation's capital. But here is a film that allows the camera to linger and capture a story that is sure to move you. It is hard to find any fault with a film that seems to render two lives in such real and meaningful ways. Granted, you will not find the increasingly popular narrative styles and devices that are cropping up in such films as Murderball and Spellbound. But you will come away not only with a deeper understanding of the human beings behind the recent immigration headlines, but with clearer insight into your own struggles and dreams.",
         "We had a viewing of this Movie at my college and we had the Director Mark Becker actually come talk to us about the movie. He said that Carmelo was still in Mexico but his daughter crossed. But he said he was doing good and that when he premiered the movie in Mexico it made Carmelo very proud. Becker says that many people have helped in aid for him. And that he contacts him around every few months. This movies is a great find, and really shows the problems that many family's in Mexico face. I think this should be a staple in many Spanish/international studies classes around the nation just because it shows this problem in different light that many people don't really see.",
         "I wish there would be a sequel for Romantico to tell us what happened to Carmelo after the last bus scene. The reverse migration is interesting because it shows that many illegal immigrants want to go back to their country because of the strong ties to family and land. The morality of a man who risked his life by crossing the Rio Grande or through the mountains earn some dollars not for his own enjoyment but for his family back home and specially for his daughter Juanita whom he want to secure her future and save her destiny from prostitution. The narration of this part was so touching and goes directly to the heart.I left the theater wanting more of the movie and for many days kept on wondering what happened to Carmelo, Carmela, Juanita and the younger daughter who doesn't speak much. Bravo Mark Becker Show us more of your work.",
         "This is such a strong movie. It shows the ordeals that hard working people have to endure in life in order to provide for their families. The sad thing is that many people think of the negative side of immigrants in this country. It is true that there are those, who abuse the system and make the rest of us seems like free loaders. But in this movie, we see how one hard working man only wants a job, any job so he can support his family. The reality of life is harsh and it can be seen here, those of us who take for granted the life and opportunities that this country offers us, should be ashame of themselves. I would rather see people like Carmelo be able to stay in this country and those who drink, do drugs and are breaking the law be kick out. He is what really represents the hard working immigrant that deserves the chance to the American dream.",
         "Intelligent, sad documentary about two illegal Mexican immigrants who try to scratch out a living, and send some money home, playing music in various restaurants. They also work all day at other jobs. The film follows Carmelo Sanchez, one of the two, as he returns to Mexico to care for his ailing, aging mother, and finds himself torn between staying and returning to the US. This is a very effective film at giving those of us who will never know this kind of hard life some insight into what so many other human beings around us go through. Yet, at least on first viewing, there was also a little something missing. While it was always interesting, it never touched my heart as deeply as it did my head, I'm not sure why. Maybe there was just a little feeling of remove that the film never quite got around. Maybe it's because Sanchez himself is so stoic, and keeps so much inside. But still a very good movie, and an important one for all of us lucky enough not to live in want."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["A troubadour returns home to scratch out a living in Mexico after years of trying to get ahead in San Francisco."],
      "budget": 0
   },
   "movielensId": 166707,
   "movielens": {
      "languages": [""],
      "releaseDate": "2005-01-01",
      "dvdReleaseDate": null,
      "directors": ["Mark Becker"],
      "runtime": 80,
      "movieId": 166707,
      "title": "Romántico",
      "mpaa": "",
      "actors": [
         "Arturo Arias",
         "Carmelo Muñiz Sanchez"
      ],
      "imdbMovieId": "0436728",
      "originalTitle": "Romántico",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Romántico is a documentary about Mexican musician Carmelo Muñiz Sánchez, who returns home to his beloved daughters after years spent playing San Francisco’s taquerías and hipster joints. But once Carmelo arrives in his hometown, he finds himself immediately confronted with the struggles that led to his first border crossing. Despite working the mariachi circuit (weddings, funerals, quinceañeras) and at bars that cater to prostitutes and their clients, Sánchez soon realizes he can’t adequately support his family and plots a return to the U.S. At the age of 60, another border crossing begins to seem absurd, but Carmelo has not given up...",
      "tmdbMovieId": 111261,
      "avgRating": 4,
      "releaseYear": "2005",
      "numRatings": 1,
      "posterPath": "/gXQf11tYqaJzaCT08XGJfjrWNNM.jpg"
   }
}