{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "athlete",
            "id": 10456
         },
         {
            "name": "jamaican",
            "id": 168663
         },
         {
            "name": "track and field",
            "id": 187901
         },
         {
            "name": "olympic athlete",
            "id": 208820
         },
         {
            "name": "sprinter",
            "id": 239162
         }
      ],
      "imdb_id": "tt4647900",
      "video": false,
      "title": "I Am Bolt",
      "recommendations": [
         257064,
         470616,
         454349,
         490846,
         469922,
         274165,
         412200,
         403858,
         455595,
         442094,
         383200,
         450494,
         437783,
         345937,
         438817,
         265312,
         467988,
         466421,
         323599,
         465171
      ],
      "backdrop_path": "/elFe3xSo9nQLcG9kOjPUG2zPfrF.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "5887dd72c3a36859e9004a3f",
         "content": "**A thunderBOLT that struck from Jamaica.**\r\n\r\nI saw him on the television during the Beijing Olympic games and then in London, followed by in Rio. When I first came to know him in Beijing games, I thought he was a one-timer, but then during the London games, from the commentators to everyone who are familiar with his sport had great expectation on him and he delivered it. Finally, in Rio, I prepared for the historic occasion and so did it again for the last time. I am talking about the fastest man alive, Usain Bolt. It's great to be born in this generation to witness such a great achievement. If not from the arena, at least from the live telecast. I have seen and still seeing many legends from other sports and Bolt is one of them.\r\n\r\nThis Jamaican sprinter is like a thunderbolt that struck in the last three summer Olympic games creating a new history. In each Olympic games, he had grabbed three gold medals. Now he's off the track and enjoying the normal life. But the film was focused to tell his rise and reign for the nearly fifteen years of his career. It all began in the Junior championship from the school days and since then he never looked back, but left behind the records the others to fetch. Especially, he still holds the world record for 100m in 9.58 seconds. By seeing his achievements, you might expect a coach who trained him would be like the one from 'Whiplash'. I was surprised to see a simple man behind him, as well as his friend-come-manager and all the other people around him.\r\n\r\nI did not know they were making a documentary about him. I only came to know just a week before watching it. I have seen some good sports documentaries, so I anticipated something extraordinary clips and inspiration. It is inspiring, good for young sports enthusiasts who wants to make big in their field. To be honest I was a bit disappointed with this film. This is not I was looking for. This looked more like a reality show. So I won't blame entirely on the filmmakers for failing to give the best product. Because I knew Bolt as a sportsman, but never knew him as a person, his character and all. He's a fun type. Seriously, I did not expect that.\r\n\r\n> \"All the way from Beijing to London and now to Rio. It is one of the greatest athletic achievements of all time.\"\r\n\r\nHe worked hard for what he's now, but at a time he's so fun. Enjoys his game, life, that's what you learn the most about him if you already know him as a sportsperson. Particularly a clip from the film about a cameraman who crashed on him proves he a temperless. I could not stop from laughing at it and so he was. They have interviewed some big names from other sports. They all talked about their special friendship with him and his talent. I am really upset for not interviewing one of his close friends and a countryman, Christopher Henry Gayle. They both are common in one thing, that's the number 333. You will understand what that means if you know them both from their sports.\r\n\r\nOne of the main issues was the film terribly lacks with the original clips or the photographs from his life. Everything about him on the track were perfectly aligned, other than that the rest of them were exclusively shot for the film like a feature film, including the interviews. So the recreation of those recollects were not that effective to blend with the story. Also a bit falls off the track with too much of off the track focus, but it's not boring, totally fun to watch such person. That's why even it is stretched to nearly two hours, it does not feel like a drag.\r\n\r\nAfter every win, he celebrates with his 'lightning bolt' pose. As his name, as his record talks, that is the defining moment. The Jamaican medal tally might dip from the next Olympic games since he got retired. But his nation will be remembered for him forever. It is a good documentary film, but should have been great. Now I am thinking about a feature film and I hope somebody would make it in the near future. I recommend this, but keep your expectations low if you already know much about him. But for others, it will make a bigger impact.\r\n\r\n_7.5/10_",
         "url": "https://www.themoviedb.org/review/5887dd72c3a36859e9004a3f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "580d00e8c3a368260d010391",
               "name": "Usain Bolt",
               "profile_path": "/eBCKyQo2CmyEnJCCv8IXnW7qpOf.jpg",
               "id": 216300,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "580d00f292514171a3010f17",
               "name": "Neymar Jr",
               "profile_path": "/auKQN8SIhNv5ywNgHgeQqWIlY5X.jpg",
               "id": 1328983,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 0,
               "credit_id": "580d0108c3a368249d00e359",
               "name": "Serena Williams",
               "profile_path": "/25SKrM9krVYuaZ5keGsyUvGLR3C.jpg",
               "id": 1214573,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "580cfff4925141701a011612",
               "name": "Gabe Turner",
               "profile_path": null,
               "id": 107818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "580d0033c3a3682286010ca1",
               "name": "Gabe Turner",
               "profile_path": null,
               "id": 107818,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.292211,
      "production_countries": [],
      "id": 422469,
      "vote_count": 31,
      "budget": 0,
      "overview": "Fully authorized, access-all-areas feature doc on the hugely charismatic and globally adored Usain Bolt – officially the fastest man alive. With never-before-seen archive footage of his youth in Jamaica, through to original footage that will be captured at his fourth and final Olympic Games in Rio, where he will compete for the gold in both the 100 and 200 metres races, for a third straight Games before his retirement in 2017. I AM BOLT will reveal the man and define the legacy of this incredible athlete.",
      "similar": [
         227306,
         323677,
         612,
         13,
         621,
         699,
         7451,
         42888,
         104,
         82693,
         396371,
         86130,
         2395,
         11287,
         10897,
         77875,
         9443,
         2133,
         269,
         319888
      ],
      "original_title": "I Am Bolt",
      "runtime": 107,
      "poster_path": "/oRVEtjJn7b9zrjMBMbtI7oNmYmR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-11-28",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Benjamin Turner",
         "Gabe Turner"
      ],
      "runtime": 107,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4647900/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNDhiNDEwYTQtNzY5MC00YWIwLWI5YjgtYzUxYTViMTFlNjdhXkEyXkFqcGdeQXVyMTE2ODA5Nzk@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Pele",
         "Neymar",
         "Serena Williams"
      ],
      "reviews": [
         "In terms of personality, Bolt is the greatest. It's sounds like a bit cliché to connect these two words: Bolt and greatest. It seems to me that's enough just to say Bold. He is the definition of what it's like to be bold guy who won the Olympics nine times! Did you hear me? Nine times! In real life, at least if you watched both documentaries about him, he is the next door guy. His way of laughing, joking, making fun of his couch, and chatting with his friends, he is the ordinary guy. He is like my friends I'm hanging out. Really! But man, you are watching nine times champion of Olympic games. Impressive to see why are greatest the great and it isn't because of their ego, it's all because you have done something in this World. No matter how big or small, just keeping the eye on your aim and do anything to make it happen. There were few truly inspirational moments in this movie.My opinion is the documentary is a failure how they covered the fastest man alive. Rating 7/10 I gave for the documentary, Bolt himself has always been 10/10!",
         "I have been a Usain Bolt fan in the sense that I am happy for him, and athletics with his success. But to see the stumbles he has had, the times he has lost races, and the challenges of remaining motivated gave me an appreciation for his 9 gold medals. This documentary shows us his modest lifestyle (minus the gold sports car), his desire to enjoy life as a normal person would, and the quality humans surrounding him. His agent, manager (childhood friend) and coach. It follows his 3 olympics in chronological order, interlaced with his preparation for this year's olympics.",
         "I saw him on the television during the Beijing Olympic games and then in London, followed by in Rio. When I first came to know him in Beijing games, I thought he was a one-timer, but then during the London games, from the commentators to everyone who are familiar with his sport had great expectation on him and he delivered it. Finally, in Rio, I prepared for the historic occasion and so did it again for the last time. I am talking about the fastest man alive, Usain Bolt. It's great to be born in this generation to witness such a great achievement. If not from the arena, at least from the live telecast. I have seen and still seeing many legends from other sports and Bolt is one of them. This Jamaican sprinter is like a thunderbolt that struck in the last three summer Olympic games creating a new history. In each Olympic games, he had grabbed three gold medals. Now he's off the track and enjoying the normal life. But the film was focused to tell his rise and reign for the nearly fifteen years of his career. It all began in the Junior championship from the school days and since then he never looked back, but left behind the records the others to fetch. Especially, he still holds the world record for 100m in 9.58 seconds. By seeing his achievements, you might expect a coach who trained him would be like the one from 'Whiplash'. I was surprised to see a simple man behind him, as well as his friend-come-manager and all the other people around him. I did not know they were making a documentary about him. I only came to know just a week before watching it. I have seen some good sports documentaries, so I anticipated something extraordinary clips and inspiration. It is inspiring, good for young sports enthusiasts who wants to make big in their field. To be honest I was a bit disappointed with this film. This is not I was looking for. This looked more like a reality show. So I won't blame entirely on the filmmakers for failing to give the best product. Because I knew Bolt as a sportsman, but never knew him as a person, his character and all. He's a fun type. Seriously, I did not expect that. \"All the way from Beijing to London and now to Rio. It is one of the greatest athletic achievements of all time.\" He worked hard for what he's now, but at a time he's so fun. Enjoys his game, life, that's what you learn the most about him if you already know him as a sportsperson. Particularly a clip from the film about a cameraman who crashed on him proves he a temperless. I could not stop from laughing at it and so he was. They have interviewed some big names from other sports. They all talked about their special friendship with him and his talent. I am really upset for not interviewing one of his close friends and a countryman, Christopher Henry Gayle. They both are common in one thing, that's the number 333. You will understand what that means if you know them both from their sports. One of the main issues was the film terribly lacks with the original clips or the photographs from his life. Everything about him on the track were perfectly aligned, other than that the rest of them were exclusively shot for the film like a feature film, including the interviews. So the recreation of those recollects were not that effective to blend with the story. Also a bit falls off the track with too much of off the track focus, but it's not boring, totally fun to watch such person. That's why even it is stretched to nearly two hours, it does not feel like a drag. After every win, he celebrates with his 'lightning bolt' pose. As his name, as his record talks, that is the defining moment. The Jamaican medal tally might dip from the next Olympic games since he got retired. But his nation will be remembered for him forever. It is a good documentary film, but should have been great. Now I am thinking about a feature film and I hope somebody would make it in the near future. I recommend this, but keep your expectations low if you already know much about him. But for others, it will make a bigger impact. 7.5/10",
         "He is very talented and works hard every once in a while. There I saved you 2 hours.",
         "The life story of the fastest man ever. Gives somewhat short shrift to his youth, but it documents his career. And most importantly, you learn about the man. They always say, records are made to be broken. Without drugs, I don't think that's possible here. He is done now. He will walk now into the light where legends go. But no one then or now, will ever be able to race the lightning bolt. No one did, and no one will. How do you put all that together? Family, the people around him, the willingness to work through injuries, the grueling training regimen? And stuff it literally like lightning into a bottle? Thats why there will never be another runner that will do what he did. This film illustrates that, quite profoundly. This was a 10 of 10. Both as a movie, and just as importantly, as a human being. People like this leave us all to soon, even while still alive. But like a shooting star, or, a lightning bolt, we are fortunate to have witnessed it.",
         "In the 100m and 200m, Usain Bolt has ruthlessly dominated the field in athletics in the last 8 years and is the only person ever to win a triple-triple of golds in the Olympics. Between his absolute reign and his fun-loving, animated demeanor, you can't be faulted for thinking it is just raw talent and some training. 'I am Bolt' presents a window into his life: the ups and downs, the euphoria and the lack of hope and motivation that are the natural cycles in a career in sport. It's a peek behind the perception of eternal greatness. Certainly a recommended watch."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Sport"
      ],
      "productionCompanies": ["Fulwell 73"],
      "summaries": ["The legacy of the fastest man in history, Usain Bolt."],
      "budget": 0
   },
   "movielensId": 167034,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-11-28",
      "dvdReleaseDate": null,
      "directors": ["Gabe Turner"],
      "runtime": 107,
      "movieId": 167034,
      "title": "I Am Bolt",
      "mpaa": "",
      "actors": [
         "Usain Bolt",
         "Neymar Jr",
         "Serena Williams"
      ],
      "imdbMovieId": "4647900",
      "originalTitle": "I Am Bolt",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["XVje1n8K240"],
      "plotSummary": "Fully authorized, access-all-areas feature doc on the hugely charismatic and globally adored Usain Bolt – officially the fastest man alive. With never-before-seen archive footage of his youth in Jamaica, through to original footage that will be captured at his fourth and final Olympic Games in Rio, where he will compete for the gold in both the 100 and 200 metres races, for a third straight Games before his retirement in 2017. I AM BOLT will reveal the man and define the legacy of this incredible athlete.",
      "tmdbMovieId": 422469,
      "avgRating": 3.79167,
      "releaseYear": "2016",
      "numRatings": 12,
      "posterPath": "/oRVEtjJn7b9zrjMBMbtI7oNmYmR.jpg"
   }
}