{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4693860",
      "video": false,
      "title": "Rodeo and Juliet",
      "recommendations": [
         289523,
         416261,
         299590
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Karen",
               "gender": 1,
               "credit_id": "57277e51c3a3682148000ddd",
               "name": "Krista Allen",
               "profile_path": "/aPNoOzxPicfSzPv2Qv7Ccex8WJL.jpg",
               "id": 21858,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Hugh",
               "gender": 2,
               "credit_id": "56311b659251416d52002465",
               "name": "Tim Abell",
               "profile_path": "/jTRTWvth6CMApbomOoMuMCI0z8t.jpg",
               "id": 99235,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Juliet",
               "gender": 1,
               "credit_id": "56311b77c3a3681b61010bf5",
               "name": "Nadine Crocker",
               "profile_path": "/xy8zucs7camkzRipZZbDXK4c5fL.jpg",
               "id": 1352022,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Monty",
               "gender": 0,
               "credit_id": "56311b8ac3a3681b5201015c",
               "name": "Zeb Halsell",
               "profile_path": null,
               "id": 1528557,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Judge Lawrence",
               "gender": 2,
               "credit_id": "56311b97c3a3681b590100ff",
               "name": "Buck Taylor",
               "profile_path": "/8rGjtybdOWL0trJOJ6LTpz7ffgc.jpg",
               "id": 71562,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Cleo",
               "gender": 1,
               "credit_id": "56abcc879251413e95003075",
               "name": "Lauren Alexandra",
               "profile_path": "/1KHewpBbneMVXDyz7vgUX1I0dGO.jpg",
               "id": 1485331,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Mary",
               "gender": 0,
               "credit_id": "56abcc879251417e22003726",
               "name": "Victoria Bergeron",
               "profile_path": null,
               "id": 1569794,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Ian",
               "gender": 0,
               "credit_id": "56abcc889251417e110037a3",
               "name": "Gavin Blakley",
               "profile_path": null,
               "id": 1569795,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Bobby",
               "gender": 0,
               "credit_id": "56abcc88c3a3681c3f003c73",
               "name": "Edward Buckles",
               "profile_path": null,
               "id": 1569796,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Roz",
               "gender": 1,
               "credit_id": "56abcc889251417e14003825",
               "name": "Eileen Daley",
               "profile_path": null,
               "id": 1569797,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Darlene Laves",
               "gender": 0,
               "credit_id": "56abcc899251417e2000373b",
               "name": "Samantha Johnson",
               "profile_path": null,
               "id": 1569798,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Tanya Wells",
               "gender": 0,
               "credit_id": "56abcc89c3a3681c310036b8",
               "name": "Colette Lemonier",
               "profile_path": null,
               "id": 1569799,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Clerk Recorder",
               "gender": 0,
               "credit_id": "56abcc89c3a3681c5c003a3e",
               "name": "Jazmine Reynolds",
               "profile_path": null,
               "id": 1569800,
               "order": 12
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.445671,
      "production_countries": [],
      "id": 365753,
      "vote_count": 16,
      "budget": 0,
      "overview": "Juliet heads to her grandfather’s ranch with her mother for Christmas, where she meets a horse named Rodeo and young cowboy who change her life.",
      "similar": [],
      "original_title": "Rodeo and Juliet",
      "runtime": 88,
      "poster_path": "/27vZfW2KdCFG2BV3lnk5qFZUAtW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2015-11-06",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://talmarc.blogspot.com/p/rodeo-juliet.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thadd Turner"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Stephen Beck",
         "Harry Cason"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4693860/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYyNTYyMjc5NF5BMl5BanBnXkFtZTgwMzkwNzM2NjE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Tim Abell",
         "Lauren Alexandra",
         "Krista Allen"
      ],
      "reviews": [
         "I write few reviews .. but when i see this i gotta speak up What could have been a great movie was wasted. The (IMDb edited) poor writing, and bad directing right off the hop. example ... spoiled daughter can't get a cell signal in the back country .. however MOM gets blown off by her publisher in the house and her life implodes. really? next same self spoiled daughter falls for hick boy .. and mom loses it again .. same girl plans to route around mom and get her freak on with hick boy. so much drivel its not worth more than 15 minutes in .. i gave up on it. mom is gorgeous .. daughter worth a a look .. stupid story in the 20 years before is farm girl leave home make good in big city .. really? (can we say hallmark moment?).. super hot chick really wants idiot redneck after 20 years in New York? Specially if she's a #1 book seller ? Really .. way beyond even hallmark .. which i love .... speaking for real life .. I would see through this plot if i was 10 years old . so poorly written and acted .. its hard to believe they got the funding",
         "This movie is horrible, I do not recommend it. The Mom acts like a 15 year old drama queen, and dresses like it. The daughter acts so spoiled. I honestly couldn't stand it. If the acting is so poor, it's hard to fully enjoy the movie. And the men? With long hair mullet type hair-do's? Can you be more stereotypical. Geez. The outfits? Total Hollywood. Not realistic at all. And so much is built up between Juliet and Monty, kissing, connection, and in the end, they race each other like brother and sister? And her mom and his uncle are getting married, so what, the young couple ignores it? Nothing is said? Since they'll be related now, they won't date? So much built up tension, then nothing to end it? Not even an explanation? Such a complete waste of time watching this movie. Don't do it. Horrible horrible awful movie.",
         "We loved this excellent movie. Our favorite character was Nanc because her acting was wonderful and we were intrigued by her romance with the barn dance dj. The uncle being illiterate really struck our heart strings. We would have given this movie a 10 but we did not like the mother's outfits. Also the lawyer was very sketchy because his office was not good. We also thought that Juliet's competitor Darla, was an excellent horse racer. We were glad they didn't die at the end like the original. We think this is a great learning tool for studying romeo and juliet. Monty is even named after the Montagues! The conflict in this movie parallels conflict facing the world today and forces us to examine our own actions.",
         "This movie is definitely worth watching. It is a girl who is normally spoiled and she gets put into a different environment and will eventually need to adjust. The part that She first meets Monty the cowboy she is not quite there but when she meets him everything changes. This girl who has never worked in her life ends up wanting a job to keep the horse Rodeo. I think it is cute that they tried to hide it from her mom because it is a surprise and it gets the person watching wanting to know what will happen. The barrel racing is really cool because it is showing that she is very determined and really cares about this one horse. I like the part of the city girl fall for the cowboy. The mom and her first love part is another good part. It shows them fighting but I think that is a good idea to have it in the story.It is giving an example of that even if you mess something up young there can always be a second chance. It is great what ends up happening between them. I think this is a overall great movie ad you should definitely watch it if you are a big animal fan or even if you are just looking for a really good movie to watch.",
         "I haven't seen a really bad movie in a long time, this is terrible. Terrible writing, terrible casting, terrible acting, terrible outfits, terrible chemistry, etc. The mother is from Days of our lives and she was an awful actress on that. The daughter and mother are not believable. .. the daughter looks 35. The mother looks 45. The love interests are dull. I don't care that the story is predictable and is the same old romance story. That's what us girls want... but the acting in this makes me cringe. The story itself seems like it would be really good but the casting.. horrible! I blame the casting director. Never hire her if you want your movie to do well. Kendra Jones. I'm going to call her out. I continued to watch this movie just because I had to see how bad this could be. If there was a less than one rating I would give it. Rodeo the horse was the best actor in it. If you'd like to watch some really bad acting this is it.. this is the movie for you!",
         "This is a cute film. Its far-fetched and predictable, but no one promised Zefirelli. There's romance galore for the leading ladies: both Juliet and her hot-shot, New York romance writer mom, Karen (Nora Roberts?) Right off we see middle-aged mom Karen styled as a Juliet wannabe: with ripped denim and leggings, boots, colored bras, eyelash extensions and overly long, age inappropriate hair extensions. It doesn't work. The look is just too young and grunge for a middle-aged mom. In a short time (the film is only 1:47) the two unexpectedly find true love and happiness with a couple of local cowboys, with dreams realized and even the promise of happily ever after. Proving you can go home - back to your uneducated dumped fiancée from 20 years past - who has obviously packed on some weight since then. Its good, clean holiday fun with just a few continuity issues and hiccups thrown in. This is supposed to be Christmas: at least a traditional school/holiday break in early to mid-December. The filming locations aren't even close. The ranch is decked out in lush green grass and full, leafy trees. Its sunny and everyone is wearing light jackets. The film opens somewhere in NYC, presumably the Upper West Side, where streets would be covered in dirty slushy snow, and the houses and streets decorated to the max for the Christmas season. Not a single snowflake, wreath, Salvation Army shaker or Christmas light in sight. Juliet's age and educational stats are never revealed. As they travel southbound, Juliet admits to submitting assignments with only one minute to spare on the last acceptable day. She appears to be beyond high school age with the long eyelash extensions and sophisticated leather jacket and booties. Regardless, whatever she was pursuing in or around the Big Apple, Juliet joyfully casts it aside to accept a rough rider cowgirl role as part of neighboring rancher Attenborogh's pro-circuit rodeo empire. It's really quite an accomplishment to be charged with training young horses, presumably Attenborough's livelihood, having only three short weeks of barrel training experience on her resume. Juliet enjoys her less plastic, new found friendships with Monty and Nan and Rodeo. So much so that she casually dumps her old gal pals in New York City after only three weeks, presumably due to a lack of cell signal and the subsequent inability to FaceTime and Snapchat. The judge tells them right off the bat that cell service is all but nonexistent on the ranch. There IS WiFi in town. This is the same crooked judge who misrepresents that Karen's father died intestate. But, miraculously, and it IS Christmas after all, Karen finds a strong signal in the dining room of the house. She does have to keep the money coming in, with her deceased father's ranch upside down in debt. Ah, the magic of the Season strikes once again when Karen and Hugh get back together and engaged. Where does that leave Juliet and Monty? Are the four of them going to shack up together at the ranch? Hugh is responsible for providing for Monty, so where is he going to live? Yeah, this film is wrought with silliness and too many unanswered questions, but the story is sweet, clean, G-rated, for any age group, and ends positively. Isn't that what a good Christmas classic should ultimately accomplish? Enjoy!",
         "LET ME TELL YOU WHAT. I HAD A REAL BUCKIN GOOD TIME WATCHING THIS! Now I believe there is room for improvement so it will be getting a 6 out of 10 from me. Sandrifer Garlock (the mother who looks like a mix of Sandra Bullock and Jennifer Garner) is having that classic struggle where a single mother, who inherits a wild plantation/ranch down in he way hot summers of Louisiana, has to convince her bratty teenage daughter, Juliet (played by someone in her late 20s, possibly the gal from PLL and Ned's Declassifieds?) to leave their life behind in NYC and start a new chapter in their lives. They get down there and Juliet immediately makes a black friend (at least they attempted diversity) near offensively named, Nan, and falls in love with a CGI horse named \"Rodeo.\" This movie has it all. Love, romance, tragedy, despair, broken hearts, SCANDAL, friendship, and inspiration. This movie, despite that she falls in love with her mother's lover's nephew's brother's first cousin twice removed's fiance's father or something (almost too close for comfort), really provided a nice evening of laughs and memories. Very clever title name too honestly. Quite superb!",
         "Good, cute movie. Casting.. eh... but Zeb Halsell? Call me a cougar, but yum. could watch him breath. :) Nadine is very pretty. Kind of a Stockard Channing look to her. She's a bit old for the role, I think. For a supposed 20-year-old, she is WAY to obedient to her mom. Dialogue in script seems like it should be more of a rebellious 15-, 16-year old person. Mother and daughter look like sisters. Decent movie if you are just looking for some fantasy romance kind of thing to take your mind off the \"real\" world. :)"
      ],
      "genres": [
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Talmarc Productions"],
      "summaries": ["Big-city girl goes to the country and meets a special horse and young cowboy who teaches her to barrel race, while her mother reconnects with a local rancher she was in love with 20 years earlier."],
      "budget": 0
   },
   "movielensId": 167288,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-11-06",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 88,
      "movieId": 167288,
      "title": "Rodeo and Juliet",
      "mpaa": "",
      "actors": [
         "Krista Allen",
         "Tim Abell",
         "Nadine Crocker",
         "Zeb Halsell",
         "Buck Taylor",
         "Lauren Alexandra",
         "Victoria Bergeron",
         "Gavin Blakley",
         "Edward Buckles",
         "Eileen Daley",
         "Samantha Johnson",
         "Colette Lemonier",
         "Jazmine Reynolds"
      ],
      "imdbMovieId": "4693860",
      "originalTitle": "Rodeo and Juliet",
      "genres": [
         "Romance",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Juliet heads to her grandfather’s ranch with her mother for Christmas, where she meets a horse named Rodeo and young cowboy who change her life.",
      "tmdbMovieId": 365753,
      "avgRating": 2.7,
      "releaseYear": "2015",
      "numRatings": 5,
      "posterPath": "/27vZfW2KdCFG2BV3lnk5qFZUAtW.jpg"
   }
}