{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1056441",
      "video": false,
      "title": "Tru Loved",
      "recommendations": [
         207941,
         324213,
         212927,
         196967,
         266425,
         91122,
         84314,
         31978,
         70264,
         43664,
         78307,
         46228,
         30767,
         268108,
         26864,
         17651,
         39770,
         155556,
         47963,
         109614
      ],
      "backdrop_path": "/6SpCwcEIa0GauwZEW16DTHTVzzW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tru",
               "gender": 1,
               "credit_id": "52fe43fe9251416c9100172b",
               "name": "Najarra Townsend",
               "profile_path": "/a51Id5hOZCFhIBoAXbSXOm3NHnA.jpg",
               "id": 53891,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Trevor",
               "gender": 2,
               "credit_id": "52fe43fe9251416c9100172f",
               "name": "Jake Abel",
               "profile_path": "/b42lzZ38SHl4n1Oe2EHS9XNHdtO.jpg",
               "id": 105727,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lodell",
               "gender": 2,
               "credit_id": "52fe43fe9251416c91001733",
               "name": "Matthew Thompson",
               "profile_path": null,
               "id": 105728,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "52fe43fe9251416c91001737",
               "name": "Alexandra Paul",
               "profile_path": "/bTE5wVsPxRB5ZWPn8bSo5fE9hGR.jpg",
               "id": 55567,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Walter",
               "gender": 2,
               "credit_id": "52fe43fe9251416c9100173b",
               "name": "Tye Olson",
               "profile_path": "/4eI8ey8OLgPwZ37FL3tvLF7zndJ.jpg",
               "id": 85417,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pierced Boy",
               "gender": 2,
               "credit_id": "587a7058c3a36849ff0050fb",
               "name": "Jay Costelo",
               "profile_path": "/3TtJRbRUFLhutJdPU8Uj85KoDnZ.jpg",
               "id": 123171,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mr. Bushnell",
               "gender": 2,
               "credit_id": "591522b6c3a36840aa014294",
               "name": "Alec Mapa",
               "profile_path": "/e6Lj0IihgcmBw6FuzU5y8toEREq.jpg",
               "id": 12224,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Grandmother",
               "gender": 1,
               "credit_id": "591522e0c3a3683a93015160",
               "name": "Nichelle Nichols",
               "profile_path": "/1p5EIwiyFBxjs5e8a6AzPRzy1JL.jpg",
               "id": 1753,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Uncle Daniel",
               "gender": 2,
               "credit_id": "59152301c3a3683fb6014b99",
               "name": "Bruce Vilanch",
               "profile_path": "/fKKkIdJaf5DNhIq45F5YFJOmc85.jpg",
               "id": 119713,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "5915231bc3a3683fb6014bad",
               "name": "Jasmine Guy",
               "profile_path": "/pVzVMjL017INzJUhayvjObnYThR.jpg",
               "id": 77353,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Ms. Maple",
               "gender": 1,
               "credit_id": "5915234292514159c10153c3",
               "name": "Jane Lynch",
               "profile_path": "/1vjkjyIfphST9onBsMTKmTSl3z8.jpg",
               "id": 43775,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43fe9251416c91001741",
               "name": "Stewart Wade",
               "profile_path": null,
               "id": 105729,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fe9251416c91001747",
               "name": "Stewart Wade",
               "profile_path": null,
               "id": 105730,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.552129,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30124,
      "vote_count": 12,
      "budget": 0,
      "overview": "Recently relocated from San Francisco to conservative suburbia by her lesbian mothers, Tru struggles like all teens to fit in and find love, but her quest is complicated by sexual politics, closed minds, and closeted friends as she seeks to establish her school's first Gay-Straight Alliance.",
      "similar": [],
      "original_title": "Tru Loved",
      "runtime": 102,
      "poster_path": "/tWTygg5Zek3hvVCODapwK6H8VRN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "BrownBag Productions (II)",
         "id": 5020,
         "origin_country": ""
      }],
      "release_date": "2008-02-27",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stewart Wade"],
      "runtime": 102,
      "synopsis": "Recently relocated from San Francisco to conservative suburbia by her lesbian mothers, Tru struggles like all teens to fit in and find love, but her quest is complicated by sexual politics, closed minds, and closeted friends as she seeks to establish her school's first Gay-Straight Alliance.",
      "writers": ["Stewart Wade"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1056441/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzIxMjA1OTI2NF5BMl5BanBnXkFtZTcwNzQyMzg5MQ@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Najarra Townsend",
         "Jake Abel",
         "Matthew Thompson"
      ],
      "reviews": [
         "I recently saw this at the Vancouver Queer Film Festival to an almost packed house. Tru Loved is the story of a teenage girl named Tru (short for Gertrude) who goes to a new school. Of course, she doesn't fit in at first, mainly because she is labeled as a \"freak\" by the popular crowd (ie. about 3 or 4 people) when she looks quite average actually. The twist here is that her she has two sets of parents -- two moms and two dads, of which they're all gay. This element proves to be refreshing and comedic at times. However, when dealing with teenage themes, there are always going to be stereotypes and clichéd situations, especially when it comes to gay-themed films (ie. conservative parents, the anti-gay jocks). What set Juno apart from most other teenage films was the interesting and colourful characters. Tru, as the protagonist, first comes across as possibly interesting, but falls behind other major characters who have bigger problems than her. In the beginning, she fantasizes about outlandish scenarios, which, instead of adding her to character, only seem like something the writer added in the hopes of making her interesting when it in fact strangely clashes with her somewhat bland personality. She meets and befriends Lo, who turns out to be gay, and is reluctantly becomes his \"girlfriend\". This and other events happen TO her, and after a while, it is clear she doesn't have any particular goal but merely follows other subplots and guides people, which was frustrating at times. In fact, the entire film felt more like Lo's story rather than hers. This isn't to say that the film wasn't entertaining. A few great punchlines kept the audience roaring with laughter (as much as I want to, I can't repeat it. Go see it for yourself). The acting decent, the direction alright, the budget noticeably small but overlooked, Tru Loved is a good second film from Stewart Wade, but don't take it too seriously as real life.",
         "I absolutely loved this movie!! (and it seemed that the rest of the audience did too from their reactions). Here they took a serious subject, - one that is certainly timely, currently facing much publicity and discussion; - a great problem for many, emotionally, politically, legally and more - a hot button issue and in the news at this time, - and they presented it with clarity, and in a very entertaining way. I was moved deeply by this movie, but also very entertained and laughed out loud many times. Both the story and acting were excellent - a little over the top at times, but it fit well. For many people this subject is a little over the top. This movie teaches, without our realizing we are being shown or taught, about strength of character, compassion, understanding, tolerance and love. The lead actress, who played Tru, was outstanding. She was so natural. It felt real. I highly recommend this movie; especially for young people. They will love it, and unknowingly grow as a person from it as well",
         "I think many people do not take a chance and find out the truth for themselves. In regard to movies, they depend on reviewers to take the chance and do the work for them. Doing so gives power to reviewers, which is an evil thing. Those very people who give away their rights will think that, since Roger Ebert dismissed 'Tru Loved', it is not a good movie and will not go to the trouble of finding out for themselves. And this confirms their prejudices and makes them feel secure. 'Tru Loved' is a very good movie indeed. So why did he dismiss it? Why dismiss a movie that deals wisely with two of the most difficult aspects of human relationships, sex and race, in an entertaining and unifying way. That has a fine story. That has excellent acting which is natural and convincing (Najarra Townsend, as 'Tru', is inspiring). That has the priceless effect on the audience of goodwill and fellowship. That is pure and genuine. Why dismiss such a terrific movie? I think the reason is that Mr. Ebert did not give the movie a chance to unfold. As a result, he missed the whole point of 'Tru Loved'--which is human unity. Then, in response to criticism, he went back and justified his position, still missing the point. Why did he miss the point that 'Tru Loved' is about human unity? Because of unconscious fears, distaste or antagonism? Because of physical illness? Because it reminded him of other movies he didn't like? Because it didn't taste like his cup of tea? Who knows why? Personally, I love 'Tru Loved'! I think it is a marvelous movie! I recommend it to all my friends. That's my review. But don't take my word for it, find out for yourself.",
         "You absolutely must see this movie. I saw it at the closing gala for Outfest and it is amazing. The story is funny, heartwarming, pertinent and deals with a subject that we and our children live with every day in our world. And, it deals with it with great honesty, love and heart. The film deals with adolescent self acceptance and tolerance and shows the importance of people working together to achieve common goals. I think it should be requisite viewing at every middle and high school as well as every PTA in the country. Stewart Wade has written a beautiful story that is brought to life by a stellar cast. Nothing short of fantastic. Theresa Shell Los Angeles California",
         "I too saw this about a year ago in Los Angeles. My son had seen it at his school and was very excited about it – he and his friends thought it was great. Apparently they were showing it in schools as a learning tool. When I saw it was showing in theaters, I went out of curiosity. I enjoyed it very much! I agree with all Theresa Shell's comments here . . . it should be shown in all middle and high schools as well as PTA meetings throughout the country. \u0085 A gentle yet entertaining way of expanding our thought processes toward tolerance and understanding. I understand that this movie was made shortly after a young high school student in Southern California had, because he was gay, been killed by a fellow student. High school years are such a hard time for so many kids trying to struggle with all kinds of social stresses; being gay just one example, it can be just feeling unattractive or being very shy, or over weight, or under weight, or family struggles or feeling shut out of a group they admire, or breaking up with a boyfriend or girlfriend, or being made fun of for any reason, or embarrassment over some thing that other people are not even aware of. It goes on and on. We all need to learn to accept others for who they are and realize, we all are struggling with who we are.",
         "I saw this a year or so ago and it was great. I've mentioned it to many friends and we've been watching for it in theaters or on DVD ever since. I understand it is coming out on DVD in January 2010. I wish it had been released before Christmas, I'd have given copies to my friends as gifts. Seeing it in the theater was great because the audience reaction was fun and infectious. There was so much out loud laughing and other reactions that it made it comfortable to do so myself. Everyone around me seemed to enjoy it as much as I did. It was funny and sad and instructive and - I think, an important movie for people to see; especially in these times. I recommend it highly. See it. You'll be glad you did.",
         "I saw this movie with a film class and every one of us thought it was god-awful. The writing is totally flat and the acting is even worse. The characters and situations only become more unbelievable as the movie drones on. So both of this girl's parents are gay? And her fake boyfriend is gay? And her real boyfriend's uncle/dad is gay? Are we really supposed to just swallow that? Come on. This movie could almost be funny in a campy way if it didn't take itself so seriously. I'm not criticizing its message--I happen to completely agree with it--I just don't appreciate being bashed over the head with it. This movie has all the subtlety and nuance of a tidal wave. A lisping, rainbow-colored, Madonna-singing tidal wave.",
         "The only person who deserves positive credit for Tru-Loved is whoever edited the trailer, because it gives the distinct impression of a cutting edge, highly relevant and entertaining film, but sadly the trailer contains the only good and valuable few minutes of the entire feature. Tonight after just five minutes I was seriously thinking of pressing the fast forward or eject buttons, but since I'd paid $29 (Australian) I was determined to see it through. What a tragic waste of time and money (for myself as well as the filmmakers). Tru-Loved is bloated, limp and literally drips with cheese - and in spite of being obviously well intended, it manages to fail in every regard as acceptable cinema. I was especially annoyed that there was so little skill demonstrated in the sound design. There were repeated scenes (mainly in the tree house) where the voices dropped so low that I had to pump the volume on my amp to understand what was being said - and even then the voices were being drowned out by the sound of the actors' footfall. I had to then quickly adjust the amp volume back down as the next scene blared out. That sort of careless attention to detail reflects directly on the technical quality of the whole film. I had bought this DVD thinking it would be a youth positive asset for an LGBT community film night, but sadly it's much more likely to go in the bin (as did \"The Curiosity Of Chance\" and \"Tan Lines\").",
         "Done as a light comedy, while dealing with serious subject matter, this was a very worthwhile and valuable movie. I enjoyed it very much, as did those all around me. It was done with both serious straight on acting and also tongue in cheek comedic acting, which somehow balanced out well – a perfect fit! The lead actress who played Tru was just wonderful. She was so natural and real. All the young actors were wonderful and played their parts perfectly. -- Our big stars of the future! ( I'm serious!!) Those who played their parts just slightly over the top, as their parts were clearly meant to be, were fabulous. They made it fun and kept it all rolling along. There it all was – the social struggles of high school, the foolishness of our actions in those years of growing and finding ourselves – the pain and cruelty and strength and kindness and sadness and young love and yearning --- and, and, and -- . Personally, I could have done without the fantasy scenes; I found them okay, but unnecessary and somewhat distracting, however in talking with others that were there, they loved those scenes, so who's to say. All in all, the cast was fantastic, the subject matter timeless and always important in our growth, and --very entertainingly presented. Well done."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "BrownBag Productions (II)",
         "Tru Loved"
      ],
      "summaries": ["Recently relocated from San Francisco to conservative suburbia by her lesbian mothers, Tru struggles like all teens to fit in and find love, but her quest is complicated by sexual politics, closed minds, and closeted friends as she seeks to establish her school's first Gay-Straight Alliance."],
      "budget": 0
   },
   "movielensId": 167262,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-02-27",
      "dvdReleaseDate": null,
      "directors": ["Stewart Wade"],
      "runtime": 102,
      "movieId": 167262,
      "title": "Tru Loved",
      "mpaa": "",
      "actors": [
         "Najarra Townsend",
         "Jake Abel",
         "Matthew Thompson",
         "Alexandra Paul",
         "Tye Olson",
         "Jay Costelo",
         "Alec Mapa",
         "Nichelle Nichols",
         "Bruce Vilanch",
         "Jasmine Guy",
         "Jane Lynch"
      ],
      "imdbMovieId": "1056441",
      "originalTitle": "Tru Loved",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["G8G27eAUSQc"],
      "plotSummary": "Recently relocated from San Francisco to conservative suburbia by her lesbian mothers, Tru struggles like all teens to fit in and find love, but her quest is complicated by sexual politics, closed minds, and closeted friends as she seeks to establish her school's first Gay-Straight Alliance.",
      "tmdbMovieId": 30124,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 2,
      "posterPath": "/tWTygg5Zek3hvVCODapwK6H8VRN.jpg"
   }
}