{
   "tmdb": {
      "original_language": "tr",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "istanbul",
            "id": 1847
         },
         {
            "name": "artist",
            "id": 2679
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "kitten",
            "id": 156143
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "cat lady",
            "id": 236969
         }
      ],
      "imdb_id": "tt4420704",
      "video": false,
      "title": "Kedi",
      "recommendations": [
         438449,
         450438,
         400812,
         381028,
         419546,
         6373,
         413770,
         32305,
         94725,
         393561,
         254323,
         398174,
         19958,
         53430,
         52036,
         489412,
         69426,
         368942
      ],
      "backdrop_path": "/7Ak9VJ67NEKuUmnVlDjGWWHSnB7.jpg",
      "revenue": 3787711,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Herself (Cat)",
               "gender": 0,
               "credit_id": "59f754bb92514131ec00095f",
               "name": "Bengu",
               "profile_path": null,
               "id": 1914441,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Himself (Cat)",
               "gender": 0,
               "credit_id": "59f754ce9251413204000918",
               "name": "Deniz",
               "profile_path": null,
               "id": 1914442,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Himself (Cat)",
               "gender": 0,
               "credit_id": "59f754eb92514131ae000a27",
               "name": "Duman",
               "profile_path": null,
               "id": 1914443,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Himself (Cat)",
               "gender": 0,
               "credit_id": "59f7551d92514131ec0009c3",
               "name": "Gamsiz",
               "profile_path": null,
               "id": 1914444,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Himself (Cat)",
               "gender": 0,
               "credit_id": "59f75524925141320400098f",
               "name": "Aslan Parcasi",
               "profile_path": null,
               "id": 1914445,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Herself (Cat)",
               "gender": 0,
               "credit_id": "59f7552ec3a36804ca0009ed",
               "name": "Psikopat",
               "profile_path": null,
               "id": 1914446,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Herself (Cat)",
               "gender": 0,
               "credit_id": "59f7554dc3a368048d0009c7",
               "name": "Sari",
               "profile_path": null,
               "id": 1914447,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5919ab99c3a36842d605b9ff",
               "name": "Bülent Üstün",
               "profile_path": null,
               "id": 1604692,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "570a93c892514155ed0007a6",
               "name": "Ceyda Torun",
               "profile_path": null,
               "id": 1603873,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "570a93d1c3a3687570004201",
               "name": "Ceyda Torun",
               "profile_path": null,
               "id": 1603874,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570a93ebc3a3687570004207",
               "name": "Charlie Wuppermann",
               "profile_path": null,
               "id": 1554530,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570a93f79251410ebf000299",
               "name": "Charlie Wuppermann",
               "profile_path": null,
               "id": 1554530,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "570a94099251417da70003ff",
               "name": "Mo Stoebe",
               "profile_path": null,
               "id": 1603875,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59f75573c3a3680424000b39",
               "name": "Kira Fontana",
               "profile_path": null,
               "id": 1914449,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.992843,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 392011,
      "vote_count": 61,
      "budget": 0,
      "overview": "A profile of an ancient city and its unique people, seen through the eyes of the most mysterious and beloved animal humans have ever known, the Cat.",
      "similar": [
         858,
         112160,
         141,
         634,
         437557,
         242224,
         297762,
         43923,
         18221,
         27586,
         2771,
         29343,
         9587,
         3134,
         11236,
         10735,
         5781,
         157360,
         342737,
         1919
      ],
      "original_title": "Kedi",
      "runtime": 79,
      "poster_path": "/5z2vuJk6P7V2azw3gWQF7L4l5xU.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Termite Art Productions",
         "id": 55996,
         "origin_country": ""
      }],
      "release_date": "2017-02-10",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "A cat meowing at your feet, looking up at you, is life smiling at you...",
      "adult": false,
      "homepage": "http://www.kedifilm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ceyda Torun"],
      "runtime": 79,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt4420704/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjEwNTM2NDE0Nl5BMl5BanBnXkFtZTgwMzMzNTc4MDI@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Bengu",
         "Deniz",
         "Duman"
      ],
      "reviews": [
         "\"Cats (unlike dogs) know that we're not God. They know we're just the middlemen.\" Interviewee Let your inner cat take over and roam Istanbul with director Ceyda Torun as she produces a lovely documentary about the charmed lives of the 100,000 or more cats that benignly people the famous Turkish city. By focusing on the lives of seven cats, Torun effectively characterizes all those privileged felines. Although this doc, Kedi (Turkish for \"cat\"), doesn't negate the generally accepted aloofness of cats or their notorious independence, it brings them alive as individual felines with attributes to make us love each one differently. Memorable are Psikopat (as in \"psychopath\"), a tough wife to a similar tuxedo, who fears her wrath, and Sari, an orange and white who cleverly forages for her beautiful brood. As lovable as all the animal stars of this entertaining documentary are, the humans who take care of the cats (when they let them) are almost as affecting. The interviewees come forward with sayings and observations that are at times lovingly profound and at others just shy of New Age: \"I heal my wounds by healing theirs,\" says one cat lover after cooking 20 pounds of chicken for a daily entourage of appreciative strays. This tone poem's veracity is slightly compromised by having minimal conflicts as the cats intrude multiple ways on Istanbul life. Kedi is a lyrical expression of love, but I've never heard of a city so pristine, virtually immaculate, while also having a robust street life that accommodates felines in such luxury. I guess I'll have to see for myself someday. If you see Kedi, you will seek out boxes of kitties on street corners forever condemning you to cute and cool little beings never more alluring than on the streets of Istanbul. \"Cats are the runes of beauty, invincibility, wonder, pride, freedom, coldness, self-sufficiency, and dainty individuality - the qualities of sensitive, enlightened, mentally developed, pagan, cynical, poetic, philosophic, dispassionate, reserved, independent, Nietzschean, unbroken, civilised, master-class men.\" H. P. Lovecraft",
         "\"Kedi\" (2016 release from Turkey; 80 min.) is a documentary about the thousands of stray cats (street cats) all over Istanbul. As the movie opens, we get a fabulous aerial view of the city, and then get to know a number of cats, starting with a female cat who is out hunting food on the streets, not for herself but as it turns out for her small kittens who are anxiously waiting her return. And that's just the start of this... Couple of comments: if you don't care for cats, then by all means do yourself a favor and seek out another movie. If on the other hand you love cats, you are in for an absolutely delightful treat. Apparently as we learn in this film, Istanbul, itself a huge metropolis, is home to many street cats, and the city's population (at least for the most part) has taken upon itself to care for these cats, and to outright love them. The movie focuses on a handful of cats, all of them with their own personality (the \"fish thief\", the \"carefree\", the \"flirt\", etc.). A number of shots are filmed from the cat's perspective (i.e. close to ground level). Along the way, we get a fabulous look of what day-to-day life in Istanbul is like. At one point a woman comments \"it is difficult for women to express their femininity in this country, but the cats do it so gracefully\", a dig as to the social environment for women in Turkey, even in a cosmopolitan city like Istanbul. But in the end, it's all about the cats: they hunt, they play, they roam the streets, they fight, they climb, and along the way they steal your heart. I had heard a glowing review of \"Kedi\" on NPR a week or two ago and when \"Kedi\" opened this weekend at my local art-house theater here in Cincinnati, I couldn't wait to see it. The Friday evening where I saw this at was PACKED, much to my surprise, and the audience absolutely LOVED the movie, laughing out loud many times throughout the movie. After the movie was over, I couldn't wait to get home, where I knew my beloved cat Mimic would be waiting for me ;-) If you love cats, you don't want to miss this, be it in the theater, on VOD or eventually on DVD/Blu-ray. \"Kedi\" is HIGHLY RECOMMENDED!",
         "I gave \"Kedi\" a 10 rating on IMDb. In the early 2000's, the most spiritual film arguably was \"March of the Penguins,\" about eccentric mating rituals but much more about the holiness of life and the will to live among eccentric wild animals. The *exact* is true, but in much more human-friendly terms, about \"Kedi.\" \"Variety\" calls this film \"graceful,\" which its lovely (xylophone?) soundtrack emphasizes. \"Kedi\" is urban, fast-paced, and deceptively lighthearted--deceptively because \"Kedi\" is about the universal need humans have to care for animal life. The narratives the various street cats' food- and love-providers give offer insights into the needs of humans much more than the needs of the cats. One man in particular, who wanders each day feeding the cats with sacks of food, explains bluntly that he suffered a nervous breakdown fifteen years ago, and that the only thing that raised him out of his depression was taking care of the strays, and that, in this discipline, he found meaning and happiness. A constant refrain that all the food- and love-givers repeat is that without the ability to love animals, we do not have the ability love one another. \"Kedi\" raises some questions the producers leave unanswered. A few of the human \"supporting cast\" bring up the matter of neutering, but at least this viewer was mildly stunned by the lack of concern in general for the cat overpopulation. (I'd have donated instantly to an international or domestic U.S. Go Fund Me account!) The film also repeats how urbanization is destroying the seaside lands the cats depend on for survival--and no one addresses any animal rights group's efforts to step in and help. The irony is how the film's impact is all the stronger for its total silence on controversial topics, because in the end, \"Kedi\" is just about love. As \"March of the Penguins\" was about the will to live, \"Kedi\" is about love, pure and simple, from the ginger mother cat's odd adaptation to hunting-and-gathering for her kittens back in a stairwell, to the older folks for whom the cats are a reason for living and armor against loneliness, we see the innate and complex human and feline need for one another. Another, and maybe the most potent, message of the film is that keeping domestic animals as pets is in the end unworkable. Many of the people interviewed say that cats do not belong indoors, and that being kept indoors changes and even destroys a cat's nature. Whether a viewer holds deep opinions on this increasingly widely held but controversial subject is yet another of the themes \"Kedi\" stays as silent on as the cats who star in it. Finally, \"Kedi\" interviews a charming Muslim who tells how as a boy he and his brother planted Christian crosses on the graves of cats that died and that they gave proper burials to; and how their father was infuriated that they would convert to Christianity as a result of their little rituals. And then the young man says what will make everyone cry: he could not have survived to adulthood without his love of the street cats. That's about as primal a statement about our shared humanity as you'll see in this year of a world increasingly divided by religious and political strife. \"Kedi\" is about YOU. It's about your response to neediness, to vulnerable innocence, and to the universal truth that the only thing the world really needs is love. \"Kedi\" may have human competition for best film of 2017; for me, it will be the Best Film of the Decade.",
         "This movie made me fall in love with my cats again. The beautiful cinematography and the limited story line was a treat to watch. I have always admired Turkey and after watching this I want to be there as quick as possible. Cat lovers are special people and we can see so many sweet people in there. I smiled so much looking at them with tears in my eyes. Thank you for this.",
         "This movie was wonderful. Whether you're a cat lover or not, it's hilarious, poignant, and amazingly well-shot. The cinematography of capturing so many cats at play, fighting, protecting their babies, etc. must have been absolutely grueling, so huge kudos to the filmmakers for presenting a work which so obviously shows care was taken to get these amazing visuals. Kedi is a love letter to the cats of Istanbul, and their guardian angels who keep them fed and sheltered. Go see it!",
         "if you love cats, and admire/respect people who love cats, you will love this film. Kedi focuses on a half a dozen or so cats and their primary human caretakers. Each cat has their own very unique personality put on them by their caretakers. These individuals who take their of these people are very respectable, humble people. You will really admire how much these cats mean to them. They take on a very philosophical, down-to-earth, often religious approach to why they care for these stray cats. For most of these people, these cats have improved their lives and given them a better respect/appreciation towards life in general. It's very touching. There are also many scenes of of the city, showing random stray cats going about their lives, the cinematography and camera-work showing of the city is really great. These are a few brief scenes where you don't see any cats at all, just the people of Istanbul going about their daily lives. Does this film ever get depressing you may ask? Well, there is one sad scene in the film, but it is also one of those moments that you just have to accept as being a fact of life for these stray cats. There are also a couple scenes where you see swarms of cats waiting to be fed by their people, or scenes of litters of kittens living in dirty, clearly not ideal living conditions, and it makes you wish the city had some sort of TNR program to deal with the population of all these cats, but again, it's just one of those things you have to accept. Kedi is a all around feel-good film. But it did make me wonder when it was all filmed, considering the political turmoil currently going on in Turkey. It made me wonder how the people shown in the film and their cats are doing, if their lives have been negatively affected by all the chaos. I would certainly hope that is not the case. If you can still catch this film at your local theater that shows independent/art-house films, it is worth seeing for sure. Otherwise rent it or buy the DVD when it is released then.",
         "Have been waiting for this. So glad I went. Can't see films with animal abuse, death so almost did not go but I was rewarded with a stunning film. See this; you will NOT be disappointed. Cinephotography stunning. People and cats both sad and sweet, poignant, with high emotional impact. Hope I can find the music. I love world music, instruments. The music alone makes it worth seeing. A mix of traditional music, a little jazz, no syrupy pop music. Kedi will keep your attention riveted. Cannot recommend any higher than 10 out of 10.",
         "Uplifting story about the cats of Istanbul and the kind people who care for them and love them. Incredible cinematography beautifully photographed. The city of Istanbul looks both beautiful and mysterious. After seeing this film you will want to consider a trip to this fascinating ancient city. As no other film has done you will experience the incredible lives of these animals How they survive take care of their young and still remain playful happy an adventurous. One of the best documentaries I have ever seen. A film that you will not forget. This really is a captivating gentle film about the special bond between very decent people and these interesting animals that interact with them daily. It reminds us that a cat looking up at us is one of those moments how sweet life really is and that we should appreciate these moments that remind us that were alive.Ceyda Torun the director has given us a great cat's eye view of their lives haunts travels and more importantly the personalities. But she gives us a glimpse of the every day people and how caring for these animals has brightened their lives. The 7 cats are all quite distinctive and memorable. A special thanks to Kira Fontana for a beautiful sound track that enhances this film with Turkish and world music that must be made available. To all involved with the production of this film you have done a great job. This film has been very well received.",
         "You forget Turkey's difficult politics watching this documentary by Turkish filmmaker Ceyda Torun and cinematographer Charlie Wuppermann about Istanbul's Big Romance with—cats! (What did you think \"Kedi\" means?) At an hour twenty-minutes, the film is somewhat longer than it might be, but as a vacation from the news cycle, perhaps not long enough. The residents of Istanbul don't \"own\" most of the cats that roam their streets and markets, that nest in quiet places and makeshift hideaways. But they more than tolerate them, they celebrate them. And the cats, meanwhile, act like \"slumming royals,\" says Joe Leydon in Variety. You can see the cast here. A number of the featured felines rule the neighborhoods where they live, defending their turf against interlopers and providing benefits to the humans. \"They absorb my negative energy,\" one man says. A waterside restaurant owner who'd had a problem with \"mice\" (I fear this was a euphemism) celebrated the day \"this lion took up residence.\" She takes care of the \"mice,\" to the comfort of the diners, I'm sure. My particular favorite was the cat who lives at a deli. She never goes inside, but paws at the window—rather insistently, it should be noted—when she wants one of the countermen to make her a snack. The filmmakers identified a number of the city's human residents whose mission seems to be to keep these felines in food. One pair of women cooks twenty pounds of chicken a day for them. (!) \"All of us have tabs with all the vets,\" says a bakery owner, and we see a man take an injured kitten to the vet in a taxi.. In short, the film is charming. It talks about how cats are different than dogs. And it shows how caring for the cats has been helpful to people in many ways. Suitable for all ages, and especially for those who have—or wish they had—been to Istanbul and now are reluctant to go because of paragraph one above. As Leydon says, it's \"splendidly graceful and quietly magical.\"",
         "Beautiful, captivating, kind and gentle, Kedi, explores the bond between humans and the street cats of Istanbul. It's refreshing to see a creative documentary without politics or religion. Incredible cinematography and a creative plot. Kedi tugs at the heart and reminds us to be kind and loving while putting other creatures first. It's uplifting and original. A MUST see.",
         "This is an art-house theatre winner. Cats, Istanbul, and Turks waxing philosophical about cats - what could be better? Every indie movie house must be desperate to scoop up this film. If you're a foreign film fan who loves things off-the-beaten-path, you'll love this film. Kedi is refreshingly non-American. It steers clear of the formulaic elitism of typical American documentaries. Not only is it full of cute cats, but it also gives us a unique look at a culture most of us are unfamiliar with - Turkey and Istanbul. Did anyone know Istanbul is so stunning, aquatic, and reminiscent of old Europe, but with a unique vibe all its own? I can tell this film is increasing the tourism rates for Istanbul and Turkey. So there were shots of romantic alleyways like those in England or Paris. And there were picturesque cityscapes that remind me of an art film set in Edinburgh. Istanbul apparently has a very Euro cafe culture. But so much of Istanbul in the film seems so new to me - lots of colors, details, and an aesthetic that's all its own. The people interviewed seemed funny, artistic, intelligent, and thoughtful. Maybe they don't represent most Turks - just a subset that the director, Ceyda Torun, chose to interview for the film. Just like people in US films don't represent most Americans, the people chosen for this film surely don't represent the typical Turk. Watch all films with a grain of salt. So this is how the film lovingly paints Istanbul: -Colorful, artsy, dreamy, unique - like a film version of novels by Orhan Pamuk -Remniscent of romantic Old Europe, but also with a vibe and look that's all its own. (Turks apparently want to identify with Europe - who wouldn't? I can tell this is the image the director wants to portray - not Central Asian, not Middle Eastern, and not \"Oriental.\") -Loves its cats; the people are PETA types, altruistic, animal-loving. (Director has lived in the US since her teens, so of course the US animal welfare culture is heavily within her.) -Refreshingly free of an angry animal-rights vibe (It's not a Michael Moore film, or an animal welfare film that's overly preachy, but does have an altruistic animal lover vibe running through it.) -The Istanbul residents are creative, philosophical, kind of Zen, relaxed, happy, and cool in a unique way. (This is how the director wants to see herself, and these are her friends and acquaintances, so of course these are the people she interviews.) Obviously, the director feels very close and loving towards Istanbul and its people and cats. ^^ I thought it was interesting how Turks related to cats vs. Americans. In the US, alley cats and pet cats alike would surely be fed manufactured cat food. But most of the Turks in the film fed the cats raw people food, like fish, sliced meat, etc. And they threw the food directly on the ground for the cats to eat, while Americans would consider that taboo and dirty. We feed even stray and feral cats from bowls. Anyway, if you're a cat lover or art film lover - run, don't walk to see this film! It's probably the sweetest, prettiest, and most educational documentary of the year. Istanbul was never really on the radar for me, but now it's on my list of must-visit places. The director, Ceyda Torun, was apparently born in Istanbul, moved to the Middle East when she was 11, went to high school in NYC, and now lives in LA. So that explains the film and provides context for it. Torun reminds me of a softer, more dreamy, and less femi-Nazi version of Man Repeller, who's from NYC and of Turkish/Iranian descent.",
         "I was worried this would be sad and about starving strays but it is the opposite. Wonderful, caring people and a completely different culture than the American way shows us something truly amazing and magical.",
         "Loved this movie. Did not understand a single word that was spoken, but I did not need too... I was able to clearly see the love that so many people gave freely to these elegant, four-legged, furry creatures. TNR would be a wonderful option for such a huge over population that seems to be ongoing for these cats. I do dog rescue in the US and I wish that more people in the US would see this movie and view how so many of the cats of Turkey are cared for by the population of the country. What I encounter here in the US, for the most part, are people turning in cats that they have caught in cat traps. They set the traps in their yards and then \"proudly\" turn either someone's pet cat or a stray, into the animal pounds. When they are left there, for the most part, they have a very dismal future and end up being killed. There are not enough rescue organizations to help to save them, nor are there enough private adopters going to the shelter to adopt a new family pet. A disgusting state of affairs here in the US...",
         "As one who loves both Istanbul and cats, I looked forward to seeing this movie. I was not disappointed. Istanbul is depicted in all its cosmopolitan beauty...but the cats are the stars of the show. Istanbul has an abundance of stray cats, but the Turkish people care for them by providing food and shelter and (in many cases) affection and company. It's not a city for cat phobics, nor is this movie suitable for people who don't like cats. But, if you do, it's a delight. The cats' unique personalities shine through, as the movie takes you to various neighborhoods to show their daily routines. The camera aims about 8 inches off the ground, so you really feel like a cat following the stars through their activities. We see affectionate cats, dignified cats, vulnerable cats, resourceful and acrobatic cats, tough cats, artistic cats. And, in between, we hear from the people who love them. We learn something about how these cats fit into their life philosophy, and why some of them go to great lengths to help them survive and thrive. It's a beautiful look at a unique culture and its feline residents. If you can get to Istanbul, it's worth the effort ten times over. But, even if you can't, this little gem will give you an interesting look into the city and its occupants, both feline and human.",
         "There are movies out there for all types of people, old, young, romantic, sci-fi, but until now, nothing for cat-lovers. This is so popular in Sydney that I could not get a seat for the first 2 times I wanted to book in. The 3rd session, the next day in the afternoon, was full house, about 40 women and 5 men. Yep, that's the cat lover ratio. Istanbul is a city between East and West, and we see it as a fish eating busy and prosperous city, crowded with humans and cats. The people are just as charming as the cats. The cats eat well and have homes constructed from polystyrene boxes. There are the cat crazy humans and the crazy cats, polite humans and polite cats. This wonderfully shot, from the cat's eye view, documentary is a must see sleeper hit.",
         "Sometimes cute; sometimes funny; sometimes melancholic; sometimes philosophical, though always an accurate portrayal of our four legged friends; Kedi is a hidden gem. Regardless of your religion, race or culture, there is something there for everyone, and despite Istanbul being a city that is different in many ways, the themes and ideals explored are universal. Just like cats give us warmth, companionship and a sensation of being appreciated; this film accomplishes that same unique sensation. Focusing on the lives of seven cats, each with their own unique personality and characteristics, the documentary equally showcases how the people and the environments react to their presence. Those interviewed provide in-depth narration on their experiences, thoughts and feelings, which will truly remind you of human decency. It is nothing short of amazing. Though cats are occasionally tagged as lazy and ungrateful, with wild cats often viewed as a nuisance, this documentary shows the interesting lives these felines have. Every day, all of them have places to go and people to see, the feature giving us the time to pause, reflect, and notice how alike we are. The camerawork is fantastic, allowing us to track and follow all of the four legged friends which appear, from the winding alleyways, to the balconies which overlook the city streets, and the innumerable food stores, the camera going places you may never have thought of, to provide us an in-depth look into the lives of these many cats. The accompanying musical score is easy-going and memorable, like a catchy jingle, and really sets the tone. This is not a sombre documentary; it's a joyful one, though at the same time, reminds us to be mindful of how we treat the environment, lest these cats suffer. If I had any complaints about the documentary, it would be the length. As a proud lover of anything on four legs, the feature, which goes for just over an hour, felt more like a taste, than a main course, and it would have been great to see more of our seven friends, some of whom are provided more attention than others. That been said, from play-fighting through to territorial disputes; from jealousy through to adoration; from kittens to full grown adults; this documentary has it all.",
         "'KEDI': Four Stars (Out of Five) A Turkish documentary about the thousands of stray cats that live on the streets of Istanbul, and how they effect the community there. The movie was directed by Ceyda Torun, a Turkish-born filmmaker that now works out of the US, and it was produced by Torun and Charlie Wuppermann. The film has received nearly unanimous rave reviews from critics, and it's been performing really well at indie theaters (including my local theater, here in Corvallis, Oregon). Being a cat lover, I definitely enjoyed it. In Turkey, thousands of cats have lived on the streets of Istanbul (the largest city there) for centuries. Some of those cats are cared for, and deeply loved, by the people there. This film focuses on seven cats in particular; Sari, Duman, Bengu, Aslan, Parcasi, Gamsiz, Psikopat and Deniz. The film crew followed these cats around, while continuously filming them at street level. The crew also interviewed several people that interact with these felines. I think anyone that loves cats, or animals in general, will enjoy this movie. It does seem a bit long and slow-paced (even though it's only 80 minutes long), but the visuals are always beautiful to watch. The film is also pretty insightful, about how the cats deeply effect the people living in the community there. It's another great argument for why everyone needs to go vegan! Still, it would have been a lot better, and more effective, as a 20 to 30 minute short film. As it is, it kind of feels like a feature length YouTube cat video. It's more insightful than that, but still the cat videos that go on for too long can always benefit from better editing. Watch our movie review show 'MOVIE TALK' at: https://youtu.be/K3Maw4akm_o",
         "This film was wonderful and uplifting. First off, I am a cat lover. This film was a treat for me. Gorgeously filmed in Istanbul. I read a lot of the reviews here and one reviewer said it was about love. I agree with that. There are many things you could say this film is about. First and foremost it is about the connection the people have with these cats in this city. Most of these cats are wild. People feed them. There are a lot of caring people in the film that rescue them. People in the film express their personal stories about the cats or what they think of them. I just loved it. I highly recommend it if your a cat lover or an animal lover.",
         "This is a lovely but highly romanticized documentary about stray cats in Istanbul and the people who are doing their best to care for them. And I could just leave it at that. Unfortunately, when one knows better, one can't love a documentary that makes no mention at all of spay/neuter for street animals. All I could think of were the neglected animals which weren't shown in the movie (which anyone who has traveled in a non- first world country knows are there). I managed to catch a glimpse of only one cat with a clipped ear tip (the universal sign of a sterilized street animal), so, in the end, I found the movie sad. Feeding street animals without sterilizing them only increases their ability to reproduce and, while well meaning, is incredibly irresponsible. The filmmakers owed it to the cats to at least ask the question or make some mention of this. Instead they focused on the pretty side of an essentially bad situation.",
         "As a cat lover and person who enjoys traveling to Istanbul, I can call this documentary one of most favorite documentaries. Yes, Turks, particularly the residents of Istanbul, have big hearts and compassion not just to tolerate these creates but also take care of them and accept them as members of their own family. Thanks to the cast!",
         "I can't recommend this film highly enough. If you're a cat lover, you owe it to yourself to see this. Even if you don't classify yourself as such, it will still hit its mark. All of the people interviewed and the stories they tell about the cats they've come to know are examples of humanity at its finest, and I'm so glad the film makers took the time to document them.",
         "Istanbul is a port city and the cats that used to travel with the sailors hundreds of years ago would disembark thinking they had made their final destination, only to be left behind when the ship they had been travelling on left without them. This left generations of cats to make their home in Istanbul where they live semi-domesticated lives adopting humans who feel lucky to be able to feed them and pay their vet bills in exchange for the companionship these cats give them. Kedi (which means cat in Turkish) is about a small cluster of these cat/human pairings. We follow individual cats and learn about their personalities and about the people who take care of them but unfortunately even though the interview subjects hint at interesting stories or beliefs tied to why they feel such an infinity towards cats it's never explained in great depth and the subjects aren't given much time to explain themselves. Similarly while everyone is full of affection for the cats and their personalities we barely get to see much of them interacting or acting out before it's on to the next subject. And honestly I really love cats and had heard so many great things about this doc but at one point I almost fell asleep because the film was becoming so repetitive. Buried in the back their are so many interesting things being discussed, specifically about how gentrification and the ubanization of Istanbul means that these feline friends will be abandoned or imperilled, but again the treatment given is so service that these issues are barely discussed.",
         "Truly breathtaking filmmaking at work. This is what art and storytelling are all about.",
         "If you're an animal lover, and in this particular case a cat lover, there is no doubt you will like this documentary. It's well shot and the commentary of the people helping or having cats are obviously from people that love cats. I've always been doubtful about people that don't love animals, they are people I just can't trust. It's like they said at one point in this documentary \"If you don't love animals, you can't love a person either\". Turkey has obviously a lot of stray cats but here it shows that they're tolerated and loved. They bring joy to people's sometimes depressing lives. Every cat has a different character, like humans, and in this documentary it is well portraited. I saw already quite a bunch of Turkish movies, with a high rating, but I actually never saw a good one, ever. So this is the first Turkish production I did like. Can't get enough of those animal documentaries.",
         "2/22/18. If you love cats, then this one's for you! This documentary covers the lives of the street cats of Istanbul, Turkey. Amazingly, cats and humans can coexist, benefiting both in many ways. While these cats live in \"the wild\" of an urban area, they are not feral by any means, nor would you call them strays. Perhaps, community or free-roaming cats are probably the best definition of these cats. Unlike stray dogs, which you probably wouldn't want to make any contact with, these cats are open to human contact and know how to get free meals from anyone taken in by their charm. And, they do know how to charm. One benefit that was only touched upon lightly is rodent control. Perhaps New York City should think about adopting these street cats as a public health measure to control the burgeoning rat population! And, for being street cats, they were awfully clean-looking and approachable, and they know how to take care of their toilet needs discretely. So like cats! Worth catching."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Termite Films"],
      "summaries": [
         "In the city of Istanbul, there are more than just human inhabitants. There are also the stray domestic cats of the city who live free but have complicated relationships with the people themselves. This film follows a selection of individual cats as they live their own lives in Istanbul with their own distinctive personalities. However, with this vibrant population, is the reality of an ancient metropolis changing with the times that may have less of a place for them.",
         "Undeniably, the cat is picturesque Istanbul's soul. Even from the Ottoman era, countless kinds of cats began living in the city, and later on, when the first sewers were built and giant rats made their appearance, not a single house was without a mighty cat. Nowadays, cats are practically everywhere, and thousands of independent strays colour the ancient city not only with their diverse personalities and quirks but also with their elegant feminine posture and their distinct traits while strolling indolently Istanbul's dense and bustling neighbourhoods. Obviously, a love for cats is a special kind of love, as some believe that the resourceful and autonomous companions can absorb the negative energy, giving off only good vibes, while others think that cats are aware of God's existence instead of dogs. Who knows? Either way, cats are never ungrateful, we, humans, just need to form a special shared language, because from cats with a strong-willed character to those delicate and jealous ones, and from tough fish thieves to aristocratic and carefree vagabonds, one thing is for certain: the felines of Istanbul are without a doubt a cultural symbol.",
         "A profile of an ancient city and its unique people, seen through the eyes of the most mysterious and beloved animal humans have ever known, the Cat."
      ],
      "budget": 0
   },
   "movielensId": 167248,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2017-02-10",
      "dvdReleaseDate": null,
      "directors": ["Ceyda Torun"],
      "runtime": 79,
      "movieId": 167248,
      "title": "Kedi",
      "mpaa": "NR",
      "actors": [
         "Bengu",
         "Deniz",
         "Duman",
         "Gamsiz",
         "Aslan Parcasi",
         "Psikopat",
         "Sari",
         "Bülent Üstün"
      ],
      "imdbMovieId": "4420704",
      "originalTitle": "Kedi",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["lKq7UqplcL8"],
      "plotSummary": "A profile of an ancient city and its unique people, seen through the eyes of the most mysterious and beloved animal humans have ever known, the Cat.",
      "tmdbMovieId": 392011,
      "avgRating": 3.76724,
      "releaseYear": "2017",
      "numRatings": 58,
      "posterPath": "/5z2vuJk6P7V2azw3gWQF7L4l5xU.jpg"
   }
}