{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "sexual tension",
            "id": 11518
         },
         {
            "name": "gothic horror",
            "id": 15032
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         },
         {
            "name": "blind mother",
            "id": 187299
         }
      ],
      "imdb_id": "tt0067486",
      "video": false,
      "title": "The Road Builder",
      "recommendations": [
         106682,
         39861
      ],
      "backdrop_path": "/4m9hHkCIq3kPUDhhPs5kjU5nNpt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Maura Prince",
               "gender": 1,
               "credit_id": "52fe49ac9251416c910b4fcf",
               "name": "Patricia Neal",
               "profile_path": "/1VPdXeUnI6RcCzLtKv8uTHNB690.jpg",
               "id": 1934,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. Edith Prince - Mother",
               "gender": 1,
               "credit_id": "52fe49ac9251416c910b4fd3",
               "name": "Pamela Brown",
               "profile_path": "/73B6zidpHUZAaBCydde4CI14mZj.jpg",
               "id": 53818,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Mr. Bolton",
               "gender": 2,
               "credit_id": "52fe49ac9251416c910b4fdf",
               "name": "Graham Crowden",
               "profile_path": "/wyGg5BXqE1N8oG1Ag82I3yHYQdW.jpg",
               "id": 10654,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Millicent McMurtrey",
               "gender": 0,
               "credit_id": "52fe49ac9251416c910b4fdb",
               "name": "Jean Anderson",
               "profile_path": "/rLXmatUDcapi3W7ihmeQgWKbjBC.jpg",
               "id": 39028,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Reverend Rupert Palafox",
               "gender": 2,
               "credit_id": "55d208dc9251412e51009650",
               "name": "Peter Sallis",
               "profile_path": "/8vMFK2SJFzQbtEIj4FU7adyhCGM.jpg",
               "id": 7317,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mrs. Palafox",
               "gender": 1,
               "credit_id": "55d208c3925141319800aaf4",
               "name": "Yootha Joyce",
               "profile_path": "/294RQylD9gBdqfm7bqeus7ng07B.jpg",
               "id": 25641,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "District Nurse",
               "gender": 1,
               "credit_id": "55d208ee925141319300a802",
               "name": "Brigit Forsyth",
               "profile_path": "/tBeMVgUzt18WppQL58gKfCnGeg4.jpg",
               "id": 197235,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "5a4816eec3a3681913007730",
               "name": "Zoe Alexander",
               "profile_path": null,
               "id": 180409,
               "order": 7
            },
            {
               "cast_id": 4,
               "character": "Billy Jarvis",
               "gender": 0,
               "credit_id": "52fe49ac9251416c910b4fd7",
               "name": "Nicholas Clay",
               "profile_path": "/eDIODqU43pWCTBwfyLa9GUOfuHO.jpg",
               "id": 31196,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Ronnie Robinson",
               "gender": 0,
               "credit_id": "55d2090392514131a500a65d",
               "name": "Sebastian Breaks",
               "profile_path": null,
               "id": 935943,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mary Wingate",
               "gender": 0,
               "credit_id": "55d20916c3a3684453009456",
               "name": "Diana Patrick",
               "profile_path": null,
               "id": 1497759,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Jenny - Farmwife",
               "gender": 0,
               "credit_id": "55d2092bc3a3681bf0009a30",
               "name": "Jenny McCracken",
               "profile_path": null,
               "id": 1402966,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Whore",
               "gender": 0,
               "credit_id": "55d20947c3a3686e3500292d",
               "name": "Sibylla Kay",
               "profile_path": null,
               "id": 1371380,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49ac9251416c910b4fcb",
               "name": "Alastair Reid",
               "profile_path": null,
               "id": 56634,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49ac9251416c910b4fe5",
               "name": "Joy Cowley",
               "profile_path": null,
               "id": 1177894,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe49ad9251416c910b4feb",
               "name": "Roald Dahl",
               "profile_path": "/me3PtcT5mw88y3e3AYG3exuOO99.jpg",
               "id": 1299,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55d20971925141319600a722",
               "name": "Alan D. Courtney",
               "profile_path": null,
               "id": 1497760,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55d20980925141319300a80f",
               "name": "Norman S. Powell",
               "profile_path": null,
               "id": 170622,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55d20994c3a3686e35002932",
               "name": "Bernard Herrmann",
               "profile_path": "/nuGwEH9lJIBTEzsmB4bGDgJ9qgj.jpg",
               "id": 1045,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55d209b4c3a3684453009468",
               "name": "Anthony Pratt",
               "profile_path": null,
               "id": 18986,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "576c8839925141400b0005f0",
               "name": "Alex Thomson",
               "profile_path": null,
               "id": 21516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a4817449251410314006a76",
               "name": "Michael Dryhurst",
               "profile_path": null,
               "id": 10933,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5a4817ba0e0a26489500762b",
               "name": "William O. Harbach",
               "profile_path": null,
               "id": 1241645,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a4817edc3a36818ff007122",
               "name": "John Oldknow",
               "profile_path": null,
               "id": 1743854,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.210832,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 86979,
      "vote_count": 8,
      "budget": 0,
      "overview": "The dreary existence of middle-aged spinster Maura Prince takes an unexpected turn with the arrival of young handyman Billy Jarvis, but there is more to Billy than meets the eye.  Based on the novel *Nest in a Fallen Tree* by Joy Cowley.",
      "similar": [
         274,
         1359,
         2832,
         10285,
         181283,
         381034,
         10781,
         37247,
         769,
         4771,
         65754,
         238636,
         75780,
         562,
         169917,
         207932,
         433808,
         452507,
         392044,
         336843
      ],
      "original_title": "The Road Builder",
      "runtime": 97,
      "poster_path": "/w55IP8ThZs5TV5DudhA3XVnVavW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Metro-Goldwyn-Mayer British Studios",
            "id": 5579,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Youngstreet",
            "id": 61080,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1971-05-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A lonely woman in a decaying mansion... A young stranger on a big, black bike.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alastair Reid"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Joy Cowley",
         "Roald Dahl"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067486/",
      "coverLink": null,
      "actors": [
         "Patricia Neal",
         "Pamela Brown",
         "Nicholas Clay"
      ],
      "reviews": [
         "In Britain \"The Night Digger\" is shown from time to time on TCM, normally late at night, under the alternative title \"The Road Builder\". It is not, however, a particularly well-known film, even though the script is by one of Britain's best-known writers (Roald Dahl) and it stars an Oscar-winning actress (Dahl's wife Patricia Neal). Neal plays Maura Prince, a middle-aged spinster living in the English town of Windsor with her mother Edith. Several years earlier Maura suffered a serious stroke, which left her temporarily paralysed, although she has now recovered and works as a therapist helping other stroke victims. (Dahl inserted this as an obvious reference to the fact that Neal had herself suffered such a stroke in 1965). Maura is finding it difficult to cope with the demands of looking after her elderly mother and maintaining their large Victorian Gothic house, obviously once luxurious but now run down and dilapidated. Their lives are changed when they hire a young man named Billy as a handyman. Billy is a road-builder working on a new motorway which is being built in the area. (The motorway runs from Liverpool to London via Manchester, Birmingham, Oxford, Reading and Windsor. In reality no single motorway has ever been built along this route, although the southern part of the route corresponds roughly to the M40, which did not exist in 1971, not being completed until 1988). Billy claims that his surname is Jarvis and that he is originally from Cheshire (in north-west England), which causes Edith to claim him as a long-lost relative as she has family with that surname in that county. (Billy's accent, however, is a south-eastern one, which must cast some doubt on his claim; he may have discovered Edith's family background and invented a story to deceive her). At first he seems to be a godsend to Edith and Maura; he is polite, friendly, helpful and a competent worker whose efforts soon have the dilapidated house and overgrown garden looking smarter. Billy, however, may be hiding a dreadful secret. A young woman from the area is found murdered, and the police attribute the crime to a serial killer who has taken the lives of several other women in different parts of the country. Ominously, the other killings took place in Liverpool, Manchester, Birmingham, Oxford and Reading- the cities close to which Billy was previously working on the new motorway. There is, however, a further complication in that Maura- previously a dutiful daughter obedient to every whim of her domineering mother- finds herself becoming attracted to the handsome young man. The plot is not always satisfactory, and the ending, after Maura and Billy have run away to the Scottish Highlands together, is particularly enigmatic. (This is surprising given that Dahl was a gifted short story writer whose stories normally ended with a satisfying twist). Although it is clear to the audience that Billy is indeed a killer (and there is an attempt to explain psychologically why he became one), we are never sure how much Maura knows or suspects about his guilt. Is she convinced of his innocence, or is she closing her eyes to the obvious. Or does she know all along that he is guilty? Our view of Maura depends very much upon the answers to these questions, so it is surprising that they are never definitely answered. Perhaps Dahl felt it made for a more satisfactory film to keep us guessing. (The title \"The Night Digger\" refers to Billy's habit of disposing of his victims at night, by burying them under the motorway workings. The plot has many similarities to that of another British film from a few years earlier, \"Night Must Fall\", which also regularly appears on TCM, and which also features a mother and daughter living together and a psychopathic handyman. \"Night Must Fall\" (a remake of a 1937 American film with the same title, which I have never seen) is a rather dull film with one of Albert Finney's weakest performances at its centre. \"The Night Digger\", although it has its weaknesses, is an altogether better film. Rather surprisingly for a winner of the \"Best Actress\" award, Neal never really became a household name, certainly not when compared to other \"Best Actress\" winners from the sixties such as Elizabeth Taylor, Sophia Loren and Katharine Hepburn. Her performance here, however, shows just how good she can be as the sexually repressed spinster dominated and emotionally manipulated by her mother. Although we may suspect that she is knowingly covering up for a murderer, we always retain some sympathy for her. Pamela Brown is also good as the terrifying Edith, even though she was really too young for the role, being only nine years older than Neal. Besides the acting, \"The Night Digger\" is also notable for its brooding, mysterious feel. Even without the macabre nature of the story, the photography of the damp, autumnal English countryside and the decaying, Gothic mansion, aided by the score from Hitchcock's favourite composer Bernard Herrman, would be enough to conjure up a sense of nameless dread. Director Alastair Reid was no Hitchcock (he worked mainly in television, and only made a few feature films) but he brings a few atmospheric touches to this film. His use of unusual, oblique camera angles and his technique of concentrating on only a part of a speaker's face (normally the eyes or mouth) add to the general strange and unsettling atmosphere of this film. Despite the obscurity into which it has fallen, \"The Night Digger\" is a tense thriller and character-study which it is worth staying up late to see. 6/10",
         "Another one of those great forgotten movies of the 1970s. I caught this on late night TV about 20 years ago and have never forgotten it. It was about a young man named Billy (Nicholas Clay) helping out Maura Prince (Patricia Neal) and her elderly mother (Pamela Brown) in their crumbling old house in England. Neal starts to fall for him (despite their age difference)...but she's not aware of what he does when he goes out alone every night... Spooky little horror film. When I first saw it it was edited for TV so there were some unexplained pieces (like a bit about something that happened to him as a child which explains what he does as an adult) and, I assumed the violence was gone. I was finally able to see the entire uncut film and loved it! It wasn't a blood and guts horror movie--it's an excellent psychological horror. In fact the two violent acts in it aren't even shown! It concentrates on Billy and Maura and their feelings and thoughts. Clay and Neal are such great actors that just their expressions tell you what they're feeling. The growing romance between them was touching and believable. Also there's an excellent score and the ending was a stunner! This film has an R rating for some dialogue and a lengthy nude sequence with Clay. Well worth catching just for Clay and Neal. This movie is available on DVD through the made to order system with the Warner Brothers Archive Collection. It's complete and the transfer is pristine. Well worth getting. It might disturb you but you'll never forget it. Avoid the cut version on TCM.",
         "Many people will say that this film was a botch up job of Joy Cowley's novel, but they would be wrong. While I have to admit that the type of filming they used in the 70's is not among my favourite, it worked well for this film because it gave you insight into how each character saw things. Patricia Niel was perfect as the spinster who was stuck caring for her blind and horrid adoptive mother, and who slowly but surely becomes sexually aware of the young drifter, played by Nicholas Clay. Some parts of the film are vaguely confusing, but one comes to grasp them after rolling the idea around in ones mind for a while. This film was very well done for an era that produced some awful movies that completely butchered famous books, and used skin instead of actual acting to portray a film. The Night Digger aka Road Runner is a very watchable film, that sneaks up on you rather than attacks you head on like some psychological thrillers do.",
         "The Road Builder is sadly not very well known, and that's a shame because this psychological thriller is a real gem and would certainly benefit from being more widely seen. The film is based on a book by Joy Cowley, although there were apparently some changes made to the story (I don't know what since I've not read the book). One of the more surprising things about this film is the fact that the screenplay was written by popular children's author Roald Dahl, although clearly he did also have a taste for the macabre if Tales of the Unexpected as well as his children's book 'The Witches' are anything to go by. The film is a strange love story at heart and we focus on a house inhabited by an old spinster and her middle aged daughter Maura. Their lives are changed one day when a young stranger on a motorbike turns up and they agree to let him stay. The young man becomes a popular figure in the house rather quickly, especially with Maura. However, there's something strange about him as evidenced by his sudden bursts of depression, apparently owing to the tragic death of his parents. Most of the plot takes place in a grandiose mansion and it makes for a really good location for the movie - it's very isolated and is nice to look at. The atmosphere is very good throughout and this excellently compliments the plot which is thoroughly dark and largely unpleasant. The plot doesn't move particularly quickly, but it's always interesting thanks to the way that the characters are built up progressively and director Alastair Reid focuses on their relationship with one another. The acting is very good and the film stars Roald Dahl's then wife Patricia Neal in the lead role. She gets on well with the other two main players, Pamela Brown and Nicholas Clay and these actors help to ensure that the film works well. There's not a great deal of shocking moments, but the way that the unpleasant happenings are handled works very well as it's nasty yet completely believable. It all boils down to a very good ending and The Road Builder is certainly a film with a 'sting in the tail'. Overall, I really hope this gets a decent release soon because it's a great thriller and well worth seeing!",
         "Roald Dahl has always been a good story-teller, and this movie, for which he wrote the screenplay, is no exception. It's a macabre love story with a somewhat unexpected ending. Very good acting and story-telling. I recommend this film for all Roald Dahl fans. 7/10.",
         "A fairly engrossing thriller directed by Alastair Reid with a script by Roald Dahl. Patricia Neal lives in a decaying mansion with her blind mother (Pamela Brown). One day a young man shows up intent on working for the ladies as a handyman. He's that and a whole lot more, as Neal slowly realizes. The movie builds its suspense at a very deliberate pace, but it's very worthwhile. Neal is electrifying as a middle-aged wreck who realizes too late that she's given up the best years of her life to her domineering mother. The always interesting Brown is every inch Neal's equal in a rare starring role. They both have A LOT of baggage. Nicholas Clay is the title character and he comes across like a young version of Alan Bates, surly and not too well spoken. Dahl's script is deceptively witty, full of a bunch of off-beat touches. Bernard Hermann's score is suitably creepy. THE NIGHT DIGGER (aka THE ROAD BUILDER) is a real treat.",
         "Small spoilers.... I saw this movie under the title : the Road Builder. Only that title alone sounded interesting to me. I got especially interested when I learned that the screenplay was written by Roald Dahl. We all know that he wrote some remarkable stories, but most his most memorable work in the field of children's literature. The screenplay of The Road Builder isn't really meant for a young audience...It's a dark story and really creepy from time to time. It's very psychological and therefore difficult to follow at certain moments. I saw this gothic suspense thriller on TCM but without any subtitles. So the dialogues were hard to follow sometimes. Especially with a rather complicated story. It's about a spinster, Maura, who lives with her blind mother is a large house. Their lives change when a young handyman - named Billy - comes to live with them. Billy is charming and really helpful around the house, but he hides some terrifying secrets. It seemed that Billy faced some trauma's in his childhood years and he still hasn't put them behind him. Thus, some nights ... Billy goes out on his motorcycle to do horrible things. The developing of the story is really fascinating and also the terrific acting performances keep you close to the screen. Patricia Neal - who was married with Roald Dahl for forty years and gave him 5 children - is really outstanding in her role of shy and quiet middle-aged woman. Also the young Nicolas Clay impresses as Billy. Clay died in 2000 after a long disease. The Road Builder certainly is worth a watch when you're in the mood for seeing a scary psychological thriller or a deep character study. Just make sure there aren't too many aspects to distract you. You'll need full attention to enjoy this movie.",
         "I have seen this film last week on TV. I am glad that the there are English subtitles so that I can clearly enjoy the dialogue. Only it is pity that the English subtitles from TCM are kind of closed captions that cannot be taken for recording. Different than the comment of another Dutch viewer from 2006, I find this film a rather nice good movie. The maker has put quite some different (thrilling, creeping, emotional, romantic) components to the movie, but not into deep touch by purpose. If one is specially looking for or fond of a particular type of movie from one of these components, one may not feel satisfied enough. However I am glad that the maker had made it in this way that the movie content becomes \"rich\" in a special way. It makes the film as a whole quiet thrilling, creeping, emotional and even bit romantic too. It is not boring at all, I enjoy every moment of the movie. Making a film to a particular type/direction of course is a heavy job but to combine different type of components in a fine way is not easy too. The film is quite moving that I have only realized at the end that it is already a film of 110 minutes. It is not boring at all, I have enjoyed every moment of the movie. Yes, this is not a film made for award nomination, but both the director and the leading actors have done a pretty good job. If you watch the film carefully you will realize that the film is quite fine made. From their fine work, you can see and feel the style of the early 70's British films. It is a small budget production, but still leaves some compelling moonshine. I simply like this movie. The ending indeed is quite a critical way. I have never read the novel. I don't know whether the end is the same as the movie. I wonder if the director has extended and refined the ending for about 10 minutes more, will the ending be then a bit better than a shortcut? On the other hand, I have the feeling that it seems that the director has deliberately made the ending in this stunning way that it now leaves us crossing feelings and questions that makes the movie still time to time staying on our mind. It may not be a top A-film, but it is a little gem which absolutely is worthing to see. I give it 7.75 out of 10.",
         "As others have said, this movie was written by British poet/author Roald Dahl as a vehicle for his wife, American actress Patricia Neal. (I thought of it recently after seeing a similar American movie \"Happy Mother's Day, Love George\" that featured Neal and the couple's real-life daughter Tess Dahl). The basic story is pretty good. Neal plays a lonely spinster whose domineering mother rents a room to a traveling road worker (Nicholas Clay), and Neal's character finds herself drawn to the handsome, younger man, unaware that he might be a serial killer who has buried a string of female victims along the road he is building. . . This definitely works as a vehicle for Neal, who is probably most famous for the Paul Newman movie \"Hud\" (even though her character in that was supposed to have been African-American, but such a thing would have simply been too incendiary in the early 1960's). She is very good in this. Unfortunately, she doesn't get a lot of help. Nicholas Clay would later play Lancelot in \"Excalibur\" and appear with an all-star cast in Agatha Christie's \"Evil Under the Sun\", but he was just too inexperienced here. For whatever reason, there was a plethora of handsome but psychotic young men in British movies at this time, and this role might have been better played by another \"handsome young psycho\" actor like Shane Bryant or Hywell Bennett (although neither of them might have been very convincing as a roughneck construction worker). If it have been made a decade or so earlier though, it would have been a PERFECT role for a young Oliver Reed. The directing is also a little flat generally, but the first murder (following a motorcycle ride) is pretty inspired. The Bernard Hermann score is not one of his best, but it does add SOMETHING to the proceedings. This isn't great, but it certainly deserves to be more widely seen.",
         "Troubled young man (Nicholas Clay) named Billy is able to charm his way into the pitiable household of a blind, overbearing elderly woman named Edith Prince (Pamela Brown) and her browbeaten, tired adopted daughter, Maura (Patricia Neal). What the women are unaware of is that he's a serial killer, mostly of pretty young women around his age, with brown, short hair styles and petite builds. Gradually, as he repairs the outer structure of the decaying mansion (think Grey Gardens, as the two women are middle aged and elderly), the two become dependent on him, even as Billy starts to become consumed by the monster inside him, cultivated and unyielding due to a past trauma when he was a young teenage boy molested by hideous, hag countryside farm women. As Billy starts to become more and more withdrawn from Edith, he does bond closely with Maura who once left her mother for a man when she was twenty. When Maura was debilitated by an aneurysm, Edith helped her back to health. Then when Edith suffered an illness which blinded her, Maura returned the favor and has been under her thumb every since (for twenty years or so). As a nosy, busybody friend of Edith's named Millicent (Jean Anderson) stirs the pot, understanding that Maura is attracted to Billy, she tries to nudge Edith into realizing that her gardener/handyman is bad news. Billy might just be the wedge to force apart the two women, and this could finally be the motivation Maura needs to free herself from Edith's overwhelming control. Dark film was written by Roald Dahl (yes, *that* Roald Dahl; of the children's books), and the score by Bernard Hermmann recalls the best of Hitchcock. While the murders are carefully avoided, Billy's succumbing to the dark passenger that wants him to kill is well executed. You can see he is unable to resist his murderous impulses. The romantic angle between a middle aged woman, rotting inside due to her mother's burdensome expectations to be coddled and spoiled, with the yearning for a male companion she can love, and the young man who emerges as the possible savior needed to urge her to move on was perhaps a bit too far fetched for me to personally swallow. Particularly the ending where the two run off to the Scottish Highlands to live in a cottage only for their brief happiness to be shattered due to his inability to keep what lies within at bay; I was quite surprised the film went this route. The film has Billy needing Maura as he seems desperate to stop killing, admitting that his problem overtakes him and he can't remember committing the acts he never technically admits to killing, so Maura can only comfort him when he requests her not to leave his side while he tries to rest. The cast is top notch with notable work even from Graham Crowden as a rather oddball church choir instructor, a little bit too knowledgeable of the killing spree overtaking England and quite a gossip-spreader (as is Millicent, always up to no good, with Edith all too fascinated by what she hears). There's a bit of adult comedy involving the priest and his wife regarding \"an external operation\" that is shared by Edith, Millicent, and Crowden's Mr. Bolton that should amuse. MGM didn't get behind this film, and it fell into obscurity, but I think \"The Night Digger\" is a bonafide cult film ready for an audience to see it. Patricia Neal returned from a stroke not long before this, and her work is exemplary. It is all there on her face, and seeing her character slowly gain courage to approach leaving her mother and admitting her feelings for Billy is just a part of what makes this film a must for Neal fans. Going from a wallflower old maid resigned to her servitude to a woman reaching forward for her independence is satisfying...even if it involved a psychotic with a complex towards most women. His steadily growing defiance as Edith starts to take some of what she uses against Maura in an effort to force him into becoming another victim of her every whim is what ultimately destroys the superficial bind that tied them temporarily. The mansion setting is rich in set design and old history detail...it is as if Mama Bates had a hand in its decor and was responsible for the architectural look of the place. The space and expansive furnishings can be quite an eyeful. Not only the inside, but the outer, far-reaching exterior of the mansion is quite towering and decadent, with the garden and back yard just as elaborate. As extravagant as the demands and personality of the woman who owns it, the house could only fit Edith Prince.",
         "I'm surprised that this particular film isn't as well known, as \"The Night Digger\" is an effectively expressive British psychological thriller (penned by Roald Dahl) with a touch of Gothic drama, psycho-sexual unease and sinister moods. The performances of the cast do go a long way to carrying the intrigue and ambiance, where Patricia Neal, Pamela Brown and a very brooding Nicholas Clay do an outstanding job. Neal's repressed turn really is one of great strength and emotion, while Brown authentically commands the screen as the demanding, disabled mother. Clay has a charm about him, but lurking underneath is something unsettling. The relationship that slowly builds between Neal and Clay's characters is affecting, that when she becomes suspicious of him, due to the disappearances of young woman in the area. She just doesn't want to believe he has anything to do with it, despite knowing he surely does. She yearned for something meaningful, and that was him as he brings out the confidence in her and of course she loves the man. So they run away together. The moments when she finally confronts him over it, while terse it remains powerful. Even the sequences with Neal and Brown (adopted daughter and mother) crafted out gripping exchanges. The scenes involving the murders or even the lead up to them (where he torments the victim) are truly creepy, and Bernard Herrmann's subtle, but tense score paints it nicely. This is set-up in an remote country mansion within a small rural town, so town gossip features prominently and is somewhat a driving force for some key plot progressions. So is the loneliness of Neal's frustrated character, which Clay's character takes advantage of and so does Brown's. The pacing is causal, but it helps the atmosphere build and lets the character's form shape.",
         "Creepy, hugely atmospheric and surprisingly little-known British pot boiler concerning the wicked travails of a rather personable, youthful handy man; a soft spoken soul who once finished with his diligent roof repairs reveals himself to be a demented sex killer (Brilliantly played by a handsome and enigmatic Nicholas Clay). The director makes especially effective use of dark splashes of humor, and Hollywood icon Patricia Neal is an absolute delight. Pamela Brown's muscular performance is little short of stupendous; playing Patricia Neal's blind, abusive, over- zealous, wholly oppressive matriarch to the hilt! (I enjoyed this ballsy melodrama almost as much as 'The Fiend' with which it shares a similarly grim narrative, albeit with far less black humor) It would be entirely remiss of me in not mentioning the fine music of maestro Bernard Herrman. (As a prurient aside I never quite realized that Bridgit Forsyth had such a killer rack, if you will excuse the appalling pun)",
         "The film apparently went under two titles: \"The Night Digger\" and \"The Road Builder.\" I caught this film on Turner Classic Movies recently. I have always been a big Patricia Neal fan. The film was released in 1971, a tough time for actors like Neal from the \"golden age of Hollywood.\" The times were changing fast, and film was going right with them. Middle-aged actors like Neal often had trouble finding film work, as producers and studios were catering to much younger audiences. Anyway, the story revolves around Maura (Patricia Neal) a spinster whose life revolves taking care of her domineering blind mother Edith (Pamela Brown)in a decaying England mansion. Enter a handsome handyman named Billy (Nicholas Clay) to turn their world upside down. Billy is quite a disturbed young man with a small problem: murdering women! We are given only small clues as to what turned him into such a maniac, seen in somewhat confusing flashbacks. Maura falls for Billy, despite the obvious age difference. We learn she probably eventually catches on to what he is doing, although she never really says so. The performances are good in this film. I loved Neal especially, she portrays the dowdy Maura with her usual intelligence and natural abilities. Pamela Brown as the overbearing mother is also effective. As to the young actor Nicholas Clay, he is wonderfully creepy as the the seriously disturbed murderer. The big problems with the film are the script and the obvious lack of a budget to make this film more credible. The script was written by Roald Dahl, Patricia Neal's husband of that time. Apparently the back story is Neal did not really want to do the film, but Dahl wrote it for her. The story has some confusing gaps, and the last 15 minutes or so of the film is just downright ridiculous and tough to believe. This is a case of good actors stuck in a mediocre film that could have been a more worthy one.",
         "Patricia Neal+Bernard Herrmann + Neal's husband Dahl.Plus Pamela Brown and Nicholas Clay.It does make a decent film,it does not make the classic thriller we could have expected . Neala nd her mother (\"you could have got married when you were YOUNG\" said Clay to an infuriated Neal).A spinster who lives with her over possessive mother ,Neal's character recalls Nell's past in Shirley Jackson's \"the haunting\" (masterfully transferred to the screen by Robert Wise,then butchered some years ago).A good thing in the last minutes :the director does not show ,he lets us imagine what terrible thing happened .Today such a quality has become rare. But if you have read Dahl's wonderful short stories ,you may be disappointed by his script,including pointless characters such as the minister and his wife who want to become a woman and a man respectively. Besides the two women's story and Nicholas Clay's do not hang very well.",
         "The movie has some messy storytelling and most of the elements in the movie don't really work out. This movie certainly isn't a terribly interesting to watch. It's a bit of a psychological thriller but it isn't scary, tense or compelling enough to call it a good one. It has a good concept but the end result is pretty disappointing. Main reason why the movie is a bit of a failed one is because of the weak storytelling. Most of the elements in the movie feel very muddled, especially the ending and at times it takes ages before something really interesting to happen in the movie. It isn't exactly a dull movie though, it's more like an uninteresting one, even though the story itself really isn't a bad one. The characters are portrayed nicely in the story but to be frank, they were to boring and distant to feel for. Patricia Neal, who also had a stroke in real life, prior to this movie, is a good leading lady and also good was Nicholas Clay in his very first movie appearance. He does provide the movie with some good moments but it all simply is not enough to make the movie interesting and recommendable enough. From a movie with Patricia Neal, Roald Dahl and Bernard Herrmann involved, some more fireworks was to be expected. 4/10 http://bobafett1138.blogspot.com/",
         "There might be spoilers here. Gonna try to keep from it but I have to describe the plot as I heard it verses what it really was when I saw the film. THE NIGHT DIGGER, also known as THE ROAD BUILDER, was a movie I read about that sounded interesting. It seems a spinster and her mother are in an old decaying mansion in England when a young man comes along to stay with them and work as a handy man while also working as a builder on a road being constructed. It seems this young guy is a psycho who also rapes and kills women and buries them in the road. Meanwhile the spinster is taking a shine to him. Sounded like the recipe for a pretty good thriller to me. Well, in spite of Bernard Herrmann's score and Alex Thompson's excellent, moody cinematography, this film doesn't play out anything like I thought it would have. The plot takes detours that really made me wonder if the director knew he was supposed to be making a horror film. There comes one part that has several people sitting around gossiping and although I imagined a suspenseful thriller where you wondered if the old woman and her mother are in danger, someone, maybe the director, or maybe Roald Dahl pretty much succeed in killing any degree of suspense. It's almost like they decided to shoot a scary movie and then later tried to turn it into something else altogether. It has gloomy cinematography and a fine score and even a kind of threatening title but that's where the horror/suspense elements end. The movie fizzles badly and the climax is just plain stupid. Maybe I was supposed to be moved or sympathetic or something but I just thought the movie was creepy for all the wrong reasons. BEWARE! BIG SPOILER!!!! Still with me? Okay, there is a sex scene with the young man and old Patricia Neal. Luckily, you don't see much but just the thought of the young dude having sex with that old woman was about the creepiest thing I can think of in this entire movie. If she had been the young Patricia Neal from 20 years before this film was made, then fine, a sex scene might not have been so terrible but this was disgusting. When I read the title NIGHT DIGGER, I expected a movie where Patricia Neal discovers her handyman's is the murderer and her having to fight him off and struggle to survive. I imagined a pretty interesting plot when I read the title. Be assured that there is nothing in this film that is suspenseful, scary or thrilling unless you like watching old people have sex with young people, which is shot in front of a blurry lens, presumably to keep the audience from throwing up. Given the same exact actors, crew, locations and budget, I could have made a film that would have had audiences on the edge of their seats until the end credits. Someone took a good premise, a good crew, great locations, sets and actors and made a boring film about a guy who kills good-looking women and sleeps with old women who used to be good-looking. I wasn't impressed at all and cannot recommend this film - at least not as a thriller/horror film, which it was intended to be. No blood, no gore, no action. Just old ladies, psycho road-builders and boredom.",
         "Patricia Neal always brings two attributes to her film performances: honesty and integrity--both of which work wonders for this derivative, somewhat moldy tale of a spinster, living under the thumb of her half-blind adoptive mother, who blossoms in love and independence with a 20-year-old handyman in rural England. The film, sort of a character study-cum-suspense melodrama, isn't an attractive showcase for Neal, yet she gives the scenario a hearty touch and her unmistakable stamp of dry wit. Neal's then-husband Roald Dahl adapted his screenplay from Joy Cowley's novel \"Nest in a Falling Tree\", pushing some of the kinkier aspects of the plot a bit far for a blue-haired thriller. Nevertheless, a visually perceptive and intriguing little movie that almost stays the course until the final act, which comes completely apart. Released under two different titles (also \"The Road Builder\"), though barely seen by anybody until the advent of cable movie channels. ** from ****"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer British Studios",
         "Tacitus Productions",
         "Youngstreet"
      ],
      "summaries": ["The dreary existence of middle-aged spinster Maura Prince takes an unexpected turn with the arrival of young handyman Billy Jarvis, but there is more to Billy than meets the eye."],
      "budget": 0
   },
   "movielensId": 167320,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-05-12",
      "dvdReleaseDate": null,
      "directors": ["Alastair Reid"],
      "runtime": 97,
      "movieId": 167320,
      "title": "The Road Builder",
      "mpaa": "R",
      "actors": [
         "Patricia Neal",
         "Pamela Brown",
         "Graham Crowden",
         "Jean Anderson",
         "Peter Sallis",
         "Yootha Joyce",
         "Brigit Forsyth",
         "Zoe Alexander",
         "Nicholas Clay",
         "Sebastian Breaks",
         "Diana Patrick",
         "Jenny McCracken",
         "Sibylla Kay"
      ],
      "imdbMovieId": "0067486",
      "originalTitle": "The Road Builder",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Fdxb3j0tvV0"],
      "plotSummary": "The dreary existence of middle-aged spinster Maura Prince takes an unexpected turn with the arrival of young handyman Billy Jarvis, but there is more to Billy than meets the eye.  Based on the novel *Nest in a Fallen Tree* by Joy Cowley.",
      "tmdbMovieId": 86979,
      "avgRating": 3.5,
      "releaseYear": "1971",
      "numRatings": 1,
      "posterPath": "/w55IP8ThZs5TV5DudhA3XVnVavW.jpg"
   }
}