{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0330859",
      "video": false,
      "title": "Scary Godmother: Halloween Spooktakular",
      "recommendations": [
         76789,
         71887,
         83965
      ],
      "backdrop_path": "/tHCyG0ExPkNgWLiNACdLhQjkiCO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Harry the Werewolf / Bug-a-Boo (voice)",
               "gender": 2,
               "credit_id": "563c3a3592514150af00394c",
               "name": "Garry Chalk",
               "profile_path": "/1estlif6pDM9uV7sgOsTU3WQeYw.jpg",
               "id": 26089,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Daryl (voice)",
               "gender": 0,
               "credit_id": "563c3a41c3a3681b5c027d99",
               "name": "Noel Callahan",
               "profile_path": null,
               "id": 1228380,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jimmy (voice)",
               "gender": 0,
               "credit_id": "563c3a50c3a3681b5c027d9d",
               "name": "Alex Doduk",
               "profile_path": null,
               "id": 160112,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Katie (voice)",
               "gender": 1,
               "credit_id": "563c3a5ec3a3681b52025f16",
               "name": "Brittney Irvin",
               "profile_path": "/mgM6EMxHLlliratzLQC6dJOKTnd.jpg",
               "id": 62866,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Hannah Marie (voice)",
               "gender": 1,
               "credit_id": "563c3a6c92514129fe017e86",
               "name": "Britt McKillip",
               "profile_path": "/yjLjEJY4JbIaARfZj2hX48SCrje.jpg",
               "id": 74365,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bert (voice)",
               "gender": 2,
               "credit_id": "563c3aa19251414c70005d66",
               "name": "Danny McKinnon",
               "profile_path": null,
               "id": 190162,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Skully Pettibone / Count Max (voice)",
               "gender": 2,
               "credit_id": "563c3b019251417819003175",
               "name": "Scott McNeil",
               "profile_path": "/iMtbS7ZuEhnkOYVlbyyVRbU1Ws4.jpg",
               "id": 74363,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Orson (voice)",
               "gender": 0,
               "credit_id": "563c3b0f92514129fe017e99",
               "name": "Adam Pospíšil",
               "profile_path": null,
               "id": 1440152,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Scary Godmother / Ruby (voice)",
               "gender": 1,
               "credit_id": "563c3b56c3a3681b54027bbb",
               "name": "Tabitha St. Germain",
               "profile_path": "/qu5bdk5POJHAne8XR6G0F4RrG5l.jpg",
               "id": 74360,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe476bc3a36847f8134adf",
               "name": "Ezekiel Norton",
               "profile_path": null,
               "id": 176153,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "563c39dfc3a3681b61027364",
               "name": "Jill Thompson",
               "profile_path": null,
               "id": 1532100,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 0,
               "credit_id": "563c39eac3a3681b5c027d93",
               "name": "Heath Corson",
               "profile_path": null,
               "id": 1267557,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563c39f8c3a3681b52025f0b",
               "name": "Jill Thompson",
               "profile_path": null,
               "id": 1532100,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563c3a059251414c70005d56",
               "name": "Jill Thompson",
               "profile_path": null,
               "id": 1532100,
               "department": "Writing",
               "job": "Book"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.769014,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48567,
      "vote_count": 7,
      "budget": 0,
      "overview": "The Scary Godmother Halloween Spooktakular is based on the comics and children's books of popular artist and writer Jill Thompson. Jill has won numerous awards for her fabulous watercolour paintings and illustrations. Scary Godmother is the whimsical all-ages story that follows the first trick-or-treating adventure of Hannah Marie, a young girl whose rotten older cousin is babysitting her one dark Halloween. Unhappy to be saddled with Hannah, her cousin cooks up a scheme to frighten her. But his scheme backfires when Hannah gets help from her Scary Godmother. Scary Godmother takes Hannah to her realm on the Fright Side where she is throwing the best Halloween party in all of frightdom. At the party Hannah is introduced to many colourful characters, learns that not all monsters are mean and enlists her new spooky friends in a plan to teach Jimmy a lesson.",
      "similar": [],
      "original_title": "Scary Godmother: Halloween Spooktakular",
      "runtime": 47,
      "poster_path": "/w25g0AChAWCBZ3CVNgDIhh9vvkA.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "YTV",
            "id": 65621,
            "origin_country": ""
         },
         {
            "logo_path": "/oappZpW9UoU3NXnjmooHlXmaPHE.png",
            "name": "Universal Studios",
            "id": 13,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mainframe Entertainment",
            "id": 5024,
            "origin_country": ""
         }
      ],
      "release_date": "2003-10-22",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Celebrate our Spooky Night!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ezekiel Norton"],
      "runtime": 47,
      "synopsis": "Hannah-Marie's Halloween is off to a spooky start, with costumes and candy and scary stories from her cousin Jimmy. But when Jimmy and his friends frighten her to tears, can her Scary Godmother set things right?",
      "writers": [
         "Jill Thompson",
         "Heath Corson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0330859/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTk2MjAxNjkyMF5BMl5BanBnXkFtZTcwODE1ODYyMQ@@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Garry Chalk",
         "Noel Callahan",
         "Alex Doduk"
      ],
      "reviews": [
         "I went in worried. I love Jill Thompson's work and Scary Godmother has always touched that slightly dark, yet very childlike side of my sense of humor. I was impressed, Ezekial Norton and his crew have really grasped the universe that Jill had created. The story is right but more than that I saw in the characters and animation what I had seen in the Comic book. Make sure to check this one out, I think it's fun for all ages. My niece is a huge fan as well and spent the whole show laughing and calling out the names of the characters. I am truly hoping that we will see more work of Jill's work (and the Scary G crew) and hopefully the Director and his team will be there to wow me again.",
         "Normally I would stick with good old-fashion 2D animation. But I would make an exception with this CGI Halloween special. And Halloween is also my favorite holiday, as I said about many times. I love the two stars from the show is Scary Godmother herself she is wildly funny, and Hannah Marie she is adorable. I love it when Katie & Daryl re-enacted when Hannah left to go trick-or-treating. It is also funny when the kids get scared out of their wits, when Hannah and her new friends teach her nasty cousin Jimmy and Katie, Daryl and Bert a lesson they'll never forget on Halloween night. Kind of like that Donald Duck cartoon \"Trick or Treat\" huh? only without a magic potion.",
         "If there's anything in the world that can make me excited for Halloween, it's my traditional viewing of the Scary Godmother movies. Many people's main complaint about this title is the quality of the animation. I never thought that it was really bad, and I still don't think so even now. I grew up watching this on cartoon network every October. I have started showing it to my nephews every year, and when I have children, I will show it to them. This movie holds a place in my heart akin to the way Rudolph, Frosty the snowman, and Nightmare before Christmas do. It's just one of those movies.",
         "Warning: The following contains spoilers; if you haven't seen this movie you might want to before reading this review. As a kid, I used to see this movie on Cartoon Network and thought it was a unique and funny Halloween special. Looking back at it now, I now see that it's not that good of a movie; the main problem here is the animation. While it's better than Spookley the Square Punmpkin, it's still really weak as if Jimmy ScreamerClauz (the creator of Where the Dead go to Die) made this after graduating from CalArts yet still share similar quality. The characters have a laughably bad design and while the animation is more fluent than Where the Dead go to Die, it still looks as unfinished as that film. With that out of the way, let's look at the story; on Halloween night, 5 kids (Jimmy, Bert, Daryl, Katie and Hannah) in the graveyard planning out their trick or treating when Jimmy decides to scare Hannah before they actually go trick or treating. The kids put Hannah in a haunted house and lock the door behind here, leaving her to cry her eyes out. Just then, Scary Godmother appears to cheer her up and take her to another dimension where she's hosting a \"Spooktacular\" party with her friends. These include Mr. Skully Pettibone, Bug-A- Boo, Harry the Werewolf, Count Maxwell the vampire and his wife and kid, Ruby and Orson. Once all the guests arrive, Hannah becomes less and less afraid of monsters after getting to know them and eventually they become her friends. Meanwhile, Jimmy, Bert, Daryl, and Katie are doing nothing of value to the plot except waiting for Hannah to come out of the house. When they finally decide to go in to get Hannah, she and her monster friends scare the day lights out of them in the funniest scene in the entire movie. It then ends with Scary Godmother giving Hannah a key that, once inserted into any door, will take her back to her house. The story, while better than the animation, still has it's flaws; for example, apart from Hannah, Katie is the only other girl in the group, so why is she more concerned about kissing Daryl than Hannah's safety? Also, Hannah gave them all chocolate bars in the beginning, so why do they agree to scare her? Comedy-wise, apart from that one scene, the jokes fall flat left and right. Now let's talk characters; Hannah is the only character that goes through a character arc and learns something at the end of the day; Jimmy is a jerk to his cousin, Daryl has a crush on Katie (and vice versa) and Bert is only here for that one joke about his Halloween costume which wasn't funny the first time and never became funny by the end of the movie. In contrast, Scary Godmother is bursting with personality as well as Mr. Skully Pettibone. The vampire family is decent at best, Harry is an annoying chatter box and the rest of the cast knows this (thankfully he gets punished for his ignorance) and Bug-A-Boo has a unique personality but unfortunately he has the ugliest character design in the movie, which is fitting because, well, he's a monster. Now this movie was based on a book by Jill Thompson, and I can only imagine that the book was better because this is a pretty lackluster Halloween special. With rather bad animation, a flawed story and only half of the characters, I can't really recommend this to kids. However, I guess I could recommend this as a film that's fun to make fun of. While there are other Halloween specials much better than this, at least some enjoyment can come from this movie as opposed to Spookley the Square Pumkin",
         "Best movie I've ever seen!!! Definitely watch it! But why does the main character's voice go from deep to high from the first movie to the second? Huh? Anyway, I made popcorn before this movie and I was laughing out loud so much that I almost choked on it! So funny! I do not want to give anything away, so I will not say my favorite part, but it was the best movie ever! I rate it 10/10 stars and it is worth watching for all ages. Writing, character development, animation, acting, all great! The only thing I didn't like was that the monsters were very spooky! Whoa! But all in all, I guarantee that you will love this movie!!! I can't believe how great it is!",
         "I find myself curiously looking forward to seeing Scary Godmother Movie. Not a glowing review, at first glance, but beneath it is high approval. I'm very critical of the air-brushed look of some video games and CGI animation; so for me to look forward to \"Scary G\" means something of content got through. That... is what every program creator secretly wants to hear. Is \"je ne sais quoi\" over doing it? Well that's my take on it. But something else nags me. \"Hanna\" the lead in \"Scary G\" reminds me so much of \"Cathy\" from \"Monster Buster Club\" that I find myself scrounging for a connection. MBC is a Marathon France/Canada product with ties to Jetix and Disney Chanel. Now \"Scary G\" is from Canada but I got no more than that yet (as far as IMDb says). Sometimes animators do carry-over styles from one production house to the next (see Annime) but I'm holding out for a more direct connection. Anyone care to chime in?"
      ],
      "genres": [
         "Animation",
         "Comedy"
      ],
      "productionCompanies": [
         "Mainframe Entertainment",
         "YTV"
      ],
      "summaries": ["The Scary Godmother Halloween Spooktakular is based on the comics and children's books of popular artist and writer Jill Thompson. Jill has won numerous awards for her fabulous watercolour paintings and illustrations. Scary Godmother is the whimsical all-ages story that follows the first trick-or-treating adventure of Hannah Marie, a young girl whose rotten older cousin is babysitting her one dark Halloween. Unhappy to be saddled with Hannah, her cousin cooks up a scheme to frighten her. But his scheme backfires when Hannah gets help from her Scary Godmother. Scary Godmother takes Hannah to her realm on the Fright Side where she is throwing the best Halloween party in all of frightdom. At the party Hannah is introduced to many colourful characters, learns that not all monsters are mean and enlists her new spooky friends in a plan to teach Jimmy a lesson."],
      "budget": 0
   },
   "movielensId": 167584,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2003-10-22",
      "dvdReleaseDate": null,
      "directors": ["Ezekiel Norton"],
      "runtime": 47,
      "movieId": 167584,
      "title": "Scary Godmother: Halloween Spooktakular",
      "mpaa": "PG",
      "actors": [
         "Garry Chalk",
         "Noel Callahan",
         "Alex Doduk",
         "Brittney Irvin",
         "Britt McKillip",
         "Danny McKinnon",
         "Scott McNeil",
         "Adam Pospíšil",
         "Tabitha St. Germain"
      ],
      "imdbMovieId": "0330859",
      "originalTitle": "Scary Godmother: Halloween Spooktakular",
      "genres": [
         "Animation",
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Scary Godmother Halloween Spooktakular is based on the comics and children's books of popular artist and writer Jill Thompson. Jill has won numerous awards for her fabulous watercolour paintings and illustrations. Scary Godmother is the whimsical all-ages story that follows the first trick-or-treating adventure of Hannah Marie, a young girl whose rotten older cousin is babysitting her one dark Halloween. Unhappy to be saddled with Hannah, her cousin cooks up a scheme to frighten her. But his scheme backfires when Hannah gets help from her Scary Godmother. Scary Godmother takes Hannah to her realm on the Fright Side where she is throwing the best Halloween party in all of frightdom. At the party Hannah is introduced to many colourful characters, learns that not all monsters are mean and enlists her new spooky friends in a plan to teach Jimmy a lesson.",
      "tmdbMovieId": 48567,
      "avgRating": 2.66667,
      "releaseYear": "2003",
      "numRatings": 3,
      "posterPath": "/w25g0AChAWCBZ3CVNgDIhh9vvkA.jpg"
   }
}