{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "himalaya",
            "id": 486
         },
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "new zealand",
            "id": 2658
         },
         {
            "name": "mountaineer",
            "id": 4560
         },
         {
            "name": "climbing",
            "id": 8624
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "mount everest",
            "id": 192779
         }
      ],
      "imdb_id": "tt2468638",
      "video": false,
      "title": "Beyond The Edge",
      "recommendations": [
         261814,
         59248,
         277796,
         379500,
         58820,
         36527,
         133441,
         200063,
         78076,
         21512,
         142161,
         415253,
         137499
      ],
      "backdrop_path": "/dxKw8NafloaDS8gapDWoP7BlVhm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Edmund Hillary",
               "gender": 0,
               "credit_id": "52fe4d8dc3a368484e1ef70d",
               "name": "Chad Moffitt",
               "profile_path": "/yr2s0FFeggislnnOgeY9aqRfrie.jpg",
               "id": 1206253,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Charles Evans",
               "gender": 0,
               "credit_id": "52fe4d8dc3a368484e1ef711",
               "name": "Erroll Shand",
               "profile_path": null,
               "id": 150396,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Tenzing Norgay",
               "gender": 0,
               "credit_id": "5331e9d1c3a3686a7f00230e",
               "name": "Sonam Sherpa",
               "profile_path": null,
               "id": 1304681,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "John Hunt",
               "gender": 2,
               "credit_id": "5331ea09c3a3686aaf0022d7",
               "name": "John Wraight",
               "profile_path": "/5qHpB4LMwT6HfXheKNIoqUHtObL.jpg",
               "id": 1097645,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "George Lowe",
               "gender": 0,
               "credit_id": "5331ea45c3a3686a7f00231a",
               "name": "Joshua Rutter",
               "profile_path": null,
               "id": 1304682,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Tom Bourdillon",
               "gender": 2,
               "credit_id": "5331ea71c3a3686a9d0022f0",
               "name": "Daniel Musgrove",
               "profile_path": "/bFiZSsNiNaJYx8v9c91OOUk4ZtJ.jpg",
               "id": 235024,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Ang Nyima",
               "gender": 0,
               "credit_id": "5331ea9ec3a3686a86002214",
               "name": "Phurenje Tshering",
               "profile_path": null,
               "id": 1304685,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Pemba",
               "gender": 0,
               "credit_id": "5331eac5c3a3686a8e0022a5",
               "name": "Jimmy Kunsang",
               "profile_path": null,
               "id": 1304687,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4d8dc3a368484e1ef6f7",
               "name": "Leanne Pooley",
               "profile_path": null,
               "id": 230426,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4d8dc3a368484e1ef6fd",
               "name": "Leanne Pooley",
               "profile_path": null,
               "id": 230426,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d8dc3a368484e1ef703",
               "name": "Matthew Metcalfe",
               "profile_path": null,
               "id": 964698,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 1,
               "credit_id": "52fe4d8dc3a368484e1ef709",
               "name": "Leanne Pooley",
               "profile_path": null,
               "id": 230426,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "5331e95fc3a3686a9d0022d6",
               "name": "Barbara Darragh",
               "profile_path": null,
               "id": 54491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56d0c8adc3a3681e36006b56",
               "name": "Grant Major",
               "profile_path": null,
               "id": 1314,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.814698,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 211088,
      "vote_count": 11,
      "budget": 0,
      "overview": "A 3D feature film about Sir Edmund Hillary's monumental and historical ascent of Mt. Everest in 1953 - an event that stunned the world and defined a nation.",
      "similar": [
         253412,
         4140,
         978,
         44115,
         9350,
         713,
         16436,
         21736,
         164251,
         1088,
         232572,
         59248,
         11678,
         318279,
         11194,
         81390,
         58820,
         46636,
         102000,
         75901
      ],
      "original_title": "Beyond The Edge",
      "runtime": 93,
      "poster_path": "/jmEH5tfAiF3FneL1Y7dMYsTK5aZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "General Film Corporation",
         "id": 13742,
         "origin_country": ""
      }],
      "release_date": "2013-10-24",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://beyondtheedgefilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leanne Pooley"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Matthew Metcalfe",
         "Leanne Pooley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2468638/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTk1MDk1MTYxMF5BMl5BanBnXkFtZTgwNzkxMDMwMDE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Chad Moffitt",
         "Sonam Sherpa",
         "John Wraight"
      ],
      "reviews": [
         "Watched this film at TIFF 13 and completely enjoyed it. The 3D takes you there and on the big screen in the Scotiabank theatre it felt like i could walk onto the mountain with Hillary and Tenzing. Dramatic, tense and at times splendid in its visual depiction of Mt Everest this is must watch for anyone interested in this epic story and the men behind it. The director takes her cue from films such as 'Senna' by completely doing away with talking heads and instead capturing the story entirely with the voices of the men who were actually there, aided only at times by the sons of Ed and Tenzing and a few select mountain experts. A great watch and a mountain/adventure classic.",
         "This documentary looks at the pivotal moment when two men became the first to reach the summit of the highest mountain on Earth. These men were of course Edmund Hilary and Tenzing Norgay, and the mountain was Mount Everest. Even to this day it is a very dangerous exercise climbing this mountain, after all until recently if you wished to do so you had to pass a large number of dead bodies on your ascent; corpses that simply hitherto could not be removed due to the sheer difficulty of doing so. But there is no doubt that it has become considerably easier to reach the summit nowadays than it was back in 1953 when it was first navigated. Back then, there was still an element of doubt as to whether it was going to even be possible, as the equipment devised was only theoretical until successfully used. This documentary looks at the first successful expedition and captures all of their inner doubts and fears about what they are about to attempt but also their excitement. The film quite successfully transmits this to the audience. It's been shot in 3D and it's pretty justified, as the format is quite good at illustrating the precariousness of the climb and the visual effects overall gave a pretty good feeling of the view the men must have been presented with. I was struck in particular with the scenes showing where the men camped on the last night before finally ascending to the summit. It was literally on a cliff face, with howling winds outside. The men spent the night here drinking boiled snow. It is an almost surreal image and its details like this that I took away mostly from this film. Once we reach the summit, we are treated to a very nice slow 360 degree pan that beautifully shows the height and beauty of the Himalayas. There is not a lot of real filmed footage of the expedition but we see a little of what there is. Mainly the film is made up of archive photographs along with dramatic reconstructions of the climb, with commentary made up of archive interviews from the men and new accounts from surviving relatives. The reconstructions are well done, with well-chosen actors who really resemble the real people. All things considered, this is a very successful documentary about one of the key historical adventures.",
         "I loved the scenery. The 3D made it feel like we were on the climb with Hilary and Tenzing. When snow was falling it made it feel like it was falling on us and when they were walking by the crevasse we were right there with them. I loved the fact that there was no narration the voices of the characters were enough explanation to portray the event also the choice of actors fit the looks very well. Period costumes and equipment were realistic and reminded us of the difficulties of climbing everest at that time. Pooleys direction of Beyond the edge was sensitive and skillful. The whole experience from beginning to end was amazing.",
         "It takes a sophisticated filmmaker to take us though a well known epic adventure with the grip of an efficient emotional narrative, technical intelligence and visual grace. That is precisely what L Pooley does in her recent film Beyond The Edge. The subtle usage of 3D, which could have been an excuse to overload the film with an abusive imposition of random and endless visual planes, allows the viewer to experience the amazing adventure of two unique men and a unique mountain, in a quiet and mesmerizing manner. There is not one moment in the film in which the tension and the expectation of what is taking place in the story is diminished by the fact that we all know what the story is about. Great film not to be missed!",
         "I watched this documentary at TIFF13. It was awe inspiring!! The superb direction of Pooley and the 3D format worked to give one the sense of being on the climb and reaching the summit with Hilary and Norguay! Mountaineering in today's world is hard! This climb that takes place in 1953 shows the audience how difficult it was then. The use of equipment and costuming truly re-enforces this knowledge. Pooley was able to use 3D to allow us, who will never climb a mountain, the opportunity to feel the tension, the tiredness and the exhilaration of summiting along with Hilary and Norguay. Even though the world knows the end result of this climb, until now no-one has taken it upon themselves to reconstruct it, with amazing footage, archival pictures, and interviews, how summitting was achieved!",
         "Sir Edmurd Hillary once quote that 'It's not the mountain we conquer, but ourselves'. It was a mountain of a task to make a 3D docudrama about Sir Edmund Hillary's historical ascent of Mount Everest in 1953. Director Leanna Pooley kinda pull it off. It was pretty entertaining to watch. The movie feature a lot of dramatized recreations shots on location on Mount Everest and in New Zealand's Mount Cook for this film. The locations used are just breath-taking. The movie features actor Chat Moffitt as Edmurd Hillary and Sonam Sherpa as his helper, Tenzing Norgay in the main roles. The actors that was used in the recreation, really look like the actual people that climb the mountain. Both Chat Moffitt and Sonam Sherpa look like they are season-climbers, as well. They're not afraid of doing all the stunt work, and hard climb on the terrain. The film also include a lot of original footage and photograph of the 1953 British expedition. While, there's not a lot of real filmed footage of the expedition; we do see a little of what there is. Some of these footage is being shown for the first time in a long time. I wouldn't say the 3D docudrama scale new heights. The 3D is rarely used, but it did look stunning. I was on the edge of my seat, the whole time. The movie was somewhat intense. It shows what Hillary had to deal with, such as slow ascent with the usual challenges of rapidly-declining oxygen and impending monsoons that could make the weather on the mountain worst. Then, there was the moment of nearly slipping over an edge. All the action are all authentic depiction of the events. The movie is nearly humorless, but there was a funny sequence of weird inventions to help the climbers get to the mountain. The information being put out was great for the most part. I love the use of maps, and graphs to show where the climbers were at. The way, the camera zoom in and out from the mountains exterior shots, makes it look like the actors are really there. I do like that the movie try to be cutting edge creativity with its shots. There is a scene where Edmund Hillary talks about his time as a beekeeper. Throughout the movie, the bees appear both in archive photos, and in the recreations scenes. It's kinda annoying because the bees pester you when you're trying to look at the photos. The movie goes in a measured pace, but there were a few things that wasn't needed for the film. I felt the movie pacing slow down, when the flashbacks came in. Honestly, do we really need to know that Hillary was apparently bullied at school? Also, the flashback effects are blurry and bright as hell, making the 3D look bad. Honestly, I had to take off my glasses because it was giving me a headache, when those really short scenes pop up. These information flashback are so short, and useless, that it should had been cut from the film. The intercutting with shots work with the pace, because the director takes her cue from other documentary films such 2010 'Senna' by completely doing away with talking heads studio footage, and instead capturing the story entirely with the voices-over explaining what's happen on screen. She really did get a lot of good narrations. Not only from the men who were actually there, but the family of both Ed Hillary and Tenzing. There were a few select mountain experts, also there to explain, why Mount Everest is a dangerous mountain to climb. The only voice over that didn't sound right is Ed Hillary. You can still, heard the radio noise in the background when he speaks, taken from old radio broadcasting of 1953 The Conquest of Everest. I would had thought, the sound editors would clean that up, a little bit more. Overall: The movie doesn't have the suspense of 2003's documentary, Touching the Void, or the mystery of 2010's the Wildest Dream. The movie felt like TV docudrama on the History Channel or Discovery, more than a movie, you watch in theaters. Still, it was alright. It was very informative, and works outs fine. A must-watch for any documentary lover.",
         "\"If you cannot understand that there is something in man which responds to the challenge of this mountain and goes out to meet it, that the struggle is the struggle of life itself upward and forever upward, then you won't see why we go.\" Edmund Hillary I don't know about you, but climbing a thousand feet up a hill is not my idea of fun, much less going over 29,000 feet to the summit of Mt. Everest as Edmund Hillary did heroically in 1953. Writer/director Leanne Pooley in Beyond the Edge has done the next best thing, thrilling me with old footage and expert re-enactment to help me understand the heroics necessary to pull off that feat. In other words, her Beyond the Edge is a successful documentary that doesn't rely on fake sets and swelling orchestration to tell the story of Col. John Hunt's (John Wraight) expedition, in which Hillary (Chad Moffitt) is given the opportunity to be the first human to reach the summit with the help of Sherpa Tenzing Norgay (Sonam Sherpa). Although this doc doesn't have the suspense of Touching the Void, it is a realistic rendering in the spirit of Sir Ernest Shackelton's doomed Antarctica expedition told in The Endurance. While Hillary has a hairy moment of slipping over an edge only to be saved by Tenzing, the rest is an authentic depiction of slow ascent with the usual challenges of rapidly-declining oxygen and impending monsoons. It's the measured pace I like, the strategizing and assessing, done with the cool you'd expect from seasoned climbers, some of whom have been disciplined military officers. The intercutting with shots from the past and narration by Hillary, his son, Hunt, and George Lowe, among others, works seamlessly to give you the feeling you're carrying a backpack. As for the 3-D, I'm not always a fan, but here it works well enough not to be distracting. A few bees enter and exit the frame to no spectacular effect, but otherwise the experience is enhanced by the semblance of reality. As for the ambition and ego necessary to make it to the top, Hillary expressed it well: \"No one remembers who climbed Mount Everest the second time.\"",
         "An excellent telling of the story of the conquest of Everest. A detailed and fascinating account of the first successful expedition that seamlessly blends historical footage and pictures with recreations while telling the story of the whole expedition, including the strategy, tactics, equipment, procedures and internal politics of who would be chosen to attempt the summit. After watching several of the historical and more recent Everest films, this one filled in some information holes and provided an insight to the \"real deal\" as told by those who were on the team, recalling personal and important pieces of the expedition.",
         "This is a matter of fact description with pictures of Hillary's climb of Mount Everest in 1953. The documentary lacks drama and emotion and really is not that technical either. It does give some understanding of the route taken and hardship of the climb but at times it felt like watching a news real account of the event without any real depth or insight into the characters of those involved. Sorry to say even the 3D aspect wasn't enough to keep my interest. The one stunning view was from the summit but outside of that the 3D aspect was never fully achieved to make the viewing any better than two dimensional. Unfortunately the story is well known and generally the audience has more knowledge of the event than what the movie relates. Disappointing.",
         "What a fantastic movie about an epic achievement. You really feel like you were with them through the expedition to the final crowning moment, and you really appreciate the monumental achievement that it was, and the courage and effort it required. It has the feel of the classic age of exploration and is befitting of its topic and the times. The recreations are very convincing and flow seamlessly with the archival footage. The somewhat restrained tone of the film fits well with the manner of Ed Hillary and the rest of the British expedition. The original narration by Ed Hillary, again highly restrained, juxtaposes against their monumental accomplishment, and I think it is a nice and fitting touch. The memory of the film remains afterwards, and I think the film is a fitting tribute to the men and the event.",
         "1st of all i want to thank the director for making this amazing and worth watching documentary. I liked this documentary from start to end.It kept me excited all the way because of some of the amazing camera work that i have seen yet. I am already a mountain lover and after watching this movie i can't control my love for the mountains and for the amazing nature that has been documented in this documentary. I would recommend this movie for anyone but especially for those who are more forgiving towards nature and for the people who like mountain's climbing e.t.c If you want to see a perfect made documentary on the ascent of the highest peak of earth then you have to look nowhere else.This documentary film presents every thing that is needed for a documentary to be an awesome documentary. From me i would rate this movie 10 out of 10. Love it amazing experience."
      ],
      "genres": [
         "Documentary",
         "Adventure",
         "Drama",
         "History"
      ],
      "productionCompanies": ["General Film Corporation"],
      "summaries": ["Tenzing Norgay and Edmund Hillary's monumental and historical ascent of Mt. Everest in 1953 - an event that stunned the world and defined a nation."],
      "budget": 0
   },
   "movielensId": 167642,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Polski"
      ],
      "releaseDate": "2013-10-24",
      "dvdReleaseDate": null,
      "directors": ["Leanne Pooley"],
      "runtime": 93,
      "movieId": 167642,
      "title": "Beyond The Edge",
      "mpaa": null,
      "actors": [
         "Chad Moffitt",
         "Erroll Shand",
         "Sonam Sherpa",
         "John Wraight",
         "Joshua Rutter",
         "Daniel Musgrove",
         "Phurenje Tshering",
         "Jimmy Kunsang"
      ],
      "imdbMovieId": "2468638",
      "originalTitle": "Beyond The Edge",
      "genres": [
         "Documentary",
         "Drama"
      ],
      "youtubeTrailerIds": ["Md-EHh2mf_w"],
      "plotSummary": "A 3D feature film about Sir Edmund Hillary's monumental and historical ascent of Mt. Everest in 1953 - an event that stunned the world and defined a nation.",
      "tmdbMovieId": 211088,
      "avgRating": 3,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/jmEH5tfAiF3FneL1Y7dMYsTK5aZ.jpg"
   }
}