{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "sexual fantasy",
         "id": 9835
      }],
      "imdb_id": "tt1149604",
      "video": false,
      "title": "Raging Sun, Raging Sky",
      "recommendations": [],
      "backdrop_path": "/95VYE66O3GQcovryJBjpAwciC0M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kieri",
               "gender": 0,
               "credit_id": "5368e0c60e0a2647cb0080ff",
               "name": "Jorge Becerra",
               "profile_path": null,
               "id": 1317098,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tari",
               "gender": 0,
               "credit_id": "5368e0dd0e0a2647d4007dbc",
               "name": "Javier Oliván",
               "profile_path": null,
               "id": 1301538,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ryo",
               "gender": 0,
               "credit_id": "5368e0fb0e0a2647d4007dc2",
               "name": "Guillermo Villegas",
               "profile_path": null,
               "id": 1317100,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Andrés",
               "gender": 0,
               "credit_id": "5368e1160e0a2647ce007dc6",
               "name": "Joaquín Rodríguez",
               "profile_path": null,
               "id": 1007567,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Umberto",
               "gender": 0,
               "credit_id": "5368e12f0e0a2647c4008273",
               "name": "Juan Carlos Torres",
               "profile_path": null,
               "id": 1317102,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sergio",
               "gender": 0,
               "credit_id": "5368e1480e0a2647ce007dc9",
               "name": "Fabian Storniolo",
               "profile_path": null,
               "id": 1317103,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Bruno",
               "gender": 2,
               "credit_id": "5368e15a0e0a2647d8007fbf",
               "name": "Harold Torres",
               "profile_path": "/foIfRtugFwPzNYOhzKpsfb9zFXU.jpg",
               "id": 234070,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Boxeador",
               "gender": 0,
               "credit_id": "5368e1730e0a2647c4008279",
               "name": "Baltimore Beltran",
               "profile_path": null,
               "id": 586302,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Jonás",
               "gender": 0,
               "credit_id": "5368e18b0e0a2647ce007dd5",
               "name": "Ruben Santiago",
               "profile_path": null,
               "id": 1181541,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Muchacho del mercado",
               "gender": 0,
               "credit_id": "5368e1a40e0a2647cb008113",
               "name": "Ruben Angelo",
               "profile_path": "/pAtOT3bPmoi5a6AyUStSKx7DdFj.jpg",
               "id": 1283974,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c41c3a36847f822523d",
               "name": "Julián Hernández",
               "profile_path": null,
               "id": 88309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5368e1bd0e0a2647c8008302",
               "name": "Julián Hernández",
               "profile_path": null,
               "id": 88309,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.095406,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 161246,
      "vote_count": 7,
      "budget": 1000000,
      "overview": "A story of love, sex and destiny, by director Julian Hernandez. Youthful Kieri and Ryo share a deep and passionate love for each other. Kieri sets off in search of his soul mate after Ryo is kidnapped. A female spirit is with Kieri as he searches for Ryo. Ryo escapes and the pair will have to work hard to prove their love for each other as obstacles are placed in their path along the way.",
      "similar": [
         27,
         86331,
         27066,
         24402,
         320588,
         12225,
         192684,
         22621,
         102835,
         446289,
         431769,
         21373,
         1560,
         183026,
         55580,
         48482,
         8069,
         214030,
         43091,
         353163
      ],
      "original_title": "Rabioso sol, rabioso cielo",
      "runtime": 191,
      "poster_path": "/rbNGD8D2uiowATeGOewUzJH7nNb.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "PRO-FUN MEDIA",
            "id": 75050,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TLA Releasing",
            "id": 328,
            "origin_country": ""
         }
      ],
      "release_date": "2009-10-15",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Julián Hernández"],
      "runtime": 141,
      "synopsis": null,
      "writers": ["Julián Hernández"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1149604/",
      "coverLink": null,
      "actors": [
         "Jorge Becerra",
         "Javier Oliván",
         "Guillermo Villegas"
      ],
      "reviews": [
         "Godard, Resnais, Antonioni, Pasolini, a bit of Almodovar and Lynch: imagine them all as influences in a single piece of cinema, and tell me that the combination would not have sunk any cinematic work nine fathoms deep; yet director Julian Hernandez proves unsinkable with the culmination of his sexual trilogy: \"Raging Sun, Raging Sky\" is a triumph of visionary will. \"Raging Sun, raging Sky\" is a serious sexual epic, with Kieri, Tari, Ryo and Tatei its main protagonists. Tari meets Tatei and they make love does not even schematically render the beginning of the film: Hernandez establishes an affectuous labyrinth of camera traveling depicting the meeting and the lovemaking. Tatei speaks and informs us on an inner knowledge she has: Ryo is yet to meet a lover that will shake his life, and like an apparition she extracts herself from the room. Resnais' influence, though articulated in Hernandez's previous feature \"Broken Sky\", here becomes more prominent and elaborately integrated in the film: one instantly recalls \"Last Year in Marienbad\"'s proceedings: the incantatory, obsessive, recurrent tone of the narrative voice over is here in a nutshell phrase, \"the lover witnesses the loved one through water.\" We do not know who enunciates this phrase, yet its recurrence has an otherworldly yet physical effect and affect beyond Resnais' abstraction. Add to this one of the most extravagant amorous triangulations, perhaps the film's greatest achievement, and we will be able to appreciate what the film actually contemplates. It is crucial here to pinpoint Tari's presence and role in the amorous triangle. Exit Tatei and the film begins to meander in the sexual gratifications of porn cinemas, public toilets and dark rooms where Kieri, Ryo and Tari search their interest: there is no graphic depiction of the proceedings, neither celebration, nor condemnation, only an, I'd say, Antonioni-informed sense of alienation interlaced with a somewhat uneasy, and yet not critical, lustfulness. It is here that Tari begins a kind of infatuation and indecisiveness considering which one of the two boys - Ryo or Kieri? - he will follow and choose. It is bizarrely (and as I will claim, retroactively) comic, how he fails to really interest any of the two. But if that was all, it would just be meager. What Hernandez also, and subtly so, does is to make Tari stand for the audience: take Tari off and Ryo's and Keri's love story would become unrepresentable, or regressing to a series of realistically portrayed failed encounters. One of the things that stays best in memory after the film ends is Tari's gracious anxiety when shifting from one direction to the other as Ryo and Kieri take opposite paths. It is here the film establishes what I would call the opposite of tragic irony, for then and there we somehow know that Kieri and Ryo will end up together. And they do so soon, but not for long: the film shifts gears, puts on some absinthe-colored cavernous greens and rusty reds and heads for the desert of the passion: I have not encountered so late in a film, that is in the last third, such a change, and the film's title then appearing, to a sulfurous effect. Kieri must take back his lover who lies captive by Tari. This part is for me the odd part of the film, who should not work, and yet does: Kieri walks and climbs, wakes with or without his earthly crust yet and again, as if to demonstrate he is the earthly element in love perhaps, but with a flat demeanor as if he had entered on the sleep side. And it is here that I missed Pasolini's amateur actors, especially in the \"1001 Nights\" and the scene with the Djin (the flying in the cave reads like referring to the Djin's flying in the earlier film), where his actors exemplified a hardship, a physicality lacking in Kieri's marching barefoot. This is the only point in the film that I found esthetically wounded; it is as if Jorge Becerra had rarely put his feet on non-urban soil. In the following scene, after Ryo is rescued, we can see Guillermo Villegas is more physical in such surroundings. Tatei appearing now like Heaven's Heart, Tari easily dispensed comes I think from Pasolini's manual, mythological film-making: clumsy yet with a dream's jumps and cuts, and rough as in an oral tradition. And where it seems to come to a halt, with its dragging Romeo and Juliet variation of lovers awake, the film comes to its most astonishing leap. The struggle we have witnessed so far is something Tari saw in the water: the wandering vision of Ryo underwater and of the love-through-water phrase comes to this strong point, which makes Tari something of a god-like creature, or at least endowed with a vision/witnessing that enables him to withdraw from the scene for the two lovers to be finally graced by love. Or is it so? Here Hernandez resorts to something Lynch first exploited in \"Mulholland Drive\": consecutive shifts-disappearances of persons for the uncanny effect that it is us after all who are watching all this. Tari disappears, and in the exact same place, with camera gliding the same way, Kieri appears and finally joins his lover in the bed. The camera starts receding out of the window and we catch Tari sitting with a sad expression in the room (perhaps deploring his omni-voyance?), and, what is the strangest thing of them all, Tatei/Heaven's Heart enjoying the breeze on the balcony, as if in the front of this odd, fantastic family. Is she the synthesis of the film's themes on love and loss? A somewhat Jungian symbol? I do not think so. It is here that Almodovar, who made possible the fact of film-makers like Hernandez working today, imperceptibly informs with irony the situation. But here the irony, with its colorful absurdity like Tatei's dress, has heavenly implications. Enter the pop tune.",
         "I'm sorry, but I didn't understand this movie at all. I couldn't believe it was made only one year ago, it's like watching a 30 years old Pasolini or Derek Jarman clone. It's all there. The black and white. The desolate settings. The beautiful males in various states of nudity, who never seem to do any acting but just sit around or wander aimlessly to and fro. No dialogue between the actors, but brooding looks that obviously mean the world (but not to me). The pompous length of all this!!! I admit that I was attracted by the storyline and the pictures on the cover of the DVD: it made me expect something like a sensuous homo-erotic thriller. Well, if by sensuous you think of nudity, it was just that, but even I can get fed up with useless nudity. And the thriller-part was completely beyond me: apparently there was some kind of kidnapping of a beloved one and then a heroic rescue in return, but what, why, who, what for, when??? It all went down the same pretentious and tedious drain. Sitting this one out felt like dragging myself through a muddy marsh. So I give myself a 10 out of 10 for making it to the end (I admit, partly thanks to the FF-button) and the movie a 3 (just because of the cute guys).",
         "For those with the ability to comprehend multi-dimensional chess, non-traditional narration, explicit gay themes, and the vision of one of the most extraordinary artistic directions in film today, the epic gay love story of Hernandez is worth the effort. Broken Sky elements permeate this latest vision. No one can film erotic skin quite the same way, and the love tune from Broken Sky even makes a cameo appearance in Enraged Sun, Enraged Sky, perhaps the director's homage to Hitchcock. The film, as previously noted, hints at Antonioni at his peak, Fellini as his most decadent, and even outdoes Almodovar as his most outrageous. Though some may claim that Hernandez is now out of control, quite the contrary: he has opened up his vision. We are now privy to some Aztec mythology about love surviving violence and death. Having first seen Hernandez's short film David about a mute boy's encounter one afternoon with an older man, I have found the threads and motifs throughout his work. If you want to know what it was like to enjoy the work of the greats while they lived and created, your chance is available with Julian Hernandez.",
         "For a film as well made as this, you would rightly expect a good deal of praise. However, it is horribly self indulgent and far too long. I could get 30 minutes out of it without even trying and I think it would still retain its many qualities. Ambiguous storytelling has its attractions, but what is the point of being so ambiguous that the film becomes incomprehensible, even to an old film buff like myself, steeped in 50 years of film festivals and the many cinematic challenges they throw up. I found much of the film compelling viewing, but it was obvious that the director simply didn't know how to end it and so the denouement drags on endlessly. The fast forward button on my DVD player was a Godsend.",
         "This movie is visually stunning but otherwise almost completely unsatisfying. There is more full male nudity than in any other non-porn movie I have ever seen, and the casual way it is handled is marvelously refreshing; but despite abundant nudity and the theme of gay love interrupted and reclaimed, this is the LEAST erotic and the LEAST romantic movie I have seen in ages. Every second of its over three hours is so tightly choreographed, every slightest movement so obsessively under the director's control, that it might as well be claymation. It is bloodless and cold, so cerebral that the flesh on abundant display might just as well be clay in an animator's studio. As long as I had no idea who anybody was, how they were related to one another, and what the point of the movie was, I was fascinated just watching the people move like dancers through the fantastic sets and landscapes. But when its point began to come clear, that point was so trite that I wished it had stayed cold and confusing but fascinating to watch. Overall, though, I'm glad I watched it, because it changed ME in a way I never would have expected. I discovered for the first time that I've spent all my life thinking of Mexico as a barbaric country full of poverty, drug lords, brutality, violence, filth, ugliness and absolutely nothing worthwhile. A country like that could not have given birth to a movie as accomplished and sophisticated as this movie is, so I'm completely overhauling my attitude toward our neighbor to the south.",
         "This movie is 192 long boring minutes of naked men & a few women walking around & being in sexual positions. It is also in Black & White,The locations & persons cry out for color. There is no real plot or story, I do not mind figuring things out, BUT do not want to spend over 3 hours doing so. The late Andy Warhol made film like this when he first started out,He quickly changed to softcore porn. He was also a gifted artist I watched the first 30 minutes then fast forwarded it., IT still was a big bore. Please don't waste your time or money on this. My 3 rating is for some nice views ONLY, Ratings: ** (out of 4) 35 points out of 100 IMDb 3 (out of 4)",
         "A naive question first: how many masterpieces of world cinematic history can this fascinating work hold up to its credit? Too many to be counted. I would definitely add the influences of Glauber Rocha and Ingmar Bergman, among others. So is this original? Yes, but at some point it becomes an overarching exercise that tries to join the horny/corny and the sublime. I am wondering -- and this may be futile -- how much money was spent on the making of this heavy creation that seems geared for so many audiences that could not possibly be satisfied at once -- or could they, would-be Pasolini? I Haven't watched Broken Sky yet but then...",
         "Where some seem to feel the film lacks a story line or lasts to long, even claim pretentiousness.. I disagree... Admittedly I have a soft-spot for long-winding stories, but in this case it actually is instrumental in creating a feeling and atmosphere which is very well captured. The actors manage to show all they need to show without saying so much as a word, which to me is proof of real acting qualities. The story is a strong and powerful tale, served well by the equally strong images that invoke Pasolini, Almodovar but also the likes of Baron Wilhelm Von Gloeden... This is definitely an instant favourite and will get a place of honour in my film collection"
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Mil Nubes-Cine",
         "Fondo para la Producción Cinematográfica de Calidad (FOPROCINE)",
         "Instituto Mexicano de Cinematografía (IMCINE)"
      ],
      "summaries": ["A story of love, sex and destiny, by director Julian Hernandez. Youthful Kieri and Ryo share a deep and passionate love for each other. Kieri sets off in search of his soul mate after Ryo is kidnapped. A female spirit is with Kieri as he searches for Ryo. Ryo escapes and the pair will have to work hard to prove their love for each other as obstacles are placed in their path along the way."],
      "budget": 1000000
   },
   "movielensId": 167632,
   "movielens": {
      "languages": [
         "Deutsch",
         "Español"
      ],
      "releaseDate": "2009-10-15",
      "dvdReleaseDate": null,
      "directors": ["Julián Hernández"],
      "runtime": 191,
      "movieId": 167632,
      "title": "Raging Sun, Raging Sky",
      "mpaa": null,
      "actors": [
         "Jorge Becerra",
         "Javier Oliván",
         "Guillermo Villegas",
         "Joaquín Rodríguez",
         "Juan Carlos Torres",
         "Fabian Storniolo",
         "Harold Torres",
         "Baltimore Beltran",
         "Ruben Santiago",
         "Ruben Angelo"
      ],
      "imdbMovieId": "1149604",
      "originalTitle": "Rabioso sol, rabioso cielo",
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story of love, sex and destiny, by director Julian Hernandez. Youthful Kieri and Ryo share a deep and passionate love for each other. Kieri sets off in search of his soul mate after Ryo is kidnapped. A female spirit is with Kieri as he searches for Ryo. Ryo escapes and the pair will have to work hard to prove their love for each other as obstacles are placed in their path along the way.",
      "tmdbMovieId": 161246,
      "avgRating": 1.5,
      "releaseYear": "2009",
      "numRatings": 2,
      "posterPath": "/rbNGD8D2uiowATeGOewUzJH7nNb.jpg"
   }
}