{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0388534",
      "video": false,
      "title": "Wasp",
      "recommendations": [
         126193,
         69913,
         127148,
         160332,
         129971,
         118014,
         97513,
         132364,
         104407,
         308690,
         126204,
         146320,
         106196,
         105711,
         113354,
         125150,
         125602,
         209808,
         188425,
         280062
      ],
      "backdrop_path": "/pBveAp3zyUEDaOwufZighUydEek.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Zoë",
               "gender": 1,
               "credit_id": "52fe468ac3a36847f8104967",
               "name": "Natalie Press",
               "profile_path": "/53eAJMtBjXiW4JkjYhHLtHP00V9.jpg",
               "id": 37983,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe468ac3a36847f810496b",
               "name": "Danny Dyer",
               "profile_path": "/wrBb7onYgbukyi5gXPGkAoYjtB8.jpg",
               "id": 41042,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe468ac3a36847f810495d",
               "name": "Andrea Arnold",
               "profile_path": "/tdOz2FOhMyQaLOyEQYK1GEk8PA8.jpg",
               "id": 71082,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe468ac3a36847f8104963",
               "name": "Andrea Arnold",
               "profile_path": "/tdOz2FOhMyQaLOyEQYK1GEk8PA8.jpg",
               "id": 71082,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.677427,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 44472,
      "vote_count": 23,
      "budget": 0,
      "overview": "Zoë is a single mother who lives with her four children in Dartford. She is poor and can't afford to buy food. One day her old flame drives by and asks her to go on a date with him. Scared that he doesn't want to go out with her, she lies and tells him that she is just babysitting the kids. This will be her first date in years.",
      "similar": [
         9762,
         12162,
         568,
         597,
         41592,
         598,
         773,
         858,
         8923,
         8966,
         19,
         281,
         1359,
         49026,
         51828,
         157336,
         11005,
         153,
         155,
         634
      ],
      "original_title": "Wasp",
      "runtime": 26,
      "poster_path": "/tBgAbjaO2H6ZQofnMdzwa4u8ot5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2003-01-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrea Arnold"],
      "runtime": 26,
      "synopsis": null,
      "writers": ["Andrea Arnold"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0388534/",
      "coverLink": null,
      "actors": [
         "Natalie Press",
         "Danny Dyer",
         "Jodie Mitchell"
      ],
      "reviews": [
         "Just saw Andrea Arnold's 'WASP' and am blown away by the her talent - this story is so painfully real that as much as you want to look away you can't. Beautifully cast and acted - not one false note from any of the cast (the kids are superb) and shot in such away that you find yourself not watching a dramatization but participating in something that is actually happening. You want to reach out and just grab the mother and shake some sense into her, even as you can't begrudge her need to have a brief moment of happiness (potentially destructive as her actions and needs are). The director has great talent! Hopefully Hollywood will cultivate her!!",
         "This really is an extraordinary and exceptional film. Gritty, real, touching and also incredibly tense and full of suspense. The free flowing nature of the camera-work adds to the already vivid realism, almost docudrama style. As a viewer you are drawn into this impoverished and deprived world, you feel immediate empathy for the central character in her desperate situation. She shows warmth, love and humanity to her children side by side with an appalling judgement about their well-being and safety. She is wonderfully contrasting yet totally believable and genuine. It's a true eye opener of a film. Certainly one of the best short films I have ever seen. Worth going out of your way too see.",
         "Zoë is a young mother of four small children. She's really down on her luck. Her partner has left her, she has little money, the kids need what kids need. Well food mainly. She has attitude. So would anyone in her position. Angrily she storms down the stairs of her high rise carrying her baby boy and with her little daughters storming alongside her. She is wearing a nightie, and that's it. No shoes, no knickers. She stomps across a bleak working class estate and bangs on a door. When another young mother opens the door, Zoë falls upon her and the pair tumble out into the street fighting the way women do, hair in both hands, shrieking and swearing. There's some issue over their children squabbling. The neighbours drag them apart and as she beats a retreat, she and the kids, on her command, all together, give them The Finger. Then Zoë meets an old flame Kai and the chemistry between them is palpable. Kai asks her out, but wonders who the children belong too. \"I'm looking after them for a friend\", lies Zoë. It's her first date for a long, long time, but she can't find a baby sitter. In the end she has to take the children with her. She's pulled between her genuine love for her children and her desperate need to, just once, break away from her troubles and have fun. The story is powerful, supported by a careful and accurate screenplay. The whole cast plays well, but this is Nathalie Press' film. The Zoë character is feisty and frightened, blousy, brave and beautiful, despairing and hopeful, and Press hits the nail square on the head. The performances from the children are astonishing. Either the editors found some of the best child actors in Britain, or an enormous amount of material ended up on the cutting room floor as the editors tracked down just what they wanted. Kai needs to be gentle and intelligent, and the well-cast Danny Dyer gets it just right. This short film really got to me. I it found heart breaking watching the young mother and her children gradually getting into more and more trouble. She just needed someone to take care of her! Director Andrea Arnold made a very special film. I score 10/10. Update - and on 27th Feb 2005 Wasp won the Oscar for Best live action short film.",
         "I think this short film is amazing. This is because of its naturalistic approach to filming and how the characters are portrayed in a very realistic style. I really feel for the character of Zoe. She is obviously desperate and you can see this in the scene where she dances with her kids to keep them happy outside the pub. Also, where she gives the children sugar.. to stop them from moaning and also partly because all she has in the house is mouldy bread. When the children pick the food off the floor is the most sad scene in a movie ever. You can see why she does what she does, and it shows a real portrayal of how some people live and how desperate they are for help.. :)",
         "Saw this at Bermuda Film Festival. Wasp really was one of the most affecting films I've ever seen. It's power to control the audience - almost like a Hitchcock classic. Taking you to the edge then pulling back - don't want to give the story away. I thought DOG was brilliant, but this film is a lot more subtle. It follows the story of a woman who is on the verge of loosing her children. She wants to maintain her life style although she lacks the resources to do it. The audience were very quiet as we see her stark life unfold in harsh terms. The interaction with the wasp and the child got an audible gasp from the viewers who were on the edge of their seats. Some people even left the cinema. I've never seen a film which captures the plight of people who don't have any choice in life. Don't miss this one - it's a classic.",
         "The development of lightweight portable 16mm camera equipment about 1960 made possible a new style of documentary film called \"Direct Cinema\". Instead of the traditional scripted (obviously fictionalized) method, in this new style the filmmakers do not involve themselves in the action. The camera being all seeing and unobtrusive-if the camera is not actually hidden the subjects become so used to it that they ignore its presence. What makes \"Wasp\" so unique is its almost seamless fusion of the two documentary styles. Writer/director Andrea Arnold scripts a fictional story intended to look so authentic that it can pass as direct cinema. This is done so effectively that not only is a casual viewer unable to tell whether it is fact or fact-based fiction, but in most cases actually assumes the story is authentic and the characters real. The acting (particularly by the children) is so well directed and edited that you feel certain that these are real people. There is a bit of a false note in that the actress (Natahlie Press) who plays the mother is a bit too attractive; although they try to detune her appearance this factor still raises early suspicions . The only other false note is that at no time does anyone look directly into the camera, something inevitable when working with non-actors. But even this is not an infallible indicator because it would have been possible though careful editing to effectively trim out these behaviors. The appearance of the wasp (a metaphor for the risks of growing up in this type of environment) is surreal enough to tip off the viewer to the true nature of the film, but it occurs so late in the production that it does not spoil much of a viewer's roller-coaster experience. The 23-minute \"Wasp\" is a project of The UK Film Council's decision to select and fund the making of new short films by talented, but as yet unknown directors. Apparently the project is very open with few rules and structure, each director is given $50,000 by the project. \"Wasp\" was shot on a council estate (a public housing project) and is intended to be a realistic but fictional glimpse into one day in the life of a fairly \"typical\" unmarried mother (insert British white trash here). In these public high-rises the adult occupants dream about the lives of David and Victoria Beckham and the children aspire to trips to McDonalds (especially attractive when their kitchen only contains moldy bread and white sugar). Because Zoe (Press) fears her four young children will be taken from her, she drags them along to a pub where she is meeting a potential new boyfriend. They are not permitted in the pub and must stay outside with the baby. While she plays pool and gets romanced the children wait outside, bored and hungry. They manage to invent a few games to amuse themselves. The oldest daughter, who looks to be about eight, is already more mature than the mother and resourcefully scrounges for food. Although a bit heavy-handed in making its points, the film nicely avoids a preachy tone. I found it absolutely riveting and its Oscar well deserved. Then again, what do I know? I'm only a child.",
         "WASP is a thoroughly unpleasant film due to its subject matter. The film is about a poor mother with four small children who is simply unfit to take care of them--let alone herself. Though technically an adult, Zoë is completely irresponsible and selfish. As you watch her hungry children and her ambivalence towards them, you'll find the film very shocking. Now I don't think that she hates her kids--it's just that her needs trump all others and right now her need to to hook up with a man. Now despite having these kids (and the oldest looks to be only about 7 or 8), she drags them to the pub and tells them to wait outside and leaves the oldest one in charge. And the children wait, and wait, and wait for many hours--often playing in the street to amuse themselves and starving while mom is inside buying drinks for her date. This film earned the Oscar for Best Live Action Short Film and it deserved it even though it was hard to watch and was so very unpleasant. There were two main reasons I liked the film. First, it was completely unflinching in how it showed a neglectful mother and her kids--you couldn't help but feel sorry for the kids and you wanted to scream out loud towards the end of the film when they are in such grave danger. Second, I really appreciated how the film didn't take a definite stand (right wing or left) and simply showed the family without commentary or trying to shove an agenda down your throat. The film is very crude and harsh, but all this is necessary to accurately portray this lifestyle. This, combined with the shocking images make this a terrible film to show children, but an amazing film for anyone else. I dare anyone to watch this film and not be affected.",
         "Such a beautifully made film, raw and gutsy. The strength of the film lies within the actors, writers and directors portrayal of the characters. This is life or at least a part of it as seen from the perspective of the third person, a keyhole glimpse into a small part of life of a young mother. The film is so real it is unnervingly real. I'm not going to give away any spoilers but it is a must to watch. If you liked other contemporary British films such as Rita, Sue and Bob Too, Kes, Poor Cow, A Taste of Honey, Sweet Sixteen, Cathy Come Home and Angela's Ashes, then your going to love this. Yes this is one for my collection if and when it comes out on DVD. 10/10.",
         "This movie felt very real and very intense when I was watching it. The mother in the story is seen to many as a scumbag mother who doesn't deserve her children. I have to disagree with this because though she is not able to give her children the proper care, she shows moments where she truly does care about them. She does go into a bar leaving her kids out alone, but it is the only way she can escape her nightmare, which is actually her reality. She is like a wasp trapped in a window. She needs someone to let her out, someone to help her, but that person isn't there. She has no money, and no one to look out for her, so she lives the poor lifestyle that she lives because there is nothing she can do. I think the purpose of this movie was to show the viewer the humane side of a mother who cannot provide care for her children.",
         "The winner for best short film at the 2005 Oscars,this well-made,gritty and honest film seems to me to have a very ambivalent attitude towards it's main character Zoe(convincingly played by Nathalie Press). A single mother living on a grim council estate,she's prepared to scrap with a woman who attacked her kids by going to her house dressed merely in a nightie,then uses the most foul,gutter language in front of them(all pre-teen).Capable of behaving like an sweet angel one minute,and a gross harridan the next,she attempts to have some fun with a sympathetic suitor(Danny Dyer),but with no partner or babysitter in sight this is doomed to failure,with dire consequences for her children,left outside a pub. The film charts the difficulties that such women face(or perhaps bring on themselves),and the subject of social services is frequently brought up.But is there a happy ending in store with the would-be suitor? The film will probably have different interpretations by Social Libreals and Right-Wing Fundamental Moralists because of this ambivalence.Despite it's undoubted quality,Laurel & Hardy's THE MUSIC BOX(1932),is still the best short ever awarded the Oscar for me!",
         "Zoë is a single mum with four kids living on a council estate. Things are rough for the family, with little money to spend on basics such as food and the like although Zoë doesn't really help herself by what she does. Asked out to the pub by Dave, Zoë has to try a place for her kids so she can meet him up. Perhaps not worthy of the status of being an Oscar winner this is still an interesting and well-made film. Another reviewer on this site has commented that the film can probably be interpreted to suit your politic leaning but I thought that was actually a good aspect of it because it is so ambiguous. Is Zoe a victim of her surroundings or is she just a selfish, council-estate chav? On the surface it is an easy question to answer but, although I did lean towards the latter, the film did make me think about her situation, her poor options and the depressing future that her kids have in front of them. The inability to come down on either side of the fence does take away from the film a bit but I found that the thoughts it gave me covered for it; although I can also see why it would the subject would bother some viewers \u0096 after all, are we really expected to be engaged by a lead character that we would move cities to avoid? Press plays her well regardless though. She is totally convincing and deserves credit for being so natural and not allowing the sentimental leaning of the script to turn her into a sympathetic character. Dyer is a good face to have involved and is his usual good value in a wide boy character. The kids are very good and are the heart of the film, delivering depressingly natural depictions of council estate kids \u0096 f**ked from birth. Overall this is an uneven film that will be taken different ways by different viewers but will likely bother many with its forgiving look at a real piece of white trash. However it is still thought provoking and that makes it worth seeing along with very good direction and generally strong performances.",
         "I saw \"Wasp\" last night as a short between features on FilmFour, which is now a free channel in the UK. \"Wasp\" at first glance might appear a \"torn from today's headlines\" type of short film, made to arose either indignation about social conditions or admiration for the director's bravery in attempting to address such subjects (with arty camera work). When I started watching it I thought it was clichéd. As it developed I admired how the film was ambivalent towards the mother and didn't seem to be making judgments about her. It allowed the events to develop to a point which indeed shocked me, but shocked me as a drama rather than as an exposé. It allows the council estate mother to be somewhat sympathetic- flawed, yes, but above all human. She was making what seemed to me poor choices (like why didn't she tell her new potential boyfriend earlier that she had four children, instead of pretending for one night she was single, and choosing to have sex in the car park? She could have told him about her situation and then taken him and her children back to their flat, where the children would be safe ).On the other hand she seemed very affectionate towards her children. They were very well behaved in the circumstances and cared deeply about each other and their mother, despite her leaving them in the car park, hungry and bored. I disagreed about the quality of the CGI: the wasp to me looked all too real (that wasn't honey on the baby's face but some kind of barbecue sauce). The film's avoidance of the pitfalls of sentimentality makes its portrait of the family all the more tragic. \"Wasp\" may be only 24 minutes long but it's more moving than many Hollywood melodramas.",
         "I'm sure this film is out to depict life in a realistic fashion in the projects in Briton, but the lead character is so selfish and unlikeable it is almost impossible to watch. It is about a single mother with kids aged 10 to a newborn who is more concerned with getting a date than taking care of her children. Her behavior is unbelievably appalling as she feeds her kids sugar, then has them wait outside a bar as she goes on her 'date'. When she stuck her infant's pacifier in sugar and into its mouth, I just gave up there. A friend of mine is an ER doc and described this behavior of drug addicts with children as it quiets the kids, and it is so tragic. I was waiting for protective services to come, but they never do and you realize these four kids have no future because of the mother. At the end the film's theme is that single mothers need a man to take care of them. Although the filmmaker does have talent, I've never been a fan of films that offer little to no hope, so if you feel like being depressed, then run out and watch this. If not stay away.",
         "\"Wasp\" is a 23-minute (without credits) short film by writer and director Andrea Arnold and it was her big breakthrough movie as this film did not only win an Academy Award, but tons of other honors at film festivals all over the world. Also, once it got nominated, it was almost always a safe pick for the win it seems. In the center of it is a single mother of four, who runs into an old boyfriend again, but lies to him about the kids. While on a date, she has not only to keep said date going, but also take care of the kids at the same time. The lead actress plays her part well and she is not really known. The lead actor is a bit more famous (\"The Football Factory\") and he also does a fine job here. Arnold was a fairly unknown actress herself in the early years of her career before putting her focus on filmmaking. In the 12 years after \"Wasp\", she directed 3 other movies and number 4 is going to come out soon. All in all, this is a decent short film. I think it is a bit overrated because of that pivotal moment involving the youngest child of the protagonist at the end, but it's by no means bad. Occasionally mediocre, but for the most part a success. Oh yeah and the Ronan Keating song is pretty great as well. Recommended.",
         "I saw this film in my seminar at university today as part of this week's lecture and seminar topic of social class in the media. While it is drastic in parts and scary towards the end, I found it very true-to life and thought-provoking. The cinematography is shaky, the lighting is natural if dim in the pub scene and the scenery is realistic. While there was no incidental music, three pop songs played at the pub and the three young girls sang the Pizza Hut, KFC and McDonald's song. A lot of the scenes were drastic, especially the opening scene where the mother-of-four gets into a heated argument with another woman and the scene towards the end where the baby boy gets stung by a wasp in his mouth is scary because I am terrified of wasps. The mother was a perfect example of a bad parent who swears at or in front of her children, encourages them to 'flip the bird' towards the woman she argued with, neglects them and even shakes one of her girls violently for apparently not looking after the baby - this is bound to get the NSPCC all uppity. On a more positive note, this film made me think a lot in terms of how the family are dressed to represent their lower-class status, the use of lighting, the style of filming and its editing, which was more decent than the cinematography. I was surprised to have heard that this low-budget student film won an Oscar because films made this way are not usually Oscar-worthy. Overall this was a gritty short film with dark dialogue, shaky camera work, good if mostly cheesy pop songs (despite being a Steps fan) and a lot of thought put into it. 7/10.",
         "I hated this movie, I saw it at sundance and was surprised on how stupid it was, the story is about this poor British women and her fatherless family and how she meets a old friend from high-school/college and decides to go out with him. wow that alone makes this story sad, then to make it better she goes dressed as a hooker and well what do you know she ends up being to poor to afford dinner for her kids and gets them a cola, wow. Then at the end she starts to have sex with this guy as the kids are watching. What kind of mother is this? I mean I didn't buy this actor at all I found it stupid just plain stupid I've seen better work out of student work. Then there was a wasp that the baby son eats, this wasp is a CGI Flat load of garbage i didn't buy that the thing was real and it pulled me out of the all ready sad movie. Aside from the story, poor CGI, and cheap feel of the movie I'm sure there must have been some gem in there.",
         "This film was intense... I am feeling sad, very disappointed at the same time. These four children are living in a home where the only thing to eat is sugar, and that is because the only other thing to eat is moldy bread. They are very messy, dirty children, just looking at them in the beginning I am feeling disgust, and pity. But unfortunately this is the case in some households in the world, and it is unfortunate. This woman desperate for a social life? Now that doesn't seem fair to me, these kids are groaning and whining for some food, and this Zoe is spending the only money, the change she has, on beers in a pub. Leaving these kids outside, in a bar parking lot. They are left so she can talk to this ex-boyfriend, I am more disgusted at the characters at this point. But this film was amazing, the drama, and the reality of the characters in this film, the children everything was extremely realistic, and well played. Not too much music throughout the film, but that wasn't really noticeable now because I was so intrigued with the drama of the film. This was a great film.",
         "Just caught this on Channel 4 this evening. Like most drama, the thought at the front of one's mind is: \"This is just acting, albeit rather good.\" Unfortunately, I fear, this drama probably runs very close to the reality for many people. Ultimately the ending pulls back from where it could have gone and probably has done for others in similar situations but their is a real feeling of compassion for the mother in this situation and worry for her children. It's excellence exists in the accuracy of what it portrays - well worth a viewing.",
         "SPOILERS OK I saw this for free at a downtown LA showing, thought it was pretty good but not amazing as everyone else makes it out. First off I hated the shaky camera work and there is no reason to like the main character - at most you pity her but more likely you'll pity the kids because their mom is so negligent and mean. The first half of the movie doesn't really go anywhere or have much point other than to \"shock\" the audience and grab their attention. Once it enters the bar it picks up, but once the conclusion comes you're glad it's over. Yes there are good performances and it's unsettling but not really about anything. And the imagery is as subtle as a brick in a pillow hitting you in the face. Oh and one more thing which bothered me since this movie wanted a realistic and depressing tone: the wasp (which is clearly paralleled with the mother at various points since wasp = White Aanglo-Saxon Protestant and both are caged, dangerous, etc) which is attracted to the honey on the baby's face (by the way the CGI in this part is awful) doesn't kill the baby since it doesn't sting its mouth, HOWEVER, the fact that the baby ate honey means it WOULD die since babies can't digest honey/antioxidants albeit not immediately. Since the movie was trying to be realistic and a sad statement on single mothers, etc. you'd think someone would have thought of this, but instead it makes a happy ending as if apologizing for all the horrors the mom puts her kids through. Decent overall but nothing to write home about. 5/10",
         "After lamenting never having seen an Oscar winning - and probably an Oscar nominated short film - I chanced upon the Oscar sub section on The Short Of The Week website and found this one . Somewhat typically the first Oscar winning short film I have ever watched would also be one that I wouldn't instinctively like or watch - a British social realist drama probably made by the middle class who feel guilty about not being born in da ghetto and feel ashamed that they've never been the victim a fatal drive by and feel the need to do a fictional misery memoir . That said WASP is made by Andrea Arnold who did go on to have a mainstream career where as sadly most short film makers seem to end their short journey in to the cinematic world of directing a couple of obscure shorts and then disappear never to be heard of again . If nothing else if I watched WASP at least I could impress associates with a trivia question as in \" Name the Oscar winning film that Danny Dyer starred in ? \" All expectations were turned on their head by this short film . I did expect WASP to be something along the lines of victim culture to make the grief whoring Guardinistas feel good about themselves but this isn't in fact what it is . Interesting to see how different people on this page have interpreted it . I don't think politics comes in to it because of the focus of the audiences sympathies fall firmly on the children and not Zoe . Poverty is a terrible thing but many people can rise above it via strength of spirit in bringing up children in a very adverse environment . It's not just merely social economic environment that's causing problems for the children here but the p*ss poor parent skills of Zoe . The children are victims - Zoe is not end of . It's not often I get rather angry and feel great sympathy for characters in fictional films but WASP is one of those few films that has done to me recently . Add to this Danny Dyer starring in an Oscar film and you've got something remarkable . I can't however rate it more than a seven because it's depressing and I thought 7:35 IN THE MORNING deserved the Oscar",
         "Wasp was an alright film that complimented on the hardships of being a poor single mother with many kids and no direction in life. It seemed like the single mother cared for her kids but she was still young and you could tell that she wasn't yet ready to let go of her life before the kids. She would go places like bars and leave her kids outside of the bar unattended because she had nobody else to take care of them. she would really on her 8 year old to take care of her baby while she was partying. The over all life style of this mother and her children was just disgusting and was not good at all for kids to grow up in. It was better off for their kids to get taken away from her than for her to keep them because she would probably end up killing them."
      ],
      "genres": [
         "Short",
         "Drama"
      ],
      "productionCompanies": [
         "FilmFour",
         "UK Film Council",
         "Cowboy Films"
      ],
      "summaries": ["Zoë is a single mother who lives with her four children in Dartford. She is poor and can't afford to buy food. One day her ex-boyfriend drives by and asks her to go on a date with him. Scared that he doesn't want to go out with her, she lies and tells him that she is just babysitting the kids. This will be her first date in years."],
      "budget": 0
   },
   "movielensId": 167608,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": null,
      "directors": ["Andrea Arnold"],
      "runtime": 26,
      "movieId": 167608,
      "title": "Wasp",
      "mpaa": "",
      "actors": [
         "Natalie Press",
         "Danny Dyer"
      ],
      "imdbMovieId": "0388534",
      "originalTitle": "Wasp",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Zoë is a single mother who lives with her four children in Dartford. She is poor and can't afford to buy food. One day her old flame drives by and asks her to go on a date with him. Scared that he doesn't want to go out with her, she lies and tells him that she is just babysitting the kids. This will be her first date in years.",
      "tmdbMovieId": 44472,
      "avgRating": 3.7,
      "releaseYear": "2003",
      "numRatings": 5,
      "posterPath": "/tBgAbjaO2H6ZQofnMdzwa4u8ot5.jpg"
   }
}