{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt1668191",
      "video": false,
      "title": "Hunting Season",
      "recommendations": [
         30634,
         295748,
         30691,
         13296,
         60228,
         27953,
         52161,
         52162,
         48763,
         52668,
         89111,
         27275,
         26900,
         31402,
         31408,
         27952,
         57892,
         52147,
         52667,
         53325
      ],
      "backdrop_path": "/vhLZhN0mvGyPKtiG2qcIXfNLW5j.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ferman",
               "gender": 0,
               "credit_id": "52fe47d5c3a36847f814a9fd",
               "name": "Şener Şen",
               "profile_path": "/m8idLZ2icbHsSoic0L3PPQuGv6T.jpg",
               "id": 77349,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Battal",
               "gender": 0,
               "credit_id": "52fe47d5c3a36847f814aa01",
               "name": "Çetin Tekindor",
               "profile_path": "/gxrDmjHo2Y3ETgdLDrtM4VEKeGp.jpg",
               "id": 93389,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "idris",
               "gender": 0,
               "credit_id": "52fe47d5c3a36847f814aa05",
               "name": "Cem Yılmaz",
               "profile_path": "/umCWEe2xmnEMpRfAw6YecsJ9ZLQ.jpg",
               "id": 74376,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Asiye",
               "gender": 1,
               "credit_id": "52fe47d5c3a36847f814aa09",
               "name": "Melisa Sözen",
               "profile_path": "/gHaynB7kKmxcHbID1tsfclGy3L5.jpg",
               "id": 142784,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Hasan",
               "gender": 2,
               "credit_id": "52fe47d5c3a36847f814aa0d",
               "name": "Okan Yalabık",
               "profile_path": "/gulXqlFGMRnuiRugsbzM7twOWAM.jpg",
               "id": 121426,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d5c3a36847f814a9f3",
               "name": "Yavuz Turgul",
               "profile_path": null,
               "id": 109445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d5c3a36847f814a9f9",
               "name": "Yavuz Turgul",
               "profile_path": null,
               "id": 109445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570cc33092514136b90011b0",
               "name": "Gulengul Arliel",
               "profile_path": null,
               "id": 1604675,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570cc345c3a3684c0d001f18",
               "name": "Tamer Çıray",
               "profile_path": null,
               "id": 233168,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "570cc357c3a3684c0a002039",
               "name": "Ugur Icbak",
               "profile_path": null,
               "id": 1603206,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570cc36792514179510006b1",
               "name": "Ismail 'Niko' Canlisoy",
               "profile_path": null,
               "id": 1570716,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570cc376c3a3684c0a002043",
               "name": "Sirma Bradley",
               "profile_path": null,
               "id": 1604676,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570cc38792514108c4000509",
               "name": "Gülümser Gürtunca",
               "profile_path": null,
               "id": 575443,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "570cc3a6c3a3684c150021c6",
               "name": "Sertac Yuksel",
               "profile_path": null,
               "id": 1600456,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "570cc3d592514179510006c1",
               "name": "Yves Delforge",
               "profile_path": null,
               "id": 1600457,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "570cc3e99251411c17001648",
               "name": "Fatih Ragbet",
               "profile_path": null,
               "id": 1424569,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "570cc405c3a3684c0d001f3d",
               "name": "Meltem Baytok Topalakci",
               "profile_path": null,
               "id": 937592,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "570cc417c3a3684c0a00206e",
               "name": "Gareth Rhys Jones",
               "profile_path": null,
               "id": 295591,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "570cc435c3a3684bf9001eac",
               "name": "Mustafa Durma",
               "profile_path": null,
               "id": 1304692,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "570cc4479251416ce8001da2",
               "name": "Danton Tanimura",
               "profile_path": null,
               "id": 1441671,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "570cc45ec3a3684bf9001eb5",
               "name": "Burak Topalakci",
               "profile_path": null,
               "id": 1484470,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.108793,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 50737,
      "vote_count": 36,
      "budget": 0,
      "overview": "Veteran homicide cop Ferman (Şener Şen) and his hot-headed partner İdris (Cem Yılmaz) team up with rookie cop and anthropology major Hasan (Okan Yalabık) to investigate the murder of a young woman. The suspects include her conservative family, who might have killed her for honor, her drug-dealing boyfriend and aged billionaire Battal (Çetin Tekindor) who had taken the victim as his second wife.",
      "similar": [],
      "original_title": "Av Mevsimi",
      "runtime": 144,
      "poster_path": "/yqmDH5wWOQkbNHNxU6Lhcb6F3mK.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pro Film",
            "id": 75406,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fida Film",
            "id": 42712,
            "origin_country": ""
         }
      ],
      "release_date": "2010-12-02",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "The lives of three homicide detectives are turned upside-down during a murder investigation.",
      "adult": false,
      "homepage": "http://www.avmevsimifilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yavuz Turgul"],
      "runtime": 140,
      "synopsis": null,
      "writers": ["Yavuz Turgul"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt1668191/",
      "coverLink": null,
      "actors": [
         "Sener Sen",
         "Cem Yilmaz",
         "Çetin Tekindor"
      ],
      "reviews": [
         "As a writer and directer of many fine films, Yavuz Turgul should be quite happy with the results of Av Mevsimi. I don't speak much Turkish at all, but the film was easily understood since I'm a big fan of crime dramas and mysteries. This film does not disappoint. Cem Yilmaz was outstanding as he stepped into a more serious role which is quite rare. I beg to see him in more roles of this nature in the future. His talent exceeds even those of his US counterparts. Sener Sen is quite the actor as usual. It's always an honor to see him perform. A new face adding balance to the storyline was Okan Yalabik. Never to be considered a 'bumbling rookie', he merely provided an atypical side to the feature portraying a rookie struggling to find his niche in life. Outstanding film with much applause. My thanks goes out to my dear wife for taking me out for a day at the movies.",
         "Well, let me be brief. There are downsides but the overall movie is quite good. Especially the beginning was very well done. The acting was pretty good but the story was not as strong as it could be. At the middle of the movie, the reason of the murder was so clear that I must say it ruined the rest of the movie. They could add a twist at the end but they follow a straightforward story line and the movie ends exactly where you would expect. Apart from this, the movie fulfills the expectations. The soundtracks are quite nice, the cinematography is stunning, the atmosphere is given very well and the character development phase is pretty good. If you are bored of crappy Hollywood movies, this one is a quite nice alternative.",
         "First of all, any person would rate or comment on this movie should understand that Hunting Season is not a $100+ million budget movie, or even $10 million! These men had only $4 million to spend on every single detail. Even so, regardless its tiny budget comparing to many Hollywood movie, this one is much more better than numerous Hollywood made. Brilliant director Yavuz Turgul's Hunting Season is really a great alternative for those people looking for something different. Also, this movie puts best Turkish actors all together. If Sener Sen, Cem Yilmaz and even Cetin Tekindor were born in the US, they would be world famous actors, and no doubt Sener Sen would be awarded Best Actor Oscar more than once...",
         "Yavuz Turgul (the director) and Sener Sen (Ferman) are together again. When Yavuz Turgul literally enliven the Turkish Cinema with the movie Eskiya (The Bandit) in 1996, Sener Sen had proved how high caliber actor he is. Now, maybe due to too much expectation, we're a little bit put off by the flaws in the story line but still enjoyed the movie. If you asked me what saved the movie I would easily say that acting of Sener Sen and Cetin Tekindor (Battal). Speaking of acting, Cem Yımaz kind of pulled the role and doesn't look odd or incapable but he still has some work to do on this. The weakest point with the movie is the story itself unfortunately. Yavuz Turgul being both the writer and the director, obviously wanted to make an emotional movie (which always works with Turkish audience) but tried to wrap it with police flick clichés. I don't know if he sees that as his own way of directing; but after 14 years since Eskiya, we see same weak action scenes in Av Mevsimi. And there we can count many scenes that don't fit the bill; like the party scene where Cem Yilmaz signs or agony of the apprentice (played by Okan Yalabik) after each body they confront. But as I said when you are watching a murder and \"who is the murderer\" movie,you always questioning the plot naturally. While watching Av Mevsimi we had plenty of \"why\" and \"how\"s as well as \"hey give me a break!\" moments. Battal's fake marriage seems unnecessary and why \"he cuts the girl into pieces and then drops one hand on his way\" is an unsolved mystery... By the way this cut-off hand almost put into the camera the very beginning of the movie and it looked so fake that rise eye brows of some skeptic movie goers. So, Yavuz Turgul came up with a hard to buy story but has chosen the very best of the cast and high grade cam-work resulted an OK movie. Maybe I'm being a bit stingy with 6 points with the movie, but let's say this is a well deserved 6 than easy got 7.",
         "After many boring worthless Turkish movies Turgul made his latest masterpiece. Perfect story and storytelling, extra ordinary casting, wonderful photographing... Cem Yilmaz who is best Turkish Stand-up comedian shows us very ordinary Police officer with excellent acting. People who is waiting any joke from him during 2 hour may be disappoint. Sener Sen is also another Comedy player but after movie I am sure that no one will remember him as a comedy player. There is many word to tell about the movie. My writing skill in English is not enough to express my critics. Sorry. Finally I hope we will not wait long time for another Turgul Movie. Thank you Master Turgul",
         "Let me start with the pros as there are not much: 1- The cinematography is really beautiful, probably one of the best in the last decade of Turkish cinema 2- the direction is also very aptly handled with a particular eye for the details 3- the main concept is also intriguing, this is not your typical 'who did it' crime thriller with lots of red herrings thrown at you that leads to a twist at the end, instead this flick aspires to be a character study with some obvious influence from 'se7en' and 'zodiac'. But unfortunately the illogical script and the 'refined' dialogues makes this an utter failure. It was like watching the screenplay being recited, something which becomes unbearable after half an hour or something. The dialogues do not sound authentic at all, they are more like a translation from English. Just one example will suffice: The veteran homicide detective answers a call by the medical examiner saying: 'give me some good news' in Turkish, a phrase that I have never heard a Turk utter, ever. There are so many plot holes and unrealistic scenes (like small-time drug dealers with semi-automatic weapons shooting randomly at police... come on)but what is more frustrating is the lack of character development for a movie that presents itself as a character study rather than a mere thriller.We never really understand why f.e. our main character 'hunter' is indeed called hunter. It is said many times that he is a legend in the homicide department because; well, he hunts the killers and always catches them. But in this case he really never does anything. He spots a car that they are looking for from 10 meters and recognizes a 500000 $ worth shotgun after recently seeing it and in the remaining time wanders aimlessly and ask questions that lead to nowhere. The writing is not different for his partner 'deli' either. He actually shows no interest in the case throughout the whole movie, even being scolded by his boss, the 'hunter', for his lack of interest. But out of the blue this case-the very same case he never seems to take serious- becomes to be the last straw in his demise. So there is no point in assessing the cast because no one could really pull of some genuine acting given such pretentious dialogues and ludicrous screenplay. And the final scene where all the plot is dictated by monologues; well let me just say that: it is an insult to the intelligence of the viewers.",
         "For the Turkish audience, the movie is full of reactive scenes. Şener Şen and Çetin Tekindor acted awesome and cem yılmaz seemed that he can carry the role (but i think cem yılmaz must study hard for these type of roles). Yavuz Turgul's (director) story is full of dark corners that makes the movie a little weak. Also the some of crime clichés (like Çetin Tekindor's, bar actions, daughter/dad issue) make the movie weak. But Deli's (Cem Yılmaz) murder save the movie from clichés a little bit. At the end the movie is full of great performances, awesome dialogs and weak points. Personally i enjoyed the film and respect it. it made me either emotional or excited to the end of the movie. it is a exact 7 movie but it earns 8.",
         "This movie is an attempt to create a modern Turkish detective movie, which also aims to demonstrate a moody atmosphere. There's almost no Turkish detective movie to trace back that would help us to compare, so we can assume this movie tries to accommodate an approach. It's not an easy task, since our view is hugely affected by Hollywood movies. The movie indicates Turkish lifestyle, traditions, relationships and death. The very thing you might appreciate about this film is probably acting - but not the acting by minor characters. Cem Yilmaz, in particular, exhibits the most notable performance in this movie. Other major characters' performances vary from \"almost good\" to \"so so\". Minor characters' performances are generally \"below so so\" with some exceptions. While the plot is not the strongest aspect of this movie, the revealing of the story makes things a little more mediocre. You may even sense the atmosphere is crumbling beyond a point. Nevertheless, there are no unnatural absurdities, no unnecessary exaggerations and no forced heroes. Some of the nuances and references are amusing or interesting and they're enhancing the experience. The genre is somewhat new for Turkish cinema. What do I mean? First of all, expectations should not be high. And second, introducing a movie in an unexplored genre makes things interesting, makes it a different experience. Yes, there are so many better movies from Turkish cinema, from Yavuz Turgul or from this genre. But just don't keep your expectancies too high, you may actually enjoy this movie.",
         "Av Mevsimi (Hunting Season) is in certain terms as good as a production can get in Turkey: great cast, great cinematography, great sets, state of the art technology unfortunately though the great production could not be translated into a good movie. Yavuz Turgul is a masterful screenwriter, the best in Turkish cinema history for sure. He knows his mathematics very well. He was time and again proved this since Muhsin Bey. There is no hole in his scripts which is impossible for other Turkish films and scripts that contain more holes than swiss cheese. Mr Turgul has had the self made fortune of collaborating with Sener Sen for over 30 years now! Sener Sen has not appeared in any movie that was not written by Turgul. Hopefully after this his mind will change. Because as masterful as Mr Turgul is with script mathematics he is just as unimaginative and lacks creativity when it comes to tuning that mathematics with great story lines, engaging characters and witty developments. Unfortunately he keeps repeating himself and regardless of whether he is writing about an old time bandit (eskiya), a teacher who has returned to his Istanbul home after years at Anatolia outskirts (gönül yarası), a Mafioso who still embraces old ethic codes like a samurai (kabadayı) or as with this picture about a forensic chief he is depending on the same main character and similar web of story lines. Every main character Mr Turgul created since Eskiya have been the same and unfortunately he alone has access to Turkey's tour de force actor Sener Sen. The acting and directing in the movie has been the most disappointing aspects of the picture for me: at times the acting is raw, at times authentic and at other times comical (Çetin Tekindor's delivery of last lines). The Turkish media and critics that is composed of a few monkeys scratching each other's back and never writing anything bad about bad movies made by influential people has of course spoken of this picture too as a 'masterpiece'. Unfortunately it is not! Especially the acting of Cem Yılmaz, a loved persona by myself too, doesn't get better than any of the characters from Turkish police TV series such as Arka Sokaklar. The storyline never gets interesting or clever. At an age when CSI and similar TV series are putting such emphasis on the storyline, Hunting Season manages to be as interesting as an episode of CSI NY, and nothing more. Compared to Millennium Trilogy it is a movie for people who have no idea about the genre. The music selection was good but Mr Turgul has for the first time agonized me with his use of music as a mood pusher. The music always makes itself more than apparent! Which is very sad as the use of music has always been one of Mr Turgul's strenghts. Editing and the overly washed light footage are other inconsistent elements of the movie. At times the editing reminds one of Svankmayer's pieces: creating an alter persona through blurring of images and movement of the camera close to the face however this (as with Tekindor's last scene) makes the movie more comical than anything! The worst aspect yet of the movie was the unnecessary voice over! If anyone catches the meaning of that voice over please explain as all it did was push feelings down the throat of the audience in arabesque ways and it didn't even have a finely tuned closure. 5 stars for what Mr Turgul means to Turkish Cinema and regardless of how disappointing he has been still the contribution Cem Yılmaz will have to the same art.",
         "Well, to be honest I was expecting much more of this from Yavuz Turgul, after Gönül Yarası and Eşkiya. Besides some certain wrong connotations and wrong ways of acting, the movie's overall fluctuating search for a rhythm make me said this. What you expect from a police thriller is tension and curiosity, but I've lost both in the middle of the movie. The story of the homicide policemen took its place in the core, and I forgot the story of late Pamuk. The good part of the movie was its uniqueness, while Turkish cinema followers are not familiar to watch such genre in Turkish Cinema. I hope it'd be a good start and the level goes up every time. For Turgul, I hope there will be another masterpiece in two years. For Sener Sen, there is not much to say, however in the start the preaching part seems so artificial, it seems Sen is reading from a prompter, but for the rest, he's the best. Cem Yılmaz is still striving to become an actor, but he's done a good job also, especially the sad moments. For the rest of the cast, there seems not so brilliant acting to me. In conclusion, the movie is worth watching for Sener Sen and for its being unique for Turkish Cinema. And if you want to enjoy it more, forget it's a Yavuz Turgul movie, than you'll expect less. Best Wishes",
         "Well where to begin? If this film wouldn't have so much flaws. It would be average at best. I mean the cinematography isn't breathtaking or great as some other reviews described. The shots where pretty simple and nothing really original was done to take it to a higher level. The story is pretty standard, just because it was thickened a bit with an insight of the personal lives of the main characters doesn't make it a better story, on the contrary. From the beginning one could tell that there wasn't much budget to make this film. The film begins with a cheap looking title sequence, that is, if your used to the wonderful designed (Hollywood) titles at the beginning of films. Okay this is one thing that can easily be overlooked though. Than the film starts with the finding of an arm that has been cut off. And this arm unfortunately looked too plastic. It just didn't look real. And then when the unnecessary voice-over kicked in, I knew it would be a long sit. And I was right. What bothered me the most was that there wasn't any balance in this film. Was it trying to be a (black) comedy of some sort? A family drama? A crime thriller? It tried to be all of it at the same time and failed miserably. One of the worst mistakes stories/films can make is not able to make any choice at all. This was one of those stories. SOME SPOILERS AHEAD For example: the character of Cem Yilmaz brought numerous times too much of his comic acting in his role as if the director just let him do what he always does and play some sort of a comical character. This comical effect was made even greater by the suddenness of it. Like at one point the characters being at a stakeout one moment and tension is being build up and another moment the characters are in some sort of a 'A-team' cowboy shootout. Where the 'bad'guys are spraying Uzi machine guns around. Another moment where one could tell that Cem Yilmaz was definitely miscast was when his character was dying and people in the theater actually started laughing as if he where going to say or do something funny in the process of it. Another thing that really annoyed me was the pace of the film. I mean, why did the film had to drag on for an hour more if the plot was already revealed after 90 minutes or so. But no, instead of wrapping it up, they choose to let it drag and drag as if the ending would be such a surprise. All the insights in the personal lives also seemed unnecessary it just seemed too forced or too much. And the whole rookie part could've better been left out. In the end his character seemed to insignificant. Insignificant also was the voice over which had absolutely no function and made the film even more cliché. MORE SPOILERS AHEAD Other things that really bothered were plot holes like: Cem Yilmaz' character who goes to his ex with plans of (maybe) killing her and then when he sits on the couch right in front of her, he gently, but very clearly pulls out a gun and holds it next to him and she (acts) as if she doesn't see the gun... YEAH RIGHT. And then all of a sudden when he is about to pull the trigger, the electricity is cut off. (oh what a coincidence). Or another thing: they go to a doctor to get some information and ask the guy a couple of questions. The doctor answers that he absolutely cannot give them any information, it's supposedly classified. So then they ask, 'okay then give us the address of the previous doctor that can give us all the information we want'. And of course the address is given. Then when they enter the home of the other doctor the guy sits on a couch with his hand under a pillow. Was he sitting there on that exact spot for a week or so waiting for people? And then he pulls out a gun from underneath the pillow and kills himself. Then next to him they find a PC with an application open which has the all the information on it to solve the whole case. Or one more thing: a very clear footprint and tire mark side by side at the crime seen, which belongs to a billionaire who himself try to get rid of a body. As if he doesn't have people that does his dirty jobs? These things occurred throughout the whole film. The only decent performance was from Sener Sen and Cetin Tekindor. As one would expect. I'm sorry but I absolutely cannot recommend this film to anyone. Especially those who have seen TV shows like Law and Order and CSI. Because even those TV shows are better written. Or better yet just watch Mystic River, Zodiac, Seven, Lovely Bones or even The Chaser if you want to see a film with similar themes but far better executed.",
         "The movie is set in one of the Homicide Dept.in Istanbul, and we have three homicide detectives as leads and each of them represent 3 different eras. Those leads are Sener Sen, Cem Yilmaz and Okan Yalabik. They play their parts considerably well, and we have great director Yavuz Turgul which altogether is a great promise. But that promise is never fulfilled by the weak plot of the movie. We see the crime and we see the clue right in the middle of the movie. That clue ruined me the better experience which movie was promising in the beginning. Cem Yilmaz' acting was good but sometimes felt that he was overacting. Still his versatility stuns us. Sener Sen was great as always in such underwritten role. He plays so easily and creates truly believable character. Okan Yalabik doesn't shine as a rookie cop, but still shows some potential. Cetin Tekindor is great as a main antagonist. But as I said before movie fails to keep its promise due to its weak and predictable script. Overall the movie is OK for a one-time watch",
         "Too obvious flow of events should have been compensated with psychological depth in characters, too dramatic and over verbalized dialogs didn't sound convincing at all, even though Turgul's language is not up to date and too plastic at times , fair drama quality prevails as always, some very powerful scenes, despite the unnecessary length of scenes performances of all actors will make it worth watching Director of photography did a very good job! sound editing is not extra ordinary but delivers the needed quality. Funniest Turkish stand-up comedian , cartoonist, director Cem Yilmaz once again stretching as an artist and totally rocking his 'not' funny but troubled personality of Idris i strongly advice Tugrul's true master piece...a milestone of Turkish cinema 'Eskiya' (1996 ) with his favorite actor Sener Sen",
         "Perfect acting, perfect musics, perfect story. Before everything it's have best atmosphere in Turkhis movies. It's so funny and same time so sad.",
         "Like the other great Turgul & Şen movies Eşkıya, Gönül Yarası and Kabadayı; Av Mevsimi (hunting season in English) has already enrolled to most Turkish people's favorite movies list. No one can disagree that Şener Şen is today's best actor in Turkey and has become a legend. Besides his wonderful performance, the contributions from Cem Yılmaz and Çetin Tekindor (he is a great actor too!) made this film unforgettable. Cem Yılmaz, whom we are familiar with stand-up shows, proved that he can be serious if he wants. Especially, Cem Yılmaz was outstanding where he and Çetin Tekindor were in a battle royal. Melisa Sözen, who played the only important woman role, saved the movie from being a men's movie. We are looking forward to see new Turgul & Şen movie, please do not make us wait too long!",
         "A hand of a female girl happens to appear at the woods. The senior officer along with his partner in investigation appear at the site along with a newbie. Investigation progress along with the personal life's of the the three investigators. The movie goes through some magnificent personal trauma. The rest is , will they find the rest of the body and catch the murderer and lock him up. Performance wise sener sen is fabulous along with cemal hunal. Great cinematography and whole total good predictable and dramatic thriller to watch. Director cagam imrak has given a wonderful movie to watch. Especially at the climax scene where the chief meets the culprit ,they take a walk and revels the entire crime. The dialogues are meanted carefully in order to suite the situation.",
         "This is the film that Yavuz Turgul's works in the police style this time, always having problems such as social transformation, development, decay. In the film, Şener Şen plays a well-intentioned, brave-hearted, sensible, disturbing character as it was in his previous films. The most serious conflict of the av season is between the idealist police officer ferman (şener şen), the business man who came from Adana and later became wealthy, Battal bey (tough tekindor). This is a conflict we are accustomed to seeing in the cinema of yavuz turgul. Eşkiya Movie (baran and berfo) and Muhsin Bey Movie (Muhsin Bey and Laz Nurettin). Yavuz turgul used the detective style only as a backdrop. Main theme, social events, rich - poor - middle class morality (if any). Is a middle-class man who is often oppressed in his films. Because what we call 'morality' is a value of the middle class. The moral definitions of upper and lower classes are very variable. The film ends with a sad optimism as if it were in other turgul movies; Justice has been partially found but many lives and values ​​ have been lost.",
         "This movie has lots of flaws in it but not as much to overlook it. Before doing his own thing, director Yavuz Turgul should consider the viewers' expectations too. The ways he tries to tell the story, seem to most viewers as mistakes, whereas they're just his ways of telling the story.(SPOILER AHEAD: like revealing the sick girl very early in the movie, which also reveals the reason of the killing. When I saw the sick girl in her bed, I personally thought of organ transplantation immediately, and eliminated this idea because it was too early. But then the plot was obvious) You could see this movie solely for the following reasons: -Sener Sen, a living legend, is the leading actor.(despite his acting is far from his best, its always a privilege to watch him act. God bless you Sener Sen, I have a whole life to see you act) -Cem Yillmaz at his best. The man really does it. Gotta see it for yourself. -Fluent and very fun to watch. Really. You'll laugh deeply at times, which is unexpected from a crime movie, yet this doesn't affect the dark side of the movie. This movie could've been much better but, better worst than none."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Fida Film",
         "Pro Film"
      ],
      "summaries": [
         "Veteran homicide cop Ferman (Sener Sen) and his hot-headed partner Ydris (Cem Yilmaz) team up with rookie cop and anthropology major Hasan (Okan Yalabik) to investigate the murder of a young woman. The suspects include her conservative family, who might have killed her for honor, her drug-dealing boyfriend and aged billionaire Battal (Çetin Tekindor) who had taken the victim as his second wife.",
         "The lives of three homicide detectives are turned upside-down during a murder investigation."
      ],
      "budget": 4000000
   },
   "movielensId": 167710,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2010-12-02",
      "dvdReleaseDate": null,
      "directors": ["Yavuz Turgul"],
      "runtime": 144,
      "movieId": 167710,
      "title": "Hunting Season",
      "mpaa": null,
      "actors": [
         "Şener Şen",
         "Çetin Tekindor",
         "Cem Yılmaz",
         "Melisa Sözen",
         "Okan Yalabık"
      ],
      "imdbMovieId": "1668191",
      "originalTitle": "Av Mevsimi",
      "genres": [
         "Mystery",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["eydSBypk684"],
      "plotSummary": "Veteran homicide cop Ferman (Şener Şen) and his hot-headed partner İdris (Cem Yılmaz) team up with rookie cop and anthropology major Hasan (Okan Yalabık) to investigate the murder of a young woman. The suspects include her conservative family, who might have killed her for honor, her drug-dealing boyfriend and aged billionaire Battal (Çetin Tekindor) who had taken the victim as his second wife.",
      "tmdbMovieId": 50737,
      "avgRating": 3.4375,
      "releaseYear": "2010",
      "numRatings": 8,
      "posterPath": "/yqmDH5wWOQkbNHNxU6Lhcb6F3mK.jpg"
   }
}