{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt4685554",
      "video": false,
      "title": "The Snow Queen 3: Fire and Ice",
      "recommendations": [],
      "backdrop_path": "/AvlUZEQIbQbk6kME4pbisKPh9oo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "589ca396925141088c000344",
               "name": "Natalya Bystrova",
               "profile_path": null,
               "id": 1754208,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "589ca3e7c3a368116500030f",
               "name": "Filipp Lebedev",
               "profile_path": null,
               "id": 1754215,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "589ca402925141089500039d",
               "name": "Diomid Vinogradov",
               "profile_path": null,
               "id": 1754218,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "589ca419c3a3681158000331",
               "name": "Aleksandr Gruzdev",
               "profile_path": "/7Lvc2OcyDObGjyNTiNjc6aZEQGX.jpg",
               "id": 1122042,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "5a533b4892514113220302f8",
               "name": "Olga Zubkova",
               "profile_path": null,
               "id": 1899175,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "5a533b66925141132e02f7a0",
               "name": "Nikolai Bystrov",
               "profile_path": null,
               "id": 1899179,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "5a533b790e0a260272031b8a",
               "name": "Vsevolod Kuznetsov",
               "profile_path": "/qkFm9mlVPnqoHzsBl2U6lhpZkCv.jpg",
               "id": 1117937,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "560b8b90c3a36868140051a3",
               "name": "Aleksey Tsitsilin",
               "profile_path": null,
               "id": 1404563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "560b8b9fc3a368680b004c20",
               "name": "Aleksey Tsitsilin",
               "profile_path": null,
               "id": 1404563,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "560b8bb0925141719c004b49",
               "name": "Robert Lence",
               "profile_path": null,
               "id": 958881,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "560b8bc1c3a3686819004bbc",
               "name": "Yuriy Moskvin",
               "profile_path": null,
               "id": 1516779,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 4.23455,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 362058,
      "vote_count": 5,
      "budget": 0,
      "overview": "After heroically defeating both the Snow Queen and the Snow King, Gerda still cannot find peace. Her dream is to find her parents who were once taken away from them by the North Wind and finally reunite the family. Thus, Gerda and her friends embark on an exiting journey to find her parents and encounter new challenges along the way: they discover an ancient magical artifact of the trolls, the Stone of Fire and Ice. From that moment on, things don't go according to the initial plan...Will Gerda be able to tame the mighty forces of the magical elements and get her family back? The answer will be reveled in 2016. This is a story which encompasses everything you love about Wizart: kindness, bravery, friendship, mystery, love of one's family, and a happy ending, of course!",
      "similar": [],
      "original_title": "Снежная королева 3. Огонь и лед",
      "runtime": 80,
      "poster_path": "/fewzNvOFM4TBcuOwsfGXyIUrwS2.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wizart Animation",
         "id": 46315,
         "origin_country": ""
      }],
      "release_date": "2016-12-29",
      "vote_average": 8.8,
      "belongs_to_collection": {
         "backdrop_path": "/S53UcTvYXmfwNm5dOqXu6yMbuN.jpg",
         "name": "Snow Queen Collection",
         "id": 374930,
         "poster_path": "/r2ONwf2TcKULpPAEpqfOAK2bgXi.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": "RUR ",
      "directors": ["Aleksey Tsitsilin"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Andrey Korenkov",
         "Robert Lence"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt4685554/",
      "coverLink": null,
      "actors": [
         "Dee Bradley Baker",
         "Lori Gardner",
         "Devin Bailey Griffin"
      ],
      "reviews": [
         "The Snow Queen sequel even exceeded all my expectations! I think that the third movie is much better than the second one. After the spin- off about Orm, it was great to see Gerda as a protagonist again – it was especially nice to see how much her looks have changed. She has noticeably grown up and is truly about to rank among Disney's gorgeous princesses. As for the screenplay, Robert Lence was involved in the process of its creation – he is a real master of the American animation and he has worked on dozens of large projects. The results of this collaboration are easy to see: the movie has acquired a good pace and the alternation of lyrical pauses and breath-taking action is done really well – you will surely neither get bored with nor get tired of the movie! The authors tried to tell us how valuable one's family is and that the most important thing in life is having someone to be there for you when your life gets hard. The movie also says that you should never just throw people out of your life and it is never too late to say sorry. The animated movie has plenty of complicated scenes with various visual and sound effects. You can see avalanches going down the mountains, explosions, volcano eruptions, lava leaking through all the cracks, multicolored magic bursts, an armored train of the purest ice, a ship put on skis. Quite a lot of views worth seeing! I really enjoyed the movie and I wish you to enjoy it too!",
         "This is 'the' worst animation movie I have ever seen. No particular Story/Plot, No Direction, Horrible Script, no coordination between the dialogues and the animation, to top it all Bad Music.. all the basic ingredients for an animation movie missing! I do not know what was the motive behind making this movie. There should be a serious quality check for such movies being produced and marketed. It was a mix of haphazard colored animated scenes with no correlation or story to tie them up.The characters within the movie have no context or place within the loose plot and just keep appearing once a while without a particular agenda. This is a No Watch! Keep Away!",
         "The first Snow Queen story by the Russian animated studio Wizart came into being in 2012. Now, in four years after the first premiere, we can see colossal evolution of the Russian animation. The graphics and the characters clean-up have improved – now we see brighter colors, more interesting costumes, and more scenic locations. Of course, there is nothing left of the initial story of Kai and Gerda, children living next door to one another, from Hans Christian Andersen's fairytale. The teenagers from the new story have grown up, acquired more difficult tempers, lost their parents, but gained a huge experience in the show business. Then, as one would expect, the brother's and the sister's paths separated. She, like any girl, chose to follow her heart as well as the new guy called Rollan, whereas Kai became an animated downshifter – a pirate artist. Both the family division and excessive curiosity placed the whole Troll Country under a threat. It is worth mentioning that the participation of the Hollywood screenwriter Robert Lence and the Comedy Club show stars turned out very useful – the movie became funnier but sometimes, like in all Russian masterpieces, this went a little bit too far. It should also be pointed out that the Russian animation is becoming interesting abroad too: releases in Korea, Bulgaria, Turkey and countries of the Middle East are planned for the beginning of 2017. I would like to wish successful distribution to The Snow Queen and a great enjoyable time watching the movie – to the audience.",
         "Traditions mean a lot to Russia. There aren't many of them, but each is very warm and cozy. That's how, back in 2012, the first Snow Queen animated movie appeared – it won children's hearts at once as well as made adults believe in magic and hope to see its sequel\u0085 Time passes\u0085 So, at the end of 2016, the third instalment of the franchise was released already. Some people anticipated it, others were a bit worried – as we're always a little afraid to get disappointed in something we like. Fortunately, that didn't happen but let's start from the beginning\u0085 There's no point in re-telling the plot, as a lot of people have already seen the movie or read other reviews. I'd rather share my impressions and emotions with you instead. What I liked most of all was the fact that the characters had grown up, they encountered problems that I think everyone does encounter, and faced a really hard choice between good and evil. I think I needed more drama and the characters' inner feelings, but the image itself compensated really well. The audience watches its bright colors and fantastic nature sceneries during the whole movie length, so I caught myself thinking that I wouldn't have guessed that The Snow Queen 3 is a Russian movie if I hadn't known it in the beginning. I'd like to mention the music separately. The soundtrack is very positive and stays in your head for a long time after you've left the movie theater. In short, I'd recommend the movie to those who wants to keep their New Year and Christmas mood going for longer, to have a good time, and just to get absorbed in the world of magic fairy tales.",
         "The movie was excellent and the theme as nice. Its good to see other studios outside Pixar and Disney. I genuinely liked the art style of the movie. The movie had interesting mixture of comedy and action and a fiery ending with a big battle. I wish the movie had more Slavic characters.",
         "Being the third part of Snow Queen franchise The Snow Queen 3: Fire and Ice has gained and improved its own graphic style and has gotten better in visual effects. I really enjoyed the fantastic scenery the story developed in, all those mountain gorges, snow avalanches, volcano eruptions, a pirate ship skiing in magnificent landscapes and a train made of ice. The thing I also liked is that although being a sequel The Snow Queen 3 is independent from other parts and if you haven't watched the previous ones it is not a problem at all. You can start watching this part and enjoy it not knowing the previous stories. As for the message of the animation the story tells about vital things: the importance of being a family, the choice everyone makes between good and evil and that everyone should treasure their relations. These themes are important for our children and it is good that animated feature films touch these things in their plots. The final fight scene is very impressive and the evil has been defeated. As for the weak points the thing I lacked is some well memorized and catchy song although the music of The Snow Queen 3 is impressive.",
         "MINOR SPOILER ALERT. It's really funny how someone can comment on how bad a movie is, yet most probably couldn't film one to save their lives.I would personally disregard any negative review about this movie. I quite enjoyed the animation as much as some of the story line could have been more intense or detailed. This sequel had a few comparisons to the Disney movie, Frozen but as I previously stated the story line could have been handled a little bit better and some of the animations could have been a little bit tidier. Aside from all of that, the movie is quite captivating."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": ["Wizart Animation"],
      "summaries": ["The rare gift of getting into all kinds of trouble is their family trait. What else can you expect from the ones raised among trolls in snowy lands? But now Kai and Gerda have grown up and entered a new stage - this time they are going to cause a global disaster..."],
      "budget": 975000000
   },
   "movielensId": 167700,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2016-12-29",
      "dvdReleaseDate": null,
      "directors": ["Aleksey Tsitsilin"],
      "runtime": 80,
      "movieId": 167700,
      "title": "The Snow Queen 3: Fire and Ice",
      "mpaa": null,
      "actors": [
         "Natalya Bystrova",
         "Filipp Lebedev",
         "Diomid Vinogradov",
         "Aleksandr Gruzdev",
         "Olga Zubkova",
         "Nikolai Bystrov",
         "Vsevolod Kuznetsov"
      ],
      "imdbMovieId": "4685554",
      "originalTitle": "Снежная королева 3. Огонь и лед",
      "genres": [
         "Family",
         "Animation",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["2uaGC9twH0Y"],
      "plotSummary": "After heroically defeating both the Snow Queen and the Snow King, Gerda still cannot find peace. Her dream is to find her parents who were once taken away from them by the North Wind and finally reunite the family. Thus, Gerda and her friends embark on an exiting journey to find her parents and encounter new challenges along the way: they discover an ancient magical artifact of the trolls, the Stone of Fire and Ice. From that moment on, things don't go according to the initial plan...Will Gerda be able to tame the mighty forces of the magical elements and get her family back? The answer will be reveled in 2016. This is a story which encompasses everything you love about Wizart: kindness, bravery, friendship, mystery, love of one's family, and a happy ending, of course!",
      "tmdbMovieId": 362058,
      "avgRating": 2.22222,
      "releaseYear": "2016",
      "numRatings": 18,
      "posterPath": "/fewzNvOFM4TBcuOwsfGXyIUrwS2.jpg"
   }
}