{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "serial",
         "id": 197161
      }],
      "imdb_id": "tt0036262",
      "video": false,
      "title": "The Phantom",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Godfrey Prescott / The Phantom",
               "gender": 2,
               "credit_id": "575a47fac3a36807540004a4",
               "name": "Tom Tyler",
               "profile_path": "/9NHCjVNUuZTfjk3qFrkU6FLfrRR.jpg",
               "id": 14970,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Bremmer",
               "gender": 2,
               "credit_id": "575a48a992514128fa00048f",
               "name": "Kenneth MacDonald",
               "profile_path": "/mSazc1OJi4sONSoX38KPRUtFNja.jpg",
               "id": 103357,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Professor Davidson",
               "gender": 0,
               "credit_id": "575a48c4c3a3686ad80007ad",
               "name": "Frank Shannon",
               "profile_path": "/bjFTK68u4TKyoQmf7Kae0pHsR4K.jpg",
               "id": 33362,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Diana Palmer",
               "gender": 1,
               "credit_id": "575a482692514128780004b9",
               "name": "Jeanne Bates",
               "profile_path": "/lHrwjoC9K970j1uet252Ti3LBaD.jpg",
               "id": 14796,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "575a490ec3a3686ae2000839",
               "name": "B. Reeves Eason",
               "profile_path": null,
               "id": 99463,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "575a492b92514128780004fe",
               "name": "Rudolph C. Flothow",
               "profile_path": null,
               "id": 34800,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575a49ea9251412878000520",
               "name": "Morgan Cox",
               "profile_path": null,
               "id": 32177,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "575a49fdc3a3680b35000484",
               "name": "Victor McLeod",
               "profile_path": null,
               "id": 196264,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "575a4a12c3a3680ba800049a",
               "name": "Sherman L. Lowe",
               "profile_path": null,
               "id": 88726,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "575a4a2092514128a30004e1",
               "name": "Leslie Swabacker",
               "profile_path": null,
               "id": 1081105,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.001202,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 401461,
      "vote_count": 0,
      "budget": 0,
      "overview": "Two expeditions are trying to reach the Lost City of Zoloz -- one headed by Professor Davidson, a scientist who wants to establish an archaeological site, and the other by a greedy treasure hunter who wants to keep the fabled treasures of the city for himself. An agent of a foreign power also wants to establish a secret airbase there, so he stirs up the natives against The Phantom, who has been able to get them to stay peaceful so far. When The Phantom is murdered, his son takes his place and sets out to restore peace to the jungle and stop the agents' and the treasure hunters' nefarious plans.",
      "similar": [
         1803,
         11423,
         29082,
         384395,
         225503,
         108253,
         199960,
         142054,
         333435,
         282336,
         443274,
         333180,
         342489,
         495590,
         174098
      ],
      "original_title": "The Phantom",
      "runtime": 299,
      "poster_path": "/ogq2s80Jty2Ogr6OjbpgNWgfse8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1943-12-24",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "The most fantastic...most exciting serial ever made!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["B. Reeves Eason"],
      "runtime": 299,
      "synopsis": null,
      "writers": [
         "Morgan Cox",
         "Victor McLeod"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036262/",
      "coverLink": null,
      "actors": [
         "Tom Tyler",
         "Jeanne Bates",
         "Ernie Adams"
      ],
      "reviews": [
         "\"The Phantom\" is one of the better serials released by Columbia Pictures. It benefits from the casting of Tom Tyler in the lead role. Tyler had previously played a comic book hero in \"The Adventures of Captain Marvel\" (Republic-1941) and was physically suited for the role. Tyler kept himself in good shape and didn't look out of place in the Phantom costume. Although he primarily played in westerns, ironically, it is for these two serials that he will probably be best remembered. The \"run through the jungle\" story has Professor Davidson (Frank Shannon) and his daughter Diana (Jeanne Bates) searching for the Lost City of Zoloz and the hidden treasure therein. Their efforts are being thwarted by Singapore Smith (Joe Devlin) who wants the treasure for himself. Kindly Dr. Bremmer (Kenneth MacDonald) an apparent foreign agent, is trying to destroy the peace among the natives, which had been controlled by the Phantom, to build a secret air base. Geoffrey Prescott (also Tyler) who is Diana's fiance succeeds his father as the Phantom when the older man is murdered. Even though the Phantom wears only a small eye mask to cover his face, in true serial tradition, no one including Diana is able to recognize him. Over the course of the 15 chapters, the Phantom escapes death from explosions, poison gas, avalanches, a collapsing rope bridge etc. etc. With the help of his trusty dog Devil the Phantom is able to overcome the villains and again bring peace to the jungle. Although the serial gives billing to only Tyler and Bates there are several other familiar faces (other than those already mentioned) in the cast. Ernie Adams plays Rusty, the Phantom's ally, Dick Curtis a Tartar Chief and Anthony Carouso, George Chesebro, Wade Crosby, Edmund Cobb, I. Stanford Jolley and Kermit Maynard as varios henchmen. And watch for a brief appearance by Jay Silverheels in chapter 9 as an Atari warrior. Director B.Reeves Eason keeps the action moving and tries to come up with new twists on the chapter ending cliff hangers. The VCI DVD has restored the serial to its original brilliance although some dialogue sequences had to be re-dubbed due to the deterioration of the original soundtrack. \"The Phantom\" certainly has to rank as one of the top 5 serials of all time.",
         "When I was a kid, `The Phantom' was my hero number one. I liked also the magazines of `Mandrake', `Superman', `Batman', `Tarzan' and `Zorro' (in this sequence), but I would not dare to compare any of them with `The Phantom'. For my surprise, the Brazilian distributor `Classicline' released an unknown (at least for me) 1943 version of a serial of `The Phantom', in a double DVD without any extra. The story is composed by fifteen episodes as follows: 1) The Sign of the Skull (`O Sinal da Caveira'); 2) The Man Who Never Dies (`O Homem Que Nunca Morrre'); 3) A Traitor's Code (`Um Código de Traidor'); 4) The Seat of Judgement (`O Banco de Julgamento'); 5) The Ghost Who Walks (`O Fantasma Que Anda'); 6) Jungle Whispers (`Sussuros da Selva'); 7) The Mystery Well (`O Poço do Mistério); 8) In the Quest of the Keys (`Em Busca das Chaves'); 9) The Fire Princess (`A Princesa do Fogo'); 10) The Chamber of Death (`A Câmara de Morte'); 11) The Emerald Key (`A Chave de Esmeralda'); 12) The Fangs of the Beast (`As Presas da Fera'); 13) The Road to Zoloz (`O Caminho Para Zoloz'); 14) The Lost City (`A Cidade Perdida'); and, 15) Peace in the Jungle (`Paz na Selva'). The plot begins with the death of the `old' Phantom and his son (Tom Tyler) assuming his spot with his dog Devil (Capeto, in Portuguese). Meanwhile, there are two expeditions trying to reach the lost city of Zoloz: the good one leaded by Professor Davidson (Frank Shannon), with his daughter Diana Palmer (Jeanne Bates) in the team, having the intention of archeological research for an university in Melville. The evil one leaded by the diabolic Dr. Max Bremmer (Kenneth MacDonald), who is serving a foreign country, and having the intention of building a hidden airport. The foreign nation is not specified in the story, but in 1943, there were the World War II in Europe, therefore it is not difficult to guess which power Dr. Max Bremmer was serving. For reaching his intent and find the city of Zoloz, Prof. Davidson has a partial map composed of six ivory pieces, needing the last one to complete the track. The story follows the pattern of action movies of those romantic times: the hero never bleeds; the villains use the most complicated ways and tricks to get rid off the hero; in the end of each chapter, there is a missing scene, where the hero escapes from a dangerous situation (explosions, gas, avalanche of stones, fire, water, shot etc.); the heroin always screams when in danger; when a porter dies, nobody cares. Further, it is politically incorrect in the present days, having an animal hunter as Phantom's best friend. This naive type of story may be silly in the present days for the younger generations (and indeed it is), but it brings parts of my childhood back to my mind, and consequently I love it. The athletic actor Tom Tyler is in an excellent shape. I have no idea whether stunts were much used in 1943. My vote is nine. Title (Brazil): `O Fantasma' (`The Phantom')",
         "I write my observations after seeing the 1996 version, followed by the 2010 SyFy Phantom production. I can say with confidence that the 1943 version was far ahead of its times and pretty authentic, compared to the later versions. The fact is that in 1943, a nifty Phantom movie serial could be made, using the most primitive tools and technology (as compared to today's standards), but today's producers find it so difficult to stick to the basic canons of the Phantom mythos and make changes in almost everything, (except perhaps the name of the Phantom). Today's producers need to study this vintage production first, before venturing out on their own. Some of my reasons are below: 1. The Tom Tyler series had a tight script, focused plot and minimal deviation from whatever mythos had been built up by Falk by that time. In a 1940s scenario, with the backdrop of WW II, limited budget, no special effects, no color, no CGI and no trained wolves, the series was the most faithful portrayal of the Phantom we can hope for. Swabacker and Cox can be excused for not showing the Bandar, because the mythos was not so well developed or well known in 1942, but can Boam be excused for declaring right at the start of the 1996 film that the Touganda tribesmen rescued the first Phantom (as a child), when it was actually the Bandar, enslaved by the Wasaka, who rescued the first Phantom, when he was already a grownup? 2. Sai Pana was perhaps the precursor of Morristown; The Tonga village was perhaps the precursor of the Deep Woods. The name, Walker, was perhaps first mentioned here, although I am not sure. How much did Falk pick up from this series? We may never know. 3. Tom himself was cool, muscular and impressive, without spandex; his outfit was a faithful representation of the Phantom's costume. His eyes could be seen, but once he took over as the 21st Phantom, he stopped showing his face. And of course, there were none of the silly grins or wisecracks. Nor did a biker's suit and helmet replace the Phantom's costume, like in the latter day SyFy production. 4. Jeannie was a better Diana than Kristy; No scowling or muttering. She was feisty and expressive as Diana has always been shown to be. 5. Ace, the Wonder Dog as the talented Devil was better than the mangy wolf of the 1996 film; the woods in outskirts of Hollywood were impressive; no exotic locations were required. 6. The 20th Phantom was depicted as old but tough and impressive, by Sam Flint. There was no need to depict him as a doddering old fool, as portrayed by McGoohan in 1996. 7. Of course, the plot was racy, believable and fun. The viewer's intelligence was not sorely tried by showing stuff that was, well, plain unbelievable. I think you guys get the point. I can go on and on.. but my submission is: why it so necessary to make goofy, avoidable changes in established canons, to make a 'modern' film? If \"Breezy\" Eason could pull off such an achievement 65 years ago, why is it so difficult to accept the Phantom for what he is, by modern film producers? If the Phantom is an 'aged' hero, wearing a ridiculous costume, so are the others in the DC and Marvel universes. And they are world-wide box office successes. So that 'argument just won't jell. Coming back to more modern times, adopting parkour, making the Phantom look like a Ninja Turtle, having a female Guran who is taller than the Phantom etc. might satisfy the producer's hidden talents for weirdness, but such talents will certainly not improve the fan base of the Phantom. I fully agree that the Phantom character needs to be treated with respect, and the 1943 version succeeded in this, while latter versions failed miserably.",
         "Republic was certainly best known for serials, but other studios often got into the act. One of these was Columbia Pictures. In truth, Columbia's serials weren't anything to write home about--but there was one exception: the 1943 THE PHANTOM, which cracks along at a memorable pace with an entertaining storyline, some excellent fight choreography, visually interesting set pieces, and a truly fine performance from Tom Tyler in the title role. Tom Tyler (1903-1954) was a handsome, well-built man who played in well over 150 films between 1924 and 1953--but whose final years was marred by rheumatoid arthritis that reduced him to small supporting roles. But he was very much at his peak in 1941 when he appeared in the legendary Republic serial THE ADVENTURES OF CAPTAIN MARVEL--and no less so for the 1943 THE PHANTOM. Seen today, many serial \"super heroes\" of the 1930s and 1940s look more than a little chubby in their skin-tight costumes, but not Tyler: he had the body to carry it off, and if his acting chops weren't up to the standards of Hollywood's A-List actors they were perfect for this sort of comic book fun. The story finds the peace of jungle tribes threatened by the evil Dr. Bremmer (Kenneth MacDonald), who seeks to create an airbase for use by an unfriendly country at the long-lost jungle city of Zoloz. But in order to locate the hidden city, Bremmer must obtain \"the keys\"--pieces of a puzzle-like map--from newly arrived Professor Davidson (Frank Shannon) and his party. Can the Phantom, with the aid of his clever dog Devil, foil Bremmer, protect Davidson, and bring peace to the jungle once more? You better believe it, but before he does there are crocodiles, lions, tigers, a \"fire princess,\" and booby-traps galore to overcome, most of them cleverly imagined and all of them expertly performed. Director B. Reeves Eason keeps everything moving at a sharp pace, and if the dialogue and cinematography are seldom inspired they are never less than entertaining, and there's not a dull moment in all fifteen chapters. Like many serials, THE PHANTOM does adopt certain racial sensibilities that will cause modern viewers to roll their eyes from time to time. It is actually a bit difficult to tell where this film is supposed to be set: at times the script seems to imply Africa, at other times it seems to imply South America, and the \"natives\" are pretty much clumsy white men in dark make-up who look silly in diaper-like costumes. Even so, the thing goes like a house afire, and if you're interested in the serial genre this is one you can't afford to miss. The VCI DVD edition features a nice commentary by Max Allan Collins on \"Chapter One,\" a handful of biographies, and samples of comic book art and lobby cards; the real plus, however, is the quality of the film itself, which is quite fine--and this in spite of an instance where the soundtrack was lost and had to be re-created by modern actors. The picture quality is very good and the sound is more than adequate. Recommended to serial fans everywhere! GFT, Amazon Reviewer",
         "Columbia Pictures was infamous for making infamously bad serials. However, in the early to mid-1940's, they also made some good serials. One of these was called 'The Phantom.' Here are some of the things that make this serial so good: 1. Tom Tyler in the title role. He projected a strong and quietly heroic screen presence, and was athletic enough to look good in the Phantom suit. He is believable in the fight scenes. Superhero suits look good in comic strips, but usually on the screen they look completely stupid. Tom Tyler, a former champion weight lifter, could pull it off. He was also a decent actor. Totally serious, but never camp or inadvertently goofy. I rate him as being almost as good as Buster Crabbe, as far as serial heroes go. Definitely head and shoulders above Kirk Alyn or either of the poor guys that played Batman in the serials. 2. Good fight scenes. 3. Ace the Wonder Dog, playing 'Devil,' the Phantom's dog (in the comic strip, Devil was a wolf, but trained wolves were more expensive). All the great heroes each have certain gimmicks, trademarks, special weapons, etc. Such is Devil for the Phantom, and the idea of the hero being aided in a fight by a big dog is a cool idea. Devil definitely makes the fight scenes more interesting and believable here. 4. Good cliff hangers. 5. Staying reasonably faithful to the original source material. Although taking some serious liberties regarding the comic strip from whence it was inspired, this serial still retains the spirit and appeal of the Lee Falk's creations. Rightly so, the Phantom is a cool character, and should be treated with a little respect. And now, a short commentary regarding racial stereotypes: in my mind, it has always been problematic that in the comics, the Phantom is an unelected pale-skinned person holding a high degree of authority for a large group of darker-skinned persons. To be fair, the Phantom was created in the 1930's, when there was a lot of overt racism in the U.S., when Lee Falk and most of his readers wouldn't have had anyone to point out this inequity. And to be fair, Lee Falk's representation of African tribes, though entirely fanciful, was much less derogatory than that of Edgar ('Tarzan') Rice Burroughs or of any mainstream Hollywood movie. Which brings us back to this serial. While all the action takes place in the jungle, there are no positive indications as to whether this jungle is in Africa, South America, Asia, the Canary Islands, or southern Albania. Nor is there any coherent racial representation regarding the natives of this imaginary region. Many were played by Caucasian actors, some by Native Americans (an unbilled Jay Silverheels played a small role), as well as actors of other ethnicities. Overall, their skin color is not much, if any, darker than the Phantom's. Also, the characterization of the natives in this serial, while often fitting an unflattering stereotype, is much less offensive than you see in Tarzan and Jungle Jim films of the same era. The plot involves a lost city called Zoloz, which is an allusion to the Lost City of Z, which is a fabelled ancient lost city in South America, for which several real-life explorers lost their lives in quest of. It was never found, so someday maybe you may go looking for it. Perhaps you will find the Phantom as well. All in all, I would recommend this for serial fans, film buffs, and admirers of the Phantom.",
         "This serial has been panned by critics,but I found it to be one of the better efforts from Columbia Pictures,who often tended to make light of its efforts.Tom Tyler plays the Phantom and looks great in the Phantom costume.The plot is simple;Finding a lost city.Two different factions search for the city for different reasons,one good and one bad.From a technical standpoint,I found it to have good production values.On the down side,the villians,in general,tend to overact,but i've seen that in many Columbia serials.There is good rear projection work,and music by Lee Zahler is ok..\"Breezy\" Eason directs his cast in a capable manner,and supporting cast is good.Summary: good effort from Columbia. On tape and DVD. DVD has extra features.I can't compare the two mediums since I haven't viewed the tape.",
         "Wow, what a show. Now I know the Phantom is immortal, I saw him cheat death multiple times. Since this wasn't a western or a space opera, the writers found a few new ways to put the hero in grave peril. I like most of the 15 episodes, but was a bit disappointed with Devil being a dog, when I remember him being described in the comics and funnies as a WOLF. Oh well, at least the Phantom ran out of bullets, unlike the magic 6-shooters of western fame. I also find it amazing how he had such a difficult time figuring out WHO the Bad Guys were, guess this Phantom was a little too trusting. My real beef was the ending. I endured 14, count them, 14 harrowing escapes by our hero and the the end comes up like a slap in the face. I thought the end was terrible, like the writers went home early and let the janitor finish it up. Nothing to be said about Diana Palmer, so NO spoiler alert here. This was my favorite comic strip growing up in the 60's and I did really enjoy it, actually must better than the movie attempt a few years back. I wish it was in color because I would love to see that purple costume, but all else said, watch and enjoy!!",
         "Besides being the star of \"the first superhero serial,\" Tom Tyler also played \"the first costumed hero\" in a serial. (It's been argued that The Phantom wasn't actually the very first costumed hero- The Scarlet Pimpernel, among others, preceded him-, but The Phantom was certainly AMONG the first.) Director Eason does an exceptional job of keeping the action (and the story) moving (the serial is never boring, which is quite a testament in and of itself) and Tyler once again comes through with flying colors. The Lost Tribe of White Men (who grease-paint themselves) are (out)dated, and the Wolf, Devil, is a Dog this time around, but these are very minor quibbles considering the overall quality of THE PHANTOM. Definitely worth a look.",
         "Long before Billy Zane swore the oath on the skull of his father's killer, Tom Tyler wore the tights in one of Columbia's best serials: The Phantom. The Phantom (1943) takes some liberties with the material. Devil isn't a wolf in the serial, but a very beautiful German shepherd. Guran is nowhere to be seen, etc. But even so, it's still the best movie version of The Phantom, followed closely by the 1996 version. Movie serials don't get much better than this. The action and fight scenes are very good and exciting to watch. From beginning to end, there's not a single boring moment. And for a serial, the acting is good. It's a shame that Tyler (and Zane for that matter) is rarely mentioned when articles talk about the best portrayals of comic book heroes. Heck, the serial itself is never mentioned when it's about comic book movies in general! One of the things I missed in the 1996 version was more scenes with Devil. Luckily, he's got a bigger role in this. Like I said, he's not a wolf in the 1943 version, but that's understandable. Ace the Wonder Dog is amazing, and it's a joy to watch him in action. Makes me want to check out the other stuff he's in. Some of the cliffhangers are \"cheats\", but it's forgivable, since the rest of it is so darn good. Too bad they didn't make a sequel (Captain Africa doesn't really count). The Phantom is right up there with Adventures of Captain Marvel and The Mysterious Doctor Satan. Best of all, The Phantom is a movie the whole family can watch together. The violence is mild compared to modern action movies, and there's no nudity or vulgar language. Amazing that there was a time when action movies could be watched by almost everyone. Please, don't waste money on movie tickets for crappy Die Hard sequels or sadistic garbage like \"Olympus Has Fallen\", stay at home and watch The Phantom on DVD instead. (11 out of 10)"
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Professor Davidson and his niece Diana Palmer search Africa for the Lost City of Zoloz, reputed to be the source of a large hidden treasure. Also searching is a local crook, Singapore Smith, and Dr. Max Bremmer, who plans to destroy the peace in which the native tribes have been living. However, Godfrey Prescott, otherwise known as the Phantom, is feared and respected by the natives and is able to circumvent the traps and schemes of the villains.",
         "Two expeditions are trying to reach the Lost City of Zoloz -- one headed by Professor Davidson, a scientist who wants to establish an archaeological site, and the other by a greedy treasure hunter who wants to keep the fabled treasures of the city for himself. An agent of a foreign power also wants to establish a secret airbase there, so he stirs up the natives against The Phantom, who has been able to get them to stay peaceful so far. When The Phantom is murdered, his son takes his place and sets out to restore peace to the jungle and stop the agents' and the treasure hunters' nefarious plans."
      ],
      "budget": 0
   },
   "movielensId": 167886,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1943-12-24",
      "dvdReleaseDate": null,
      "directors": ["B. Reeves Eason"],
      "runtime": 299,
      "movieId": 167886,
      "title": "The Phantom",
      "mpaa": "NR",
      "actors": [
         "Tom Tyler",
         "Kenneth MacDonald",
         "Frank Shannon",
         "Jeanne Bates"
      ],
      "imdbMovieId": "0036262",
      "originalTitle": "The Phantom",
      "genres": ["Action"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two expeditions are trying to reach the Lost City of Zoloz -- one headed by Professor Davidson, a scientist who wants to establish an archaeological site, and the other by a greedy treasure hunter who wants to keep the fabled treasures of the city for himself. An agent of a foreign power also wants to establish a secret airbase there, so he stirs up the natives against The Phantom, who has been able to get them to stay peaceful so far. When The Phantom is murdered, his son takes his place and sets out to restore peace to the jungle and stop the agents' and the treasure hunters' nefarious plans.",
      "tmdbMovieId": 401461,
      "avgRating": 0,
      "releaseYear": "1943",
      "numRatings": 0,
      "posterPath": "/ogq2s80Jty2Ogr6OjbpgNWgfse8.jpg"
   }
}