{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "senator",
            "id": 2944
         },
         {
            "name": "egg",
            "id": 5698
         },
         {
            "name": "alternate dimension",
            "id": 9820
         },
         {
            "name": "interracial relationship",
            "id": 10131
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "sinkhole",
            "id": 15139
         },
         {
            "name": "quicksand",
            "id": 15140
         },
         {
            "name": "sliced in two",
            "id": 15141
         },
         {
            "name": "broken ankle",
            "id": 15142
         }
      ],
      "imdb_id": "tt1637728",
      "video": false,
      "title": "Ferocious Planet",
      "recommendations": [
         78362,
         291545,
         82756,
         16398,
         97589,
         13954,
         75454,
         86971,
         36965,
         68509,
         17135,
         90363,
         81179,
         94540,
         18676,
         25012,
         82563,
         66795,
         52615,
         76197
      ],
      "backdrop_path": "/we3ePxeFImwjKiy19YVQyP23ouE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Colonel Sam Synn",
               "gender": 2,
               "credit_id": "52fe464ec3a368484e089859",
               "name": "Joe Flanigan",
               "profile_path": "/9IY41CgC8Wd53YqFMafSFfJ4sbN.jpg",
               "id": 26066,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Senator Jackson Crenshaw",
               "gender": 2,
               "credit_id": "52fe464ec3a368484e08985d",
               "name": "John Rhys-Davies",
               "profile_path": "/dvT1NPY8CXIVQh0O1h6rpfYOgKz.jpg",
               "id": 655,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lex Michaels",
               "gender": 0,
               "credit_id": "52fe464ec3a368484e089861",
               "name": "Kevin Flood",
               "profile_path": null,
               "id": 189385,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Karen Fast",
               "gender": 0,
               "credit_id": "52fe464ec3a368484e089865",
               "name": "Catherine Walker",
               "profile_path": "/mwdMmbvkNQV8ak9XA56dfmaYHMs.jpg",
               "id": 232941,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Jillian O'Hara",
               "gender": 1,
               "credit_id": "52fe464ec3a368484e089869",
               "name": "Dagmar Döring",
               "profile_path": null,
               "id": 232942,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "Lieutenant Rivers",
               "gender": 0,
               "credit_id": "53b952b2c3a3685eb1005898",
               "name": "Yare Michael Jegbefume",
               "profile_path": null,
               "id": 1338246,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "Pvt. Jordan Reid",
               "gender": 0,
               "credit_id": "53b952f0c3a3685eb10058a1",
               "name": "Chris Newman",
               "profile_path": null,
               "id": 1338247,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464ec3a368484e08984f",
               "name": "Billy O'Brien",
               "profile_path": "/l0h8SpvskAn1YD5dD42JwuL3G8K.jpg",
               "id": 124635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe464ec3a368484e089855",
               "name": "Douglas G. Davis",
               "profile_path": null,
               "id": 116272,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53b95063c3a3685eba00559a",
               "name": "Adrian Sturges",
               "profile_path": null,
               "id": 46859,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53b9507cc3a3685eba00559d",
               "name": "Ray Harman",
               "profile_path": null,
               "id": 549340,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "53b950a2c3a3685eb7005601",
               "name": "Peter Robertson",
               "profile_path": null,
               "id": 22413,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53b950c4c3a3685eb1005869",
               "name": "Grainne Gavigan",
               "profile_path": null,
               "id": 1338234,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53b950dac3a3685eba0055a0",
               "name": "Maureen Hughes",
               "profile_path": null,
               "id": 45125,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53b950eec3a3685eba0055a5",
               "name": "Padraig O’Neill",
               "profile_path": null,
               "id": 1160652,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "53b95108c3a3685eb7005611",
               "name": "Michael Moynihan",
               "profile_path": null,
               "id": 1338236,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "53b95122c3a3685ea80054aa",
               "name": "Maeve Paterson",
               "profile_path": null,
               "id": 26146,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "53b9513cc3a3685eb7005617",
               "name": "Mick Flood",
               "profile_path": null,
               "id": 1338237,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "53b95172c3a3685ec100572f",
               "name": "Eddie Quinn",
               "profile_path": null,
               "id": 1338238,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "53b95185c3a368072e00282f",
               "name": "Nick Roberts",
               "profile_path": null,
               "id": 1338239,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "53b9519cc3a3685ebd005875",
               "name": "Peter Blayney",
               "profile_path": null,
               "id": 1338240,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "53b951f8c3a3685ea80054d0",
               "name": "Sean McGrath",
               "profile_path": null,
               "id": 1338241,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "53b95219c3a3685eb4005536",
               "name": "Tim Morris",
               "profile_path": null,
               "id": 1338242,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "53b95244c3a3685eb400553c",
               "name": "Mário Domingos",
               "profile_path": null,
               "id": 1338243,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "53b95264c3a3685eba0055bb",
               "name": "Paul Cullen",
               "profile_path": null,
               "id": 1338244,
               "department": "Crew",
               "job": "Transportation Captain"
            },
            {
               "gender": 0,
               "credit_id": "53b95285c3a3685eba0055c1",
               "name": "Laerke Sigfred Pedersen",
               "profile_path": null,
               "id": 1338245,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.730784,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61341,
      "vote_count": 26,
      "budget": 0,
      "overview": "A groundbreaking device is designed to glimpse alternate universes. But when the machine malfunctions and transports a group of observers into a nightmarish dimension of alien terrors, the travelers must use ingenuity to survive.",
      "similar": [
         341006,
         381288,
         588,
         1991,
         38234,
         4141,
         156022,
         126889,
         10185,
         6415,
         12162,
         769,
         1690,
         19908,
         8456,
         24,
         13885,
         948,
         298250,
         261023
      ],
      "original_title": "Ferocious Planet",
      "runtime": 89,
      "poster_path": "/b643GLMzEVqL4439FqtsNCYiipH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Syfy",
            "id": 6677,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Parallel Films",
            "id": 5122,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "RHI",
            "id": 6739,
            "origin_country": ""
         }
      ],
      "release_date": "2011-04-09",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "They're Not on Earth Anymore.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Billy O'Brien"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Douglas G. Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1637728/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzU2ZGQ4MWMtMDk3Ny00MmMzLWJhMTgtMmVjZGZlOWQ1MGJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "Joe Flanigan",
         "Sam O'Mahony",
         "John Rhys-Davies"
      ],
      "reviews": [
         "\"Ferocious Planet\" wasn't all entirely bad, it had its moments, though few and far apart. The story here is about some scientists having found a way to look into other dimensions, but then something goes wrong and a group of people are transported into another dimension, where they are fighting an unknown species of life. Sounds fairly alright, doesn't it? Yes. And the idea is actually good enough, but the movie suffered from a lack of ambition and the element to fully draw you in. And some of the decisions made by the characters in the movie makes you go \"what? why would someone do that?\" - it just doesn't always make sense. As for the acting in \"Ferocious Planet\", well it wasn't too bad either. But frankly speaking, it was mostly mediocre performances. It was like they hadn't enough emotion and sparkling energy with them, and it resulted in that you felt distanced and didn't care about the characters in the movie. And you just got to love the role that John Rhys-Davies had in the movie, and the actual amount of time he was in the movie. But a good way to lure in people, by having a familiar name on the cast list. For being a SyFy movie, then \"Ferocious Planet\" could have been worse than it turned out to actually be. The movie is adequate, and provides half-hearted entertainment throughout the entire length of the feature. One this that really worked well for the movie, was the design of the creature in the other dimension. It looked really cool. It did look fake at times when it was moving, but most of the time it looked believable enough and good enough. So this worked well for the movie. Having seen \"Ferocious Planet\" now, then I can say that SyFy have other movies available that are better than this one, and they also have a lot of movies available that are far worse.",
         "Considering that it was a Scyfy movie, I have to say it wasn't as bad as most of the movies they produce. The main problems are mostly budget related, but that's to be expected for a TV movie, and the actors didn't do as good of a job as they could have. They were for the most part lacklustre performances, and Joe Flanigan was basically playing the same character he did in Stargate Atlantis, the only difference between Colonel Sam Synn, the character in this movie, and Lt. Colonel John Sheppard, the one from Stargate Atlantis, was that Sam Synn is a full bird colonel. There was very little character information, you find out a few vague things about some of them, but not enough to understand their motivation. Also, the ending felt like a cop-out. It seemed that they ran out of money or something and didn't have enough to film the final scene, or at least that was my impression. They had a million and one ways to end the movie that could have made it very interesting, and instead chose a very unsatisfactory way to do it. On a positive note, the creature effects were more than satisfactory for a ScyFy movie, and they only looked bad in a few scenes. All in all, this is not a movie I would watch again, not by a long shot, but if Ferocious Planet is any indication, then ScyFy is finally heading in the right direction.",
         "A scientist endeavors to prove the existence of parallel dimensions by inventing a machine that provides a view through a portal to some of these alternate dimensions. During a demonstration of the device, something goes awry, and a bunch of people find themselves in the middle of what seems like an earthquake. But the reality of their situation is far worse. The machine has teleported them all to the dimension they were watching. From the title, you can guess the alternate universe is not where most people would want to spend their vacation. One of SyFy's better efforts; the action is well handled, the creatures are designed and animated well, and the acting is above average. There's an ironic twist near the end, but too many clues make it pretty obvious long before the twist is revealed. The parking meter bits were actually clever, although the explanation for them was goofy. The weakness is the formulaic approach: the characters are eliminated in the usual one-by-one manner of these type of movies, usually just as they say or do something stupid. It's usually obvious who's going to get it next, especially the clichéd knuckle-headed greedy guys in the group. All in all, not bad for a TV movie and considering the weak theatrical releases out this summer, and the ticket prices that look like they were set by a big-oil executive, watching this for free is the better option.",
         "In the Federal Science Institute, Dr. Jillian O'Hara (Dagmar Döring) and her assistant Brian Murphy (Robert Soohan) will demonstrate their research to a commission led by the arrogant Senator Jackson Crenshaw (John Rhys-Davies) and Dr. Karen Fast (Catherine Walker) from the president office expecting to keep the budget of her laboratory. Colonel Sam Synn (Joe Flanigan) is responsible for the security with Lieutenant Rivers (Yare Michael Jegbefume) and Pvt. Jordan Reid (Chris Newman). Dr. O'Hara explains that her machine is the fruit of a long research initiated by her father and can show parallel dimensions. During the demonstration, there is a problem in the device and the room is transported to another dimension with everybody that is observing the experiment. Soon the survivors discover that the room is placed in the wilderness of a dangerous dimension inhabited with wild beasts. \"Ferocious Planet\" is an awful TV movie released in my country on DVD. The story of a group of people accidentally transported to another dimension is not original and John Rhys-Davies worked in \"Sliders\", just as an example. However, in \"Ferocious Planet\", the characters are unpleasant or stupid and the lines and situations are ridiculous. My vote is two. Title (Brazil): \"Planeta Feroz\" (\"Ferocious Planet\")",
         "This is a film made for the cable television channel SyFy which is probably as much information as you need to judge how good this film is. Synopsis: A group of people are gathered in an underground laboratory in a Federal building, including scientists, military and politicians to see a presentation of an experiment into viewing other dimensions. There is an accident and instead of just viewing another dimension the whole lab is ripped out of our dimension and dumped into a parallel dimension populated only by plants and giant carnivorous CGI monsters. The survivors must find a way to repair the machine that brought them here and escape the ferocious creatures. As always seems to be the case with SyFy channel films, the problem lies in the writing. An accident in experiment is one of the laziest and most ham-fisted plot devices in cheap science fiction.The CGI monsters are good enough for the price but there's no attempt to set them in a believable ecosystem. What do the creatures eat when there are no humans? The writer uses idiocy as a plot device in different ways to kill off characters either through arrogance, fear or greed. Overall this was a mediocre and lazy film. I can't fault any of the actors too much since they were competent enough with what they had to work with. Joe Flanigan plays his standard wise-cracking soldier hero part. John Rhys-Davies is the cynical arrogant Senator. Dagmar Döring plays the scientist in charge of the project.",
         "Gosh! Why all the bad reviews? It's a made-for-TV movie that could easily be turned into a series. I know John Rhys-Davies makes a cameo appearance and is killed off 5 minutes into this movie about sliding into a parallel dimension and the cast's frantic attempts to return, but there's no reason he couldn't be brought back for a TV series with that same concept. Heck, we could call the show \"Sliders.\" OK, sarcasm mode off. The acting was fine. The CGI, while limited (budget I suppose) was OK. However, the script was pathetic. I couldn't even find a credit for who wrote this. Was it unscripted or was the writer too ashamed? We get to hear one of the characters ask \"are you tapping that?\" The only possible purpose of the line at that point in the story was to demonstrate that the writer knows 21st century locker-room lingo. Hm... maybe that's it: it was written by a high-schooler. Aside from the cheap lines, why do hack writers have to create military personnel incapable of following orders, otherwise intelligent adults suddenly incapable of cooperating and yet other adults in a life threatening emergency suddenly deciding that THEN is the time to hatch a transparent money-making scheme or wander off alone to examine the flora and fauna? The \"don't poke the alien\" line is funny, but several people manhandle the alien. While there's a certain satisfaction that one of the idiot characters gets what he deserves as a result of alien poking, it made absolutely zero sense. With some good writing this have been a watchable -- even though rehashed -- film. I know I could have personally made something better of the writing. As it was, for the lack of any appreciable budget for decent writers, this film is a total waste of time.",
         "There are a few problems with this TV movie from the emasculated Syfy Channel. I throw up a little in my mouth when I have to write its new name. Overall it's watchable and a traditional Radiation Theatre film. Here are some fun things about Ferocious Planet which I like to call The Quasi-Ferocious Planet. Most actors had American accents at the beginning but the Irish started coming out toward the end. CarrieFisher-idice! So this is John Rhys-Davies' new career. Show up for the 100K. Film a scene or two and get killed? He's done that like nine times. I wish I had a job like that. Apparently there is only one type of creature inhabiting this forest on this random parallel universe. No bugs,snakes or creepy things to give us some cool jump moments. Too bad. Oh well, there was this mushroom but it didn't really do anything. \"We're out of time\" is said so often I was truly convinced they were out of time. The writer(s) apparently loved Jaws, Jurassic Park and Alien as a kid (who didn't!) Too bad writer(s) couldn't find a more appropriate place to use the homage line, \"You're gonna need a bigger boat\". The science of how they got to the F. Planet in the first place was unintelligible, like a madman writing on a wall. It was a view scope to other dimensions that suddenly became a transporter device because . . . Using only one creature (who looked like a Swiss Army Knife) mixed with the unusually high body count resulted in fewer creative kills. Just a Dinosaur with razors everywhere on its body. Must say the effects were better than an average SyFy crap on a stick. OOps threw up a little again. In summation, too many missed story opportunities and it drags towards the end. So I leave you this advice: Don't poke the alien.",
         "It's always funny if you see big names on a sleeve of an unknown movie. Here the name that I want to mention is John Rhys-Davies. He was in the Lord of The Rings trilogy and the Indiana Jones fame. But he's maybe for 10 minutes in this SyFy production. And you know what SyFy mean, mostly really bad flicks but I guess that they have learned their lesson. This rather looks good. I even enjoyed it. Of course it's low on the red stuff, some killings do occur but not really to mention. But the movie started off really well with an experiment going awry and transports a group of observers into a nightmarish dimension. From their on they are on the other side. Some dinosaur looking creatures are making the way of survival a hard target. There is of course a lot of CGI, especially the creature but that's normal for SyFy. Nevertheless, it almost the same, creature, running, creature appears, running away. But it's one that you could see with your kids on a rainy afternoon. Somehow you keep watching what is going to happens next.",
         "I for 1 liked this movie. The graphics were just like any other SyFy movie you see, the story was 1 of the first I have seen. I have always wanted to see a movie with different dimensions. There has been time traveling like Back to the Future, and teleporting in almost any Futuristic SyFy movie, and there has been movies where they visit other planets. This movie is somewhat a combination of them all. The thing I didn't like was how it reminded me of other movies at points. ***THIS PART OF THE REVIEW MAY CONTAIN SPOILERS*** In 1 part a guy steals one of the creatures eggs, hoping to bring back for research/money. This reminded me of a part in Jurassic Park 3. Another part is how the creatures have Pneumonia for blood, which when touching the skin acts almost exactly like Acid (and one of the people even think it's acid!). This reminds me of the Alien creatures in the Alien movies. There is 1 last thing that reminds me of a movie. I think the filmmakers watched the 2010 Predators movie a little to much. The jungle design looks a lot like the one in Predators, and other than the fact the creatures have multiple eyes, and (I think) only 2 back legs? They look a lot like the Predators Hunting Dogs, you know the ones that one of the guys drags back. There skin color is very close to the predator dogs, and there movement and personality? Is almost just like them. They move fast, and are smart. There size is 1 of the 3 things that I found different, being from as small as a house cat to bigger than a full grown elephant. Also, after the team moves out of the building to find water, they go on top of a hill and look out to see miles of forest/jungle. Very close to what the team in Predators do. One part that made me laugh was when the guy gets that metal rod stuck through his \"sholder\". You can clearly see he is holding it under his armpit. This is what made me laugh most though, after the guy pulls it out, just watch the rest of the movie. At some rare points he turns around so you can see the back of his shirt, and 2 things I noticed. 1: There is no blood on the back of his shirt, I am no scientist or doctor but I know that if a metal rod makes 2 holes (a puncture going in and then coming out) it is going to bleed from both holes. And 2: There is no rip, tear, hole, whatever on the back of his shirt where the metal rod \"supposably\" came out. That is SyFy for you, they don't put a lot of effort into there movies, for the top reason being they are free to the public on there first release, unlike Avatar where James Cameron got the graphics down to the last drip of sweat. Overall I liked this movie, it would have been better if they would of made up there own story better. There was 1 part that I really didn't like, the ending. After they get back to \"there dimension\" alls you hear and see are police lights, which would make sense but when they get back they return to a big metal room that doesn't look anything like the one they were in, + at 1 point in the movie after they go to the other dimension and go out of the building a girl says that the building used to be 3 floors underground, and wonders why it is up on the surface now. Explaining that it now makes me wonder when they return why they are on the surface? After that the girl opens the door and both people still alive just have a blank look on there face like they are surprised and/or confused. The girl finally says \"You first\" to the guy and bam, the movie is done. Thats just some stuff that I liked, didn't like, and didn't get. I would recommend watching this if you are a SyFy movie fan, as it is different that any of the others.",
         "overall i liked the movie considering some i have seen on the sci-fi channel i found this believable if dimension traveling was actually possible. what i didn't like was the ending an i don't know if this is an actual spoiler but i think we should have seen whatever they saw an not left us hanging. the actors were good, though it amazed me that it too so long for them to realize they were leaking freon. though i don't agree with the other reviewer i don't think the creature is similar to predators more like some kind of spider with those multiple eyes an it runs like a kangaroo holding the front legs forward to give it speed. overall as i said the movie was good an my seven year old granddaughter liked it also it was not so scary she asked me to turn it off.",
         "I give it an 8 mainly for the good slips of humor that they give the audience here and there. Which is good, because if they tried to be totally serious, it would have felt corny. My favorite: \"Rule: Don't poke the alien.\" It was an interesting mix of characters thrown together by an experimental demonstration gone wrong (of course!) And a bunch of Washington Senatorial aides, scientists and a few marine guards are thrown into another dimension. Now how do they get back? What's nice about this flick is that the script doesn't really follow the tried and true tropes we come to expect from 'Scientist Experiments Gone Wrong' but sends the viewer towards different outcomes. . .with a bit of humor interspersed with the gore. And the ending was. . .interestingly open to interpretation. This is a good Saturday Night 'B' Flick. Not bad for SyFy.",
         "(12%) A cheapo made for TV sci-fi time passer that is best watched either a little drunk, or with friends so to rip into it (or both), because this is so throwaway and low in content that entire scenes could be shortened or even cut out entirely and you'd still know exactly of what little is going on. The only nameable star is John Rhys-Davies, and he's on screen for about 10 minutes, leaving the TV actors and B-movie stars to carry this feeble monster movie by themselves. This was intended to be fluff from the start, with the script filled with corny lines, bad jokes, and stupid characters. While the computer effects are like those found in the video game \"Quake\", from 1996. This can be watched without really wanting to give up on it because it is quite well paced and enjoyable in a very shallow, goofy manner, but this isn't worth a look.",
         "Acting : Joe Flanigan does his thing and is likable, John Rhys Davies adopts an hilarious accent. Naughtiness : nothing. Effects : bargain basement CGI with one practical creature that spurts ammonia as blood, the effect where the ammonia sprays on a guys face killing him is competently done. The scenes of the larger CGI creatures running about the forest are laughable. Music : Cheap as can be expected . Cinematography: Poor, too many static camera shots of bad acting. Overall : Intrigued that this was filmed in Dublin. Not the worst Syfy effort, Flanigan is always likable but it gets tiresome watching a bunch of people running back and forth through the woods. Fave scene had to be the quicksand bit.",
         "\"Ferocious Planet\" (2011) is about a group of office people who are accidentally teleported to another world via an experimental device that opens windows to parallel dimensions. The forested world looks like earth but it's inhabited by ferocious beasts the size of dinosaurs. The group do everything in their power to survive and find a way back. Before watching this one I fast-forwarded through it and didn't think I'd like it, but -- after viewing -- I have to admit that I enjoyed it for what it is. It's both a story of exploration (of the new planet) and survival. The former gives it a sense of mystery and the latter an air of tension. There are a couple of good women, but they have office apparel on the whole time, which isn't a big deal; I just prefer women in cavegirl outfits in these types of movies, lol (like Beth Rogan in the 1961 version of \"Mysterious Island\" or Annabelle Wallis and Hannah Tointon in 2010's excellent \"The Lost Future\"). Most people seem to be attracted to this film because Joe Flanigan stars in it; having never watched \"Stargate: Atlantis\", this was my first exposure to him. The film runs 88 minutes and was shot in Ireland. BOTTOM LINE: \"Ferocious Planet\" is nothing to get excited over, but it is a solid Grade-B creature feature with a compelling survival situation and the anxiety and thrills thereof. GRADE: B-",
         "This film had us in fits from start to finish. I don't think it's deliberately funny more just a touch tongue in cheek but it's definitely worth watching for its comedic value. Not that it's without a serious moral message. I'll tell you this at the end. A group of bigshots in a lab to observe an experiment are accidentally moved through time and space by a couple of Irish scientists to the eponymous Ferocious Planet. The planet bears an uncanny resemblance to a wood anywhere on Earth (with a few cheap sfx such as violet smoke and flashing lights) although this doesn't stop one of the inadvertently intrepid travellers from taking cell phone photos of trees, mushrooms and other flora which look exactly the same as their Earthly equivalent, to document the experience, while continually failing to even attempt to take any photos of huge dinosaur-like creatures that give chase to our merry band and we assume give the planet its moniker as the place itself is no more ferocious than Central Park. As with the latter, it's the natives that are ferocious rather than the habitat. There is quicksand though and two of the men get stuck in it. The woman says: 'Don't worry. I go to Pilates six days a week.' Who knew that this would give her enough strength to pull two heavy blokes out of quicksand? I'm having words with my yoga teacher as I still struggle to carry my suitcase. A straight-talking type with a deep southern drawl (a least to begin with), identified as the Colonel, takes control, (the likable Joe Flanigan doing a passable impression of Christian Kane), and points out the obvious: 'We're not safe here.' Someone asks: 'Where do you suggest we go?' Colonel: 'Somewhere where our asses aren't sticking up in the middle of the air.' Every now and then, it falls to a character to deliver some of the Colonel's backstory, which is entirely unnecessary but is there to prove that, although he's someone who's been wrongly discredited, he is really an all-round good guy. The dialogue is horribly 'on the nose', so: 'It wasn't your fault that hospital was destroyed.' Here's an absolutely priceless comment from the female Irish scientist or voice of doom: 'According to my calculations, we only have six hours before the aligned conjunction of this dimension with ours suffers quantum collapse. \u0085 Once the dimensions fall out of alignment, we're stuck here forever.' However, whenever the Colonel asks how long they have, which he does periodically, neither of the scientists is able to give him any idea, saying things like 'Two hours? Three hours?' or 'Not long now'. They're rather vague. I wouldn't trust scientists that can't even read a wristwatch myself. Anyway, time is supposedly of the essence but the characters still take what can only be described as a desultory stroll through the woods as if they really were wandering in Central Park on an extra long lunch break. My sister comments 'I've seen people move faster than this in Morrisons'. If you've ever been in Morrisons, you'll know that its shoppers move at a snail's pace. Possibly the most hilarious sequence is when the two scientists communicate by scribbling hieroglyphics on a pad, after each scribble, saying stuff like: 'Could it be?' (more frantic writing such as 223-4(x) + å17³²) then 'But' (a few quick pencil scratches) or 'What if' (more frenetic scrawling) then 'It's theoretically impossible!' and so on. This episode stands in for the need for any real scientific explanation of how they got in their current predicament and how they're going to get out of it. Neat. Hapless expendable no. 1 pokes the alien they've captured, which seems to be dead. This results in his death. Scientist: What the hell happened? Hapless expendable no. 2: He poked it with a pen and some black stuff shot out and hit him in the face. Scientist (reprovingly): Don't poke the alien. (This has to be one of the best lines in a sci-fi movie ever and surely a creed we need to adopt for life but it's still not the moral of the tale.) Meanwhile, the Irish accent has proved contagious and has spread from the scientists to the rest of the cast. Even the Colonel is speaking with a slight Irish brogue. So, the moral of this tale would be 'Do not allow Irish people who can't tell the time to fiddle with the space-time continuum' especially one who boasts 'I'm one of the most intelligent people in the world.'",
         "On paper this looks like a good time waster, dependable lead, monsters, some kind of 'Science' twist. Believe me all the elements are there. Joe Flanigan reprising his man of action role (something he does very well), John Rhys-Davies reprising his stock nasty-man character that he has been trotting out in B movies for years (Anaconda III and IV anyone), even some choice one-liners along for the ride, enjoyed the Jaws reference but really it needed a bigger scene to be effective. And that is precisely the problem with this, it doesn't quite deliver in all the essential areas. The cast do their best, but the script is very sadly lacking in tension or even a real sense of urgency, and you just know stupid people are going to do stupid things for all sorts of completely ridiculous and illogical reasons. The other problem with the script is that far too many ideas come from other, much better, movies. Seriously, if you are going to borrow from other films, particularly famous ones, try to give the ideas some kind of original twist. If you can stay the distance you find yourself noting down all the stuff you've seen before and where you have seen it. I bought this because I like creature features and I like Joe Flanigan, he has an insouciant style which comes off as effortless and invests the characters he plays with a certain devil-may-care charm. Unfortunately here, he really has nothing to work with so it's all very much painting by numbers. Really, if you have absolutely nothing better to do, you can have a little fun spotting all the bits they pinched from other films (and let me emphasise a LITTLE FUN), but otherwise adds nothing to the canon of creature features, sci-fi movies, or action and adventure.",
         "I think a lot of people went in to this thinking it was a stand alone movie and that ruined it for them. The same applies to when a films adverts make it look like an action movie but it's not but because you were expecting an action movie you were disappointed. If you are going to watch this I suggest you think of it more as a pilot for a TV series as that's what it feels like and ends like. The CGI monsters are reasonably well done but have that nasty clean plastic look that a lot of cheap CGI has. It has borrowed from several other films such as the acid blood from Aliens (well ammonia for blood in this movie) and the aliens look a lot like the predator dogs as others have commented. Personally I'd say it's a good Sunday afternoon movie if there is nothing else available. My take on the building the doctor was heading for is that it is something that was dragged from their own dimension in to the alien dimension and therefore the doctor realises she has just trapped herself for nothing. As to what is outside the door when they return I wouldn't like to say. Possibly all the sirens are just there because of all the damage that must of been caused when they jumped dimensions or possibly when they went one way some other things came the other way meaning we have the aliens on the streets.",
         "Its an awful movie and total wastage of time. I don't know how people can make such a movie and can expect others to watch it. I cant bring those hour and thirty min back which I wasted watching this crap.. I can make such a movie by collecting 10 people and using some third class animator to create an ugly looking creature. My warning please please don't waste your time otherwise you ll remember me later that I warned you not to watch it.Its an awful movie and total wastage of time. I don't know how people can make such a movie and can expect others to watch it. I cant bring those hour and thirty min back which I wasted watching this crap.. I can make such a movie by collecting 10 people and using some third class animator to create an ugly looking creature. My warning please please don't waste your time otherwise you ll remember me later that I warned you not to watch it.Its an awful movie and total wastage of time. I don't know how people can make such a movie and can expect others to watch it. I cant bring those hour and thirty min back which I wasted watching this crap.. I can make such a movie by collecting 10 people and using some third class animator to create an ugly looking creature. My warning please please don't waste your time otherwise you ll remember me later that I warned you not to watch it.",
         "Yet another tv offering in which the characters are far too moronic to survive every day life here on today's earth much less the environment depicted in this movie.",
         "Ferocious Planet is pretty bad but I watched it anyway. The clichés abound but the technical issues dominate the film. If you are going to make a movie in Ireland, then why does it have to be set in the USA and the Senator be a jackass? \"I have a device smaller than a suitcase which can produce unlimited free power for nothing, but I need 250 million in funding\". Please, 250 million, billion, trillion? That alone is priceless, but the side effect is the ability to view parallel universes. Sigh... The men are dumb jocks and the women all have \"Dr.\" first in their names. But, they do wear skirts, blouses and dressy shoes to flail around in. Oh, did I mention curly hair? RawR! I warned you !",
         "When I saw the line up of actors in this I was thinking, \"Yeah this could be OK...\" And then I watched it. But it just felt like a really long crappy pilot episode. I know it is a TV movie but sheesh man. I have seen way better TV movies. The CG was terrible and the dialogue was bleh. I think if Arturo and Shepard ad-libed, it might have been better. It was like a poopy amalgamation of the 100, sliders, stargate atlantis, and that predator movie with the french dude in it. I think only someone who is fond of the actors could sit through it. Otherwise there is no real incentive to watch the whole film. But different strokes for different folks I guess. Salut.",
         "If you have the money, the actors, the distribution, the production, the crew, an editor, why would you make this movie? Why wouldn't you get a good script and director? I understand that this movie was made for the Sci/fi channel, I understand that that means that every movie will be in a certain genre. Why make THIS movie though? That this movie was made as opposed to other ideas, y'know, what's that say about the Sci/fi channel's audience? Ferocious Planet was considered \"good enough\" for you and for me. How do you feel about that? Have you seen Ferocious Planet? Well that's someone's opinion of your intellect. You okay with that? Like you think you're worth a good movie and instead, you have this.",
         "What amazes me the most about this movie is that there are actually people thinking it is a good movie. Really? Ferocious Planet is a complete waste of your time, a waste of money that could have been spent in making something watchable. The story itself could have been good if you only had a good script writer. It could have been good if you had decent actors. But really, this acting was awful to watch. terrible actors! Not one good actor in the whole movie. Terrible lines, so cheesy that you wonder who would write something like that. He can't seriously not be making a living out of this. One thing is for sure, I won't ever forget about this movie, because the only things you remember are the real good movies and the dramatic failures like Ferocious Planet.",
         "Title review is quoted from the movie: the script is fun, I laughed a lot watching this movie and NOT because of \"So bad, so good\". The movie is as absurd as \"Land of the Lost\" but it was much cheaper to produce. Just like a couple of \"Twilight Zone\" episodes. It will not win best effect or best acting Academy Award, but it deserves a watch. Another crazy quote is \"How much water do we need? 50 gallons.\" I mean: it's about 190 liters, into a device smaller than a suitcase! Very funny are the \"calculations\" that the scientist O'Hara does with her assistant Murphy to understand what went wrong. One of the female character, the scientific adviser of the president, says: \"Looks like a building. Only intelligent life could build something like that.\" And she goes there to contact the aliens :) The movie never takes itself seriously, that's why I gave a pretty fine score. Edit: Feb 2018 One of the few few movies with a black/white sexual relationship with \"French kissing\". IMO it increases sci fi atmosphere because I never saw it in an US movie! They are Irish, indeed :) 5/10",
         "More nonsense from the SyFy Channel. This one sees a diverse group of characters randomly transported to an alien planet, where they must contend with an aggressive alien monster who seems intent on having them for lunch. What it all boils down to is a bunch of characters running around in a forest and being menaced and eaten by a dinosaur-like beast. FEROCIOUS PLANET has absolutely nothing that makes it stand out from the crowd. The actors are undistinguished (the only familiar face is John Rhys-Davies, who is bumped off early on), the characterisation is nil and the script just isn't true to life. The CGI effects are unsurprisingly bad, and the action isn't exciting. Throwing in a handful of mildly gory death scenes just doesn't do anything to make it better. Although the film strives to be an exciting story of adventure and survival, it never is. It lacks the B-movie spirit of something like AZTEC REX, where the narrative becomes a romp and the viewer enjoys themself regardless; the only thing you'll be enjoying here are the closing credits."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Parallel Film Productions",
         "RHI Entertainment",
         "Syfy"
      ],
      "summaries": [
         "In the Federal Science Institute, Dr. Jillian O'Hara and her assistant Brian Murphy will demonstrate their research to a commission led by the arrogant Senator Jackson Crenshaw and Dr. Karen Fast from the president office expecting to keep the budget of her laboratory. Colonel Sam Synn is responsible for the security with Lieutenant Rivers and Pvt. Jordan Reid. Dr. O'Hara explains that her machine is the fruit of a long research initiated by her father and can show parallel dimensions. During the demonstration, there is a problem in the device and the room is transported to another dimension with everybody that is observing the experiment. Soon the survivors discover that the room is placed in the wilderness of a dangerous dimension inhabited with wild beasts.",
         "A groundbreaking device is designed to glimpse alternate universes. But when the machine malfunctions and transports a group of observers into a nightmarish dimension of alien terrors, the travelers must use ingenuity to survive."
      ],
      "budget": 0
   },
   "movielensId": 168074,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-04-09",
      "dvdReleaseDate": null,
      "directors": ["Billy O'Brien"],
      "runtime": 89,
      "movieId": 168074,
      "title": "Ferocious Planet",
      "mpaa": "NR",
      "actors": [
         "Joe Flanigan",
         "John Rhys-Davies",
         "Kevin Flood",
         "Catherine Walker",
         "Dagmar Döring",
         "Yare Michael Jegbefume",
         "Chris Newman"
      ],
      "imdbMovieId": "1637728",
      "originalTitle": "Ferocious Planet",
      "genres": [
         "Adventure",
         "Action",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A groundbreaking device is designed to glimpse alternate universes. But when the machine malfunctions and transports a group of observers into a nightmarish dimension of alien terrors, the travelers must use ingenuity to survive.",
      "tmdbMovieId": 61341,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 2,
      "posterPath": "/b643GLMzEVqL4439FqtsNCYiipH.jpg"
   }
}