{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "homophobia",
            "id": 1013
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "gay interest",
            "id": 10199
         },
         {
            "name": "in the closet",
            "id": 11524
         },
         {
            "name": "gay sex",
            "id": 15135
         },
         {
            "name": "catholic",
            "id": 18396
         },
         {
            "name": "poland",
            "id": 21747
         },
         {
            "name": "gay man",
            "id": 33458
         },
         {
            "name": "homophobe",
            "id": 154903
         },
         {
            "name": "catholic church",
            "id": 157008
         },
         {
            "name": "homoeroticism",
            "id": 157096
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "catholicism",
            "id": 161207
         },
         {
            "name": "masuria poland",
            "id": 166452
         },
         {
            "name": "catholic priest",
            "id": 172391
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "homophobic",
            "id": 191225
         }
      ],
      "imdb_id": "tt2650642",
      "video": false,
      "title": "In the Name of...",
      "recommendations": [
         20116,
         14495,
         19369,
         84295,
         94025,
         84277,
         15976,
         39041,
         99272,
         37810,
         24754,
         192623,
         87380,
         117629,
         69746,
         179246,
         64509,
         187864,
         341544,
         31978
      ],
      "backdrop_path": "/jjQBDuCyhBW7cjllKUsuzoxll5l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Priest Adam",
               "gender": 2,
               "credit_id": "52fe4c2ac3a36847f8220f85",
               "name": "Andrzej Chyra",
               "profile_path": "/tf16OfmRVoCZj1CFKzxUkb5t7Tz.jpg",
               "id": 82313,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "Łukasz",
               "gender": 2,
               "credit_id": "598cd36fc3a3683a2a001198",
               "name": "Mateusz Kościukiewicz",
               "profile_path": "/pxjkjiC1CAsqhFWDdUtFDFrkvuf.jpg",
               "id": 1482162,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ewa",
               "gender": 1,
               "credit_id": "52fe4c2ac3a36847f8220f8d",
               "name": "Maja Ostaszewska",
               "profile_path": "/wkuVBi76iPd3O4JNts3YLFx6TcX.jpg",
               "id": 82312,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Matka Łukasza",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220f91",
               "name": "Maria Maj",
               "profile_path": null,
               "id": 1198541,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nauczyciel Michał",
               "gender": 2,
               "credit_id": "52fe4c2ac3a36847f8220f95",
               "name": "Łukasz Simlat",
               "profile_path": "/eNe0ZC4tCRnMFlRns9q9jo1zogi.jpg",
               "id": 591246,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Adrian",
               "gender": 2,
               "credit_id": "52fe4c2ac3a36847f8220f99",
               "name": "Tomasz Schuchardt",
               "profile_path": "/iKBKvAexsTdyxzTZlCDG8KlAFOz.jpg",
               "id": 980177,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rudy",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220f9d",
               "name": "Kamil Adamowicz",
               "profile_path": null,
               "id": 1198543,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Gajo",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fa1",
               "name": "Mateusz Gajko",
               "profile_path": null,
               "id": 1198544,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Koko",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fa5",
               "name": "Jakub Gentek",
               "profile_path": null,
               "id": 1198546,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Babun",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fa9",
               "name": "Daniel Świderski",
               "profile_path": null,
               "id": 1198549,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mateusz",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fad",
               "name": "Mateusz Malczewski",
               "profile_path": null,
               "id": 1198550,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Itan",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fb1",
               "name": "Krystian Poniatowski",
               "profile_path": null,
               "id": 1198552,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sztacha",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fb5",
               "name": "Kacper Sztachański",
               "profile_path": null,
               "id": 1198553,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Kamil",
               "gender": 0,
               "credit_id": "52fe4c2ac3a36847f8220fb9",
               "name": "Kamil Konopko",
               "profile_path": null,
               "id": 1198554,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4c2ac3a36847f8220f81",
               "name": "Małgorzata Szumowska",
               "profile_path": "/dihaRrk8vZQ518brzJXSxSmy2rN.jpg",
               "id": 932317,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4c2ac3a36847f8220fbf",
               "name": "Małgorzata Szumowska",
               "profile_path": "/dihaRrk8vZQ518brzJXSxSmy2rN.jpg",
               "id": 932317,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c2ac3a36847f8220fc5",
               "name": "Michał Englert",
               "profile_path": null,
               "id": 53617,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.586263,
      "production_countries": [{
         "iso_3166_1": "PL",
         "name": "Poland"
      }],
      "id": 160165,
      "vote_count": 23,
      "budget": 0,
      "overview": "The contemporary story of a priest who launches a centre for troubled youth in a small parish. He is a good priest and is well-liked by his congregation, which remains unaware of his complicated past.",
      "similar": [
         184352,
         26280,
         449176,
         383526,
         338189,
         413666,
         382475,
         380874,
         47643,
         10938,
         26933,
         258034,
         376867,
         425193,
         428493,
         383559,
         52799,
         340684,
         222918,
         377154
      ],
      "original_title": "W Imię...",
      "runtime": 102,
      "poster_path": "/oHa3pVFl5Ef9K3BmFlmwWs5ftkB.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal+Polska",
            "id": 250,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shot - Szumowski",
            "id": 15066,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zentropa International Poland",
            "id": 11236,
            "origin_country": ""
         }
      ],
      "release_date": "2013-09-06",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Malgorzata Szumowska"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Malgorzata Szumowska",
         "Michal Englert"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt2650642/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjI5NDQxMjQ5Nl5BMl5BanBnXkFtZTgwNjU0MzAwMDE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Andrzej Chyra",
         "Mateusz Kosciukiewicz",
         "Maja Ostaszewska"
      ],
      "reviews": [
         "This is a very effective, very positive and yet oddly disturbing movie about the fitful coming out of a 40ish gay priest in Poland. His name is Adam, and he looks nothing like a priest except while on duty. He's always known he's gay, but he's serious about his vocation and has stayed closeted in order to keep his vows of celibacy. He has a special gift for helping troubled teenage boys, which his superiors value greatly. His homosexuality has never led to anything remotely inappropriate with a boy (or with a man, for that matter), but he is periodically transferred in order to keep even rumors from interfering with his very valuable ministry. Most recently he was moved from Warsaw to an isolated rural parish with a small work-home for boys on furlough from reformatories. This is a complex movie, and trying to summarize its plot would be a disservice. It is not predictable, not typical of gay movies, of priest movies, or of any other sort of movies I can think of. It's not the story of a type of man but of THIS man. So, like any real human being, Adam is more complicated than a normal movie character, and the director does not try to make him easy to understand. In part because it's NOT predictable, this movie is fascinating to watch, and the end is especially satisfying. The movie is disturbing not because of anything that happens, but because everyone and everything in it looks dirty. I know that sounds superficial, but sometimes the most superficial things in life are the most distressing. Even after bathing, the characters look grimy, everything indoors is dingy, and outdoors is nothing but dust. I don't know if rural Poland really is as miserable as this movie makes it appear, or if the director was intentionally creating a disturbing ambiance for the movie. Although it's disturbing, that ambiance adds to the complexity of the movie and enhances its effectiveness. I watched it twice; it was richer and even more satisfying the second time.",
         "Andrej Chyra (Father Adam), Mateusz Koskiukiewicz (the tongue-tied Lukasz) and Tomas Schuchard (the streetwise Blondie)are superb. But this is writer/director Malgorzata Szumowski's film and it is original, fresh. It proves once again the power of art to make sympathetic a character you wouldn't have believed was worthy of consideration based on the facts alone. I mean the conscience-tormented Father Adam who is enveloped in a haze of homoeroticism generated by the late-teenage youths at a Polish reformatory camp. Given the emotional and affectional undernourishment among both the adults and the youths it is unsurprising that desire emerges here and there. But Father Adam is no predator pedophile exploiting altar boys. He is a sincere man devoted to the well-being of his wards and his temptations come in the form of youths past the age of consent played by actors well-past that age.",
         "Polish screenwriter, producer and director Malgorzata Szumowska's fifth feature film which she co-wrote with Polish screenwriter and cinematographer Michal Englert and co-produced, is inspired by an article she read in a newspaper. It premiered In competition at the 63rd Berlin International Film Festival in 2013, was shot on location in Poland and is a Polish production which was produced by producer Agnieszka Kurzydlo. It tells the story about a Polish Catholic priest named Adam whom has been moved from his position in Warsaw and transferred to a rural village where he in addition to practicing and performing his duties as a priest manages a center for disadvantaged young boys with his friend named Michal. Adam starts becoming friendly with a woman named Ewa whilst he is staying there, but as Adam's colleague, the young boys he is working with and the people who lives there, she is unaware that Adam is hiding something. Distinctly and subtly directed by European filmmaker Malgorzata Szumowska, this finely paced fictional tale which is narrated from multiple viewpoints though mostly from the main character's point of view, draws a mindful portrayal of a man of faith who does not have priest written all over him, who is in an ongoing ordeal with chastising himself and his relationship with a younger man named Lukasz. While notable for its naturalistic and atmospheric milieu depictions, fine production design by production designer Marek Zawierucha, sterling cinematography by Polish cinematographer Michal Englert and use of colors and light, this narrative-driven story which quietly and efficiently conveys how in some cases intolerance and certain traditional views can undermine the dignity of, cause involuntary and unnecessary loneliness and in the worst case scenario make someone think that they have no place in a society and that they in staying true to themselves have betrayed others in an unredeemable way, depicts a heartrending and empathic study of character and contains a great instrumental score by composers Pawel Mykietyn and Adam Walicki. This modestly romantic, at times humorous, somewhat impassioned, conversational and far from overly theological, political or preaching drama which is set during a summer in Poland in the 21st century and which salutes the human spirit and its unwritten right to pursue its true nature is an exemplary and pivotal contribution to modern cinema from a filmmaker who in the name of\u0085 tells this love-story in the same way as a heterosexual love-story would be told and whose love for her characters and for cinema shines through, and is impelled and reinforced by its cogent narrative structure, subtle character development and continuity, various characters, timely and efficient use of music, unsettling though poignant analogy, commendable and humane examination of its central theme and the fine acting performances by Polish actors Andrzej Chyra, Mateusz Kosciukiewicz, Lukasz Simlat and Polish actress Maja Ostaszewska. A tangible, conscientious, eloquent and cinematographic narrative feature which gained the Teddy Award for Best Feature Film at the 63rd Berlin Film Festival in 2013.",
         "I saw this film as part of the official Competition section of the Berlinale 2013. The theme at hand is very relevant in the context of child abuse as came to light in recent years, but there is more to it than that in this film. While the \"children\" in this film are nearly old enough to count as consensual adults, there is always the relationship between teacher and pupil to block any sort of romantic involvement. And there is the issue of celibacy for Roman Catholic priests. And if that is not enough, any intimacy between men and boys (whatever their age) is frowned upon by not only the church but also not accepted by the average man/woman in the street. The scenario contains elements of all these issues, mixed together in a believable story line. As a bonus we see also the dilemmas that the church has to face when becoming aware that things are deviating from the official path. Our main character, priest Adam, has a proved track record of having a positive influence at all locations where he worked before. Nevertheless, there was always something going on, allegedly or not, that the church could not approve. And even when proving untrue rumors after all, it could have repercussions on their charitable work by the sheer suggestion alone. A transfer to a different place with the proverbial clean slate is then the next best thing the clerical hierarchy can do in their context, since dismissing him would be a loss for the social work that the church wants to continue at any price. All of the above issues are intermixed in this film. That is done in such a way that one has difficulties to choose for either side, even for or against the church who is often maneuvered in a difficult position. And there is always some form of collateral damage due to suddenly broken relationships, deserving our pity as well. The perfect casting and superb acting carry this film and make into a believable piece of work. Having lived devoid of religious beliefs for the greater part of my life, I cannot follow in the footsteps of most of the characters in this film. And we should not forget this this happens in Poland, but even being from The Netherlands where I live, we know that their actions and beliefs are not extreme or otherwise unbelievable.",
         "I must say I am impressed with this deep showcase of thought provoking Polish cinema, more so that considering the topic of the story, it was co-written and directed by a women filmmaker Malgorzata Szumowska. This meditative drama won Teddy Award for Best Feature Film at the 63rd Berlin Film Festival in 2013 which is quite impressive in itself. The story evolves around a Jesuit priest Adam (Andrzej Chyra) who runs a place in a village in rural Poland for teenagers with behavioral problems that need a strong Catholic guidance. He himself seems like a good honest man, yet we can sense that under the mask of control he hides deep seated loneliness and longing for human contact. As the film progresses it is getting clearer that father Adam hides from the world that in fact he is gay and the reason why he became a priest at age 21 in is to hide this fact from himself and others. To extend predictably he gets emotionally involved with one of the boys which eventually has it's consequences. Homosexuality or pedophilia in Catholic Church is very sensitive subject therefor it is an interesting fact that it took a female director to look at the story with enough distance and taste to not make it scandalous or obscene. In fact the way the story is told resembles every other heterosexual romantic story and that is exactly were the dramatic straight of this film is. Watching \"In the name...\" (Polish title W imie...) another movie with a similar subject comes to mind called \"Priest\" (1994) though this British drama was much more graphic and less tasteful. There is a huge character depth here and the fact is that for audience who are more use to action based movies it might be too slow and deep. However if you enjoy powerful subtly acted character driven dramas this might be a movie that you will enjoy. Me having a brother who is a high ranking Catholic priest back in Poland I always admired the sacrifice the 'man of God' go through in their celibacy. Inability to feel human touch and intimacy always made me admire them for the straight of their character to give up on our most natural impulses. On the other hand the repression of does impulses creates a longing that often ends in perpetual loneliness and heavy depression. In a nutshell this is what \"In the name of...\" is about, choosing the homoerotic angle as a form of narration and to some extent pointing to priesthood as an escape of homosexual man who can not face their own desires and choose a path of a moral dogmas Catholic faith provides. It is a slow film but beautifully shot by also co-writer of the script Michal Englert and superbly, subtly acted by by Polish actors Andrzej Chyra, Mateusz Kosciukiewicz, Lukasz Simlat and Polish actress Maja Ostaszewska among others. The music composition by great instrumental score from composers Pawel Mykietyn and Adam Walicki is also a big part of the experience concentrating purposefully on many violin solos to enhance the emotional narration that pushes the film forward. All in all despite of it's sensitive and controversial topic this film got to offer a lot of intellectual feedback that might stay with you long after it's ending. For more of my reviews please go to: www.facebook.com/JanuszMadejTechnique",
         "To say the least. The movie will not leave you completely after watching it. Whatever reaction it does create, it will stay with you. It's not an easy or light theme it takes on. Therefor it had to be careful. But it is not too careful. You have scenes that are explicit in its sexual nature (even if not completely graphic). But it is the overall feeling this movie might leave you with and the moral choices the characters are taking. It is not easy to watch at all and you might understand the characters or you might start to hate some of them too. But I can't imagine anyone watching this, feeling nothing (even if its just disgust). The acting is really good and you get the feeling as if this is really happening (some might argue that it is close to some truth, which wouldn't be wrong I reckon). Tough but maybe still rewarding watch",
         "Wonderful treatment of the charged subject of men who love men in Catholic society and within the church in particular. Subtle script,phenomenal acting, and a very gentle approach to the characters and their humanness. Last but not least, every shot is a masterpiece of composition, lighting, and attention to colors and details. Undoubtedly this film presents a heretofore taboo topic and offers a human and livable solution to the real-life misery that so many men who love men have experienced over the ages, especially in conservative societies. Throughout the film I thought of it as one that only describes but prescribed a reality that it helps emerge by depicting it as an option. The main protagonist is so lovable and good-intentioned that it comes could really provide as a cobblestone on the path to social change vis-a-vis homophobia.",
         "Polish director Malgorzata Szumowska accomplishes an outstandingly effective, brave examination of Catholic priesthood with all the inherent difficulties both within the life of being a celibate priest in a time when the world's eye is focused on the abuses within the Church. She wrote the screenplay with Michal Englert who also is the cinematographer. The film succeeds not only because of the sensitivity of the script but also because of the extraordinary acting by several of the members of the cast. Adam (the brilliant actor Andrzej Chyra) is a Jesuit Catholic priest who discovered his calling as a servant of God at the relatively late age of 21 and has been transferred to many different parishes – the reasons are not completely clear. He is a kind, warm, caring and committed priest who truly cares of this flock. He now lives in a village in rural Poland where he works with teenagers with behavioral problems who fight and yell abuse. He declines the advances of a young brunette named Ewa (Maja Ostaszewska) saying he is already spoken for: Ewa is the love reason Adam's associate teacher Michal (Lukasz Simlat) left the seminary and never became a priest. But celibacy is not the only reason for his rejection. Adam knows that he desires men and that his embrace of the priesthood has been a flight from his own sexuality. When he meets Lukasz (Mateusz Kosciukiewicz, the director's husband), the strange and tongue-tied son of a simple rural family, Adam's self-imposed abstinence becomes a heavy burden. He hears the confession of a teen who has had a same sex encounter elsewhere and when a new addition to the camp Adrian/Blondie (Tomasz Schuchardt), the lad is seduced by Blondie and the result is the lad's suicide by hanging. Lukasz sustains a beating and seeks Adam's solace and healing at night, and that innocent tender encounter is observed by Michal. The Bishop is alerted and Adam must leave for yet another assignment. He is followed by Lukasz and at last Adam's quandary is at least for the moment resolved. The film is rich in metaphorical scenes – a Skype call between Adam and his Toronto based sister shares Adam's desperate need to have someone to hug, Adam turns to drinking and in his altered state he drunkenly dances with a photograph of the Pope – his only allowed passion, a funeral scene for the fallen lad, and a mesmerizingly beautiful religious celebration parade full of overtones. The film may for some be too huge in character depth and audiences more attuned to action based movies it might be too slow and deep and fragmented. Were it not for the brilliance of Andrzej Chyra's Adam the film may even offend some. But the total experience of the film is deeply moving.",
         "If I tell you the plot of Polish film 'W Imię...' (English title: 'In the Name of') centres around a priest posted to a boys' reform school, you'll probably be able to guess what the rest of the story is about - and you'll be right. Following a scandal involving an altar boy, the church authorities see fit to send worn-looking Father Adam to a place where he'll spend all day surrounded by husky youths who prefer to do their chores sans shirts - well, what could go wrong? The inevitable duly happens - whilst fending off the advances of a colleague's statuesque wife, the closeted Adam finds himself attracted to one lad in particular... ... however, said lad is a local village youth, so while there are obviously betrayal-of-trust issues, it's not as bad as if Father Adam was casting covetous glances at one of the boys in his care. And the boy concerned, Łukasz (whose nickname of 'Humpty' is at odds with his svelte body) has enough facial scurf that he should be comfortably above the age of consent, whatever that may be in Poland. (He's also an arsonist - can Adam pick 'em, or what?) One complaint: the amount of insect life in this film. Indeed, there are so many flies buzzing around in almost every scene it's like the village is in the middle of some biblical plague. But that apart, I enjoyed this. It's a slow-moving film, but in a good way: while there are scenes that are unexplained (eg: a religious procession; the sudden appearance of a bandage on Father Adam's hand), the viewer does not get a sense of wasted time nor of needless padding; the story progresses at its own pace, and the viewer happily follows along. While Catholics may have a problem with the subject matter - not to mention Adam's drunken dance with a portrait of Pope Benedict XVI - if they can get past that they'll find an engrossing human interest drama - and one that provides a surprise twist in the very last frame.",
         "This film is absolutely superb obviously made by an individual who is a true artist because every scene was like a painting they were so perfectly framed. And within these beautiful frames is the story of a handsome, sexy priest who is attracted to a handsome sexy man and guess what folks? As a recovering Catholic I can attest the fact that many priests are gay and even the current pope when faced with the issue was non-committal, stating that it was between the man and his Creator which I thought was a way of the final admission of the reality of the priesthood in the Catholic church. The fact that the priest's lover himself becomes a priest is simply further testimony to the fact that there are priests who are in love and are able to carry on a relationship within the boundaries of the church. I am at a loss to understand why men would choose to become priests knowing they are attracted to men but apparently according to the latest findings almost all men going into the priesthood are gay and that eventually gays will take over the church. Now that's something to think about.",
         "it can be beautiful, strange or ambiguous. courageous or to close by blasphemy. in fact, it is only impressive. cold and bitter, gray and strange, it is not exactly a love story but image of a self definition fight. the theme makes difference not for the story itself but for the status of ingredient in a Polish movie. and the most important virtue , in this case, is the performance who sustain not only the story but the intentions of director. it is not easy to say if it is a good or bad film. because, after its end, important remains only the feeling. a kind of emotion who makes the film to be part of your memories. and image of an isle in which nothing can be clear, nothing has solution or roots. a film about solitude of choices. and that is all.",
         "\"W imie...\" or \"In the Name of...\" is the newest collaboration between director/writer Malgorzata Szumowska and actor Andrzej Chyra. They worked together three years ago on \"Elles\" and ten years ago on \"Ono\". I felt that this project started off slowly, but quickly gained steam. It deal with the life and work of a priest, who is a homosexual, but suppresses his sexuality because of his profession. When he meets a boy who obviously has similar tendencies things start to heat up. All in all, I liked the movie. It's often thrilling and won't leave you unattached probably, even if you have no gay tendencies yourself or don't know anybody who does. There were a few scenes which felt random, like the woman trying to seduce the main character the way she did it with her husband years ago or suddenly another gay couple out of nowhere or the over-the-top reaction of the lead character's love interest when another boy accuses the lead character of being into boys. It just didn't fit his otherwise shy character. It's an ambitious project, which delivers most of the time and is certainly worth a watch despite its occasional weaknesses in writing. Chyra is very convincing and all the others give decent portrayals of characters where they really couldn't do much wrong. The acting is possibly the strongest component of the film. 100 exciting minutes and an ending which I liked a lot. With the huge quantity of gay-themed short films, it's always nice to see a full feature on the issue which reaches a certain level of quality. Well done to everybody involved.",
         "This is a disjointed, uninteresting moving. Scenes that should only last a minute go on for what seem like hours. Oh, it is so avant garde to have Adam walking along a country road for hours (!) carrying a monstrance with rock and roll sound track over. Really? Could have been so much more effective if done with less footage. Episodes occur that just don't seem to connect, and yet we know where everything is going, but there is so much superfluous crap along the way, that any intelligent viewer's attention is quickly lost. And every now and then a Polish cow lows in the distance or background off camera. What? Who are some of the earlier characters that appear in Adam's excursion to .... to .... to .... what? And how the hell does this movie end? He what? Who is that lurking in the near off-frame? Oh, yeah. But WHY? There is no connection to what went before really. The ending has no reason for why it is as it is. I found this one of the worst movies I have ever watched. Is this Polish gay cinema now? Snore!",
         "*** This review may contain spoilers *** I am gay and have known a couple gay priests so can evaluate this movie fairly well. Adam a closeted priest (is there any other option?) has trouble with his libido around young men---he is decent and does good work so the church just moves him around when anything questionable happens. The movie implies he is not completely innocent but after all human. He meets his true love whom he convinces to become a priest? (In final scene). I found some of the things distracting there are far too many group scenes in the first hour or so with scene after scene with a dozen boys talking at the same time....I really dislike this method of plot story development as it is frankly irritating. It is supposed to show the hectic atmosphere of this half way house from reform school. One or two such scenes would have been plenty--besides being annoying to take in; it makes the story line harder to follow. The movie is very pro-church perhaps only in Poland would such a movie be made... The couple priests I knew had no trouble being sexually active and frequenting gay bars playing pool with donation quarters etc... The \"happy\" ending is kind of corny...Indicating I suppose the Adam is a first and eventually gay priests will be married including to each other. Symbolism was literally spelled out in this movie with the T-shirt logos...and the Niagra supermarket being burned down by Adams lover---can't stop the force of so much water/love etc I suppose... The scenery has a touch of the digital to it but not in a bad way it actually enhances things the most perfect Polish countryside you'll never see....the light touch is key here. When ever trees have all their leaves moving is a give away. I like to see incidental gay characters not tragic problematic gay dramas no matter how real they are they....we are finally starting to see more of this thank God. Over all if you are pro religion this is a good thoughtful movie...it is too pro organized religion they are made out a bit too perfect also Adam is too perfect. I prefer thinking of them putting donation quarters in pool tables. That is the reality I witnessed. Recommend"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "MD4",
         "Mental Disorder 4",
         "Canal+ Polska"
      ],
      "summaries": [
         "Adam, a Catholic priest who discovered his calling as a servant of God at the relatively late age of 21, now lives in a village in rural Poland working with behavioral problem teens who fight and yell abuses. He declines the advances of a young brunette named Ewa, saying he is already spoken for; however, celibacy is not the only reason for his rejection. Adam knows he desires men and that his embrace of the priesthood has been a flight from his own sexuality. When he meets Lukasz, the strange and taciturn son of a simple rural family, Adam's self-imposed abstinence becomes a heavy burden.",
         "Gay priest with talent to straighten out delinquent lads can remain effectual only so long as not even a hint of his orientation is revealed or suggested."
      ],
      "budget": 0
   },
   "movielensId": 168128,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "2013-09-06",
      "dvdReleaseDate": null,
      "directors": ["Małgorzata Szumowska"],
      "runtime": 102,
      "movieId": 168128,
      "title": "In the Name of...",
      "mpaa": "NR",
      "actors": [
         "Andrzej Chyra",
         "Mateusz Kościukiewicz",
         "Maja Ostaszewska",
         "Maria Maj",
         "Łukasz Simlat",
         "Tomasz Schuchardt",
         "Kamil Adamowicz",
         "Mateusz Gajko",
         "Jakub Gentek",
         "Daniel Świderski",
         "Mateusz Malczewski",
         "Krystian Poniatowski",
         "Kacper Sztachański",
         "Kamil Konopko"
      ],
      "imdbMovieId": "2650642",
      "originalTitle": "W Imię...",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "hmgD42ZHiP8",
         "wu9rh2ZGq64"
      ],
      "plotSummary": "The contemporary story of a priest who launches a centre for troubled youth in a small parish. He is a good priest and is well-liked by his congregation, which remains unaware of his complicated past.",
      "tmdbMovieId": 160165,
      "avgRating": 3.3,
      "releaseYear": "2013",
      "numRatings": 5,
      "posterPath": "/oHa3pVFl5Ef9K3BmFlmwWs5ftkB.jpg"
   }
}