{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "perry mason",
         "id": 190901
      }],
      "imdb_id": "tt0107810",
      "video": false,
      "title": "Perry Mason: The Case of the Wicked Wives",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anthony Caruso",
               "gender": 2,
               "credit_id": "52fe49159251416c750bcf4b",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Della Street",
               "gender": 1,
               "credit_id": "52fe49159251416c750bcf4f",
               "name": "Barbara Hale",
               "profile_path": "/rXSq6M1Dr9JSfit4IhgBuUYIFqZ.jpg",
               "id": 109701,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ken Malansky",
               "gender": 2,
               "credit_id": "52fe49159251416c750bcf53",
               "name": "William R. Moses",
               "profile_path": "/1CyxlUIlr94SClztZZxFZkV4bHQ.jpg",
               "id": 68527,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49159251416c750bcf47",
            "name": "Christian I. Nyby II",
            "profile_path": null,
            "id": 68359,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.080234,
      "production_countries": [],
      "id": 92940,
      "vote_count": 1,
      "budget": 0,
      "overview": "Anthony Caruso, an old friend of Perry Mason, comes to Denver on the request of Dee Morrison. She's married to famed photographer David Morrison, who wants to shoot a photo featuring his former models. The tricky thing is that all of his former models are also his former wives. But Dee knows Anthony can convince them to do it which he does. And David shoots them. Later Dee catches David it what appears to be in an inappropriate situation with his assistant. They have an argument and she leaves. Later David is found dead and she's arrested and Anthony defends her. And he suspects it could have been one of the wives",
      "similar": [
         94105,
         169917,
         1645,
         37257,
         910,
         369300,
         89463,
         85753,
         1427,
         4771,
         769,
         186,
         949,
         1586,
         22803,
         205,
         320,
         180,
         189,
         431
      ],
      "original_title": "Perry Mason: The Case of the Wicked Wives",
      "runtime": 96,
      "poster_path": "/8DVa479z4vonp8c010AlZqBbPo4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1993-12-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christian I. Nyby II"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Joyce Burditt",
         "Erle Stanley Gardner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107810/",
      "coverLink": null,
      "actors": [
         "Paul Sorvino",
         "Barbara Hale",
         "William R. Moses"
      ],
      "reviews": [
         "Mr. Sorvino was great in the type of role that Raymond Burr began and I expect many even before him. I must admit that as a first time in the PM format I looked forward to more. the character was just beginning to be developed and he was charming to all and talents without [it appeared] limits. Too bad the network or the producers or the writers or whoever is responsible didn't see that this character was worth pursuing. Many long time viewers may have been questioning because Mr Burr was so fully ensconsed in the role, but Mr. Sorvino's character could have been a second rate copy or a first rate new version. I thought it could have been truly first rate. Too bad it was one and done.",
         "I think the humor in this movie, although it's not really supposed to be humorous per say, was up there. I think this movie was incredible with Paul Sorvino in the lead role. Raymond Burr was greatly missed, but the supporting cast did a wonderful job. Especially Moses! Moses's Ken Malansky found himself in a lot of sticky situations which added humor to the movie. I think Barbara Hale, although she wasn't in it enough, did an awesome job playing her part. There was proof of team work here and Hale and Moses make an awesome team. I don't think they could've done better than this really. God bless the both of them for trying!",
         "With the passing of Raymond Burr, Paul Sorvino stepped into the brilliant lawyer's part with interesting results. Sorvino proved his resourcefulness here but did we have to have the opera singing? We know that Sorvino, in real life, could hit the operatic notes but good, but that wasn't necessary here. Still, we have a very good story with 4 ex-wives of a real cad coming together to work with the latter. Naturally, when the cad, played with relish by Eric Braeden, is murdered, suspicion falls on each of the women. Since his current wife was arguing with him over his latest flirtation, she is the one who is arrested. That ending, as always, was totally unexpected but had the real Mason touch. Barbara Hale looked like she was grieving here in her brief stint as Della Street. William R. Moses, Ken Malansky, had plenty of physical footwork here and is to be commended for great physical dexterity. Or, what there a stuntman involved? Surprisingly, McEachin, who played the black detective always sarcastically involved in words with Mr. Mason, has none of that here and that is missed.",
         "Stepping into the place of Raymond Burr after his demise is Paul Sorvino who made his one and only appearance as opera loving gourmet attorney Anthony Caruso. As we see in the opening he operates like Perry Mason as he gets a confession and the evidence on the real murderer. Right after that Caruso is retained by Kathy Ireland the fifth and current wife of Eric Braeden who is a world famous fashion photographer who has seen his better days. But Braeden is planning a comeback and he's going to shoot a new show with five models whom he made world famous icons. Like Ireland, the other four have been his wives as well. But when Braeden is murdered it's Ireland who Detective James McEachin of the Denver PD arrests. Now Sorvino is Ireland's attorney and he gets the use of Perry Mason's office along with Barbara Hale and William R. Moses. There's never any explanation of what happened to Perry Mason. William R. Moses has an especially bad time in this story trying to track down a witness whose relationship to one of the ex-wives is the key to the whole case. He has to go into the Brokeback Mountain country and be at the mercy of some cowboys who are definitely not Heath Ledger and Jake Gyllenhaal. Although I liked Sorvino apparently either he did not want to do a series or the viewers didn't take to him because Hal Holbrook came in with a different character. Probably folks would accept no other in Perry Mason's shoes.",
         "Perry is away in Washington so Anthony Caruso covers his practice for him for a short while. Anthony is busy helping out his friend David Morrison to bring together al his old models for a retrospective photography collection. However David's ex-models are all his ex-wives and the animosity between them is very clear. On the first night of the shoot a witness sees David's current wife kill him and flee the scene. Anthony believes she is innocent and steps in to defend her. Meanwhile Ken goes after another woman who may have been having an affair with David and has since vanished. Perry is `in Washington' for this film, which sounds like something you'd tell a child instead of having to explain that Granny has died. Indeed that is the case as Burr was dead and never made another Mason movie. However rather than have the taste and sense to finish the series, the producers decided to spin it out. In this instance that decision was ill-advised. The plot doesn't work. In order to get Anthony involved in a big case, it as to be with people he knows \u0096 thus the tortuous opening where he gets all the ex-wives together. This makes the film feel ill at ease with itself \u0096 Anthony never really rips into or exposes the suspects as they are all friends \u0096 plus none of the group seem to struggle with this at all, making it seem like they are strangers. Malansky's investigation is long and dull with moments thrown in just to try and liven things up a bit. The conclusion is silly even by the standards of this series. Would you take something from the murder scene? Would you have it on you when you are in the witness box? No? Well the guilty party does and it is this that traps them \u0096 it's daft and he/she is totally unbelievable and it feels so very lame that it's hard to really care! Sorvino is an interesting choice to play in the lead but he doesn't work. It doesn't feel natural having him walk round singing while one of his friends is a murderer and too much is made of him being an Italian. Aside from that I found it very hard to shake the image of Goodfella's Paulie from my brain and half expected him to order Ken to whack somebody! Sorvino struggles with a role that ties him into a case emotionally but doesn't allow him to express anything \u0096 I suspect he didn't want a second try and he didn't return for another role in the series. Moses is OK as is Hale but they are exposes without Burr and Hale has little to do. The support cast are OK but none are as interesting as the usual array of red-herrings etc. They are only good as eye candy as they are a few models etc \u0096 Johnson standing out cause she looks a lot better here than she has recently! Overall this is a pretty poor film and it highlights how good burr was in holding everything together in a familiar way. This has a plot that is a bit of a mess, characters who don't ring true in a silly situation and the whole thing just crawls to it's dumb climax, by which time I'd long since given up caring!",
         "THE CASE OF THE WICKED WIVES is a workable PERRY MASON mystery and the first made after the death of star Raymond Burr. This time around, the similarly bulky Paul Sorvino plays a similarly hotshot lawyer rival of Mason's, taking on the murder of a fashion designer and fighting to clear the name of the man's accused wife. A flirty assistant and no less than four ex wives muddy the waters somewhat, so there are a great deal of sub-plots and back stories to pad out the running time. Barbara Hale and William R. Moses are still present in the story, the latter getting involved in some outdoor shenanigans that have very little to do with the central legal story. It does feel dated and low budget in parts, but it's not the worst of the series either.",
         "This review indirectly reveals the killer. Paul Sorvino is very much the star of this episode, and pretty much the only reason for watching. (Eric Braeden is perhaps another.) His Anthony Caruso is the opposite of the dark, often humorless Perry Mason. But like Mason, we believe he's a sharp criminal lawyer -- who just happens to be a talented chef, and a semi-talented opera singer. (Note the character's name.) The plotting is strange for a \"Perry Mason\" story, in that the obvious killer (suggested early on) is, indeed, the killer. The only thing that needs explaining is the motivation. Plot hole: How did the killer get the bloody dress and murder weapon in the trunk of the defendant's car? Trivia: Note that the prosecuting attorney is named Markham. This appears to be a thinly veiled reference to the star of \"The New Perry Mason\", which bombed badly.",
         "***SPOILERS*** With the passing of actor Raymond Burr Perry Mason was written out of the script with Perry going to Washing D.C to be confirmed by the US Congress as the next Supreme Court Justice. In Perry's big shoes there stepped in the opera singing defense attorney Anthony Caruso, Paul Sorvino, who can not only sing up a storm but cook,in being a master Italian chef, up one as well! It's when Caruso gets the news that his good friend fashion photographer David Morrison, Eric Braeder, needed him to get his former top models as well as wives together to do a photo shoot that will very possibly get him out of bankruptcy he jumped at the offer! It was David's latest wife Dee, Kathy Ireland, who got Caruso to take up the case of contacting his former wives Abby Jane Shelly and Nina, Shelly Hack Beverly Johnson Maud Adams and Kim Alexis, whom he was also involved in their divorcing proceedings against his client David! During the middle of his photo shoot Dee became very annoyed at David when she spotted his assistant Margo, Paula Marshell,leave his private dressing room buttoning up her blouse indicating that he was involved in some hanky panky with her. Sure enough that evening David ended up dead with a sword through his chest with the woman spotted leaving his studio identified,from behind, as his outraged wife Dee! It's now up to Caruso to forget about helping David out in his finances, since by being dead he doesn't need his help anymore, but to get his wife Dee off on a murder charge in being the person who did David in! The movie soon leads to the great outdoors where Margo and her cowboy boyfriend Cutter, Yargo Constantine, are hold up which at first doesn't seem to make any sense in David being murdered! It up to human punching bag and Caruso's news assistant Ken Malansky,William R.Moses, to track down the pair with the help of local cowboy Big Red, Ron Headlee, to show Manansky the ropes in him surviving in the wild! Malansjky doesn't let the audience down with him getting a far worse beating, from all sides, then you would have expected him too as well as, by riding for days at a time, a serious case of saddle sores! ****SPOILERS*** It's Caruso,after he took time to stop both singing and eating, who in the end uncovered the reason behind David's murder. As usual it had to do with David's unfeeling and selfish lifestyle where he not only took the women that he married, Abby Jane Shelly & Nina,for a ride but also their, and his, family members as well! In this case it was someone so close to him that if David had any brains in his head as well as just plain common sense he would have known who that person was as soon as he laid eyes on her!",
         "I am not sure where they went wrong on this one. They tried to throw a curve by having the obvious suspect actually be guilty. They continued the trend of showing Ken Melansky bumbling around again before getting bailed out by others to do his job. The casting is inspired, with 4 beautiful actresses lead by Octopussy (Maud Adams) herself. They replace Burr with an Italian Tenor / Chef attorney. They even cast Eric Braeden, TV vet of the Young & Restless & the Rat Patrol as the victim. I think the big problem is a flat script. It's kind of like the production company itself lost a lot of inspiration on Burr's death. If they had thrown in a funeral for Perry, it would fit the mood. There is very little fun in this one. I only wish they could have given the lady actresses more scenes & more to do, but the story prevented that. I think you should skip this one unless your desperate for a mystery or perhaps like looking at an interesting casting experiment. That is all there is too this one.",
         "I thought this movie was OK. The cast seemed to be doing their best but in my opinion they were missing someone essential! Raymond Burr who would usually play the main character of Perry Mason died before this movie was made. It's still an OK story but having seen other TV movies with Burr in, I don't think this one is quite so good."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Dean Hargrove Productions",
         "Fred Silverman Company",
         "Viacom Productions"
      ],
      "summaries": ["Anthony Caruso, an old friend of Perry Mason, comes to Denver on the request of Dee Morrison. She's married to famed photographer David Morrison, who wants to shoot a photo featuring his former models. The tricky thing is that all of his former models are also his former wives. But Dee knows Anthony can convince them to do it which he does. And David shoots them. Later Dee catches David it what appears to be in an inappropriate situation with his assistant. They have an argument and she leaves. Later David is found dead and she's arrested and Anthony defends her. And he suspects it could have been one of the wives."],
      "budget": 0
   },
   "movielensId": 168132,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-12-17",
      "dvdReleaseDate": null,
      "directors": ["Christian I. Nyby II"],
      "runtime": 96,
      "movieId": 168132,
      "title": "Perry Mason: The Case of the Wicked Wives",
      "mpaa": "",
      "actors": [
         "Paul Sorvino",
         "Barbara Hale",
         "William R. Moses"
      ],
      "imdbMovieId": "0107810",
      "originalTitle": "Perry Mason: The Case of the Wicked Wives",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["z5ozBWpJsZA"],
      "plotSummary": "Anthony Caruso, an old friend of Perry Mason, comes to Denver on the request of Dee Morrison. She's married to famed photographer David Morrison, who wants to shoot a photo featuring his former models. The tricky thing is that all of his former models are also his former wives. But Dee knows Anthony can convince them to do it which he does. And David shoots them. Later Dee catches David it what appears to be in an inappropriate situation with his assistant. They have an argument and she leaves. Later David is found dead and she's arrested and Anthony defends her. And he suspects it could have been one of the wives",
      "tmdbMovieId": 92940,
      "avgRating": 2.5,
      "releaseYear": "1993",
      "numRatings": 1,
      "posterPath": "/8DVa479z4vonp8c010AlZqBbPo4.jpg"
   }
}