{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt5231812",
      "video": false,
      "title": "Staying Vertical",
      "recommendations": [
         328930,
         339258,
         356218,
         151731,
         23388,
         112912,
         94180,
         411014,
         51725,
         150065,
         362216,
         41355,
         221094,
         381038,
         205077,
         317916,
         344039,
         398287,
         408024,
         395452
      ],
      "backdrop_path": "/n6LI0mnDUrnrCsjbTKB15Xr4wKG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Léo",
               "gender": 2,
               "credit_id": "572fbd5592514108a9000f74",
               "name": "Damien Bonnard",
               "profile_path": "/2XYsRJdDJdkZzoiHeuqpjBKM7eK.jpg",
               "id": 579211,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Marie",
               "gender": 1,
               "credit_id": "572fbd6592514118d3002c44",
               "name": "India Hair",
               "profile_path": "/f7SMb2wy5rEjcO7TIzpljRp74Ea.jpg",
               "id": 555967,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jean-Louis",
               "gender": 0,
               "credit_id": "572fbd999251413e52001526",
               "name": "Raphaël Thierry",
               "profile_path": "/cbpo6XicX4cMGajTWAomOJT5wHW.jpg",
               "id": 1617035,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Marcel",
               "gender": 0,
               "credit_id": "572fbdb9c3a368496e0025d3",
               "name": "Christian Bouillette",
               "profile_path": "/AnR84Rv55xq0mJEpPVZMWFRRuZU.jpg",
               "id": 37609,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Yoan",
               "gender": 0,
               "credit_id": "572fbdf1925141463700097a",
               "name": "Basile Meilleurat",
               "profile_path": "/5ToYMUexvSnIjc3Sq6f56fNid3Q.jpg",
               "id": 1617038,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mirande",
               "gender": 0,
               "credit_id": "572fbe01c3a3687cc9002265",
               "name": "Laure Calamy",
               "profile_path": "/uGzpCudbsEW8AEAcJ7RutBctGsn.jpg",
               "id": 983929,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "582fc6dcc3a3685bb0004840",
               "name": "Rémi Burah",
               "profile_path": null,
               "id": 32463,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "582fc6efc3a3685b9a004bd1",
               "name": "Stéphane Batut",
               "profile_path": null,
               "id": 72324,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56af7aacc3a3681c4700d348",
               "name": "Alain Guiraudie",
               "profile_path": "/lbPtScuyzR4NsFQfgDkBq7FEUw4.jpg",
               "id": 238384,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "572fbc46c3a36874eb00179e",
               "name": "Alain Guiraudie",
               "profile_path": "/lbPtScuyzR4NsFQfgDkBq7FEUw4.jpg",
               "id": 238384,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "572fbc8c925141463700091a",
               "name": "Claire Mathon",
               "profile_path": null,
               "id": 1090814,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "572fbccdc3a3682faa001e31",
               "name": "Jean-Christophe Hym",
               "profile_path": null,
               "id": 71627,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "572fbcda92514108a9000f5c",
               "name": "Sylvie Pialat",
               "profile_path": "/2dOh2C7iVKXshtZkJHApGNH2zle.jpg",
               "id": 49067,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "572fbd379251413bd90023f1",
               "name": "Benoît Quainon",
               "profile_path": null,
               "id": 1174345,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "582fc6e4c3a3685b9a004bc8",
               "name": "Olivier Père",
               "profile_path": null,
               "id": 1451497,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "582fc6fcc3a3685bb0004864",
               "name": "François Labarthe",
               "profile_path": null,
               "id": 1174344,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "582fc70492514162c9004b26",
               "name": "Adélaïde Le Gras",
               "profile_path": null,
               "id": 1710810,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "582fc70bc3a3685b96004423",
               "name": "Violet Sabrina",
               "profile_path": null,
               "id": 1710811,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.881414,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 380622,
      "vote_count": 19,
      "budget": 0,
      "overview": "Screenwriter Leo is searching for the wolf in the south of France. During a scouting excursion he is seduced by Marie, a free-spirited and dynamic shepherdess. Nine months later she gives birth to their child. Suffering from post-natal depression and with no faith in Leo, who comes and goes without warning, Marie abandons both of them. Leo finds himself alone, with a baby to care for.",
      "similar": [],
      "original_title": "Rester vertical",
      "runtime": 98,
      "poster_path": "/3Q0iRB26y60JVW6HpbOru1BnH4h.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Les Films du Losange",
            "id": 223,
            "origin_country": ""
         },
         {
            "logo_path": "/z0vTTWBhZggM09oZWSY3hbXgPKv.png",
            "name": "Wild Bunch",
            "id": 856,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Arte France",
            "id": 6111,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arte France Cinéma",
            "id": 6916,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les films du Worso",
            "id": 7395,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciné+",
            "id": 10611,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Région Languedoc-Roussillon",
            "id": 12054,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Région Midi-Pyrénées",
            "id": 28793,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Département de la Charente-Maritime",
            "id": 71863,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Région Poitou-Charentes",
            "id": 76911,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinémage 10",
            "id": 78936,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinéventure",
            "id": 83524,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Indéfilms 4",
            "id": 83525,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2016-08-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Guiraudie"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Alain Guiraudie"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt5231812/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYWFkZjViYTAtNjljNy00MDU2LTkyNWUtZDBiMDI5ZmY0NzBjXkEyXkFqcGdeQXVyNjMzMzMwMw@@._V1_UY268_CR6,0,182,268_AL_.jpg",
      "actors": [
         "Damien Bonnard",
         "India Hair",
         "Raphaël Thiéry"
      ],
      "reviews": [
         "Seen at the Viennale 2016: A guy loses his creativity and drifts loose through his best years. But to be honest, we do not know whether this guy was creative in the first place. We can only assume that, because it might be logical. Maybe the whole movie is just some sort of insider-joke for filmmakers. I liked the sexual freedom of this movie, but could not follow the story itself. Many actions of the main guy seemed to happen out of nothing, without the wish of doing something with aim. Without any hint, why the guy is doing what he is doing I (and my brain) was benumbed. Maybe the script writer and the director of that movie had the same problem as the guy. No aim for the movie, no direction. Such is life. Sometimes.",
         "In the 1960s, many French movies were dubbed 'New Wave' because they were so unusual and violated the accepted rules of stories and filmmaking. Characters and plots no longer had to make sense, happy endings and other clichés were abandoned and many of these films were very confusing to many in the audience. Love 'em or hate 'em, they certainly were unique. Not surprisingly, however, over the years the French film industry and their films evolved and the years of deliberately breaking the rules of the New Wave filmmakers slowly disappeared and became more mainstream. In many ways, \"Staying Vertical\" is a modern take on the old French New Wave. Like the New Wave, much that the main character does makes little sense, there does not appear to be much context for what occurs and the film itself seems to deliberately avoid having any sort of meaning or coherence. Add to that a very modern sense of sexuality and sexual freedom you don't have in the older New Wave films and you essentially have \"Staying Vertical\". The story is revolves around Leo. You really know nothing about Leo other than he exists. He keeps making phone calls begging for money and he keeps pursuing a handsome young man while at the same time taking up with a shepherdess with two kids of her own\u0085and, not surprisingly, she soon has Leo's baby. Oddly, despite all this, Leo never once smiles or emotes or shows any connection to anyone\u0085and not surprisingly she soon abandons Leo. What is surprising is that she's left their colicky baby with him. Through the rest of the film, Leo takes the baby in tow on a wide variety of odd adventures that culminate in Leo making the newspapers\u0085and for something that sounds very sick when you read the paper's headlines. I must warn you, this film is incredibly explicit and could easily offend. While it's never exactly clear whether Leo is bisexual or is a gay man using the Sheperdess, you have some incredibly surprising scenes. You see close ups of genitalia and erections as well as a super-bizarre sex scene involving Leo and a dying old man. It is certainly not a film for the easily offended and shows an extreme range of sexuality. You also get to see close ups of a baby being born--- and it's no stunt baby or model! So is all this worth seeing? Well, for me, no\u0085but if you love the French New Wave you might be able to find something in the picture worth seeing. I kept hoping my questions would be answered and some coherence would result\u0085sometimes it did, but more often it didn't. But worse than the lack of meaning and strangeness, I hated the lack of emotion throughout the film. Apart from one very, very brief outburst by Leo late in the film, Leo simply exists and shows zero emotion\u0085 and it's the same with the rest of the characters. All of them are people existing\u0085going through the motions of life but not living. Overall, it's a very difficult and confusing film and perhaps one that might be better to be watched and discussed with friends instead of seeing it alone. As for me, I adore French movies but cannot wholeheartedly recommend this one.",
         "Seen at the Rotterdam Film Festival 2017 (website: iffr.com/en). Unorthodox story with convoluted relationships. The film title gets a double meaning at the very end with an original twist, although the rest of the movie is also a matter of staying alive and well, hence suits the various stories very well. With one female and four male main protagonists, gay relationships can be expected albeit very different from the mostly one-to-one overload we saw in predecessor L'Inconnu du Lac / Stranger by the Lake (2013) by the same director. On the other hand, the relationships in the latter were relatively straightforward (due to the \"straight\" in it, not the best choice of words, no pun intended). In any case, \"Stranger by the Lake\" followed standard rules with respect to cruising and making love, contrary to this \"Staying vertical\" that extends the forming of couples far beyond that. It also shows that gay and straight are not black and white orientations in distinct parts of the relational world, thereby very well demonstrating that people can switch easily between both, and be happy òr unhappy in either circumstance. Overall it is not clear what it is that these people do tick. Except for the father and daughter couple who herd sheep for a living, no one else seems to have a real purpose in life, nor are they otherwise involved in serious business. The movie opens with a scene where our main protagonist stops his car while spotting a young man on foot along the road, he compliments him about his appearance and asks him whether he might be interested in a screen-test (the usual excuse). The young man flatly refuses and disappears from the scene. When asking around, this young man lives in a house nearby, but does not answer when called, and his father sitting on a bench before the house flatly says that it is no use calling further as contact is not desired. Of course, our main protagonist is not prepared to let go of someone looking so attractive, and returns later for a new attempt. In the meantime, he parks his car and crosses the landscape with his backpack on the lookout for wolves. He encounters a woman herding sheep, who explains him why wolves are bad news. They chit-chat a bit further, so a new connection seems on the agenda. It becomes more complicated, however, after returning the sheep to their stable later that day. Of course, he is invited for dinner and meets her father. Relationships do not develop along the usual lines, and be aware that more unusual turns of events are to follow. The common borders between hetero/homosexual are to be blurred severely, as are the common demarcations in relationships between generations. All sex is on a consensual basis, albeit some rather out of the ordinary. All in all, less interesting and informative than 2013-predecessor Stranger By The Lake, yet the unexpected relationships and unorthodox ways to have sex, make this movie a good watch, all that augmented by showing what is involved in herding sheep and keeping wolves away. My 7-score (out of 10) is contradicted by the average festival visitor who awarded this movie a lowly 139th place (out of 172).",
         "Sorry for the sad people (aka gay), this is crazy and puky. The joke is on the hero, some sort of spineless animal vaguely interested in wolves. He goes down by laziness, no drug involved! I was bad during all the sad (aka gay) part, but perked up funny again when he bunked with the sheeps. Overall: funny parts and puky parts. Not likely to happen in real life.",
         "This film has such a strong quirk to it's plot that's easy to put in opposition to quirks & troubles of your own life. And the very ending is when the entire film unwraps before your eyes again; then the quirky plot ceases to matter and the message is absorbed with such intensity that leaves one gasping. All this beside an almost constant visual stun.",
         "I'm sorry I watched any of this filth. And why is there no rating? I love these movies that claim they are artistic when in fact the scenes I witnessed have no respect for women. Period. The sex scenes which are full close ups of a woman's crotch and then a close up of a vaginal delivery w hemhroids and a dr shoving fingers into the woman's anus are disrespectful and seem more about gore and disgust for women's genitalia. Why do we never see the penis! I read once the penis was considered a threatening object. Anyway, I'm sick and tired of movies and reviews claiming this is art. It's not. It's pornography and misogyny. This writer/producer hates women.",
         "After finally being put on the map among the rarified clique of international auteurs/provocateurs in the wake of all the plaudits receiving from STRANGER BY THE LAKE (2013), French filmmaker Alain Guiraudie's next offering is as sexually bluff as his devotees could envision, STAYING VERTICAL, debuted in 2016 Cannes' main competition, is a step-up in Guiraudie's unrelenting probing into the mythos of sexuality, but less gripping and cohesive in its narrative nexuses, compared with SBTL. We follow the steps of a filmmaker Leo (Bonnard), traverses cross the expansive plateau in Lozère, southern France, looking for impetus of his script in demand, where he encounters a shepherd girl Marie (Hair), and within 15 minutes of its screen-time (genitalia aplenty), he impregnates her and Marie delivers a baby boy (the unforeseen advent of an authentic parturition is as horrific as it is awe-inspiring, impresses with an almost hallow revelation how each human being is brought into this world through such an unsightly ritual), but Marie rebuffs the idea of fostering their baby together, and spirits away with her two other elder sons to the town, and leaves the newborn completely in Leo's charge, on the condition that if a man can leave under that circumstance, why a woman couldn't? (feminism in its progressive payback) Not a recommendable parental philosophy, but Leo has no grounds to change that. During his constant commuting between Marie's rural house, where he stays with Marie's father Jean-Louis now (Thiéry, a first-time actor imbues an unforeseen tenderness contrary to his ape- like appearance, never judging a book by its cover rams home), and the modern town where he works, Leo clocks an elderly man Marcel (Bouillette), sitting outside his countryside house, attended by a young man Yoan (Meilleurat), whom in the opening scenes, Leo accosts to see if he is interested in auditioning for a movie, and the answer is a blunt no. Juggling his single-parent duty, the deadline of his clogged script and financial plight, a further involvement into Marcel and Yoan's touch-and-go relationship, Leo's behavior will slip into an ever-erratic r0ute (strewn with gerontophilia, euthanasia and off-center sessions in the forest) until he is deprived of the guardianship of his child. In the final chapter, a bearded Leo comes face to face with a pack of wolves, and claims that \"stay vertical\" is the only way to avoid the ferocious attack, the story ends there. Overtly oblique in its message from Leo's crucible of marshaling his life out of a murky situation, Guiraudie does something valiant to normalize pansexuality in the forefront, and continues desensitizing our inveterate cringing towards graphic sex scenes and our own body parts. Also, it is a numinous ode to the deep-dry myth of mother nature where man's basic desire meets the formidable threat looming and haunting our human society.",
         "It occurred to me after watching this film that the strange dance that Leo and Yoan do through each others lives, as well as their strong physical resemblance (Leo looks Yoan with his age doubled) that this narrative is a meeting of the central character with his younger self. Leo is very interested in Yoan, while the latter seems to utterly hate his older self just as much as he enjoys flaunting his bad choices and desire for all the things that Leo has thrown away--i.e. his relationship with Marie as well as an affair with her father. Ultimately this ends for Leo when his younger self manages to steal from him the thing he loves the most--his own child."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Les Films du Worso",
         "Arte France Cinéma",
         "Canal+"
      ],
      "summaries": [
         "Filmmaker Leo is searching for the wolf in the south of France. During a scouting excursion he is seduced by Marie, a free-spirited and dynamic shepherdess. Nine months later she gives birth to their child. Suffering from post-natal depression and with no faith in Leo, who comes and goes without warning, Marie abandons both of them. Leo finds himself alone, with a baby to care for.",
         "A film maker has to raise a child by himself whilst looking for an inspiration for his new film."
      ],
      "budget": 0
   },
   "movielensId": 168210,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2016-08-24",
      "dvdReleaseDate": null,
      "directors": ["Alain Guiraudie"],
      "runtime": 98,
      "movieId": 168210,
      "title": "Staying Vertical",
      "mpaa": null,
      "actors": [
         "Damien Bonnard",
         "India Hair",
         "Raphaël Thierry",
         "Christian Bouillette",
         "Basile Meilleurat",
         "Laure Calamy"
      ],
      "imdbMovieId": "5231812",
      "originalTitle": "Rester vertical",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["m2e4ReIheto"],
      "plotSummary": "Screenwriter Leo is searching for the wolf in the south of France. During a scouting excursion he is seduced by Marie, a free-spirited and dynamic shepherdess. Nine months later she gives birth to their child. Suffering from post-natal depression and with no faith in Leo, who comes and goes without warning, Marie abandons both of them. Leo finds himself alone, with a baby to care for.",
      "tmdbMovieId": 380622,
      "avgRating": 2.875,
      "releaseYear": "2016",
      "numRatings": 8,
      "posterPath": "/3Q0iRB26y60JVW6HpbOru1BnH4h.jpg"
   }
}