{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0024824",
      "video": false,
      "title": "Allez Oop",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Elmer",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f8150373",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Paula Stevens",
               "gender": 1,
               "credit_id": "52fe47f0c3a36847f8150377",
               "name": "Dorothy Sebastian",
               "profile_path": "/gTS9GoAiTZg0FIE2HoduEMn0a8y.jpg",
               "id": 143820,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "The Great Apollo",
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f815037b",
               "name": "George J. Lewis",
               "profile_path": "/ktf2QCGC00b8JImlmLHfpo9PVEB.jpg",
               "id": 120061,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f815035d",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f8150363",
               "name": "Charles Lamont",
               "profile_path": null,
               "id": 29627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f0c3a36847f8150369",
               "name": "Ewart Adamson",
               "profile_path": null,
               "id": 144022,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f0c3a36847f815036f",
               "name": "Ernest Pagano",
               "profile_path": null,
               "id": 108795,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.067868,
      "production_countries": [],
      "id": 51374,
      "vote_count": 1,
      "budget": 0,
      "overview": "When Buster's girlfriend falls for a trapeze artist, Buster tries to beat him at his own game.",
      "similar": [
         21385,
         383498,
         460793,
         74643,
         10527,
         568,
         597,
         37724,
         19,
         49026,
         54138,
         52520,
         158852,
         140607,
         157336,
         56292,
         155,
         81003,
         68726,
         75612
      ],
      "original_title": "Allez Oop",
      "runtime": 21,
      "poster_path": "/8feI40xCB0KNAZeCCybMy0d4VR0.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1934-05-25",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Lamont"],
      "runtime": 21,
      "synopsis": null,
      "writers": [
         "Ernest Pagano",
         "Ewart Adamson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024824/",
      "coverLink": null,
      "actors": [
         "Buster Keaton",
         "Dorothy Sebastian",
         "George J. Lewis"
      ],
      "reviews": [
         "Buster Keaton produced his best work during the silent era. Although his talkies are said to be poor, fans know that Buster occasionally managed to rise above his personal difficulties and summon a touch of the old magic. This was especially true of the series he made for the Poverty Row studio Educational Pictures; the films were cheaply produced but a few of them offer a decent sample of Keaton's characteristic approach to comedy. In the second short Allez Oop our somewhat battered hero gives it the old college try, and the results are surprisingly satisfying. Buster plays a shy jeweler named Elmer -- the proprietor of Ye Olde Clocke Shoppe, no less -- whose job brings him into contact with Paula Stevens (Dorothy Sebastian), a lady who needs to have her wristwatch repaired. After various complications Elmer escorts Paula to a circus, but unfortunately she falls for a trapeze artist who calls himself The Great Apollo. The guy turns out to be a cad and a coward whose craven behavior nearly costs Paula her life. Elmer, happily, comes to her rescue, ironically adapting trapeze skills with gratifying success. This film marked an on-screen reunion between Buster and Dorothy Sebastian, his leading lady from the 1929 feature Spite Marriage, another former MGM star who was having career problems of her own. The two of them have a nice rapport, notably in their first scene at Paula's home, when Buster tries to summon the courage to ask her out while Dorothy gently nudges him along without being too \"forward\" about it. It's a sweet scene, and proves that Buster could handle dialog when it was properly suited to his character. The stunt sequence on Buster's jerry-rigged high-wire is modestly amusing but isn't helped by the over-emphatic music or the moments of under-cranking (i.e. fast motion), which usually looks cheesy in talkies. Besides, it wasn't necessary. Buster didn't need camera tricks to be funny. But the flaws are minor ones, and it's a huge plus that Buster proves himself a hero in the finale, a welcome throwback to his silent era glory days. All too often, in his MGM sound features and the later Columbia shorts, he comes off as a hopeless dweeb who bungles everything. Here, as in The Cameraman, the handsome rival shows his true colors in a crisis while Buster rises to the occasion and saves the day. It's too bad that so many of Keaton's talkies followed the wrong pattern for Buster's character, but Allez Oop is a happy exception. P.S. Speaking of career trouble, watch for Harry Myers sitting next to Buster in the stands during the circus scene. That's the same Harry Myers who co-starred with Chaplin in City Lights a few years earlier, now reduced to a wordless bit role at Educational. He makes the most of his scene, but it's a sad comedown.",
         "Overall this is a solid feature, rather than an especially good one, yet it does contain a couple of sequences that are quite good, and that for a few moments hearken back to Buster Keaton's glory days. Some of the material does not really give Keaton that much of a chance to use his best talents, but he and the rest of the cast get pretty good mileage out of the story. The story has Buster involved in a rivalry for the attentions of Dorothy Sebastian. Since his rival is a trapeze artist, Buster feels the need to compete with him on his own ground. There are a couple of sequences that work particularly well. Early in the movie, Keaton and Sebastian have a complicated miscommunication, and it is handled well, getting good mileage out of it. Later on, Buster has some funny moments in trying to demonstrate his agility. As in some of his silent features, when Keaton plays a clumsy character, he actually demonstrates his own considerable physical agility even as he performs pratfalls. Overall, this is a solid slapstick comedy that is worth seeing. The setup is a familiar one, yet the story is not all that predictable, and there are at least a couple of sequences that give Keaton some good material to work with.",
         "Buster Keaton plays a guy who runs \"\"Ye Old Clockee Shoppe\" and one wonders how he can stay in business since he's completely inept at fixing timepieces. This film starts off very slowly., taking almost half of the total time to just to set up the premise of Buster trying to win the affections of Dorothy Sebastian over a rival, played by George J. Lewis.. \"Elmer\" (Keaton) is enamored with \"Paula\" (Sebastian) the moment she walks into his shop, and the two play off each other with mild and drawn-out slapstick gags, none of which are really that funny, to be honest. After nine-and-a-half minutes, the action perks up a bit as Buster takes her to the circus on a date. Unfortunately, she's immediately taken by the trapeze artist. Poor Buster; he can't catch a break.. She asks Buster - rather tells him - to go get an autograph from the trapeze artist who tells him, \"tell the woman to come by herself. If she's good-looking, maybe I'll give her my autograph.\" That tells you what kind of jerk \"Apollo The Wonderful\" is, which makes \"Elmer\" look all the better. The best parts of the film are all in the last 6-7 minutes with Buster attempting to learn how to be a trapeze artist by rigging up things in his backyard.....with humorous results. The ending - the final 2-3 minutes - is almost shocking because it becomes very dramatic with Buster's lady-friend trapped in a deadly fire....and you--know-who turns out to be the hero! I mention the end, with the spoilers alert, rather than not say anything only to warn you this really isn't a good Buster Keaton film to watch. You are far, far better off watching one of his silent films where he exhibits his comic genius. He only does that in here in those final few minutes.",
         "Buster in a watch repairman who is infatuated with a lady. They go to the circus but instead of her falling for him, she's taken a strong liking to the handsome trapeze artist. So, later Buster tries his hand at the trapeze...with predictable results. Can he still manage to get the girl? If you are looking for the genius and style of Buster Keaton's silent films, then you probably will be more disappointed in this short from Educational Films (a company, despite its name, that made comedies). The film lacks the brilliance and timing of his early efforts. However, if you can repress the part of the brain that expects that, then this film is actually pretty pleasant. Plus, it was a HUGE improvement over the types of films he'd just finished making for MGM--as pairing him and his sweet style with Jimmy Durante was simply insane! Unlike Keaton's first film for Educational, \"The Gold Ghost\", this one finds him playing a much more physical character--with lots of pratfalls and trapeze tricks that look like the best of Keaton's old shorts. However, the story itself is only okay--so don't assume it's quite up to the standards of the 1920s Keaton. Still, it's pleasant and nice to see him getting back to his more physical style, as that was his forte.",
         "Allez-Oop! (1934) * 1/2 (out of 4) Buster Keaton's second film at Educational Pictures has him playing a watch maker who falls in love with a woman (Dorothy Sebastian) who he eventually takes to the circus. At the circus the woman ends up falling in love with a performer who of course turns out to be a jerk and Keaton gets his chance to shine. This is a pretty poor film from start to finish and it's yet another example of one feeling sorry that a talent like Keaton had to appear in it. It's well-known that Keaton hated his years at MGM but the majority of the films he did there were certainly better than this. The screenplay is fairly poorly written and this includes the silly attempts at laughs early on, which are pretty much scenes of Keaton dropping or breaking things. The \"romance\" between Keaton and Sebastian is fairly poorly and certainly won't remind people of their work in SPITE MARRIAGE. The stunts towards the end of the film are good but by this time most viewers would have turned the film off. The ending is also rather violent and the unpleasant nature doesn't sit too well in a comedy. Harry Myers, best known for the drunk in Chaplin's CITY LIGHTS, has a small role here.",
         "Buster is lovestruck. And when he falls he falls hard. Love at first sight was a common plot point in his silent shorts so why not carry the tradition over into his sound shorts? Keaton adds a visual joke to the first encounter by seeing the girl of his dreams through a distorted lens. The motif also allows Keaton to perform his tried and true looks of romantic longing - the droopy, dreamy eyes as he gazes at his beloved, the fluttery hand motions and his over eagerness to please. He's like a damaged puppy. Stop licking me!! But in Keaton's world view love is fickle so in the time it takes for Buster to win her hand he loses it even quicker to a circus trapeze artist. Keaton's love of gadgetry comes into play as he creates his own makeshift high wire set in the back yard in an attempt to re-win his girl back. One of the key components missing from Keaton's film persona while at MGM was his penchant to pratfall. The studio was afraid he would get hurt and made him scale back his tumbles to the point where he would mostly just slip and slide around. The Educationals' freed him from that constraint. He could fall all he wanted as long as the films were released on time. And fall he does in the best sequence of this leisurely paced short.",
         "Only marginally funny, this Buster Keaton comedy takes the every day stone face and puts him in competition with the world's greatest trapeze artist. Keaton thinks the only way to win over lovely Dorothy Sebastian is to learn to swing both ways. He's no competition with the rugged real circus trapeze artist who only gives Sebastian his autograph because he approves of her looks. When Keaton sets up a backyard trapeze, it is the looks of a familiar looking little rascal that makes it funny. Otherwise, there's nothing much to this two reeler that suddenly turns melodramatic out of nowhere. It could have been creative like some of Keaton's silent classics, but only in the conclusion does it show any real imagination."
      ],
      "genres": [
         "Short",
         "Comedy"
      ],
      "productionCompanies": ["Educational Films Corporation of America"],
      "summaries": [
         "A man working in a clock repair shop meets a woman who brings in her watch to be fixed. When the watch has been repaired, he personally delivers it to her, and soon after that they go to the circus together. While at the circus, though, the woman becomes attracted to a trapeze artist, and soon there is a rivalry for her affections.",
         "When Buster's girlfriend falls for a trapeze artist, Buster tries to beat him at his own game."
      ],
      "budget": 0
   },
   "movielensId": 168508,
   "movielens": {
      "languages": [""],
      "releaseDate": "1934-05-25",
      "dvdReleaseDate": null,
      "directors": [
         "Buster Keaton",
         "Charles Lamont"
      ],
      "runtime": 21,
      "movieId": 168508,
      "title": "Allez Oop",
      "mpaa": "",
      "actors": [
         "Buster Keaton",
         "Dorothy Sebastian",
         "George J. Lewis"
      ],
      "imdbMovieId": "0024824",
      "originalTitle": "Allez Oop",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "When Buster's girlfriend falls for a trapeze artist, Buster tries to beat him at his own game.",
      "tmdbMovieId": 51374,
      "avgRating": 3.25,
      "releaseYear": "1934",
      "numRatings": 4,
      "posterPath": "/8feI40xCB0KNAZeCCybMy0d4VR0.jpg"
   }
}