{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "plantation",
            "id": 3136
         },
         {
            "name": "slave",
            "id": 14906
         },
         {
            "name": "reading",
            "id": 155410
         },
         {
            "name": "teaching",
            "id": 161266
         },
         {
            "name": "literacy",
            "id": 194180
         }
      ],
      "imdb_id": "tt0117180",
      "video": false,
      "title": "Nightjohn",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Clel Waller",
               "gender": 2,
               "credit_id": "546615ff0e0a2648f100016e",
               "name": "Beau Bridges",
               "profile_path": "/xv6sDCHxHvBgCK4y96H32kxgcdr.jpg",
               "id": 2222,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Nightjohn",
               "gender": 2,
               "credit_id": "5a049303c3a3680c9c001537",
               "name": "Carl Lumbly",
               "profile_path": "/u6zmYwEWmCsVjrSsE6e5MUVtGHI.jpg",
               "id": 29382,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Joseph",
               "gender": 0,
               "credit_id": "5466160dc3a36836b6000169",
               "name": "Gerald Brown",
               "profile_path": null,
               "id": 196866,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Outlaw",
               "gender": 2,
               "credit_id": "546616170e0a264a3c00016e",
               "name": "Gabriel Casseus",
               "profile_path": "/hq47yaZk40VSv0rbdtrrj5J5zzL.jpg",
               "id": 18272,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Old man",
               "gender": 2,
               "credit_id": "546616220e0a264b47000159",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lethe",
               "gender": 1,
               "credit_id": "54661630eaeb817de9000245",
               "name": "Deborah Duke",
               "profile_path": "/fg4fUHM0Bq8JgspUL2Js0QBv5HL.jpg",
               "id": 29931,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d42c3a36847f82572e5",
               "name": "Charles Burnett",
               "profile_path": "/9VNUSk6ybDPMhA0SIVzwcZGCLdX.jpg",
               "id": 97755,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546615dfeaeb810ac000012e",
               "name": "Bill Cain",
               "profile_path": null,
               "id": 1141690,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "5aa51f27c3a3687c0c021e65",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Property Master"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.464495,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 174000,
      "vote_count": 1,
      "budget": 0,
      "overview": "Charles Burnett directs this movie about John, a man of many talents, including one forbidden skill: he can read. When he teaches a young slave girl named Sarny to read and write, she learns an unforgettable lesson about the power of words and the true meaning of freedom. A wonderful movie about the power of literacy and the risk it took to educate slaves in the Ante-Bellum South before the heartbreak of the Civil War.",
      "similar": [
         967,
         76203,
         12437,
         34584,
         1579,
         871,
         98,
         770,
         147441,
         553,
         68718,
         6844,
         869,
         628,
         37430,
         1372,
         17610,
         76649,
         205601,
         49494
      ],
      "original_title": "Nightjohn",
      "runtime": 92,
      "poster_path": "/l41JuvbCbJfhme7CIyEOE7osCSv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Disney Channel",
            "id": 3213,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hallmark Entertainment",
            "id": 4056,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sarabande Productions",
            "id": 26977,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Signboard Films Production Inc.",
            "id": 38356,
            "origin_country": ""
         }
      ],
      "release_date": "1996-06-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Words Are Freedom",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Burnett"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Gary Paulsen",
         "Bill Cain"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117180/",
      "coverLink": null,
      "actors": [
         "Beau Bridges",
         "Carl Lumbly",
         "Bill Cobbs"
      ],
      "reviews": [
         "A hymn to learning and determination, \"Nightjohn\" is also a thoughtful and moving film about slavery, perhaps the best I've seen. All the actors are superb, the script is winning, the insight into human relations cuts deep. Charles Burnett is one of our best unknown directors, and the fact that he can turn out a film like \"Nightjohn\" for Hallmark/Disney should indicate to those in power in Hollywood that more of his work should end up on the big screen. Great stuff!",
         "I found NightJohn's story and characters interesting. Actually, I was pleasantly surprised how much I enjoyed the film, I didn't think I was going to a Hallmark film, but I gave it an 8. I am usually attracted to tough, headstrong characters and John is definitely in that category. John, a slave, defied the master as well as convincing his fellow slaves of the importance of knowledge, in a world that relies on ignorance to survive. The little girl was also a strong, believable character, as was the rest of the cast. Beau Bridges did a fine job as the cold-hearted plantation owner, as well as all the other actors in the film. Burnett did a great job presenting the story with a right amount of realism and sentimentality, where many films fail, making them too sappy. I gave it an 8 out of 10. NightJohn reminded me of The Color Purple, it had a similar style and mood. I was engrossed by the film up until the conclusion where the film became a little too unbelievable. If you loved The Color Purple, I recommend NightJohn.",
         "I think that the movie was not as good as the book.The book say's that the slaves can not practice any kind of religion, but in the movie the slaves and the whites all went to church together. In the end of the movie Waller sold Sarney to another slave owner, but in the book Night John was hiding in the wood and he took Sarney to the wood where they taught some other kids how to read and write. One last thing that stood out to me was that Waller cut off Night John fingers off in the movie, but in the book Waller cut off John's toes. In the book Wallar never through a big party for everyone nor did he even have everyone work with each other, but in the movie Waller told everybody that if they do good with their biggest harvest of the year that he would throw the biggest party that anybody has ever seen and he even helped the slaves in the harvest. That is what I think of the movie, so if you ever want to watch Night John then you should read the book first.",
         "I did not really like this movie because it had a lot of differences between the book and the movie. One of the major differences was that the book did not have religion and the movie did. In the movie, the slaves were able to go to church and in the book they weren't aloud to go to church. They weren't even allowed to learn how to read and write. You would not see the slave owner help the slaves work in the field. The punishment they gave Night John was different in the movie than in the book. Sarny stole a Bible from the Church in the movie that was never in book. Sarny stood up to Waller in church in the movie. They weren't even allowed to go to Church in the book. I did not like this movie because of all the differences it has from the book.",
         "I did not like the movie because the movie was extremely different than the book and it sucked. I give the book 1 star. The reason why the movie was bad was that it had parts in it that did not even match up with the book, like Waller never worked with them in the field, and he didn't have any kids. In the movie Waller worked in the field all day, and he had two or three kids also in the movie. In the movie the slaves were able to go to church, but in the book they had to hide the religion from their owners. In the movie Sarny was sold, but in the book she stayed at the farm. The thing that made me mad was when Night John got his pointer finger and thumb shopped of in the movie, and in the book he got two toes chopped off. The movie did not portray slavery correctly as the book had more accurate account of what slavery was really like. I did not like the movie because it was far apart from the books point of view.",
         "The movie was really good. I would rate it a 4 star movie. I like the movie because it shows how things happen. The movie was from everyone point of view. The book was only from Sarny's point of view. In the movie everyone worked together and Waller even helped pick the fields. He was nice to them, but in the book he was rude to them the whole time. In the book they couldn't have any religion and in the movie they had to go to church and I like that because that's important. The one thing I didn't like was that in the book John ran away and came back. In the movie he got sold and they never seen him again. I like that Sarny stuck up for everyone in church cause she figured out how to read, and she everyone how much their worth. That's why I like the movie and why I gave it 4 stars.",
         "Movie response To Night John The movie \"NightJohn\" I thought was a pretty good movie in my opinion. I thought this because of all of the things they used like the props/clothing, the whips and etc\u0085 I also think that using a girl that is a child still to be learning this made it a little more interesting instead of \"NightJohn\" teaching another adult male or adult just in general. I also think that what NightJohn did in this movie was pretty heroic, but the fact that he did not come back after he left was a little disappointing. The way the characters dressed and such in this movie was more believable than having a guy in a tuxedo doing the fieldwork, so for the clothing part's and what they chose was good. For an example of how the book is different from the movie, NightJohn came into the plantation in the book completely naked, and in the movie he came in with a cloth around his waist For the power of the white people they would wear a little more fancier/ more expensive clothing to separate them besides their skin color. Waller was not the only white guy wearing fancy clothing, his wife and many other white people wore the more expensive clothing too. Another thing I liked about this movie was the acting by Sarny, because for her age she did a amazing job of acting like she did not know how to read, and write at first but then as Night John progressively taught her more and more you could tell the difference in the way she talked and how easy it was for her to understand things. While comparing the movie \"NightJohn\" to the book it was based on NightJohn, the movie really was not all that good because they don't even make sense or connect at certain parts of the movie. One example that the book is different from the movie is, When Waller has the cotton field ready to be harvested, he has everyone work really hard even his own family and he even worked in the movie, and he was even telling the slaves that he was going to have a party for everyone. The book had nothing like that in their and Waller in the book would never throw a party for them just like that. That is one of the reason's people will not like the movie if they have already read the book because some things in the movie just do not make much sense, and are not even close to the book at some parts. I also compared the book and movie because they are like two different things, and if you are going to watch the movie or read the book. Then make sure you try and not to compare them because they make either one or the other look bad depending on which one you watched or read first.These are some of the things that I have enjoyed in the movie Night John like the acting, props, and outfits for each type of person wealthy or slave, and I just thought it was mainly an overall good movie.",
         "I give the movie 2 stars because I didn't like it. It is not based on the book at all. Slaves didn't have parties once the crop got harvested like in the movie. Clel Waller wouldn't be working along with them as he did in the movie. In the movie they didn't cut off Nightjohn's toes as the did in the book. They cut off his fingers and they sold him, In the book he ran. They changed Pawley's name to Outlaw that was never in the book. \"Outlaw\" got married to another slave then Outlaw and his wife ran to the north and they got away which never happened, in the book he dies. Waller solid Sarny and that never happened in the book. The book is by far better than the movie. don't wast your time watching the movie.",
         "POSSIBLE SPOILERS This film demonstrates the importance of literacy, especially among the slave population in the South just before the Civil War. In order to be aware of their surroundings, literacy was valued by slaves. I had to see this for my history of childhood course last semester. Needless to say, this film could have been better. The only actor I could recognize in the film was Jeff Bridges, everyone else was unknown to me but they did a pretty good job in the movie. Still, the movie could be better since it lacked a good musical score, good cinematography, etc. but what can you expect from a made-for-TV film?",
         "I give this book two stars because I like the movie but then again I didn't because of they way it doesn't follow the book. Some things I didn't like about the movie is when Waller worked with the African Americans but the book just made the African Americans work harder. The blacks couldn't have religion but in the movie they were in church singing. John got his thumb cut off for teaching but in the book he got his two toes cut off. I hate how John and Sarny got sold but in the book John ran away after two days of his toes getting cut off and then came back for Sarny to go to school. I would of loved to see John come back and Sarny go to school. A couple things I liked about the movie is how it showed how the slaves were poorly treated and also how they kind of fix or healed the peoples backs after they got whipped. I wouldn't recommend this movie if you read the book first.",
         "I didn't like the movie. One of the reasons I don't like the movie because of the ending where Sarny gets sold off and John lost his finger when in the book John lost his two middle toes. Also because they couldn't have religion, but in the movie they went to church. It didn't tell Jim's and Alice's stories because it's very gruesome in the book, because the book tells it how it was back then during slavery. It didn't talk about Sarny's birth in the book but did in the movie. Waller was really mean in the book but he was nicer in the movie. I wouldn't recommend the movie if you read the book first because the movie is different from the book.",
         "Night John Movie Review I have recently partaken in watching the film night john. For my generalization of literature class. I would rate this production a 2 star. Due to the poor acting and not following the original story more adequately. Bill Cain tried to execute this production to be more family friendly. However he may have went too far and cut too much of the original storyline out. changes are excellent in my opinion. For example when the doctor gives Sarny her pennies back. The scene was very heart warming. Also when the doctor takes the blame for sarny when she gets caught reading and telling all the other slaves what they were worth. I did however dislike the fact that Waller threw a party for the slaves. In the book Waller would never do such a thing. Another would be Waller's boys working in the fields with the blacks. First off Waller did not have any kids in the book. Also whites would not work alongside blacks in the south during the 1800's. I hated how in the movie the slaves were able to go to church and sing the songs. FYI how would the slaves be able to sing the songs if they can't comprehend the words to begin with. In the book the slaves were not able to go to church or even believe in god. The whites thought it was there god. That the blacks were not worthy of being able to worship their god. The slaves had to pray into a bowl so that no one would see them praying. If they were caught praying or anything religion based then it was a lashing. Religion and praying for a higher power brings hope and Waller did not want the slaves to have hope. Sarny and the other slaves could try to plan an escape plan. Then Waller would be out however much the slaves were bought for. I would not recommend this movie. The story was too far separated from the original piece of work the book night John written by Gary Paulsen. I would highly recommend the book over the film. Anyone who's going to watch the movie should read the book first. There for they can see what Paulson intended the story to be like? So read the book before watching the film and you will see were I am coming from.",
         "I thought the movie was decent for various reasons. One of the reasons why I didn't liked was from major differences from the book, like NightJohn stopped teaching Sarny. Another is Sarny was working inside the house when in the book that never happened. But the main reason why I didn't like it was the whites and blacks working together in the cotton field, which would have never happened. The last reason is how they changed the ending. Sarny being sold didn't happen in the book like it did the movie. That's what I didn't like in the movie. Although there are some things I did like in the movie. First off I liked the add in of the little Waller boy. I thought the kid was pretty funny. Another is the actor of NightJohn. Because of reading the book I had a picture of him in my head and that actor looked just like what I imagined. In the movie they was a great feeling of suspense on like the book. It made me get into the movie more. That would be some of the simple things I liked about it.",
         "I didn't like the movie Night john. It didn't go with the plot line of the book. They added a lot of things in the movie that weren't true for that time period. Waller wasn't nice to his slaves in the book ,but in the movie Mr Waller was. For example Sarney didn't get in trouble for looking at the book. Another example is Mr Waller cut off Johns toes in the movie and in the book it was his fingers. It seemed like the slave owners didn't want kids to see how slaves were really treated back then. I don't recommend this movie Night John if you are watching it for fun but, If you are showing your classroom then, It would be a good lesson to read the book and show the movie because the book and movie are so much different to each other."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Hallmark Entertainment",
         "Sarabande Productions",
         "Signboard Films Production Inc."
      ],
      "summaries": ["Sarny, a 12-year-old slave girl in the ante-bellum South, faces a relatively hopeless life. Her chief duties at the plantation of Clel Waller are serving at table, spitting tobacco juice on roses to prevent bugs, and secretly conveying intimate messages between Waller's wife, Callie, and Dr. Chamberlaine. Then Nightjohn arrives. A former runaway slave who bears telltale scars on his back, he takes Sarny under his wing and, in exchange for a pinch of tobacco, secretly begins to teach her to read and write, a crime punishable by death. \"Words,\" he says, \"are freedom. Slavery is made of words: laws, deeds and passes.\" He starts by drawing letters in the dirt and cautions her that no one must know. At her baptism, Sarny steals a Bible that belongs to Waller's son, Jeffrey, and practices reading by lantern-light in the slave quarters. The same Bible serves another purpose when, on a blank page taken from it, Nightjohn forges a pass for Outlaw, a young slave, to use in escaping to freedom in the North with his beloved Egypt, a slave on another plantation. Waller finds the Bible and demands to know who stole it. Delie, who cared for Sarny as a child, fears for her now and accepts the blame. But Nightjohn forestalls the lashing Delie is to receive, saying he's the one, for he can read. He tries to run away but is caught, and his hand is tied to a chopping block. With an ax, Waller delivers the severing blow, exacting the brutal penalty for Nightjohn's literacy. As he is dragged off to be sold, he tells Sarny, \"When they cut off one hand, the other hand grows stronger.\" That night Sarny writes a pass for Egypt that will let her join Outlaw on the flight to freedom. Two days later their escape is discovered and the false passes found. Waller knows Nightjohn wrote Outlaw's pass. But who wrote the second? He interrupts a church service to demand the answer, threatening to kill all his slaves if no one tells. Sarny confesses, but declares he'll kill no one, for the slaves represent his wealth. As Waller raises his rifle, Sarny implores Callie to speak up for her, hinting that she has read the messages to Dr. Chamberlaine. Callie refuses, but the doctor, fearful Sarny will reveal the relationship, says he's at fault. He tells of teaching Egypt some reading and writing, but now declares it was a mistake. Callie orders that Sarny be sold, and as the girl is joined to a line of other slaves, she asks if any of them have tobacco to trade. What has she to give in return? they want to know. And Sarny draws an A in the dirt."],
      "budget": 0
   },
   "movielensId": 168502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-06-01",
      "dvdReleaseDate": null,
      "directors": ["Charles Burnett"],
      "runtime": 92,
      "movieId": 168502,
      "title": "Nightjohn",
      "mpaa": "",
      "actors": [
         "Beau Bridges",
         "Carl Lumbly",
         "Gerald Brown",
         "Gabriel Casseus",
         "Bill Cobbs",
         "Deborah Duke"
      ],
      "imdbMovieId": "0117180",
      "originalTitle": "Nightjohn",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["e_cSUPXo_30"],
      "plotSummary": "Charles Burnett directs this movie about John, a man of many talents, including one forbidden skill: he can read. When he teaches a young slave girl named Sarny to read and write, she learns an unforgettable lesson about the power of words and the true meaning of freedom. A wonderful movie about the power of literacy and the risk it took to educate slaves in the Ante-Bellum South before the heartbreak of the Civil War.",
      "tmdbMovieId": 174000,
      "avgRating": 3.7,
      "releaseYear": "1996",
      "numRatings": 5,
      "posterPath": "/l41JuvbCbJfhme7CIyEOE7osCSv.jpg"
   }
}