{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "full moon",
            "id": 4550
         },
         {
            "name": "supernatural",
            "id": 6152
         },
         {
            "name": "neighbor",
            "id": 10226
         },
         {
            "name": "attack",
            "id": 10563
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "werewolf",
            "id": 12564
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "motorcycle",
            "id": 14735
         },
         {
            "name": "dog",
            "id": 15162
         }
      ],
      "imdb_id": "tt1135933",
      "video": false,
      "title": "Never Cry Werewolf",
      "recommendations": [
         100669,
         15056,
         207770,
         36737,
         7292,
         30780,
         45663,
         32583,
         69129,
         53994,
         40973,
         30781,
         239804,
         68878,
         27896,
         134719,
         111438,
         54586,
         44528,
         71886
      ],
      "backdrop_path": "/vehRzbx0g15XQCSAZvq4QzKnDRs.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "viciouslollipop",
         "id": "58da8e27c3a3684659000323",
         "content": "Corny Fun:)\r\n\r\nFor a Sci-Fi(I'm sorry, SyFy:)movie this was a pretty good amount of fun...if you dig 1.werewolf movies 2.corny horror and/or sci-fi movies you will enjoy this. It had a good amount of humor and didn't even bother to try and take itself seriously. The acting was decent and the characters were familiar archetypes, the effects weren't horrible(but they weren't stellar either), and it was just fun. Just remember it's a Sci-Fi flick so shut off your higher brain functions and enjoy...it's got werewolves!:) Lately Sci-Fi has been the \"Disaster of the Week Channel\" and totally veered away from monsters and creepy stuff, so this was nice to see...",
         "url": "https://www.themoviedb.org/review/58da8e27c3a3684659000323"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Redd Tucker",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b82f",
               "name": "Kevin Sorbo",
               "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg",
               "id": 51965,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Loren Hansett",
               "gender": 1,
               "credit_id": "52fe4601c3a368484e07b833",
               "name": "Nina Dobrev",
               "profile_path": "/7Oc4jOZHWNYozxBxKdQr0NxoGjS.jpg",
               "id": 19961,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jared Martin",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b837",
               "name": "Peter Stebbings",
               "profile_path": "/xIwQc40ilQVKAJM6GmvkMvPBIiw.jpg",
               "id": 55587,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Angie Bremlock",
               "gender": 1,
               "credit_id": "52fe4601c3a368484e07b83b",
               "name": "Melanie Leishman",
               "profile_path": "/ph4ztwofMEwpdOz0XRtm9iG6U2O.jpg",
               "id": 108887,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kyle Hansett",
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b845",
               "name": "Spencer Van Wyck",
               "profile_path": "/eEd1fClM8qsWI5xGslWC99LFIs0.jpg",
               "id": 231875,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Margo",
               "gender": 0,
               "credit_id": "52fe4601c3a368484e07b849",
               "name": "Kim Bourne",
               "profile_path": null,
               "id": 201046,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Stven Kepkie",
               "gender": 0,
               "credit_id": "54ed9ecd9251417961003a2a",
               "name": "Sean O'Neill",
               "profile_path": null,
               "id": 1228325,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4601c3a368484e07b841",
               "name": "Brenton Spencer",
               "profile_path": null,
               "id": 108888,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "544a0ba3c3a3680fb40038dc",
               "name": "John Sheppard",
               "profile_path": null,
               "id": 31901,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56110c269251414ec60025aa",
               "name": "Aaron Barnett",
               "profile_path": null,
               "id": 1518453,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56110c3bc3a3686817011bfd",
               "name": "Michael Richard Plowman",
               "profile_path": "/kAA6tkcYcDGQ9qfGWweqx3ztynh.jpg",
               "id": 1024243,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56110c51c3a3686814012d5d",
               "name": "Curtis Petersen",
               "profile_path": null,
               "id": 64300,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56110c629251415e5300558f",
               "name": "Nick Rotundo",
               "profile_path": null,
               "id": 59395,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56110c7792514147d8008722",
               "name": "Sara Kay",
               "profile_path": null,
               "id": 1035176,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56110c8a925141478d008792",
               "name": "Jenny Lewis",
               "profile_path": "/6y5cKHxz8p7QK5YETtOmsUwZiQj.jpg",
               "id": 1516101,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56110c9bc3a3686814012d77",
               "name": "Justin Craig",
               "profile_path": null,
               "id": 1518454,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56110cae9251410615004ba6",
               "name": "Shayne Fox",
               "profile_path": null,
               "id": 1518455,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56110cc0925141478d00879d",
               "name": "Alexandra Sawka",
               "profile_path": null,
               "id": 1518456,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56110cffc3a368680e011919",
               "name": "Jessica Fulmer",
               "profile_path": null,
               "id": 1445365,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 1,
               "credit_id": "56110d3d9251410615004bc2",
               "name": "Louise Hall",
               "profile_path": null,
               "id": 1518457,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 4.908737,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 29896,
      "vote_count": 37,
      "budget": 0,
      "overview": "Teenager Loren (Nina Dobrev) doesn't like her new neighbor, Jared (Peter Stebbings), or his vicious dog. Along with her friend Steven (Sean O'Neill), Loren spies on Jared and begins to suspect he's a werewolf, responsible for a rash of disappearances. But Jared is watching her just as closely, because Loren reminds him of his dead wife. As a full-moon night nears, Loren enlists the help of TV star Redd Tucker (Kevin Sorbo), who knows how to hunt -- and who believes her werewolf theory.",
      "similar": [
         377,
         588,
         10014,
         3597,
         2108,
         8456,
         10229,
         8363,
         2898,
         8193,
         272693,
         315635,
         12444,
         85350,
         449176,
         133805,
         10625,
         9880,
         9276,
         10206
      ],
      "original_title": "Never Cry Werewolf",
      "runtime": 87,
      "poster_path": "/oXJg5ffnBtioxq9CqRGnsZpDYFC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Grodfilm",
            "id": 36158,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Peace Arch Entertainment Group",
            "id": 2393,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Reel One Entertainment",
            "id": 15645,
            "origin_country": ""
         }
      ],
      "release_date": "2008-05-11",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "An Immortal Battle for Survival",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Brenton Spencer"],
      "runtime": 87,
      "synopsis": "A mysterious fog rolls into town the night that a mysterious stranger named Jared buys the run down house down the road from 16 year old Loren Hansett. That night all the dogs start to go crazy and a known sex offender is brutally slain by a werewolf. Loren meets her new neighbour, Jared is hot and he rides a sick motorcycle. He is instantly likeable and Loren's brother Kyle adopts him as his new hero, giving Jared a way in, because he seems to be more than a little interested in lauren and in a creepy way. Steven is an awkward adolescent who has a crush on Loren but does not know what to do about it. Loren begins to hear a voice epeating the name Melissa over and over in her head, she is suspicious of jared and his large black dog which is part alsatian part wolf apparently. we discover that jared has incredible eyesight and hearing, and that he moves very quickly. Loren is obsessing over jared and he is watching her watching him. She sees him witrh a lady in the house until the lights go down, when she hears a blood curdling scream, which is definitely a woman's. She learns that a man was brutally slain in his house and that a prostitute is missing, who looks just like the woman she saw with Jared. Her friend Angie tells Loren to call the police but they do not take her seriously. Loren later interfere's with Jared's plans and saves another would be victim. Jared thanks her by killing Angie and her poor boyfriend Guy. The police return, taking Loren more seriously now that two more people are missing, up until of course, the moment in Jared's house where he gets loren to tell the police that she thinks he is a werewolf, when they believe they have a looney on their hands so they run out. Loren begins to research werewolves. she discovers that his dog is in fact a demon familar and that silver and fire are the only weapons she has. poor Steven who desperately wants her to fall in love with him but has no idea how to go about it, ;takes time out from delivering fried chicken to help her fight monsters. This proves to be a bad idea because Jared has revealed that he believes Loren is in fact a reincarnation of his beloved Melissa and that her soul belongs to him for eternity. He looses his demonic dog and Melissa is forced to kill it with some silver bullets and the help of bumbling celebrity big game hunter Redd Tucker who is doing a book signing in the hunting supplies store where they were shopping for weapons. Redd later recants and claims that they were attacked by a cougar for the press, to not ruin his chance for publicity by ranting about monsters. Steven gets infected by jared for being silly enough to get in between him and his mate and to replace the pet which was killed. Loren tells steven that they have until midnight of the night of the first full moon after he is infected to kill the creature which infected him and break the curse. Unfortunatelt that night is tonight. On the plus side, Steven who has nothing to lose, finally tells loren how he feels and keeps referring to this whole mess as their first date despite Loren's protestations. Steven changes when the moon comes up, locking himself away while Loren exits stage left, to go looking for Redd Tucker to give him a piece of her mind or get some help. When she confonts Redd, he reveal his true self in a moment of great humanity, as he struggles to overcome his inner coward and explains that his whole life is a mess, he lives in this van, he is a nobody and this is his last shot. Loren asks him for his help in hunting the monster because she has seen his shows. Redd reveals that he is just an actor and it was all fake. \"Just like you\" Lauren tells him bitterly. \"Yeah just like me\" he says, eyes full of regret, face contorted as he struggles to free the voice within him which tells him he cannot stand by and let this girl face the werewolf alone. Lauren puts silver utensils onto crossbow bolts and readies herself to go into the beast's lair. Jared calls her to tell her that he has her brother Kyle held captive in his house and that he will kill him. Loren goes to rescue Kyle and runs into Redd, who tells her that he played the part of a big game hunter enough that he is a big game hunter and that he cannot sit by and do nothing while innocent people die. Unfortunatley he is still a better actor than a hero but he does eventuall come through. Jared lures Loren into a trap, then disarms her as though her crossbow was a toy, he is inside her head, telling her that her soul belongs to him as it always has. He speaks of them running beneath the stars for eternity, sharing the thrill of the hunt, the rapture of the kill, the carnal pleasure of their lusful howling as they coupled under the moon, Loren who does not seem taken with the whole idea is even less so after watching the transformation. Jared infects her, kyle finally comes good and tries to help his sister but fails. The half Steven half wolfman attacks jared bravely and gets his ass kicked. He also chases the fleeing Redd up a tree, from where Redd throws a flaming torch and some buckshot to Loren's aid. Loren does overcome Jared's attempts at hypnosis eventually and she shoots him with two silver arrows. Steven runs him down with a van and when Jared makes the inevitable final move, Loren shoots a silver shotgun barrel through his brain and causes Jared to explode freeing them all from the curse because Redd got scratched on the way also. Loren and Steven after going through a near death'eternal life spent eating people experience together finally realise they were meant to be together and kiss. Redd has learned to be a better man( sort of ) and Kyle less of a brat. Everything is alright!!!",
      "writers": ["John Sheppard"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1135933/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE3OTg1MjgzNl5BMl5BanBnXkFtZTcwMjUwOTEzMg@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Nina Dobrev",
         "Kevin Sorbo",
         "Peter Stebbings"
      ],
      "reviews": [
         "I'm certain this will not be the only review of this film that will declare this, but this film, while enjoyable by the standards set by Sci-Fi channel movies, is one of the most unabashed rip-offs of a film I have ever seen. To confirm what others have said, YES, this film does indeed borrow every single plot device imaginable from the 80's classic, Fright Night. It does this to such an obvious extent, that it makes the movie hard to enjoy on certain levels. First and foremost, there is no real suspense, or even curiosity when you can instantly tell that you have seen everything about this movie once before. It follows the Fright Night blueprint so closely, that anyone who remembers anything about FN will instantly be able to guess ahead as to where this movie is headed. This may have been made as an ode to Fright Nite, but no such declaration is ever made, leaving me to believe that it is simply the result of a lack of imagination, and originality on the part of the filmmakers.",
         "jdanvers is correct, a small part of the plot resembles Dracula. However, this movie more closely resembles \"Fright Night\". Here's why. Kid notices something is wrong with next door neighbor, and comes to realize neighbor is a werewolf (ok, in Fright Night the neighbor is a vampire). Nobody will believe the kid. So, the kid enlists a wacky TV star to help destroy the monster. In fact, the movie is almost a remake, just substitute werewolf for vampire. Having said that, I actually enjoyed this movie. The actors were attractive, the plot moved rather well, and the actor playing the werewolf was pretty good. The special effects weren't horrible, although I don't understand why the werewolf always breathed and drooled all over the intended victims for extended periods until they managed to get away. Overall, you could do a lot worse, especially for a Sci Fi Channel original.",
         "I don't get the lukewarm reviews as \"Never Cry Werewolf\" (2008) is a worthy addition to the werewolf genre. Yes, it rips-off the plot of a popular film from two decades earlier, \"Fright Night\" and, yes, it is a made-for-TV flick, but despite these factors it delivers as a half-serious/half-comedy werewolf flick. PLOT: A mysterious man (Peter Stebbings) moves in next door to teenager Loren (Nina Dobrev) and she concludes that he's a werewolf. Of course, no one believes her so she enlists the help of a washed-up reality show actor (Kevin Sorbo). Like I said, \"Never Cry Werewolf\" only plays it semi-straight, so don't expect the dead-serious vibe of, say, \"wolfen\" or even \"Red Riding Hood.\" Stebbings is reminiscent of Hugh Jackman's Wolverine here and is excellent in the role. But he's clearly at least 36 years-old and so it's a bit disturbing that he's literally sniffing around a 16 year-old girl. Nina is good as the protagonist and has a cute look, but I prefer her friend in the story, Angie, played by Melanie Leishman. Melanie may not be as cute but she has better curves. In any event, her role is too small. As always, Sorbo is extremely likable. He plays a reluctant hero in this one. The film was shot in Brantford & Hamilton, Ontario, and runs 87 minutes. FINAL WORD: Although \"Never Cry Werewolf\" loses points for blatantly ripping off \"Fright Night,\" the bottom line is that it's entertaining from beginning to end. The werewolf lore is sound and the cast is solid. In addition, the werewolf looks menacing and there's a lot of goofy gore. It's just a fun film. What more do you want from a low-budget werewolf flick? GRADE: B-",
         "Never Cry Werewolf starts as the hunky Jared Martin (Peter Stebbings) moves into the house next door to teenager Loren Hansett (Nina Dobrey), at first he seems OK but while watching him through a telescope in her room Loren sees Jared kill a prostitute who is reported missing the following day. Slowly Loren comes to believe that Jared is a Werewolf, he has hairy palms & has a big black killer Dog for instance but no-one will believe her. Not her family, not her friend Angie (Melanie Leishman) & neither do the cops. Loren has to go it alone when it becomes clear that Jared thinks she is his dead lover Melissa as the two happen to look exactly the same. Jared kidnaps Loren's brother Kyle (Spencer Van Wyck) in a plan to get Loren to come to him so he can turn her into a Werewolf but Loren arms herself with a crossbow & decides to fight back in order to save herself, her brother, her friends & her town... This Canadian production was apparently called School Girl vs Wolfman in Japan & had the working title The House Next Door during production this was executive produced & directed by Brenton Spencer who clearly had little ambition other than to make a Fright Night (1985) rip-off, sure the twist here in Never Cry Werewolf is that it changes the menace from a Vampire to a Werewolf but other than that the two are strikingly similar with a little bit of Disturbia (2008) thrown into the mix. There's the teenager who comes to believe they are living next to some monster, here a Werewolf rather than Vampire but the premise exactly the same. No-one will believe said teenager, from friends & family to the authorities. Teenager turns to washed up late night cable TV host has-been, a horror show host in Fight Night while here it's a failed big game hunter but it basically the same in both films. Teenager decides to go it alone in both films & arms themselves with various homemade weapons to kill monster on it's own turf as monster threatens their friends &/or family, look Never Cry Werewolf is basically Fright Night. Period. The script doesn't take itself too seriously & to be fair to Never Cry Werewolf it's watchable & moves along at a decent pace, the character's are likable enough & while it's short on gore & effects I suspect that was down to the budget. Despite being a nearly invincible Werewolf this film suggest Jared has a fierce Devil Dog thing protect him, it seems a Werewolf a can change whenever they want if they have a charm made out of the skin from the neck of a convicted criminal for no apparent reason & Jared is afraid of a cigarette lighter. The special effects are cheap, the Werewolf effects are of the man in a hairy suit variety & the editing is poor as it's obvious the suit wasn't very good or didn't work properly. The CGI effects are alright, the mutant Dog is OK but nothing amazing & it does still look just like a computer effect. The gore is restrained, there's some blood splatter, an exploding Dog & the Wrewolf puts it claw through someones body but otherwise it's pretty dry. There's attempts at humour, tension & scare which are mildly effective I suppose. Filmed in Ontario in Canada this premiered on SyFy & then went to DVD, Never Cry Werewolf is better than the usual direct to video fare but could hardly be called great. The acting is alright, Nin Dobrey is cute for sure & she tries, Kevin Sorbo is fun while Peter Stebbings feels a little young for the role of the main villain. Never Cry Werewolf is an OK film actually, it's watchable enough & even quite fun on it's own merits at times but it is a straight rip-off of Fright Night with a little bit of Disturbia thrown in. Passable but not much more.",
         "For a Sci-Fi(I'm sorry, SyFy:)movie this was a pretty good amount of fun...if you dig 1.werewolf movies 2.corny horror and/or sci-fi movies you will enjoy this. It had a good amount of humor and didn't even bother to try and take itself seriously. The acting was decent and the characters were familiar archetypes, the effects weren't horrible(but they weren't stellar either), and it was just fun. Just remember it's a Sci-Fi flick so shut off your higher brain functions and enjoy...it's got werewolves!:) Lately Sci-Fi has been the \"Disaster of the Week Channel\" and totally veered away from monsters and creepy stuff, so this was nice to see...",
         "*****WARNING!!!! SPOILERS!!!! ************** This movie wasn't that bad, but I don't think it was that great either. In most films, werewolves are portrayed as hungry, psychotic animals that just wish to rip the hell out of everything and everyone in its' path. I actually enjoy those films, but it's nice to see a little bit more than that. Peter Stebbings' portrayal of the werewolf was perfect. He managed to be both seductive and dangerous, sly but crazy, all by the simple cock of his head or squint of his eye. He radiated with sexual tension that made his character very addicting. Nina Dobrev was equally as charming. I enjoyed her innocence, curiosity, and her childish fights with her brother. The werewolf was supposed to have found his soul-mate in her, but the whole premise reminded me of Little Red Riding Hood. It was a cute story, but it didn't focus as much on that relationship as I would have liked. Throughout the film, I began to feel that something was missing and wanted to see more interactions between Jared and Lauren. I thought the scene where Lauren is in the gun shop looking for weapons and a fight erupts, involving Jared's dog, is just too far-fetched and kind of ridiculous. Being underage, Lauren shouldn't even be in a gun shop, picking out any kind of weapon, even though she is with the chicken-delivery boy. And what kind of a person starts a ferocious fight in the middle of a crowded store..especially in a store that sells guns!! What did they think the outcome would be? I don't mind cheesiness, so I didn't expect exotic special effects, but there were some scenes that I just laughed at. I already knew the outcome of the story and would have loved to see it end a different way. I would have enjoyed the movie much, much more had the ending not been so predictable. So, I do recommend this film, if you're home to watch it. It had its' moments and those moments kept me watching. So, ENJOY!",
         "I agree with you about being a blatant rip off of Fright Night. I mean it even stages some of the same scenes the same way Night did. Like when he brings home the first girl and takes her upstairs and Loren can see them through her window. The woman screams and the lights go out.. I mean come on. It was too similar to Fright Night which is one of my favorites. And that movie is 23 years old. The producers should have just gone ahead and remade Night. If it wasn't for Nina Dobrev, this would be unwatchable. Even with her it's still pretty lame. Pass on this one. This is one of those movies that SCI-FI channel just loves to show, instead of airing classic good stuff.",
         "First note that I have different scales for Sci-Fi Channel Originals and regular movies - an 8 for this movie does not mean the same as an 8 for what you would go to the theaters to see. But amongst sci-fi channel movies, this was a classic! The characters were more or less believable, acting was okay, Kevin Sorbo was DELIGHTFUL as always, save for a few spots the special effects were pretty decent, some funny parts, some scary-ish parts (in a kid sort of way), all making for one very fun to watch movie. Only complaints were, 1, it looks like it was shot in 1980 or so, you know, with the kind of off lighting and low quality image; 2, the middle 30 minutes or so really seem to drag on; and 3, some of the werewolf shots are really bad, in one I actually got confused and thought the werewolf was a trick or treater wearing a really bad costume, because (I kid you not) you could actually see that he was wearing a monster glove, because you could see where it stopped and his real arm began. Overall, if you think you can overlook its flaws, and if you like some of the other sci-fi channel movies, you'll probably like this one. If not, stay away.",
         "Like others have already mentioned, this straight-to-TV b-grade production (yes a Sci-fi feature) is 1985 \"Fright Night\" all over again\u0085 but this time for this generation the spin is it's a werewolf next door. The plot structure is rather similar, as the differences go to some certain key factors being switched about and having a witless script tagged to it. One thing though; as the down-to-earth main character comes to the realisation that she's living next to a werewolf it comes off rather forced and rashly quick, compared to obsessed horror nut protagonist in \"Fright Night\". Nonetheless it's very average, but I still found it rivetingly disposable, despite how derivative it happens to be and exactly how goofy (intentional or not) it plays out. Actually the mockery vibe felt more deliberate than not. What made it even more enjoyable were the three performances of (a dependably confident) Nina Dobrev (who's decked in a sports bra for the film's climax), Peter Sebbings (who's gleaming presence seems to fit) and definitely Kevin \"Hercules\" Sorbo amusingly sending up his TV-star based hunter character. It wasn't great acting, but they're fitting by having fun and it shows in the film's energy. Which was needed because the direction and visual styling was on the plain side, as the attempted jump scares were weakly executed and the restricted make-up effects looked quite shonky. They do throw around (that's literally) a bit of blood splatter. Fragmented editing is used around the beastie and its attacks. In some scenes you see bits of it, or a simple silhouette and shadow. However there were a few scenes were the angle of the camera placed, had me thinking it looked like a bear. Nothing special, but a decent time-waster if you can look past its been-there-done that story.",
         "\"Never Cry Werewolf\" is a really nice and impressive werewolf film with a few nice surprises. **SPOILERS** Moving into the neighborhood, Jared Martin, (Peter Stebblings) meets up with Loren Hansett, (Nina Dobrey) and her brother Kyle, (Spencer Van Wyck) who welcome him into the neighborhood. Although everyone else around her takes an instant shine to him, she has a nagging feeling about him that she thinks isn't right. The more she watches him across the house, the more she thinks he's a werewolf but despite going online for help, no one believes her story. After getting his friend Steven Kepkie, (Sean O'Neill) onto her side, a confrontation at a hardware store manages to get the attention of Redd Tucker, (Kevin Sorbo) the host of a local hunting show to believe her as well, and realizing that all of their actions have provoked the beasts' fury, they try to put an end to it's rampage before he takes them all out. The Good News: This was a relatively fun and enjoyable werewolf film. That the beginning of the film is so fun is due to the fact that it's strongly set-up by a fantastic story. This one builds up a really nice and effective mystery with many different kinds of great moves. The film decides to have the revelation come early in the story and that propels long segments devoted to the mystery, actually getting time to do something about it and responds with some great scenes. From the scenes of her spying from a distance, which are pretty creepy as they actually run with her seeing the killings first before doing the normal ones where he does nothing, allowing the film to run with the fantastic notion of her looking through history, from the internet, movies and books and trying to match what has been learned on the actual events, which is fun and quite interesting. The film's really deliberate pacing also produces the fact, and with a couple horror scenes spread throughout the plot allow it to use them in building up the mystery. Some of them, consisting of attacks that are witnessed from afar, are quite well with the several on the prostitutes early on being really good, and once it moves away, either out into the neighborhood or to the hardware store, it doesn't get worse with some top-notch action displayed in both scenes. The hardware store encounter is really fun since it comes with a better revelation than could've hoped for, a really tense stalking scene and some really helpful gore thrown in. It's all apart of the film's best part, it's last half-hour. This is really great, packed with action and fun confrontations, a couple moments of suspense and some more bloodshed thrown in. The rest of the gore in here is not bad either, as there's a clawed hand punched through a stomach from behind, slashed across the stomach, chest, neck and face, bites on the arms and shoulders and a complete meltdown to skin and bones, plus the wonderfully gory way that the lead werewolf is taken out in. The last bit here that works is the werewolf design, suggesting a powerful, intimidating creature with a massive build, large claws, huge fangs and a really memorable-looking snout, giving it more of wolf-like look than most other designs. It's really one of the best ones ever, and should've been shown off more. These here are the film's best points. The Bad News: This one here doesn't have too many flaws to it. The most pressing, but not-detrimental case against this one is the fact that the beginning of this is played out straight from other films nearly verbatim, and the fact that it's done in such a way allows it to be so obvious that it's ripping them off is something that will put some off. The fact that the film decides to hold off the werewolf until the end is something that is a crime, since the design is so great and memorable, that not being able to see it during the film is a real shame. This, of course, is due to the film's biggest flaw, the slow-building mystery. Because it's so strong and well-thought-out, it has to have a lot to be able to get all of it out to the audience and that means that most of the beginning half of the film is merely exposition. It can get dull since its about the mystery and gathering evidence, and the amount of time doing so is where the lesser time with the werewolf comes from, since it's so great and really deserved to be featured more. The longer build-up also forces the film into less, and shorter, action scenes as well. There isn't a whole lot of confronting the werewolf in here, and the few encounters, up until the ending at least, are all quite shorter than they should be, and are should've been dragged out a little more. These here are all that the film does wrong. The Final Verdict: A fairly fun werewolf entry, with a fun story and a bunch of good parts to it that makes it rather interesting. Give it a shot if you can get over the similarities or are in the mood for a rather fun and light-hearted werewolf romp, otherwise stick to the others in the genre for a more-traditional werewolf fix. Rated R: Graphic Violence, Graphic Language and Brief Nudity",
         "In 1981 John Landis brought the seminal werewolf film, An American Werewolf in London, to theatres. It wasn't received well, but it has since gone on to become a classic by which all others in the genre are to be judged. Why? Simple, Landis held out for his shooting star. He had a working script for the movie in the sixties, but no one would touch it. That's why he paid his dues and cut his teeth acting in crap films and directing movies like the Blues Brothers and Animal House. After he paid his dues he was finally given cart blanche to do his werewolf film, and it rocked. I bring this up because this movie was the bail of hay which broke this camel's back. I am a huge fan of the genre and every year horror movies seem to get dumber and dumber. Movies like Never Cry Werewolf don't help--not at all. When you have a million dollar idea, you don't try to get by on a buck ten. The story was flat out bad. Nina Dobrev's character sees one hooker and the next thing you know she's breaking out the silver like she lived in Lower East Proctor. Seriously, WTF? Why didn't her younger brother think it was weird that a grown man, a stranger would give him a ride to school on a motorcycle? For that matter, why didn't his mom, his sister, or anyone else? Also, I'm just curious, but why did the werewolf's dog turn into one of the skinless mutts from Resident Evil at a gunshow, and in broad daylight. Why did the werewolf even have a dog? The special effects were laughable. A sex criminal has three red lines on his neck, yet is said to have had his throat torn the Hell out. The werewolf looked like a pretty bad ass bear skin rug and was every bit as animated. Aren't lycnathropes supposed to be mobile? Why did the kid who was bitten look more like a tall Ghoulie than and actual lycanthropic understudy, and was that spine thing glued onto his shirt. Th acting was, well the acting wasn't half good, but it wasn't half bad either. In a more ambitious flick any deficits in the actors performance might have shown, but that was not the case here. Nina Dobrev, Greg Calderone, Peter Stebbings, and Kevin Sorbo did what they could and it wasn't much because this film was doomed. This brings me to my next point. People look at the horror genre nowadays and laugh. It is dominated by some of the most God awful films you'll ever see. I love horror films, but the preponderance of bad ones is destroying their marketability. I would be more understanding, but there are the Ginger Snaps films which prove a good horror movie can be made under the radar--and in Canada. Bretton Spencer and John Sheppard--you two can do better than this. I honestly don'tsee how you couldn't. Sometimes you have an idea in your head and you can see it so vividly, but end up having to compromise because someone else is footing the bill. To this I say follow John Landis' example. Pay your dues and bide your time honing your craft. This way you may be able to have a hand in creating a truly memorable horror film. Maybe that way you can actually make the movie you want to--not just the one you can!! I hope your next film is better and not another nail in the coffin of this genre. To anyone else reading, I say this. Don't try to make what you can't afford the budget for. It will only end up hurting you and breaking your heart when your idea is turned to crap for all to see. Do the right movie for the right money. Hell, with a budget of just $30,000 you can make a damn good short which can get your foot in the door. Just stay true. Don't sell yourself short and make a movie like this.",
         "The basic premise of this movie had potential: a supernatural being coincidentally finds a young woman who is a doppleganger for his dead soul mate. He pursues her, destroying those around her, in the quest to reunite with her. But wait - someone has already done that - it was called \"Bram Stoker's Dracula\", and Francis Coppola already did that about fifteen years ago. But OK, let's go with it. Same basic premise, but in this case, it's a werewolf instead of a vampire, and it's in Canada instead of England. OK, OK, I'm down with that. The werewolf guy is hot, the girl is pretty, she's got an annoying brother and the chicken delivery guy is hot for her... OK, forget it. It's a freaking mess. This movie is all about kicking butt and gory meat bag explosions. There's no heart to it at all. Next time, do yourself a favor - if Kevin Sorbo is in the cast, take a pass.",
         "I would be lying if I said it was a great movie, but for SyFy it is tolerable and much better than it should have been. Okay, there are one too many parts of the story that are predictable and derivative of Fright Night, the editing is very fragmented, the special effects are rather cheap-looking(but I have seen far worse actually), the direction is much too straight-forward to be convincing and some of the killings are weak in thrills and over too quickly. On the other hand, the scenery and locations are actually quite spookily atmospheric, and the music is also fitting with the tone of the film with some tongue-in-cheek moments. The dialogue is never going to be nominated for an award for Best Screenplay but it is much less cheesier and stilted than most SyFy movies and there are scenes that do have at least some fun and suspense. The characters are clichéd, but are nowhere near as annoying as so many other characters in SyFy movies. The acting is better than average, I agree to some extent that Peter Stebbings is rather on the young side to convince completely as a villain, but Kevin Sorbo especially is good. So overall, mixed on the whole but it is far better than it could've been which could have been far worse. 5/10 Bethany Cox",
         "I really didn't understand why some users said that they didn't like this movie. I loved it! It's about a guy that moves in next door by a 16 year old girl named Lauren. You can tell right away that he is interested in her and thinks she was someone he knew a long time before. Then on she finds herself discovering that he is a werewolf and he's after her. So just to sum this up he is a hot guy that's a werewolf who is kinda obsessed with the girl and is after her to make her his. So if you like the whole thriller/obsession/horror film this is perfect. I can say I really liked it and yes it does have some parts like the movie Fright Night but overall this movie was way better.",
         "Being a fan of the supernatural genre I was excited to find a movie that had both Nina Dobrev and Kevin Sorbo in it. Unfortunately after two false starts I had to force myself to finish this movie. It had me laughing for all the wrong reasons. It was bad. Nina Dobrev had a few decent moments and after getting over the initial corniness I warmed up to Kevin Sorbo's character. Peter Stebbings worked with what he had and pulled off an effectively creepy but hot next door neighbor. I knew that the film was low budget so I expected poor graphics ...etc but I still couldn't help but laugh at how bad some of the special effects were. Aside from the 3 previously mentioned actors everyone else sucked. And the person cast as Nina Dobrev's younger brother was probably the one who annoyed me most. All that aside if you are the kind of person who can watch a bad movie and laugh about it... I recommend watching it. If not skip it because there are far better movies to waste your time on.",
         "Mysterious Jared Martin (Peter Stebbings) moves in next door to the Loren Hansett (Nina Dobrev). Her little brother Kyle is taken with this motorcycle riding newcomer. When a prostitute goes missing, she recognizes her from his house. She suspects that he's a werewolf and her friend Angie (Melanie Leishman) calls the cops. The cops do very little about it. When Angie and her boyfriend get killed, she tries to tell the police detectives but nobody believes her. The only help is the hormone-filled Steven. She also tries to get the help of TV personality Redd Tucker (Kevin Sorbo) to battle the evil beast. I'm a fan of Fright Night, and I love the first half of this movie. This is lower budget fare, but it dealt with that well until the action starts with Kevin Sorbo. The costume makeup is bad. The action is horrible. The CGI is passable for a TV movie. Sorbo is playing the comedic role but he's not good enough as a comedian. It is all downhill after the fight in the gun shop.",
         "\"Never Cry Werewolf\" sort of have a very 'werewolf movie for the entire family' feel to it. Why? Well, because the movie isn't scary, nor is it gory, but it has elements of adventure, fantasy, action and light horror to it. As such, it is fairly suitable for almost all viewers. The story in \"Never Cry Werewolf\" is about a mysterious man named Jared (played by Peter Stebbings) who moves into the house next door to siblings Loren (played by Nina Dobrev) and Kyle (played Spencer Van Wyck). Something is not right with the new neighbor and his vicious black dog. And Loren finds out that their new handsome neighbor is in fact a werewolf. And with the help of TV hunting show celebrity Redd Tucker (played by Kevin Sorbo) they set out to hunt down the werewolf and save the neighborhood. Storywise, then the movie is fun and entertaining and there are elements here that would appeal to a wide group of viewers. And director Brenton Spencer managed to tell a good story without the use of excessive mayhem and carnage. The effects in the movie were actually quite good, well aside from the transformation of the demonic familiar; which just looked awful. But the werewolf was actually nicely made, and the transformation scenes from man into werewolf (and vice versa) were actually quite good. \"Never Cry Werewolf\" would be a good choice for entertaining for the entire family if you are planning a scary night, or for Halloween, for example. I enjoyed the movie and found it to be fun and exciting. \"Never Cry Werewolf\" gets a 5 out 10 stars rating.",
         "This is more a movie for TV than cinema or DVD. Not enough gore for my liking, really its like Fright Night but with a werewolf the new neighbour arrives other neighbour gets suspicious reports the neighbour police search home find nowt the bad neighbour grabs in this case the brother and girl finds ally to help slay the werewolf the rest is history. I prefer Fright Night for gore story and effects. Actors good looking and acting OK, just too similar to Fright Night whats next oh could be living next to a zombie or Frankensteins monster the list is open to allsorts. It even has the comical element as Fright Night with one liners so if you want a copycat film watch this but watch out for the similarities you will spot them and think OK I should stick to Fright Night.",
         "WARNING CONTAINS SPOILERS!!!! Its true. A werewolf thinks his neighbor is a reborn version of his past lover - - did I mention this neighbor is a teenager? Ew. SciFi needs to stop making its own films . . . they're just getting embarrassing. The blood looks cartoonish. (however, it does look graphic at times,) and the film just never really got exciting. And I don't understand, why they had to add a Indiana Jones 'like' character. That was just uneccessary. Especially when you found out his secret. *cough* *cough* May I suggest if your looking for a film to scare you, make you feel like your being watched its not this one. Go see Orphan, or Drag me to Hell. Those are worth the money to go see in theaters, however, this movie, isn't worth the money you pay for cable.",
         "Remake of Fright Night of sorts with a werewolf instead of a vampire. Amusing in a direct to TV sort of way but best viewed at 3am on SCIFI when you're too tired to actually take any of this seriously. Its does have some good performances (The two antagonists for example, deserve better) though they some times run counter to other performances, such as Kevin Sorbo, who play to the audience instead of to the material which creates a knowing edge that lessens any scares. Its a shame that everyone couldn't have been on the same page because there are times when the film has flashes of the minor horror masterpiece this could have been. Worth a shot f you can catch it on TV but otherwise take a pass.",
         "I really enjoyed this movie,if for no other reason than the fact that it was nice to see Kevin Sorbo play a guy who doesn't want to be a hero,but needs to know what kind of man he really is. Redd Tucker is a down and out ex-TV personality(he used to host a hunting show)who gets the attention of a young woman trying to prove that a neighbor is really a werewolf. He pours out his story to her(rather sarasticily,I might add)and despite his initial reluctance,ends up helping her in her quest. The special effects are really nice,especially the werewolf makeup and all-really awesome! If you're expecting something really scary,then you might be a bit disappointed by this because it wasn't that frightening at all! Overall, a good and enjoyable movie!",
         "Wow... I just finished watching this movie. The girl is cute. Thats about all this movie has going for it. The rest really sucks. Do not continue reading unless you want to know what makes this movie one of the worst movies I have ever seen, and I have seen a lot trust me. At the end when Kevin Sorbo is hanging from the tree with his arms and legs, then you see him spin the bullets around his 6-shooter handgun with both hands. Even the part when he drops his shotgun that is \"silver plated\" and it shatters into 3 pieces. Wow. Who writes this crap? Oh and lets not forget the crossbow the girl uses. These things should have over 100 pounds of tension and yet she is able to pull the string back with one hand. (Instead of using her foot and both hands like real crossbows.) Then she shoots one the broken parts from the \"silver plated\" shotgun barrel out of the crossbow... and kills him. And for you all that comparing it to \"Fright Night\" no way, this movies not even close to the same level.",
         "I Believe that most of us would agree on that most new Movies are not really new but merely rehashes in various degrees of already released ones. But some are more obvious than others and Never Cry Werewolf is a major rehash of Stoker's novel Dracula and Fright Night in particular (which in turn is, obviously, based on Dracula). Plot: teenage girl suspects her new neighbor of being a werewolf. She finds herself alone in her quest to reveal his secret until a waning TV star joins her quest. Movie Essentials like script, acting, directing and casting are basically missing in this production besides Beautiful Vampire Diaries star Nina Dobrev. Kevin Sorbo's contribution is ridiculous and even worse than in the Hercules series. what it does have going is atmosphere and scenography which are quite good actually, it reminds me of Carpenter's old Movies. The sfx are not top notch but reasonably good. I give it 3 out of 10, for those who are novices to the genre it might be Worth watching, but for the lovers of vampire and werewolf Movies it is a total waste of time.",
         "This shameless ripoff of Fright Night substitutes a werewolf for FN's vampire and a girl for the boy in the lead. It a sloppily executed horror flick that is like every other SyFy Channel offering. At least the monster this time isn't some poorly drawn lizard or snake. A teenager discovers her new neighbor is a werewolf who brings home babes and kills them. In place of FN's creepy valet, he is accompanied by a nasty demon-dog. Keep in mind Fright Night itself was a knockoff of Rear Window, but done very cleverly and with high entertainment and production values. This TV movie has a no-name cast (except for Kevin Sorbo), and not one actor does justice to his or her role (including Sorbo, who plays a TV big game hunter in place of FN's TV horror show host so memorably portrayed by the late, great Roddy MacDowell). Might be worth a look for the uninitiated. All others, steer clear.",
         "Loren states in the beginning of the movie while outside her school, she states she won't eat pizza because she's a vegetarian. Then there's a scene about 25 minutes into the movie, there's a scene where she is with her friend in her bedroom spying on the neighbor with the telescope and what do I see??? Loren actually eating a pepperoni pizza! Like, really? If you're going to write a script at least follow your own storyline! Whoever wrote this stuff really needs to get their act together. I'm not a writer nor do I make movies, but I know to at least follow what I wrote in a story, then to deliberately state that someone in my story is a vegetarian, then have them eat a freakin' pepperoni pizza is stupid and ridiculous!"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Grodfilm",
         "Peace Arch Entertainment Group",
         "Reel Entertainment"
      ],
      "summaries": ["Jared Martin moves next door to the Hansetts, along with his hot motorcycle and eerie, ill-tempered dog. Although everyone else in the neighborhood takes an instant liking to him, Loren Hansett can't get over the bad vibes her new neighbor gives her. She starts to spy on his nocturnal activities and comes to believe that a recent killing might the work of a werewolf who happens to be her new neighbor. Her internet surfing provides a lot of collaborative detail but everyone but her friend Steven dismiss her story as teen-aged fantasy. Fearing for her life, she convinces Steven to take her to a gun shop to buy silver bullets in a gun shop, where their neighbor's supernatural dog attacks. When she dispatches the beast, her actions get the attention of Redd Tucker, a washed-up TV hunting show host to believe her as well. When Steven is attacked by the werewolf and Loren's brother goes missing, she and Redd team up to kill the lycanthrope before he can finish them both off."],
      "budget": 1000000
   },
   "movielensId": 168692,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-05-11",
      "dvdReleaseDate": null,
      "directors": ["Brenton Spencer"],
      "runtime": 87,
      "movieId": 168692,
      "title": "Never Cry Werewolf",
      "mpaa": "PG-13",
      "actors": [
         "Kevin Sorbo",
         "Nina Dobrev",
         "Peter Stebbings",
         "Melanie Leishman",
         "Spencer Van Wyck",
         "Kim Bourne",
         "Sean O'Neill"
      ],
      "imdbMovieId": "1135933",
      "originalTitle": "Never Cry Werewolf",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["9PahSkFjqFQ"],
      "plotSummary": "Teenager Loren (Nina Dobrev) doesn't like her new neighbor, Jared (Peter Stebbings), or his vicious dog. Along with her friend Steven (Sean O'Neill), Loren spies on Jared and begins to suspect he's a werewolf, responsible for a rash of disappearances. But Jared is watching her just as closely, because Loren reminds him of his dead wife. As a full-moon night nears, Loren enlists the help of TV star Redd Tucker (Kevin Sorbo), who knows how to hunt -- and who believes her werewolf theory.",
      "tmdbMovieId": 29896,
      "avgRating": 2.66667,
      "releaseYear": "2008",
      "numRatings": 6,
      "posterPath": "/oXJg5ffnBtioxq9CqRGnsZpDYFC.jpg"
   }
}