{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1297925",
      "video": false,
      "title": "Devolved",
      "recommendations": [],
      "backdrop_path": "/r22BRFGCCovRTZqsBtZ2nIoVQ1M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Peggy",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081203",
               "name": "Lindsay Shaw",
               "profile_path": "/5PjIgu6rEEcPQL95t9tQfUzbJCN.jpg",
               "id": 231054,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Flynn",
               "gender": 2,
               "credit_id": "52fe4625c3a368484e081207",
               "name": "Gary Entin",
               "profile_path": "/35jmr8bSlUMJKow2RqCDaK9l6fU.jpg",
               "id": 59824,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "The Rog",
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08120b",
               "name": "Robert Adamson",
               "profile_path": "/jFNVWygnZhEG3bFJIFBZ2rvtxAC.jpg",
               "id": 105187,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Coach Papillion",
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08120f",
               "name": "Chris Kattan",
               "profile_path": "/kTmr5DuGMoXPFH0FcXxUqQKhpgA.jpg",
               "id": 58317,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Trey",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081213",
               "name": "Blake Baskin",
               "profile_path": null,
               "id": 231055,
               "order": 4
            },
            {
               "cast_id": 1005,
               "character": "Tiffany",
               "gender": 1,
               "credit_id": "52fe4625c3a368484e081217",
               "name": "Christina Corigliano",
               "profile_path": null,
               "id": 231056,
               "order": 5
            },
            {
               "cast_id": 1006,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08121b",
               "name": "Justin Deeley",
               "profile_path": "/a7ZHoa68eZNFSwWzSEKOEoMaKdB.jpg",
               "id": 231057,
               "order": 6
            },
            {
               "cast_id": 1007,
               "character": "Erica",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e08121f",
               "name": "Josslyn DeCrosta",
               "profile_path": null,
               "id": 231058,
               "order": 7
            },
            {
               "cast_id": 1008,
               "character": "Becky",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081223",
               "name": "Shannon Freya",
               "profile_path": null,
               "id": 231059,
               "order": 8
            },
            {
               "cast_id": 1009,
               "character": "Shane",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081227",
               "name": "Ben Graupner",
               "profile_path": null,
               "id": 231060,
               "order": 9
            },
            {
               "cast_id": 1010,
               "character": "Chet",
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08122b",
               "name": "Kevin M. Horton",
               "profile_path": "/oqlX8lzDYrSzd81F5GzIjW83hlR.jpg",
               "id": 94769,
               "order": 10
            },
            {
               "cast_id": 1011,
               "character": "Ivan",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e08122f",
               "name": "Roman Marshanski",
               "profile_path": "/c8sqnTq9VeDDoswkzq2CfpR1mV1.jpg",
               "id": 231061,
               "order": 11
            },
            {
               "cast_id": 1012,
               "character": "Jan",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081233",
               "name": "Jan Milligan",
               "profile_path": null,
               "id": 231062,
               "order": 12
            },
            {
               "cast_id": 1013,
               "character": "Jess",
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081237",
               "name": "Megan Moser",
               "profile_path": null,
               "id": 111013,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08123d",
               "name": "John Cregan",
               "profile_path": null,
               "id": 231063,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4625c3a368484e081243",
               "name": "John Cregan",
               "profile_path": null,
               "id": 231063,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4625c3a368484e081249",
               "name": "Bettina Tendler O'Mara",
               "profile_path": null,
               "id": 1111291,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08124f",
               "name": "Jim Valdez",
               "profile_path": null,
               "id": 98595,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4625c3a368484e081255",
               "name": "Kelli Kaye",
               "profile_path": null,
               "id": 142842,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4625c3a368484e08125b",
               "name": "Joshua Gershon",
               "profile_path": null,
               "id": 1121604,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4625c3a368484e081261",
               "name": "Kelli Kaye",
               "profile_path": null,
               "id": 142842,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081267",
               "name": "Eric Zimmerman",
               "profile_path": null,
               "id": 1121605,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4625c3a368484e08126d",
               "name": "John Cregan",
               "profile_path": null,
               "id": 231063,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4625c3a368484e081273",
               "name": "Jeremy Gordon",
               "profile_path": null,
               "id": 970836,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4625c3a368484e081279",
               "name": "Carey Rothman",
               "profile_path": null,
               "id": 1121606,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.470663,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 60447,
      "vote_count": 1,
      "budget": 0,
      "overview": "A raucous teen comedy produced in association with Severin Films, Devolved stars Gary Entin (the upcoming Seconds Apart), Lindsey Shaw (10 Things I Hate About You), and Robert Adamson (Lincoln Heights) as leaders of opposing factions of teenagers who find themselves shipwrecked on an uncharted island off the Mexican coast. Faced with the prospect of a long-term stay, the island soon degenerates into a struggle between two groups; teens who want high school to end as fast as possible, and teens who never want high school to end.",
      "similar": [],
      "original_title": "Devolved",
      "runtime": 87,
      "poster_path": "/iDlbwJbAowePPiZAi97rPhJ369Z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Visualeyes Productions",
         "id": 11624,
         "origin_country": ""
      }],
      "release_date": "2010-03-22",
      "vote_average": 1.5,
      "belongs_to_collection": null,
      "tagline": "Spring Break Just Broke.",
      "adult": false,
      "homepage": "http://www.devolvedthemovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Cregan"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["John Cregan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1297925/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjIyNDI0NzkwOV5BMl5BanBnXkFtZTcwNjk0Mjc1NA@@._V1_UY268_CR6,0,182,268_AL_.jpg",
      "actors": [
         "Gary Entin",
         "Lindsey Shaw",
         "Robert Adamson"
      ],
      "reviews": [
         "This movie is not as bad other have said. Generally I turn anything I rate lower that a 5 off and never make past the 1st 1st half hour. This is watchable better than most of the Saturday night live skits. The characters are definitely stereo types and writing is somewhat juvenile but I thought it was a better comedy than most of those Leslie Nielsen films. Basically the style is knockoff of Idiocracy with a voice that explains things. The lord of the fly thing is about 2 minutes of the movie and is not the core of the movie. The acting is definitively B players. The other reviewer is correct the Chris Kattan character is a waste but he is the only star in the movie.",
         "You'd think some (French) people were watching Tree of Life instead of a low-budget teen comedy. I don't think the movie re-invents anything, but there are a lot of sharp laughs to be found here. It's certainly gotten a lot of good reviews, many more good than bad in all the ones I read. It doesn't start off the best, but gets going as soon as The Rog (Robert Adamson) shows up. He's sort of a low-rent Spiccoli, except without the brains. As soon as he arrives, the laughs really begin, as we now see the setup between the two groups. Lindsey Shaw is also very good as the Rog's girlfriend Peggy. Chris Kattan shows up, and while I'm not a fan of his, it was one of the less annoying performances I've seen him give. The rest of the movie is basically a back and forth between the two groups, with the island sort of becoming a metaphor for high school. I get the feeling this is destined to become a cult film. Not a cult classic, mind you, but a fun little movie that has some kind of message. My guess is that if you don't like the message, you won't like Devolved.",
         "Don't let the critics fool you. This movie has zero redeeming value. It's meant to be some sort of teen movie pastiche, but just clunks along. Maybe it's the bad acting, the lousy script, the awful jokes, the poor delivery, the bad direction, the low budget, the ridiculous setup. There's even a bad voice-over (which drops out midway through the film) and an even worse television news reporter. The premise: a group of teenagers --half are jocks, half are nerds/misfits -- from the same high school take a cruise off the coast of Mexico and end up shipwrecked on an uncharted island. Why they are in Mexico is never explained, although presumably they're on some sort of Spring Break. Do high schoolers have Spring Break? Also, why would jocks and nerds party together on the same cruise ship? Along the way the boat explodes -- although miraculously all of the high school kids make it to shore. On an uncharted island off the coast of Mexico. Uncharted island. Right. What follows is an exercise in such utter unbelievability, with such low concern for any sort of reality that it sucks the life right out of the premise. Impossible to buy into the story --and therefore the attempts at humor -- when the premise is so far-fetched. And anyone who dares to compare this film to Lord of the Flies should be banned forever from writing film reviews. Oh yes, one of the teachers, played by Chris Kattan, ends up shipwrecked with the kids. There's seems to have been no purpose adding this character to the film, as he's featured for all of five minutes -- and succeeds in further sucking any scrap of life left from the film in the process. Call him this film's Boris Karloff. Kattan's not the worst of the actors, hard enough as it is to believe this. That honor goes to Robert Adamson, who plays the over-the-top jock leader. Lindsey Shaw spends much of the movie being sullen and petulant, and in no way is believable as a head cheerleader. Perhaps the real goal of the filmmakers was to win a Worst Movie of the Year award? Well, they're certainly on their way. Good luck to them.",
         "The problem with this film is the directing, acting and script writing. The film portrays itself as a teen comedy but although there are teens, it is not funny. At best it is the kind of humor that young kids would laugh at. The film also tries to be dramatic in parts but this does not work as it is spoilt by its unserious nature. The script writing is abhorrent because it portrays 'The Raj' as this incredibly annoying, immature character who is followed around mindlessly by the 'cool kids'. The script writing does not even make sense. How on earth do all the teens get their food? Where do they sleep? The characters seem so blank that their actions never are understood. In all there are only 3 characters that are at all interesting in the film. Also, the 'reporter' scenes which are the most amateur and badly done parts of the film have no place. The acting is also terrible. The only OK actor is Lindsey Shaw while the others cannot comprehend what the word 'acting' means. They cannot accurately portray a character in their scenario. About the music, it was so bad that I don't even remember it. No themes or anything. Boring. All in all, a terrible film with the humor of a child but with teenage themes. No point watching it.",
         "A group of teens shipwreck on an abandoned isle with limited supplies. They must find a way of saving themselves before it's too late but instead, the start partying, wasting supplies and fighting about who's in charge. A battle between the popular and unpopular, obviously without any future whatsoever. It's supposed to be a comedy but I got so bored I actually started skipping scenes. Not even a sign of comedy, just black humor that I really don't understand. And to make matters worse, in the middle of a \"glorious\" fight between the \"leaders\" of the two groups, they are interrupted by their parents and local police who came to save them. \"Brilliant\"! Such story! Such acting! In a single word: garbage!",
         "High school movie comedies have been around for quite a while now. Some have gone on to become classics in the history of film. And with all good things come the rejects and usually they outnumber them. With the start of the 21rst century, more and more TV networks produced movies like these. Disney channel's best known film in this vein was High School Musical (2006). It was so popular, it spawned two more sequels after that. Rival network Nickelodeon also had a popular show called Ned's Declassified School Survival Guide. Although that did not produce a movie after its series end, the actors that took part in the shows have gone on to perform in projects somewhat like it. Actor Devon Werkheiser did that in the film Shredderman Rules (2007). That feature did not break new ground either. This movie on the other hand is the jump off point for actress Lindsey Shaw from the same show. Unfortunately moving away from what made one popular can be difficult to leave. This movie may not be far from the genre Shaw came from but the tone is much different. The story is about a group of high school teenagers that get stranded on an island near the cost of Mexico. Fearing they might be stuck there longer than expected, one group of teens decide to prepare for the worst, while another group decides to live it up. John Cregan worked as the writer and director to this project. Cregan's experience lends more to editing in documentary shorts but has directed other projects. However this was the only feature film he directed and wrote. He also wrote for one other film, that being Plague Town (2008). When producing a movie, it is important to understand that writing and directing is not easy unless one is exceptionally competent. For newcomer filmmakers, doing these tasks could affect the outcome of the overall film. This seems to be the case here. As a comedy, there are moments of creativeness and some characters are likable. Yet the script has parts that are too overused and unclear explanations associated with certain events. This is where the story truly suffers. The actors try but the screenplay is really derivative. Of the group of teens, there were two leaders. Flynn (Gary Entin), a shy writer is the guy who points the way for all other reject introverts. Roger AKA \"The Rog\" (Robert Adamson) is the top dude for all the popular teen extroverts. Playing the bridge between these two groups is Peggy (Lindsey Shaw), who is also the girlfriend of Roger. Aside from these actors there are only a few other distinct characters. Chet (Kevin M. Horton), a socially awkward guy who hopes to win over Becky (Shannon Freyer), a ditsy popular girl. Chris Kattan plays Coach Papillion but all he does is mumble gibberish. Other than these supporting roles, the rest of the actors and their characters are rather forgettable. This is due to how exaggerated they are depicted. All the introverts stay quiet and act logical to some degree. Meanwhile the extroverts love nothing more than to engage in partying, drinking and fornication. That's already too familiar, but even worse is that these characters follow their leader blindly. Nobody thinks for themselves until the script calls for it. There are also moments that don't add anything to plot. In one scene, a teen broadcasts to a group about the current weather forecast. Who cares and how are you going to know without the right equipment? Why bother? Regrettably these outweigh the good parts to this film. Yet there are moments that show some kind of creativeness was there. Although much of the characters are either forgettable or too stupid to like, there are a couple that have some appeal. Gary Entin as Flynn isn't initially a strong protagonist but over time he does gain some confidence. Lindsey Shaw as Peggy is another semi-understandable character. At first, she's a part of the socially accepted teens but has doubts to begin with. Even the Chet and Becky characters have some charisma. That's as far as it goes for the cast though. For comedy, it's hit and miss. Much of humor relies on the antics that surface between the teen factions. This is where it fails most of the time because of how over done it is. Nonetheless there are occasionally a scene or two that feel like thought was put into it. The technical aspects to this feature are also split on quality. The cinematography by Eric Zimmerman is more disengaging than it is the opposite. There's two problems with his work. The first is that in a number of scenes, the lens will zoom in and out frequently. The point of that is? If the lens needs adjusting, that should be done before director Cregan says \"action\". The second issue is the color pallet, which has a drained look. There are plenty of bright scenes but several of them lack a defining color. Majority of the time the overall background color is yellow and brown. It's not a pretty mix. Musically, the film score is something a little more enjoyable. However credit can't even be given to the person for the music because nobody was listed. What makes up the music to some scenes vary at times. Sometimes it's of guitar and rock. Other times it's the quick comic cues that help make a scene funnier. This isn't always apparent but it is noticeable at times. Since this wasn't released in large numbers, there's no chance a score was released. Unless one doesn't mind really silly teen comedies, this film will please little and few between. It has a couple interesting characters but much of them are written too lazily. Only a few have development arcs. The comedy works infrequently and the cinematography isn't that pleasing."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Visualeyes Productions"],
      "summaries": ["Devolved is a racy teen satire that follows a group of high schoolers on an ill-fated whale watching trip who find themselves stranded on a deserted island off the Mexican Coast."],
      "budget": 0
   },
   "movielensId": 168678,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-03-22",
      "dvdReleaseDate": null,
      "directors": ["John Cregan"],
      "runtime": 87,
      "movieId": 168678,
      "title": "Devolved",
      "mpaa": "",
      "actors": [
         "Lindsay Shaw",
         "Gary Entin",
         "Robert Adamson",
         "Chris Kattan",
         "Blake Baskin",
         "Christina Corigliano",
         "Justin Deeley",
         "Josslyn DeCrosta",
         "Shannon Freya",
         "Ben Graupner",
         "Kevin M. Horton",
         "Roman Marshanski",
         "Jan Milligan",
         "Megan Moser"
      ],
      "imdbMovieId": "1297925",
      "originalTitle": "Devolved",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["95l4KpdwB8g"],
      "plotSummary": "A raucous teen comedy produced in association with Severin Films, Devolved stars Gary Entin (the upcoming Seconds Apart), Lindsey Shaw (10 Things I Hate About You), and Robert Adamson (Lincoln Heights) as leaders of opposing factions of teenagers who find themselves shipwrecked on an uncharted island off the Mexican coast. Faced with the prospect of a long-term stay, the island soon degenerates into a struggle between two groups; teens who want high school to end as fast as possible, and teens who never want high school to end.",
      "tmdbMovieId": 60447,
      "avgRating": 1.25,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/iDlbwJbAowePPiZAi97rPhJ369Z.jpg"
   }
}