{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt5559726",
      "video": false,
      "title": "Blind Vaysha",
      "recommendations": [
         406398,
         393263,
         90839,
         175125,
         96529,
         402536,
         427413,
         87194,
         240636,
         442160,
         107295,
         186019,
         137757,
         433583,
         51470,
         163052,
         128401,
         90014,
         421281,
         129739
      ],
      "backdrop_path": "/gyERpdNJWkjxUtU8Ru44dQ8XxO7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "",
            "gender": 1,
            "credit_id": "5794b97992514179d2001e2d",
            "name": "Caroline Dhavernas",
            "profile_path": "/p3yP2JVSqcZGXUeLnuiJMBXERjF.jpg",
            "id": 31383,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56f66aac92514155f8002c5e",
               "name": "Theodore Ushev",
               "profile_path": "/myC380SCoCdTkNmuMhyboSQYrWS.jpg",
               "id": 1017733,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56f66ac392514169e200067f",
               "name": "Theodore Ushev",
               "profile_path": "/myC380SCoCdTkNmuMhyboSQYrWS.jpg",
               "id": 1017733,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 2.010194,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 389677,
      "vote_count": 23,
      "budget": 0,
      "overview": "From the moment she was born, Vaysha was a very special girl. With her left eye she can only see into the past, and with her right she can only see the future. The past is familiar and safe, the future is sinister and threatening. The present is a blind spot. In captivating parabolic imagery, the award-winning animation artist Theodore Ushev illustrates the world through Vaysha’s eyes.",
      "similar": [],
      "original_title": "Blind Vaysha",
      "runtime": 8,
      "poster_path": "/q9dfoBQrQPX0xa90Yn9CJMXpBh0.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2016-02-15",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Theodore Ushev"],
      "runtime": 8,
      "synopsis": null,
      "writers": [
         "Georgi Gospodinov",
         "Theodore Ushev"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5559726/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNWY1ZTdiN2YtMDM1OS00NzE3LTgzNWEtMTY3YTNhZDkxZmQ3XkEyXkFqcGdeQXVyNTI5NjIyMw@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": ["Caroline Dhavernas"],
      "reviews": [
         "I just came home from a wonderful screening of the Oscar nominated animated short films this year, and they all truly delighted me. However, this one was certainly the most impressive! The story is unique and powerful, it is both beautiful and surprisingly hopeless-and the simple yet breathtakingly effective way it is told is super refreshing! However, the main thing that this film has going for it is not its story nor its approach to said story, but its ANIMATION and, equally as important, its ATMOSPHERE. This is a creepy and melancholy little film that is beautifully and uniquely animated. This heavily stylized way of animation is perfect for this story and this atmosphere, it captures the darkness of its tone, its surprising sadness. If you have a couple of minutes to spare, there is no better way to spend those minutes than by watching this brief and haunting gem.",
         "dark atmosphere. shadows of the Balkanian myths. a simple story. with great impact. a parable. about the absence of present in many lives. and the right animation. because it is part of story in a so perfect manner than becomes itself the skin of the words. a film about the status of silhouette. because the past gives the hope, the future - the fall. between them - no bridge. and the bitter, harsh animation has the status to reflect this hole. doing \"Blind Vaysha\" a tool of wake up. because the girl is every viewer. memories against plans, projects and illusions, fears and too late. and this does the film a pure masterpiece. its cruel honesty about us. the lost of present . and the need to choose the right eye. a film about a gift. who defines our world so profound.",
         "This animated short, nominated for an Oscar in that category, is an interesting affair. It does not seem right to me for this meditation on a girl who sees the future with one eye and the past with the other, to win, but I have old-fashioned tastes. It is a very interesting effort, mostly for the quality of its visuals, which resemble wood-cuts rather than other, more conventional drawings or computer animation. This is clearly intended to offer some visual gloss on the subject, which is about how difficult it is to see only the past and the future, but never to exist in the moment, I have no idea how it does so, but it is a pleasant change from the more usual techniques.",
         "\"Blind Vaysha\" is an animated 8-minute short film from 2016 that was directed by Theodore Ushev. The latter, a Bulgarian-born filmmaker, is also the one who adapted the original work by Georgi Gospodinov for the screen here. With these names and origins, you certainly would not expect this to be a Canadian movie in the English language. The National Film Board of Canada sure has come a long way if you look at their works from decades ago. But they have always been successful with the Academy, so it is not too surprising that this one here was also nominated for an Oscar. How much you like the animation style is of course always subjective. For me it was good without being great and clearly inferior to \"Piper\". But in terms of the plot and story, \"Blind Vaysha\" is far ahead of that one and probably also the rest of the competition. The idea of this disability (that's what it is and what it is rightfully called in the film) is a great one and result in the film oozing creativity. Sadly, I must say I did not like the way the fourth wall was broken at the very end and it went really strongly against the tone and story from everything before that, so I wished this film could have ended after 6 minutes with better closure. I still recommend it though and I also think it's the best from the three nominated animated short films I have seen so far. Lets see if prolific short film maker Ushev finally moves on to full features anytime soon. I think the character of Vaysha certainly would work as well with a 90-minute movie.",
         "People nowadays are always looking at either a romanticized version of the past that exists only in their minds, or at a bleak and terrifying \"What if?\". But very few focus on the present, on its wonders and horrors, and try to make it a better place worth living in. \"Do you look at the world with the eyes of Vaysha the blind?\"﻿ We should learn to live in the present and to value every little thing. I adore Georgi Gospodinov's works - not only his stories, but also his poetry and novels. Theodor Ushev has animated this story in such a brilliant and astonishing way and it is a pity that this movie did not won an Oscar. Kottarashky's incredible and extraordinary music makes the film even more touching and powerful. This movie is a masterpiece with a very strong message.",
         "Blind Vaysha (2016) ** 1/2 (out of 4) This short was nominated for Oscar's Best Animated Short and it's certainly much darker than the other nominees. This one here tells the story of Vaysha, a young girl who was born with two very different eyes. Her left eye can only see the past while her right eye can only see the future. This here puts her into a dilemma on how to live the rest of her life. I'm not going to say BLIND VAYSHA was a bad movie but I didn't think it was worthy of an Oscar-nomination. It certainly wasn't better than the other nominated movies but at the same time I can respect it for trying to do something a tad bit different. This really plays out like a dark fairy tale and the animation is quite dark itself. I thought the film was visually impressive and the story had some interesting ideas but I just didn't think it ever really came to life. I also didn't care too much for the narration, which lasted throughout the picture.",
         "This is one of two Canadian nominees (the other being Pear Cider and Cigarettes). It's sort of like a very, very dark modern fairy tale. It's a strange tale about a little girl born with two very strange eyes. Through one, she can only see the past and with the other she can only see the future. So, for example, when she sees an adult, they appear in one eye as a small child and in the other incredibly elderly and feeble. As to what all this means, well I was left wondering this when the film ended. As far as the animation goes, you'll either love it or hate it and it strongly accentuated the darkness of the story. It certainly is NOT a pretty film to watch and many of the animations are a bit horrifying to watch. Like too many shorts this year, I did wonder why it was nominated as well as feeling a bit depressed after seeing it. I think \"Blind Vaysha\" is very unlikely to take home the Oscar, as \"Piper\" is much more of a crowd pleaser and it s sweet little film...without the dark edges the other nominees all see to have in spades!"
      ],
      "genres": [
         "Animation",
         "Short",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": ["National Film Board of Canada (NFB)"],
      "summaries": [
         "From the moment she was born, Vaysha was a very special girl. With her left eye she can only see into the past, and with her right she can only see the future. The past is familiar and safe, the future is sinister and threatening. The present is a blind spot.",
         "The tale of a girl who could see the past and the future simultaneously and respectively with each eye, but never the present."
      ],
      "budget": 0
   },
   "movielensId": 168750,
   "movielens": {
      "languages": [""],
      "releaseDate": "2016-02-15",
      "dvdReleaseDate": null,
      "directors": ["Theodore Ushev"],
      "runtime": 8,
      "movieId": 168750,
      "title": "Blind Vaysha",
      "mpaa": null,
      "actors": ["Caroline Dhavernas"],
      "imdbMovieId": "5559726",
      "originalTitle": "Blind Vaysha",
      "genres": ["Animation"],
      "youtubeTrailerIds": ["TZWMJSfq0TE"],
      "plotSummary": "From the moment she was born, Vaysha was a very special girl. With her left eye she can only see into the past, and with her right she can only see the future. The past is familiar and safe, the future is sinister and threatening. The present is a blind spot. In captivating parabolic imagery, the award-winning animation artist Theodore Ushev illustrates the world through Vaysha’s eyes.",
      "tmdbMovieId": 389677,
      "avgRating": 3.75,
      "releaseYear": "2016",
      "numRatings": 8,
      "posterPath": "/q9dfoBQrQPX0xa90Yn9CJMXpBh0.jpg"
   }
}