{
   "tmdb": {
      "original_language": "cs",
      "keywords": [],
      "imdb_id": "tt0167331",
      "video": false,
      "title": "Cosy Dens",
      "recommendations": [
         50873,
         40573,
         65967,
         77573,
         36918,
         132225,
         15388,
         75023,
         47181,
         19775,
         53460,
         46288,
         29937,
         55637,
         167752,
         78425,
         61320,
         287001,
         16977,
         201267
      ],
      "backdrop_path": "/bIHyY2PC91jJo9MookvJMyy0bTF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Otec Šebek",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f67",
               "name": "Miroslav Donutil",
               "profile_path": "/7jKRQWmViH7Idb9YkbI8BQVTTTh.jpg",
               "id": 124141,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Otec Kraus",
               "gender": 2,
               "credit_id": "52fe46549251416c75074f6b",
               "name": "Jiří Kodet",
               "profile_path": "/5fhKpTTCKQsnPE7cCDYf13NppDO.jpg",
               "id": 138551,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Matka Šebková",
               "gender": 1,
               "credit_id": "52fe46549251416c75074f6f",
               "name": "Simona Stašová",
               "profile_path": "/syFL4dE640jZ2p3Tee7tL55w7tp.jpg",
               "id": 144325,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Matka Krausová",
               "gender": 1,
               "credit_id": "52fe46549251416c75074f73",
               "name": "Emília Vášáryová",
               "profile_path": "/5hITLih0eIaeDOeIYOnU8N7ETDQ.jpg",
               "id": 235666,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Strýc",
               "gender": 2,
               "credit_id": "52fe46549251416c75074f77",
               "name": "Bolek Polívka",
               "profile_path": "/5Xl1VVzdU2Wwr67hyZf2k3cG415.jpg",
               "id": 30737,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Petr",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f7b",
               "name": "Marek Morvai",
               "profile_path": null,
               "id": 1080763,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Babička",
               "gender": 1,
               "credit_id": "52fe46549251416c75074f7f",
               "name": "Stella Zázvorková",
               "profile_path": "/93FFbz1KQTSK9xmahX8cLmttJh0.jpg",
               "id": 11686,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Saša Mašlán",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f83",
               "name": "Jaroslav Dušek",
               "profile_path": "/zHvI4ARRmf7Sv5aGLcxHKLvRUX7.jpg",
               "id": 135680,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Michal",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f87",
               "name": "Michael Beran",
               "profile_path": null,
               "id": 222786,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Jindřiška",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f8b",
               "name": "Kristýna Nováková",
               "profile_path": "/530G5pbHbZLqtqsGsi8RHWF2lE3.jpg",
               "id": 1080766,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Doktor Stárek",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f8f",
               "name": "Jiří Krejčík",
               "profile_path": "/nb0BNhGoJAy18a66fV5mr9MQxYh.jpg",
               "id": 1080767,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Uzlinka",
               "gender": 1,
               "credit_id": "52fe46549251416c75074f93",
               "name": "Sylvie Koblížková",
               "profile_path": "/7Pt4Prdp7WMPm58rG47xzSC7b7q.jpg",
               "id": 37170,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Elien",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f97",
               "name": "Ondřej Brousek",
               "profile_path": "/tC6tAZMC4GDF89oftlIqNtqcy0j.jpg",
               "id": 1080768,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Kouzelník",
               "gender": 2,
               "credit_id": "52fe46549251416c75074f9b",
               "name": "Boris Hybner",
               "profile_path": "/AiyeMqkVZvewAat5PoAlQRMJZuy.jpg",
               "id": 135687,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Učitelka",
               "gender": 0,
               "credit_id": "52fe46549251416c75074f9f",
               "name": "Eva Holubová",
               "profile_path": "/t2wLKWUZDwlbbdy16rV8tbm73e9.jpg",
               "id": 97193,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46549251416c75074f39",
               "name": "Jan Hřebejk",
               "profile_path": "/oLcqCURY3CLVWppGLOfoQr2Uqdt.jpg",
               "id": 135678,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f3f",
               "name": "Pavel Borovan",
               "profile_path": null,
               "id": 1080761,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f45",
               "name": "Ondřej Trojan",
               "profile_path": "/6BrpWL0dsL3OHxzc4EqlFBjzcEs.jpg",
               "id": 213337,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f4b",
               "name": "Petr Jarchovský",
               "profile_path": null,
               "id": 135679,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46549251416c75074f51",
               "name": "Jan Hřebejk",
               "profile_path": "/oLcqCURY3CLVWppGLOfoQr2Uqdt.jpg",
               "id": 135678,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f57",
               "name": "Ivan Hlas",
               "profile_path": null,
               "id": 1080762,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f5d",
               "name": "Ivan Kral",
               "profile_path": null,
               "id": 75228,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c75074f63",
               "name": "Jan Maliř",
               "profile_path": null,
               "id": 571462,
               "department": "Camera",
               "job": "Camera Department Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.036107,
      "production_countries": [{
         "iso_3166_1": "CZ",
         "name": "Czech Republic"
      }],
      "id": 15387,
      "vote_count": 30,
      "budget": 0,
      "overview": "Two families, Sebkovi and Krausovi, are celebrating christmas, but not everyone is in a good mood. Teenage kids think their fathers are totaly stupid, fathers are sure their children are nothing more than rebels, hating anything they say. Written by Antonín",
      "similar": [],
      "original_title": "Pelíšky",
      "runtime": 115,
      "poster_path": "/lVGn75s3pjDEQictwU7a2kIIDJW.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Česká televize",
         "id": 5928,
         "origin_country": ""
      }],
      "release_date": "1999-04-08",
      "vote_average": 8.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Czech Republic",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jan Hrebejk"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Petr Jarchovský",
         "Petr Sabach"
      ],
      "originalLanguage": "Czech",
      "imdbLink": "http://www.imdb.com/title/tt0167331/",
      "coverLink": null,
      "actors": [
         "Michael Beran",
         "Miroslav Donutil",
         "Simona Stasová"
      ],
      "reviews": [
         "A beautifully understated story of ordinary people living their everyday lives through the trying times of Christmas '67 and the Prague Spring during the run up to the Soviet invasion. While the setting has be caught with stark and depressing realism, the film is perfectly balanced with a gently comic and bittersweet observation of the families and their relationships as they struggle through events from the mundane to the tragic. Personal loss, both of freedom and of loved ones, and the way life still manages to go on has been captured with deceptive ease and without resorting to the usual cliches and predictable attempts at closure that so often seem to pollute western cinema of this type.",
         "Watching this movie at the Wellington International Film Festival, surrounded by emotional ex-patriot Czechs is an experience I will always remember and treasure. The film details life during the Prague Spring, leading up to the Russian invasion. The humor is very Czech, and splendidly so. The ending reminded me of exactly why the Politician is the lowest form of life on the planet. Go see this movie wherever and whenever you can.",
         "Now THAT is a Czech film. While Kolja, a 1996 Czech film was specifically edited by the British co-producers to strip it of some very Czech elements which were culturally hard to understand for foreign audiences, this one is the real thing. Figures that while Kolja was showered with foreign prizes incl. the Oscar, this one got nothing significant abroad as far as I am aware. No matter, this is a seriously funny and sad film which will tell you a lot about the Czech sense of humour. Many passages sadly won't be that accessible without knowing the culture and history well, and inevitably, lots gets lost in translation, but you may still find it satisfying.",
         "The main issue with this movie is the viewer's knowledge of fairly recent Czech(oslovak) history, namely Prague Spring and subsequent Russian invasion of Czechoslovakia. Without this knowledge too much gets lost 'in translation' and I do not believe the movie can be fully enjoyed, understood, and felt. It is a rich, deep, and extremely well-made movie that will make you laugh out loud as well as cry. It switches so easily and smoothly from deeply sad moments to moments of pure comedy without going over the board and without that Hollywood trademarked kitch-drama. To me, personally, as well as many of my acquaintances, watching this movie is pure joy. Another one of Pelisky's many 'plusses' is the amazing soundtrack that consists of great Czech music from around the time period that it is trying to depict. Also, performance of all the actors is just about as good as it gets, especially the actors who play father Kraus (Kodet) and his daughter Jindriska, are simply outstanding. Final advice: First, read up about Prague Spring and Russian invasion, as well as about Czech Christmas traditions and get a Czech friend to watch Pelisky with you and you will definitely not waste your time - it might turn into a completely amazing cultural experience inside your living room. Also, watch it more than one time - there's always something new you'll find - a new joke to laugh at, etc.",
         "Prague in 1968 prior to the Soviet invasion. The setting is ideal for a political drama, but Czech artists prefer to make a comedy with political background. The action takes place in a house, where families from different political camps (pro-communist vs. anti-communist) live together. The story is told in such a warm, witty and funny way that it immediately resembles the golden years of Czech movie industry in the 70's and 80's. This movie was a tremendous hit on the local Czech market, unfortunately it has never reached my country (Poland). I've had a chance to see it only on the Warsaw Film Festival. It's sad but all the time distributors prefer to show s****y Hollywood cheesy-style romances or action packs, instead real-value movies. Definitely one of the movies of 1999 IMHO. The same goes for other Czech movie - \"Return of the Idiot\" (Navrat Idiota) - watch out for Czechs, they are on the right track again.",
         "This is genuinely one of the best films I have ever seen - Hrebejk at his absolute best. Firstly, it has so many typically Hrebejk touching moments (in fact I felt quite teary for a lot of it), mostly because of the historical background it is set in, but also because of the emotional and sometimes painful ways that the characters interact. Although several of the characters are extremely difficult people, you do sympathise with them. However, secondly, what makes this film so special is that is is genuinely hilarious as well. People had warned me beforehand that the humour was very \"Czech\" and that does not necessarily translate that well. However, I would say this is totally wrong. This film has so many funny parts that there is something for everyone, both black comedy and outright slapstick; for a week I laughed about the scene with the carp in the bath. I highly recommend this film; some knowledge of recent Czech history is useful.",
         "As a person who's been in Czech Republic and knows many Czechs, I say this movie reflects a lot from the genuine Czech lifestyle. The framing when switching from one family to another is splendid, and the characters are absolutely brilliant. An average person could say Jindra's father is a little bit exaggerated, but I found my own father in him so I can relate. Czech family structure and its orientation with the iron curtain culture is elegantly touched. Also, the sad fact that some people unfortunately have to leave their homes and move abroad is another major issue of this movie. I believe anyone from a country that has a lot of negative immigration will feel something different watching it. Another success of the director is that, the scenes spend a lot of time with the Christmas time. But it never gets boring. What I'm looking for in a movie is depth, (which is why I don't really fancy most American movies) and it's present in this one. Social issues, relationships, politics, traditions, everything! In addition to all this, Kristyna Novakova has an outstanding performance, and to me she's a starlet with a bright future. Czech this movie out! You won't be disappointed...",
         "In last few days I've made my own home festival of Czech movies. Today in cue was Hrebejk's \"Pelisky\". Some times ago I've watched his Musime Si Pomahat so I expect great film. But today's movie touched me very deep, reminding some moments from my life. I was born in 1952 so in 1968 I was in same age as young characters of the movie. In august I was on my holidays in the little town in south Poland where my granny lived - just about 150 km from the border of Czechoslovakia. For the rest of my life I will remember the sound of the soviet warplanes heard 20/21 August. I've been watching this movie with the tears in my eyes. I knew all the songs from the CSR big-beat groups because in 1967/68 I've everyday listen the Stanice Hviezda from Ostrava - 80 km from my home town. Really, really great movie. Understandable not only for the Czech & Slovak people.",
         "People outside former Czechoslovakia will probably not fully understand the depth of the story. But if you have possibility to watch it somewhere, do not hesitate and do it. It is worth it definitely. There are very few movies in the world that combine comedy full of jokes with precise points and deep, human drama in them without making it unwatchable. This movie has the best parts of both genres - comedy and drama. The scene in which J.Kodet plays Czechoslovak national anthem on piano is full of pain and tells more about feelings of disappointment and betrayal than 1000 words.. It reminds me very the ending scene from The Deer Hunter (where they started to sing US anthem) - not due to same expression, but the thought behind it. It almost made me cry. Thank you Mr. Hrebejk for this masterpiece!",
         "i saw pelisky in 2000 at the international film festival in aukland, new zealand. almost 5 years later, having only seen the film that one time, i cannot forget how much i loved it. wonderfully funny and tragic, extremely well-acted, by far the best foreign language film in the festival. it was the the highest grossing czech film of the year at the czech box office, third only to titanic and kolya. unfortunately, i'm not sure if it made it into any American theatres and i have not been able to locate a copy since i returned home. if at all possible you get your hands on a copy of pelisky, i promise you will adore this film.",
         "I really enjoyed watching this movie. I found this gem by accident and I'm surprised that it hasn't found it's way to a major audience here in Germany although quite a few Czech movies run on public television. The movie is funny and witty but at times also sad and deadly serious. Like many other Czech movies the story is made up of small parts that fit together as a whole picture. There's the stubborn army officer a convinced communist and his family, there's the war hero that strongly opposes the communist regime a choleric and his family and the single teacher and her son who try to find a new man for the family and there are the teenagers of those families that don't really care about politics or what their parents think is important. Those are the main characters that form a whole picture of life in Czechoslovakia during the Prague spring in 1968. The stories switch at easy from funny to hilarious to sad and back. I recommend this movie to everyone to watch. It is certainly worth the time. Other reviews state that you have to be Czech to fully understand everything. Well, I could relate to the characters as well though I might have missed a cultural reference or two.",
         "This is a beautiful Czech movie where laugh and misery is mixed with melancholy and hope. Worth to see, but only if you know something about European history. Or you can learn just by watching it. Jiøí Kodet is an excellent actor. I have been enjoying his part most of all.",
         "Cosy Dens (1999) is the ironic name given to the film that was called Pelísky in Czech. The movie was directed by Jan Hrebejk. Two families are celebrating Christmas in the same apartment house during the Prague Spring. The father of one family is patriotic and anti-Russian. The father of the other is an army officer, and pro-Russian. The basic plot revolves around the relationships between these families. Clearly, the families symbolize two aspects of Czech society in 1968--some refused to accept the Soviet occupation, and denounced it when they could. Others turned the occupation to their advantage. The movie has several plot threads. The two fathers argue constantly. The young son of one family loves the daughter of the other. (It's not Romeo and Juliet--his love is unrequited.) An aunt hopes to find a husband, but her son and her bad luck get in the way. It's interesting that even the army officer's family celebrate with a traditional Christmas. It's very interesting--at least to a non-Czech--that the families keep a live carp in the bathtub, which is apparently a traditional aspect of the Czech Christmas. The film is not just a comedy. It is a symbolic representation of the tensions of the Czech people, who must adapt to the fact that Russia controls their destiny. They don't know--but we know--that the Prague Spring will come to an end not through liberation, but through the roar of the Warsaw Pact tanks rolling through Prague. There's a long shot of birds in a cage near the end. The presenter of the film made the symbolism clear. The birds have enough food and water to survive, but the central fact of their existence--like that of the Czechs--is that they are not free. Seen as part of the outstanding Alan Lutkus International Film Series at SUNY Geneseo. The film is on DVD, and was projected onto the large screen. It will work on the small screen as well.",
         "Other than the English-language title (\"Cosy Dens\"), pretty much everything about this delicate film is well done: a touching and bittersweet story. A motley group of neighbors, whose lives are intertwined by the friendships of their teenage children, try to sort out their political and personal dreams during an uncertain time in their country's history. The coming-of-age storyline and occasional slapstick antics are here poignantly double-edged, given the audience's knowledge that their world will soon be shaken. And where do the Czechs keep coming up with these incredible young actors (remember \"Kolya\"?) -- these kids are all right.",
         "I have just seen the Australian premiere of this wonderful Czech film at the Sydney Film Festival. Jan Hrebejk takes us back to the months preceding the ill-fated Prague Spring of 1968. It is a most entertaining black comedy from start to finish. Hrebejk is up there with Menzel and Forman and I eagerly await to see his next film.",
         "The film Cosy Dens focuses on three families living in Czechoslovakia during the Prague Spring, a time when the country was much less influenced by Communism than it had been before or after. However, despite the political backdrop, the threat of Communism and the fact that this more liberal society is only temporary does not play a major role in the narrative. The primary events of the film follow typical families of the period without dwelling too much on Czech society as a whole. The movie shares similarities to Christmas movies in American cinema. In visual style the movie looks a lot like A Christmas Story. Both films make use of an idealized looking past where everything has this gold-tinted lighting and everyone wears pristine versions of the clothes that existed at the time. In contrast to this romanticized version of the past, there is the more chaotic element of family drama. This is common in holiday movies and uses the cynical subversion of Christmas being the \"happiest time of the year\" to derive much of the humor. The film shows Michal's sister receiving a cross bow which is similar to the BB gun in A Christmas Story, and the overall demeanor of Michal's father is similar the \"The Old Man\" in that they both act like they are the all-knowing patriarchs of the their family when in fact they are both bumbling idiots in actual practice. There's also an interesting moment that parallels Home Alone where a character lights the top of his head of fire. This may or may not have been a deliberate reference but it is a very specific thing that happens in both films and would be an odd coincidence if it was not intentional. Cosy Dens is a slice of life movie, so there is very little plot. The teenage character of Michal has a crush on his neighbor Jindriska, who begins dating Elien. Michal's infatuation drives many of his actions that propel the story. Jindriska and Michal's parents represent the opposing ideologies of the Prague Spring. Mr. Kraus (Jindriska's father) is strongly opposed to the Communists, while Mr. Sebek (Michal's father) is a Communist soldier. As neighbors Kraus and Sebek often interact with each other, but resent each other because of their opposing ideologies and differing personalities. This dynamic represent something interesting about Cosy Dens. Many aspects of the movie work as both a simple coming of age story and as a microcosm for Czech politics at the time. For example, the character of Elien is a mod that is interested in the British subcultures that were emerging at this time. Within the movie's plot he is a romantic rival to Michal, and in the larger context of Czech society he represents the influx of Western democratic ideas and culture that define the Prague Spring. The idea behind subcultures whether mod, hippie, or any other is the rejection of mainstream culture and the society it represents. This glorification of individuality is in stark contrast to the ideas of societal unity that Communist like Sabek believe. Elien even showed American films, directly spreading that culture to the people in his community. Sabek's Communist allegiance is manifested in his glorification of new technology created by other Communists such as the \"unbreakable\" plastic cups, and much like the idea of Soviet Communism, the notion that the cups are unbreakable does not hold up to scrutiny. The death of Kraus's wife somewhat foreshadows and parallels the Russian invasion in that many of the things he cares about, his wife and his ideology, are not going to be a comfort to him forever, and in fact he is the one that is most upset when the invasion occurs. Outside of relationships that represent the political atmosphere of the time, there are also typical family relationships that do not seem to represent anything else. The relationship between Michal and his father is strained because they have different interest. Michal is disinterested in his father political obsessions and Mr. Sebek thinks his son's interests are going to turn him into a degenerate. Similarly, Jindriska's father thinks she is a failure because she doesn't want to practice playing the piano and doesn't share his passion for having all the skills he takes so much pride in, while she shares a closer relationship in her more accepting mother. Sebek's relationship with his brother is competitive, almost to an unhealthy level, and he goes out of his way to impress him. These interactions seem to represent a fairly realistic family dynamic that is influenced by a generation gap and the stress of entertaining a large group of people over the holidays. The film culminates in the Soviet invasion of Czechoslovakia in 1968, ending the Prague Spring, but, except for Mr. Kraus's strong anti-Communist patriotism, the movie has very little to do with politics directly, especially if the viewer unfamiliar with the events. First and foremost it is a movie about family relationships. This makes the vast majority of the movie very accessible and watchable for everyone. However, the ending does not seem like an appropriate conclusion to this mostly universal story. It is very specifically about the end of the Prague Spring. The entire movie does deal with the Prague Spring, but it is handled in a much more subtle way, using characters to represent the political tension. The invasion was a national event, whereas the rest of the movie is more personal and focused entirely on the lives of a few people. Even when these people have ideologies that are nationally based (anti/pro-Communism,) they express these ideas in the way they interact with their family and friends. The invasion is impersonal and largely irrelevant to everything that happens up until that point. It would be more satisfying if there was a conclusion that only effected the characters and the world that had been shown up until that point."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Ceská Televize",
         "Total HelpArt T.H.A."
      ],
      "summaries": ["Two families, Sebkovi and Krausovi, are celebrating christmas, but not everyone is in a good mood. Teenage kids think their fathers are totaly stupid, fathers are sure their children are nothing more than rebels, hating anything they say."],
      "budget": 0
   },
   "movielensId": 168760,
   "movielens": {
      "languages": [
         "Český",
         "Pусский"
      ],
      "releaseDate": "1999-04-08",
      "dvdReleaseDate": null,
      "directors": ["Jan Hřebejk"],
      "runtime": 115,
      "movieId": 168760,
      "title": "Cosy Dens",
      "mpaa": "",
      "actors": [
         "Miroslav Donutil",
         "Jiří Kodet",
         "Simona Stašová",
         "Emília Vášáryová",
         "Bolek Polívka",
         "Marek Morvai",
         "Stella Zázvorková",
         "Jaroslav Dušek",
         "Michael Beran",
         "Kristýna Nováková",
         "Jiří Krejčík",
         "Sylvie Koblížková",
         "Ondřej Brousek",
         "Boris Hybner",
         "Eva Holubová"
      ],
      "imdbMovieId": "0167331",
      "originalTitle": "Pelíšky",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two families, Sebkovi and Krausovi, are celebrating christmas, but not everyone is in a good mood. Teenage kids think their fathers are totaly stupid, fathers are sure their children are nothing more than rebels, hating anything they say. Written by Antonín",
      "tmdbMovieId": 15387,
      "avgRating": 3.96667,
      "releaseYear": "1999",
      "numRatings": 15,
      "posterPath": "/lVGn75s3pjDEQictwU7a2kIIDJW.jpg"
   }
}