{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0328183",
      "video": false,
      "title": "Escape from the Newsroom",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Findlay",
               "gender": 2,
               "credit_id": "5a257faa925141032c0decc6",
               "name": "Ken Finkleman",
               "profile_path": null,
               "id": 27746,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Jim Walcott",
               "gender": 2,
               "credit_id": "5a257fb40e0a264ccd0e0392",
               "name": "Peter Keleghan",
               "profile_path": "/aCoDxLVRcVo8kGp9WYl7kBPYUqM.jpg",
               "id": 78412,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Chris",
               "gender": 2,
               "credit_id": "5a257fc0c3a3680b880e005e",
               "name": "Christian Potenza",
               "profile_path": "/5i8BeVv8RKyFVMdo24kcxNjSae9.jpg",
               "id": 1212946,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Jeremy",
               "gender": 0,
               "credit_id": "5a257fde92514103330d9b3b",
               "name": "Jeremy Hotz",
               "profile_path": null,
               "id": 1225055,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Karen",
               "gender": 1,
               "credit_id": "5a257fe792514103240db0b6",
               "name": "Karen Hines",
               "profile_path": "/yVAzkFuYamHCT8pU2QQGPrREsGL.jpg",
               "id": 60095,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Bruce",
               "gender": 2,
               "credit_id": "5a257ff10e0a264cc80e4e20",
               "name": "David Huband",
               "profile_path": "/o8wwJkxTtoyVggtkKVg07DhhBfd.jpg",
               "id": 5922,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Martin",
               "gender": 2,
               "credit_id": "5a25800dc3a3680b930de3a0",
               "name": "Boyd Banks",
               "profile_path": "/mDsIaLKyGqyV1Nt0pV9joGkQNSP.jpg",
               "id": 20196,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "57a8665a925141746f00506b",
            "name": "Ken Finkleman",
            "profile_path": null,
            "id": 27746,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.091183,
      "production_countries": [],
      "id": 409879,
      "vote_count": 1,
      "budget": 0,
      "overview": "It's a strange movie that you have to watch beginning to end, or you'll find yourself completely lost. Based on the Toronto-made TV series \"Newsroom,\" this made-for-TV movie has many well-recognized Canadian actors and comedians. It's a modest comedy that has its \"short chuckle of laughter\" moments, but the real highlight is similar to the highlight of 12 Angry Men. They obviously endeavoured to make the acting look as real and natural as possible when making this show, and most of the entertainment comes from listening in on their conversations and being convinced by the good acting. This is the similarity to 12 Angry Men.",
      "similar": [],
      "original_title": "Escape from the Newsroom",
      "runtime": 84,
      "poster_path": "/blacU89xV7ce0sGnSIiO0h1qwLA.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2002-10-28",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Finkleman"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Ken Finkleman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0328183/",
      "coverLink": null,
      "actors": [
         "Ken Finkleman",
         "Peter Keleghan",
         "Christian Potenza"
      ],
      "reviews": [
         "Most of Ken Finkleman's work has an acquired taste. You have to like his will for artistic creativity and also understand his satiric outlook. The acting is great, though I wish Mark Farrell was in it. But the one thing that sets this apart from the regular Newsroom series is that he goes further to play with satire and reality, this time using his surrealist approach. This is what I'd say to be the best part of the movie, though others who do not accept Ken Finkleman's art over his satiric comedy may be bothered by it. Basically, if you just like the Newsroom series and probably haven't heard of anything else Ken Finkleman has done, you might not like this one. It's not the Newsroom, but just as the title says, it's an escape from it. Others who appreciate Finkleman's body of work, and would probably pay to see him direct a jean commercial if he ever did one (ya right), it is they who would get the most from this.",
         "\"Escape\" begins much like \"The Newsroom\" did. Finkleman is marvelous with his dialogue. We don't have Mark Farrell or Tanya Allen anymore, but Christian Potenza and Regean Pasternak are worthwhile replacements. The film reaches a point in which Finkelman's trademark surrealism takes over, and this film jumps into the realm of \"art\" rather than \"entertainment\", complete with a blunt damning of the whole concept of reviving this show! Unfortunately, while The Newsroom quite often provided great entertainment, the \"art\" that is \"Escape\" does not. Escape continues the tone established by More Tears, Foolish Heart, and Foreign Objects, none of which were nearly as successful as The Newsroom was, with good reason. Dry, biting satires are wonderful if done with some entertainment value, but lose their effect when they're just downright inaccessible, as this film had become. It's hard to be entertained at jokes about people dying from Anthrax. Things do start to make sense at the end - you realize what Finkleman wanted to say and he then returns to the same lovable humour we've come to expect from him. Now that his point has been made (roughly 10 times now, from all of his series), he can get back to writing the wonderful satire we've come to enjoy so much.",
         "This is a good show. I don't remember this as much as the TV series they did which I thought was great, it wasn't as good as the series and the later series they did where they brought back the Newsroom was even less good, but this was enjoyable enough. It is about a heartless news producer who uses horrible events as a way to get better viewer-ship numbers for his show, all of the characters have some big flaws. The jokes are good if you like dark humour. Like I said not as good as the original show was but still worth watching if you ever get a chance to see it on TV again. I would recommend it and as a TV show on CBC it is pretty safe for the whole family to watch though like I said there is some dark stuff.",
         "I won't reveal any spoilers to the plot of the movie. It's a strange movie that you have to watch beginning to end, or you'll find yourself completely lost. Based on the Toronto-made TV series \"Newsroom,\" this made-for-TV movie has many well-recognized Canadian actors and comedians. It's a modest comedy that has its \"short chuckle of laughter\" moments, but the real highlight is similar to the highlight of 12 Angry Men. They obviously endeavored to make the acting look as real and natural as possible when making this show, and most of the entertainment comes from listening in on their conversations and being convinced by the good acting. This is the similarity to 12 Angry Men. However, the TV movie is really nothing more than a 2-hour episode of Newsroom. Whether you like it will likely depend on whether you like the TV series or not.",
         "I won't reveal any spoilers to the plot of the movie. It's a strange movie that you have to watch beginning to end, or you'll find yourself completely lost. Based on the Toronto-made TV series \"Newsroom,\" this made-for-TV movie has many well-recognized Canadian actors and comedians. It's a modest comedy that has its \"short chuckle of laughter\" moments, but the real highlight is similar to the highlight of 12 Angry Men. They obviously endeavoured to make the acting look as real and natural as possible when making this show, and most of the entertainment comes from listening in on their conversations and being convinced by the good acting. This is the similarity to 12 Angry Men. However, the TV movie is really nothing more than a 2-hour episode of Newsroom. Whether you like it will likely depend on whether you like the TV series or not."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "100% Film and Television",
         "Canadian Broadcasting Corporation (CBC)",
         "Showcase Television"
      ],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 168746,
   "movielens": {
      "languages": [""],
      "releaseDate": "2002-10-28",
      "dvdReleaseDate": null,
      "directors": ["Ken Finkleman"],
      "runtime": 84,
      "movieId": 168746,
      "title": "Escape from the Newsroom",
      "mpaa": null,
      "actors": [
         "Ken Finkleman",
         "Peter Keleghan",
         "Christian Potenza",
         "Jeremy Hotz",
         "Karen Hines",
         "David Huband",
         "Boyd Banks"
      ],
      "imdbMovieId": "0328183",
      "originalTitle": "Escape from the Newsroom",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "It's a strange movie that you have to watch beginning to end, or you'll find yourself completely lost. Based on the Toronto-made TV series \"Newsroom,\" this made-for-TV movie has many well-recognized Canadian actors and comedians. It's a modest comedy that has its \"short chuckle of laughter\" moments, but the real highlight is similar to the highlight of 12 Angry Men. They obviously endeavoured to make the acting look as real and natural as possible when making this show, and most of the entertainment comes from listening in on their conversations and being convinced by the good acting. This is the similarity to 12 Angry Men.",
      "tmdbMovieId": 409879,
      "avgRating": 2.75,
      "releaseYear": "2002",
      "numRatings": 2,
      "posterPath": "/blacU89xV7ce0sGnSIiO0h1qwLA.jpg"
   }
}