{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "car race",
            "id": 830
         },
         {
            "name": "belgium",
            "id": 1690
         },
         {
            "name": "car mechanic",
            "id": 3296
         },
         {
            "name": "porsche",
            "id": 4946
         }
      ],
      "imdb_id": "tt0061605",
      "video": false,
      "title": "The Departure",
      "recommendations": [
         104744,
         52677,
         94663,
         11492,
         250374,
         63290,
         22521
      ],
      "backdrop_path": "/bjfBlKOrkRqp1RV42kaQbssDGB3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marc",
               "gender": 2,
               "credit_id": "52fe4c38c3a368484e1ad665",
               "name": "Jean-Pierre Léaud",
               "profile_path": "/dzkPODapVe4CSubEqI9ytTCqnZ7.jpg",
               "id": 1653,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Michèle",
               "gender": 0,
               "credit_id": "52fe4c38c3a368484e1ad669",
               "name": "Catherine-Isabelle Duport",
               "profile_path": null,
               "id": 39068,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "The Woman",
               "gender": 0,
               "credit_id": "53f4d93b0e0a267f800027ff",
               "name": "Jacqueline Bir",
               "profile_path": null,
               "id": 1319926,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "The Boss",
               "gender": 0,
               "credit_id": "53f4d9540e0a267f7700280d",
               "name": "Paul Roland",
               "profile_path": null,
               "id": 1355010,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53f4d9690e0a267f80002804",
               "name": "Paul Frère",
               "profile_path": null,
               "id": 1355011,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c38c3a368484e1ad66f",
               "name": "Jerzy Skolimowski",
               "profile_path": "/sBzhVnGFIjpA9gL4okmLhafS4CJ.jpg",
               "id": 43553,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53f4d8770e0a267f890028cc",
               "name": "Andrzej Kostenko",
               "profile_path": null,
               "id": 1007737,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53f4d88b0e0a267f770027fd",
               "name": "Jerzy Skolimowski",
               "profile_path": "/sBzhVnGFIjpA9gL4okmLhafS4CJ.jpg",
               "id": 43553,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f4d8bb0e0a26419b00149c",
               "name": "Bronka Ricquier",
               "profile_path": null,
               "id": 1355009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53f4d8d00e0a267f830027c4",
               "name": "Krzysztof Komeda",
               "profile_path": null,
               "id": 12013,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53f4d8e60e0a267f77002806",
               "name": "Willy Kurant",
               "profile_path": null,
               "id": 38168,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "53f4d8f90e0a26419b0014a2",
               "name": "Bob Wade",
               "profile_path": null,
               "id": 1295712,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.163905,
      "production_countries": [{
         "iso_3166_1": "BE",
         "name": "Belgium"
      }],
      "id": 137726,
      "vote_count": 7,
      "budget": 0,
      "overview": "A fast-paced comedy about a young Belgian car nut and hairdresser's apprentice, his girlfriend, and their legal and illegal attempts to get a Porsche under him for his nearing debut race.",
      "similar": [
         920,
         818,
         158,
         49013,
         105,
         165,
         19912,
         9679,
         10483,
         168259,
         51620,
         7459,
         221902,
         638,
         77950,
         11451,
         9615,
         838,
         14136,
         16411
      ],
      "original_title": "Le départ",
      "runtime": 85,
      "poster_path": "/roDxu5IVxXc6UNOLIL8WVGB1ZKU.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1967-03-06",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jerzy Skolimowski"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Andrzej Kostenko",
         "Jerzy Skolimowski"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0061605/",
      "coverLink": null,
      "actors": [
         "Jean-Pierre Léaud",
         "Catherine-Isabelle Duport",
         "Jacqueline Bir"
      ],
      "reviews": [
         "If you're in the States, it seems there's a 99% chance you won't get a chance to see this consistently entertaining film, save for the outside possibility it's shown in a big-city arthouse theater. As you might've read from the description above, it concerns Marc (a typically charming, uncharacteristically manic Jean-Pierre Leaud), an automobile-obsessed young hairdresser in Brussels struggling to obtain money needed to finance the car he needs for an upcoming race. With no assistance from his coworkers, Marc enlists the help of Michele, the loyal girlfriend he keeps at arm's length (the likeable Catherine Duport) not only because of his immaturity, but his single-minded focus on car racing. As the earlier commentator said, a main reason for seeing this film is the charismatic presence of Leaud (it seems a tailor-made film for him), but another draw is the quiet intelligence Duport exudes, and the film's markedly mid-60's style. Krzysztof Komeda's energetic, jazz-tinged score is conspicuous yet completely relevant. Jerzy Skolimowski managed to craft a funny, modish, and assured film in a language that he apparently didn't even speak! Certainly worth a viewing, if you get the chance.",
         "Jerzy Skolimowski's 1967 obscure New Wave comedy-drama is a must find for Jean Pierre Leaud fans. Though I'm not sure how many are out there, outside of myself? The movie opens with Marc (Leaud) borrowing (more like joyriding) a Porsche, and continuing through the rest of the film trying to get a car to join a Belgian car race. By day he works as a beautician and dreams of racing. But along the way he meets up with Michele (Catherine Duport) and she assists with helping Marc find a car (or at least forget about the race). The story is actually about Marc and Michele, and Marc's inability to be sexually physical or emotionally available to Michelle. I'm not quite sure if it's due to immaturity or if it's something else. But his character reminds me a little of Michael (John Moulder Brown) from Skolimowski's later film \"Deep End\" (1970) Both are impotent in emotional and sexual contact, when it comes down to making love with their potential partners. Both characters view things in a childish but surreal manner. \"Le Depart\" contains a scene in which Marc and Michele are in a car (that's on display at a car show) that splits in half allowing both passengers to be seated in the car to look at each other, but not able to touch (being that Marc refuses to let go of his childish notion to car race, the car is now what splits them apart). In \"Deep End\" Michael falls into the water after quarreling with some boys over Susan (Jane Asher) and underwater, he views a naked woman swimming underneath him. Again both films represent the out of reach sexual fantasy. Marc play with cars, and Michael sucks his thumb and has temper-tantrums. Both are boys, that have refused to give up a part of their childish ways, to make them free to live in a more mature sexually adult world. The difference in both are in the endings. Where Marc is able to forget about his notions of racing, and commit to Michele in a sexual way. Michael's fight to remain in his younger state, has sabotaged Susan's life in an explosive accident. Jerzy Skolimowski is trully an unrecognized director that deserves much more. Some of the greatest films of the late sixties to the late seventies were directed by him (\"Le Depart\", \"Deep End\", and \"The Shout\"). Unfortunaely he goes unnoticed. If anyone can find this film, I recommend it. Funnily, I noticed that there wasn't much dialog in the film. Later I was to read that Polish director Skolimowski doesn't speak French at all, though it was filmed in Belgian. That must have been fun to direct? Highly recommended! The burning up of the film negative was a great closing!",
         "Skolimowski's first film after leaving Poland (following a ban imposed on his political allegory HANDS UP! [1967; released 1981]) - has an air of inconsequentiality about it which was also evident in his earlier work but, lacking those films' socio-political resonance, it comes across as rather pointless - if not without merit and charm. Still, despite the fact that it features one of the defining faces of the Nouvelle Vague in Jean-Pierre Leaud, the film doesn't feel French at all - and this is augmented by the typical strains of Krzysztof Komeda's score. The leads (Leaud and Catherine Dupont) are engaging and the film amusing (particularly the numerous scenes in which Leaud gets into a scuffle), and seems to have been partly improvised (for instance, the mirror sequence that's tinged with surrealism). Racing-cars aren't my cup of tea but Skolimowski and Leaud manage to capture the mind-set of a fanatic on the subject. Basically, it boils down to being a dreamer's wish-fulfillment fantasy - which, as often happens in cinema, is never achieved; indeed in the end, just when our hero (who is driven to committing both fraud and theft to satisfy his passion!) seems about to make it, he gives everything up for no apparent reason!",
         "I was glad when this one was over. Skolimowski had a big reputation in the 60's as an avant-guard director in Poland (Barrier) who had to leave for the West because of the government crackdown on artists. Here he is using Godard's actors--Leaud and Duport from Masculine-Feminine--and cameraman, and Polanski's favorite composer (Komeda). The story he tells is so trite, so lacking in human interest as to make the viewer lose all interest in what is happening, and sometimes there's a lot happening. Leaud is encouraged to display all the worst features of this young man: the bratty, childish behavior, the forced cackling laugh, so ugly to hear. You won't laugh at the dumb fights that Marc gets into, or the scene at the hairdresser's when he gets his buddy to bloody his nose so he can get out of work. When you steal a car, as Marc does three times, don't the police go looking for you? No sign of that. Catherine Duport--well, the less said about her, the better. It was the third and last film for this ex-model, and a more bovine and boring performer could hardly be imagined. Willy Kurant gives us the best scene by far; he's lit the car showroom very sharply and coldly for the car that splits in half with the two lovers in it. It's splendid."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "productionCompanies": [
         "Elisabeth",
         "Elisabeth Films"
      ],
      "summaries": ["A fast-paced comedy about a young Belgian car nut and hairdresser's apprentice, his girlfriend, and their legal and illegal attempts to get a Porsche under him for his nearing debut race."],
      "budget": 0
   },
   "movielensId": 168756,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1967-03-06",
      "dvdReleaseDate": null,
      "directors": ["Jerzy Skolimowski"],
      "runtime": 85,
      "movieId": 168756,
      "title": "The Departure",
      "mpaa": null,
      "actors": [
         "Jean-Pierre Léaud",
         "Catherine-Isabelle Duport",
         "Jacqueline Bir",
         "Paul Roland",
         "Paul Frère"
      ],
      "imdbMovieId": "0061605",
      "originalTitle": "Le départ",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A fast-paced comedy about a young Belgian car nut and hairdresser's apprentice, his girlfriend, and their legal and illegal attempts to get a Porsche under him for his nearing debut race.",
      "tmdbMovieId": 137726,
      "avgRating": 3.5,
      "releaseYear": "1967",
      "numRatings": 2,
      "posterPath": "/roDxu5IVxXc6UNOLIL8WVGB1ZKU.jpg"
   }
}