{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "death penalty",
            "id": 2122
         },
         {
            "name": "south africa",
            "id": 3644
         },
         {
            "name": "apartheid",
            "id": 4106
         },
         {
            "name": "courtroom",
            "id": 33519
         }
      ],
      "imdb_id": "tt4627352",
      "video": false,
      "title": "Shepherds and Butchers",
      "recommendations": [
         381041,
         324300,
         381011,
         256095,
         403848,
         427733,
         19215,
         415908,
         407547,
         455549,
         298157,
         378230,
         463320,
         168243,
         364223,
         388757,
         410207,
         86990,
         68556,
         214219
      ],
      "backdrop_path": "/knD3C7L990W9QtT1053r0tdY9JC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kathleen Marais",
               "gender": 1,
               "credit_id": "56c2370e9251414a920004b9",
               "name": "Andrea Riseborough",
               "profile_path": "/5Qi1DVUts9gahVpj1dCtspbwcAC.jpg",
               "id": 127558,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Johan Webber",
               "gender": 2,
               "credit_id": "56c237199251414a890004e7",
               "name": "Steve Coogan",
               "profile_path": "/ljhsNmGQQrgeBj64x5uL27U6UqY.jpg",
               "id": 4581,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Warrant Officer Rautenbach",
               "gender": 2,
               "credit_id": "56ed3478925141323d001f0a",
               "name": "Deon Lotz",
               "profile_path": "/ippPb3HDaNICCot4wCUMAoPJBL5.jpg",
               "id": 1041697,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Pedrie Wierda",
               "gender": 0,
               "credit_id": "56ed34a2c3a36822650061ed",
               "name": "Eduan van Jaarsveldt",
               "profile_path": "/dYjtfPj73pluuANDOphPCywPIxT.jpg",
               "id": 1181393,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Liesl Weber",
               "gender": 1,
               "credit_id": "576a9133c3a3681ae5000075",
               "name": "Lauren Steyn",
               "profile_path": "/9PydXWKDbLwqzbznzL2butfZmEb.jpg",
               "id": 1639757,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Pierre De Villiers",
               "gender": 2,
               "credit_id": "576a91f6c3a3681b4a0000ae",
               "name": "Robert Hobbs",
               "profile_path": "/yN6gVehZi1Y5P5kDazI8FmB8Bb0.jpg",
               "id": 82190,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Tennis partner",
               "gender": 2,
               "credit_id": "576a9223925141086b00008d",
               "name": "Brett Williams",
               "profile_path": "/p78ogpOfHwWOcRnvUiy38B1zvgz.jpg",
               "id": 98414,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Leon Labuschagne",
               "gender": 2,
               "credit_id": "56ed34b99251415e62006556",
               "name": "Garion Dowds",
               "profile_path": "/gJvDGQ3uYPGlhfdgafEhTPp0YVb.jpg",
               "id": 1592803,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56c236a3c3a36826060005c3",
               "name": "Oliver Schmitz",
               "profile_path": null,
               "id": 21683,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56ed351a92514143fe006330",
               "name": "Paul Hepker",
               "profile_path": null,
               "id": 13082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "56ed3534925141569f0015ba",
               "name": "Megan Gill",
               "profile_path": null,
               "id": 13085,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56ed3547c3a3682265006208",
               "name": "Leah Striker",
               "profile_path": null,
               "id": 73010,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "56ed3569c3a3682253006c1d",
               "name": "Anant Singh",
               "profile_path": null,
               "id": 23824,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56ed36009251413a8f004036",
               "name": "Brian Cox",
               "profile_path": null,
               "id": 1296991,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58824dfd925141303e01023a",
               "name": "Chris Marnewick",
               "profile_path": null,
               "id": 1742652,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "58824e3f9251413034010be4",
               "name": "Brian Cox",
               "profile_path": null,
               "id": 1296991,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.796145,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 382883,
      "vote_count": 27,
      "budget": 0,
      "overview": "A lawyer takes on a case of a prison guard in South Africa who is traumatized by the executions he's witnessed.",
      "similar": [
         11615,
         769,
         4771,
         75780,
         389,
         169917,
         452507,
         392044,
         346364,
         281957,
         17654,
         2048,
         562,
         101299,
         181283,
         207932,
         433808,
         336843,
         133805,
         22954
      ],
      "original_title": "Shepherds and Butchers",
      "runtime": 80,
      "poster_path": "/7piZRI8wQV0hrlKgfgANfQNz4RE.jpg",
      "spoken_languages": [
         {
            "name": "Afrikaans",
            "iso_639_1": "af"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Videovision Entertainment",
            "id": 5031,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Distant Horizon",
            "id": 85681,
            "origin_country": ""
         }
      ],
      "release_date": "2017-05-12",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Death Belongs To God Alone",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oliver Schmitz"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Chris Marnewick",
         "Brian Cox"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4627352/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzczMGMyY2ItY2E5Mi00NGYxLThkMWItOTA5YzliZmE2YTViL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQ1NzkxMQ@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Andrea Riseborough",
         "Steve Coogan",
         "Inge Beckmann"
      ],
      "reviews": [
         "Very similar to his work on Philomena. A brilliant narrative investigating a mass shooting and the tortured soul on trial. Much more that a legal drama. Its a dark journey into a barbaric (and hopefully much remedied) prison system in South Africa. Steve Coogan has carved himself a specialty with these films. He brings intensity and brilliant deduction into this character and his scenes. Also of note is that this appears to be from first time writer and a first time director. Very pleasant surprise that they are so good at delivering a moving subject in their first venture to attract the talented Mr. Coogan. The young murderer is also very well cast and I can expect other large roles in his future.",
         "This beautifully filmed drama, set in apartheid era South Africa manages to be at once brutal and sensitive. Steve Coogan and Andrea Riseborough face each other in the trial of a psychologically broken prison guard, accused of a multiple murder. Graphic and harrowing at times, delicately picking an unconventional course to its conclusion. Effectively a period piece, convincingly set in 1980's Pretoria, filmed in Cape Town in pleasing detail. Centred in the courtroom, but repeatedly flashing back to the accused's past as a prison guard on death row and following Coogan's progress through the trial in his defence. The prison and execution scenes play out in sickening detail, with a host of convincing supporting actors. The courtroom too has several well observed characters, from the judge to the bereaved relatives. The accused guard is well played; too, too young, and a mental and emotional shell of a man, opening up painfully slowly during the piece. Coogan though is the star; at first reluctant, then intrigued and finally quite determined as the defence counsel. The camera holds him close in this very convincing portrayal. The whole film is beautiful, cleverly lit and stylish, with great attention to all the details of the time and the place. The Afrikaaner Warrant Officer quietly chilling, the courtroom relatives, glorious. A genuinely emotional and thought provoking film, touching on several aspects of the capital punishment debate. It alternately brought to mind Oscar Pistorius' trial and Billie Holiday's 'Strange Fruit'. Be prepared for mixed feelings at the end!",
         "Set in apartheid South Africa, this courtroom drama is based on true events. It looks at the case of a young white man accused of shooting dead seven black men in a seemingly motiveless scenario. It soon became apparent that he worked in a high security prison as a guard in the death row unit, where his daily routines had him simultaneously look after the prisoners and also lead them to the gallows. His defence team tried to prove his actions were a direct result of the psychological trauma that came from such a disturbing and stressful environment. I thought this was a somewhat unusual courtroom drama. In most examples of the genre we are presented with a clear cut scenario where the film-makers make it quite clear who we will be rooting for. This one, by contrast, operates almost exclusively in shades of grey. Unlike how it is usually done, the lawyers on both sides of the argument are presented fairly. In most films of this type the opposing lawyer is generally shown to be a moral degenerate; in this one the prosecution attorney, played by Andrea Riseborough, is often represented as more reasonable that the main protagonist, the defence lawyer played by Steve Coogan. This measured approach is to be commended, as it comes over as more realistic and less manipulative. It also serves to ensure that the courtroom scenes are slightly underplayed, meaning that the flash-back scenes to the parts depicting the executions seem even more horrific by direct comparison. These scenes in particular are perhaps what ultimately defines this film as they show capital punishment in intensely graphic detail and are very disturbing. It's many of the little horrible human details of the process that will stick long in the memory. The story itself resolves itself in a way that is more complex than these films usually allow themselves to be. Coogan essentially wins his case against the system but in doing so gets his client a deal which feels – to me in any case – far too lenient and it is the black under-class who ultimately do not fully get justice. While at the same time, the reason given for triggering the murder seemed, to say the least, questionable. The case actually seemed horribly like a miscarriage of justice in an unfair society in all honesty. But through this case many things are examined quite effectively. Chief of these being the sheer horror of the death penalty mechanism and the way that it can sometimes be forgotten that it is ultimately a very violent and disturbing process. I think this film was highly interesting in that it is not about comforting resolutions - the resolution made me feel very uneasy in fact – but it feels truer to life for all that. It makes you ponder issues of justice, capital punishment and – even though it never comes out explicitly – racism. A very thought-provoking film overall.",
         "This movie is a nice vehicle for Steve Coogan and Andrea Riseborough. The film is about the old pre-Mandela South Africa and it does not illuminate any of the current issues they may face, so it could be called a period piece. This is a courtroom drama and we do not see Andrea's character outside the courtroom setting, which is a pity as it could have added some depth to the issues. There is a touch of depth added by the protagonist's tennis buddies. The story is moving but we know the steps to the end early and the movie just gets us there. There is a scene with Steve Coogan running along a beach, obviously this was to show he was troubled by the case but he was set up in the first scene as an anti-capital punishment campaigner and so he should not be shocked.",
         "This is very moral based and has a purpose. So if you don't like a movie to hammer something into you, this may not be a movie for you to watch. Don't get me wrong, there is still a lot of tension and edge of your seat kind of stuff going on. Not to mention violence and drama about people who try living their lives, but have a lot of baggage. The psyche of people who have a tough job is really fragile. So when at the end you get the and this happened shortly after in real life, you probably should not be too surprised. And you probably won't be too surprised about the outcome of the movie anyway. The acting is good, the direction is good and if you don't mind court dramas with moral flavour, you could do worse",
         "What detail surprised me? Normally this type of films, they usually take more along the racist road, but this time no, this time the film is not going around, white against black, if not all drifting towards a plea against the death penalty. The funny thing is that on all sides we see that this is requested, except for the defense lawyer. The truth is that it is not a bad movie, but it does not become a great movie, more than anything because I do not believe many of the things. The lawyer and the lawyer should not have passed the casting. She has neither strength nor anything and there are moments when I focus more on other aspects of her face than on her performance. The defendant is very content, but can lead not to believe it very easy. The films of trials are usually boring and must be done very well. This is not the case. Moments of judgment are not the best taken. I do not really like photography. When you try to put the light through the windows, the photograph is horrible. He does not know how to do it. The moments on the street look more like a movie for television than anything else. The management is not great either. It does not get boring, but it's very close. It is very repetitive. He does not know how to do anything but close-ups. You will see it and well you have not wasted the time, but almost",
         "\"The Hangman: Shepherds and Butchers\" is a South African film based on true events of the late 1980s. The film is primarily a courtroom drama that touches on capital punishment, moral responsibility, and the mercurial nature of the judicial process. The narrative introduces us to a troubled young man on trial for the murder of seven athletes, whom he shot in cold blood as they were driving in a minivan. The defendant, Leon Labuschagne, has assigned to him a defense attorney, who slowly pieces together the background of the young man while working as in a prison. Apparently, the defendant was traumatized by having to assist in executions by hanging of over 150 inmates. The case emotional defense presented by Mr. Webber is countered by an icily cold prosecutor, Miss Murray, who argue for the death penalty. The film takes great pains to point out the differences between the two attorneys. Miss Murray seems remarkably detached from her work, calling to mind the nonchalant manner in which the inmates were subjected to gruesome hangings, sometimes lasting as long as fifteen minutes prior to expiration. The presiding judge appeared to have made up his mind early in the trial without hearing all of the evidence. It is clear that on the panel of three judges, the presiding judge was a dissenter in the split vote. This provocative film raises ethical issues on many legal fronts. In the closing credits, we learn that with the presidency of Nelson Mandela, there were much-needed reforms in South African jurisprudence."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Distant Horizon",
         "Videovision Entertainment"
      ],
      "summaries": [
         "SHEPHERDS AND BUTCHERS follows a jaded lawyer, John Weber (Steve Coogan), who takes on a seemingly hopeless multiple murder case and uncovers scandalous shortcomings in South Africa's capital punishment system as he mounts a defense for a prison guard traumatized by the executions he took part in.",
         "A lawyer takes on a case of a prison guard in South Africa who is traumatized by the executions he's witnessed."
      ],
      "budget": 0
   },
   "movielensId": 169008,
   "movielens": {
      "languages": [
         "Afrikaans",
         "English"
      ],
      "releaseDate": "2017-05-12",
      "dvdReleaseDate": null,
      "directors": ["Oliver Schmitz"],
      "runtime": 80,
      "movieId": 169008,
      "title": "Shepherds and Butchers",
      "mpaa": "",
      "actors": [
         "Andrea Riseborough",
         "Steve Coogan",
         "Deon Lotz",
         "Eduan van Jaarsveldt",
         "Lauren Steyn",
         "Robert Hobbs",
         "Brett Williams",
         "Garion Dowds"
      ],
      "imdbMovieId": "4627352",
      "originalTitle": "Shepherds and Butchers",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["iPVOtTJ4qHI"],
      "plotSummary": "A lawyer takes on a case of a prison guard in South Africa who is traumatized by the executions he's witnessed.",
      "tmdbMovieId": 382883,
      "avgRating": 2.5,
      "releaseYear": "2017",
      "numRatings": 13,
      "posterPath": "/7piZRI8wQV0hrlKgfgANfQNz4RE.jpg"
   }
}