{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "sound",
            "id": 191988
         }
      ],
      "imdb_id": "tt0019278",
      "video": false,
      "title": "Plane Crazy",
      "recommendations": [
         128679,
         134757,
         85791,
         53219,
         134758,
         90909,
         129303,
         110760,
         160332,
         127817,
         48712,
         146362,
         145337,
         84893,
         86735,
         33600,
         105408,
         87200,
         127409,
         53494
      ],
      "backdrop_path": "/qhD2boCd8eudyAPrPDxzw7R04xh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 3,
            "character": "Mickey Mouse",
            "gender": 2,
            "credit_id": "52fe46cdc3a36847f8113131",
            "name": "Walt Disney",
            "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
            "id": 2106,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cdc3a36847f8113127",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54cc64019251414757000a35",
               "name": "Ub Iwerks",
               "profile_path": "/abGYy198t3XRfnB9Jia1A9NVBEP.jpg",
               "id": 123192,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "55ee2ad092514106d600f5c7",
               "name": "Rudolf Ising",
               "profile_path": "/52hR2geHrJfZSs3ocVUPxiXGAUg.jpg",
               "id": 112994,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "54cc64139251414755000a33",
               "name": "Hugh Harman",
               "profile_path": "/bgI2GMqrMwF2ATq08NbHlAXqRQJ.jpg",
               "id": 112993,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5a33288c925141032c1ab751",
               "name": "Ub Iwerks",
               "profile_path": "/abGYy198t3XRfnB9Jia1A9NVBEP.jpg",
               "id": 123192,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a3328940e0a264cc11a34f7",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a33289d0e0a264cc81b5f9b",
               "name": "Carl W. Stalling",
               "profile_path": "/7w0TsnkpyHLIYsAyYFVbdIBj2RU.jpg",
               "id": 551674,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.015263,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45665,
      "vote_count": 26,
      "budget": 0,
      "overview": "Plane Crazy is an American animated short film directed by Walt Disney and Ub Iwerks. The cartoon, released in 1929 by The Walt Disney Studio, was the first creation of the character Mickey Mouse. It was made as a silent film and given a test screening to a theater audience on May 15, 1928, but failed to pick up a distributor. Later that year, Disney released Mickey's first sound cartoon, Steamboat Willie, which was an enormous success. Following this, Plane Crazy was released as a sound cartoon on March 17, 1929.",
      "similar": [
         81003,
         460793,
         19,
         2292,
         74643,
         227156,
         82023,
         455661,
         458663,
         62214,
         705,
         9662,
         251516,
         14813,
         828,
         9833,
         36208,
         121986,
         326359,
         43641
      ],
      "original_title": "Plane Crazy",
      "runtime": 6,
      "poster_path": "/aThtlWk7kyvjNQ2H4GX5ixKVzlb.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Walt Disney Productions",
            "id": 3166,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1928-05-14",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A Mickey Mouse Sound Cartoon",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Walt Disney",
         "Ub Iwerks"
      ],
      "runtime": 6,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019278/",
      "coverLink": null,
      "actors": ["Walt Disney"],
      "reviews": [
         "This short is the first one done and this is not the \"gosh, aw shucks\" mouse Disney so carefully protects today. Mickey early on was a bit of a cad and a rogue. Quite the smart aleck. Interesting glimpse at Mickey. This short holds up well after 70+ years and is well worth watching. Recommended.",
         "Although \"Steamboat Willie\" was the first Mickey Mouse cartoon released, this one was actually the first Mickey ever made. In fact, it was a silent film when it was first produced, but it was released after sound had been added. I remember the first time I saw this cartoon was on a video that I had rented in 1st or 2nd grade. I didn't really care much for it at the time, but now I like it. This and many other Disney animated shorts will entertain people of all ages, 3 to 103, all over the world.",
         "This is where it all began. 'Plane Crazy (1928)' \u0096 and not 'Steamboat Willie (1928),' as is often claimed \u0096 marks the humble debut of Mickey Mouse, perhaps the most recognisable and beloved cartoon character ever created. This little rodent was originally envisioned as a replacement for Oswald the Lucky Rabbit, a successful character designed by Walt Disney for Charles Mintz of Universal Studios. Mintz had demanded that Disney take a pay-cut, shortly after reminding him that he personally held copyright of Oswald, and had already contracted most of Disney's employees. To Mintz's surprise, the ambitious animator and businessman instead struck out alone, animators Ub Iwerks and Les Clark among the few who remained loyal to him. The first Mickey Mouse cartoon was released on May 15, 1928, in California, where its reception was initially rather lukewarm. The animation itself is not particularly notable, but the jokes are clever, funny and amusingly mean-spirited. Mickey's following would grow, however, and more than anybody \u0096 not even the forward-thinking Disney \u0096 could ever have anticipated. At least in his first year, Mickey wasn't much of a gentleman. For one, he wasn't averse to harassing livestock if he could get some benefit out of them \u0096 here, a turkey is robbed of its tail feathers, and a cow is grabbed by the udder, which tastefully spurts milk everywhere. Mickey decides that he wants to be an aviator, though his knowledge stretches little beyond how Charles Lindbergh (\"Lindy\") styled his hair. This dangerous hobby is no doubt fuelled by a desire to impress Minnie the Mouse (here also making her debut), but, when she doesn't respond as planned, Mickey coldly forces a kiss out of her. Disney claims that inspiration for his character partially came from Charles Chaplin's tramp character, though there's very little of that here: the look of pure mischievous evil on his face after being romantically rejected by Minnie is almost frightening! 'Plane Crazy' was originally released as a silent cartoon, but, following the success of 'Steamboat Willie,' it was re-released with sound effects and synchronised music.",
         "If you go on YouTube, you're bound to find or two uploads of Plane Crazy, the very first Mickey Mouse cartoon produced by Walt Disney productions in 1928 (his way of finding a new character after losing Oswald the Rabbit at Universal). And while the short was originally done as a silent short - from a biography I read, Steamboat Willie was the third Mickey Mouse cartoon - it can now be watched with sound. On the one hand it's crazy to think that it would ever be silent considering how the music and sound effects and occasional voices for Mickey and Minnie (both from Uncle Walt) work so in sync and, really, perfectly with it all. And yet on the other hand it's easy to see how everything is told visually, without any real dialog being needed anyway (there is a moment where Minnie goes \"Who, me?!\" when Mickey asks her to go on the plane, but it could be left off just as well). The gags come quick and fast, but the story is tight considering the suspense that happens once Mickey and Minnie get up in the air. Actually in a way this has more character stuff than in Steamboat Willie, which in that case was a little bit of story (the set up of Mickey as a captain and being chased by proto-Pete), but then with a lot of gags involving the playing of animals as musical instruments. Here it's all about this: what will Mickey get Minnie into next, and will he wise up and not be such a jerk? It's great to see an early Mickey short like this for a couple of reasons aside from the sharp quality of the animation - the timing of it all makes it, well, timeless far as storytelling goes, even with the old-school iris - one is that Mickey is not the perfect, bashful gentleman/mouse of later cartoons. He's actually kind of a jerk, and it's refreshing in that Bart Simpson way. The second reason is how self-conscious the creators, Disney and Ub Iwerks, were in some of the visual gags. It may have one of my all-time favorites, one that lays kind of the blueprint for cartoons for decades to come: at one point Minnie decides she's had enough of Mickey's horsing around and gets up and leaves to parachute off the plane (luckily her dress will do). Mickey follows her off, and we see him just suspended in the air, in a straight line really, without anything showing him going down. It's only when HE realizes he's off the plane that he rushes back to get on the plane, only for it to crash. That is the magic of animated comic cartoons right there in about 15 seconds of celluloid: you don't know you're going to die until you notice it.",
         "This is technically the first Mickey Mouse cartoon, having released a few months before Steamboat Willie. Here, Mickey builds a plane and takes Minnie Mouse (also her first appearance) for a joyride. But, the high-flying journey doesn't go near as Mickey plans as the plane sores to unbelievable obstacles and heights, leaving the two to fend for themselves. Ub Iwerks did a great job animating the cartoon. While it does appear dated by today's standards, the cartoon does represent classic animation and true talent - none of these CGI stuff that we see in today's animated features. Not a whole lot to the story, but it's an adventurous little tale nonetheless and is one of the more exciting black and white cartoon shorts from Walt Disney. It's a fine way to start off Mickey Mouse and his many adventures in years to come. Grade B+",
         "\"Plane Crazy\" isn't quite as cute or as innovative as the brilliant \"Steamboat Willie\", but like \"Steamboat Willie\" it is a timeless gem and a cartoon milestone in its own right. It is very funny, and is still cute. The black and white animation may be a tad crude by today's standards, but in general it is not too bad. The backgrounds are detailed enough. The music as always is delightful, the story is engaging enough for kids and adults and Mickey once again gives a stellar performance, aided by the equally stellar voice work from Walt Disney. Overall, is it the absolute best Disney cartoon? Maybe not, but timeless? You bet it is. 10/10 Bethany Cox",
         "A Walt Disney MICKEY MOUSE Cartoon. With Charles Lindbergh as his hero, Mickey Mouse has gone PLANE CRAZY. Mischievous Mickey is determined to get in the air in this very early Mouse cartoon. Animator Ub Iwerks is responsible for most of the visual shenanigans which fill the little film. The bovine with the ponderous & perilously vulnerable udder is an early incarnation of Clarabelle Cow making her film debut. Walt Disney (1901-1966) was always intrigued by pictures & drawings. As a lad in Marceline, Missouri, he sketched farm animals on scraps of paper; later, as an ambulance driver in France during the First World War, he drew comic figures on the sides of his vehicle. Back in Kansas City, along with artist Ub Iwerks, Walt developed a primitive animation studio that provided animated commercials and tiny cartoons for the local movie theaters. Always the innovator, his ALICE IN CARTOONLAND series broke ground in placing a live figure in a cartoon universe. Business reversals sent Disney & Iwerks to Hollywood in 1923, where Walt's older brother Roy became his lifelong business manager & counselor. When a mildly successful series with Oswald The Lucky Rabbit was snatched away by the distributor, the character of Mickey Mouse sprung into Walt's imagination, ensuring Disney's immortality. The happy arrival of sound technology made Mickey's screen debut, STEAMBOAT WILLIE (1928), a tremendous audience success with its use of synchronized music. The SILLY SYMPHONIES soon appeared, and Walt's growing crew of marvelously talented animators were quickly conquering new territory with full color, illusions of depth and radical advancements in personality development, an arena in which Walt's genius was unbeatable. Mickey's feisty, naughty behavior had captured millions of fans, but he was soon to be joined by other animated companions: temperamental Donald Duck, intellectually-challenged Goofy and energetic Pluto. All this was in preparation for Walt's grandest dream - feature length animated films. Against a storm of naysayers, Walt persevered and over the next decades delighted children of all ages with the adventures of Snow White, Pinocchio, Dumbo, Bambi & Peter Pan. Walt never forgot that his fortunes were all started by a mouse, or that childlike simplicity of message and lots of hard work always pay off.",
         "Plane Crazy (1928) *** (out of 4) The very first Mickey Mouse film has him wanting to be like Charles Lindbergh so he builds a plane and heads out with Minnie to set a record but things don't go as planned. PLANE CRAZY is a historic short no matter what you think of the actual content but thankfully the film is a nice little gem that will manage to make you laugh and smile. This certainly isn't the greatest film ever made nor one of Disney's best but there's enough charm here to make it worth sitting through. There are many funny moments but the best has to be the sequence where Mickey wants a hug and then a kiss but Minnie just isn't having any of that. There's a great bit of animation when the plane is spinning out of control and the point of view shot is quite excellent.",
         "ORIGINALLY PLANNED AND executed as a silent, PLANE CRAZY is the true first appearance of MICKEY MOUSE. It was held back and not released along with its following installment, THE GALLOPIN' GAUCHO until the release of the revolutionary and game changing STEAMBOAT WILLIE. The latter cartoon was of course the first sound cartoon short. BEING THAT TODAY'S honored movie, PLANE CRAZY does come across as a little movie that it is torn between two worlds. In this case, it has all of the signs of the strictly visual silent; but the addition of the sound effects and dialogue (such as it is) may well be in effect an overkill of screen storytelling. THIS MAY WELL not have been as readily apparent at the time of release; owing to the fascination that was generated with all of the publicity of Mickey Mouse just talking. Furthermore, all of the animation that was made from the various studios suffered from the same malady. It would take several years of film technique evolution to \"modernize\" the overall look of the characters, backgrounds and rendering of the sight gags depicted in a typical outing. THE GENISES AND indeed the very reason for doing the cartoon with aviation as the subject as in PLANE CRAZY was the popularity of Charles Lindbergh's solo crossing of the Atlantic in the previous year of 1927. This is no subtle or subliminal message, as Mickey does actually display a photo of \"Lucky Lindy\" at the very beginning. Mickey even attempts to style his hair to look like Lindbergh's tonsorial work of art. AS FOR THE cartoon's storyline, Mick builds a plane, it crashes and immediately destructs into an impossibility of a salvation project. Undaunted, Mickey immediately converts an old, broken down jalopy into a new plane. Enter the female of the species. Minnie Mouse, making what is her real and true first appearance, presents the young aviator with a good-luck horse shoe and gets a ride in the airship as a reward. FOLLOWING MANY INFLIGHT type gags Mickey's amorous intentions are revealed and he is rejected with a slap. Minnie bails out, using her unmentionables as a makeshift parachute. Meanwhile Mickey safely crash-lands. The twosome parts the scene in less than happy and lovey-dovey relationship. Mickey pitches the horseshoe away, but it promptly returns to catch him around the neck in a boomerang fashion. ONCE AGAIN, THIS short does not seem like much when viewed now; but, once again, back in the day.................. '",
         "Plane Crazy (1928), the first Mickey Mouse cartoon, offers modern viewers a vision of the character which has been eclipsed by a more family friendly rendition. The old school Mickey was a rascal and a jerk, always looking to cause trouble. Here we see him rough-housing other animals in a barnyard and forcing a kiss on a reluctant Minnie Mouse, something modern Mickey would blush to do. Ub Iwerks' animation is fantastic and chaotic. Around this time, the stiffer animation of the early 1920s/late 1910s was giving way to the looser movement which would reign supreme in the 1930s. Plane Crazy is not as mesmerizing as Steamboat Willie (1928), but it sure is a lot of fun and a great time capsule.",
         "It was PLANE CRAZY, It was a silent film made several months before Steamboat Willie was made, They didn't release it before as they couldn't find a distributor because at the time Disney was poor as Oswald was owned by Universal until 2006. When they found a distributor for S.B. Willie (United Artists), they released Plane Crazy into theaters a few months after, But Steamboat Willie still wasn't the second, The Gallopin Gauncho was the second, for similar reasons and a similar fate the cartoon was released a few months after Steamboat. Steamboat Willie was the third. But however, Steamboat was Pete's First Appearance, as well as Clarabelle Cow (as Fob) MADDOX COX, OVER AND OUT!",
         "After believing for years that Steamboat Willie was Mickey Mouse's debut,I was surprised to discover that Mickey had made his debut in a Silent cartoon which had sounded added a few months later,which led to me getting ready to take a plane ride with Mickey. The plot: Reading a book on how to fly,Mickey gets a group of farm yard animals to help him build a plane.Getting set for take off,Minnie walks pass the plane,which leads to Mickey grabbing Minnie and putting her in the plane.Looking forward to kissing Minnie as they fly in the sky,Mickey soon discovers that it is harder to fly than he expected. View on the film: Secretly made whilst co-director (along with Ub Iwerks-who drew 700 animation drawings a day for the film!) Walt Disney was still working for Universal,Disney and Iwerks display an amazing sense of daring energy in their animation style,with the directors brilliantly using first person shots to let the viewer see things from Mickey's pov.Keeping the story sweet and easy,Disney and Iwerks make the film fly by with charming visual gags from Mickey using the animals to keep his plane running,to Mickey trying to get Minnie to give him a saucy kiss.",
         "For a great portion of my life I thought that \"Steamboat Willie\", the Mickey Mouse cartoon made straight after this one, was the first cartoon of our favourite cartoon mouse. However, I discovered this cartoon, \"Plane Crazy\" and have just watched it on Youtube and read that THIS cartoon actually holds the fame. Why all the fact books say that \"Steamboat Willie\" is Mickey's debut I have not a clue. Personally I prefer this cartoon to \"Steamboat Willie\", as I found it more entertaining, funny and more sweet (near the beginning, towards the end it is not very sweet, but still quite entertaining). Not to say that \"Steamboat Willie\" pales considerably in comparison, I enjoyed both cartoons very much. Anyhow, in \"Plane Crazy\", Mickey Mouse is planning for a plane flight (in those days planes were less than 30 years old and would have probably been particularly exciting in a cartoon). With the help of another animal as an engine, Mickey tries flying the plane that a few other animals have made for him, but unfortunately it does not work very well and it crashes. Downhearted, Mickey attempts to make a new plane, starting with a normal motorcar (it is a cartoon, it is NOT realistic). His girlfriend (obviously Minnie Mouse), gives him a horseshoe for luck before Mickey takes off in his new plane. Will this flight be a success..? I recommend this cartoon to anyone who likes or is interested in Mickey Mouse and to people who just enjoy watching old cartoons. Enjoy \"Plane Crazy\"! :-)",
         "Mickey Mouse is eager to learn to fly, so he builds a strange little airplane and takes Minnie along for a crazy ride. By the end, not unexpectedly, the plane is a wreck and Mickey is in the dog house with his sweetie. This is the very first Mickey Mouse cartoon, though in many ways the short film is very much unlike later Mickey films and was even quite a bit different than the second one (STEAMBOAT WILLIE). Unlike STEAMBOAT WILLIE, the animation quality is a tad crude and in its original form, PLANE CRAZY was a silent film. However, due to the popularity of STEAMBOAT WILLIE and its soundtrack with music and sound effects, Walt Disney decided in late 1928 to add a similar track to PLANE CRAZY. I am not even sure if the totally silent version still exists, but even if it doesn't, try watching the film with the sound turned all the way down to get the effect. You'll probably notice that it just isn't as cute or catchy as STEAMBOAT WILLIE, though you'll still probably see that compared to other cartoons of the 20s, it is still a tremendous film and still very watchable today. While some might poo-poo the film for its simple style, true fans of animation should see this landmark film--especially so they can see just how far the Mouse has come after all these years.",
         "\"Plane Crazy\" is almost 90 years old and one of the earliest Mickey Mouse cartoons by Walt Disney. It is in black-and-white, but there are silent and sound versions of this 6-minute movie. I personally did not find it too funny. The second half was better than the first with Mickey trying to kiss Minnie and all the air action that ensues afterward. Mickey walks through it. Minnie uses her dress as a parachute. But it also becomes clear how weak the 1920s still were in terms of animation compared to the glorious 1930s. This one is only worth watching for the biggest Walt Disney fans. I did not find it very memorable. Thumbs down from me."
      ],
      "genres": [
         "Animation",
         "Family",
         "Comedy",
         "Short"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Mickey and his friends build an airplane from wood, using a dachshund like a rubber band. This plane never takes off, and quickly crashes into a tree. Mickey stretches his car into a semblance of an airplane, and brings Minnie along this time. Mickey is thrown from the plane, and struggles to get back in. The plane finally takes off. Mickey tries to get a kiss, but Minnie resists, and after Mickey kisses her anyway, she jumps out, using her bloomers as a parachute. Mickey crashes the plane soon after that.",
         "Inspired by Lindbergh's flight from New York to Paris, Mickey builds a plane to take Minnie for a trip involving some necking, though Minnie objects to the necking."
      ],
      "budget": 3528
   },
   "movielensId": 169002,
   "movielens": {
      "languages": [""],
      "releaseDate": "1928-05-14",
      "dvdReleaseDate": null,
      "directors": [
         "Walt Disney",
         "Ub Iwerks"
      ],
      "runtime": 6,
      "movieId": 169002,
      "title": "Plane Crazy",
      "mpaa": "",
      "actors": ["Walt Disney"],
      "imdbMovieId": "0019278",
      "originalTitle": "Plane Crazy",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["kCZPzHg0h80"],
      "plotSummary": "Plane Crazy is an American animated short film directed by Walt Disney and Ub Iwerks. The cartoon, released in 1929 by The Walt Disney Studio, was the first creation of the character Mickey Mouse. It was made as a silent film and given a test screening to a theater audience on May 15, 1928, but failed to pick up a distributor. Later that year, Disney released Mickey's first sound cartoon, Steamboat Willie, which was an enormous success. Following this, Plane Crazy was released as a sound cartoon on March 17, 1929.",
      "tmdbMovieId": 45665,
      "avgRating": 2.9375,
      "releaseYear": "1928",
      "numRatings": 8,
      "posterPath": "/aThtlWk7kyvjNQ2H4GX5ixKVzlb.jpg"
   }
}