{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stand-up comedy",
         "id": 9716
      }],
      "imdb_id": "tt6540084",
      "video": false,
      "title": "Katherine Ryan: In Trouble",
      "recommendations": [
         403173,
         69072,
         209320,
         105379,
         429047,
         369605,
         263945,
         284550,
         449359,
         437013
      ],
      "backdrop_path": "/fYpS0xs6ceCWiRIydK9lfVsqOy8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Herself",
            "gender": 1,
            "credit_id": "589510c99251412e14002e2c",
            "name": "Katherine Ryan",
            "profile_path": "/4uxUDJyLFZmMzUTi536Rs4qenp6.jpg",
            "id": 1469591,
            "order": 1
         }],
         "crew": [
            {
               "gender": 1,
               "credit_id": "58a5f58f92514152fa001043",
               "name": "Katherine Ryan",
               "profile_path": "/4uxUDJyLFZmMzUTi536Rs4qenp6.jpg",
               "id": 1469591,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58a5f5a3c3a3681c030010e5",
               "name": "Colin Dench",
               "profile_path": null,
               "id": 114888,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab6d5c3a36814ae0905fa",
               "name": "Colin Dench",
               "profile_path": null,
               "id": 114888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5a3ab6ea925141547208b6a2",
               "name": "Katherine Ryan",
               "profile_path": "/4uxUDJyLFZmMzUTi536Rs4qenp6.jpg",
               "id": 1469591,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab6fa0e0a264ccd21a959",
               "name": "Kitty Laing",
               "profile_path": null,
               "id": 1945329,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab725c3a3680b88216038",
               "name": "John E. Walker",
               "profile_path": null,
               "id": 1031798,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab743925141547e08b074",
               "name": "Adrian Homeshaw",
               "profile_path": null,
               "id": 1488840,
               "department": "Production",
               "job": "Unit Manager"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab7aec3a3680b8821610e",
               "name": "Adrian Homeshaw",
               "profile_path": null,
               "id": 1488840,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab7eb0e0a264cca210465",
               "name": "Idil Sukan",
               "profile_path": null,
               "id": 1945332,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab803925141547808d2d9",
               "name": "Fiona Eustace",
               "profile_path": null,
               "id": 1945333,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab80fc3a36814a8092c28",
               "name": "Fiona Eustace",
               "profile_path": null,
               "id": 1945333,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a3ab81e0e0a264cbc21ec43",
               "name": "Colin Dench",
               "profile_path": null,
               "id": 114888,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.551923,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 439107,
      "vote_count": 11,
      "budget": 0,
      "overview": "Stand-up comic Katherine Ryan reminisces about unusual relationships, aging, Taylor Swift, life in the hometown she hates and the time she enraged an entire nation.",
      "similar": [
         35595,
         200133,
         34001,
         31788,
         34497,
         416477,
         34505,
         34512,
         812,
         703,
         16290,
         270946,
         49013,
         62206,
         13015,
         34163,
         23483,
         67308,
         51828,
         34509
      ],
      "original_title": "Katherine Ryan: In Trouble",
      "runtime": 63,
      "poster_path": "/rma2o1YR4UIH89HH2B9Y5sWFeM9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Real Talent Ltd",
         "id": 98734,
         "origin_country": ""
      }],
      "release_date": "2017-02-14",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Colin Dench"],
      "runtime": 63,
      "synopsis": "This video is from Canadian stand-up comedienne Katherine Ryan's 2015 tour. She moved to England in 2008 where she is well known from many appearances on British television. The venue for this performance was in Hammersmith, London, England. It was at the Eventim Apollo and showcases Ryan's comedy. The advice often given to writers is to 'write what you know.' Ryan follows that advice and bases her stand-up comedy on her own life. The routine begins with audience participation where she talks directly to audience members, draws out laughter and breaks the imaginary barrier with the audience. After about 10 minutes she moves to talking about her life: her dating woes, accepting unsolicited advice, being single and raising a daughter. Throughout her performance, she interacts with the audience as she comments on her life. Like all good stand-up, she looks at real life in a slightly off-center way. The stories she tells are worth listening to.",
      "writers": ["Katherine Ryan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt6540084/",
      "coverLink": null,
      "actors": ["Katherine Ryan"],
      "reviews": [
         "Kathrine Ryan is hysterical! If I ever got the chance I would buy her a cocktail to pay her back for making me laugh so hard! I write very few reviews whether it be on movies, restaurants, nail salons, etc. but I felt that it was necessary to make a statement when I saw the nasty comments previously left. It must be noted that the reviewers who had left earlier comments need to take a chill pill and have their internet privileges taken away by the nurses watching over them at the retirement home. No one should have that much spare time on their hands to write a review of a performance they have only seen a couple clips of but the elderly or a social-less creeper living in his mother's basement Katherine is a fantastic comedian. It should be painfully obvious that her audience is targeted toward a younger demographic such as the millennial crowd. It is not meant for anyone who voted for Donald Trump or who cannot understand that it's literally a joke. RELAX. Touching on sensitive topics such as religion, politics and rape are going to offend those who take everything personally. Yes, her comedy is a little raunchy but there are few successful comedians who do not follow the same formula. She makes a comment about \"not hating all Jews, just one, but that is where it all starts.\" As a Jew I could take that to heart and hate her for such comments but instead of acting like a cry baby I recognized the humor in it, just like anyone else who loves comedy. Vulgar wrapped in hilarity tied with a bow made of jokes for a 20- something-year old crowd. I had put it on in the background last week and found myself wanting to actually watch it all the way through a couple days later, and after watching it from start to finish I could not help but to put it on again. After viewing it twice in four days I am now recommending it to all my friends who love controversy and a little filthy humor. My advice to anyone who does not like her style within the first ten minutes find something new to watch instead of bad mouthing a hard working woman whom actually encourages being true to the person you are instead of conforming to the social norm.",
         "I'm 61, and I've seen a lot of stand-up in my life. This was one of the funniest - totally in the top four. I caught it on Netflix tonight, and was surprised I hadn't heard of Katherine Ryan before. Now I have to go see if she has additional programs. If not, I hope Netflix has the good sense to hunt down what's available and put it in their catalog.",
         "I caught a couple of clips from this through the internets. What a god awful performance, it reminded me of the Satellite radio station Raw Dog that has comedians that for the most part suck. A great deal of vulgarity and moments that are very awkward. I am probably biased because I don't agree with her politics but that has never stopped me from liking Chris Rock and others for example. This woman is not funny but this is what the Left forces now as hip. Very sad.",
         "That was a disgrace for stand up history. It's not the misogynistic trolls that gave the bad reviews . The reason for that was that it was horribly pointless and unfunny. As a woman who was unfortunate enough to born and live in a middle eastern fascist dystopia and as someone who tries to survive and protect my mental health by escapism on the internet -through vpn mostly-, I'd rather watch the usual censored propaganda news that are full of hatred, blood and pain than to endure this mess. At least they make me laugh hysterically by making me clinically insane. Worst thing ever."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Netflix"],
      "summaries": ["Canadian comic Katherine Ryan explains the perks of dating younger men. She talks about her unusual relationships, living in the hometown she hates and how she once enraged an entire nation."],
      "budget": 0
   },
   "movielensId": 169188,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-02-14",
      "dvdReleaseDate": null,
      "directors": ["Colin Dench"],
      "runtime": 63,
      "movieId": 169188,
      "title": "Katherine Ryan: In Trouble",
      "mpaa": null,
      "actors": ["Katherine Ryan"],
      "imdbMovieId": "6540084",
      "originalTitle": "Katherine Ryan: In Trouble",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["i1iNZ4XukhE"],
      "plotSummary": "Stand-up comic Katherine Ryan reminisces about unusual relationships, aging, Taylor Swift, life in the hometown she hates and the time she enraged an entire nation.",
      "tmdbMovieId": 439107,
      "avgRating": 3.07692,
      "releaseYear": "2017",
      "numRatings": 13,
      "posterPath": "/rma2o1YR4UIH89HH2B9Y5sWFeM9.jpg"
   }
}