{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1789982",
      "video": false,
      "title": "Teenage Mutant Ninja Turtles: We Wish You a Turtle Christmas",
      "recommendations": [],
      "backdrop_path": "/iQ0royVt1TR8YuZQh82lQskg9A6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Leonardo",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2bf",
               "name": "Ronn K. Smith",
               "profile_path": null,
               "id": 1127744,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Michaelangelo",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2c3",
               "name": "Alfredo Miller",
               "profile_path": null,
               "id": 1127745,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Raphael",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2c7",
               "name": "James Eric Anzalone",
               "profile_path": null,
               "id": 1127746,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Donatello",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2cb",
               "name": "Florence Reymond",
               "profile_path": null,
               "id": 1127747,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Splinter",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2cf",
               "name": "Jack William Scott",
               "profile_path": null,
               "id": 1127748,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Kid #1",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2d3",
               "name": "Natasha Cresap",
               "profile_path": null,
               "id": 1127749,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Kid #2",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2d7",
               "name": "Alicia Manta",
               "profile_path": null,
               "id": 1127750,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Kid #3",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2db",
               "name": "Anthony Manganiello",
               "profile_path": null,
               "id": 1127751,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Kid #4",
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2df",
               "name": "Yaniv Segal",
               "profile_path": null,
               "id": 1127752,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c28b",
               "name": "Larry Osborne",
               "profile_path": null,
               "id": 1126812,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c291",
               "name": "Tish Rabe",
               "profile_path": null,
               "id": 174468,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c297",
               "name": "Richard Berg",
               "profile_path": null,
               "id": 1127738,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c29d",
               "name": "Tony Mitchell",
               "profile_path": null,
               "id": 1127739,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2a3",
               "name": "James Mazzola",
               "profile_path": null,
               "id": 1127740,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2a9",
               "name": "Aileen Buller",
               "profile_path": null,
               "id": 1127741,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bba9251416c7510c2af",
               "name": "James K. Parker",
               "profile_path": null,
               "id": 1127742,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bba9251416c7510c2b5",
               "name": "Peter Laird",
               "profile_path": "/wjY1ztaWB8j8lNWMTz4ZPWop1bK.jpg",
               "id": 19503,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bba9251416c7510c2bb",
               "name": "Kevin Eastman",
               "profile_path": "/rTnWmbWRc6LMikz6BPI3Yo77GxO.jpg",
               "id": 19502,
               "department": "Crew",
               "job": "Creator"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.036524,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 147939,
      "vote_count": 1,
      "budget": 0,
      "overview": "A 25-minute, live-action Christmas special released direct-to-video in 1994.",
      "similar": [],
      "original_title": "Teenage Mutant Ninja Turtles: We Wish You a Turtle Christmas",
      "runtime": 25,
      "poster_path": "/6LJxtMd5hzYsmbMgz5cNu790ZR8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Christopher Films",
         "id": 12188,
         "origin_country": ""
      }],
      "release_date": "1994-10-01",
      "vote_average": 1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Larry Osborne"],
      "runtime": 25,
      "synopsis": null,
      "writers": ["Tish Rabe"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1789982/",
      "coverLink": null,
      "actors": [
         "Eric Anzalone",
         "Alfredo Miller",
         "Florence Reymond"
      ],
      "reviews": [
         "I'd like to say I have no words to express the sheer hysterical horror of this Christmas special. The truth is, since it's only 23 minutes, I have almost too many words. Where to begin? The story gives us the turtles doing nothing turtlely. Don't expect any fighting or ninja moves. This is simply the 4 turtles singing, almost non-stop for 23 minutes, as they try and find a gift for Splinter. The suits are so atrociously bad. These creeps never stop smiling. It was more like some sinister horror movie. They have one facial expression, and that expression is \"rape\". It's also very hard to see where Splinter's face is supposed to be. I think they just stuck googly eyes onto some brown cotton wool. Next we should focus on the music, as this is a musical. It doesn't just focus on bad 90's hip/hop and pop. Oh no siree! This little gem is going to take down as many musical genres as it can, kicking and screaming. Within the first few seconds Leonardo breaks into Deck the Halls...in a Jamaican accent. It's on par with Sebastian from The Little Mermaid, but at least he also spoke with a Jamaican accent. Why is a turtle from New York singing a Christmas song in a Jamaican accent? The lyrics have also been changed to include turtle references. Later we are treated to Michaelangelo singing opera in the middle of New York, and let's not forget the classic Wrap Rap. If you find bad things hilarious, you must watch this. Even though, it never quite tops the opening number. Pure insanity to imagine that at some point a producer suggested a Teenage Mutant Ninja Turtles musical with no fighting.",
         "If you thought the third Ninja Turtles movie was bad, and their Coming Out of Their Shells tour was bad even worse, then gather around, dudes and dudettes, for I have the cream of crap crop: We Wish You a Turtle Christmas. Yep, have you ever wondered how the Ninja Turtles celebrate Christmas? I used to wonder that myself, and when I saw this video, it was nothing like I had pictured. It's really bad! At first we see the turtles, Michaelangelo, Donatello, Leonardo and Raphael, looking worse than they've ever looked before...wait til you see Splinter. So, our fearsome fighting teens are decorating their Christmas tree in their sewer lair, while in the process Leo sings a poor rendition of Deck the Halls in a Jamaican accent he's suddenly gained out of nowhere. The song is terrible and it concludes with the turtles wishing the Shredder a Merry Christmas. Sadly, he will not be joining us tonight, and I don't blame him one bit. So now that the tree is decorated, the turtles suddenly realize they don't have a gift for Splinter, so they all go up to the streets and walk around without disguises and sing about looking for a gift. But instead of looking, Michaelangelo turns into \"that opera guy\" and starts singing, and it's surprisingly a decent song. So when that finish, they find a bunch of random stuff and take it back to the sewer. The turtles rap as they wrap and then present Splinter with his gifts on Christmas morning, and to accompany this, he sings a rendition of The 12 Days of Christmas...as if we haven't suffered enough. Following his song, Splinter lets his students know that their love and devotion to him was gift enough. Awkwardly, Michaelangelo asks if anybody's in the mood for pizza, so they call it in and then a bunch of children show up to dance and sing with the turtles, wishing us a Turtles Christmas. Wow! This is ungodly, this is unacceptable, this should not exist! Absolutely no thought or effort was put into it. The costumes look terrible, the animatronics are really bad, the script is bad and so is the acting. The songs are all terrible, except for 'Gotta Get a Gift' and 'O Little City of New York'. I can't think of one good reason for this so-called Christmas special to even exist, except this company was DESPERATE to make a quick buck by latching on to a franchise that practically dead by 1995. I blame the third Ninja Turtles movie and revamping the animated series for killing off the franchise, and this We Wish You a Turtle Christmas was the last nail on the coffin. It's stupid! It not only talks down to children, but no child in his or her right mind would be entertained by this, so WHO were they trying to kid? I mean, if the writer, producer, director and the actors put some ACTUAL effort into this, it might have been good. But no, they just threw it together in a desperate attempt to profit. I wonder exactly how much profit they made from this? I don't recall much Ninja Turtles merchandise relating to this or Coming Out of Their Shells. Were they looking to profit from video sales? If so, I can safely assume they didn't make much, because I never saw this video in stores. In fact, I never even knew this special existed until about a month ago, and I really wish I never found out. So I hope they all lost money from this, that somebody is really, really ashamed for ever dreaming up this concept, and let's be thankful that this special never caught on.",
         "Depending upon your temperament, you will either be horrified or amused by this. I am both.My sisters and I find this monstrosity so hilarious that we actually watch and MST3K it every year. How can I explain how wrong this special is? Ugly turtle costumes that make the latex nightmares in TMNT 3 look like Jim Henson's masterworks in the 1990 film. Leonardo rapping about wrapping presents. Michelangelo singing opera. The turtles all having interchangeable personalities. The fact that they give Splinter things more suited to their taste than his for Christmas. Little kids randomly populating the sewer. If only Shredder had appeared, then this would have been amazingly terrible. Ah well, try not to watch this before going to bed. You'll have nightmares of lifeless turtle faces for sure.",
         "A Holiday Classic! #1 Top Selling Albums 10/10 Definitely would shop again next year in September.",
         "Bottom stinky barnacle of the hollowed out Turtle honey pot, this is surely a topmost contender for the worst and most bizarre Christmas special ever made, but I did laugh a lot one time so there's that fun to be had from it. There were so many lame unnecessary and darn weird touches like the inexplicable Jamaican accent and Michelangelo opera singing and how the Turtles could be so rude as to actually say that \"Splinter's not athletic\" when he's the very ninja master who trained them! These Turtles looked so bloody hideous with their permanent white toothed ear-to-ear grins! Ew they were Like nasty walking green ventriloquist dummies, the very worst out of any of the live-action versions of the Turtles that have ever been done, why in some scenes you could actually see the goddamn cables sticking out the backs of their heads! And poor Splinter looked absolutely horrendous, rather than looking like a rat, he looks more like that one nastiest most diseased completely bald scabby cat with poop all over it that crazy hermit cat hoarders always seem to have! The whole unabashed ~shameful~ laziness of this 'production' and how it was so bare bones and just presented itself for what it was just tickled me. I mean I'm not blind, it's a stinking waste of film, but I like the idea of something being so completely terrible yet because of that being kind of fun and hilarious at the same time that it could make you go \"Hey I can get on board this sinking shipwreck, it's entertaining me!\" It's short but you certainly feel every single one of those minutes.. It has to be seen to be believed really, it has a stupid story, annoying songs, the Turtles barely look like themselves, there's zero action, and the Turtles and the gaggle of super-happy kids that follow them around everywhere are so positive and goody-goody that you'll just wanna puke! It's sad too in a way that this was one of the last pitiful hurrahs of the Turtles original(and best) 90s popularity and that they were dragged through the mud with this, it feels like it's rubbing it in somewhere! Who knows, if it had been made three to four years earlier and had money and real effort behind it, it may have turned out to be something that was fun and festive to watch. As it is you're definitely laughing at it, not with! I may get a kind of enjoyment out of it now but it wouldn't have done anything for me as a kid, not even when I was loving the cartoon series and the movies and playing with the action figures, I really don't see how any self-respecting kid over the age of six would ever have admitted to liking this even if they did! Serious fans of the Turtles that don't particularly enjoy seeing them make complete green asses of themselves should probably avoid this nonsensical curio in their history, but if you do like to laugh at some of the craziest crap you've ever seen than by all means have at it and give it a look at least once, it's cheesy on several levels!",
         "\"We Wish You a Turtle Christmas\" is a Turtles Christmas special from roughly 20 years ago and looking at the IMDb score, it did not get a positive reception at all. That is probably also the reason why director Larry Osborne never made a film after this one again. I personally believe it is not all bad about this one. I mean first of all, the tone of Turtles is very different to Christmas usually, especially the darker, non-comedic one. This is probably why they mostly went for comedy with this one. And for music. Many Christmas songs got the the Turtle touch and were sung by the quartet (and Splinter). My favorite is probably \"On the 1st day of Christmas, my Turtle have to me\". There is not really a story in here, but at only slightly over 20 minutes that is not as bad as it would have been at 45 minutes. Nonetheless, I agree with the general perception that this is not one of the better Christmas short films. But it's tough. There is obviously no snow down there in the sewers. The songs are okay, the rest is forgettable.",
         "Bah Humbug I'm only giving it a 5 because I'm a fan of Teenage Mutant Ninja Turtles I grew up a huge fan of the Teenage Mutant Ninja Turtles the cartoon however I never know that they made this until years later after seeing it all over the internet from different reviewers So one day I thought I will give it a watch and needless I have to agree about how shocked I was For one thing the Turtles don't even look right let alone make up their own minds about what accent they have. With each song that is feature you hear a different accent it's like they couldn't stick with the right ones The costumes look like they were just half made and just put on the actors with no attempt to make it work and it is clearly low budget this direct to video release Now this is when the Teenage Mutant Ninja Turtles were very popular this video however was not one of the Turtles' better ideas plus most of the songs make you go what were they thinking Now a song or two is so corny that is actually listening to it that makes you go wow Only check it out if you're curious other than that it's shell shocked"
      ],
      "genres": [
         "Short",
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["Christopher Films"],
      "summaries": ["On Christmas Eve the Turtles realize they've forgotten to get Splinter a gift. They hit the town to try to figure out what to get him, their kid fans join them and lots of singing, dancing and some rapping and shenanigans ensues."],
      "budget": 5000
   },
   "movielensId": 169236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-01",
      "dvdReleaseDate": null,
      "directors": ["Larry Osborne"],
      "runtime": 25,
      "movieId": 169236,
      "title": "Teenage Mutant Ninja Turtles: We Wish You a Turtle Christmas",
      "mpaa": "",
      "actors": [
         "Ronn K. Smith",
         "Alfredo Miller",
         "James Eric Anzalone",
         "Florence Reymond",
         "Jack William Scott",
         "Natasha Cresap",
         "Alicia Manta",
         "Anthony Manganiello",
         "Yaniv Segal"
      ],
      "imdbMovieId": "1789982",
      "originalTitle": "Teenage Mutant Ninja Turtles: We Wish You a Turtle Christmas",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A 25-minute, live-action Christmas special released direct-to-video in 1994.",
      "tmdbMovieId": 147939,
      "avgRating": 3,
      "releaseYear": "1994",
      "numRatings": 2,
      "posterPath": "/6LJxtMd5hzYsmbMgz5cNu790ZR8.jpg"
   }
}