{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "experimental",
            "id": 14629
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0376293",
      "video": false,
      "title": "Our Trip to Africa",
      "recommendations": [
         141419,
         144156,
         130314,
         145619,
         146986,
         138750,
         146987,
         105552,
         88276,
         209752,
         132161,
         105711,
         104378,
         146815,
         163230,
         128285,
         144886,
         188223,
         143554,
         150843
      ],
      "backdrop_path": "/2LXCD0auhz0nkE9v49oJBavDcol.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ab2c3a36847f81dcc5f",
               "name": "Peter Kubelka",
               "profile_path": "/pAjxcWBvZsNfSSIf20cCJFjxJm2.jpg",
               "id": 1046110,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58bf27019251413046000196",
               "name": "Peter Kubelka",
               "profile_path": "/pAjxcWBvZsNfSSIf20cCJFjxJm2.jpg",
               "id": 1046110,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.171731,
      "production_countries": [{
         "iso_3166_1": "AT",
         "name": "Austria"
      }],
      "id": 109398,
      "vote_count": 15,
      "budget": 0,
      "overview": "Kubelka was asked to do a documentation group of Europe's hunters in Africa, working on it for hours and do the editing very extreme so film live leaving only 12 1/2 minutes, Kubelka also did a revolution in sound synchronization in which he called the \"sync events,\" and also done editing to create an illusion of continuity for a moment, one of the most important experiment film of all time.",
      "similar": [
         11970,
         11544,
         37135,
         37724,
         812,
         155,
         568,
         10020,
         10527,
         9479,
         12092,
         10193,
         9016,
         19,
         12230,
         10144,
         3933,
         140607,
         240832,
         52520
      ],
      "original_title": "Unsere Afrikareise",
      "runtime": 13,
      "poster_path": "/w0gjWZISh2smYV6D7Qyki9NMRfA.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [],
      "release_date": "1966-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Austria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Kubelka"],
      "runtime": 13,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0376293/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Perhaps Kubelka's best known work, Unsere Afrikareise (1966)is a collection of images from an African safari cut together through the bizarre, inter-frame dictated editing for which Kubelka is known. The film can be best described as an experimental documentary, or put in Hollywood terms, National Geographic meets Brakhage. Scenes of both a zebra and giraffe being held down and slaughtered, intercut with bourgeois European travelers chatting on a ferry, mark some of the most vivid moments. As mentioned, the film is cut to a very specific rhythm. Though the images and content are quite engaging in and of themselves, it is the pacing and cutting that link the piece to Kubelka's ouvre. Probably shot on Super 8mm or 16mm, the film is hard to get a hold of today. I saw a pirated copy ripped probably from a VHS. The sound and image quality are obviously aged, but together with Kubelka's compositions and editing, the aesthetic is quite spectacular. A must see for people interested in the avant-garde.",
         "...and I loved the film. The way director Peter Kubelka edited the 14 hours of film into the 12.5 min is impactful, explosive. He takes sound effects from different sources to create something revealing truths in the footage. Like a gunshot appearing to shoot off a guy's hat or the music in the background during the hunts. A female member of the hunting party laughs and he carries the laugh on far past it's end, while the woman converses. This movie blew me away. I was mesmerized. Very fortunate to see it screened on the big screen at Yale. I suggest that any true lover of cinema or abstract realism should watch it if given the chance.",
         "This is a melting pot of images the filmmaker snapped on a trip to Africa; they show satisfied tourists lounging in the sun, animals being slaughtered, now a white man in safari gear emerges from a thatched roof hut, a black woman with naked breasts walks by, Africans herding an animal carcass to the roof of a vehicle. It may have a historic importance I cannot glean at this point, but off hand I know of travelogue works in a similar vein that both transport and lay a broader world bare with interest in Chris Marker, Varda, further back it was A Propos de Nice which is a template of sorts for this. I like these things when the fabric is expansive with a multitude of reflections. Alas, this guy is Austrian and that means a rather stark light that narrows down to the form of idea. I would rather get wisdom than just commentary, but who knows, you might emerge from some room I didn't visit.",
         "Artist Peter Kubelka's little discussed and slim filmography has oddly appealed to me ever since I first stumbled upon it. Many people are bound to despise his every work, but I found myself greatly intrigued with this man's catalog of experimental shorts. I have now seen four of his short films, each of them charming, unique, semi-brilliant, but unfortunately flawed in their own special ways, and I can definitely say that he is one of the most fascinating avant garde filmmakers I know of. This film is probably his most famous, along with the enigmatically exciting \"Arnulf Rainer\" (which may be my personal favorite of his simply because it's miraculously engaging despite feeling like the type of minimalist modern art that I would dismiss as pretentious bull), and it may be his best. MAY be. Unfortunately, it is rather flawed and, despite the brief running time, kind of gets tedious towards the end but, overall, it's quite unique. The soundtrack is entirely made up of mundane (?) sort of dialogue recorded from all over Africa, and it's all in foreign languages so, since I can only speak English and didn't watch this with subtitles, I never was able to understand what they were saying. But whatever they were saying is actually kind of irrelevant to the film's power and intent. The chaotic mixture of words flowing through the background with both grace is vigor is not meant to be understand, instead it is used as more of a tool in which to steer the rhythmic ship that this cryptic little travel film really is. The imagery is a mixture of the cruel and the beautiful; and a warning to animal lovers: there's a lot of hunting in this film, which leads to some rather explicit (if frankly and neutrally filmed and depicted) visuals that you may want to avoid, but since this is how some people have to get their food I feel like it's mostly justified, and the filming of it is just to further capture the daily life of the African residents that populate this picture. All in all, this movie is something of a mystery to me, and to anyone who watches it, which is the main similarity it has to the rest of Kubelka's films. Although his other movies are visually much darker and experimental, as well as even less narrative or coherent, one can still tell they were all made by the same mastermind...or fraud...or artistic troll...or whatever Kubelka may be...really his work is much to mysterious to have a single valid interpretation attached to it that can be considered in any way 100 percent accurate.",
         "This is a 13-minute documentary movie by Austrian director Peter Kubelka from almost 50 years ago. He is in Africa and basically films the natives' every day life here. Occasionally we hear voices narrating a bit at the same time. A big part of the film is about hunting and I didn't really like that. In general, it is a very forgettable piece of filmmaking and I am surprised it is a bit famous. There's nothing other in there than what everybody else could have recorded while traveling to Africa and I have to say the quality of the film is not good at all. The way it looks it could also have been from the 1930s or so. Not recommended and I have to say watching this does not make me curious about the director's other works even if I can't deny that an almost 6ß-year long career is pretty impressive. Then again, he has not been particularly prolific and only made roughly one short film every 10 years."
      ],
      "genres": ["Short"],
      "productionCompanies": [],
      "summaries": ["Kubelka was asked to do a documentation group of Europe's hunters in Africa, working on it for hours and do the editing very extreme so film live leaving only 12 1/2 minutes, Kubelka also did a revolution in sound synchronization in which he called the \"sync events,\" and also done editing to create an illusion of continuity for a moment, one of the most important experiment film of all time."],
      "budget": 0
   },
   "movielensId": 169270,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1966-01-01",
      "dvdReleaseDate": null,
      "directors": ["Peter Kubelka"],
      "runtime": 13,
      "movieId": 169270,
      "title": "Our Trip to Africa",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0376293",
      "originalTitle": "Unsere Afrikareise",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Kubelka was asked to do a documentation group of Europe's hunters in Africa, working on it for hours and do the editing very extreme so film live leaving only 12 1/2 minutes, Kubelka also did a revolution in sound synchronization in which he called the \"sync events,\" and also done editing to create an illusion of continuity for a moment, one of the most important experiment film of all time.",
      "tmdbMovieId": 109398,
      "avgRating": 2.8,
      "releaseYear": "1966",
      "numRatings": 5,
      "posterPath": "/w0gjWZISh2smYV6D7Qyki9NMRfA.jpg"
   }
}