{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0853060",
      "video": false,
      "title": "Germany: A Summer's Fairytale",
      "recommendations": [
         1611,
         9999,
         6733,
         4645,
         4407,
         6172,
         9496,
         6076,
         9511,
         240510,
         10755,
         9803,
         8366
      ],
      "backdrop_path": "/hVwVcJ1oc3Opts4dV8moqvmX7J6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4232c3a36847f800b5fd",
               "name": "Jens Lehmann",
               "profile_path": null,
               "id": 42678,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b601",
               "name": "Arne Friedrich",
               "profile_path": null,
               "id": 42679,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b605",
               "name": "Philipp Lahm",
               "profile_path": "/9IWBP7h0zFfAo2ycTLoRXXDp0DU.jpg",
               "id": 42680,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b609",
               "name": "Torsten Frings",
               "profile_path": null,
               "id": 42681,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b60d",
               "name": "Michael Ballack",
               "profile_path": null,
               "id": 42682,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b611",
               "name": "Timo Hildebrand",
               "profile_path": null,
               "id": 42683,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4232c3a36847f800b615",
               "name": "Oliver Kahn",
               "profile_path": null,
               "id": 42684,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b5e1",
               "name": "Sönke Wortmann",
               "profile_path": "/27V2lklRPa8KzRbuYKVgxq7nTgz.jpg",
               "id": 1869,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b5e7",
               "name": "Tom Spiess",
               "profile_path": null,
               "id": 4035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4232c3a36847f800b5ed",
               "name": "Sönke Wortmann",
               "profile_path": "/27V2lklRPa8KzRbuYKVgxq7nTgz.jpg",
               "id": 1869,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4232c3a36847f800b5f3",
               "name": "Frank Griebe",
               "profile_path": null,
               "id": 1077,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4232c3a36847f800b5f9",
               "name": "Melania Singer",
               "profile_path": null,
               "id": 4036,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.579459,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 286,
      "vote_count": 19,
      "budget": 0,
      "overview": "A documentary of the German National soccer team’s 2006 World Cup experience that changed the face of modern Germany.",
      "similar": [],
      "original_title": "Deutschland. Ein Sommermärchen",
      "runtime": 107,
      "poster_path": "/4i5GtbhhRbGkvOXrK5ZdFPaHs3F.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Little Shark Entertainment GmbH",
         "id": 736,
         "origin_country": ""
      }],
      "release_date": "2006-10-03",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sönke Wortmann"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Sönke Wortmann"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0853060/",
      "coverLink": null,
      "actors": [
         "Jürgen Klinsmann",
         "Bastian Schweinsteiger",
         "Lukas Podolski"
      ],
      "reviews": [
         "Well, I am used to the omni-present criticism of Germans. That's why I would like to say: well done, Sönke! Great documentation, funny situations. Would have loved to see more of the boot camp in Italy, though;) Looking forward to the DVD release with additional scenes. My friend and me had to smile every other scene. And it was quite an insight to see what happens in the locker room before, during and after a game - especially for someone who (like me) has never played a team sport on a competition level. And even Ballack grew on me - I never really liked him before - which might have to do with my fondness of Werder Bremen, though;)But of course the hero is Torsten \"Lutscher\" Frings! Why? See for yourself!!",
         "After watching the trailer, everyone, who had the chance of participating the world cup this summer in Germany, wishes to watch this movie, especially, if you are a German team sympathizer. What do you get: 108 Minutes of an intense look of a great team with a lot of young, but talented soccer players from Germany, all the way from about three weeks before the opening match to the last match of the team, the \"Third Place match\". It isn't an usual documentary, you only get the main events during the match of the German team. The movie begins after losing the semifinal against Italy, just watching sad and disappointed players. Then, the whole journey is told, from the fitness training over the first group matches to the finals. You'll see some funny events during this time, a lot of interviews with both players and staff. You also get the chance to see the last words of the coach before the matches start. Almost everyone, who watched this movie, felt the atmosphere of those fantastic four weeks here in Germany. You may need to be interested in the sport to enjoy this movie. More than that, you should know at least the main characters (coach Klinsmann e.g.). Otherwise you will have some problems to understand some of the events taking place during the movie. Bottom line: Midfielder Frings said at the end of the movie: \"we (the team) should have deserved more\" (meaning more then the third place). After accompanying the team through this movie, you probably say: \"you're definitely right\". As viewer, you will realize the broken dream, but you will enjoy this movie.",
         "In the course of four weeks (June 9 until July 9, 2006) Germany was nothing but a huge party. Celebrating the fantastic achievements of our national soccer team. Sönke Wortmann, the director of this documentation, accompanied the team during this time. \"Deutschland - Ein Sommermärchen\" gives us a glance behind the curtain. The beginning is at the same time the most tragical moment. The defeat against Italy along with the grieving players and coaches. Afterwards the movie chronologically goes the way from the training camp until the semi - final. We are able to see the players in their training sessions, tactical discussions among the coaching staff, and lots of fooling around from the young players like Bastian Schweinsteiger and Lukas Podolski. We can see that a team was growing. We can see the intense sense of community and solidarity among them. The documentation doesn't focus on the soccer scenes alone. However, it doesn't neglect them. We see the goals again, the enthusiastic fans, the hilarious atmosphere which infected the whole country. I'm glad we also see a lot of what happened apart from the football ground. It's interesting to see what happened in the dressing room while we (the fans watching on TV) were fetching another drink or going to the toilet or whatever we did during the breaks. Altogether I can recommend this documentation to everyone who had fun in the great summer 2006. And I recommend it to everyone who considers the Germans to be some non-smiling accurate work-robots. It was a unique experience. A whole nation was backing up its soccer team. National flags were waving from every car, every house. It was, as if Germany had completely changed over night. That's why we call it a summer fairy-tale - \"Ein Sommermärchen\".",
         "I remember watching sort of a similar movie concerning France winning the WC in 1998. It was a phenomenal movie and I thought, french players are something special in terms of still being in a \"growing-up\" phase, making fun with others and just having a good time while earning their money. This movie is great, it reveals, that all of this guys, even though most of them a millionaires, are still humans, who live their life like u and me. Although I am half German too, I never thought my fellow men could behave like the multicultural team of France, but they do ! I think u get a great view of the German Team, if u don't already know it. If you watch this movie, i think you will understand, why this Team had such a great success. Wortmann shows and mixture of guys, who perfectly match up. Young guns like Schweinsteiger and Podolski, making jokes all the time, just like the young boys do, when I go out of my house and ol' \"rabbits\" (Thats the way we call it in Germany) like Nowotny and Kahn, supporting the Team whenever they can. The movie makes you feel connected to these guys, because it takes away some prejudices and wipes away the cut and dried opinions of them working wonders. Jürgen Klinsmann puts up the same statements like a 7th league coach, talking to a defender (\"He will smell your breath all the time, Arne!\"). In a nutshell, after watching the movie, I think if I would meet Podolski on the street court next to my house, and if he really had time for it, he would never reject playing some One on One soccer games with me and joking about passing girls ..",
         "Wortmann's \"Deutschland. Ein Sommermärchen\" does not really contain anything you would've missed watching the World Cup on TV (in Germany), it does not contribute additional in-depth information about tactics or any other part of the German team's methods - yet it does a good job at summing up an event millions won't forget. Its arguably strongest scene is right at the beginning, showing the team crushed in the dressing room right after losing the semi-finals to Italy. Other than that it follows the German team throughout the 2006 World Cup, showing many nice anecdotes and avoiding any criticism of the team itself, true to Klinsmann's spirit.",
         "I saw this movie on Friday and I found it to be very amusing and interesting. I consider myself as a huge fan so I was thrilled to see a halftime speak of the coach during a game or how the team management successfully created a brilliant team spirit. Meanwhile people in the cinema cheered when Germany scored or Lehmann saved a penalty, it was a little bit like during the world cup. Wortmann did a great job in silently observing the German team, so you really felt as you were a part of this whole great event. Finally I'd like to say that everybody that enjoy the world cup as much as I did and who took part in the whole public viewing thing should go and watch this movie. It brings back the feelings and memories of the wonderful (soccer) summer. It was really a summer-fairy tail.",
         "In summer, I watched the World Championship with enthusiasm. Having heard that director Sönke Wortmann were with the German team and would make a movie, I was really interested and expected fascinating impressions \"from back office\". But the result is disappointing: Jürgen Klinsmann is shouting and motivating the team all the time, the players are really engaged, joking around or answering simple questions and the games are repeated once again in short versions with all goals. But there are no views on the players' relations (except the competition between Lehmann and Kahn), moments of conflicts or controversies have found no way into the movie (perhaphs, there was nothing than harmony...) and no one in the film is really portrayed as an individual. The movie is an documentary which could have been made by any DFB official (German Football Association) who wants to produce a big seized promotion video. Maybe, Sönke Wortmann earns enough money to work on a better movie in the following time...",
         "I think this documentary is very typical of Germans in particular and of people in general. Now, we have all seen the national team play the World Cup and we were very satisfied with the outcome of the tournament (funnily enough, when Germany made runner's up in 2002, people weren't as frantic about Germany and the German team as they are now, after the World Cup 2006 IN Germany). And when I watched the matches, I observed the unaggressive and unobtrusive birth of what news magazines called the NEW NATIONALISM. I didn't really take part in this, but I didn't mind it either (I just thought: Oh, O.K. why not, after fifty years of forbidden patriotism, let the baby have his bottle). But this documentary is overdoing it a bit. First of all, I didn't like Sönke Wortmanns DAS WUNDER VON BERN, because it was way too corny as a movie and it didn't discuss the controversial link between German soccer and German nationalism shortly after WWII at all (For example, it didn't mention how Peco Bauwens, the head of the German soccer association, held a speech just after Germany won the World Cup in 1954, talking about the connection between physical education and nationalism in a way you'd probably only expect it from someone like Hitler). And now this: A film that takes us on a trip into the locker room for the one and only reason to satisfy our curiosity. We don't really learn anything new about the strategy of coach Jürgen Klinsmann or about the physical part of soccer. This documentary quenches nothing but our thirst for the invasion of privacy. In a way, it is not very different from Big Brother: We do not satisfy ourselves any longer with seeing our soccer players on the field, no, we have to follow them everywhere: into the locker rooms, into the hallways of the stadiums' catacombs, everywhere! I still don't understand why the soccer players let Wortmann invade their privacy to such an extent. I can only think of two reasons: money and vanity! And Wortmann is a copycat, too. He knew that a French director had had an incredible success doing a documentary on the French team in 1998, when the French won the World Cup. He knew that a lot of money was to be made on such a documentary, and that this was an opportunity he couldn't miss. Now, I know that people are going to say: If you are so against it, why did you go and see it. The reason is: I am like everyone else. Sometimes when I go shopping I look at all these magazines such as GALA, BUNTE and so on (For the non-German readers: these are magazines that solely discuss the private life of celebrities or wannabe celebrities), and I catch myself reading or leafing through one or two of them. It's the same mechanism that comes into play when you witness a car accident: You look! You watch the ambulance, the casualties, the police, because you are so unbelievably curious. And this very same mechanism made me watch this documentary. I watched it out of pure curiosity, but I didn't really learn anything watching it. And, on me,it had the same effect as a car accident: I felt ashamed of my curiosity!",
         "Hello, I am a huge Michael Ballack fan and of course, a fan of the German soccer team. It broke my heart to watch them lose against Italy and thus, lose their chance to win the World Cup. I live in the US, and so haven't yet watched the German documentary: 'Deutschland. Ein Sommermarchen' and it's also very difficult to find any information related to this film. Does anyone have an idea about when the DVD release of this documentary is slated for? Has a release date been announced yet? I hope that it would not be too far into the future. I would appreciate any web-links or information. Thank you.",
         "This movie is phenomenal. It's brings you back to your feelings during the world championship tournament. Wortmann did a great job to give the viewer a look to that, what you did not see on free TV during the tournament. A a German, you will love this movie and if you're not German... well, you can enjoy it too. For myself i had to say, it's a bit sad, that Wortmann did not get more intense closer looks about the DFB-Team, but i think, the way he did his work was great. The movie catches the atmosphere that take place in Germany for the three weeks of the World Cup, and brings is right back in your living room... or anywhere else, where you watch this movie. (PS: sorry, if my English is not very good)"
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": [
         "Little Shark Entertainment GmbH",
         "Westdeutscher Rundfunk (WDR)"
      ],
      "summaries": ["A documentary on the German national team's World Cup 2006 journey, all the way from boot camp in Sardinia to the 3rd-place play-off."],
      "budget": 0
   },
   "movielensId": 169260,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2006-10-03",
      "dvdReleaseDate": null,
      "directors": ["Sönke Wortmann"],
      "runtime": 107,
      "movieId": 169260,
      "title": "Germany: A Summer's Fairytale",
      "mpaa": "",
      "actors": [
         "Jens Lehmann",
         "Arne Friedrich",
         "Philipp Lahm",
         "Torsten Frings",
         "Michael Ballack",
         "Timo Hildebrand",
         "Oliver Kahn"
      ],
      "imdbMovieId": "0853060",
      "originalTitle": "Deutschland. Ein Sommermärchen",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentary of the German National soccer team’s 2006 World Cup experience that changed the face of modern Germany.",
      "tmdbMovieId": 286,
      "avgRating": 0.5,
      "releaseYear": "2006",
      "numRatings": 1,
      "posterPath": "/4i5GtbhhRbGkvOXrK5ZdFPaHs3F.jpg"
   }
}