{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "christianity",
            "id": 186
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "bulimia",
            "id": 2324
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "disfigured face",
            "id": 157676
         },
         {
            "name": "religiosity",
            "id": 192762
         },
         {
            "name": "seizure",
            "id": 209144
         }
      ],
      "imdb_id": "tt5076792",
      "video": false,
      "title": "Trash Fire",
      "recommendations": [
         322163,
         341050,
         381041,
         215928,
         404073,
         324245,
         172548,
         407390,
         47488,
         393834,
         347764,
         253307,
         279516,
         387396,
         82795,
         193611,
         225898,
         172824,
         27712,
         263865
      ],
      "backdrop_path": "/8AROhRdER7Mze9RnjzsQLlhz1nW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Owen",
               "gender": 2,
               "credit_id": "5640dba292514176ba00020c",
               "name": "Adrian Grenier",
               "profile_path": "/qihY533cCB11VYChNN2ym1RfPkU.jpg",
               "id": 5090,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Isabel",
               "gender": 1,
               "credit_id": "570e3d3b9251411621000201",
               "name": "Angela Trimbur",
               "profile_path": "/po3avLOQj684BS3fEYVjuFyR8sd.jpg",
               "id": 183073,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Violet",
               "gender": 1,
               "credit_id": "5640dbc192514176c100020c",
               "name": "Fionnula Flanagan",
               "profile_path": "/bQPNTSyBXdfwOXcwjCdzFXDSDVO.jpg",
               "id": 58068,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Pearl",
               "gender": 1,
               "credit_id": "5640db8892514176b50001c3",
               "name": "AnnaLynne McCord",
               "profile_path": "/rHL2xafnEeldutgLdd9Avu4DssI.jpg",
               "id": 82662,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Florence",
               "gender": 1,
               "credit_id": "5640dbe4c3a36814e7000207",
               "name": "Sally Kirkland",
               "profile_path": "/bAjUA08z6k8FZ3bu5QWcMWWVdMQ.jpg",
               "id": 12134,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Caleb",
               "gender": 2,
               "credit_id": "5640db7592514176b80001b0",
               "name": "Matthew Gray Gubler",
               "profile_path": "/l7wFN37wNnt4HYNz1Im94RkBwF7.jpg",
               "id": 5661,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Sheldon",
               "gender": 2,
               "credit_id": "5640dbdc92514176ba00021b",
               "name": "Ray Santiago",
               "profile_path": "/3a5pbiX0owhDPVWCyg1Snb63Clz.jpg",
               "id": 52957,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Pastor Sterling",
               "gender": 2,
               "credit_id": "571fc1fd925141531b000322",
               "name": "Ezra Buzzington",
               "profile_path": "/dl0SIqpOqS05UpJHKuDQqZTwUvP.jpg",
               "id": 59285,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Aimee",
               "gender": 1,
               "credit_id": "570e3d30c3a36845370001f0",
               "name": "Molly McCook",
               "profile_path": "/8h0I4W09jeg8SyS69UsFQbIGouF.jpg",
               "id": 1202361,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Owen's Mother",
               "gender": 1,
               "credit_id": "570e3d29925141160100020e",
               "name": "Alexa Hamilton",
               "profile_path": null,
               "id": 100649,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "571fc07792514152e70002a1",
               "name": "Leigh Poindexter",
               "profile_path": null,
               "id": 1611351,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "571fbffbc3a36833930046ce",
               "name": "Andrea von Foerster",
               "profile_path": null,
               "id": 563736,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "571fc053c3a368775b003412",
               "name": "Carinne Uslar",
               "profile_path": null,
               "id": 1611350,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "571fc0839251416f33003d51",
               "name": "Margaret Box",
               "profile_path": null,
               "id": 1611352,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "571fc112c3a36833930046f1",
               "name": "Lawrence Mattis",
               "profile_path": null,
               "id": 1030589,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "571fc1559251416f33003d69",
               "name": "Matt Smith",
               "profile_path": null,
               "id": 1611353,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56103d69c3a36868100100df",
               "name": "Richard Bates Jr.",
               "profile_path": "/l8FhzuwCtf8easwE4GpcamxfxkA.jpg",
               "id": 1046489,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56103d76c3a368680b00fc5a",
               "name": "Richard Bates Jr.",
               "profile_path": "/l8FhzuwCtf8easwE4GpcamxfxkA.jpg",
               "id": 1046489,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "571fbfe2c3a3686ec50036fd",
               "name": "Tracy Dishman",
               "profile_path": null,
               "id": 1611349,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5640dc54c3a36814ee0001c3",
               "name": "Shane Daly",
               "profile_path": null,
               "id": 1199840,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5640dc6cc3a36814e7000214",
               "name": "Yvonne Valdez",
               "profile_path": null,
               "id": 1202353,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "571fc0209251414df400384d",
               "name": "Michl Britsch",
               "profile_path": null,
               "id": 55169,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "571fc065925141280100176d",
               "name": "Anthony Tran",
               "profile_path": null,
               "id": 1202357,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "571fc09ec3a3686241001839",
               "name": "Yvonne Valdez",
               "profile_path": null,
               "id": 1202353,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "571fc0fec3a368338c0042a9",
               "name": "David Clarke Lawson Jr.",
               "profile_path": null,
               "id": 1141540,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.052562,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 362409,
      "vote_count": 30,
      "budget": 0,
      "overview": "A man forced to confront his past when he and his girlfriend end up entangled in a web of lies.",
      "similar": [
         22705,
         2149,
         80752,
         106646,
         28468,
         9946,
         27066,
         10090,
         112160,
         86331,
         1278,
         4247,
         4823,
         82023,
         9453,
         134764,
         17899,
         1813,
         1948,
         4995
      ],
      "original_title": "Trash Fire",
      "runtime": 91,
      "poster_path": "/hXAy6tbOivPzLqx48nqM6xOCuEt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Snowfort Pictures",
            "id": 7787,
            "origin_country": ""
         },
         {
            "logo_path": "/simDvqT8y6jhP530ggUMbikvVKc.png",
            "name": "Circle of Confusion",
            "id": 23921,
            "origin_country": ""
         }
      ],
      "release_date": "2016-11-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Bates Jr."],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Richard Bates Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5076792/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE0NDg0OTk0M15BMl5BanBnXkFtZTgwOTk4NDU1MDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Adrian Grenier",
         "Angela Trimbur",
         "Fionnula Flanagan"
      ],
      "reviews": [
         "I came across this movie on Netflix and figured hey, why not? I had never heard of the film but I recognized the cast. Turns out this slow burn of a movie is well worth your time. The film is almost two in one, the first half is a well written drama about a young man (Adrian Grenier) and his girlfriend and the very real problems they face. So often in movies the characters in relationships have fake problems that no one ever experiences (I'm looking at you How to Lose a Guy in Ten Days). This couple has problems that I would imagine many viewers can relate to, enough so that it may be uncomfortable watching with your significant other. Grenier retains a bit of the Vinnie Chase charisma but it almost drowned in his apathy to...well just about everything. I found this part of the movie engrossing and realistic. I enjoyed all the side characters we meet here as well. Trash Fire then transitions into a Southern Gothic melodrama as our two leads travel to meet Grenier's family. This is the meat of the movie and the tone changes dramatically from the relationship drama we first experienced to something darker. I hope people check this movie out, the low IMDb scores likely reflect the difficulty in putting this film in a genre. It isn't a horror film, it isn't a drama in the traditional mode and it isn't a crime thriller. It is likely fans of all those genre's might check this out and may be disappointed because it resist categorization. However, if you approach the film without preconceived notions I feel you will become immersed in this world. I found the ending somewhat abrupt and unsatisfactory for several of the characters, but let's face it, most movies end badly these days. Aside from that, it was time well spent with this little indie film. I gave it an 8 because I felt my time was well spent watching it and I would pass along a recommendation for others to check this out.",
         "I'm not sure how this could be billed as a horror in an older day it would have been called a tragedy I guess 'horror' is the dumbed down description or for the sake of pigeon holing. The first scene did make me laugh(as much as one person can laugh when watching a movie alone). It is a black comedy surrounding dysfunctional relationships. I enjoyed it finding the script decent and the acting good enough not to distract. The camera-work, post-processing and lighting was well done for a film that had a small budget feel, on a technical aspect it reminded me of Napoleon Dynamite and Nacho Libre. The quirkiness of the script delivered by the characters is what makes the film worth a watch. A film for types that like nothing more than escaping for a weekend to film festivals, Not entirely certain this will have mass appeal for the college-age demographic. I'd say a film for a mature audience and I don't merely mean 18+.",
         "Or was that mad? Whichever one it is, there is not always a clear or just one answer to that question. The movie is not really here to make friends either. A. Granier is really someone who is not very likable most of the time. But can you blame him? That's after you see where he came from or what he had to \"suffer\" (some call it childhood). Family matters ... sometimes it matters too much. So much that you lose sight of other things. And both our male and female lead can attest to that. But while it is not about winning any popularity or beauty contest it also does not pull any punches. It may get ugly, but it is coherent for the world it portrays. Not an easy watch and not for the squeamish either. But different in a good (read: bad) way!",
         "The obnoxious, cynical and sarcastic web designer Owen (Adrian Grenier) lives with his girlfriend Isabelle (Angela Trimbur). Owen has analysis with his psychiatrist Florence (Sally Kirkland) since he feels guilty for the fire that killed his parents and deformed his sister Beatrice (Alexa Hamilton). When Isabelle discloses that she is pregnant, she asks Owen to make up with his only family composed by his estranged grandmother Violet (Fionnula Flanagan) and Beatrice. Owen warns Isabelle that Violet is a nasty woman, but they travel to his hometown. They learn that Violet is a despicable woman that keeps Beatrice locked in her room. Isabelle realizes that Owen has told the truth about Violet, but they stay for a couple of days more because of Beatrice with tragic consequences. \"Trash Fire\" is not a film of horror or romance as indicated in IMDb. It is an unpleasant and disturbing drama with a deceptive conclusion. All the characters are unlikable: Owen is obnoxious and it is hard to find the reason why Isabelle felt in love with him. Later the viewer understand the reason of his twisted personality. Isabelle is cynical and takes no attitude towards Owen stupidities. Florence is an awful psychiatrist that sleeps along the session with her client. The gay Beatrice is also a victim of Violet insanity and badness. Violet is one of the sickest villains ever and reason to recommend this film. Unfortunately Richard Bates Jr. did not know how to end his film making the choice for a too dark conclusion without any redemption that Owen and Beatrice deserved. My vote is six. Title (Brazil): Not Available",
         "Pretty much faultless adult movie. Right from the off, the characters are deeply dark yet colourful. There is a thin line between and love and loathing that the film tightropes, almost skips, nonchalantly. I never felt disconnected for a single moment of its bizarre, unfolding world - with characters so well developed, I could smell them from the screen. I couldn't fault anything about it, right down to it not lasting a second longer than it needed to. Wonderful, original film making.",
         "The only likable people in this movie were the wait staffs in the restaurants. The leading couple seem to be staying together because no one else will have either one of them. The grandmother is a delusional, murderer who wraps herself in the bible. The clergyman is a child molester. The long dead parents are torn to shreds in every flash back. Little sister is practically held captive by her grandmother. She is disfigured, gay and mentally ill. The cameo by Matthew Gray Gubler as an hypocritical religious zealot was a nice touch. As was the seizure during the sex scene. Wonderful performances all around. You can dislike / hate each character and feel sympathy for them at the same time. Except grandma--she sucked. There wasn't a web of lies, deceit and murder to be caught up in as you would be in a classic thriller. The long held, dark secrets are never revealed to the cast.The viewer sees all but, not the players. Two rounds from a twelve gauge and a wordless epilogue close the movie.",
         "When Owen is forced to confront the past he has been running from his whole adult life, he and his girlfriend, Isabel, become entangled in a horrifying web of lies, deceit and murder. Can we talk about Fionnula Flanagan as Violet and AnnaLynne McCord as Pearl? I had never heard of Flanagan until a year ago, and she has been knocking it out of the park with her genre performances. So great to have her on board. And McCord, wow. One genre hit after another. I don't know how \"we\" got her into our camp, but it's great to have her. The blend of horror and comedy is great, too! The comedy is dark, dark humor which works well. The horror aspect is really more about building tension. This is not a jump scare or gore-filled movie. And that suits me just fine.",
         "Richard Bates Jr's first film \"Excision\" was a film that stuck with me for a long time after I watched it, it was very unique and incredibly bizarre. So when I saw that Bates had a new movie coming out I was pretty excited to see what else he was capable of. While not nearly as memorable as Bates' first film, \"Trash Fire\" does have a bit of dark charm and was an interesting experience. The first thing that really stuck out to me in this film is the fact that just about all the characters are unlikable, everyone is somewhat of a jerk and everyone is pretty judgmental/critical of others. This wasn't a bad thing though, it actually worked pretty well and went smoothly with the premise of the film. As unlikable as all the characters were they were also very interesting, and were the best part of the movie in my opinion. Our main character \"Owen\" (played but Adrian Grenier) is mean and dismissive to just about everyone he meets and even when he's trying to be nice he still comes off as a dope. But once we learn more about Owen's family it becomes clear why he is the way he is, and that he may actually be one of the more normal people in his family. The story was alright, although it had a bit of a \"Lifetime Movie\" feel, but the dialogue really sets it apart from the overly simplified movies that come on that network. The conversations that the characters have throughout the film are actually pretty engaging, something you rarely ever see in a horror film. It's a good thing that the dialogue was well done because there is a lot of it, people who are not fans of dialogue heavy films will definitely be put off for the majority of this. I thought it worked though, and I found myself intrigued to see what the characters would say to each other next. Another thing that I think is important to point out is that this definitely isn't a traditional horror movie, in fact I've seen a lot of people make the claim that this isn't a horror movie at all. I would disagree though, while there isn't a masked mad man running around or a spooky ghost haunting people, \"Trash Fire\" does have a overall tone of horror and the final scene definitely creeped me out and left me with an uneasy feeling. It was refreshing to see the genre approached in a different kind of way. This won't be for everybody, but I enjoyed it, like \"Excision\" it was fairly odd and a little quirky. Worth checking out for people who don't mind a lot of dialogue and a bit of a slow pace.",
         "'Trash Fire' reminded me a little of 'Tusk'. Very different films (both of which I happened to love), but with one common similarity at the centre of them - the characters have some actual depth to them. The first half of 'Trash Fire' I couldn't work where exactly the horror tag IMDb had attached to it was coming from. It seemed purely like a relationship-drama and a character-study of sorts. What I didn't realise was that all of that was purely character development and set-up, something almost unheard of in your average horror movie. Even after completing the movie, using the term horror might be stretching things a little. There are certainly particular scenes that would fit right into a horror movie, but I think the whole thing is intended more as a very dark comedy/drama. In fact, very dark indeed. I liked it a lot though. Each and every one of the characters was fascinating in its own way. Almost all of the dialogue is excellently written and quite thought-provoking. The acting was also immensely impressive from the entire cast. I went in with low expectations and was treated to a nice surprise.",
         "Okay so of course good actor Adrian Grenier knows how to play his characters. Loved his sarcasm in the movie. I like the story plot was interesting. Disappointed by the ending but all in all it wasn't bad. It could have used a little more of something but at least it wasn't slow paced. It is not horror by any means, but the story line is interesting. The more you watch the more you will understand why the star is how He is. If you are familiar with family dysfunction than this will make sense to you. The whole time you're watching thinking what a horrible guy He is, but you start to understand what kind of craziness He stems from.",
         "As a child Owen (Adrian Grenier) survived a fire that killed his parents and disfigured his sister Pearl (AnnaLynne McCord). He was raised by a hateful maternal grandmother Violet (Fionnula Flanagan). He ran away as a child and hasn't been home since. Owen is in therapy and has an off and on serious girlfriend Isabel (Angela Trimbur). Owen is apathetic and volunteers too much information which is part of the fun. Isabel is pregnant and threatens to abort the baby unless Owen straightens up and meets her demands, one of which is to re-unite with his estranged family...the one that blames Owen for accidentally starting the fire and really doesn't want to see him either. This is a cult film. It contains dark quirky humor. It has very little \"horror\" in it. All the characters are flawed and enjoyable. Not for everyone. Guide: F-word. Bad sex. Nudity (Angela Trimbur). Winner of Audience Award Boston Underground Film Festival 2016",
         "I had been avoiding this film for a while after watching its trailer before. Because I really can't stand watching movies full of unlikable characters which seem to be a trend these days. However, I came across this movie again one day and started reading reviews on IMDb, I decided to take a chance. Mostly because this is a film of the directer of \"Excision\" and I liked the film, and also I was curious to see the dynamics and dialog between these \"unlikable people\". In conclusion, I liked it! The dialog in first half is pretty funny, rather whimsical. I found myself giggling in some scenes. To me, they are not unlikable (except for the grandma;she is a disgraceful worthless c**t), they are just deadly honest and no filter or sugar coating when they talk to each other, I would say which can be a good thing unless hurting your partner's feelings. Owen is an emotionally pretty broken person, he can't relate to other people, perhaps even to himself. I don't think Owen particularly hates Isabel's brother or her friends, it's just that is who he is. Probably Owen doesn't even understand why people take everything he says personally. Although it doesn't justify how he behaves in front of others, taking this into consideration helps understand him. Isabel actually seems worse since she acts like a civilized person and yet, her remarks towards Owen sound very personal and abrasive. Whereas Owen, we can see that he was trying to meet her half way with his awkward manner in spite of his lack of empathy. To be honest, I found it was quite heart warming. However, after they arrive at Owen's grandmother's house, things slowly start to turn a weird direction. I suppose this director sees Annalyn Mccord's value in a way other people don't see (Definitely he doesn't want to use her just as a pretty eye-candy...). As \"Excision\" took a weird turn towards the end, this one also goes to the same direction. This director seems to like making the story a little bit positive and ease our tension, before displaying its sudden dark ending. Somehow he is good at making me feel facing-the-end-of-the-world type of depression with his films. I just didn't know what to do with my sense of loss caused by its ending. I was very sad for a while after watching this movie. Overall, this is not a movie for everyone, I even see why some people don't like it, but if you find the trailer amusing, go for it. But the movie doesn't stay that way. Don't forget that it is categorized as a horror movie after all...",
         "It's hard to rate and review this film. It wants to be a dark comedy, but then tries to be something much more serious and emotionally disturbing as it dives into horror, yet springs back again here and there... and even some of the horror elements are quite funny. I'd have to say this is much more of a dark comedy drama with a lot of tension and negativity. This is not a Romance/Comedy or even your typical Horror comedy. The comedy is much more situational and mostly stems from the interaction of emotionally disturbed people who loathe one another. That said, this wasn't a B-rate production. There are some very talented actors with very believable characters and some enjoyable moments with the dark humor. It's quite twisted, but well-made. So, I give it a 6 because it never bored me and though I cringed a lot, it was enjoyable enough to deserve a positive rating. However, I doubt it has much replay value. I wouldn't recommend this as a must-see to anyone, but if you love dark comedies and/or twisted horror and have some time to kill, I think this would entertain.",
         "There's a quote that this movie reminds me of - \"Horror is not a genre, but an emotion.\" Is this a typical horror movie? No. Is this an atypical horror movie? Absolutely. From the beginning, the dialogue and characters pull us into their unhealthy relationship...all stemming from the protagonist feeling guilty for burning his parents to death, and leaving his sister disfigured. Not only is he unable to form healthy, loving relationships as an adult, he also has seizures periodically (one of which is in a classic bedroom scene). When his girlfriend tells him she's pregnant, the idea does not go over well, but he does have a revelation that he wants to really try to love. She demands they visit his grandmother and sister so he can make reprimands and learn to become a healthy family. From the second they arrive, the relationship with the religious zealot Grandmother is tense...and it only gets worse from there. The emotions boil over, and once we see the true misguided darkness in the Grandmother. Everything is balanced with humor. The climax builds slowly, and the final scene explodes. This is definitely not a horror movie for those wanting mindless slashing and brutality. I would have given this horror movie a 9 or 10 if the ending had a little more power, like the director's previous work, \"Excision.\" But I felt the final scene lacked a little shock value. Other than that, the movie is fantastic...horror, but not typical. If you liked \"Excision,\" you won't be disappointed.",
         "Saw this last night at TAD. It came after one of the best, if not the best, films we've ever seen there -- \"Under the Shadow\". Coming out of \"Under the Shadow\" we said the next show has a tough act to follow. Oh boy! Should have known we were in trouble when they play the director comments and he mock apologized for the angst we were about to feel at the ending. He should have apologized for the whole thing and we should have left right then and there. We suffered for the first half hour of mean, nasty and pointless urban couple bickering. Think of the worst couple conversations you've heard on the subway in the course of your life and you get the idea. It was horrible, but not horror (unless you think \"Heart of Darkness\" where Kurtz sums up the whole African experience for him as \"The horror! the horror!\"). Anyway, the rating sums it up. 1 star because you can't give 0 stars.",
         "I saw not more than 21 movies at the last FANTASIA FEST yet, and nothing (in my opinion) can be compare to TRASH FIRE. I liked the dialogues and the way the characters shout them to each others. But above all that, it's a movie who talk about real peoples problems (like EXCISION and SUBURBAN Gothic), and as a OUTSIDER myself, i really like the place Richard Bates, jr, give them in his fantastics films. I really like HORRORS MOVIES, and you know as i do that HORROR is not in good shape right now. When you watch a horror-comedy with so many goods thing, i say THANKS YOU !! All the actors are amazing, and in my opinion both AnnaLynne McCord and Fionnola Flanagan should receive nominations for theirs unbelievable work as supporting Actress. I just wanna say that i'm anxious to buy the blu-ray, ans i'll be there for your next movie man !!",
         "The trailers for this movie are fantastic. The movie itself is dull and humor less. I caught myself falling asleep 3 times. Trust me, I didn't fall asleep long enough to miss anything good-there was nothing good about this movie except the acting. The actresses who played the girlfriend, the sister, and the grandmother all did very well with the poor material they were given. Especially the actress who played the sister, even though her first scene was nonsense. The writer seems to be trying too hard to offend. But there is nothing here that anyone who would seek out this movie would actually be offended by. It's like Justin Beiber trying to act tough-but not as pitifully amusing. There are unexplained HUGE details that the characters literally don't notice-why are they there? The props guy just having his own fun, or poor editing of the final version? There certainly weren't time restrictions-they could have narrowed down the first 45 minutes of the film into a 10 minute set-up, then had more time to flesh out the actual \"main\" section of the movie. I feel like there was probably a better original vision for this movie that got lost along the way, and I'm disappointed for the actresses involved- they really did turn in fine performances.",
         "If you love black comedy and have lots of time, I will recommend this dark and bright movie.",
         "Good directing and acting. sometimes black, sometimes cynical humor. good cast and decent soundtrack. no shaky camera, thanks. many allusion against christian and church in general . slow but not annoying.",
         "I went into this blind, and I'd suggest doing the same, as it never lets you really get a handle on where the unorthodox story and genre structures are going, which keeps it highly engaging. Dark black humor, some real Horror, and great performances. I'm surprised this didn't get more attention, as it's very well made, and lives up to its name on a few levels. It kind of reminded me of Garth Ennis's early Preacher comics in tone, even moreso than the TV adaptation of that does.",
         "I decided to scan the previous reviews in case there might have been some redeeming quality that I overlooked, but there was no such quality. There isn't even a consensus on how to categorize the film-- is it horror or thriller or drama or comedy or Southern Gothic or all of the above or none of the above? No consensus, because there is no there there. Reviewer John Anthony Mazzei of Cleveland writes, \"The viewer sees all but not the players. Two rounds from a twelve gauge and a wordless epilogue close the movie.\" However, assuming for the sake of argument that there does exist in literature such an self-contradictory device as a wordless epilogue, it's as flimsy and pointless as a Kardashian's see-through nightie. Beatrice, a young interior decorator with the world's worse taste in men, is the long-suffering girlfriend of cynical, sarcastic. pain-in- the-ass, epileptic Owen. After three years of unprotected relations, dumbbell Beatrice is with child, and she compounds her stupidity by badgering Owen that they absolutely have to drive out-of-state somewhere to see Owen's crazy grandmother Violet and crazy sister Pearl, both of whom he hasn't seen in eleven years and does not want to ever see again. After arriving at Grandma's house, even dumbbell Beatrice can understand that grandma and Pearl are not just ha-ha crazy but bats--t crazy, but she and Owen keep hanging around until one day, Pearl splatters the guts of both Owen and Grandma all over Grandma's kitchen with Grandma's own shotgun. Beatrice, cowering on the kitchen floor, survives unscathed, and the twisted pastor of Grandma's church has pulled up to the house in his Lincoln Continental and is lurking outside with a tire iron in his hand. That is the wordless epilogue? What unspoken pearls of wisdom do we learn here? 1. When a healthy, attractive young woman with a career and a nice apartment has the world's worst boyfriend for three years, she should cut her losses and kick him out before she gets knocked up and not wait until she is feeling too old and too attached to start to look for someone better. 2. Like a broken clock, even the world's worst boyfriend is still right twice a day, at least when it comes to his own damn bats--t crazy relatives, and his butt-in-sky girlfriend should learn to butt out and give him at least an ounce of credit. 3. Don't leave a twelve-gauge shotgun around the house for the deranged, disfigured relatives up in Grandma's attic to find. Thing is, moviegoers like me may not mind quirky black humor and dark family secrets of mayhem and murder and deranged, disfigured relatives who stay up in Grandma's attic, but we don't want to sit through it all and then get no resolution or redemption in the end--only people's guts splattered all over Grandma's kitchen and moviegoers scratching their heads. Usually, moviegoers like me can get enough of a hint about where the movie is headed before we see it or at least before we sit through more than the first ten or twenty minutes. Many years ago, before the internet and this website, someone I knew insisted that we had to go to a fantastic new film called Halloween at the mall theater, but as many times as I asked, he would say that, no, he didn't know anything about what kind of film it was or who was in the film but that he knew for a fact that it was a great film that we absolutely had to go see. So we did to the theater, and the house was packed, but within three minutes into the film, I said, no, I'm sorry, I am not sitting through this, you should have told me, and then I got up and left. And unless maybe we are watching a John Waters film-sort of film and know what to expect, we do NOT want to see white-haired, arthritic, Bible-thumping Grandma masturbating herself to a televangelist-—it's as clever and subtle as a pipe wrench. I would though have more respect for writer/director Richard Bates, Jr. if he had cast his own grandmother from real life to play crazy Grandma Violet.",
         "A self destructive bulimic guy and her complaining girlfriend. This girl is not happy after 3 year relationship with his boyfriend and yet she never decided to leave. Why? This guy is having seizures during sex (that's the only funny scene in the whole movie). The grandma is a religious bitter woman with a double moral. The story, the dialogues and the acting is HORRENDUS. The final is pointless. The title of this movie is very accurate."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Horror",
         "Romance"
      ],
      "productionCompanies": [
         "Circle of Confusion",
         "Snowfort Pictures"
      ],
      "summaries": [
         "The obnoxious, cynical and sarcastic web designer Owen lives with his girlfriend Isabelle. Owen has analysis with his psychiatrist Florence since he feels guilty for the fire that killed his parents and deformed his sister Pearl. When Isabelle discloses that she is pregnant, she asks Owen to make up with his only family composed by his estranged grandmother Violet and Pearl. Owen warns Isabelle that Violet is a nasty woman, but they travel to his hometown. They learn that Violet is a despicable woman that keeps Beatrice locked in her room. Isabelle realizes that Owen has told the truth about Violet, but they stay for a couple of days more because of Pearl with tragic consequences.",
         "When Owen is forced to confront the past he's been running from his whole adult life, he and his girlfriend, Isabel, become entangled in a horrifying web of lies, deceit and murder."
      ],
      "budget": 0
   },
   "movielensId": 169250,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-11-03",
      "dvdReleaseDate": null,
      "directors": ["Richard Bates Jr."],
      "runtime": 91,
      "movieId": 169250,
      "title": "Trash Fire",
      "mpaa": "R",
      "actors": [
         "Adrian Grenier",
         "Angela Trimbur",
         "Fionnula Flanagan",
         "AnnaLynne McCord",
         "Sally Kirkland",
         "Matthew Gray Gubler",
         "Ray Santiago",
         "Ezra Buzzington",
         "Molly McCook",
         "Alexa Hamilton"
      ],
      "imdbMovieId": "5076792",
      "originalTitle": "Trash Fire",
      "genres": [
         "Comedy",
         "Horror",
         "Romance"
      ],
      "youtubeTrailerIds": ["gfoujIXCMzc"],
      "plotSummary": "A man forced to confront his past when he and his girlfriend end up entangled in a web of lies.",
      "tmdbMovieId": 362409,
      "avgRating": 3.29167,
      "releaseYear": "2016",
      "numRatings": 12,
      "posterPath": "/hXAy6tbOivPzLqx48nqM6xOCuEt.jpg"
   }
}