{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stand-up comedy",
         "id": 9716
      }],
      "imdb_id": "tt5369246",
      "video": false,
      "title": "Whitney Cummings: I'm Your Girlfriend",
      "recommendations": [],
      "backdrop_path": "/sXzmdhJYx3c6d6ayhYwXIzoXciW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Herself",
            "gender": 1,
            "credit_id": "56a3fb28c3a3683890004576",
            "name": "Whitney Cummings",
            "profile_path": "/pXWWjNHwP0t8DQS70FGzyqz4N5P.jpg",
            "id": 66555,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56a3fb389251410c08001ac8",
               "name": "Marty Callner",
               "profile_path": null,
               "id": 80172,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "56a3fb43c3a368389b003fa7",
               "name": "Whitney Cummings",
               "profile_path": "/pXWWjNHwP0t8DQS70FGzyqz4N5P.jpg",
               "id": 66555,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "56a3fb4fc3a368388e003e39",
               "name": "Whitney Cummings",
               "profile_path": "/pXWWjNHwP0t8DQS70FGzyqz4N5P.jpg",
               "id": 66555,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a3fb58925141720b003d7d",
               "name": "Marty Callner",
               "profile_path": null,
               "id": 80172,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56a3fb66925141720b003d83",
               "name": "Jimmy Miller",
               "profile_path": null,
               "id": 61397,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a3fb77c3a368389e003cb9",
               "name": "Randall Gladstein",
               "profile_path": null,
               "id": 92926,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57e77e5a9251412ae300ef8c",
               "name": "Michael Schultz",
               "profile_path": null,
               "id": 1408987,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.4967,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 379008,
      "vote_count": 3,
      "budget": 0,
      "overview": "The comedian and actor dishes up an hour of audacious adult humor taped in front of a live audience at The Broad Stage in Santa Monica.",
      "similar": [
         35595,
         200133,
         34001,
         31788,
         34497,
         416477,
         34505,
         34512,
         812,
         703,
         49013,
         16290,
         62206,
         270946,
         13015,
         34163,
         23483,
         51828,
         67308,
         34509
      ],
      "original_title": "Whitney Cummings: I'm Your Girlfriend",
      "runtime": 60,
      "poster_path": "/cVvB4kf1Vemb1ryyjTXCwrv1fcK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
         "name": "HBO",
         "id": 3268,
         "origin_country": "US"
      }],
      "release_date": "2016-01-23",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marty Callner"],
      "runtime": 70,
      "synopsis": null,
      "writers": ["Whitney Cummings"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5369246/",
      "coverLink": null,
      "actors": ["Whitney Cummings"],
      "reviews": [
         "Though Whitney starts by engaging the audience as a way for them to relate to her self-deprecating humor — it comes across as rage. What should be a funny trip into role reversal and observational humor ends up as a 59 minute rant about how unfair life is, now that Whitney is in her 30s, has the career that she's always wanted and has money. To quote the Atlantic's Megan Garber, \"To the extent that I'm Your Girlfriend, for all its jokes about porn, ends up scanning, at times, more like a sermon. Or a lecture. Or a TED Talk.\" The full article which dissects why the is special is so uneven can be googled. Use the search terms \"The Triumph of Soap-Box Comedy, Whitney Cummings's new HBO special, I'm Your Girlfriend, often sounds like a TED Talk. It's in good company.\"",
         "I'm a white guy in my late 30th, just to get it out of the way so you don't have to guess. I stumbled on this special while browsing on demand stuff. She was hilarious as a guest on Joe Rogan podcast. It was great. All new stuff. Mature comedian at its best. Completely unexpected twists and turns in the material. I watched her earlier stuff and thought this special was the strongest. Couple hick ups along the way but the quality and originality of jokes made it almost unnoticeable. I don't want to compare her to anybody else, let her stand up speak for itself. Strong 9.",
         "I have always been a big fan of Whitney Cummings. She was unpredictable, bawdy and hilarious. I'll never forget the first time I saw her standup act. How the mighty have fallen! I don't mind a certain level of mean-spiritedness, but Whitney's view of men seems to have devolved, and that's putting it mildly. Sure, there are male morons in the world, and it's perfectly acceptable to mine some humor out of that. But based on this hour, you'd think all of us want to choke her and degrade her in ways I'd never even heard of before. The special starts amiably enough, but it gradually becomes an all-out hatefest, with so much negative preaching and scorn that I began to seriously wonder who green-lit this alleged comedy taping. Forget the punch lines—Whitney would rather punch your lights out.",
         "Someone needs to tell Whitney Cummings that some bitter person is on this show is tainting what moderate success she has had. I have never seen anything this awful. No laughs, this is listed as a comedy. I'd call this a sermon! Ten or so years ago Joni Mitchell wig out like this a put out a bitter rage album. This \"special\" show be called bitter rage. Sarah Silverman just release a special, and it was great, your fans deserve better than this. What were you thinking? Based on you previous material I was suspecting a Lisa Lampanelli type act, this was quite a disappointment. What happened to the beautiful charming girl from \"whitney\" from 3 years ago? Why don't you do a skit on how bad your plastic surgery was.",
         "First off, Whitney is looking awesome! Secondly, she is hilarious. Her blatant honesty is equivocal to the comedy she is performing. First thing I did was look up her IMDb page, and realize that she is 33. I'm 35, so this gives me the interpretation that I can relate to her comedy, and i can. Honesty is something that i find rare, it is a possibility that usually isn't enacted on. Whitney Cummings realizes this, and her comments and her (extremely funny) jokes prove that women are not idiots and there is a gap between what men think is \"sexy\" and what a funny woman know is reality. Comedy isn't an avenue for laughter is a highway.",
         "This was just plain awful. just a bitter rage throughout the entire Sermon, sorry i mean \"Special\" this is what happens when instead of going to therapy twice a week like any other person, you bottle up all your frustrations in life, in this case because of your bad decisions at engaging into a healthy relationship with a man and someone hands you and opened mic opportunity and the rest is just history...bad history nonetheless. So in conclusion some bullet points about this \"special\" CONTAINS SPOILERS * If you hate broke ass men, don't date em' * There is a site called bigtitsboss and it is about female bosses in a workplace taking advantage of their lesser male employees i think you should check that out Whitney it will fulfill that niche you are looking for in porn. * Just because you date a guy that is into some \"nasty\" stuff regarding sex that doesn't mean that all men are into that. generalizing is bad and you should feel bad. * Calling someone Baby in a relationship is not only a man thing. i think it's about the same or even more used by women towards men. * Since when a boob job is a crime against women and humanity?"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": ["Whitney Cummings becomes every guy's girlfriend and riffs on men, women, guys, girls, male/female roles, the male body, the female body, vaginas, dicks, birth control, squirting and selfies."],
      "budget": 0
   },
   "movielensId": 169314,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-01-23",
      "dvdReleaseDate": null,
      "directors": ["Marty Callner"],
      "runtime": 60,
      "movieId": 169314,
      "title": "Whitney Cummings: I'm Your Girlfriend",
      "mpaa": "NR",
      "actors": ["Whitney Cummings"],
      "imdbMovieId": "5369246",
      "originalTitle": "Whitney Cummings: I'm Your Girlfriend",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["g8WKt_5mhLQ"],
      "plotSummary": "The comedian and actor dishes up an hour of audacious adult humor taped in front of a live audience at The Broad Stage in Santa Monica.",
      "tmdbMovieId": 379008,
      "avgRating": 2,
      "releaseYear": "2016",
      "numRatings": 2,
      "posterPath": "/cVvB4kf1Vemb1ryyjTXCwrv1fcK.jpg"
   }
}