{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4228832",
      "video": false,
      "title": "Keith Lowell Jensen: Atheist Christmas",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [],
      "popularity": 0.021413,
      "production_countries": [],
      "id": 306218,
      "vote_count": 0,
      "budget": 0,
      "overview": "Documentary about how an irreverent atheist celebrates Christmas.",
      "similar": [],
      "original_title": "Keith Lowell Jensen: Atheist Christmas",
      "runtime": 58,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-11-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": null,
      "color": null,
      "budgetCurrency": null,
      "directors": ["Keith Lowell Jensen"],
      "runtime": 58,
      "synopsis": null,
      "writers": ["Keith Lowell Jensen"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt4228832/",
      "coverLink": null,
      "actors": ["Keith Lowell Jensen"],
      "reviews": null,
      "genres": [],
      "productionCompanies": [],
      "summaries": [
         "Social scientists have found, time and again, that one of the least trusted groups in North America is atheists. They rank lower than most ethnic and racial minorities, and even lower than convicted rapists. People would rather elect politicians who have done drugs or had affairs than those who might admit they just don't quite get on board with the whole son-of-a-virgin-and-a-terrible-and-swift-God deal. The reason most give is that they can't imagine how an atheist who doesn't believe in a power higher than themselves--a power that can punish them for wrong-doing--could possibly have a moral compass. Science is not miracle enough, they seem to say. Humanity and compassion are not morality enough. December 25th without stocking stuffers that poop candy coated raisins are not celebration enough. And that, ladies and gentlemen, is where Keith Lowell's Jensen's Atheist Christmas Special comes in. Join Jensen as he cozies up in a cardigan and slippers, stepping in from a blustery night backstage to take his place in front of a non-denominational deciduous celebration shrub and jaunts through the American psyche. Are the Whos of Whoville any less inspiring than two rebellious California lesbians? Is a bird exacting instant karma any less miraculous than finding a white baby in the Middle East? Is a church camp counselor any more moral than a confused teenager with an erection that could cut class? Is a hungry tiger tossing an effigy of a human baby into the ol' Easy Bake Oven any more lovely a creature than a 3-year-old with no need for dolls? Are we--gulp--good without God? Keith Lowell Jensen is. In fact, he's f*cking great without God. You'll for yourselves in this hour-long comedy special, fresh outta the Stand Up! Records comedy lab.",
         "Keith Lowell Jensen delivers a true paradox as an Atheist that loves Christmas. Watch him makes jokes about a holiday that many love and also love to hate - an absolutely hilarious Christmas miracle, or the scientific equivalent thereof."
      ],
      "budget": 0
   },
   "movielensId": 169620,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-11-25",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 58,
      "movieId": 169620,
      "title": "Keith Lowell Jensen: Atheist Christmas",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "4228832",
      "originalTitle": "Keith Lowell Jensen: Atheist Christmas",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about how an irreverent atheist celebrates Christmas.",
      "tmdbMovieId": 306218,
      "avgRating": 0,
      "releaseYear": "2014",
      "numRatings": 0,
      "posterPath": null
   }
}