{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1629443",
      "video": false,
      "title": "Foster",
      "recommendations": [
         241432,
         63848,
         79995,
         265347,
         59728,
         180810,
         38986,
         232138,
         239318,
         285844,
         299618,
         69007,
         72002,
         16405,
         319910,
         79935,
         297621,
         32845,
         96246,
         32332
      ],
      "backdrop_path": "/y0CcTwvZugg1ITwwwIe7fbjii1T.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Zooey",
               "gender": 1,
               "credit_id": "52fe48029251416c9107cfdf",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alec",
               "gender": 2,
               "credit_id": "52fe48029251416c9107cfe3",
               "name": "Ioan Gruffudd",
               "profile_path": "/iGJI8szrwaRBd484sGO8OOm1HOH.jpg",
               "id": 65524,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eli",
               "gender": 2,
               "credit_id": "52fe48029251416c9107cfe7",
               "name": "Maurice Cole",
               "profile_path": null,
               "id": 591299,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. Potts",
               "gender": 2,
               "credit_id": "52fe48029251416c9107cfeb",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe48029251416c9107cfef",
               "name": "Anne Reid",
               "profile_path": "/6YgtxvIE1NXZCLMJs4ryQjCiZPI.jpg",
               "id": 77287,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe48029251416c9107cff3",
               "name": "Daisy Beaumont",
               "profile_path": "/tma1ExRB3QvvDHBZagpXKJA9Qr7.jpg",
               "id": 211847,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Samuel",
               "gender": 0,
               "credit_id": "52fe48029251416c9107cff7",
               "name": "Bobby Smalldridge",
               "profile_path": "/pgf2YKHCeLubTKqA81s8UxBGqMK.jpg",
               "id": 591301,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe48029251416c9107cffb",
               "name": "Tim Beckmann",
               "profile_path": null,
               "id": 550550,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Translator",
               "gender": 0,
               "credit_id": "52fe48029251416c9107cfff",
               "name": "Haruka Kuroda",
               "profile_path": "/5SwmhDVe3BEvFsFvYFRDo7xvKsP.jpg",
               "id": 591302,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mrs. Lange",
               "gender": 1,
               "credit_id": "52fe48029251416c9107d00f",
               "name": "Hayley Mills",
               "profile_path": "/aXXiQcIoFp7WywXDOsskfuLkRe3.jpg",
               "id": 36819,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "John Burns",
               "gender": 0,
               "credit_id": "577137a89251411c0d001a11",
               "name": "Jeremy Child",
               "profile_path": "/kdd6OfSGCkEIkyTNBmIVraz2W4t.jpg",
               "id": 158293,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Tom Jenkins",
               "gender": 0,
               "credit_id": "5a2c3dca925141032c1414e8",
               "name": "Barry Jackson",
               "profile_path": "/iQmmsoN6dAkJlorpvFmQGVBRXab.jpg",
               "id": 150864,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Jane",
               "gender": 0,
               "credit_id": "5a2c3de0925141032413bc4f",
               "name": "Jo Wyatt",
               "profile_path": "/mL7v2r4wK9gJjuWRZlLmSWXMWD8.jpg",
               "id": 1237892,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 0,
               "credit_id": "5a2c3deb925141032413bc66",
               "name": "Kenneth Collard",
               "profile_path": "/7w29ibbniZoMEkTYVtsxiNSLamf.jpg",
               "id": 997569,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Doctor IV Clinic",
               "gender": 0,
               "credit_id": "5a2c3dfc92514103261473b7",
               "name": "Kenneth Collard",
               "profile_path": "/7w29ibbniZoMEkTYVtsxiNSLamf.jpg",
               "id": 997569,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48029251416c9107d005",
               "name": "Jonathan Newman",
               "profile_path": null,
               "id": 558177,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48029251416c9107d00b",
               "name": "Jonathan Newman",
               "profile_path": null,
               "id": 558177,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5636173cc3a3681b5401b969",
               "name": "Deepak Nayar",
               "profile_path": null,
               "id": 6223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56361768925141616700c416",
               "name": "Mark Thomas",
               "profile_path": "/1QI1g9bPABLyFg6RtxaY0YGf988.jpg",
               "id": 62086,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5636177b9251414ab7018709",
               "name": "Dirk Nel",
               "profile_path": null,
               "id": 1404147,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56361792925141284c01a74c",
               "name": "Eddie Hamilton",
               "profile_path": "/zAREtOT8DQRuSlQUHXD7PowessH.jpg",
               "id": 49809,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "563617a59251413b4600c81f",
               "name": "Suzanne M. Smith",
               "profile_path": null,
               "id": 1398505,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "563617bcc3a3681b6101b2e2",
               "name": "James Lewis",
               "profile_path": null,
               "id": 1050634,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "563617d59251413b4600c829",
               "name": "Hauke Richter",
               "profile_path": null,
               "id": 1530218,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "563617e8c3a3681b4b018bfb",
               "name": "Debbie Moles",
               "profile_path": null,
               "id": 1018074,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "563617f89251414ad8018eef",
               "name": "Annie Hardinge",
               "profile_path": null,
               "id": 39203,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5636181ac3a3681b5c01c37d",
               "name": "Francesca Payne",
               "profile_path": null,
               "id": 1530219,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56361859925141284c01a76c",
               "name": "Gabrielle Spanswick",
               "profile_path": null,
               "id": 1334812,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "5636188c925141284c01a771",
               "name": "Kirstin Chalmers",
               "profile_path": null,
               "id": 1530220,
               "department": "Costume & Make-Up",
               "job": "Hair Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.966871,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 81232,
      "vote_count": 34,
      "budget": 0,
      "overview": "Some years after their son is killed, a married couple decide to adopt a child. One day a 7-year-old boy, Eli, unexpectedly arrives on their doorstep and things take a strange turn.",
      "similar": [],
      "original_title": "Foster",
      "runtime": 90,
      "poster_path": "/qyZPpl6KOOYkXLNZ8MFtSkwdBf9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kintop Pictures",
            "id": 1490,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Reliance Big Pictures",
            "id": 6583,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "StarLight Films",
            "id": 63607,
            "origin_country": ""
         }
      ],
      "release_date": "2011-02-10",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A family opens its door to a miracle.",
      "adult": false,
      "homepage": "http://www.serendipity-films.com/blog/past-projects/foster-feature/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Newman"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Jonathan Newman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1629443/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE3NTU1OTUyNV5BMl5BanBnXkFtZTgwOTY3MjIwMDE@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "Toni Collette",
         "Ioan Gruffudd",
         "Maurice Cole"
      ],
      "reviews": [
         "I tend not to watch films like this one, but I watched this movie with my two little daughters on Sky this weekend, and it was a good experience. My two little girls did not stop talking the next day about the little boy who showed up out of the blue in their foster parents doors steps with no notice. We did enjoy the way that the movie was written and how the characters interacted with this little boy, Eli, was nicely done. We did notice how Eli's foster mom and dad dealt with each event Eli was bringing to their lives. I am not so sure if I understood some of the negative comments from other reviewers about the film, but being able to watch PG and G rated movies with one's kids, should be a pleasant experience.",
         "See, I think of my self as a tough guy who only watches horror movies. However I loved every part of this film, it will be one of those unforgettable movies. Also I am used to getting bored in the middle of the movie but this one kept grabbing my attention. The movie is about a family who is not able to have a child and their life marriage was beginning to fall apart. Acting was awesome, the plot was awesome and so was every part of this film, at the end it made my eyes tear. I don't really wanna say anything else about the movie so you can enjoy every part of it and be surprised with the events that happen in it. Maybe I am not very familiar wit this genre of movies but I think that the ideas were original and that was what made me like it. Maybe the idea of the box wasn't that brilliant but it was original and very realistic. Oh yea, speaking of realistic, the movie does not seem to be 100% real but it makes you think that it is.",
         "The story centres around a couple who apply for a foster adoption. However, the very next morning after their application, a seven year old boy comes up to their doorstep, all dressed up in a suit, tie and top hat, with all the legal documents in hand. This is an extremely interesting idea and the film does justice to this innovative premise.The scenes in the film following the strange arrival of the child are worth watching. The way the couple reacts and adjusts to this unique child is both heartwarming and humorous. Truly wonderful. Newman's simple and well plotted narrative, his effective screenplay and the talented mix of actors (its got Toni Collette) all come together to tell this interesting tale. Come and watch the story unfold. Mood: Comfort Movie with a good serving of wonder and warmth",
         "I found this on Sky and despite the title which is irrelevant and does nothing to draw any attention to the film, I looked up the title on here and decided to give it a go, despite mixed reviews. I watched it with my teenage son and we both loved it. It was funny and poignant and a little bit of a mystery ;) I liked all the characters, especially Eli! What a delightful little oddity he is. Sure it is reminiscent of other movies such as \"It's a wonderful life\" and it is somewhat predictable, but that didn't detract from it at all for me. It made me cry but on the whole it's a tender experience that leaves you with a very warm glow along with the end credits. It should be re-titled as simply \"Eli\" Whoever called it \"Foster\" was having a very bad day! It's not going to be everyone's taste but sensitive souls like myself will no doubt appreciate where it is coming from.",
         "What a beautiful film! I've just seen it on youtube, it was uploaded yesterday, apparently I've been the second person to stay until the sixth and last part. I hope it stays there for a long time so people can find it and enjoy it as much as I did! Toni Collette and Ioan Gruffudd make an adorable couple, and although both the boy and the surroundings are just almost too quaint to be true (houses, streets, the home, the factory, the shop), the film never feels too unrealistic. Well, there are places like this in Britain and thankfully so. I loved the acting, especially of little Eli played by Maurice Cole, but also of aforementioned grown-ups and Richard E Grant, who I hadn't seen in years. Still as good as he always was. As it was mentioned before by someone, yes, two or three lines in the film were a tiny bit odd, but looking at the whole film they really don't matter.As a viewer you feel how much everybody enjoyed making this film and I certainly enjoyed watching it. I hope it soon will come out on DVD in Europe as well (not only in Australia!) so that more people can see it. Everybody involved in this film: Well done!",
         "Stop calling the young man \"Spooky\" or \"The Creepiest movie child ever\". COME ON!!! Give the guy a brake. How dare you people. You should be ashamed of your self. Cant believe you people don't have anything better to do with your time. Putting down a child. Is it because the word \"ANGEL\" was in the title. WHAT A BUNCH OF JERKS. Get over it. If you don't like the movie just say so. Maurice Cole was remarkable. Good job little man. As for the movie it self. Its a good family movie. Little things in the movie maybe stood out of place. But come on, how many action movies do we watch where Bruce willis or Will smith should have died a hundred times or more and everyone is like what a great flick. So real. This was a great family movie and gives good people hope.",
         "One of the best movies I have ever watched. Very touching story of a family trying to cope with the unfathomable sorrow from the loss of a child. Only to be made worse by not being able to conceive another child. Incredible performance from the boy \"Eli\" (Maurice Cole). Also heartfelt performances from Toni Collette and Ioan Gruffodd. Cannot believe the sad, cynical people who reviewed this movie negatively using terms like \"creepy\" and \"spooky\". Really!? Too bad they all got bogged down in the trivial details of accents and technical issues while missing the whole story being told before them. That unconditional love shown to people will overcome and heal even the deepest hurt and devastation. A lesson that Christ taught us that I fear is lost on the negative reviewers of this movie who could not see past the casting and unimportant details. A tremendous opportunity lost for theses folks. I vote for more movies like this vs. most of the trash that is turned out.",
         "In this day and age it is becoming increasingly difficult to find movies that I can show to my 99-year-old mother. If there is the least bit of profanity or gratuitous violence, she just won't watch any more! So it was wonderful to see \"Foster\" and I look forward to inviting Ma to come and see it. What an amazing little actor is Maurice Cole! Unfortunately, there is almost nothing about him on IMDb - not even his birthdate and so I am still wondering if, as the plot says, he was actually just seven years old when Foster was shot. If he was, then he is amazing! His clear and accurate pronunciation of some quite long and technical words would, I should imagine, put him into the child prodigy category. The only reason we won't see a lot more of him is if his parents decide that that don't want him to fall into the many traps that seem to await child stars. The story is lovely - just nice people doing nice things and attempting to cope with life's challenges and setbacks. The only reservation that I had about the whole movie was the selection of Toni Collette as Zooey. I would love to have seen Sandra Bullock in that role! And why did an Aussie actress have a sort of Scottish accent? Her mother didn't and the film wasn't set in Scotland (as far as I could tell), her husband had his own natural very slight Welsh accent so that was, to me, a distraction because, rather than give the story my whole attention, I found myself wondering about that. Nevertheless, a delightful film that will please Ma and my grandchildren equally.",
         "In Britain during the Recession that affected so much of the world late in the first decade of the 21st century, Zooey and her husband Alec want to have a child, but they can't. They might just have to consider adoption. Zooey runs a children's bookstore with her mother Diane, and Alec runs the toy company his late father founded 50 years earlier. Eli is a 7-year-old boy who lives at Mrs. Lange's children's home. But he is more intelligent than most adults and quite mature, and he dresses like a successful businessman, though he does enjoy toys and other kid stuff. No one else appears to be able to see or hear him as he starts taking to the audience. Though Zooey and Alec are able to see him as they visit Mrs. Lange trying to become foster parents one of the children. While they are told the application will take a while to process, Eli shows up at the couple's door with paperwork filled out and signed by Mrs. Lange. Zooey and Alec go back to Mrs. Lange to make sure everything is okay, and Mrs. Lange is being taken away unconscious in an ambulance. The one employee of the home who can help them doesn't really know about the process but looks at the paperwork and sees nothing wrong. So Eli begins his life with Zooey and Alec. Among his many talents: he can cook. Eli is too smart for school, so he refuses to go after the first day, but he can help Alec at his job. The toy company is in trouble. Tom is very loyal, and he has been there 45 years. But the other workers are worried about being paid. Alec can't get a new loan and the house is already mortgaged, something he didn't tell Zooey about. While in the park, Eli and Zooey meet a mystery man named Mr. Potts who knows what happened in 2007 (there is a room in their house Zooey refuses to let anyone into). Mr. Potts needs money and appreciates Zooey's help. Later, Alec is at the cemetery and Mr. Potts is there too, making sure the gravestones look good. So will there be a Christmas miracle? I should mention that even though the movie had a title related to Christmas when I saw it, it's not really about Christmas. The holiday does come near the end, though. And Zooey and Alec learn a lot from Eli. Maurice Cole is outstanding. There is no way he is seven years old. He comes across as a short adult and shows a lot of intelligence and appeal. Toni Collette is quite appealing, and when she does smile, it's a very nice smile. But she doesn't smile a lot. The other lead actors do quite well also. In fact, everyone does. Even the employee at Legoland Amusement Park who is only there for the paycheck and cares nothing about his job. It's a very worthwhile effort.",
         "Zooey (Toni Collette) is having trouble getting pregnant. Her husband Alec (Ioan Gruffudd) is having trouble with his toy business. They decide to adopted a child. He's a strange little boy. Along with a strange homeless guy (Richard E. Grant), they start to dig up their past tragedy and recover their lives together. There isn't enough magic in this movie. That is the biggest missing ingredient. This is relying a lot on the kid. The directing style isn't helping him any. The level of production is some kind of TV movie. Then there is the unrealism of the toy business. The big orders ending seems more like a high school play. It's a nice sweet story, but there's just nothing great in it.",
         "Child actor Maurice Cole is just a little angel figuratively and literally. Maurice Cole who plays an orphaned 7 year old boy named Eli walks unexpectedly into the lives of married couple Zooey (Toni Collette) and Alec (Ioan Gruffudd) just before Christmas. Zooey manages a children's bookstore with her mother and Zooey's husband Alec owns and operates an old fashioned toy factory which his deceased father opened 50 years ago. Alec has been running into tough financial problems the past two years and his older workforce on the toy factory floor who used to work for his father in their hey days are growing impatient due to business slowly evaporating as are their salaries. Now this little 7 year old orphan boy Eli insists on dressing impeccably each day in a neat dress suit, business tie and a fedora and his knowledge of the world economy and politics is astounding. Eli is as cute as a button and he gradually wins over the hearts and then the souls of the heartbroken couple Zooey and Alec who two years earlier suffered a great loss of their own. This is a story of despair, tragic events, financial turmoil, unexplained miracles and a few angels in the house. It will make you laugh, it will make you cry and it will make you feel loved with a spirit greater than the feeling one gets just by saying those magic words...Merry Christmas. A Christmas themed film with a deserving 8 out of 10 rating.",
         "This was a lovely family movie that tugs at your heart. It made my heart smile. Such good acting with a sweet story. You can feel sadness for this man and wife and feel what they are going through..Who wouldn't want to adopt that sweet little boy. I found this little actor very endearing and did a excellent job playing little Eli...I don't get anyone saying this movie was sappy or the little boy was creepy..I don't know what movie they were watching but this was not it. A movie for the whole family and was tearful in some spots. The idea of the movie was understood and the end will make you smile through the tears...well done cast for a excellent heart felt movie.. I loved it...",
         "I'm not sure how I came to have this film in my collection. I am also not sure that Toni Colette read the script before agreeing to star in this film... or maybe she just needed the cold hard cash. The script is terrible, trying to desperately to be a magical, tear-jerking, feel good movie but failing terribly to even engage. Why didn't casting and the script writers (or even the actors for that matter) communicate on lines? Hearing the lead character (approx 35 years of age) say to an 65+ yr old man \"Don't do this to me, we've been friends for years...I was at your wedding\" Or from another actor (similar age) playing the part of an employee \"I may have been with you for 45 years but I have a family to feed\" its not believable and further spoils any magic that may have been possible. Very few surprises, very little actual drama, conflict, twists or turns... 30 minutes of 'Touched By An Angel' would be more fore-filling.",
         "What a great heart felt Movie. I loved this movie. Eli played such a magical part in this movie. I even cried during parts of it. Thanks so much for making such a caring and heart felt movie. I truly loved the spirit of this movie. I hope to see many more movies like this. They just bring the best out of people. I wish, life could be more like this everyday. The cast of this movie was wonderful. Please continue to make more movies like this. I would love to know more movies with Maurice Cole in them. He is a great little actor. Thanks again for bringing the Christmas Spirit into our lives. More people should live their lives this way and get back to the simple things in life, that truly matter. We need to get back down to earth and get away from all of the electronics, that seem to have taken over our lives. We all need to get back to what family means and cherish the families that we have.",
         "This film is so bad I am considering suing the makers for wasting an hour and a half of my time. It is obviously meant to be whimsical and uplifting on similar lines to\" It's A Wonderful Life\", but it is merely ridiculous and entirely predictable from start to finish. Why do Anne Reiid (English) and Toni Collette (Australian) have Scottish accents? Why is the boy dressed like Alan Bennett? Just...WHY?",
         "I agree with the last guy. I'm not very good at suspending reality and for this reason I'm attracted to films about real life which is what I was hoping for. An otherwise amazing Australian actor doing a shite Scottish accent was the first thing to distract me, but the fact they live in a show-home style mews building in Chelsea with only a failing toy factory and an empty bookshop to finance them is totally ridiculous. Alec saying to an old man 'I was at your wedding,' etc was also plain weird. To top it off the melty-cheese soundtrack and ever-present weepy incidental music made each sensitive moment into a Lassie Come Home vom-fest. The kid Eli is spooky and the fact the mum figure confides her adult problems in him like a marriage therapist is bordering on abuse!! The whole thing comes off like a 'terribly iiinglish' film made with Hollywood in mind by someone who has no clue about our culture but has managed to drag in some of our best actors to make them look like idiots.",
         "I love Toni Collette and rented this because of her however I am very surprised she got mixed up with this film. I'm afraid I cannot give a full review as I had to stop watching at the part where the precocious child gets them to sing together in the car. Not only was this scene totally predictable (as was everything up to this point), but it was \"hide under the sofa\" embarrassing. It stuck me that it had been created in a Hollywood kid-movie cutesy style - lovely clean light, bouncy manipulative music, but it had been 'tuned' to fit the British psyche. However I would have to say that whoever did this does not get the British angle on all this at all. The kid has the mentality of a 50 year old, speaks as no kid on the planet would, and yet elicits the response \"isn't he cute' from Toni Collette. In reality you would be running a mile from this spooky child, and so this request for suspension of disbelief was too much for me. The child himself also appeared to be reading every one of his lines, none seemed to come from him - although given their nature this is hardly surprising. Please bear in mind with this review that I do like a lot of schmaltzy sentimental films - so have no problem with this particular genre, but this is one sick bag too much.",
         "Let me start off by saying when it comes to warm holiday fun family movies there are some that will almost always come out on top and then there are some usually starring b grade sitcom actors that should only have ever made it to the ideas bank. Once you've seen Foster you can make that decision for yourself. Foster is a 2011 film that stars Toni Collette (Muriels Wedding, Mental) as Zooey Morrison and Ioan Gruffudd (Fantastic Four, W.) as Alec Morrison a long time married couple who have been together since high school, both have failing businesses and it seems their marriage if heading the same direction as well. After trying to for a child for a little while the pair end up at a foster care home ready to invest their love. They sit the initial meeting with the carer of the children Mrs. Lange played by Hayley Mills (The Parent Trap, That Darn Cat) and leave. A day or two later there is a knock at the door and one of the children from the home stands waiting to be let in he has the signed documents and a suitcase and is ready to become the newest member of the family. Eli played by Maurice Cole speaks impeccably, dresses miraculously and pretty much knows something about everything and seems to be the perfect child\u0085 Foster is a film made ideally for families, it has it's funny moments as well as its warm moments, sad moments and of course its more than happy ending with a few twists here and there to help it along. The funny thing with twists though in movies is that they can make anything happen. With all its gleeful happiness and touching tender moments there were a few things that it did disappoint me in from the very beginning. The first little niggle for me was the horrible Scottish accent that Toni used throughout the film, it was more than disturbing and sounded so fake, I can't even think of anything to compare it was that bad. The second little annoyance I found was the child, I get he is meant to be some kind of old soul but some of the things he was saying were just laughable and cringe worthy. The script could have been so much better and I'm guessing the budget went pretty much to the starring actors as well as Richard E Grant who plays the local homeless guy who has all the solutions. Apart from a more than predictable ending I think the film could have been very different if someone a little more creative got involved. It really wants to be a film that is filled with magic, unfortunately it's not. I'm not saying that this was a bad film, in fact if you want to watch a film that doesn't have the bad language, no violence just good wholesome family fun then this would be ideal, especially as a Christmas film where all the family are over the conversations and catch ups have ended and its time to wind down. This film also carries the title \"Angel in the house.\"",
         "Ladies and gentlemen, meet the creepiest movie child ever. This kid is a real piece of work. He walks around everywhere in a hat and suit. He watches news channels rather than cartoons. He'd rather read War And Peace than children's books. He uses big words like he'd swallowed a dictionary. He knows more about business than Donald Trump and Alan Sugar put together. He is, in short, a precocious little brat who needs a clip round the ear. But in the misguided world of this director, I supposed he's meant to be 'cute' and 'loveable'. Man, how wrong can you be... We know when we're supposed to be moved by a scene, because the orchestra swells in the background. This is done because the screenplay fails to achieve that aim itself, and so has to resort to emotional manipulation. We get an extended segment in Legoland, of our family going on rides, enjoying the ice cream etc. This is of course, pivotal to the plot and in no way is influenced by Lego dumping a truckload of cash on the producer's front lawn, oh no. We have Richard E Grant playing a tramp, in rather a pointless appearance where he simply stares at fireflies and offers familiar homilies about life and loss. This is a bit rich coming from a dirty hobo who has nothing to his name, other than a twinkling smile. Oh, I forgot to mention the best part. Basically, this weird little lad's foster daddy runs a toy company, and thanks to the recession and his outdated products everything's gone a bit Pete Tong. He enlists the help of his adopted son to save his ailing factory, and what do they come up together? Why, a MYSTERY BOX. What is in the BOX you might say? Well, five random toys. The same toys that no-one was buying before, which were sinking the company. But because they're suddenly packaged in a crate with a question mark on them, the stockists go apesh*t over them. At a five minute board meeting, based on this stupid idea, all the head honchos order 10k, 20k of this product... Despite it being the same tat that WASN'T selling before, just more of it. No-one there must have heard of market research. And then we get a little plug in for Hamley's. NICE WORK GUYS. As for the mother, she's been a sad sack throughout. Why? Glad you asked! She lost her natural born child two years ago in a tragic accident, and since then has been unable to conceive due to the trauma of that incident. Hence the reason they took the freakish kid on in the first place. And as the movie progresses, her new four-eyed charge brings new hope and light to her existence, and she finally learns to love life against. Towards the end of the film on Christmas Eve, we see her throwing up in a toilet... Which by this point, is a feeling I can sympathise with. I know why I felt like vomiting, but what about her? Clue: It wasn't the sprouts. Then, she packages something up, and gives to her husband as an early present with a big grin on her face. He thinks it's a Rolex. INCORRECT. It is something that won't leave you with much time on your hands though (Tee Hee). She then goes to tell speccy the 'good news'... and there, I'm afraid I must close the book on this sorry saga. The ending might have worked in a better movie, but I doubt it. Too many inconsistencies, plot holes, suspension of disbelief etc. needed. Sufficed to say, it's yet another attempt to wring tears out of us, But I'm afraid by now the well is dry. In fact, it was barren to begin with. Some say I'm too cynical. A misery guts. Mr Grumpy. But in a choice between being morose, or losing my dignity being affected by phony, badly written, artificial rubbish such as this, just call me Ebenezer Scrooge. BAH, HUMBUG!! 3/10",
         "Drawing inspiration from \"It's a Wonderful Life\" and urban legends involving giving a ride to the ghost of that girl that was killed after the prom 20 years ago, \"Angel in the House\" as it is known in the U.S. looks like it may have been a Hallmark TV movie in the UK. Quirky Australian Toni Collette dons a heavy Scottish accent and reaches for warmth and pathos but her past characterizations - particularly in the U.S. television show \"United States of Tara\" - make the viewer assume her character isn't crazy from grief but rather just plain crazy. She's married to the standard clueless white male character that now populates every non-action movie since \"Mr. Mom\". Into their disorderly existence walks in a offputtingly polite and well-dressed seven year old who naps a lot and Mr. Potts a homeless drifter who the viewer assumes is secretly a serial killer. While the script follows precisely the trajectory you expect once the basis premise has been established, the desired effect of touching warmth and personal growth never quite comes together. While Collette's awkward characterization of the grief stricken mother is one issue, the weirdness of the visiting foster child and his minder Mr. Pots are perhaps more at fault. The cinematography doesn't help, never has a day at Windsor, England's LEGOLAND looked quite as overcast and as little fun. Also, the father's idea to save his dying toy business is just stupid and fairly cynical. In short, a fairly good film to hate watch but not one to touch your heart.",
         "The only reason I gave this one star was because Toni Colette is in it. This is possibly the worst movie I have ever sat all the way through. As bad as it was through the length of the movie, it GOT EVEN WORSE at the end. Why actors like Toni Colette and Richard E. Grant got involved with this piece of smarmy trash is unfathomable. Toni bravely shouldered her way through this sodden, unbelievable mess, but even she couldn't pull two stars out of me. As another reviewer noted, it like the absolute worst of mindless Hollywood pap, but the film is actually British! Sorry, I don't mean to go on about how awful it was, but I'm still in shock from having watched it. I hope that kid never ever gets another role and, for pity's sake, can somebody please ban that writer/director from movie making?"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Reliance Big Pictures",
         "Starlight Films",
         "Kintop Pictures"
      ],
      "summaries": [
         "Zooey and Alec Morrison are a married couple who are struggling to bridge the painful gap that is developing between them. Unable to conceive, the Morrisons await confirmation of a child to foster. One day, a seven years old boy who calls himself Eli appears on their doorstep quite mysteriously, explaining the foster agency has sent him. The boy is old beyond his years and it becomes apparent that he is the listening ear amongst the couple's marriage breakdown. Eli offers moral support and idealistic suggestions to his foster parents on how to repair and re-kindle their love for each other. The couple begin to rebuild their foundations at home, at work and emotionally until they find the love they once had for each other. But all may not be as it seems...",
         "Looking to adopt a child and unable to conceive a child of their own, the Morrison's lives are turned upside down when a 7 year old boy unexpectedly shows up on their doorstep."
      ],
      "budget": 0
   },
   "movielensId": 169874,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-02-10",
      "dvdReleaseDate": null,
      "directors": ["Jonathan Newman"],
      "runtime": 90,
      "movieId": 169874,
      "title": "Foster",
      "mpaa": null,
      "actors": [
         "Toni Collette",
         "Ioan Gruffudd",
         "Maurice Cole",
         "Richard E. Grant",
         "Anne Reid",
         "Daisy Beaumont",
         "Bobby Smalldridge",
         "Tim Beckmann",
         "Haruka Kuroda",
         "Hayley Mills",
         "Jeremy Child",
         "Barry Jackson",
         "Jo Wyatt",
         "Kenneth Collard",
         "Kenneth Collard"
      ],
      "imdbMovieId": "1629443",
      "originalTitle": "Foster",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Some years after their son is killed, a married couple decide to adopt a child. One day a 7-year-old boy, Eli, unexpectedly arrives on their doorstep and things take a strange turn.",
      "tmdbMovieId": 81232,
      "avgRating": 3.6,
      "releaseYear": "2011",
      "numRatings": 5,
      "posterPath": "/qyZPpl6KOOYkXLNZ8MFtSkwdBf9.jpg"
   }
}