{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "ice hockey",
         "id": 6483
      }],
      "imdb_id": "tt0118764",
      "video": false,
      "title": "The Boys",
      "recommendations": [
         42841,
         149789,
         50538,
         37168,
         76896
      ],
      "backdrop_path": "/lMqu1nGdrDc1hiilDQFcqiR3ArB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed629",
               "name": "Marc Messier",
               "profile_path": "/Abddd6vsjjEm3vrbmwMg5CCQnKl.jpg",
               "id": 86618,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Stan",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed62d",
               "name": "Rémy Girard",
               "profile_path": "/4OXis57mBuJMxqLkQ31uunkEXCe.jpg",
               "id": 38526,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ti-Guy",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed637",
               "name": "Patrick Huard",
               "profile_path": "/UgSNJRU47uRVBPOulrFjvjbUuS.jpg",
               "id": 142995,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "François",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed63b",
               "name": "Serge Thériault",
               "profile_path": "/7gJDPSHU5x4AGEPY7V80Fqfh2s7.jpg",
               "id": 81422,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Roger",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed63f",
               "name": "Michel Barrette",
               "profile_path": "/97XaF3bbzSGBEweLQuBsx3Ewx5y.jpg",
               "id": 79615,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Fernand",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed643",
               "name": "Paul Houde",
               "profile_path": "/eH7oUaeO8ma9cfr2XA32AtYM80O.jpg",
               "id": 553516,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marcel",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed647",
               "name": "Luc Guérin",
               "profile_path": "/hGcyoE4QqXRZC786WlTJxBsthG1.jpg",
               "id": 554829,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jean-Charles",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed64b",
               "name": "Yvan Ponton",
               "profile_path": "/pwTjhp2wnU6BrUV3zAwkZX2rszV.jpg",
               "id": 90477,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Julien",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed64f",
               "name": "Roc LaFortune",
               "profile_path": "/7vwjjbdLKLp1qpTjTyH0U80t2SG.jpg",
               "id": 96596,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Léopold",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed653",
               "name": "Michel Charette",
               "profile_path": "/78Trg93S6Y8271df0ebfv4GwMlm.jpg",
               "id": 234197,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mario",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed657",
               "name": "Patrick Labbé",
               "profile_path": "/qGX8UzePJWCnCVd3BhtvIcBiiZp.jpg",
               "id": 234117,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Boisvert",
               "gender": 0,
               "credit_id": "52fe461dc3a36847f80ed65b",
               "name": "Dominic Philie",
               "profile_path": "/pAAc9f1l9fVNCkVHyzEFxuWQ1zN.jpg",
               "id": 123933,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Cossette",
               "gender": 0,
               "credit_id": "52fe461dc3a36847f80ed65f",
               "name": "Sylvain Giguère",
               "profile_path": null,
               "id": 1045686,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Méo",
               "gender": 2,
               "credit_id": "52fe461dc3a36847f80ed663",
               "name": "Pierre Lebeau",
               "profile_path": "/8XikqPP6igd7UqOcz17B4edeTvh.jpg",
               "id": 224816,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Sonia",
               "gender": 1,
               "credit_id": "52fe461dc3a36847f80ed667",
               "name": "Maxim Roy",
               "profile_path": "/gLO0kYZWaRNFlQsZcVS29xzxaIi.jpg",
               "id": 29880,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe461dc3a36847f80ed633",
            "name": "Louis Saïa",
            "profile_path": null,
            "id": 240071,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.505067,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 42832,
      "vote_count": 9,
      "budget": 0,
      "overview": "Every Monday night The Boys put on skates and leave their troubled lives behind.",
      "similar": [
         11164,
         10414,
         12177,
         10680,
         74387,
         336890,
         11590,
         7304,
         23023,
         12171,
         15198,
         14292,
         184155,
         14163,
         256876,
         17465,
         72993,
         55504,
         417028,
         413361
      ],
      "original_title": "Les Boys",
      "runtime": 107,
      "poster_path": "/3c1NcsbMijuoAMYR2FTkmSHmOZF.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gouvernement Canadien",
            "id": 13304,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fonds de télévision et de câblodistribution pour la production d'émissions canadiennes",
            "id": 13305,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gouvernement du Québec",
            "id": 13306,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Melenny Productions",
            "id": 10260,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Super Écran",
            "id": 11578,
            "origin_country": ""
         },
         {
            "logo_path": "/kcNh09qqR2Pkw1JAzRW4CommrW4.png",
            "name": "Téléfilm Canada",
            "id": 806,
            "origin_country": "CA"
         }
      ],
      "release_date": "1997-12-12",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": "/lh0KN07Qds44GIODICc9TyAogh5.jpg",
         "name": "Collection Les Boys",
         "id": 372479,
         "poster_path": "/n2Nv7Ee8UYdT8TuVQrlvMZDjzHd.jpg"
      },
      "tagline": "Nothing in the world would make them miss their weekly game...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Louis Saia"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Christian Fournier",
         "Louis Saia"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0118764/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MzAwMTYwNl5BMl5BanBnXkFtZTcwMjI1NzgxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Marc Messier, Rémy Girard, Patrick Huard | See full cast and crew »"],
      "reviews": [
         "This film surpassed my expectations. I was not certain what to make of the DVD cover boast of \"earning more than $6 Million in the North American Box Office\" nor the cast of Quebecois actors, of which, I was not familiar with (I was thinking it was Marc Messier, the hockey player and not the Canadian actor in it). \"Les Boys\" is a good slice of life movie that gives outsiders like myself a glimpse into Quebecois culture where hockey is seen as a sanctuary for people of all walks of life. The coach/owner of the team, Stan, puts together an amateur league consisting of a surgeon, lawyer, fast talking real estate agent, a TV producer, auto mechanic, a junkie musician,a policeman and Vern, who is a walking almanac of hockey facts and figures. Many of these men are dealing with difficulties in their everyday lives which include problems with women, money and, in the case of one character, keeping his homosexuality a secret from his team mates. Les Boys band together to help out Stan who has got himself into debt with a loan shark. The film is low budget but what makes it work, and work well, is the chemistry between the characters. They seem very real and the scenes in the bar emphasizes this camaraderie and makes the viewer understand why these men look forward to playing hockey so much and have a love for it that competes with that for their wives and girlfriends. The film does become clichéd towards the last quarter and a friend of mine whose knowledge of hockey would rival Vern's, pointed out how the jersey numbers on the villain's team were those of famous English-Canadian players like Gretzky and the numbers on the Boy's jerseys were of French Canadian players like Mario LeMieux. It's subtle nuances and details which make this film a labor of love for Quebec and the institution of hockey.",
         "I think this is a very well-made and funny film. I especially enjoyed Fern, with his hockey trivia. It's interesting that Yvan Ponton appears in the two best hockey movies ever, this and Slap Shot. I do not agree with the person who said that because they don't have 75 million to spend, that Quebec can't make good movies. \"15 Fevrier 1839\" is an excellent film and proof that you don't have to spend 100 million to make a good picture. Another example would be \"Octobre\" I also can't wait to see \"Comment Ma Mere....\" Les Boys and Les Boys II get two thumbs up from me!",
         "I've seen Les Boys back in 1997 when I was pretty bored of those shoot em up American movies. I've spent a hell a good time. It was pure fun all the way ! A movie about hockey will never be as good as this one. Movies like Mighty Ducks and Mystery Alaska are insults to this sport. In Québec, hockey is a religion. It's our national sport. Unfortunately, you must speak french fluently if you want to understand the jokes. If you do, you won't be disappointed. Les Boys is the story of Stan, a hockey club owner who owes 50 000 $ to a guy named Méo. If he doesn't pay Méo back before the end of the week, he get his legs broken. But Méo finds another way to bargain with Stan as he proposes him to plan a game between Stan's Boys and his own team. But will the Boys accept to help Stan... This movie was full of laughs and gags as the movie explores the characters' private lives. Bob is a ladiesman who needs cash, Ti-Guy is a lonely salesman who extorts money form people by sailing old ugly houses and apartments, Jean-Charles is a gay lawyer who hides his homosexuality, François is a surgeon and Julien is a dope head guitarist. All of these colourful characters create a perfect climax that shows how hard life can get at sometimes and how beautiful it could be at other times. It's a great comedy about friendship, women, hockey and life. Les Boys is part of Louis Saïa's epic saga that continues with Les Boys 2 and Les Boys 3. Overall, a good movie with an excellent (canadian) cast. Have fun watching this different kind of movie.",
         "I happened into this movie one night on CBC. Within a few minutes I was laughing out loud. A strong comedy with a simple, plausable script that never treats itself as any more than it is; One great sports comedy.",
         "I laughed from the beginning to the end. Probably better than th= e french version of Slapshot. It's a great comedy for the hockey fans. In Quebec, the hockey is a religion and it's not a surprise to see Les Boys became = the most popular movie at box-office in Canada. >",
         "This is far from the movie of the year. But still, one can enjoy the adventures of a local hockey team. The jokes are good, even though some are «cliché». The actors are quite good in their roles, especially Patrick Huard and Yvan Ponton. Hockey is part of the French-Canadian culture, and it's not hard to see why this movie was a huge success. I gave it a 7.",
         "Les Boys is certainly not a festival of special effect or flooded by overpaid untalented actor(Hollywood) .Or full of cliché showing top-model with rubber boobies all the way to the end. It's one of these movie you re-watch over and over simply because the character in these movie just seem human. They aren't vampire or robot , they aren't hollywoodian.There's just a bunch of grow-up guy doing different thing in life .From the rich to the poor doped guitarist.On the ice they forget social status and just want to have fun. This is what is so great about this movie.A collection of people from different living but forgetting it on ice.Because on Ice . It's does not matter if you're a doctor or a barman. There's not many movie made in Hollywood with 1 m budget that could rivalize with such movies.Because American don't know how to make good movies with poor budget.The acting is delicate and well measured.The only bemol about this movie it's not destined for everyone.It's was very popular in Quebec .But outside of Quebec a movies about hockey would nor be popular. THis movie was made especially for people made in Quebec.Lot of jokes etc would be only understand by quebecois(e).Because of their special *french* like tabarnak and sti. This is a Movie made for Local.SInce the movie from Quebec are typically a Local business.It's pretty rare to see some of them with uber budget Great movie . a good change from the typical Hollywood madness of today",
         "Sports related movies tend to interest a rather select crowd, unless the script can provide enough diversive character or background development. LES BOYS does so, broadening its appeal, and telling a pretty good story. There's some pretty funny antics, and a few exceptional bon mots. Unfortunately, like most sports films, there's a LOT of cliche and predictability, too. LES BOYS doesn't sink from the weight of this truth, yet it is not helped, either. Pleasant, but not exactly hilarious. The characters are normal, likeable, gregarious folks, who gather to blow off stress via their weekly hockey games. We get to know them somewhat, and enjoy the film much more in the process. It's an easy going movie that'll entertain. Recommended.",
         "I don't understand why this film make it so big in Quebec. It's not so funny, there's only two or three good jokes (Luc Guérin when he says: Je dois pas être beau à voir!) but the rest is just too big, with no surprise. No subtlety. A big deception because the idea was good.",
         "When other countries can invest $70 to 285 millions in a movie production, here, in Quebec, we still have difficultly reaching the $3 millions. Though, since the money is not given easily, we would appreciate, as a public, to see good movies... \"Les boys\" is a predictable story of a hockey team. I don't need to tell you more! It's a \"Mighty Ducks\" version for grown-ups. The style is not worked out, and the cast is just good enough to keep you from leaving the theater. When are we, as a country, stand up and finally find our own style, unique and wonderful? A \"Les boys\" and the up-coming \"Les boys 2\" (it's a sequel!) really tell us that Quebec is not yet ready for this to happen... A poor film: 1 tiny * on 10."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Canadian Government",
         "Fonds de télévision et de câblodistribution pour la porduction d'émissions canadiennes",
         "Gouvernement du Québec"
      ],
      "summaries": ["Ever wanted to know what guys say when they get together? This light- hearted comedy explores the male world through an amateur hockey team. Every male stereotype is analyzed, comically of course."],
      "budget": 3300000
   },
   "movielensId": 1698,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1997-12-12",
      "dvdReleaseDate": "1999-03-16",
      "directors": ["Louis Saïa"],
      "runtime": 107,
      "movieId": 1698,
      "title": "The Boys",
      "mpaa": null,
      "actors": [
         "Marc Messier",
         "Rémy Girard",
         "Patrick Huard",
         "Serge Thériault",
         "Michel Barrette",
         "Paul Houde",
         "Luc Guérin",
         "Yvan Ponton",
         "Roc LaFortune",
         "Michel Charette",
         "Patrick Labbé",
         "Dominic Philie",
         "Sylvain Giguère",
         "Pierre Lebeau",
         "Maxim Roy"
      ],
      "imdbMovieId": "0118764",
      "originalTitle": "Les Boys",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["dQHhinKxC_0"],
      "plotSummary": "Every Monday night The Boys put on skates and leave their troubled lives behind.",
      "tmdbMovieId": 42832,
      "avgRating": 2.85345,
      "releaseYear": "1997",
      "numRatings": 58,
      "posterPath": "/3c1NcsbMijuoAMYR2FTkmSHmOZF.jpg"
   }
}