{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jared Cohn"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Joshua Barclay",
         "Mark Floyd"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3291632/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZGNjNDk0MjgtMTI0My00YmRjLThhNWMtZjRmYTZlNmM4ZTYxXkEyXkFqcGdeQXVyMjIxODA2MTA@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Richard Switzer",
         "Ryan King Persaud",
         "Kayden Kross"
      ],
      "reviews": ["There was nothing really \"Special\" about this movie. Watch this movie if you have nothing else to do. Seriously, I cannot even write about anything that was really \"memorable\" about this movie, only the hundreds to thousands of rubber penises. Everything else was BORING. Or not Realistic. There I had to stretch this out just to make the minimum length of 5 lines of Text required for a Review of a Movie that was definitely nothing \"Special\"."],
      "genres": [
         "Adventure",
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Switzer Entertainment Group",
         "Safier Entertainment",
         "Traplight Pictures"
      ],
      "summaries": [
         "Teen stepbrothers, Danny, a wannabe entrepreneur, and Ajay, an artistic dreamer, pull off an elaborate prank on the last day of school. Caught in the act, they're assigned to a summer mentor: lascivious bar owner, Tyler Lavey. When Tyler enlists the boys to make a delivery to a private party, they unwittingly stumble upon an underground society hiding some very dirty secrets. After Tyler's own niece is taken captive, he turns to proteges Danny and Ajay and former CIA agent Grandma Alice to stage one kick-ass rescue.",
         "Two high school kids mentored by a nightclub owner go on a mission to find their classmate when she is kidnapped by a secret society."
      ],
      "budget": 0
   },
   "movielensId": 169932,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-05-30",
      "dvdReleaseDate": null,
      "directors": ["Jared Cohn"],
      "runtime": 78,
      "movieId": 169932,
      "title": "After School Special",
      "mpaa": "",
      "actors": [
         "Richard Switzer",
         "Ryan King Persaud",
         "Kayden Kross",
         "David Gere",
         "Jackie Moore",
         "David Chokachi"
      ],
      "imdbMovieId": "3291632",
      "originalTitle": "After School Special",
      "genres": [
         "Comedy",
         "Adventure",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Teen stepbrothers, Danny, a wannabe entrepreneur, and Ajay, an artistic dreamer, pull off an elaborate prank—involving a lot of dildos—on the last day of school. Caught in the act, they’re assigned to a summer mentor: lascivious bar owner, Tyler Lavey. When Tyler enlists the boys to make a delivery to a private party, they unwittingly stumble upon an underground society hiding some very dirty secrets. After Tyler’s own niece is taken captive, he turns to protégés Danny and Ajay and former CIA agent Grandma Alice to stage one kick-ass rescue.",
      "tmdbMovieId": 401840,
      "avgRating": 3.25,
      "releaseYear": "2017",
      "numRatings": 4,
      "posterPath": "/8jk3vOYqcISvtIbhxqTmuQ57lw6.jpg"
   }
}