{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "runaway",
            "id": 708
         },
         {
            "name": "girl heroine",
            "id": 11291
         },
         {
            "name": "female protagonist",
            "id": 11322
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "social justice",
            "id": 163118
         }
      ],
      "imdb_id": "tt0089470",
      "video": false,
      "title": "The Legend of Billie Jean",
      "recommendations": [
         53287,
         17362,
         24548,
         27969,
         14441,
         8986,
         47045,
         26255,
         12151,
         51321,
         27590,
         19324,
         75531,
         37296,
         57873,
         40634,
         25330,
         16297,
         12714,
         27150
      ],
      "backdrop_path": "/gEq9WmI8tGwV6XPzJGJ2468cxqA.jpg",
      "revenue": 3099497,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Billie Jean Davy",
               "gender": 1,
               "credit_id": "52fe46929251416c7507c7e5",
               "name": "Helen Slater",
               "profile_path": "/bsejuN5hxhaiRDRuZLWh5ubx9za.jpg",
               "id": 33488,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Binx Davy",
               "gender": 2,
               "credit_id": "52fe46929251416c7507c7e9",
               "name": "Christian Slater",
               "profile_path": "/3ElLWjnvchMS6Q4cIQOK8QNAoMG.jpg",
               "id": 2224,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Putter",
               "gender": 1,
               "credit_id": "52fe46929251416c7507c7ed",
               "name": "Yeardley Smith",
               "profile_path": "/mUbHricJlXDV6I4L2Z7sgCs1kWK.jpg",
               "id": 5586,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ophelia",
               "gender": 1,
               "credit_id": "52fe46929251416c7507c7f1",
               "name": "Martha Gehman",
               "profile_path": null,
               "id": 79007,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lt. Larry Ringwald",
               "gender": 2,
               "credit_id": "52fe46929251416c7507c7f5",
               "name": "Peter Coyote",
               "profile_path": "/5zVvYZxE6T0OeL1iaFBBCzY3QOi.jpg",
               "id": 9979,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Muldaur",
               "gender": 2,
               "credit_id": "52fe46929251416c7507c7f9",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Hubie Pyatt",
               "gender": 2,
               "credit_id": "52fe46929251416c7507c7fd",
               "name": "Barry Tubb",
               "profile_path": "/157Hggb9NMeQei5TTgBntPRuwFe.jpg",
               "id": 11088,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Pyatt",
               "gender": 2,
               "credit_id": "52fe46929251416c7507c801",
               "name": "Richard Bradford",
               "profile_path": "/fGMexQI7Po1AuHO7masqwUWId1P.jpg",
               "id": 1272,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Donna Davy",
               "gender": 1,
               "credit_id": "52fe46929251416c7507c805",
               "name": "Mona Lee Fultz",
               "profile_path": "/vAGgrzuTCoEroneOAThOrP29SZG.jpg",
               "id": 79008,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Lloyd Muldaur",
               "gender": 0,
               "credit_id": "52fe46929251416c7507c809",
               "name": "Keith Gordon",
               "profile_path": "/izPEmoAyZkCBnNFXEBxg03TMnLH.jpg",
               "id": 33054,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Woman in Pickup",
               "gender": 1,
               "credit_id": "52fe46929251416c7507c825",
               "name": "Caroline Williams",
               "profile_path": "/iOwBSdPQ1adtucfm3eyLjmlCVbt.jpg",
               "id": 86923,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46929251416c7507c80f",
               "name": "Matthew Robbins",
               "profile_path": "/oK61i61u3G5zZO5EtXmepY9IxGy.jpg",
               "id": 12677,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46929251416c7507c821",
               "name": "Rob Cohen",
               "profile_path": "/sTJEVeYeaAnCzQ92AmNvveSWwWL.jpg",
               "id": 18878,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53c887420e0a26648d000b5d",
               "name": "Lawrence Konner",
               "profile_path": null,
               "id": 2100,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53c887730e0a26649c000bb6",
               "name": "Cynthia Scheider",
               "profile_path": null,
               "id": 69809,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53c8872c0e0a26648d000b59",
               "name": "Mark Rosenthal",
               "profile_path": null,
               "id": 2103,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53c887520e0a266493000bb9",
               "name": "Craig Safan",
               "profile_path": null,
               "id": 63923,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "53c887610e0a266499000af1",
               "name": "Jeffrey L. Kimball",
               "profile_path": null,
               "id": 904,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "53c887810e0a26649c000bba",
               "name": "Paula Herold",
               "profile_path": null,
               "id": 1342833,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "53c887900e0a266493000bc7",
               "name": "Peter Guber",
               "profile_path": "/ndfEiDJFkjAHojchBDjOshZIxwz.jpg",
               "id": 3804,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "53c8879e0e0a266490000aed",
               "name": "Jon Peters",
               "profile_path": "/g7QUavX05hDboodZulsFF65AVjN.jpg",
               "id": 3805,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "53c887af0e0a2664a0000bc2",
               "name": "Ted Haworth",
               "profile_path": null,
               "id": 12495,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.027158,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15982,
      "vote_count": 58,
      "budget": 0,
      "overview": "Average Texas teen, Billie Jean Davy, is caught up in an odd fight for justice. She is usually followed and harrased around by local boys, who, one day, decide to trash her brother's scooter for fun. The boys' father refuses to pay them back the price of the scooter. The fight for \"fair is fair\" takes the teens around the state and produces an unlikely hero.",
      "similar": [
         449176,
         15472,
         50456,
         376290,
         297762,
         397837,
         293768,
         81250,
         272693,
         43923,
         9880,
         308369,
         286565,
         50479,
         10625,
         4951,
         85350,
         11412,
         2108,
         70
      ],
      "original_title": "The Legend of Billie Jean",
      "runtime": 96,
      "poster_path": "/auRbZDruB9q40ibPURjWZnqVpRz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Delphi III Productions",
            "id": 3088,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Guber-Peters Company",
            "id": 4357,
            "origin_country": ""
         }
      ],
      "release_date": "1985-07-19",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "When you're seventeen, people think they can do anything to you. Billie Jean is about to prove them wrong.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matthew Robbins"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Mark Rosenthal",
         "Lawrence Konner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089470/",
      "coverLink": null,
      "actors": [
         "Helen Slater",
         "Christian Slater",
         "Keith Gordon"
      ],
      "reviews": [
         "Why does everyone knock the Legend of Billie Jean so much? For me, it's one of my favorite 80s teen movies. And it's a good exploration into the concept of vigilante justice as a natural response to not only a cumbersome justice system, but also a discriminatory one. Helen Slater is teenager Billie Jean, a nice girl from \"the trailers\" of Corpus Christi, Texas. When Hubie Pyat (Barry Tubbs) and some other local pranksters trash her brother Binx's (Christian Slater) motor scooter, she demands compensation. But Hubie refuses to pay and his father uses the opportunity to offer that Billie Jean trade some sexual favors to him for the cash. In the midst of her flight from the pervert, there's scuffle, and Mr. Pyat is accidentally shot. So, Billie Jean, her brother, and two friends involved in the accident, suddenly finds themselves on the run from the police. Rather than surrendering, they use their new teenage fugitive status to stage something of a protest (\"fair is fair\"), and Billie Jean becomes their hero and icon for teenage rebellion as well as feminism. They become the martyrs of teenagers while the adults dismiss the entire thing as a bunch of rambunctious teenagers gone out of control. So, there is political significance in the story of Billie Jean in looking at the criminal justice system (although some of the discrimination against Billie Jean such as denying her any sort of expedited compensation occurs as a result of the system not intervening at all). If Billie Jean was an adult, would she have been taken seriously? What if Billie Jean were a male? Would that change the situation. Indeed, this movie suggests that it would. In a decade filled with themes of teen angst, this one offers one story of the possibility of teen (and female) empowerment in a way that Pump Up the Volume or other movies like that did. I always thought it was a pretty good 80s movie and one that, judging by the message boards, still caters to a loyal audience as many of those long-lasting 80s movies do. Plus, as far as important 80s movie characteristic go, it's got good actors (Helen Slater, Christian Slater, Peter Cyote, and Kieth Gordon), and a good soundtrack (featuring Pat Benetar's \"Invincible\" and the Divinyls).",
         "I saw this movie when I was a kid, and it instantly became one of my personal favorites. Helen Slater's performance is unforgettable about a young girl and her instant rebel/outlaw status. This is definitely a cult favorite, and appropriately so. For some undescribable reason, this film grabs at you in a way that most movies never do. You seem to care a lot for Billie Jean, and want her to get the justice she deserves. Every rebellious youth should see this film so they can see what happens on both sides of the law, and for a highly entertaining movie. Full of 80's music (especially the kick-ass Pat Benatar theme song), The Legend of Billie Jean is truly a remarkable film that was overlooked by too many people for its brilliance.",
         "I can't believe I've never watched this show before when I was younger. I just saw it on cable. I won't say it has the best plot, story, characters or anything, but there's just this mysterious element that draws us to Billie Jean. All those kids in the film were incredible. My father was watching with me he smiled when he saw that little boy who sent the tape to the police. How cute! This film does reflect some truths. Some adults simply think that fairness is not for kids. Children are not entitled to justice. But few do stand up against this false belief. That is why Billie Jean is a heroine. To add, Helen Slater is just so beautiful.",
         "The Legend of Billy Jean (1985) was one of your typical 80's movies. It's hopelessly dated but back in the day it was a real hoot to watch on T.V. The story is about two siblings that cross paths with some older punks. Billy Jean is the name of the main character(Helen Slater, looking good) and she tries to fight for what she believes is right \"Fair is fair!\" He brother is played by the infamous Christian Slater (sans Jack Nicholson accent). They some how come across a lecherous sleaze ball and get into all kinds of shenanigans. It has to be seen to be believed. You also get co-star appearances from Yeardly Smith (Lisa Simpson) Keith Gordon, Dean Stockwell and mondo footage from Jeanne D'Arc. You can't say you're a true fan of 80's flicks until you've seen this one. Recommend for nostalgia purposes. Factoid: Carolyn Williams (Texas Chainsaw Massacre II) makes a quick appearance as a woman who spots Billy Jean.",
         "Some days I just want to take it easy and remember the good old days when I was a teenager and had no real problems. This film takes me back 20 years, when in the heat of the summer night we used to sneak out the 2nd story window to adventure and excitement. The acting is believable, characters well cast and film nicely shot. Its a getaway for forty something women, with an awesome but not egotistical heroine, a solid loyal sibling and a sweet sincere romantic guy that we all dream of meeting someday. The song \"Invincible\" from the soundtrack by Pat Bentar stirs up even more memories of a time when MTV was young and the short hair cut was a sign of rebellion and the contrary move for strong young women. Thank god I grew up in a time when I didn't have to tattoo my body or pierce my face to show I was tough or different or independent.",
         "I don't understand why this movie wasn't more better received. After the Supergirl fiasco, this movie should have made Helen Slater's career. She plays a small mid-western girl with a younger brother (Christian Slater- not her real brother) constantly being harassed for being poor. When the motor bike is trashed and vandalized, she goes to the future criminal's father for the repair fee, but the guy is worst than his son. He blames her for a crime that never happened and even profits from the media coverage of her pursuit. Peter Coyote is the police investigator who believes her and sticks by her side even when a rich kid (Keith Gordon) fakes his kidnapping to follow her and irk his father (Dean Stockwell). It's a great movie and great script excelled even more by the voice of Pat Benatar. Ten stars !",
         "In Texas, the hot teenager Billie Jean Davy (Helen Slater) lives with her brother Binx (Christian Slater) and her mother in a trailer. In a hot day, she rides with Binx on his scooter to swim in a lake. However, the bully Huble Pyatt (Barry Tubb) steals the scooter with his friends. Billie Jean goes to the police but Detective Ringwald (Peter Coyote) does not give much attention to her. When Binx tries to retrieve his scooter, Huble trashes the scooter and beats Binx up. Billie Jean goes with her brother Binx and her friend Ophelia (Martha Gehman) to the store of Huble's father Pyatt (Richard Bradford) with the repair bill and the old man lures Billie Jean and brings her to his office. Then he harass and tries to rape her. Meanwhile Binx finds a gun in the cash register and her accidentally shoots Pyatt. Billie Jean, Binx. Ophelia and their teenage neighbor Putter (Yeardley Smith) flee from Ophelia's car. They meet the teenager Lloyd (Keith Gordon), who is the estranged son of the D.A. Muldaur (Dean Stockwell), he proposes to be their \"hostage\" so that the runaway teenagers could get some money for their journey. When Billie Jean watches Otto Preminger 's \"Saint Joan\" at Lloyd's television, she cuts her hair short and makes a video with her explanation and demands, becoming and icon worshiped by the teenagers. Meanwhile Detective Ringwald finds the mess, he realizes that he should have listened to Billie Jean and tries to fix the situation. \"The Legend of Billie Jean\" is a super-cult movie from the 80's and maybe Helen Slater's best film in her career. The plot entwines action and drama and it is delightful to watch. In the 80's, many viewers believed that Helen Slater and Christian Slater were siblings since they have the same last name. The story of a wronged teenager that cuts her hair in Joan of Arc's style and becomes an idol of the youth has not aged and is still wonderful to watch. My vote is eight. Title (Brazil): \"A Lenda de Billie Jean\" (\"The Legend of Billie Jean\")",
         "The British historian E. J. Hobsbawm developed the idea of the \"social bandit,\" the peasant youth who becomes an outlaw after his honorable resistance to some outrage by the landlord ends with a landlord henchman dead. He calls to others who share his anger at injustice to follow him to the hills where they will lead the outlaw life, stealing only from those whose wealth comes from oppressing the poor, respecting the peasants and righting wrongs on their behalf, and seeking to restore a former condition when the great and powerful behaved decently and treated the poor equitably. (This equitable treatment is also close to what E.P. Thompson called \"the moral economy of the poor:\" the Honest Loaf, the Fair Day's Wage for a Fair Day's Work--a slogan of early labor unions--etc.) The social bandit *isn't* a revolutionary--he has no vision of a transformed society, because his horizons are too narrow. He wants the Good Old Days back. He doesn't have a social or political theory; he wants simple decency and justice. He isn't Joan of Arc, fighting to restore a legitimate King, he's much closer to Robin Hood, resisting the oppression of a King who's forfeited the loyalty of the people by not acting as a good King should. Billie Jean is a social bandit. The events that launch her \"career,\" the actions she performs, and above all her simple watchword \"Fair is Fair\" clearly put her in the category that includes the Brazilian Lampiao, the Sicilian Salvatore Giuliano, and others. Hardly surprising, since this teenage cult script was written by a formerly blacklisted old Lefty in his seventies, Walter Bernstein, who surely had read Hobsbawm and Thompson and found, I think, a very ingenious way to illustrate their ideas in a 1980's US setting.",
         "This is my favorite movie of all time.I love the story of independence and standing up for whats right,not taking no for an answer.I love the outlaw feeling that you get from this movie.It made me want to cut my hair.Helen Slater does an outstanding job portraying this role, and could Christian be any cuter? I realize I was born the year this movie came out but I love it regardless.I watch it every chance I get.Besides I'm stuck in the 80's anyway.I envy Billie Jean.She's so cool! One day I want to visit Corpus Christy. When I was younger I use to want to be Billie Jean. She was my idol.I understand she is a fictional character but shes just so dang cool.",
         "Besides having an awesome soundtrack, the movie is probably the only movie that has made me a cult follower for it. Billy Jean is a woman who empowers herself through her innocence. The fact that she has such an unique attitude towards such a critical moment in her life is amazing. I first saw this amazing movie about four years ago when it happened to be on TV. I sat and watched it, for lack of something better to do. I am glad I did. This movie has had such a dramatic effect on my personal life. No matter how goofy this sounds, I have come to realize that you have to make the best of a bad situation. Definatly two thumbs way way up as well as however many stars I can give it. And whoever can figure out how I can meet Helen Slater gets a cookie- she is one of my all time heroes!",
         "I love this movie the very first time I watched this movie I was 12 years old (almost 12 years ago-sh*t I'm getting old) But any way If you haven't seen this movie please rent it, trust me. My best memories of this movie, every time me and my best friend had a slumber party we would beg my mom to rent it for us, we picked our men out of this movie she liked Christian Slater and I picked Keith Gordon",
         "This is an excellent movie for young people, in general. It shows how one has to fight for one's principles, as it's the case with Billie Jean, a girl living in the Texas coastal town of Corpus Christi. As directed by Matthew Robbins, this film will never cease to amaze. After he brother's motorcycle is trashed by a group of rough teenagers. Billie Jean wants the father of the boy who gave a beating to her brother, to pay for the repair of the bike. This is a man who, knowing where Billie Jean comes from, tries to abuse the girl sexually. He doesn't know who he is messing with. The movie deals with the way Billie Jean goes about in getting her revenge against all odds. In doing so, she becomes an instant celebrity to the young population in the area, who easily identify with the wronged girl and make her a folk hero. Helen Slater makes a sunny appearance as Billie Jean. She is a girl who believes in justice, and demands it from the man who wanted to take advantage of her. A young, blond Christian Slater is Binx, the young brother. Peter Coyote is also seen as the chief of police who Billie Jean goes to present her complaint, but doesn't have enough sense to pay attention to her. Never underestimate a determined woman who is wronged. Whoever thinks otherwise will probably get his own Billie Jean to her point.",
         "love this movie its a true classic, but would love a remake, I don't know if it will be possible? Helen slater was born to do this movie and Christian slater was excellent, and Yardley smith was SO cute, especially with that long hair, if you have not rented this movie then you need to. a true classic 80's film. The Music was great especially Pat banter song for the movie, and the fashion was so 80's I love the way they had all the girls in the movie following Billie Jean's style. Its almost like its a story torn out of the headlines of today but with a twist of some sort. I think this movie should have done a little more better at the box office then it did. but it was great anyway.",
         "Thanks to the nature of HBO, et al, I have seen this movie about a half-dozen times. I saw it when it first hit cable and as recently as last month. It's just as laughable and ridiculous as ever. The movie is full of one-dimensional characters. The cop with a heart. The parent(s) who beat their children. The spoiled rich kid (actually, two of them). Throw in dozens of teenagers who run an Underground Railroad, cheering on the poor kids from the trailer park while driving brand new cars and wearing expensive clothes for good measure, ridiculous dialogue, allusions to Joan of Arc (for going on the lam?) and mostly uninspired acting and you get LBJ. There are only two reasons for whatever attraction this movie had: Christian Slater and a good soundtrack. Besides Christian Slater (in rare, pre-Jack Nicholson-obsession mode), the rest of the cast is ordinary or worse. Helen Slater is beautiful but not terribly compelling. Peter Coyote decided to use one facial expression during the entire film. Keith Gordon is boring as the nice rich kid. Billie Jean's two friends are parodies of deep-south trailer park denizens (and why are they the only two with back-woods accents? Helen Slater's accent is mild and Christian Slater didn't even attempt one). Their stereotyped performances (and their parents) undercut the film's egalitarian theme. Even the source of conflict between Binx and the bad rich kid is silly; he's attracted to Binx's sister and he trashes the brother's bike? Does that make sense? I guess it makes as much sense as a cottage industry springing up overnight for a teenager accused of shooting someone and on the run. The funniest scene for me was when she shows up in the sewer or some type of damp, dank warehouse, and there's about a hundred or more teenagers there to give her a standing ovation. Yeah, that's where I hung out when I was a teenager in the early 80s. Hopefully she enjoyed the ovation -- it was the only one she got in connection with this film. If you want to see teenage rebellion movies, '80s style, I'd recommend Footloose. The conflict is less contrived and far more believable than this movie, and the characters are more complex and interesting.",
         "I still remember back in 1985 when they filmed \"The Legend of Billie Jean\". There was Magic Isles a fun little amusement park that shut down and after a couple years is now a go-cart and mini golf place. The other mini golf place is not around anymore. Then there is Sunrise Mall (in the movie was called Ocean Park Mall). Back in the 80's that mall was cool and was the mall everyone went to hang out. And now it's a real dump now. The Dockside is still around but now there is a freeway in front of it. The other scenes the filming at the beach. The Corpus Christi Country Club, the Port, and downtown. It shows how Corpus Christi was in the 1980's. It was a good movie but they should have beat up Mr. Pyatt at the end.",
         "I saw this movie on t.v. I was watching it with my sister and we loved it it came on like three time so we watched it again. I can't see how anyone couldn't like it. I've read alot of bad comments about it but it was soooo good. Keith Gordon is hot!",
         "It just doesn't make much sense to stop printing a cult classic from the 80s when they're are plenty of trashy films out their making it onto DVD, and sometimes re-released into the theaters. I mean, if I can find a movie like Ice Pirates on DVD, shouldn't \"Billie Jean\" on the list also? I mean what are we paying these guys for anyway? This has been an all time favorite of mine ever since it came out in 85. I wish there was some way to convince the movie industry to start making some effort on restoring these nostalgic cult classics the same way they do with all the other classics. Maybe these movie critics are just getting paid too much to write reviews on these cut-rate films and really aren't paying attention to the quality of cinema. Well, I suppose we'll just have to rely on VHS to relive our memories.",
         "This movie has to be among the absolute worst from 1980s Hollywood that was responsible for producing some of the least watchable movies ever. With the exception of the soundtrack, there is absolutely nothing redeeming here. I watched it simply because it was on TCM's \"Underground\", and had heard it referenced on VH1's \"I Love the Eighties\" as the butt of quite a few jokes. After viewing it, I can see why it was ripped so mercilessly. There is less acting in this movie than in an Ed Wood feature, and without the originality, or camp, that his films were full of. Time spent watching this flick would be better spent reading warning labels on household cleaning fluids.",
         "I sort of look at this film as a cult classic. I see it as sort of a 1980s Rebel Without A Cause. Helen Slater is another actress who has really never been given just credit. She made her film debut the year before in Supergirl and it was a film everyone made fun of. I don't think thats fair to her, because she is a fine actress and proves it here. Unlike James Dean's character, she does \"have the right to be angry\" and fights back against a corrupt system. Some people may say this film condones vigilante activities, but I think this is a film with a positive message. I also loved Pat Benetar's song \"We Will Be Invincible\", it should have gotten an Oscar.",
         "Feisty lower-class teenager Billie Jean (a strong and charismatic performance by Helen Slater) and her brother Binx Davy (a solid and likable Christian Slater in his film debut) become celebrity fugitives after a dispute between affluent jerk Hubie (a perfectly obnoxious turn by Barry Tubb) and his no-count father Mr. Pyatt (a splendidly slimy portrayal by Richard Bradford) about Hubie trashing Binx's scooter gets out of hand. Director Matthew Robbins keeps the engrossing story moving along at a quick pace, vividly captures the humid atmosphere of rural Texas, and manages to prevent the potentially campy story from degenerating into totally laughable kitsch. The astute script by Rick Rosenthal and Lawrence Konner offers a pointed and powerful social commentary on how the rich exploit and push around the poor and disenfranchised, the way the media can mold someone into a martyr, and the basic necessity to see that justice gets served after something wrong goes initially unpunished. This film further benefits from fine acting by a tip-top cast: Yeardley Smith as excitable third wheel Putter, Keith Gordon as the helpful Floyd, Martha Gehman as loyal gal pal Ophelia, Peter Coyote as sympathetic cop Lt. Ringwald, and Dean Stockwell as Flloyd's estranged bigwig politician father Muldaur. However, it's Slater who really keeps this picture on track: She looks absolutely stunning with close-cropped hair and brings a fierce conviction and winning sense of pure integrity to the character of Bille Jean that makes her real easy to root for and side with as she becomes a symbol of defiant rebellion and female empowerment to the adolescent public at large. Jeffrey L. Kimball's slick cinematography provides a neat polished look. Craig Safan's moody score and the pumping rock soundtrack both hit the stirring spot. A super cool movie that's deserving of its avid fan following.",
         "Barry, my man, I could have wrote your review. I also saw \"Billie Jean\" as a kid, and it blew me away. I loved her toughness, resolve, her cynical edge, the way she didn't take crap, and the way she had no fear. Everything that I felt I DIDN'T have at the time that I first saw it. I was living in a dysfunctional home, and those were qualities I was definitely NOT allowed to have. I suppose I idolized Billie Jean for those traits. She also had friends who stood behind her and had her back. I felt I didn't have that, either. Funny how movies move you, and how they keep you going through life. Oh, funny story. The only movie channel my family ever had was HBO. \"Billie Jean\" was NeVeR on HBO!!! Or, if it was, I never had the chance to record it. So, it was finally on Cinemax. I asked a friend's mom if she would tape it for me. ROFL They soooooooo thought I was weird!!! Years of wanting to get in on tape, and now ten years later I still have it. :) Ciao",
         "THE LEGEND OF BILLIE JEAN is a cute film that stars Helen Slater as a Texas teenager who winds up hiding from police when her brother (played well by an unrelated Christian Slater) accidentally shoots a local businessman, and before long, she becomes the talk of the town. The movie has a great theme song by Pat Benatar and good casting, including Yeardley Smith in a pre-Simpsons role and Keith Gordon as an independent filmmaker. But, the movie does have its weak points. The video statement that Helen Slater makes is sometimes just too much, and the plot is predictable. In the end, LBJ is an average film that could have been better, but on the bright side, it has great moments. 3 out of 5",
         "God, from Helen Slater's rebel Joan of Arc haircut to Pat Benatar's brilliant theme song \"Invincible,\" this movie is so-o-o self-righteous in its \"Don't doubt the children\" message that you'll almost forget that it's about kids fighting a man over a broken dirt bike. Basically, the movie now works as a trivia footnote. This was Yeardley Smith's biggest actual performance, before she became the \"voice of Lisa Simpson\" and did that cameo in \"As Good As It Gets.\" Here she plays a mousy young girl who finds her own independence and her own short, rebellious haircut through her admiration of tortured teen-turned-media goddess Billie Jean (Slater). Also, Christian Slater, whom I don't think is actually related to Helen Slater, plays Billie Jean's troublesome-with-all-sorts-of-misguided-anger brother, whose dirt bike problems cause the whole movie to begin with. Keith Gordon, who played the guy who had the demon-possessed car in \"Christine\" and the guy with the demon-possessed father in \"Back to School,\" gave up on acting shortly after this and became a pretty good director. My biggest problem with this movie is that it loses its message in the course of showcasing misunderstood youth. By the time Billie Jean starts throwing money at people and they burn theme T-shirts of her in effigy, I was confused. Was the point that Billie Jean wasn't a heroine? Was the point that all she wanted was fair treatment and didn't get it? Are we to believe that this is the only way kids can be understood, if they go on some rampage and fake a kidnapping? What does the film say about kids in general? What underlying themes are we, as an audience, supposed to carry away from this film? The only thing it seems to conclude is that it's really cool and really rebellious to get a short haircut.",
         "I have seen this movie so many times it's ridiculous. I have never rented it, but I know all of the lines because it comes on so often. I forced my husband to watch it with me once, and now he has to watch it whenever it comes on. After seeing this movie once it becomes strangely addictive. It's not even that good. It's actually very cheesy, especially when the movie compares Billie Jean to Joan of Arc. But it's a perfect example of a great 80's movie. The music is good and very catchy. Plus, it features a young Christian Slater. And remember, \"fair is fair!!\"",
         "I'm only 19 years old but I consider The Legend of Billie Jean one of my all time favorite movies. The whole meaning of the movie is awesome and really gets to you. This is one movie that will soon be in my own video collection because I want to share it with my children and future generations."
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Gomillion Studios",
         "Delphi III Productions",
         "Guber-Peters Company, The"
      ],
      "summaries": [
         "Average Texas teen, Billie Jean Davy, is caught up in an odd fight for justice. She is usually followed and harrased around by local boys, who, one day, decide to trash her brother's scooter for fun. The boys' father refuses to pay them back the price of the scooter. The fight for \"fair is fair\" takes the teens around the state and produces an unlikely hero.",
         "A Texas teenager cuts her hair short and becomes an outlaw martyr with her brother and friends."
      ],
      "budget": 0
   },
   "movielensId": 170303,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-07-19",
      "dvdReleaseDate": null,
      "directors": ["Matthew Robbins"],
      "runtime": 96,
      "movieId": 170303,
      "title": "The Legend of Billie Jean",
      "mpaa": "R",
      "actors": [
         "Helen Slater",
         "Christian Slater",
         "Yeardley Smith",
         "Martha Gehman",
         "Peter Coyote",
         "Dean Stockwell",
         "Barry Tubb",
         "Richard Bradford",
         "Mona Lee Fultz",
         "Keith Gordon",
         "Caroline Williams"
      ],
      "imdbMovieId": "0089470",
      "originalTitle": "The Legend of Billie Jean",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Average Texas teen, Billie Jean Davy, is caught up in an odd fight for justice. She is usually followed and harrased around by local boys, who, one day, decide to trash her brother's scooter for fun. The boys' father refuses to pay them back the price of the scooter. The fight for \"fair is fair\" takes the teens around the state and produces an unlikely hero.",
      "tmdbMovieId": 15982,
      "avgRating": 3.21429,
      "releaseYear": "1985",
      "numRatings": 14,
      "posterPath": "/auRbZDruB9q40ibPURjWZnqVpRz.jpg"
   }
}