{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "insect",
            "id": 332
         },
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "butterfly",
            "id": 156096
         },
         {
            "name": "rainforest",
            "id": 180550
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "insectarium",
            "id": 198518
         }
      ],
      "imdb_id": "tt0313300",
      "video": false,
      "title": "The Blue Butterfly",
      "recommendations": [],
      "backdrop_path": "/wbkguifivyqP0in4foDgugcGBp2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe44c4c3a368484e035bd7",
               "name": "Marc Donato",
               "profile_path": "/jdP3gZVywVFLljMtRO2rEJNv9Mv.jpg",
               "id": 112600,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Teresa Carlton",
               "gender": 0,
               "credit_id": "52fe44c4c3a368484e035bdb",
               "name": "Pascale Bussières",
               "profile_path": "/vbfCShcj8n0eUOoKRCAGNh1auFY.jpg",
               "id": 54818,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alan Osborne",
               "gender": 2,
               "credit_id": "52fe44c4c3a368484e035bdf",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Alejo",
               "gender": 2,
               "credit_id": "52fe44c4c3a368484e035be3",
               "name": "Raoul Max Trujillo",
               "profile_path": "/vkrPv04OJRV9G6u6yydjJz2WKE0.jpg",
               "id": 17688,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Presenter",
               "gender": 2,
               "credit_id": "594fe63e925141312704e154",
               "name": "Steve Adams",
               "profile_path": "/xjh3xEFrkF94LTvxqIwqP2ca7l6.jpg",
               "id": 66934,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jana",
               "gender": 0,
               "credit_id": "56916db1c3a36802e200076d",
               "name": "Marianella Jimenez",
               "profile_path": "/xAQ4TonFKRZjwiaTYkyO2TrB5XZ.jpg",
               "id": 1560822,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44c4c3a368484e035bd3",
               "name": "Léa Pool",
               "profile_path": "/6JiOwi9DAiBLpYVg1eMUjEc9LQh.jpg",
               "id": 135534,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "530facdd925141100800001e",
               "name": "Pete McCormack",
               "profile_path": "/uALgpfh7pnBlIiKwEhjwbF0zVxF.jpg",
               "id": 81502,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.076671,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 25379,
      "vote_count": 7,
      "budget": 0,
      "overview": "Based on a true story, The Blue Butterfly tells the story of a terminally ill 10-year-old boy whose dream is to catch the most beautiful butterfly on Earth, the mythic and elusive Blue Morpho. His mother persuades a renowned entomologist to take them on a trip to the jungle to search for the butterfly, leading to an adventure that will transform their lives",
      "similar": [
         858,
         112160,
         141,
         634,
         242224,
         297762,
         258480,
         43923,
         437557,
         27586,
         2771,
         9587,
         3134,
         11236,
         13075,
         9813,
         12793,
         5781,
         45153,
         342737
      ],
      "original_title": "The Blue Butterfly",
      "runtime": 97,
      "poster_path": "/wXJwzWH7wXir7sDgGy5Gs18rta1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Global Arts Productions",
            "id": 20466,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Palpable Productions",
            "id": 2893,
            "origin_country": ""
         },
         {
            "logo_path": "/zCUGLv6QxlEHngDCwlVolTZu8kF.png",
            "name": "Galafilm",
            "id": 4896,
            "origin_country": "CA"
         }
      ],
      "release_date": "2004-02-20",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Léa Pool"],
      "runtime": 97,
      "synopsis": "Inspired by a true story, The Blue Butterfly is about ten year-old Pete Carlton (Marc Donato) who is diagnosed as terminally ill and his determined mother will stop at nothing to ensure her sons dream. Funny and intelligent, yet somewhat shy, Pete is stoic and incredibly courageous when it comes to his condition. He seeks refuge by observing the miniature world of cocoons and insects that he collects. Given only months to live, Pete has one wish; to catch the most beautiful butterfly on earth, the legendary Blue Morphothe Mariposa Azul, a magnificent creature found only in the tropical rain forests of Central and South America. He is convinced that this butterfly with the azure wings can reveal the mystery of life to him. Teresa Carlton (Pascale Bussieres) is Petes single mother. She is brave, worn out, consumed by love and sorrow for her dying son, and determined to overcome any obstacle that stands in the way of his dream. She begins by convincing Alan Osborne (William Hurt), a renowned entomologist and Petes hero, to take them to the jungle. Alan is a passionate, rugged yet vulnerable man who, due partly to a secret that haunts him, prefers the company of insects over people. He is initially dead-set against this idea. But, thanks to Petes determination, and his talent as a manipulator, his hero finally agrees to go along with the idea. However, since the Blue Morpho season is almost over, Alan will only give Pete a couple days to try to capture the magical butterfly. The Blue Butterfly is about the coming of age of a young boy and a mature man who both must learn to emerge from their protective cocoons to live life to the fullest.",
      "writers": ["Pete McCormack"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0313300/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjAxNzYyMjU4MV5BMl5BanBnXkFtZTcwMDgyMDUyMQ@@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Marc Donato",
         "William Hurt",
         "Pascale Bussières"
      ],
      "reviews": [
         "I didn't know what to expect from this movie and the longer I watched it the more enjoyable it became. William Hurt does a wonderful job but Marc Donato steals every scene he is in. Everyone in the cast does an excellent job and bring the film to life. The Canadian director and her crew have certainly established themselves as premier movie makers. There is some very beautiful cinematography in this movie and even if it were not an excellent movie that alone would make it worthwhile The elusive Blue Butterfly becomes a symbol of hope and well as the source of problems. Right to the end of the film the director never leaves you wondering but tells the story and leaves you feeling completely satisfied. The entire family can watch this movie and each person will thoroughly enjoy it.",
         "The Blue Butterfly is based on a true story about a nine year old boy dying of a brain tumor whose last request is to capture the blue butterfly for his collection. He and his mother enlist the help of a renown entomologist to take them into the jungle to find the insect. At first the entomologist refuses, but eventually relents. They spend several days searching for the butterfly and have some dangerous encounters. Everyone learns a lot about life and nature. The scenery is great, but the films moves slowly in many spots. Other than some slow spots it is a relatively heart warming film. Excellent acting and top notch technically.",
         "This was a heartwarming movie that even my \"Rambo'lovin husband liked.I will be buying this movie.If you do not care for the story line you will love the scenery.If you have children 6 and older they would really learn from this movie.It really shows the compassion that man can have for one another and actually restores your faith in the human race.The wildlife will really make the young ones stay entertained.Rent or buy this as much for yourself as for your children.You can be assured that this movie will not have any content that will be offensive-in fact they give you two choices-edited content for minor language or non edited.I chose non edited and it was in no way offensive.",
         "I saw this movie when it premiered at the National Screen Institute Film Exchange in 2004, and i thought it was the best movie there. I think the DOP on that production is probably one of the best in the world. The camera effects were great, and the story itself was very inspiring. And yeah ill admit it was very slow, but if you really love watching movies and art of making them, then this movie you should see. Plus the Art director must have had is work cut out for him the set designs were very detailed, I mean the whole village it took place in was built from ground up and i think they did an awesome job. And then the sounds they put into the movie of the insects and the colors it was all so well done. I would so definitely see this movie again and again. trust me I think you would love this movie its a must see if your a movie buff. I gave the film a 9 out of 10...for greatness!!",
         "If you know of any kids who are suffering with cancer, and especially those who diagnosed as terminally ill, this would be an inspiring film for them. Meanwhile, who doesn't like looking at butterflies? Well, this story is a lot more than that, but you might as well enjoy the fantastic insects and nature scenery of Costa Rica while going along for this ride. This is another based-on-a-true story film, about boy dying of brain cancer getting his wish to go track down the mysterious \"Blue Morpho\" butterfly which supposedly brings magical powers. The film stars William Hurt and a couple of unknown actors: Marc Donato, who plays the boy, \"Pete Carlton,\" and Pascale Bussieres as his mom, \"Teresa.\" All three do a fine job. I really enjoyed the wildlife photography. Some of the insects, reptiles, birds and animals in that part of the world are just amazing. The story tries hard not to be sentimental, sometimes too hard and also infers near the end that the young boy was magically healed by some spirits of the jungle. Filmmakers love promoting mystical New Age-type stuff. Nonetheless, unlike what I expected, there was a happy ending to this story. Most importantly it was happy conclusion for the real person. Obviously, that is what is really important. This is the real-life story of David Marenger, who is a grateful, now-healthy young man who spends his time wisely helping other kids with illnesses. You can see him in an interview that accompanies the DVD.",
         "Blue Butterfly is the best movie i have seen in the last two years. It is funny, amazing, and beautiful. You would expect it to be a heartbreaking drama from the synopsis but it is NOT instead it is so much more. There are so many thrills in it and i strongly recommend it to anyone to try. If you don't want to see it for the acting, which is EXCELLENT then go see it for the beautiful scenes of the Costa Rican jungle. This movie is proof that Canadian movies are just as good if not better than some Hollywood movies.",
         "i rely upon IMDb for accurate reviews this film is the first review I'm writing because the review of its so bad. it features some of the best outdoor photography I've seen in any movie I'm not a fan nor like insects but this film allows you to see them much closer and makes them more interesting then i could have imagined. the character and story is very well rounded characters very believable because there not characters. its like national geographic did a love story about a miracle, with comedy thrown in and a dash of action adventure and suspense . please see this film and make up your own mind. contrary to what you might see in reviews this film isn't geared towards anyone everybody should be able to enjoy it. one of the reviews on rotten tomatoes says it try to force your emotions i cant see this at all except for one dream sequence there's nothing fake or phony about this film and it genuinely makes you care for the characters. after seeing it i will be looking forward to adding it to my video collection",
         "This movie is not slow-moving at all. Only 10-15 minutes is spent on build-up; then they're in the jungle. If you only like action movies and want things to bleed and blow up all the time, this is simply not the movie for you. It's not slow, it's just different. It is a beautiful movie. It held my attention, and it's full of delightful close-up shots of the jungle and its animal (mostly insect) life. If you like nature films, you will definitely enjoy this as a great visual experience. William Hurt once again plays a father figure to a troubled little boy (see \"Second Best\" and \"A.I.\"), and he does it very well. As an honest, well-produced, well-filmed movie, this would earn a 7 out of 10 rating from me. I have to detract one, however, because the actors who play the mother and the brain-tumored kid are sentimental \"types\" that are obviously designed to evoke excessive pity and compassion in the viewer, Disney-style. This is a bit too much, and mars an otherwise very beautiful little story. 6 out of 10.",
         "I enjoyed this movie. I watched it in the afternoon because there was nothing else on the other channels I felt like seeing. From that rather unpromising beginning ( I expected it to be a sloppy tearjerker) I was agreeably surprised as the story unfolded. Knowing it to be a true story I wasn't expecting any massively surprising twists and indeed there weren't any, but the characters developed satisfyingly and the jungle scenes were fantastic. I'm lucky enough to have a large cinema screen at home and watch films via a 'proper' projector, so the huge scenes outdoors with the insects and wildlife were gorgeous and it really felt like I was actually there and experiencing it for real. I get bored easily and I also get a bit jumpy with suspense stuff, but I stayed with this film all the way through and without any boredom. But I did fast forward through the bits where he was running through the jungle with the little boy on his back because I'm a mother and that kind of thing worries me, I was just waiting for an accident LOL It had a happy ending which made a nice change - I get fed up of films that leave me feeling tearful and depressed - this one was nicely positive. It made me feel like maybe visiting the rainforest myself one day - but not to wade in the swamps - leeches are my worst nightmare!!",
         "Yes, this was a project that I spent much time on, but the gang that we had in Costa Rica was excellent I really applaud them I love the people here. We put our hearts in this project. The rains had a lot to do worth our decision to build the whole village up three inches off the ground and apply a drainage system. In total I believe it was about 120 square meters. The Canadians were wonderful people and I praise Serge Bureau for his eyes and guidance. Thank you for the opportunity to work on such a wonderful film.We hope that many more people come to Costa Rica and film in the future.I have one of the best Art Departments there that I work with. Jaime Fernandez",
         "This film is about a 10 year old boy with a terminal brain tumor whose last wish is to catch a blue butterfly that lives in the forests of South and Central America. He and his mother convince a begrudgely naturalist/scientist/insect collector to let them tag along with him on one of his expeditions. They stay in a small village in the jungle, where not only do they encounter all sorts of wildlife, and learn about the culture of the indigenous people, but also learn about each others weaknesses and fears and relationships develop along with a bit of magic. I saw this movie on TV with my 8 year old son, I felt it had a lot of important things to teach him about humanity and nature: wildlife, disease, relationships, other cultures, other perceptions of reality, other lifestyles. It might be a bit corny for adults to watch on their own, but I felt its message was positive and profound for younger people. I also liked its slower pace, which was not boring because of all the beautiful scenery. My recommendation is rent it for your kids.",
         "THE BLUE BUTTERFLY, made in 2004, is based on a true story as adapted for the screen by Pete McCormick and as directed by Léa Pool. Looking for this DVD in the usual places finds it listed under Family entertainment, and with the right family this film could raise some worthy discussions. But THE BLUE BUTTERFLY is not a typical Hallmark-type presentation: it is based on fine acting by a varied cast gathered from Canada, the USA, and Costa Rica, it is a beautifully sculpted nature film, and it introduces a fact - that miracles do happen. It deserves a wider audience. Alan Osborne (William Hurt) is an well known Entomologist who is visiting Montreal of the dedication of a science building named in his honor. There the busy Osborne meets 10- year-old Pete Carlton (the fine young Canadian actor Marc Donato), a victim of brain cancer who is in his final month of life and who has become a devoted fan of the brilliant Osborne's books and lectures to the point that Pete wants Osborne to take him to the rain forest to capture a Blue Morpho butterfly - the Blue Morpho Butterfly (Morpho menelaus) is an iridescent blue butterfly from South American rain forests and is an insect Pete remembers Osborne as calling 'magic'. Pete's devoted mother Teresa (then incandescent Canadian actress Pascale Bussières) accompanies Pete to meet Osborne, shares her son's lack of future, and ultimately convinces Osborne to take Pete to the rain forest despite Osborne's hesitation. From here the film is all located in the rain forest (here, Costa Rica as captured on film by Director of Photography Pierre Mignot who also is responsible for the extraordinarily beautiful close-up images of all manner of insects and wildlife), and with the help of a friendly village lead by Alejo (Raoul Trujillo) the group (Pete, Osborne, Teresa, Alejo and guides) sets out to find and capture the Blue Butterfly. What follows is a journey that tests faith, shows courage and mends bruised lives: the capture of the desired butterfly and the manner it is handled is one of the little miracles of the film - the real 'miracle' is that upon return to Canada, Pete is diagnosed free of tumor! Films such as this can, in the wrong hands, become maudlin and saccharine, but form the script through the direction through the acting of the cast this film exceeds expectations. it is a lovely little movie that restores faith in the power of human kindness. Grady Harp",
         "Last night I watched El Mariposa Azul for the first time.Just its nombre alone, guaranteed that I would.Having visited Costa Rica twice, I IMMEDIATELY recognised the opening river scene as (when the boat was going up river) being CR. In fact, I said to my girl friend, \"I'll bet you ten bucks that that is Costa Rica\". As the movie rolled on, I knew that I was right.Only Costa Rica can show us such beauty in its country and wildlife.I had made the trip from San Jose to Torteguero Biosphere Reserve and stayed there for five days. No words can describe Costa Rica, you have to personally see its beauty to appreciate it.If you can, go and visit it and I promise you, you will be glad you took my advise.Having been to 72 different countries, I place Costa Rica as my number one place to return to.....that's why I'm going back for my third visit in the not too distant future. El Mariposa Azul (The Blue Butterfly) has done CR proud....or is it the other way round?",
         "First thanks to the Encore stations and the DVR, I choose to record to see later, as I do with many, The Blue Butterfly became an instant keeper. the close up shots of the animals and insects itself are amazing. As you read in other peoples reviews, the story is rather simple. A dying boys \"last wish\" is to find this Blue Butterfly with the aid of William Hurt, who first refuses, but later changes his mind. the movie may not be everyone favorite if action \"Clint Eastwood\" style films are what you like, but it your like me who likes a story of hope, then you got the film to watch. It's worth the time and makes you feel good when its over.",
         "The Blue Butterfly tells the extraordinary story of a 10-year-old boy diagnosed as terminally ill whose dream is to catch the most beautiful butterfly on Earth the mythic and elusive Blue Morpho. His mother persuades a renowned entomologist (William Hurt) to take them on a trip to the Costa Rican rain forest to search for the butterfly leading to an adventure that will transform their lives. And so their journey begins. A journey of courage redemption and love. A magical film about a courageous young boy and a jaded man who chase a dream and whose lives are forever changed. Now fourteen years later the young boy who was given hopefully six months to live is now a young man. This magical story is true.",
         "I had never heard of this movie until I was flicking across the dial looking for something to watch. I wasn't expecting much, but found \"The Blue Butterfly\" pleasantly engaging & appealing. The cornerstone of its success lays in the amazing landscapes \"The Blue Butterfly\" is mostly shot in. It is a vividly colourful production & tells an intense story of a young boy dying of cancer, needing & seeking inspiration in his struggles for life, embarking on a journey that puts his illness into perspective. It is insightful, interesting & realistic in its depictions of interpersonal relationships - mother & son, boy & the man he looks up to, flawed but invaluable expert on insects whose knowledge of nature is only a tip of the iceberg into his deeper self & how he got to this place where he finds himself, where he can help & inspire the young boy in his adversity. Contrary to other opinions expressed, as an adult, I didn't find this a kid's movie, to be dismissed by some other's opinions that this movie is 'boring'. I did think it was far-fetched in one of the latter scenes, but note the comments indicating it was a true story. Only in this one incident, would I still question that. Personally, I consider it compared favourably with the other movie I watched tonight in \"Dante's Peak\", which I consider this unknown movie ran rings around! \"Dante's Peak\" is full of drama & action but so predictable & lacking plot! It was at best, ordinary. By contrast, I can understand that \"The Blue Butterfly\" would be especially helpful to children with cancer or other struggles with illnesses. It could encourage & inspire them in their unenviable situation most are privileged to be spared! But beyond that, \"The Blue Butterfly\" is an enjoyable family movie, with something in it for child & adult alike!",
         "This is a movie based on a true story, so there is just so much one can do to dramatize it, you must count on acting, and even if William Hurt played well his role of an asocial entomologist, the other actors seemed to be there just for the money. The script also lacked a certain proof of effort, while the beautiful nature scenes seemed to be put in the movie only to make it long enough. In conclusion I could watch it, although I desperately wanted to go to sleep on it, but it disappointed me. I have seen a lot of cancer movies and even if 95% of them were obviously made for the quick buck rather than to help cancer patients, they managed to evoke at least some positive feeling. In this movie, William Hurt is the only slightly likable character and cancer or not, nobody seems to care in the movie either. The movie is a failure, although one cannot expect too much of dramas these days. Average.",
         "Young tween Pete (Marc Donato) has a brain tumor. Despite treatment, his prognosis is not good. Naturally, his beautiful mother, Teresa (Pascale Bussieres) is deeply sad but, she cannot help but admire her brave son. The lad is a winged-insect collector and his fondest wish is to go to the Costa Rican rainforest and catch a \"blue butterfly\", like his idol, Dr. Alan (William Hurt). So, even though the odds are stacked against them, Teresa takes Marc to one of the prof's lectures and begs him to take her son to Central America. At first, Alan demurs, in part because he states the season is over and the blue butterflies will not be numerous. Also, Al doesn't really connect well with people, especially children. Nevertheless, after realizing how much it means to Pete, Alan says yes. The journey into the rainforest is amazingly beautiful but rather treacherous, as some of the creatures are fierce. Pete and his mother makes friends with the native tribes that Alan knows well, for the prof has been there many times. But, their trek proves, initially, futile. Sensing that the noise of a large party might be a problem, Pete asks Alan if \"just the two of them\" can go looking, even though it might be dangerous. Al consents. Will the boy get his heart's desire before his illness defeats him? This is an astoundingly lovely film, very admirable. The fact that is it hardly known is a terrible shame. First, the cast is great, with Hurt giving one of his best performances ever, even considering his amazing body of work. Bussieres and Donato, too, are very touching while the supporting cast likewise does well. The beauty of the setting can not be overstated and the breathtaking close-ups of many of the rainforest's creatures has to be seen to be appreciated. Costumes, cinematography, script (based on a true story), and the skilled direction all work to make one very admirable movie. Therefore, be you a family in search of a flick for all members or someone who seeks out the finest of the finest, this movie is for everyone, the world over.",
         "It was sheer unexpected chance that I caught the last segment of \"The Blue Butterfly\" one Tueday late afternoon in June on cable Encore channel. It's 'based on a true story.' Quite an encouraging factor. And I was lucky enough to again catch this little known William Hurt movie (a 2004 Canadian-made film) when Encore repeated its showing. What a treat. Tear-jerker, in a way, with the story about this terminally ill young boy determined to pursue the Blue Butterfly with his ideal collaborator - an entomologist he adored and believed in, for the mythical quest of a journey deep into the jungles of Costa Rica! Yes, sounds like a Disney adventure and family drama, as the boy's single-mother also went along to provide moral if not physical support to her son's dying wish, literally. If you try to dissect the film or compare it with other movies, you're doing yourself a disfavor. Just go along with the trio: our young hero Pete in his wheel-chair (well-portrayed with such simple ease by Canada's popular seasoned young actor, Marc Donato), his French-accent attractive Mom who stands by his wishes (she looks familiar - it's Pascale Bussières in w-d Patricia Rozema's \"When Night Is Falling\" 1995 Canadian production), and the passionate nature man Mr. Osborne, who does care inside though ill-at-ease on the surface with the resolute boy (another William Hurt never-disappoint performance). And what's not to like: location shooting takes you into the rain forest of Costa Rica - it does feel like going through a National Geographics sojourn - remarkable close-ups of insects, fascinating nature captures and lush landscape scenes. Capable cinematography by Pierre Mignot and skillful editing by Michel Archand. Comparable screenplay by Pete McCormack, based on true events, with dramatic elements infused for film-goers' sake. Decent direction by Léa Pool (of \"Lost and Delirious\" - a controversial subject film which may not be for everyone, with intense performance by 'Coyote Ugly' talented Piper Perabo), who kept the dramatic tones non-sappy, and the adventure segments, the core relationship between the entomologist father-figure and the singularly-minded boy comfortable to follow. The ending notation - which is no spoiler - letting the viewers know what became of the terminally ill young boy, is definitely uplifting and life affirming. Yes, miracles do occur. (I have Lani Hall's song from her 'Sweet Bird' album, 'That's When Miracles Occur' singing in my head. \"Love you're giving you must give away\" and \" Make sure you risk everything\" - the lyrics sure ring true in this film.) Unobtrusive music (integral native rhythms, too) by Stephen Endelman, exquisite (nature) sound design by Ivan Sharrock and visual effects supervised by Gunnar Hansen all enhance the film experience. \"The Blue Butterfly\" is a movie worth watching. Glad that Encore encores its showings on cable. It's also available on DVD, which included fascinating bonus features (from 10 to 18 minutes variety): there's interview with the real life 'Pete' - David Marenger, story about young David and the real 'Osborne' - French entomologist Georges Brossard of 'Fondateur Insectarium De Montreal'. See \"Mariposa Azul: A True Story\" with executive producer Francine Allaire, \"The True Inspiration\" and \"About A Butterfly Garden\" with David, and \"The Actors' Experience\" with Bussières, Donato, Hurt (he explained why he liked the dream sequence idea, and his observations of Georges) on their portrayals and on set anecdotes, including venturous Georges (who showed and told us about the 'big' bugs!), of course.",
         "its pretty good but then it has a few flaws, mainly acting, but still good........ the photography was amazing and very very well done, the acting was kinda cheap, it was like the acting in most of these family films i guess, William Hurt was great too, but the little kid really annoyed me because he sucks at acting, and it also has a good story, and a good meaning among a few other flaws and some other things that are good about it..... so if you want to see a pretty good family film, you should check this one out",
         "Based on a true story, terminally ill boy Pete Carlton dreams of going to the jungle to catch the elusive Blue Morpho. Entomologist Alan Osborn (William Hurt) is rather aloof, and resists pleads from the boy's mother (Pascale Bussières). He relents and take them both to the jungle. William Hurt has played this closed off character many times. He's good at it. The kid is a bit too annoying. He plays the one note of the overly inquisitive kid. Finding the right kid actor isn't easy. There are some reveals of the characters, but it isn't anything impressive. The jungle looks good. The production isn't first rate, but there is some charm to an under produced movie in the jungle. There is a lot of good jungle shots and close ups of bugs. The story is rather bland. Even when the drama ramps up, it doesn't do it in the most exciting way.",
         "this movie is very, very slow. I saw it with the wife thinking she deserved to see a movie she would like, after sitting through all the samurai bloodbath movies with me. However, after 10 minutes, we looked at each other and shared a recognition that the movie was b-o-o-o-ring. I could tell right from the start this was going to be a dud. There is a little boy with cancer who appeals to the butterfly dude to help him catch the butterfly in the jungle. So eventually, after some 'tear jerking, heartwarming emotional' crap, off they go. Cry me a river - this movie is a total PILE. O.k., to be fair -- if you could sit through 'Whale Rider' you might like this.",
         "William Hurt is professor Alan Osborne, insect-ologist, who in one presentation had said that the butterfly the Blue Morpho was the most beautiful thing, with almost magical powers. Young Marc Donato plays Pete Carlton who has had surgery to remove a tumor in his skull, but the doctors have declared he has only a few months to live. He happens to be an amateur insect-ologist and a big fan of Alan Osborne's. He takes his comments about the Blue Morpho seriously. Pascale Bussières plays Teresa Carlton, Pete's mother. One day at a dedication ceremony they approach Alan and ask him to help a dying boy fulfill his dream of seeing and catching a Blue Morpho in Central America. Alan doesn't want to bother, and besides there is only one week left in the season for them. But something happens to take Alan to the boy's bedroom, he sees all the insects and posters, and guess where they all end up? Yep, in the jungle hunting the Blue Morpho. Since the boy is weak, Alan carries him on his back in a special 'saddle' they made. The DVD has an interesting extra with the real boy and the real insect-ologist. SPOILERS. In the movie the scientist and the boy never catch a Blue Morpho. In fact, chasing one they fall into a pit, Alan breaks his leg, the boy has to go for help even though he has difficulty walking. But a village girl catches one, gives it to Pete, in a cage, as they leave the jungle. Pete gets better, he does not die. Maybe the Blue Morpho really had magical powers. (PS - I am aware that insect-ologist is not the correct term, it just sounds better!!)",
         "terrible. probably one of the worst movies i've ever seen. we figured that they got william hurt to act in this turkey by either paying him buckets full of money, or he wanted to go to the jungle and figured this would be a free trip, or he's part of the cult. because it must have been a cult that financed this movie. i don't know the cult of the healing power of the blue butterfly, or the jungle, or the big hole in the ground that they fall into. we watched this movie imagining if the guys from south park had written it and cartman was the little kid faking his lines so he could get a free trip to the amazon. there's one scene where they're swimming by the waterfall that's almost like nambla. jeez, have i written enough lines yet?",
         "The Blue Butterfly is 'inspired by a true story.' The true story involves a young boy apparently ill with terminal cancer, who goes to the South American jungle with a renowned entomologist in search of a blue butterfly. When they return, the boy's cancer has disappeared. The facts of the true story are dramatic and emotional moving. There is no need to embroider them. But that is just what the filmmakers do. I'm guessing, but my feeling is that what we see in the movie that is not in the original story is: (1) The scientist did not have a long-lost daughter (2) There was no romantic connection between the boy's Mum and the scientist (2) No little villager girl actually connected with the boy, or caught the blue butterfly (4) The scientist did not fall down a hole, forcing the boy to make his own way through the jungle. A boy goes to the jungle and comes back cured of cancer - but the story is deemed not 'dramatic' enough by the idiots who pose as story experts in Hollywood. This film is a schmaltzy, overblown insult to the intelligence. Great stories are not about ticking off the boxes in some script reader's manual. There is a genuine, uplifting tale buried in this film, that somehow got lost as each executive decided to burp out a script note after lunch. The end result is an unedifying, distasteful meringue of a film. I was insulted."
      ],
      "genres": [
         "Drama",
         "Adventure"
      ],
      "productionCompanies": [
         "Galafilm Productions",
         "Global Arts Productions",
         "Palpable Productions"
      ],
      "summaries": [
         "Based on a true story, The Blue Butterfly tells the story of a terminally ill 10-year-old boy whose dream is to catch the most beautiful butterfly on Earth, the mythic and elusive Blue Morpho. His mother persuades a renowned entomologist to take them on a trip to the jungle to search for the butterfly, leading to an adventure that will transform their lives.",
         "Adolescent Pete Carlton has been diagnosed with a brain tumor, with the doctors giving him three to six months to live. He has written to and telephoned entomologist Alan Osborn, host of the television show \"Insects\". Based on Alan's on-air statements that seeing the blue morpho butterfly, a magical creature in his mind, transformed his life, Pete wants to accompany Alan on a trip to the tropical rain forest to capture a live specimen for himself. Alan reluctantly agrees, his reluctance based on the fact that the season for this butterfly is nearing its end, the trip will be difficult because of Pete's wheelchair-bound status, and that Alan admits that he is a not good with children. Accompanying them is Pete's caring single mother, the tropical rain forest-phobic Teresa Carlton. As they search for the elusive butterfly, Alan learns from Pete the importance of following one's dreams, while Pete learns from Alan's friend's daughter, Yana, the importance of taking in all that life has to offer in the moment. These lessons come amidst some obstacles, both emotional and physical.",
         "A dramatic adventure about courage, redemption and love being filmed in the rain forests of Costa Rica, and in Montreal."
      ],
      "budget": 12500000
   },
   "movielensId": 170319,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-02-20",
      "dvdReleaseDate": null,
      "directors": ["Léa Pool"],
      "runtime": 97,
      "movieId": 170319,
      "title": "The Blue Butterfly",
      "mpaa": "",
      "actors": [
         "Marc Donato",
         "Pascale Bussières",
         "William Hurt",
         "Raoul Max Trujillo",
         "Steve Adams",
         "Marianella Jimenez"
      ],
      "imdbMovieId": "0313300",
      "originalTitle": "The Blue Butterfly",
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Based on a true story, The Blue Butterfly tells the story of a terminally ill 10-year-old boy whose dream is to catch the most beautiful butterfly on Earth, the mythic and elusive Blue Morpho. His mother persuades a renowned entomologist to take them on a trip to the jungle to search for the butterfly, leading to an adventure that will transform their lives",
      "tmdbMovieId": 25379,
      "avgRating": 3.5,
      "releaseYear": "2004",
      "numRatings": 1,
      "posterPath": "/wXJwzWH7wXir7sDgGy5Gs18rta1.jpg"
   }
}