{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "serial murder",
            "id": 11260
         },
         {
            "name": "city youths",
            "id": 220002
         },
         {
            "name": "country folk",
            "id": 220003
         }
      ],
      "imdb_id": "tt1687889",
      "video": false,
      "title": "Madison County",
      "recommendations": [
         70059,
         21166,
         79078,
         48836,
         74006,
         25151,
         139367,
         132890,
         137528,
         280127,
         99220,
         110588,
         80195,
         59574,
         78362,
         153998,
         22530,
         70574,
         55952,
         41203
      ],
      "backdrop_path": "/ufMks5dhC1rLrMatVDYTfFntKRk.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "57df91f99251416c1f00571a",
         "content": "I'm always on the lookout for the Slasher of the New Age. Don't get me wrong, I love Jason Voorhees and his ilk, but I'm keen to give others a chance to try and join those ranks with an original character. Unfortunately it never quite seems to work out. _Madison County_'s Damion Yule doesn’t buck that trend.\r\n\r\nThere's some decent individual moments, and I appreciate that the movie took its time to develop, but the quality was too low and the story too unexplored to merit a recommendation.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
         "url": "https://www.themoviedb.org/review/57df91f99251416c1f00571a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "James",
               "gender": 0,
               "credit_id": "56070b3b92514130520027f8",
               "name": "Colley Bailey",
               "profile_path": null,
               "id": 1515455,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Will",
               "gender": 0,
               "credit_id": "56070b5ac3a368121b002595",
               "name": "Matt Mercer",
               "profile_path": "/mijwwKeOP3l35IhRi7E3pRZRPjk.jpg",
               "id": 1186713,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Kyle",
               "gender": 0,
               "credit_id": "56070b74c3a368121800274d",
               "name": "Ace Marrero",
               "profile_path": "/znmFZdLVnkD0TeXk71CbRWjWDsi.jpg",
               "id": 1325939,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Brooke",
               "gender": 0,
               "credit_id": "56070b94c3a368121b00259f",
               "name": "Joanna Motomura",
               "profile_path": null,
               "id": 1515458,
               "order": 4
            },
            {
               "cast_id": 1005,
               "character": "Jenna",
               "gender": 0,
               "credit_id": "56070bacc3a368121100305a",
               "name": "Natalie Scheetz",
               "profile_path": null,
               "id": 1345460,
               "order": 5
            },
            {
               "cast_id": 1006,
               "character": "Damian Ewell",
               "gender": 0,
               "credit_id": "56070bcbc3a368120b002daa",
               "name": "Nick Principe",
               "profile_path": "/hJFweTaWa3KB23tvWYEGZyHpd3t.jpg",
               "id": 223050,
               "order": 6
            },
            {
               "cast_id": 1007,
               "character": "Erma",
               "gender": 0,
               "credit_id": "56070bde92514130640027f5",
               "name": "Adrienne Harrell",
               "profile_path": null,
               "id": 1427130,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe497cc3a368484e12dc25",
            "name": "Eric England",
            "profile_path": null,
            "id": 582527,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.474383,
      "production_countries": [],
      "id": 77785,
      "vote_count": 21,
      "budget": 0,
      "overview": "A group of college kids travel to a small, mountain town called Madison County to interview the author of a tell-all book on the accounts of several grisly murders that happened there. But when the kids get to Madison County, the author is no where to be found and the towns people act like they haven't seen him in years. They also say that the killer never existed and the murders never happened. However, when the kids start digging around to get their own answers, they find out that the stories maybe more real than the townspeople are letting on!",
      "similar": [
         68812,
         573,
         13548,
         2760,
         297608,
         26690,
         33308,
         454826,
         40469,
         24527,
         24196,
         195435,
         39930,
         226630,
         96243,
         55943,
         80368,
         56362,
         169314,
         87335
      ],
      "original_title": "Madison County",
      "runtime": null,
      "poster_path": "/ekyGuo6hhsT1RhNr9zV25JRWJla.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-05-08",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric England"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Eric England"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1687889/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjEzMjAyNDk0MF5BMl5BanBnXkFtZTgwMjA5NDA2MDE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Colley Bailey",
         "Matt Mercer",
         "Ace Marrero"
      ],
      "reviews": [
         "If you only read the first couple of reviews for this movie you would think its one of the best Slasher flicks in a while, but in reality it is not only mediocre but it had perhaps one of the most laughable plot lines in horror history. Now the last thing I expect when going into a slasher flick is originality, so it didn't bother me that this movie was basically just a rip off of every other backwoods/small town horror movie ever made. What bothered me was the unlikeable characters, terrible dialogue, and just the pure dullness of the first hour or so of the movie. The all around feel of the movie just felt so unprofessional and all over the place. There is a point in the film where the characters just keep returning to this diner to talk to this elderly woman behind the counter (who is easily the worst actress in the film), this got incredibly repetitive and I found myself screaming \"SOMEBODY JUST DIE ALREADY!\" I saw that one of the other reviewers on here said that if you enjoyed Hills Have Eyes and Wrong Turn that you will enjoy this film, that statement couldn't be further from the truth. The Hills Have Eyes and Wrong Turn were two excellent horror films that kept you on the edge of your seat with bizarre kills and fast paced story lines. This movie puts you to sleep for an hour than ends in a not so bloody mess and leaves you wondering why you sat through the whole thing. Another mediocre slasher that manages to be worse than all the other copy cats out there. Avoid it, 1/10",
         "Not another total waste of time where the young girl always sobs away her location or falls down when she could have run away. Not another pig mask to make someone look primal. Girl sees her boyfriend dead and she tries to run away like she can barely move. The killers can never run but can outrun any pathetic victim they chase. This movie started out credibly enough and contained more beyond stupid outcomes than I've ever seen. I had to write this so I could say shame on you to whoever made this drivel. Shame, shame, shame on you, you untalented lousy film maker who should never be let near another camera again or one of your movie viewers should take care of you themselves for wasting their time. to reiterate, shame, shame, shame",
         "Besides being mediocre, this film was a straight pile of crap. Kitchen knives with double-sided blades, shovels as a main murder weapon, and a whole damn town in on a murderous conspiracy? WTH. Oh, and what the hell kind of undergraduate major writes a thesis about a pseudo-nonfiction book and the town it concerns? Is that for the Bachelor's of Science in Utter Crap? The idea for this movie had a great deal of potential, but it was poorly realized and executed. Also, guns. This is America, there are plenty of people exercising their 2nd amendment rights, so how is it that there is an entire town of people without a. single. freaking. gun.?!",
         "I find it laughable that anyone who has seen this movie would describe it as 'above average' and 'decent'. You must have really low standards when it comes to being entertained. I suspect people who say they enjoyed this dribble are either friends of the filmmakers or teenagers who don't know what qualifies as a good movie. Given the low budget, perhaps it's not fair to be too critical. Then again, the filmmakers made this with the intention of taking money from YOU the viewer. So I'm afraid I can't let the filmmakers off the hook. What's wrong with the film? Pretty much everything: Predictable plot, cardboard characters, sluggish pacing... I could go on. The director seemed to have difficulty building tension and delivering a payoff. As one review pointed out, the editing is particularly bad. And when you consider the movie is only 81 minutes, you have to wonder what was left out. If you want to see what good low budget horror filmmaking is about, do yourself a favor and watch Texas CHAINSAW MASSACRE, HALLOWEEN or INSIDE.",
         "My first serious complaint as such was when they stop at the diner. They were hungry and they stopped there. They are soon leaving. Did they eat? We never see the food. The creature himself is really not scary. One nutter with a pig's head in the middle of nowhere. I don't know how those remaining by the house got so separated. Anyways all you really got to do is run. The surviving girl is traumatized but as such unharmed. Run luv!! Then there is the other survivor, he beats the psycho up, but never finishes him off. And there is a lot of not hanging on to one's weapons, obviously the nutter keeps getting up. An all round cliché. What a lot of wait for nothing.",
         "This movie is a rip-off of so many other movies that i wonder if the producer's legal department saw it. I won't bother listing them, but it's about every horror movie released in the past 15 years. Even pieces of the set look ripped off.. The story line is borderline retarded, with a narrative technique straight out of a super-8 high-school project. The acting is good, bording on the intentional \"nouveau-camp\" style. The special effects are sort of gory, but well done. The make-up effects and costume design are absolutely good fore The bad guy I have to find a positive point about this movie... Hummm... The pig mask. Just that.",
         "Just got done watching this. I'd been looking forward to it for awhile. Synopsis sounded good, trailers looked decent, I'm disappointed. The acting was OK, in the beginning before it goes horror it was actually decent then it went downhill. It's an old plot, teens in the woods, backwards hillbilly town so there's nothing new or different but I've seen it done much better. My biggest problem with this movie though is the editing. From the knocks on the door not matching up with James hand to the sharp cuts and jumps. I did find out the disc I watched was defective and missing about 6 minutes so I'll up my rating a slight bit although I can't imagine 6 min could change my mind dramatically about this film.",
         "Or was that away from the mill? There's no mill here of course. This still fits perfectly in the slasher genre formula. The teens, the baddie and a few other \"surprises\". The story is not really something to get too excited about. Unfortunately the gore/blood scenes are not that top notch either. Combine that with below the average acting from most connected to this and you get something you don't really have to watch. Don't start to wonder why character behave certain ways or why logic and reason will never apply to those kids/teens depicted in most of those movies (especially the ones at the bottom of the barrel). If it has to be a slasher movie, there are far better ones out there for you to choose from.",
         "Do YOU like disjointed, nonsensical films where the characters behave stupidly and unrealistically, where the \"plot\" is an excuse for some highly unimaginative killings of tedious bad actors whom you won't care to root for, and which end abruptly without any sense of closure? Well, then, Madison County may just be for you! Even by slasher movie standards, this is extremely weak. When the end credits popped up, I strongly felt that the word \"written\" in \"Written and Directed by\" should have been in heavy quote marks, as the script and continuity feel quite haphazard. Low budget horror can be more inventive and interesting than its A-list counterparts, or it can be ... well, this.",
         "Madison County's biggest fault as a horror film is not what it does but, what it doesn't do. And that is deviate at all from the backwoods horror sub-genre formula. The movie follows the cliché' blueprint of getting five attractive twenty-somethings to a secluded rural area where they can be placed in proximity with the trademarked deranged locals. In this case they are going to research a book about a serial killer who may, or may not exist in secluded rustic Madison County. Director/writer Eric England seems to have seen enough of these films to put one together competently on a technical level. There is some nice production value for a flick reportedly made for around $70,000. The visuals are fine and creepy and he does create some nice atmosphere and some tension.His cast of young attractive characters are likable enough and there is some blood once things get going. But, England follows the formula so closely that there aren't many surprises. You know the locals are suspicious and strange for a reason and that there really is no question as to whether the killer really exists. His leads while likable are not overly interesting. The locals are generic creepy hillbillies and the villains are never given enough screen time to build their characters and thus aren't that frightening. They never rise above the cliché' evil redneck stereotype and we just can't generate enough interest in them to care or be afraid. Even the pig masked killer, Damien Ewell, that is the main nut job, is very ho hum even when on the attack. It's as if England thought a pig mask was enough to create character and menace. And, as far as these films go, Madison County is bit too tame. In this case a little over the top would have been welcome as nothing grabs us, shocks us or horrifies us. There is blood but, it is basically some routine stabbings and ax wounds. And since we've waited till the last act to get to the good stuff, we feel a bit cheated by what little we get and how soon it's over. (With credits County is barely over 80 minutes.) If you are going to present a classic scenario like this, shake things up a bit (ex. Cabin In The Woods). Or at the very least, throw all the classic elements at us with a bit of good old fashioned ferocity. For a horror flick, Madison County is far too laid back. No, I don't think Eric England is a bad filmmaker, he can create tension and atmosphere and I've seen far worse then his Madison County but, he needs to learn that innovation is far more effective then imitation when it comes to the horror movies he obviously enjoys. And if you can't innovate, throw some blood and carnage in our faces to keep us awake. Madison County is still a mildly enjoyable horror but, I think England has the potential to deliver much more.",
         "This is actually a pretty decent slasher with a decent story. Myself, I haven't really been a big fan of slashers since the 80's because they're all mostly repetitive with predictable plots. Still, every once in awhile something comes out worth watching. Madison County is worth watching. Madison County is different in that it does have a story that was well written with good actors and decent production and sets. It doesn't have to resort to trying to become a comedy to keep the users attention. The mystery of the well written story does that which makes this movie stand out on its own. The couple of complaints I do have is the lack of any serious gore. Could've used way more of that seeing as its target audience will definitely want to see some gore. My second gripe was the ending which seemed rushed and lacking. Other then that the ride itself was great. The Old woman was delightfully creepy and the mystery of it all kept me interested though out the whole movie. 6/10 stars. Slasher fans should be proud. Had the ending been acceptable and gore had been more I would've given it more. Oh well, still worth a watch if your a genre fan!",
         "Just as the market was glutted with slasher films during the initial wave of the sub genre in the early 1980s, now we're being inundated with many modern homages made by people who are big fans of those films. Unfortunately, with some of these films we're not getting anything we haven't seen many times before. And \"Madison County\" is one of those films. It's underwhelming, even boring, with fairly likable but extremely unmemorable characters, a sorry screenplay, and, worst of all, unimaginative set pieces. The story has a young man named James (Colley Bailey) working on a thesis and travelling to redneck country to interview an author with whom he's been in contact. The author had written a true crime book about murders in his neck of the woods, and, what do you know, the killer is still alive and well and intending to do some serious damage. About the only good thing I can say is that Robert Halls' Almost Human company does well with the gore; very undemanding fans of this sort of thing will enjoy the brutality. The pig mask that our killer Damien (Nick Principe) wears is also good for a mild chuckle. Writer / director Eric England spends quite a bit of time establishing situation and character, which is fine and good, except that the action, when it comes, isn't worth that much set-up. This thing only runs 82 minutes, and in all honesty it might have worked better in an even shorter format. The acting is not so hot from all concerned, although to be fair they don't have particularly good dialogue to recite. The girls are attractive, and it might have helped if they'd shown a bit more skin. All things considered, I could only recommend this if you just CAN'T get enough of rural horror. It's poor stuff, all the way until its unsatisfactory ending. Four out of 10.",
         "Madison County is a bit of an odd movie having both delightfully professional elements mixed in with cheap everyday slasher gimmicks. Firstly I believe this movie has huge potential and particularly in the areas of cinematography and special fx, despite a bit of an overuse of shaky hand-held which can get a bit annoying at times. The main letdowns in this movie however lie in the writing and acting. The plot seems like it is missing a few pieces and is a bit fragmented which detracts from the appeal of what could've been a well crafted story, secondly the dialogue and acting were both unconvincing and as much as you wanted to believe it you couldn't help but get annoyed at the acting and cheesy lines. The improvement in these areas would've distinguished it from what is a very formulaic plot idea: teenagers go to an isolated place and meet a crazed killer and of course an inevitable twist at the end.",
         "To be honest this film is pretty bad..... I paid £8 in Tesco and will definitely say it is not worth that price so Tesco you need to review your price on this. at least I can say I have watched it...... but what down turn for the ending didn't expect that at all...... I would say don't buy this film but if you see it on your mates shelf then by all means waste an hour and a half of your life :) the film.reminds me.of.The wrong turn and house of wax. the story line is pretty similar. seems to me the film is slightly low budget too. If the film had pretty good ending then I might of rated it a little higher than a 3. An ending where it shows the survivors returning with help maybe the police from another county or maybe the Army or something.",
         "A group of college friends travel to hillbilly country (\"we don't get many strangers around here\") to interview an author for a thesis about a legendary local serial killer. Guess what happens next\u0085 From the very opening scene in which the soon-to-be-dead teens load up their car for a few days of camping in the wilderness, Madison County is in very familiar territory, but still manages to be reasonably entertaining for a while thanks to the initially likable characters. Unfortunately, the film spends waaaaay too long getting to the horror—almost 45 minutes go by where very little happens—after which our unfortunate campers appear to abandon brains and start acting like total morons. Despite hostility from the locals, including an encounter with a knife-wielding redneck outside a diner, they leave the safety of the group to wander around the woods by themselves, practically inviting the resident pig-mask wearing maniac to slaughter them. To make matters worse, the kids throw away every opportunity to finish off the killer, preferring to momentarily incapacitate him and make a run for it—and they never, ever look over their shoulders. Watching characters this stupid soon becomes tiresome in the extreme, and any sympathy towards them goes right out the window. Towards the end of the film, writer/director Eric England tries to inject a little originality into proceedings with a plot twist involving the mysterious author, but the execution is ham-fisted to say the least, and not in the least bit plausible. An abrupt shock ending fails to improve matters, leaving the viewer pondering whether the film-makers had to return their equipment in a hurry. On an ever-so-slightly more positive note, the acting is reasonable, with the exception of Adrienne Harrell, who severely lets the side down with her dreadful performance as suspicious old bag Erma, the kills are fairly brutal, the cinematography is above average for such fare, and we even get a spot of gratuitous female nudity (although NOT from the film's attractive female leads, Joanna Sotomura and Natalie Scheetz, who remain clothed throughout) in a ridiculous scene that suggests that the locals are in cahoots with the killer.",
         "Madison County was slow. It gets good for about a half an hour, and then ends, leaving you with a big \"?\". Even the most easy-going viewer will walk away from this movie saying wtf. . .not in a good way. I have no issue's with the theme of the movie. It's a backwoods slasher flick, and if you wanted to see something else, you shouldn't have watched a backwoods slasher flick. I don't think the makers of this movie were trying to fool anyone into thinking it was anything more than that. The problem, is that the movie doesn't have an ending. The \"end\" doesn't answer a single question you have going into it, and actually adds a few extra for good measure. *Spoiler-ish* I'm not saying there's anything wrong with leaving your bad-guy alive at the end of the movie. That's a solid way to leave the viewer thinking about the movie after it ends, and sleeping with the lights on for a day or two. But consider Saw (completely different type of movie, but i'm using it as an example). Jigsaw stays alive at the end, killing off all the victims, and leaving his viewer terrified. He does, however, eventually show his real face, and explain his point, which makes him interesting. If you're going to watch the movie, just skip to the last 45 minutes, and expect there to not be an ending. It's about a group of young adults going into the middle of nowhere to meet the man who wrote the book on Damien, a serial killer who lives in Maddison County. When they get there, some of the townspeople claim that Damien doesn't exist, and the ones who admit that he does, are still of no help. If you read the last two sentences, you do not need to watch the first half of this movie. The movie is about an hour and 20 minutes long. It was a good idea, but needed some tweaking. Like, remove the entire middle half an hour from the movie, put the \"end\" where it belongs (in the middle...), and add an ending. Poof!! Good movie.",
         "\"He killed 33 people over the course of 2 decades and the townspeople didn't tell anyone.\" When a group of college kids travel to the small town called Madison County in order to interview the author of a book about a serial killer from there they are surprised when the first people the meet are hostel and have no idea what they are talking about. When they begin to investigate further into the town they realize that the stories were true. As many of you know by now I am positive that there are only 3 movies that they keep remaking over and over and while I watch 3-5 a week it is hard to surprise me anymore. This one is no exception. Group of kids...strange town...slow moving masked killer...yada yada yada. I will however say that this one did actually keep me interested enough to keep watching. The movie itself was actually pretty tense and there really wasn't that many over-the-top cheesy parts that made me laugh. This is still just another \"slasher\" movie but it is much better then some of the recent ones I have seen. Nothing to rush out and see, but not that bad either. Overall, a surprisingly decent slasher movie that is much better then the recent entries. I give it a B-.",
         "Madison County starts off with a group of college students on a mission to discover the truth behind a tell-all book which outlines a string of murders that happened in the remote town. Sounds promising right? Wrong. Unfortunately the dialog is so bad it is painful to watch because you feel bad for the actors. The camera work is shaky (and not in a good horror movie way), but just looks cheap. The director tries to develop the characters, but the dialog is just so bad you can't develop any connection to the characters and in turn the first half of the movies drones on without any reward. Maybe the only redeeming quality is that it isn't too long, so you won't feel like you wasted too much of your life.",
         "A-Z Horror Movie of the Day...\"Madison County\" (R - 2011 - US) Sub-Genre: Slasher My Score: 5.4 Cast=4 Acting=5 Plot=4 Ending=7 Story=5 Scare=5 Jump=5 F/X=6 Blood=7 Twist=6 A group of college kids travel to a small, mountain town called Madison County to interview the author of a tell-all book on the accounts of several grisly murders that happened there. Pretty much your basic stasher...college kids...mountain town...killer in a pig mask...nothing you haven't seen before. There is some solid blood and the ending had a little bit of originally to it. At best this is a mediocre slasher flick...I enjoyed it enough, as it had some of the elements I wanted in the genre. You could certainly do better, fellow horror lovers...but you could do a lot worse.",
         "lol....the new definition of bad = madison country.....really really bad film, don't know where to begin and where to end.... acting, filming, characters, story, effects.....everything is bad. so ... the ending too, i don't understand how someone can bring out this piece of crap.... to say some positive....the only good thing in this film is the cover, and that's all ! do your self a favour....skip it robert greetings from cologne, Germany",
         "Another great Halloween buy at my local Pound store. Or so I thought! Madison County is an indie horror that falls flat on its face by boring the viewer for the first 45 minutes, then torturing them with mild horror as the cliché bunch of all American teens run about screaming and flexing muscle... somewhat. On that, the cast was okay. Not bad, but not great! Direction was okay. Not bad, but could have been a lot better to help bring more excitement to things. I had high hopes for Madison County, but alas it was a one time watch that helped me sleep. Oh, what could have been!",
         "Potential spoiler warning, even though I am not trying to. This movie started out with the typical theme, and morphed into an even more predictable scenario. Frustration stemmed from watching people react in the most unrealistic way, when threatened with bodily harm. It is agonizingly frustrating to watch someone not display any potential insight to self preservation. And I don't think it's really realistic to leave your friend out in the middle of the woods, while you relieve yourself. Let alone turn your back to the woods, where the unknown could appear. I duped myself into believing that this one would be as good as a few others I had watched over the last two weeks. I was wrong.",
         "I personally love Slasher flicks, 70's and 80's jump to mind. This film tries to take itself seriously and makes you feel like you're watching another version of The Texas Chainsaw Massacrer. I liked the blurb on the back and the cover seemed promising, however it failed to do anything new. Five young adults in their early 20's go on a road trip to a town in the middle of nowhere called Madison County to interview an author who wrote a tell all book about a local Psychopath named Damien, who butchered and killed 33 people and the town covered up the murders. When they arrive, the locals are not too happy to see them. You can guess the rest. Madison County tires to emulate three of the major horror franchises. Firstly it tires to be a gritty and unsettling much like The Texas Chainsaw Massacre, small town with generic red necks and a sweet old lady who turns out to be in on the kills herself. The camera is shaky most of the time with close up's of rusted chains or hidden behind beams of a barn house, seeing only the back of peoples heads and again using the shaky cam to show you how gritty it is trying to be. Secondly it tires to build suspense much like Halloween except you get tired of watching these typical young people wonder around for the first 45 minutes of the movie, unlike Halloween where Michael himself was toying with his prey. Finally it tries to have violent and in your face kills much like Friday the 13th none of which are original. Damien is the pigged masked killer who like to throw his arms up and wale along with his victims trying his hardest to be demented again trying to be Leather Face but more evil. He walks with a bummed foot. It comes off as trying way too hard to be a new Slasher franchise for us Horror hounds to get into and Damien is the new poster boy for us to love and cherish like we do Michael, Jason, Freddy and Leather Face. the only good thing I can say about this movie,is a small quick scene near the end where the survivors miss seeing each other by a near second. This could have been a decent Slasher flick with it's premise, but it relies on tired over used clichés to bring in an audience. Madison County had promise, probably the reason I am so hard on it. It could have been a welcome change to the slasher genre."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Dunn-Rite Productions",
         "Southern Fried Films",
         "Swim with the Fish Productions"
      ],
      "summaries": ["A group of college kids travel to a small, mountain town called Madison County to interview the author of a tell-all book on the accounts of several grisly murders that happened there. But when the kids get to Madison County, the author is no where to be found and the towns people act like they haven't seen him in years. They also say that the killer never existed and the murders never happened. However, when the kids start digging around to get their own answers, they find out that the stories may be more real than the townspeople are letting on!"],
      "budget": 70000
   },
   "movielensId": 170323,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-05-08",
      "dvdReleaseDate": null,
      "directors": ["Eric England"],
      "runtime": 0,
      "movieId": 170323,
      "title": "Madison County",
      "mpaa": "",
      "actors": [
         "Colley Bailey",
         "Matt Mercer",
         "Ace Marrero",
         "Joanna Motomura",
         "Natalie Scheetz",
         "Nick Principe",
         "Adrienne Harrell"
      ],
      "imdbMovieId": "1687889",
      "originalTitle": "Madison County",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of college kids travel to a small, mountain town called Madison County to interview the author of a tell-all book on the accounts of several grisly murders that happened there. But when the kids get to Madison County, the author is no where to be found and the towns people act like they haven't seen him in years. They also say that the killer never existed and the murders never happened. However, when the kids start digging around to get their own answers, they find out that the stories maybe more real than the townspeople are letting on!",
      "tmdbMovieId": 77785,
      "avgRating": 2.375,
      "releaseYear": "2012",
      "numRatings": 4,
      "posterPath": "/ekyGuo6hhsT1RhNr9zV25JRWJla.jpg"
   }
}