{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116465",
      "video": false,
      "title": "Guy",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Guy",
               "gender": 2,
               "credit_id": "52fe4cb9c3a36847f823c20f",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Camera",
               "gender": 1,
               "credit_id": "52fe4cb9c3a36847f823c213",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Veronica",
               "gender": 0,
               "credit_id": "5a965cfd0e0a26543e0057b7",
               "name": "Kimber Riddle",
               "profile_path": null,
               "id": 180775,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56fce608c3a3684812001cd7",
               "name": "Michael Lindsay-Hogg",
               "profile_path": null,
               "id": 125543,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a965ca6c3a3685a02005012",
               "name": "Kirby Dick",
               "profile_path": "/89dwzpAQaQE2xRfXmUNQr7xuGg1.jpg",
               "id": 112588,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a965cd39251417b180051ab",
               "name": "Renée Missel",
               "profile_path": null,
               "id": 20168,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.342,
      "production_countries": [],
      "id": 167738,
      "vote_count": 1,
      "budget": 0,
      "overview": "A young, female filmmaker looks through her camera for an object to film. She wants to film the private live of an ordinary person and starts following Guy. He is very irritated about this girl following him, always looking through her camera, never showing herself. She does not even say her name but follows him even home to his bedroom. He tries to get rid of her but she does not stop. After a while he gets used to the camera and the girl behind it and tries to get involved with her. First she protects herself with her camera but cannot keep the barrier up. When their feelings and Guy's actions become too confusing for them Guy disappears mysteriously.",
      "similar": [],
      "original_title": "Guy",
      "runtime": 91,
      "poster_path": "/oRoFdCiztO09Af9f9ouke8tUVTi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-12-17",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "She was looking for something special. She found much more than she was looking for.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Lindsay-Hogg"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Kirby Dick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116465/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMTA0MjE1MV5BMl5BanBnXkFtZTcwNzMzOTQxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent D'Onofrio, Hope Davis, Kimber Riddle | See full cast and crew »"],
      "reviews": [
         "I simply cannot get enough of D'Onofrio. I have seen him in some clunker films; I've seen him in roles where I walked away thinking, `What the Hell was I thinking?!'.or more to the point, `What the Hell was he thinking?!?' This is NOT one of those films.nor is this one of those roles. I brought this movie home expecting a sort of attempt at Warhol-meets-Fellini-esque fair. Boy, was I off base. This is an immensely deep and oft-as-not deeply painful character study that forces the at-home voyeur to look inside the darker shadows of his or her own soul at times, to look at the most vulnerable - and thus, well-hidden - facets of our humanness, but it's of its own vein entirely. This film is character-driven, and it strives neither to idealize nor to indemnify either primary character (or their motivations) at all, just to illuminate them. It explores the things that make us tick, in the post-modern reality TV-driven, voyeuristic society we have created. The beauty is, it creates fictional characters who are far more real, touchable, enviable, pitiable and personal than any single seasonal product presented for our viewing enjoyment since the boon of this frenzy. I think this film is pretty Avant Garde in that it explored this phenomenon before it became the huge cash cow that it now is: pre- Survivor, Bachelor/Bachelorette et.al., ad nauseum... On the surface, this film is.well, it's pretty shallow. But the character interpretation and execution brings a depth to the movie that makes it very much worth exploring. It's about fear and desperation and shame. It's also about judgment. It's about how the choices we make to let people into our lives affect us far more personally than we sometimes like to think. And for that matter, how personal the very act of choosing to let someone in really is. Camera, played by Hope Davis, is a guerilla filmmaker who quietly charges into her latest subject, Guy's, life one morning as he walks onto the street. He first expects he's the subject of a Candid Camera prank, then of a stalker, and finally a mere object. Camera follows his every move, refusing to reveal her name, why she's filming him; but she also refuses to stop filming. Guy's life falls far short of idyllic anyway: he's holding onto his job, his girlfriend and even his home by a thread. Camera's arrival and subsequent pursuit sees to the effective dissolution of the things that sustain in his life, but he becomes obsessed nonetheless with the appeal of being watched. Camera vacillates between manipulation of his feelings and becoming an unsuspecting victim to her own. D'Onofrio's art is that of bringing utter humanity to the darkest of monsters.or is it the other way around? Therein lies the beauty: I have never, ever encountered characters that can somehow grate so much that I want to shake the teeth from their skulls, while I want to just hold them and make it all okay, at the same time. I vacillate. I've watched my share of the current RTV fare: I can start out empathizing with a character and decide that I just don't like them; I can start out hating a character and decide I wouldn't mind having that person as a buddy (even if, in small doses); but I just can't hold empathy for long enough either way to feel such conflict for any of them, really - and these are 'real people'. In this movie (like a couple of others that have made me a staunch fan of D'Onofrio's), I want to smack him AND hug him. I want to be offended sometimes, but I just can't because the things he expresses and the ways in which he expresses them are so intrinsically honest and real and.just human. This is a hard film to get your hands on here in the U.S., but if you have the opportunity, I'd highly recommend it. But be prepared to stare some of your darkest demons right in the eye for about ninety minutes: there is no escaping them in this vehicle.",
         "A fantastic comment on voyeurism and the media in modern times. A pioneer to the truman show this film echo's society's vicarious nature exemplified through the real life TV shows such as 'The real world' and big brother, but hints at the dangers of our own obsessions with others lives. Vincent D'Onfrio is amazing as Guy, an initally reluctant victim of a female filmaker's camera who begins to enjoy her attention.....which provokes consequences on his own sanity. A brilliant film.",
         "Two years before \"Truman Show\" hit the screen, this small, little-known production examined similar issues of voyeurism and viewer obsession. Call this the flip side of \"Truman Show\" -- he KNOWS he's being filmed, and eventually starts to enjoy it in a twisted fashion. Far from the feel-good dynamic of \"TS,\" this is rough, mean, sometimes brutal and perverse storytelling, but it is no less deeply profound because of it. D'Onofrio is brilliant, as always. Director Lindsey-Hogg makes the fantastic choice of having \"Camera\" actor Hope Davis be present for the whole shoot, and the story's dynamic is immeasurably enhanced. Highly, highly recommended for adventurous viewers.",
         "i just saw Guy on Sundance and I was completely flatten by it. That someone can make a movie of such impact with just one camera is amazing. Guy also succeeds because Vincent D'Onofrio puts out one Awesome performance as the subject of Hope Davis's camera. I cannot recall any actor putting it all out there like he does in this film. He gets striped of any artifact. You know you are not watching a real person, yet it is really fascinating to watch him, because as the camera follows you know that the ante is going to be raised with each passing hour. The movie is quite visionary in what was yet to come (reality TV). But this is more than that, Guy explores the subject of voyeurism from a complete different angle because this is not just an image of a person, you get the full character with all his pathos, and it pulls you right in as you start analyzing the need to be watched and the value of being watched. The movie is very clever in the interaction between the subject and the film maker. You really want to know more of the woman behind the camera, she speaks very few words and yet the few she says are very revealing. The urgency of certain statements reveals that this is not just a camera rolling, but that the cameraman is fulfilling some deep needs within her. This is not a movie for everyone, it will also get very polarizing opinions, you either love it by its rawness and its power to engage you and suck you into it, or you will find it as boring as following a pedestrian, but if your taste is a bit out of the ordinary watch it.",
         "Experimental films are praiseworthy for being just that. In the present instance, however, there is little else to recommend this one. Since most films are by nature dramatic, going beyond the commonplace by way of revealing truths requiring vivid action or language, one important measure to be kept in mind is that they are also selective of this or that bit of new or unique presentation allowing us to appreciate the art of the author, the director, or the actors themselves. Just aiming the camera and saying \"action\" and then allowing the thing to develop sans editing defeats any purpose intended. Guy is an example of home video run amok. Moreover it denigrates women in general by featuring a main character whose sole reason for existing seems to be draping his doughy body over every female in sight before vanishing into the mist. It just begs the question to try to justify this cinematic gambit by claiming how \"true to life\" or deeply introspective it might, as if by accident, be. Second-guessing the experiment, however novel it may at first seem, is not my idea of fun at the movies.",
         "Others here have commented enough on the plot, so rather than be repetitious I will focus on some of the themes. I was fortunate enough to catch 'Guy' the other night on the Sundance Channel. Having been inundated with commentary on reality television for some many years, I was not expecting to glean any new insights into the medium from this film. Much to my surprise and pleasure it seemed to really have something to say about the concept of \"the gaze.\" It is interesting to examine the film through the psychological lens of Lacan and also consider the gendered \"politics of looking\" so often spoken of in feminist theory. These concepts, I believe, are heavily present in the film. The reverse of the power dynamic alone (the female subject and the male object) in is truly fascinating and definitely makes it worth a viewing for those of you versed in feminist theory. It makes me wish I was still in college, so I could write a paper about it.",
         "This is a great movie, it gave me so much to think about. It provides an insight about feeling safe while you are being watched, in this film it's a movie producer but although it doesn't directly tell it, or maybe it doesn't tell it at all, it could have referring to your parents watching you or why some people believe in god and feel safe with the thought of god watching over them. And the best part is that it doesn't dictate anything, this movie is nearly like a poem, you can understand it in many different ways, and everyone watching it can understand or see something different from it. And the best part is that it has an open ending and you ask yourself what may have happened. I believe the writer knows the human psychology very well.",
         "The idea is brilliant and very well done .. what makes it interesting to watch is Vincent D'Onofrio's good performance which truly represents his mixed feelings about the unusual situation that he is facing. It also represents the good & evil battle within everyone's soul. \"The Truman Show \" is the only similar movie that I could think of at the moment. \"The Truman Show \" is big studio production yet it is far behind that movie which is based on simpler idea & cheaper budget that carries a much stronger message than Hollywood's garbage \"Truman's Show\". I felt it was annoying sometimes .. and when I finished watching it .. I asked myself did I feel that way because it was really annoying or because I am interacting with the movie? .. I think it is the latter .. which means the movie is good that you cannot be neutral while watching it, you have to take a side .. you should be part of the movie. It is not that great movie .. but it is nice little movie.",
         "The movie \"Guy\", from 1996, came to Mexico on September, 1998, probably because The Truman Show is about to be released here, and they are related in a certain way. The only valuable thing on this movie is the acting of Vincent D'Onofrio, who is excellent playing Guy. The story is plain and boring.",
         "It really bugs me when some lame piece of tripe like this, under the guise of 'art' gets puked up on a screen before me. Pretentious nonsense like this which pretends to be insightful and intelligent tends to ruin the reputation of the few good 'artsy' films that manage to get made. My only hope is that they put MST3K back on the air, so if anybody ever has to suffer through this pain parade can at least have a somewhat enjoyable time."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Filmstiftung Nordrhein-Westfalen",
         "KRRWH Inc.",
         "Pandora Filmproduktion"
      ],
      "summaries": [
         "A young, female filmmaker looks through her camera for an object to film. She wants to film the private live of an ordinary person and starts following Guy. He is very irritated about this girl following him, always looking through her camera, never showing herself. She does not even say her name but follows him even home to his bedroom. He tries to get rid of her but she does not stop. After a while he gets used to the camera and the girl behind it and tries to get involved with her. First she protects herself with her camera but cannot keep the barrier up. When their feelings and Guy's actions become too confusing for them Guy disappears mysteriously. However, he comes back; with a camera.",
         "A young woman with a camera follows a man around to make a documentary about him, something he is not very happy with."
      ],
      "budget": 0
   },
   "movielensId": 1705,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-12-17",
      "dvdReleaseDate": null,
      "directors": ["Michael Lindsay-Hogg"],
      "runtime": 91,
      "movieId": 1705,
      "title": "Guy",
      "mpaa": "R",
      "actors": [
         "Vincent D'Onofrio",
         "Hope Davis"
      ],
      "imdbMovieId": "0116465",
      "originalTitle": "Guy",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A young, female filmmaker looks through her camera for an object to film. She wants to film the private live of an ordinary person and starts following Guy. He is very irritated about this girl following him, always looking through her camera, never showing herself. She does not even say her name but follows him even home to his bedroom. He tries to get rid of her but she does not stop. After a while he gets used to the camera and the girl behind it and tries to get involved with her. First she protects herself with her camera but cannot keep the barrier up. When their feelings and Guy's actions become too confusing for them Guy disappears mysteriously.",
      "tmdbMovieId": 167738,
      "avgRating": 2.36111,
      "releaseYear": "1997",
      "numRatings": 18,
      "posterPath": "/oRoFdCiztO09Af9f9ouke8tUVTi.jpg"
   }
}