{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0406501",
      "video": false,
      "title": "7:35 in the Morning",
      "recommendations": [
         132370,
         102022,
         258945,
         128937,
         69916,
         135318,
         214157,
         80080,
         51887,
         104522,
         114745,
         352024,
         100052,
         94512,
         147986,
         84003,
         185354,
         51929,
         41785,
         189579
      ],
      "backdrop_path": "/tTaW2Js8aGfRjd60338VvZD9eVJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tipo",
               "gender": 2,
               "credit_id": "52fe4b269251416c910d1731",
               "name": "Nacho Vigalondo",
               "profile_path": "/pYgf9PwkQ1gPjus4bw3f27yGCrh.jpg",
               "id": 118303,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mujer",
               "gender": 0,
               "credit_id": "52fe4b269251416c910d1735",
               "name": "Marta Belenguer",
               "profile_path": null,
               "id": 1023515,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b269251416c910d1727",
               "name": "Nacho Vigalondo",
               "profile_path": "/pYgf9PwkQ1gPjus4bw3f27yGCrh.jpg",
               "id": 118303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b269251416c910d172d",
               "name": "Nacho Vigalondo",
               "profile_path": "/pYgf9PwkQ1gPjus4bw3f27yGCrh.jpg",
               "id": 118303,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 1.602056,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 152611,
      "vote_count": 14,
      "budget": 0,
      "overview": "A woman enters a restaurant one morning - only to be met with silence instead of people talking.",
      "similar": [],
      "original_title": "7:35 de la mañana",
      "runtime": 8,
      "poster_path": "/mxkuogkSwTMxnNUxmxTrnqkITaI.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "2003-01-01",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Nacho Vigalondo"],
      "runtime": 8,
      "synopsis": null,
      "writers": ["Nacho Vigalondo"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0406501/",
      "coverLink": null,
      "actors": [
         "Marta Belenguer",
         "Nacho Vigalondo",
         "Antonio Tato"
      ],
      "reviews": [
         "I was so glad I came across this short film. I'm always so disappointed that short films are hard to come across, so when I saw this and saw that it was nominated for the Live Action Short Film at the Academy Awards, I was so pleased that I actually had a film that I was rooting for. The plot is pretty simple, the director, writer, and star Nacho Vigalondo tried coming up with a reason people would suddenly break out into a song and dance number like they do in movie musicals. The result is extremely entertaining and the song is actually really catchy. It's a well made short film, well edited and the actors all do a great job. And the last shot of the film is perfect. I highly recommend this film.",
         "More directors like Nacho Vigalondo need a greater outlet for their talents. 7:35 De la mañana is absolute genius. What Nacho is able to convey in 8 minutes takes some Hollywood directors hours of film to achieve. I watched this smiling, but feeling a little dirty and not in the sexual way. You sit and wonder how you should feel after watching this 8 min. nugget. I was entertained, but was disturbed at the same time. Not many people can do that in just 8 minutes. It starts off simple enough. A young women comes in for breakfast at her usual place. She sits down and someone starts singing. From there, the film takes you through so many different emotions all at once it is hard to describe. It is in black & white, but this helps with the feeling the film gives you.This film makes you want to know more about the characters, how they interacted previously and how the ending impacted their lives afterward. I guess it like the old saying,\"Leave them wanting more\", Nacho Vigalondo is able to do that. Watch this when you can. Show it to your friends and wonder how 8 minutes can be so much fun without taking off your clothes.",
         "This is a masterpiece footage in B/W 35mm film. The film makes you see a strange way to begin the day at 7:35 am in a bar and how much things can happen there in 8 minutes. The short amazingly, gets you in a complex story using very little elements, and step to step makes you realize that something isn't totally right. It expresses a lot, makes your adrenalin go high with subtle details, and is incredibly understandable by anyone, not just the cinema critics experts. But I know how it sounds : European short, black and white and low budgeted. Don't let that scare you. Is really worth to see by anyone, not just experts in the genre. Isn't really much more to tell, since the film just lasts 8 minutes (exactly), and I don't want to spoil it. But I just watched it online and I couldn't understand why no one spent a few minutes to post a comment about it. Really worth watching it. 10/10.",
         "7:35 in the Morning, a short film by Nacho Vigalando, gives us a woman, a café full of people, and a man. The movie is a song, sung by a man (and by the others in the café whom he forces to sing) who is afraid of approaching the woman to whom he sings. It's all fun and games until the viewer realizes that the man has a bomb strapped to his chest and could kill everyone at any moment. The film displays a whole spectrum of human emotion, and that emotion is displayed in the woman, but also in the viewer. First, both the clueless woman and the viewer are stunned by the happenings in the restaurant, and then the viewer sees the whole event as a kind of hilarious romantic ballad dedicated to the woman. The woman's shock continues, and the viewer's laughter comes to an abrupt end with the revelation of the bomb. Then the woman is left with the memory of a man who says he loves her, but who is strangely suicidal and sadistic. The flattery of the man becomes strangely repulsive to both the viewer and the woman. Final Grade: A.",
         "A young woman in Spain enters her regular café haunt at 7:35 in the morning and finds something wrong . The usual staff are silent and don't acknowledge her greetings . The customers too are very nervous as they sit silently at their tables and she notices a duo in the corner holding a keyboard and acoustic guitar . Suddenly a man bursts out of the shadows and breaks in to song People always questions anything and everything \" What happens when we die ? \" How long is a piece of string ? \" \" How do the viewing figures of Doctor Who manage to stay so high after the constant rubbish we've been served under Steven Moffat ? \" but for me the only question worth asking is \" How far would you go to impress a woman ? \" and in this short film we see the ends one man will go to in order to achieve this The set up is fairly well done . The female walks in to the café and she and the audience know there's something out of the ordinary . This holds the audience attention then when the man starts singing his own lyrics which are obviously self penned gives away that he's a secret admirer of the woman and she's in his thoughts . I had this down as a story that was going to be a sweet story of unrequited love and may be a have a predictable happy ending to where the female customer and singer walk hand in hand in to the rising morning sun . This doesn't happen and becomes an entirely different film There is something that let's all this down slightly .and that is the reactions seem a little bit back to front . One is the character of the woman seems to be one step in front of the action almost like she knows what the coming plot turn is . One would have expected her to be more perplexed or confused at the singing or perhaps even flattered as the customers all get together to sing a song to her . I also find it a little bit too incredible that with the one exception the customers are able to go along with the coercion without fainting but I guess the audience are asked to go along with the laugh out loud absurdity of the situation without thinking about it too much and of course we're then asked to feel guilty at laughing n the first place I did notice on the Short Of The Week website that there's a line of thinking that it's conscious of the frivolous nature of the musical but this probably stretching things a bit too far . This is certainly NOT a musical genre film therefore the all too well rehearsed dance moves are a little bit too choreographed and far from spontaneous and couldn't possibly be learned in the time frame available . But what the heck this is one of the most enjoyable short films I have ever seen and if I hadn't seen Ted Marcus 2012 movie THE END then this short Spanish film might just have been my all time favourite . I am disappointed very few people have seen THE END but totally delighted a lot of people have seen this one . It also contains a great theme song that is instantly addictive . All together now \" One Two One Two Three seven thirty five in the morning ... \"",
         "This 2004 Oscar nominee is a very short b/w film in Spanish. A young woman goes into a café, gets a coffee, and notices a couple of musicians standing silently with their instruments. All the patrons are motionless, like mannequins. One guy, however, is quite jolly and breaks into a song about what goes on at 7:35 in the morning. There is one surprising moment after another until the end which is quite, well, surprising. The people, the place, everything looks quite ordinary. And like the musical piece \"Bolero\", the thing keeps building until the climax. With its structure, theme,movement and wit,it is an 8 minute masterpiece.",
         "If you're amused by straight-faced goings-on that are logical within a given illogical situation, you'll enjoy this whimsical 8-minute Spanish film. A woman enters a small café. The scene looks ordinary, but the counterman, customers, and two musicians seem somehow oddly subdued. Suddenly, the musicians play and one man begins to sing the title song , dancing across table tops with musical-comedy gestures. The customers, at first immobile, at intervals chime in (badly but gamely) with phrases from the song, read from slips of paper in their palms. On and off they jump up and dance (awkwardly but earnestly) in choreographed motions, like backup singers. But why??? the woman wonders. The answer is revealed as the soloist's jacket opens and she sees what's strapped across his chest -- just before the explosive climax... Even if you don't catch the song's (probably ironical) lyrics, the situation-perfect performances should give you a grin and a chuckle... I'd love to see it again!",
         "With a minimal budget, a running time of eight minutes and a great amount of imagination, Nacho Vigalondo has achieved one of the most moving shorts I've ever seen. The subtlety of the screenplay is really remarkable, since it doesn't give the ending away until the very last moment. Don't let anybody tell you what the short is about, since you'll be able to enjoy it a lot more. Nacho Vigalondo is the discovery of the year for his one-man show: directing, writing and acting in this formidable short is the most remarkable effort I've seen in years. Also pay attention to the performance of Marta Belenguer, her reaction shots are incredible. Overall rating: 8/10",
         "Good film. Tells a boyish fantasy story, telling us how trapped we are in social situations and what kind of extreme measures one has to take to behave differently. Or at least the feeling: that you have to break every rule if you are to break one. If you wanted to express love for someone you don't know, how would you do it without creating a pressing social situation? Also it's about the fascism of deciding over others cultural life, of what kind of culture that is jammed down our throats. What gives Disney or FOX or the suicide bomber the right to decide what is our choice. Are one not allowed to drink the morning coffee by one self. Do we have to listen to the NRJ shouting, see the stupid tabloid headlines and the street commercials before we even have had our morning coffee?",
         "After seeing the director's feature film Colossal I decided to check out his early short, and found it quite entertaining. Like Colossal, it defies expectations, creating a series of weird moments that cause the audience to redefine what they thought was happening just before. The movie seamlessly moves from mysterious to charming to disturbing without ever breaking stride. In the end you are left wondering how it all played out before the film started. How long ago did it start, how did it start? You don't know, and that's much of the beauty of this film; it has a sort of psychological tail (like Colossal) that keeps you thinking about it. I really have to see all this guy's stuff. He's fascinating.",
         "Splendid film that in just eight minutes displays an unusual genre mix: mystery, thriller, musical. Briefly, we are allowed to tell about the story: a girl comes into a European Cafeteria and then... Soft transit from nonsense mystery to narrative logic. In a no time, no place way Vigalondo managed a delight in B/W by means of imagination and despite (thanks to) the tightest of budgets. Because of the unity of time-space the film reaches the intensity of a short poem (almost a haiku). Spain, land of quick poetry in B/W (¿remember the early Buñuel?). A must see for reassuring our belief in young cinema outside the States.",
         "A woman, Mujar (Marta Belengur) enters a restaurant one morning at &:35 unaware that a terrorist has kidnapped the people in said restaurant & is making them act out a musical number in this strange yet fascinating short film, which I only saw by finding it on the DVD of the director/writer's equally fascinating \"Timecrimes\". It had a fairly catchy song & it somehow brought a smile to my face despite the somber overall plot to the short. I'm glad that I stumbled across it (wasn't aware it would be an extra when I rented the DVD) and wouldn't hesitate at all to recommend it to all of my friends. My Grade: A-",
         "Up until the end of this film, I was thoroughly captivated. This short film was very, very charming and cute--sort of like an old-time musical come to real life. The ending, however, undid pretty much the entire film, though it's obvious from other reviews and the Oscar nomination that others liked it just fine. A woman enters the same café she usually goes to but things are oddly different--it's very quiet. Then, out of the blue, one of the customers starts singing a song about a woman he loves but hasn't yet had the courage to meet. Then, and here's the charming and absurd part, each person in the café begins singing lines for this long and complex and very catchy song--like a giant musical number but done with \"real\" people who really can't sing. It seems later that they are all doing this because the man is crazy and is holding them all hostage. This and the final scene completely took me out of the moment. Up until then, I thought this was just a weird guy who enlisted the help of the patrons VOLUNTARILY. The hostage element and the final horrible (but darkly funny) scene completely ruined the experience--especially since we are in an age of terrorism and bombings. Clever but too dark and sick at the end. With a more appropriately upbeat ending, this film would have been great.",
         "10 years ago, \"7:35 de la mañana\" was the first directorial effort from Nacho Vigalondo. He also wrote it and plays a small part. Reception was pretty well as he scored an Oscar nomination in the live action short category, but lost to Andrea Arnold's \"Wasp\". I am usually a sucker for musicals and black&white movies and you don't find these genres too often in short films, especially the musical factor, so this one surely got me curious. The final result was very underwhelming though. The reference about crushing on somebody, but being too shy to talk to them was a good one, but the rest of the film comes rather short. The scenes where nobody was talking to the woman at first were as uninteresting as the musical number that followed shortly afterward was kitschy. Despite the accolades, it looked to me that Vigalondo was still trying to find his style here. Not recommended unfortunately as this one had a couple really interesting ingredients as mentioned before, but the final meal wasn't particularly delicious."
      ],
      "genres": [
         "Musical",
         "Short"
      ],
      "productionCompanies": ["Ibarretxe & Co. S.L."],
      "summaries": ["A woman enters a restaurant one morning - only to be met with silence instead of people talking."],
      "budget": 0
   },
   "movielensId": 170571,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": null,
      "directors": ["Nacho Vigalondo"],
      "runtime": 8,
      "movieId": 170571,
      "title": "7:35 in the Morning",
      "mpaa": null,
      "actors": [
         "Nacho Vigalondo",
         "Marta Belenguer"
      ],
      "imdbMovieId": "0406501",
      "originalTitle": "7:35 de la mañana",
      "genres": [""],
      "youtubeTrailerIds": ["ziqvcJsKUoE"],
      "plotSummary": "A woman enters a restaurant one morning - only to be met with silence instead of people talking.",
      "tmdbMovieId": 152611,
      "avgRating": 3.75,
      "releaseYear": "2003",
      "numRatings": 6,
      "posterPath": "/mxkuogkSwTMxnNUxmxTrnqkITaI.jpg"
   }
}