{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "commercial",
            "id": 1004
         },
         {
            "name": "surreal",
            "id": 3307
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "spoon",
            "id": 13007
         },
         {
            "name": "banana",
            "id": 33573
         },
         {
            "name": "commercialism",
            "id": 201069
         },
         {
            "name": "anus",
            "id": 211427
         }
      ],
      "imdb_id": "tt0234588",
      "video": false,
      "title": "Rejected",
      "recommendations": [
         32531,
         32539,
         32535,
         32533,
         129303,
         49273,
         160332,
         128679,
         129614,
         145860,
         94570,
         134758,
         148176,
         153599,
         44341,
         56619,
         48504,
         52954,
         162551,
         129863
      ],
      "backdrop_path": "/fTbt4hBVjpJ5OdoR4nAS0zToOVX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Guy #1 / Guy #2 / Fluffy Guy / Ticks Announcer / Left Hand Characters",
               "gender": 0,
               "credit_id": "56fed8ca9251416cc20027d8",
               "name": "Robert May",
               "profile_path": null,
               "id": 1599578,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Spoon Guy / Banana / Queen of France",
               "gender": 2,
               "credit_id": "52fe44d69251416c9101e853",
               "name": "Don Hertzfeldt",
               "profile_path": "/oYbH5QOQn9RltxUJgepY94KrXs1.jpg",
               "id": 109314,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe44d69251416c9101e873",
               "name": "Jennifer Nyholm",
               "profile_path": null,
               "id": 109317,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d69251416c9101e849",
               "name": "Don Hertzfeldt",
               "profile_path": "/oYbH5QOQn9RltxUJgepY94KrXs1.jpg",
               "id": 109314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d69251416c9101e84f",
               "name": "Don Hertzfeldt",
               "profile_path": "/oYbH5QOQn9RltxUJgepY94KrXs1.jpg",
               "id": 109314,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56fed2209251412860001d89",
               "name": "Rebecca Moline",
               "profile_path": null,
               "id": 1495977,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56fed2359251414c7a000994",
               "name": "Tim Kehl",
               "profile_path": null,
               "id": 1599543,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.078809,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32536,
      "vote_count": 63,
      "budget": 0,
      "overview": "An animator's commissioned works, rejected because of their increasingly absurd and violent tone (reflecting the animator's own progressive breakdown)",
      "similar": [
         181886,
         1429,
         1903,
         4593,
         638,
         34647,
         626,
         24152,
         2265,
         23160,
         13318,
         20347,
         14874,
         3511,
         18193,
         5237,
         26945,
         409164,
         46624,
         207278
      ],
      "original_title": "Rejected",
      "runtime": 9,
      "poster_path": "/vbci2t9eg4l7fmPzyBaa0OFiyYP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Bitter Films",
         "id": 63349,
         "origin_country": ""
      }],
      "release_date": "2000-07-25",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Hertzfeldt"],
      "runtime": 9,
      "synopsis": null,
      "writers": ["Don Hertzfeldt"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0234588/",
      "coverLink": null,
      "actors": [
         "Robert May",
         "Jennifer Nyholm",
         "Don Hertzfeldt"
      ],
      "reviews": [
         "From the same guy that brought us \"Billy's Balloon\" (the cartoon where the poor kid is being tormented by his homicidal balloon and \"Ah L'amour\" (where a guy is viciously torn apart by women he meets) comes \"Rejected\", perhaps one of the most twisted pieces of animation ever captured on film. The end result is connection of absolutely bizarre stick-figure animated vignettes that make very little sense, although they are absolutely hilarious to watch. Through the course of the film, they progressively make less and less sense, until the animated world literally falls apart. A huge step-up from his previous works, Dan Hertzfeldt's \"Rejected\" is stylistically simple, although very expressive and a huge technical achievement. And it's very, very funny. You thought the kid getting abused by his balloon in \"Billy's Balloon\" was funny? Wait until you see what happens when a guy wearing a normal hat walks into a room with a sign that says \"Funny Hats Only.\"",
         "\"Rejected\" is a brilliant animated digression which is understated as it pertains to the animation, but a three ring circus that is both genius and insane with it's bizarre yet exponentially hilarious dialogue. The soundtrack is also ecclectic yet highly effective. This short receives my strongest rec. It is an aquired taste, but worthy of your mental digestion.... and with a spartan but effective runtime what do you have to lose? \"My spoon is too big\".... drawing with his left hand.... the instability of his cartoon world.... and the deleted seqeunce are classic. \"Rejected\" (2000) = A (add + for animation fans)",
         "I don't know what Buff-17 was talking about when he submitted his review of the movie... Perhaps he had a cup of tea, and sat alone in his house with darkened lights to watch it in full surround sound... Buff, I think you were simply looking a bit too deep. I saw this film for the first time at Spike and Mike's film festival with a group of my friends. You aren't missing any jokes, buff - in fact, you are looking so hard you are missing the point. It is funny because it's so incredibly ridiculous.. and original. Now then, this film is the funniest animation of all time. I laughed myself to tears (never happened before) watching the previous work, \"Billy's Balloon,\" but this one.. by the end, I could not see the theatre screen. I was having trouble breathing. And no, I'm not one of those annoying theatre types that bellow at the screen any time a fart joke is spoken. This truly is an amazingly funny movie. The whole theatre was in uproar throughout most of the film. If you enjoy a good laugh, then this is a MUST SEE MOVIE.",
         "Anyone who loves absurdity should watch this cartoon. I can't put it into any more simple terms. A friend of mine just showed me this film, and it blew my mind. I'm a huge fan of spontaneous/absurd/random humor. I love the work of Jhonen Vasquez, a comic book writer. This film reminds me of what might have happened had Vasquez started using animation earlier in his career, circa his \"Bad Art Collection.\" If you are looking for deep meaning or warm emotions, go watch a drama. If you are looking for something completely different (as a certain group of British fellows who were also fond of absurdity might have said), then find or buy a copy of this and watch it. Don Hertzfeldt's \"Rejected\" is shocking, and it is meant to be. It also serves as a comment on commerciality and its effects on the creative spirit. But, really, the meaning is not the most important part. Some people who have commented on this movie have questioned the validity of the companies for which these \"rejected\" ads are supposedly made. I believe that is like going to watch Superman and saying \"Ya know...I don't think Planet Krypton is real. I can't watch this.\" It's called \"a willing suspension of disbelief.\" Whether or not these are REAL rejected advertisements is unimportant. Just watch the film as if they are real, and try to imagine how you'd react if you saw such an ad on a Family-based channel. That is really the only joke there is to get. If you can get through that, there is no doubt that Hertzfeldt's simple cartoons and their absurd and brief lives will make you laugh, and can make you enjoy your own life in our absurd world. Somewhere in between \"Un Chien Andalou\" and \"Ren and Stimpy\" lies \"Rejected\", an amazing piece of surreal animated bliss.",
         "I went round my friend's house once, and he showed me this cartoon. It is possibly one of the funniest things I have ever seen. Right from the beginning, we see something so wonderfully non-sensicle, as a cartoon boy holding a large spoon, ranting 'my spoon is too big', and then a banana enter and state that he is a banana. The general idea of the film is that it is a series of adverts made for the family learning channel, and various different food products, which were rejected. As the film goes on, we see Don's confidence in creating cartoons gradually fall, as he descents into madness, drawing cartoons with his left hand with bizarre backwards talking, until eventually, his world collapses. The funniest part is probably where we see a fluffy cloud type thing preaching about how great everything is. His anus then starts to bleed and eventually he is washed away by the blood. I urge anyone with a sense of humour to get hold of this short, as there is a good chance you could wet yourself watching it.",
         "When I first saw this film, it was with all the other Oscar-nominated short films for 2000, animated and live action. The set took about 2.5 hours to get through, and being the cream of the crop from the year, these were some brilliant, well polished movies, though I was ready to be done. The last film was Rejected. The opening sequence is simply the word \"REJECTED\" in a typewriter font shaking around as though it had been shot on a hand-held 8mm camera held by someone on speed, and the music, an orchestra at full tilt. Instantly, I knew something was different. Within 40 more seconds, my friend and I were doubled over in our seats and crying from laughter. I bought the DVD as soon as it was available to share with all of my friends and that disc has been played more than all of my other DVDs combined (I particularly enjoyed the director's commentary). It confuses a lot of people but elates the rest, but everyone can appreciate the last two minutes as a great piece of animated film.",
         "Rejected (nominated for an Academy Award) is quite simply one of the most stupid, insane pieces of American animation to come in this new decade. There's no plot, just a series of little animated short films by Don Hertzfeldt, an animator who wanted to get some commercial spots with his ads. The result is what's before you, what was entirely rejected, yet repackaged here for the public. Some shorts involve almost nothing at all (albeit with a surprising words from the creatures), others involve surreal images of talking bananas, weird dancing things, and an bleeding incident. The first time I saw this film, it was a very funny way to kill ten minutes. I watched it with an audience at my university, and almost all of us were cracking up. But then when I watched it again with other friends, I didn't laugh as hard, and they didn't laugh at all. So really, besides the aesthetic interest in the film (sometimes the animation starts to deconstruct on itself, with repeated scribblings put to focus), it's a very subjective viewing. You can either lose yourself in the ridiculousness and catch phrases, or be completely turned off by the lengths to which is wants you to laugh. But it is very memorable, and it's the kind of film I want to see again in several months to a year, when it will be even fresher.",
         "This is one of the most wonderful pieces of filmaking ever. And I don't mean that in a sarcastic sense. The happiness I felt through those 9 minutes can be surpassed by very little, except Waiting for Guffman. I recommend watching this with your closest friends because if they are as twisted as you are they will appreciate along with you. Hertzfeldt creates a wondeful tapestry of stick-figured scenes that makes you want to just stare in bewildered joy for hours. Anyone who does not appreciate this film is not worthy to live. How could you not love this movie, the spoon...it was too big...if he tried to eat the cereal...it wouldn't work...and there was a banana. He was wearing a normal hat...he was beat. It's genius...he was a consumer whore!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! See this movie first thing tomorrow, you'll really be glad you could partake in this twisted bit of life, which reminds me of something I would dream up with my friends in a moment of extreme boredom.",
         "i saw this the first time at the spike and mike festival in austin... i could not stop laughing. nobody else could stop laughing. i was holding my face because it hurt so much from laughing. if you are one who thinks that good old clean jokes about anything crossing any roads, no, this may not be for you. but if you have a sense of humour, and would like to see something new and different, then please watch this. i've seen it a few times since then (it's been a few years) and laugh just as hard every time. if you do enojoy it, make sure to check out some of his other clips.",
         "If you like absurdly funny movies, you'll love this. It's completely random, amazingly creative, and just plain funny as all hell. As for some of the negative comments, the \"fake commercial\" premise is not supposed to be confusing; it's just funny to see disturbed cartoons followed by a Family Learning Channel tag. Trust me, watch this, and you won't be disappointed",
         "This movie is not for those without a sense of humour. If you like crazy, off the wall stuff, and know what \"funny\" means, you will love it. Ignore all other comments to the contrary.",
         "Like \"Monty Python and the Holy Grail\", for me this film is a shot of pure cinematic joy. I could barely breathe from laughing so hard the first time I saw \"Rejected\" in a movie theater and to this day I can't stop smiling when I think about it. It is a masterpiece of surrealism and absurdism and there is not a second wasted in its 10 minutes. I feel really lucky to have found a film that is this free of pretension and unashamed in over-the-top spirit. And for those of you who like deeper meanings, there is plenty here to think about: psychology, sociology, and more directly, pop culture consumerism. Now that my family has the DVD we must have seen this several hundred times by now and it still does not get old. In short this film makes me happy. Very, very happy. In response to \"film-crazy\"'s review: Don Hertzfeldt has stated many times that he's not happy with all the illegal bootlegs of his movies on the internet, so it saddens me that somebody here would recommend downloading bad quality versions of his cartoons instead of seeing them properly. Bootlegging is wrong but bootlegging an indie artist is despicable. Let's be more supportive please! Don's official site has all the info about where to see his movies properly",
         "Without question one of the most influential animated films of the last 20 years. Surreal, hilarious, excellent, and truly original! This film is a bizarro piece of pop culture that doesn't ever seem to age. You absolutely MUST see this film in a real movie theater or on the official remastered BitterFilms DVD - if you're reviewing this film based on a bootleg you downloaded from the internet, you're not only seeing a big screen movie in very poor quality, but in all likelihood it's been re-edited and butchered by the bootleggers. I can only imagine that the handful of negative reviewers here downloaded a bootleg and did not in fact see REJECTED in all its glory! Highest possible recommendation!",
         "May be a Don Hertzfeldt animated short is not really your taste. The first experience I had with the animator was 'Billy's Balloon' which is very sadistic, it shows balloons attacking children, but it's also one of the funniest shorts I have seen. 'Rejected' is less sadistic, but a lot more disturbing; if you didn't like 'Billy's Balloon' or other Hertzfeldt-work you will not like this one either. It starts with showing some commercials the animator has made. They are disturbing, violent and therefore rejected by the people who gave him the assignment. All the rejections lead up to a breakdown the animator has, something we see in a brilliant piece of animation. Telling you more about the story we see would spoil things for you. The animation itself is terrific. It has some very simple looking things in it, the way 'Billy's Balloon' was animated, but the \"breakdown\"-part I mentioned above together with some other special effect sequences look amazing. The way the whole thing is presented is pretty inventive as well. Even the classical music is perfectly chosen. Another great short from animator Don Hertzfeldt.",
         "I can only echo the comments of most the reviewers here. This movie is purely absurdity from beginning to end. The humor comes from the fact that it makes absolutely no sense at all, but at the same time makes perfect sense. I always find myself ripping out a person's torso, putting on my head, the extending and waving my arms saying, \"I'm the queen of France.\" The last sequence is what really makes this film for me. It goes from just a series of violent and non-sequitur jokes to wrapping up the entirety of the world in some sort of absurd apocalypse. The effects used is this were absolutely amazing, but it's hard to even notice them the first couple times through given how hard you should be laughing. Of course, I can see how some people just don't get it. There are absolutely no real jokes ala Leno and Letterman. It's just pure absurdity at its best. 9/10",
         "Some of my friends accidently found out about this film on the internet one day and from there it spread by word of mouth across the school to me. I was skeptical at first, but when I watched it I could not stop laughing! The absurdity of the segments (which were sent to the ficticous \"Family Learning Channel\" amongst other things) get more violent, absurd, bloody, and hillarious right down to the cataclysmic ending. It's definatly worth a watch, and I believe it is out on DVD now **** of ****",
         "Well, don't expect it to be for everyone. Its weird, silly, absurd, very minimalistic and downright crazy. I can understand how some people will hate it for the exact same reason why I love it, but who cares? For people into extreme animation this is funny as hell. The short movie tells us the comical story on how Don Hertzfeldt(the maker) gets assignments from big corporations to make commercials, and all of the commercials he makes gets turned down. Some of it is quite violent, but in a way that makes you laugh though. Recommended indeed. A.",
         "Like i said in the forums: Please tell me that it's all a joke, because this was really stupid and there was absolutely nothing funny about it. I mean, I kind of understood it and deep down inside, I assumed I was going to laugh, but I did not, not at all. I was just staring at this thing with my eyes wide open and asking myself, why am I watching this. I was going through the reviews and almost got a tear in my eye, praying to God: \"PLEASE tell me that this is a joke\". Maybe it's meant for below 14 year olds, then I can understand, but if not, then it is a total mystery to me. Now don't get me wrong, I have a good sense of humor. I love films like \"Top Secret!\", \"The Naked gun\", \"Hot Shots\", but this, this thing is not worthy of even a zero or the 9 minutes it stole from my life.",
         "Deserved revenge in the film business must come rarely. I don't for a minute believe that Hertzfeldt is blameless in how he dealt with \"the suits,\" but I've had enough dealings with them to serve them any insult possible. I first encountered Hertzfeldt's work in \"A L'amour\" done before this. It has him approaching different women and saying innocuous things \"Betty, those are nice shoes\" and having her chainsaw out his heart and eat it. This stuff is along the same lines, a little less powerful and more uneven. But what makes this something you'll remember for a long time is the stuff done after the initial rejected bits and the faux ads. Its the stuff where the cartoon itself begins to disintegrate. It is a literal example of self-referential folding: the paper crinkles and destroys the world. This is probably the second best of his stuff. See \"Genre\" if you can. Ted's Evaluation -- 3 of 3: Worth watching.",
         "This film has become an institution among myself and my friends. We are unable to have a night out now without all shouting at the top of our voices \"Ma spoon is too big\" or the favorite \"My anus is bleeding\" It is sheer class and I even got given a big spoon for my birthday!! It doesn't make sense and is not supposed to make sense. It is just the work of a warped mind and seems to bring out a little bit of madness in all who view it.",
         "A short animated film which is difficult to put into words. Well, no it isn't. It's quite simple really: \"FUNNY AS HELL!\" A masterful work which spoofs the animation industry and the commercial industry with such bizarre class, it's truly an amazing work. The short captures a perfect balance by going completely over the top. The short was to be featured on Cartoon Network's Adult Swim (ads were even shown up to a week before it's air date), but the short lived up to it's title by being pulled at the last moment because of the words \"Sweet Jesus,\" but rumored to be just an excuse since the heads just didn't get it. Hopefully this comment will quickly become outdated with the airing of 'Rejected.' Buy the DVD(s), and prove a lot of network heads wrong.",
         "This short film is brilliant. I do not use this word frequently, but I will use it to describe 'Rejected'. It quite literally blew my mind the first time I viewed it, and I have never fully recovered. Do whatever it takes to see this movie.",
         "Metaphorically at least. This is one funny movie, it is a wonder that my insides are still in the right place after laughing at this so hard. I'd like to extol its many virtues, but every time I try to start analyzing it, I end up in a giggling heap. Suffice it to say that this is without any question the best and funniest short animation I have ever seen. To my shame I have to admit to only having seen a pirated version of this great flick, but hopefully one day I'll have the opportunity to see it in its full glory. Since the animation is quite inventive towards the end, it would probably be quite interesting to see the film on a big screen, but alas, no such opportunity has arisen.",
         "I stumbled upon some Web-hype of this short film, easily found it online, and wondered how it ever achieved much status. It comes off as a work of minimal effort that became a curiosity because it was different. But different doesn't mean good, per se. The \"jokes\" are mainly of two types: 1) Discontinuity, with people saying things that don't make sense. No particular skill is needed for those bits. Here's my effort: \"It's raining outside!\" \"My turtle just ate my fish!\" 2) Huge amounts of blood coming out of various wounds, spontaneously or through violent acts. The animator comes off as simply twisted, not a twisted genius. Gags are predictable; you know an innocent scene will turn bloody \"just because.\" Is gratuitous gore funny? I guess people who like sick, vapid stuff like \"South Park\" might find \"Rejected\" appealing, but for me it's just...rejected. I rated it a \"3\" because it's at least somewhat original in its crassness."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["Bitter Films"],
      "summaries": [
         "An animator's commissioned works, rejected because of their increasingly absurd and violent tone (reflecting the animator's own progressive breakdown), eventually find their entire animated world collapsing in upon itself.",
         "A hilarious collection of animated television commercials that were rejected because of their creator's failing grip on sanity."
      ],
      "budget": 0
   },
   "movielensId": 170635,
   "movielens": {
      "languages": [
         "English",
         "svenska"
      ],
      "releaseDate": "2000-07-25",
      "dvdReleaseDate": null,
      "directors": ["Don Hertzfeldt"],
      "runtime": 9,
      "movieId": 170635,
      "title": "Rejected",
      "mpaa": "",
      "actors": [
         "Robert May",
         "Don Hertzfeldt",
         "Jennifer Nyholm"
      ],
      "imdbMovieId": "0234588",
      "originalTitle": "Rejected",
      "genres": [
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": ["9l7sxPLhOQk"],
      "plotSummary": "An animator's commissioned works, rejected because of their increasingly absurd and violent tone (reflecting the animator's own progressive breakdown)",
      "tmdbMovieId": 32536,
      "avgRating": 3.6875,
      "releaseYear": "2000",
      "numRatings": 40,
      "posterPath": "/vbci2t9eg4l7fmPzyBaa0OFiyYP.jpg"
   }
}