{
   "tmdb": {
      "original_language": "ru",
      "keywords": [{
         "name": "amphibie",
         "id": 9044
      }],
      "imdb_id": "tt0055844",
      "video": false,
      "title": "Amphibian Man",
      "recommendations": [
         41043,
         127608,
         72199,
         79216,
         97666,
         83524,
         129229,
         20946,
         56477,
         164013,
         270393,
         72204,
         321015,
         165095,
         273126,
         65594,
         6029,
         45227,
         27937,
         65142
      ],
      "backdrop_path": "/7VfeVoYfK8Jc0DGPBVdXt6KZmJI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1006,
               "character": "Ichtyandr Salvator",
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1b5",
               "name": "Vladimir Korenev",
               "profile_path": "/qofCBIQawYR1QsZpJNkXet7YZLG.jpg",
               "id": 549134,
               "order": 0
            },
            {
               "cast_id": 1007,
               "character": "Gutiere Baltazar",
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1b9",
               "name": "Anastasiya Vertinskaya",
               "profile_path": "/wzTaaJHAnmhFeXKcPWQd3Vs5Zjx.jpg",
               "id": 99261,
               "order": 1
            },
            {
               "cast_id": 1008,
               "character": "Pedro Zurita",
               "gender": 2,
               "credit_id": "52fe4659c3a36847f80fa1bd",
               "name": "Mikhail Kozakov",
               "profile_path": "/1dxQjA09IgzP9f2KoUMWJxuAi6c.jpg",
               "id": 143725,
               "order": 2
            },
            {
               "cast_id": 1009,
               "character": "Old Baltazar",
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1c1",
               "name": "Anatoliy Smiranin",
               "profile_path": "/3hi36n2PUFdeUPvwv4wtnQy8kpN.jpg",
               "id": 549135,
               "order": 3
            },
            {
               "cast_id": 1010,
               "character": "Prof. Salvator",
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1c5",
               "name": "Nikolai Simonov",
               "profile_path": "/oVNe2j3P9MjVlhMAp3kPL0pqFTU.jpg",
               "id": 549136,
               "order": 4
            },
            {
               "cast_id": 1011,
               "character": "Olsen",
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1c9",
               "name": "Vladlen Davydov",
               "profile_path": "/vdbZaSlOebeaiduiCH5rSAbXe70.jpg",
               "id": 549137,
               "order": 5
            },
            {
               "cast_id": 1014,
               "character": "Street vendor of fish",
               "gender": 2,
               "credit_id": "52fe4659c3a36847f80fa1d9",
               "name": "Yuri Medvedev",
               "profile_path": "/mSaFKi7I8zmxIaWLUqBW3GUMotL.jpg",
               "id": 86852,
               "order": 6
            },
            {
               "cast_id": 1015,
               "character": "полицейский",
               "gender": 2,
               "credit_id": "58c2ff92c3a36850d1000f7f",
               "name": "Aleksandr Zakharov",
               "profile_path": "/ybYOvRYUFag2e7ubcXJo8RXh0zW.jpg",
               "id": 1773945,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa193",
               "name": "Vladimir Chebotaryov",
               "profile_path": null,
               "id": 549128,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa199",
               "name": "Gennadi Kazansky",
               "profile_path": null,
               "id": 99386,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4659c3a36847f80fa19f",
               "name": "Александр Беляев",
               "profile_path": "/neVlaeHAfYBvb0YqPrUsouHLxU0.jpg",
               "id": 549129,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1a5",
               "name": "Akiba Golburt",
               "profile_path": null,
               "id": 549130,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4659c3a36847f80fa1ab",
               "name": "Aleksei Kapler",
               "profile_path": null,
               "id": 549131,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1b1",
               "name": "Aleksandr Ksenofontov",
               "profile_path": null,
               "id": 549133,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1cf",
               "name": "Andrei Petrov",
               "profile_path": null,
               "id": 549138,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4659c3a36847f80fa1d5",
               "name": "Eduard Rozovsky",
               "profile_path": null,
               "id": 549139,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.908843,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 43685,
      "vote_count": 14,
      "budget": 0,
      "overview": "People living at the seashore town are frightened by reports about the unknown creature called \"the sea devil.\" Nobody knows what it is, but it's really a son of a doctor Salvator. The doctor performed a surgery on his son and now young Ihtiandre can live under water. This gives him certain advantages, but creates a lot of problems.",
      "similar": [],
      "original_title": "Человек-амфибия",
      "runtime": 82,
      "poster_path": "/hPir618kFlOgAcruIt1xITuSoAV.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Goskino Productions",
         "id": 383,
         "origin_country": ""
      }],
      "release_date": "1962-01-03",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Vladimir Chebotaryov",
         "Gennadiy Kazanskiy"
      ],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Aleksandr Belyaev",
         "Akiba Golburt"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0055844/",
      "coverLink": null,
      "actors": [
         "Vladimir Korenev",
         "Anastasiya Vertinskaya",
         "Mikhail Kozakov"
      ],
      "reviews": [
         "I loved this film for many reasons. Most people who saw it, saw it as children on late night TV, but I didn't get to catch up with it till now. It has a lovely heart to it and although certainly naive and simple for todays standards, it possesses a warmth that is so often missing from other mostly american films of it's Genre and time period. Certainly there are some strange aspects to it. The setting - which is either Spain or Mexico clashes with the Russian language and the Greek, Spanish and French character names. Perhaps this is done to give a sense of internationalism to the film. But the thing I loved most about this film is it's social rather than political subtext. While many of this 1960's SCI-FI Genre concentrate on Nuclear accidents, fear of technology etc, Amphibian Man is instead concerned with the world that is created by simple human greed and cruelty. There is no BIG threat here, only trying to exist in a world that is made by men who are greedy and selfish. It is interesting to see that while US cinema was hysterical about the threat of nuclear technology and specifically the threat of Communist Russia, This Russian Film was more concerned with working within the world as it stood and looking at the problems that do exist rather than scaring people with over the top nuclear threats. The Amphibian Man is not created by accident - but by scientific technology, and the purpose is not as a weapon but as a social advance. Even the \"evil\" Don Pedro - never thinks of using the \"sea Devil\" as a weapon but only to collect pearls and increase Pedro's personal fortune. It is a truly interesting movie, allowing me to see another mind set of that era that is not the American one. And the bittersweet ending is far from unsatisfying.",
         "A a former Soviet Citizen, I will take my responsibility seriously and will start commenting on as many stories behind the wonderful heritage of Soviet cinema as possible. This film is based on the novel written by a great Russian sci-fi writer Alexander Belyaev. It was a record-breaking film when it came out in the cinema houses all over the USSR in the early 60's. Even though the beautiful star of the Soviet film era, young Anastasia Vertinskaya (Gutierrez), was known to the audiences from her previous works, theater actor Vladimir Korenev ( handsome Ixtiander) \"woke-up famous\" and instantly became a desire of almost every woman in the country. The title song about a SEA DEVIL was on everybody's lips ever since. In order to closest resemble the scenery of a beautiful Latin country, the movie was shot in sunny Baku, Azerbajan. The idea of a sea-devil lurking in the waters near the shores and scaring people sets up the mood of the movie. However, the devil turns out to be a handsome young man with an inhuman trait- he is an amphibian. A romantic story starts to unfold when he falls in love with a gorgeous girl. Matters become complicated as the girl is about to get married to somebody else... It is a beautiful movie which is a pleasure to watch even today. If some parts of the film seem poor compared to today's film-making standards, they are easily forgiven due to the beauty of the scenery, interesting plot, striking-looking actors and their sincere acting approach to their characters. If you appreciate good international cinema and want to familiarize yourself with Soviet pop culture and the work of one of the world's best sci-fi writers, I highly recommend this film. It is full of mythical mood, great scientific fantasy mixed with true portrayal of human emotions. I recommend this film to every romantic at heart!",
         "'Amphibian Man' is one of the oddest movies I've ever seen. From the title, and the initial premise - poor fishman and their families are frightened by an unknown monster they nickname \"the sea devil\" - you might think you're in for a 'Creature From The Black Lagoon' style monster movie, but this movie is a completely different thing. What kind of \"thing\" it is exactly is difficult to summarize, because I can't honestly think of any other movie I've seen which is quite like it. Technically SF, but more of a fantasy romance in execution. It is a very unusual but charming movie. The \"monster\" turns out to be the son of a local benevolent scientist who has had shark gills transplanted into his body and has a secret underwater life. He falls in love with the beautiful daughter of a local fisherman who has been betrothed to an ambitious cad she doesn't love. It is a marriage borne of economic necessity. Pretty soon Amphibian Man and Ambitious Cad clash and our hero finds himself persecuted, and eventually kidnapped. I really enjoyed this film, it has quite a unique, eccentric feel to it and has some genuinely touching moments, and even a song or two. The production values are quite impressive for the era, the premise is interestingly handled, and the acting is generally above average. I was fortunate enough to watch the Russian print with English subtitles. I believe there are some badly dubbed versions of this movie around so try and avoid those if you can and see the original to fully appreciate this little gem.",
         "Perhaps this is one of the best Sci-Fiction film ever produced in the history of cinema for its content. Its presentation may not be the best due to color problems and very much evident make up of the actors and actresses. I assume that the story was going on in a territory of any Latin American country, probably Mexico. The plot is about a young man able also to live normally in the sea. His father, a scientist and physician, built up a laboratory in the depth of the ocean where his son passes part of his life. Being a rare organism, his father always warned him not to visit nearby city, but love came over when he met a nice lady sinking in the sea, and with this all problems started. The film showed that early 60s the Soviet directors and producers were not very much aware of the music in Latin America. Dancing was Spanish-like and not Latin American as such. Names chosen for the heroes of the film were also rare. The lady is called Gutiere when Gutiérrez is a common surname in Spanish, then Ichtiandros is the name of the main actor of the film, again an invention. In any case, it is nice to see several shots made in the sea, in a really beautiful environment, and also to see nice diving and swimming of various actors. Excitement is also assured in this material. However, it does not have the Hollywood-Happy End. It is more realistic in its end. The film has also its morale showing the miseries of people trying to make money, no matter if it is playing with the life of a human being.",
         "I also saw this movie as a kid on late night TV. I never forgot it and would love to see it on DVD. I think it was the first time I fell in love. The leading man/fish is one of the most beautiful and sweet characters I had ever seen.",
         "The movie became a cult classic the instant it was released. The actors became famous overnight. The music is still recognisable and remembered. This film is a masterpiece of world cinema no less. It is based on the novel of the same title by Alexander Beliaev, one of the pioneer of Russian SF. The script is pretty close to the original text. I think that Beliaev would be happy to see that movie. The actors are not only beautiful, they are stylish and they act well. The naive young Ikhtiandr is so believable that you can`t help but feel sad over his destiny. There are few effects but due to that the movie is still not dated. Ikhtiandr`s costume was handmade piece of art.",
         "Based upon the novel of the same name by Soviet science-fiction writer Alexander Beliaev, Amphibian Man tells the somewhat tragic tale of Ichtyander (Vladimir Korenev), a young, handsome man that has been given the use of gills by his father (Nikolai Simonov). Various sightings have led to him being dubbed a sea-devil, a monster of the sea who has attacked various boats. Rich fisherman Pedro (Mikhail Kozakov) is trying to win the affections of the beautiful Gutiere (Anastasiya Vertinskaya), but when she is attacked by a shark in the sea, Ichtyander rescues her and falls in love with her. She mistakenly thinks it was Pedro who saved her, and so Ichtyander must come onto land in search of his new love. What is really on the surface a rather silly sci-fi movie that evokes the traditions of the U.S.'s B-movie output of the 1950's, it is actually a well-told fairytale love-story, giving most of its attentions to the doomed affair between Ichtyander and Gutiere. The loathsome Pedro is always on hand to scupper their attempts, with Gutiere trapped in a betrothal arranged by her father (Anatoliy Smiranin), who would rather see her marry into money than for true love. Themes of greed are ever- present throughout the film, reflecting the socialist realist attitudes of the time - a biting social commentary that the Soviet's were so good at (Soviet giants such as Eisenstein and Dovzhenko made their careers on propaganda) and helps add a gravitas to what might have been a straight forward B-movie. Amphibian Man is also technically impressive. Directors Vladimir Chebotayrov and Gennadi Kazansky used a seaside community in Azerbaijan to film, and this results in some nice photography. One of the stand-out scenes follows the POV of Ichtyander as he searches the streets for Gutiere, with the hand-held photography adding a desperation to his quest. There are also moments that evoke the techniques of the silent greats, using tilted, close-up photography that heightens the psychological torment of the character, more prominently used in the climactic scenes with Pedro, as his lust for power and his alpha-male dominance over Gutiere reaches breaking point. I was surprised to learn after watching the film that it was a massive commercial success in 1962, as the film has since faded into obscurity. Although it's hardly a great film, there is enough in Amphibian Man to justify a re-discovery of the wealth of Societ sci-fi's from this era. www.the-wrath-of-blog.blogspot.com",
         "What a wonderful movie! Great music by Russian composer Andrei Petrov (some electronic instruments) and an adorable good looking (and acting) Vladimir Korenev. Ordinary people think that he's a kind of frightening creature, but in fact he is the son of a professor living after a live-saving operation under the sea. It follows a love story, some action and NO HAPPY END. This makes a differnce to some similar American productions! It's worth to view the film (even in Russian version, because of the excellent camera work and beautiful actors).",
         "If this is the film I think it is, they showed it, alot, on a horror/movie program in New York in the 60's called \"Thriller\". I have been trying to find this for years! I tell all my friends about this film and I remember it as \"The Amphibian Man\". I also remember it was sad, very sad, that is why it stuck with me for years. Silly thing was, I thought it was an Italian film so that is where I've been trying to find it! I am a big horror film fan because at 4 years old, my older brothers watched these Saturday night New York Shows on Channel 5 (Creature Double Feature) and 11 (Thriller). This was during a time when there was not that many remotes so what they looked at, as the little sister, I had to look at too. Which is why I remember this film and haven't seen it since I was seven years old. (By that time we got cable, my brothers were older and I got the tv!) And let me add one more thing, many IMDb poster have written about films ripe for \"remakes\" for Hollywood Directors and Producers other than the ones they are doing. If I was one of those folks, I'd put this on my list to consider. This is a Speilberg-esque family sci-fi film just waiting to be remade. Then again, I like it just fine the way it is.",
         "a novel. and a nice adaptation. crumbs of Belyaev. and Communit image of happiness. a love story and a Sci - Fiin skin of fairy - tale. after half century it is difficult to give an honest verdict. because, more than an ordinary film, it is reflection of past. the errors, the costume of Ihtiander, the see, the Mexicans speaking Russian, the blue eyes of lovers, the shadows or the scientific vision of doctor Salvador are full of naivety. but the heart of beauty, as web of romance and teenager dream remains. and it is almost touching.invitation to discover the novel, it is, in same time, slice of a form of sensitivity.a testimony. or, only, part of a strange age.",
         "I have seen this movie as a child and I loved it. This movie must had made a great impression on me that I can still remember it till this day. I have been looking for it for several years now.",
         "a film like a Rubick cube . because it gives so many faces than remains more than a good adaptation of a novel but a sort of trip in the sensibility of a time. first because it could be a fairy tale. or a politic manifesto. or a lovely love story, remembering the Russian folklore. than, because, after decades, it remains fresh. for the special effects and story and acting. for the cultural references. and, in same measure, for its naive poetry. the clash of two worlds. and the fight for truth and justice. a noble cause. a beautiful girl. and the under water universe. it is enough for a form of magic who remains seductive after more than a half of century.",
         "Everything what is connected to the science fiction of Alexander Belyaev is almost perfect. I'm still a big fan of his eternal masterpieces and they start from Amphibian Man. I also recommend you to read Jump into the Void inspired by the upcoming Space era and exploration of the Venus. The movie Amphibian Man is surely one of the best among Soviet science fiction films starting beautiful Anastasiya Vertinskaya. The sun, the sea and an exciting storyline. Both the film and the book reached enormous attention in USSR and Vertinskaya and Korenev became a real superstars and well remembered for such a romantic duet",
         "This was quite an enjoyable film overall, and has a fairly unusual tone due to the collision of several different genre-associated elements. The concept, taken from a novel that I have not had the chance to read, is straight science fiction. It's a nice one, and it is pleasant to see and follow the implications of the prototypical scary sea-monster turning out to be not only a slightly-modified human but also the male love interest. I was a little puzzled by the logical the science fiction, though; Ichthyander has been kept under the sea because, unlike most humans, he has fish gills as well as lungs. But he must remain out of the water to exercise his lungs or they will atrophy, and he's been kept away from human society... because it will create a great underwater society sometime in the future? So we have a futuristic-looking home setting for our old scientist (who is nonetheless dressed in a high collar and frock coat that looks like it could have come from the 1860s). Then we have the main setting, which is an undefined Spanish-speaking country by the sea, which mostly looks like it could have been the same a hundred years previously as well, with the exception of the automobiles and the motorboats next to the pirate-style boats of the pearl-hunters. Slightly puzzling as it may be, though, the setting look gorgeous and is a joy to watch. I read in another comment here that the film was actually shot in Azerbaijan, which makes the creation of the rich and beautiful setting all the more impressive. The numerous underwater scenes are impressive as well, though I kept wondering why the human Amphibian Man kept putting on his scaly fish-costume to go into the water. Though despite the exotic setting and the scientific trappings, it is really a tragic romantic melodrama, and an adventure film. Fortunately, it does these pretty well, and the drama of the romance between the woman trapped in the wrong marriage and her Amphibian lover (whose unfamiliarity with shore life is nicely displayed in the stroke of a couple scenes) ends up being nicely effective. It might not always make sense, but Amphibian Man is a pleasant escapist film that deserves no ill will.",
         "Rather unique movie about a boy who is dying of a heart condition and gets his heart replaced with shark gills! He can, now of course, breathe underwater, and is quite happy there, until of course, a GIRL gets in the way.. and then he spends a lot more time above water! The girl has a jealous suitor though, and wants no more than to get rid of this Russian Man From Atlantis. While it's certainly unique and photographed crisply, this sure does drag in places, and yes, even has musical numbers to kill the time, but you should still this for this novel exercise in Russian Science Fiction.",
         "This movie is one of the greatest pieces of cinematography ever made. It's beautiful and touching. It does have a much used plot, but this movie is absolutely unique. It shows the true kindness of Ichthiander, and the evil greed can do. I always cry at the end. The music is beautiful too! I recommend this movie to everyone, it's impossible not to love it!",
         "That AMPHIBIAN MAN was made in the early 1960s is mind-boggling: it's exactly the kind of Fantasy Film lesser American filmmakers often tried to produce during the same era, to far lesser Effect(iveness). It's straightforward and beautifully directed, with some truly outstanding cinematography both above and below the Sea. The effects are minimal and, unlike in most American movies (especially those produced THESE days), the effects are secondary to the Story (which, for a Fantasy Film, is surprisingly solid: the Amphibian Man of the title was born with weak lungs, so his scientist father transplanted shark lungs into him). There are scenes of great lyrical Beauty (something American filmmakers tend to shy away from) and some spectacular, Jackie Chan-like stunts. If only Bill Everrett's SUB-MARINER could be brought to The Big Screen half as well... HIGHLY recommended.",
         "An unusual science fiction / fantasy / romance of a doomed love affair combined with a love triangle and a bit of clumsy anti-capitalist commentary, this film was a hit with Soviet audiences in the early 1960s on first release. It still looks good for its age half a century later: the very faux-Mexican setting looks quaintly historic as though the events of the film took place in a peri0d much earlier than 1962 when it was filmed. The cinematography is very good with a number of shots throughout the movie taken at unusual angles or from characters' points of view and there is an emphasis on displaying underwater scenes as bright-blue, beautiful and benign even when there is a shark lurking about. The young lead actors are stunning to look at and the camera often focuses on their beautiful features: even the villain is extraordinarily handsome in a moody way. The acting is at least natural if not particularly outstanding and even a bit wooden and amateurish. All characters are very much stock stereotypes and the actors deviate little from those stereotypes. Medical scientist Dr Salvatore (Nikolai Simonov), the idealistic \"mad scientist\" of the piece, has a son who once suffered an incurable lung disease so the father implanted gills in the child's body somewhere to save his life. The boy Ichtyander, the \"monster\" naif, can breathe and live underwater as well as on land but the father keeps him isolated from other people as he has a vague plan for the boy to lead an oceanic republic free of class and other social divisions and exploitation. In the movie Ichtyander (Vladimir Korenev) is a teenager and he falls in love with a girl Gutiere (Anastasia Vertinskaya) after rescuing her from a shark attack; he desires to follow and be with her, and he leaves his water-world to go to the city where she lives. Unfortunately Gutiere's father, the pearl-diver Baltazar (Anatoly Smiranin), is heavily in debt and has promised the girl's hand in marriage to local rich playboy Pedro Zurita (Mikhail Kozakov) who has promised to pay the old man's debts. The plot is a hodge-podge of action, romance and sci-fi fantasy; easy enough to follow but with gaping holes that make it shaky in parts. It seems over-eager to advance to the climax to the extent that characters must have in-built GPS systems in their brains to find significant people. The busy pace and the plot's complications don't permit much character development which is unfortunate because Ichtyander's infatuation with Gutiere leads him out of his isolation and his father's control and forces him to confront the best and worst of human behaviour and social interactions. Young viewers might identify with Ichtyander's confusion at adult ways of behaving and doing things. There's a point made about how money divides people into social classes and how society judges people on the basis of their wealth or poverty. By the end of the film Ichtyander still seems very child-like and his future without his father is uncertain. Other characters who also need to escape from their one-dimensional plane of existence include Gutiere, who could have railed against a system that forces her to marry because of economic necessity, and Baltazar, who is not shown in the movie to have a guilty conscience over horse-trading Gutiere: he must have had one though because he ends up saving Gutiere from a lifetime of misery with Pedro. A support character Olsen (Vladlen Davydov) is very under-used as a potential aid and mentor to Ichtyander. Criticism of capitalism comes in the person of Pedro who desires to exploit Ichtyander's fishing and diving skills and tries to convince Dr Salvatore to mass-produce thousands of Ichtyanders for profit, demonstrating that the evil exploitive capitalist mindset is always on permanent autopilot in the brains of stock villains. By contrast, Dr Salvatore's desire for an egalitarian socialist underwater utopia is demonstrated as unrealistic in the context of an impoverished Latin American country where corruption, or what the viewer sees of it, is rife. Everyone in this country seems to be in debt and people constantly haggle for more money: Gutiere gives her necklace to Olsen so he can pawn it for money to keep his newspaper business going and Baltazar is desperate enough to sell off Gutiere to keep his pearl-diving business above water. A highlight of the film is Andrei Petrov's musical soundtrack which includes the use of electronic instruments as well as conventional orchestral music and some Spanish-influenced flourishes. Dramatic sweeps of violins and other strings mix with beautiful bell-like tones and some odd, spacey tunes. A couple of songs appear early in the film as though the directors had ambitions for it to be a musical before realising the idea wouldn't mesh too well with a plot filled with twists. A chase scene, a kidnap scene and an escape-from-jail scene complete with gunshots enliven the plot which concludes in freedom but not happiness ever after or a better understanding of the corrupt world around them for the young would-be lovers. Overall \"Amphibian Man\" is a visually striking film with beautifully shot locations that are picturesque and quaint, and which features good-looking young actors who run and swim around a lot. The premise and the plot are interesting though at times the directors seemed unsure whether they were making a musical, a comedy or an action film: the film dithers in one genre, then another before settling into the action genre. The film could have been much stronger with better characterisation and fewer twists in the plot.",
         "I just watched this movie. It was broadcasted by the public TV channel, during a midnight program, dedicated to cult films from everywhere. To say the truth, the strange location of the film was what made me to be interested and pushed me to search in the internet, specially when I noticed that some night city views in the middle of the film, were shot in Buenos Aires. You can see theatre marquees and commercial signs of that time made of neon light. The rest of the movie, I supposed it was shot in Mexico (except for the trucks, cars, etc. which were soviet style), but I read on a previous comment, it was Baku, Azerbaijan. Well, Another soviet movie!!..."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Goskino",
         "Lenfilm Studio"
      ],
      "summaries": ["People living in a seaside town are frightened by reports about an unknown creature in the ocean. Nobody knows what it is, but it's really the son of Doctor Salvator. The doctor performed surgery on his son and now young Ichtiandr can live underwater. This gives him certain advantages, but creates a lot of problems."],
      "budget": 0
   },
   "movielensId": 170615,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1962-01-03",
      "dvdReleaseDate": null,
      "directors": [
         "Vladimir Chebotaryov",
         "Gennadi Kazansky"
      ],
      "runtime": 82,
      "movieId": 170615,
      "title": "Amphibian Man",
      "mpaa": "",
      "actors": [
         "Vladimir Korenev",
         "Anastasiya Vertinskaya",
         "Mikhail Kozakov",
         "Anatoliy Smiranin",
         "Nikolai Simonov",
         "Vladlen Davydov",
         "Yuri Medvedev",
         "Aleksandr Zakharov"
      ],
      "imdbMovieId": "0055844",
      "originalTitle": "Человек-амфибия",
      "genres": [
         "Adventure",
         "Science Fiction",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "People living at the seashore town are frightened by reports about the unknown creature called \"the sea devil.\" Nobody knows what it is, but it's really a son of a doctor Salvator. The doctor performed a surgery on his son and now young Ihtiandre can live under water. This gives him certain advantages, but creates a lot of problems.",
      "tmdbMovieId": 43685,
      "avgRating": 3.67647,
      "releaseYear": "1962",
      "numRatings": 17,
      "posterPath": "/hPir618kFlOgAcruIt1xITuSoAV.jpg"
   }
}