{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1037229",
      "video": false,
      "title": "Yoroi: Samurai zombie",
      "recommendations": [],
      "backdrop_path": "/ghIiBhSmZO70Yr9kJ93PNlx0trS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4829c3a36847f815a927",
               "name": "Mitsuru Fukikoshi",
               "profile_path": "/q6Ln6jCNFZgLUjGm2AxUeNGYlcE.jpg",
               "id": 120918,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4829c3a36847f815a92b",
               "name": "Shintaro Matsubara",
               "profile_path": "/o8Cel6tAIxYksWv6qob113Zu6kM.jpg",
               "id": 145917,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4829c3a36847f815a92f",
               "name": "Airi Nakajima",
               "profile_path": "/uo9hYYjGCDHx6B2JClbJtBWfPKy.jpg",
               "id": 230851,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4829c3a36847f815a933",
               "name": "Nana Natsume",
               "profile_path": "/uZQofW0eUycQbOdaTocrFK9GrlF.jpg",
               "id": 128042,
               "order": 3
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.078717,
      "production_countries": [],
      "id": 52400,
      "vote_count": 2,
      "budget": 0,
      "overview": "\"A family is kidnapped by a couple who have guns. Wandering lost, they get together in a place where there are zombies in samurai armor. Encountering zombies and police, reunited family struggle and get to confront a tragic secret. A fun action-horror on the low budget B-movie.\"",
      "similar": [],
      "original_title": "Yoroi: Samurai zombie",
      "runtime": null,
      "poster_path": "/cIRYdxXF5NNsFCuLamAHy7lh0xB.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2008-06-30",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tak Sakaguchi"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Ryûhei Kitamura",
         "Ryûhei Kitamura"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1037229/",
      "coverLink": null,
      "actors": [
         "Mitsuru Fukikoshi",
         "Issei Ishida",
         "Tak Sakaguchi"
      ],
      "reviews": [
         "Family going on a trip in a country accidentally run over a man dressed in white standing in the road pointing a gun at them. When they stop to help him he gets up and tries to shoot the group he is shot by a man in black standing behind him. The man in black with his girlfriend then force the family to drive them away. They end up in a weird area that appears to be rural but turns the car's GPS and all the cell phones red. They are in some unknown area. What transpires from this point is extremely bloody and gory and graphically violent as a long dead samurai is resurrected and begins to chop everyone up. This is a twisted horror comedy from the director of Be a Man Samurai School . Like that earlier film this is big on style and more than a tad messy on the plotting. Things seem to happen in order to get us to the next blood soaked thing, with the whys and wherefores being less than truly logical. Then again one doesn't really look for logic in Japanese gore films, one looks for blood and body parts and in that regard the film scores big. The blood spurting mayhem is very well done. The real problem with the film is the pacing. Its deadly slow. Its actually probably the slowest film like this I've seen. Its not that the gore sequences are dragged out it's the sequences where the plot is advanced that drag on and on. They are dull and boring and seem never to end. Perhaps it's the lack of real characters, perhaps its something else. What ever it is its dull. I started to nod off and had to fight to make to the end. This film is a bust",
         "\"Samurai Zombie\" was a rather nice movie, and it totally surprised me when I finally sat down to watch it. Being a zombie aficionado, of course I had to add this movie to my collection, just took a while to get around to watching it. Which turned out to be a mistake, because I was missing out on a great movie. Normally Japanese zombie movies tend to be sort of goofy and spoofs on themselves, and quite often extreme to the point of ridiculousness. \"Samurai Zombie\", however, was a more serious zombie movie that didn't touch the usual goofy elements in Japanese zombie movies. \"Samurai Zombie\" was darker and more brutal in its story and appearance. The story is about a family that get taken hostage at gun point by a man and a woman whilst out driving in the remote countryside. But the countryside is cursed and a walking dead zombie is up and about, searching to living to fall prey to his blade. The story progresses nicely and it is like we are right there with the people experiencing their torment and being stalked. Unlike so many other Japanese zombie movies, the zombies in \"Samurai Zombie\" were not just Japanese people painted grey in the face and dark around the eyes. No, they had really gone all out in this movie with the costumes and make-ups, and the zombies in the movie looked really nice. There was one thing that was questionable, though, and that the was excessive spraying of blood whenever someone was beheaded, it was just a bit over the top. But then again, Asian movies are known for being over the top, so it was only a minor nuisance. It was an interesting touch they opted for when the movie was closing up, letting us see the background for the current events of why the zombies were up and killing people. However, personally, I didn't enjoy the way the movie ended at all, it was just a bit too tacky for my liking. The people cast for \"Samurai Zombie\" were actually doing great jobs with their roles. The armored samurai zombie was really nice, it was like a Japanese version of Jason Voorhees, which I found to be really nice. I liked that zombie quite a lot. But the people with speaking parts were actually doing great jobs as well. If you are riding along of the recent wave of ultra-splatter movies from Japan, then chances are that you are already familiar with \"Samurai Zombie\". However, if you are not, don't expect this movie to be as blood-drenched, gory and extreme as other movies such as \"Tokyo Police\", \"Meatball Machine\", \"Hellrider\", etc. \"Samurai Zombie\" is in the more 'serious' end of splatter movies, which I found to be quite nice. \"Samurai Zombie\" is great entertainment. It has just the right amount of blood (and some over the top spraying) and gore to keep most gorehounds happy. It has a solid story that pulls you in and leaves you wanting more right up to the very end. It has good acting performances that come off as believable and real. But most importantly, it has zombies! Two rotting thumbs up for \"Samurai Zombie\".",
         "Samurai Zombie (2008) is an action horror film from Japan, which was released on July 21, 2008 Tells of a family who was attacked by two crazies and caused them to be attacked by Zombies holding samurai ... Zombie samurai I watched his movie through DVD a few hours ago this movie is quite entertaining, so dark and full of bloody disgusting scenes ... If you like Zombie movie watch this movie ...",
         "You'll have to be in a very undemanding mood when you decide to step aboard YOROI: SAMURAI ZOMBIE, a low-budget splatter-comedy with a limited cast and limited locations. Yes, it's pretty crazy. Yes, it's sprinkled with gory bits and bloodshed. But after an amusing start, it becomes rather dull in the mid-section. A gangster couple hijacks the car of a family on a holiday, and makes them flee together with them. They end up in an abandoned settlement – a ghost town, if you will - where samurai zombies have just been awakened. The tedious middle section could have used a bit more original, blood-spraying jokes to keep the pace going. Of the climax at the end – that tries to be amusing, but fails due to a decreased interest of the viewer – only the silly, evil twist was worth it. This Japanese zombie effort may be just good enough for a splatter-horror night with friends, beer and pizza. I might be a bit harsh on SAMURAI ZOMBIE, but you'll have to forgive me: It was the last in a series of six films I watched back-to-back on one and the same day at a film festival. So maybe I was a little tired by then. But still, I felt like the film didn't really kick the bucket, while the previous five, rather unrelated features, did. Maybe SAMURAI ZOMBIE might not be too bad a choice to throw in between a triple feature Japanese zombie-night, together with STACY (2001) and JUNK (2000). And if you didn't enjoy these two, then you can forget about SAMURAI ZOMBIE all the same.",
         "This is a zombie movie that qualifies as horror flick, and not just a cheesy B movie. A family is out for a drive on a holiday. The family consists of father Shigeo (Mitsuru Fukikoshi), mother Yasuko (Keiko Oginome), daughter Asami (Airi Nakajima), and kid brother Ryota (Ayato Kosugi). As they came through the curve on a mountain path, a man wearing white coat stands in their way with a gun. Shigeo steps on the brake but he runs over the man. But the man stands up and points a gun at Shigeo. Just then, a man wearing black named Jiro (Hironobu Ueda) comes out and shoots the man in white. His partner Risa (Nana Natsume) shows up, and they order the family to drive through an area blocked off from public access. As they push on, the navigation system in the car suddenly turns red, and the tire bursts. Shingo is ordered to find another car, but as he heads for a near by village, and passes by an old grave yard, he's possessed in a trans and cuts his own head off. As his blood soaks the ground, an ancient Japanese samurai in an armor rises from the ground. This samurai zombie shows up before Jiro and the family with the head of Shingo in its hand. Risa takes the wheel and runs over the samurai. Together they escape to an old abandoned village. Two police officers chasing Jiro and Risa also approaches the village. They all encounter more samurai zombies. All the players has ties with the past, and were drawn to this situation. The team that created \"Versus\", Ryuhei Kitamura, and Taku Sakaguchi swaps their role on this one, with Sakaguchi directing the movie. The actors are semi A list class actors, and adds to the quality of this movie. I think I like Sakaguchi better as a director than Kitamura. This isn't a dumb zombie flick where wobbling zombies careens through town, but samurai zombie is zombie only in that it's living dead, and more like a ghost that has a body. There're no zombies eating flesh or people turning into zombies. It's a showdown between humans and dead samurai. The movie is intended to be a B movie, and has loads of elements that will please the B movie fans. The only negative is the low key atmosphere that seems to be the signature of Kitamura - Sakaguchi duo. If you're a B movie horror flicks fan, this movie is for you.",
         "George Santayana, the Spanish-American philosopher, once famously said that those who cannot remember the past are condemned to repeat it. Tak Sakaguchi, martial artist, stuntman, actor and now director, has a high standing for taking every opportunity as it comes. Samurai Zombie, his second film as director, shares the same aphorism as Santayana's, so why, considering his rapid rise to success, did he deliberately choose an angry reanimated corpse with military nobility as his next step? Sadly less than engaging after the opening gambit, Samurai Zombie is likely to be appreciated the most by seasoned splatter-horror buffs, whilst newcomers to the genre will be looking elsewhere for their gratuitous entertainment, wondering what all the fuss is about. DW"
      ],
      "genres": [
         "Action",
         "Horror"
      ],
      "productionCompanies": [
         "GAGA",
         "Lotus",
         "Notorious"
      ],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 170655,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-06-30",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 170655,
      "title": "Yoroi: Samurai zombie",
      "mpaa": null,
      "actors": [
         "Mitsuru Fukikoshi",
         "Shintaro Matsubara",
         "Airi Nakajima",
         "Nana Natsume"
      ],
      "imdbMovieId": "1037229",
      "originalTitle": "Yoroi: Samurai zombie",
      "genres": [
         "Horror",
         "Action",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "\"A family is kidnapped by a couple who have guns. Wandering lost, they get together in a place where there are zombies in samurai armor. Encountering zombies and police, reunited family struggle and get to confront a tragic secret. A fun action-horror on the low budget B-movie.\"",
      "tmdbMovieId": 52400,
      "avgRating": 1.5,
      "releaseYear": "2008",
      "numRatings": 1,
      "posterPath": "/cIRYdxXF5NNsFCuLamAHy7lh0xB.jpg"
   }
}