{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt5918090",
      "video": false,
      "title": "I Am Not Madame Bovary",
      "recommendations": [
         381879,
         151731,
         94180,
         112912,
         284298,
         205077,
         381038,
         51725,
         150065,
         411014,
         41355,
         23388,
         221094,
         317916,
         416306,
         208625,
         295462,
         56143,
         390396,
         349048
      ],
      "backdrop_path": "/iKISaZPrEMQFYhKizyphP2dPrgQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Li Xuelian",
               "gender": 1,
               "credit_id": "574c5eaf925141241f000054",
               "name": "Fan Bingbing",
               "profile_path": "/rO6kT0EJuXRKUKEyKN9O6LyG71A.jpg",
               "id": 64439,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "574c5ed3925141241c00004c",
               "name": "Zhang Jiayi",
               "profile_path": "/dxOabDYWmiXiMXHgyJX7XylKZgL.jpg",
               "id": 107775,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "574c5ee5925141241000004f",
               "name": "Yu Hewei",
               "profile_path": "/oFvAHLfTgKCjmuhJ5GP7ykk9o1w.jpg",
               "id": 1344903,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "574c5f08c3a368543c000090",
               "name": "Guo Tao",
               "profile_path": "/eb6MoYwQ1XfqtTJ4PKDixAmlyXA.jpg",
               "id": 548608,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "59572da7c3a368265d002370",
               "name": "Dong Chengpeng",
               "profile_path": "/mDXWCfosQMcc0F9ySzlz0cCrqq4.jpg",
               "id": 1292116,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "574c5e61c3a368543700007b",
               "name": "Feng Xiaogang",
               "profile_path": "/oC7nkf7JaPbJJuEwldVtKFvMyuI.jpg",
               "id": 1287732,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "574c5e789251412415000048",
               "name": "Liu Zhenyun",
               "profile_path": null,
               "id": 1110536,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.672308,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 400114,
      "vote_count": 15,
      "budget": 0,
      "overview": "Li Xuelian, a woman from the countryside is falsely accused by her husband of having an affair. To defend herself, Li moves from her small town to the big city until she reached the capital.",
      "similar": [],
      "original_title": "我不是潘金莲",
      "runtime": 128,
      "poster_path": "/hc8OG5TGeyFhbezPNKNgmEUhWK3.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Huayi Brothers",
         "id": 3393,
         "origin_country": ""
      }],
      "release_date": "2016-09-29",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Xiaogang Feng"],
      "runtime": 128,
      "synopsis": null,
      "writers": ["Zhenyun Liu"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt5918090/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzE4ODgzNjYzMl5BMl5BanBnXkFtZTgwOTg4MDMzMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Chengpeng Dong",
         "Bingbing Fan",
         "Wei Fan"
      ],
      "reviews": [
         "Bingbing Fan is on a quest for justice. She and her husband got a divorce so they could get a better apartment, but after the divorce, he married someone else. So she wants the divorce overturned, so they can be married again, whereupon she will sue for a divorce. This confuses the local judiciary, the police department and the entire civil government up to the level of provincial governor -- goodness knows, it confused me -- and gets a review at the national level in Beijing, where the decisions are sustained. This happens for ten years in a row, while judges, majors and even governors lose their jobs, because this crazy woman cannot be stopped. It's a fine satire of the effects of one determined person on a massive bureaucracy, as various people try to deal with her by varying means. While I found several stretches a bit slow, perhaps this is because in the details of general and particular points to make fun of, the particular points of Chinese government elude me. Even with that in mind, there are lots of good laughs, and some interesting playing around with mattes: the provincial scenes are shown through a circular matte, showing off the squarish architecture, and the Beijing scenes are shown through a small, rectangular matte, showing off the round archways. I think this is supposed to emphasize the difference way that local and national governments look at things. If so, it is a very nice conceit.",
         "Cinematography is absolutely stunning in this, justly lengthy, portrayal of a woman's quest to gain justice for a wrong, multiplied several times, by uncaring bureaucracy. It is not until the end that we discover exactly why this woman is determined to revoke and repeat a divorce that everyone else insists is valid. She is cast as the indecent woman, a Madam Bovary, but she most definitely is not. She's not mad either, which is what you and all the other characters in the film are lead to believe. It takes patience to uncover the small piece of missing information that makes sense of all. Patience is richly rewarded in this thoughtful and closely observed film - almost to the extent of forensic examination through a microscope.",
         "It is no secret that I enjoy Asian cinema tremendously, and when I got the chance to watch \"I Am Not Madame Bovary\", I naturally jumped at it. I had no idea what this movie was about, nor did I know who was starring in it. I managed to sit through 31 minutes into this ordeal before I just gave up out of sheer and utter boredom. The storyline never really kicked up into any gear that had any kind of appeal to it. And furthermore, the movie is presented in an unfathomably horrible round frame presentation. And it was a major nuisance to watch that on the screen. And it was definitely a big part of why I just gave up on the movie. Why director Xiaogang Feng opted for this round frame presentation is something that just eludes me. The acting in the movie was adequate from what I managed to witness throughout the 31 minutes I managed to sit through. I have no intention of returning to watch the rest of \"I Am Not Madame Bovary\" (aka \"Wo bu shi Pan Jin Lian\") solely because of the boredom that it instilled in me and because of the annoying round frame presentation.",
         "This film has so much potential. It's got good timing sequences, the cinematography is unique and the style is reminiscent of Wes Anderson. However, the details is just not quite there. Considering the director's bold move to choose such a small focus frame many aspects lack care. Raining scenes on the river shows clearly it's not raining in the distance. Many side characters clearly has no acting background with exaggerated body language and tone which was off putting. Some of the actors were not able to mimic the local accent consistently. Overall a very beautifully filmed movie with some great composition and interesting comedic elements. But if you have the knowledge of the language and quality of media in China, you might have also felt the lack of care because these are very basic cinema mistakes in TV dramas and B-grade movies.",
         "That I mean, since it does not seem to be a professionally filmed film. There are Chinese movies that as if on acting, I think it's a way to shoot them, they interpret like that, but at least I get me out of the movie. Another thing that I do not understand and it baffles me and I do not know what he means by that, it's the circle and the square. I do not know why it puts them and if it is not understood then something fails. Only serves to lose part of the screen. I can not find the humor at any time, although it is true that I do not usually like the movies of black humor, sarcastic or otherwise. He has a good picture, but I just find that I do not like the director's work in any way, neither narrating nor composing, nor rhythm nor time."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Beijing Skywheel Entertainment Co.",
         "Huayi Brothers Media",
         "Huayi Brothers Pictures"
      ],
      "summaries": [
         "Having no other option, Li Xuelian, a poorly educated villager, and her husband Qin Yuhe agree to fake a divorce. However, during the couple's separation, Qin falls in love with another woman--and as if his divorce with Li was real--he decides to move on with his life, leaving the jilted former spouse out in the cold. Under those circumstances and in the dreadful position of being denounced as a Pan Jinlian--a 17th-century Chinese adulteress who conspired with her partner to kill her husband--Li sets off on a legal crusade to clear her name. But even though Li is undoubtedly determined, on the other hand, she is nothing but a small nuisance in a sluggish and bureaucratic system where, sometimes, ants can become elephants. In the end, how long can a single woman hold on against an entire government?",
         "After being swindled by her ex-husband, a woman takes on the Chinese legal system."
      ],
      "budget": 0
   },
   "movielensId": 170889,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2016-09-29",
      "dvdReleaseDate": null,
      "directors": ["Feng Xiaogang"],
      "runtime": 128,
      "movieId": 170889,
      "title": "I Am Not Madame Bovary",
      "mpaa": null,
      "actors": [
         "Fan Bingbing",
         "Zhang Jiayi",
         "Yu Hewei",
         "Guo Tao",
         "Dong Chengpeng"
      ],
      "imdbMovieId": "5918090",
      "originalTitle": "我不是潘金莲",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["4iQXpdcX33A"],
      "plotSummary": "Li Xuelian, a woman from the countryside is falsely accused by her husband of having an affair. To defend herself, Li moves from her small town to the big city until she reached the capital.",
      "tmdbMovieId": 400114,
      "avgRating": 2.83333,
      "releaseYear": "2016",
      "numRatings": 3,
      "posterPath": "/hc8OG5TGeyFhbezPNKNgmEUhWK3.jpg"
   }
}