{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tycoon",
            "id": 5728
         },
         {
            "name": "fish out of water",
            "id": 11860
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "wild west",
            "id": 155573
         }
      ],
      "imdb_id": "tt0008775",
      "video": false,
      "title": "Wild and Woolly",
      "recommendations": [],
      "backdrop_path": "/ryO1iGwrN9TOBXaOZLo2QqH51B6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeff Hillington",
               "gender": 0,
               "credit_id": "52fe4bf2c3a368484e19fa05",
               "name": "Douglas Fairbanks",
               "profile_path": "/l8DQc2xfFwXt5Wylj2AseWmqrMt.jpg",
               "id": 109088,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Nell Larabee",
               "gender": 1,
               "credit_id": "52fe4bf2c3a368484e19fa1b",
               "name": "Eileen Percy",
               "profile_path": "/s0woXFjUVIQqTnY0ttToMLWlD37.jpg",
               "id": 1155601,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Steve Shelby, the Indian Agent",
               "gender": 2,
               "credit_id": "52fe4bf2c3a368484e19fa1f",
               "name": "Sam De Grasse",
               "profile_path": "/bMkfd5Fflo2VTOvDovvrSK6aWoi.jpg",
               "id": 29952,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Casey the Engineer",
               "gender": 2,
               "credit_id": "52fe4bf2c3a368484e19fa23",
               "name": "Tom Wilson",
               "profile_path": null,
               "id": 96061,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bf2c3a368484e19fa0b",
               "name": "John Emerson",
               "profile_path": null,
               "id": 254114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bf2c3a368484e19fa11",
               "name": "Horace B. Carpenter",
               "profile_path": "/gneUWP26SCftJcYcLBGVb51L5B4.jpg",
               "id": 89782,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bf2c3a368484e19fa17",
               "name": "Victor Fleming",
               "profile_path": "/Lq3Hb5VsmTSIEaYvgfbpK8r8Tk.jpg",
               "id": 9049,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4bf2c3a368484e19fa29",
               "name": "Anita Loos",
               "profile_path": "/lmG2K9YK8zmvwsOMmJgStgx4DLM.jpg",
               "id": 11436,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.077012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 135275,
      "vote_count": 2,
      "budget": 0,
      "overview": "A rich young Easterner who has always wanted to live in \"the Wild West\" plans to move to a Western town. Unknown to him, the town's \"wild\" days are long gone, and it is an orderly, civilized place now. The townsmen, not wanting to lose a rich potential resident, contrive to make over the town to suit the young man's fantasy.",
      "similar": [
         196,
         17774,
         9654,
         8487,
         12153,
         157841,
         424,
         62213,
         57201,
         72331,
         110415,
         116149,
         392044,
         365942,
         479363,
         105,
         346685,
         399035,
         10625,
         10144
      ],
      "original_title": "Wild and Woolly",
      "runtime": 72,
      "poster_path": "/hSs4ti3X9wKhJ9t9na3YXY7l1cT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Douglas Fairbanks Pictures",
            "id": 13399,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artcraft Pictures Corporation",
            "id": 13400,
            "origin_country": ""
         }
      ],
      "release_date": "1917-06-24",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Emerson"],
      "runtime": 72,
      "synopsis": null,
      "writers": [
         "Horace B. Carpenter",
         "John Emerson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0008775/",
      "coverLink": null,
      "actors": [
         "Douglas Fairbanks",
         "Eileen Percy",
         "Calvert Carter"
      ],
      "reviews": [
         "Before redirecting his career to swashbuckling adventure flicks with \"The Mark of Zorro\" in 1920, Douglas Fairbanks starred in modern comedies. He repeated the role of a modern mollycoddle or discontent yearning for adventure; in this film, \"Wild and Woolly\", he returns comically to his Western roots. He teamed with screenwriter Anita Loos, who pioneered the craft working for D.W. Griffith, and her husband director John Emerson to cement the first of Fairbanks's two popular incarnations. According to the print I saw, Victor Fleming (\"The Wizard of Oz\", \"Gone with the Wind\") is credited with photography here, and he worked on other Fairbanks vehicles, beginning his directorial career making them. The presence of Loos is readily noticeable in the quantity of intertitles, which contributed much of the humor to Fairbanks vehicles, and thus redefined the role of title cards in silent films. In \"Wild and Woolly\", as elsewhere, they help to undercut the film by poking fun at itself and movies in general, such as in the scene where Fairbanks goes to a picture-play to have his dreams of the wild West come true--even in New York. The entire film plays around with the fact that movies romanticize bygone eras. The ending, too, jests at itself with the insertion of one intertitle. The pacing is also a nice compliment to Fairbanks's restless, exuberant performance; the editing is as energetic and frantic as he is. It's congruity is also similar to Mack Sennett's Keystone comedies and, as William K. Everson (\"American Silent Film\") pointed out, is indicative of the fast pace of pictures post \"The Birth of a Nation\" (1915). Everson claimed that some shots in \"Wild and Woolly\" lasted no more than five frames. Additionally, Faribanks's acrobatics are perfectly suited to the genre, which he'd carry into his adventure spectacles. Today, Fairbanks remains one of the better-known silent film stars, but mostly for his swashbucklers. Yet, he should be recognized as an early American screen comedian alongside Sennett, Arbuckle, Chaplin, Keaton and Lloyd, as well, even though his films aren't slapstick and he couldn't be considered a clown of the same order. Like some of the films of Sennett, Chaplin and Keaton especially, \"Wild and Woolly\" is, however, a comedy that in reflecting itself finds much of its humor.",
         "This is one of the comedies Douglas Fairbanks made in his early, pre-swashbuckling days, and for the most part it's quite enjoyable. The premise is perfect for the sort of character Doug usually played at this point in his career: he's Jeff Hillington, son of a prosperous businessman, based in New York and shackled to a hated desk job, but restless with office routine, and obsessed with all things Western. Jeff reads cowboy adventure tales and believes every word of them: this is a guy who has set up an Old West campsite in his bedroom. He dresses like Tom Mix, calls everyone \"Pard,\" rolls his own cigarettes and even lassos the butler, just to keep in practice. (My favorite touch is the six-shooter that serves as a door-knocker at the entrance to Jeff's room.) Some of his associates obviously consider Jeff a nut case, and with sufficient cause, but the famous Fairbanks charisma makes the character far more endearing than he would be in reality. When Jeff's father gets involved in a business deal with investors from the town of Bitter Creek, Arizona, it seems a perfect opportunity to send the boy out West, ostensibly to investigate the situation, but also to discover what life is really like out there. Jeff's father plainly hopes to rid the boy's system of this cowboy obsession once and for all. Instead, however, the Arizona investors decide to win over the unworldly son -- and thus influence his father -- by hoaxing Jeff with an elaborate show of Old West playacting, designed to indulge his delusion that Arizona is still the lawless frontier of his fantasies, where nothing has changed since the days of Billy the Kid. It's essential to the plot that Jeff believes the Old West he's read so much about is absolutely genuine, and thus the premise raises a credibility problem: why hasn't this prosperous young man visited the West on his own by now? Clearly, viewers aren't supposed to ponder such questions, just as we must accept 35 year-old Douglas Fairbanks playing a young buck of 22 or so -- and not a mature 22, either, but a big kid who never grew up. We accept the premise because it's a clever idea. Certainly, the movie's most enjoyable scenes involve the efforts of Bitter Creek's citizenry to turn back the clock and transform their quiet village into the rootin' tootin' town Jeff expects, and they appear to be having a high old time in the process. Everyone dresses in cowboy gear while cars and other modern machines are hidden, and the hotel is transformed into a rude hostelry with saloon and dance floor. Blank cartridges are loaded into everyone's guns, and because Jeff accepts everything he sees as real the townsmen find it prudent to discreetly load his gun with blanks, too, so that no one gets hurt. Complications arise, however, when a villainous official decides to take advantage of the situation and pull off an actual train robbery, using the corrupt Indians under his command (whose guns are loaded with real ammo) to terrorize the town. Jeff attempts to save the day but finds that his guns are useless, and only learns the truth as Bitter Creek erupts into pandemonium. Ultimately, however, he manages to use his wits and energy -- and some real ammo -- to save the girl, the town, and the day, and prove himself a genuine Western hero. Jeff Hillington is an ideal Douglas Fairbanks character: he's essentially a good guy, exuberant if naive, but he does learn a few valuable lessons along the way. While watching Fairbanks in this film I was reminded of the public persona of Teddy Roosevelt, an early 20th century President who was in a sense this country's last 19th century leader, a man who represented a frontier ethos that was quickly becoming a thing of the past in the 1910s. Indeed, Wild and Woolly, which was released a few months after the U.S. entered the Great War, is full of nostalgia for an America that was already slipping away fast. This tone is established in a brief prologue in which the covered wagons and stage coaches of yesteryear are contrasted with the trains and automobiles of the modern world. The early scenes in New York offer a view of the main concourse at Grand Central Station (only four years after it opened), as well as glimpses of the clothes, cars, furniture, and office equipment of 1917, but while the NYC Jeff Hillington inhabits looks impossibly quaint to our eyes, these trapping then represented the latest in fresh, sophisticated urbanity. Similarly, when we first see the \"modern\" town of Bitter Creek, Arizona, with Model-T Fords chugging down its wide dusty streets, to our 21st century eyes the place already looks primitive. It's only after the citizens make over the town as it was in \"the Eighties\" (i.e. the 1880s) that we see just how profoundly life in this country changed in a comparatively brief time. Some viewers will be uncomfortable with scenes in the latter portion of the film, when evil Injuns go on a drunken rampage and deliver stereotypical dialog about \"heap big pow-wows,\" etc. (Ironically, Fairbanks himself poked fun at such hokey depictions in his later comedy The Mollycoddle.) While a number of silent Western dramas were surprisingly sympathetic to Native Americans, that isn't the case here, and these scenes undercut the good humor of the film's first half. Still, there is much to enjoy in Wild and Woolly, especially for the historically minded viewer. (Then again, I suppose anyone interested in watching a silent comedy starring Douglas Fairbanks is by definition historically minded.) It's clever and generally amusing, and also offers something of an inside joke, as the satirical playacting can be viewed as a parody of some of the genuine Western adventure films being made at the time.",
         "The wonderful opening scene of \"Wild and Woolly\" already tells us just about EVERYTHING about our hero: like a little boy, he's sitting in his room on the floor in front of a tipi, with a camp-fire burning next to him, and devouring a Western novel; then he gets up to admire the picture of his cowboy heroes and his collection of guns, and to jump onto a real saddle and practice shooting, and then play with his lasso - but then... his father's butler enters to inform him that he's got to leave for the office... Oh, but HOW much does Jeff, the son of a New York railroad magnate (JUST the kind of businessmen who have 'tamed' the West with their 'fire horses') long to be a TRUE Westerner! But one day, he finally DOES get the chance to see the West: his father sends him to the little town of Bitter Creek, Arizona, to see if it's worth connecting it to the railway line! There's only one problem: the West of 1917, of course, isn't the 'good old Wild West' of the 80s anymore that Jeff dreams of... But, knowing of Jeff's big foible, the inhabitants of the sleepy hollow make their preparations for his arrival: they turn the hotel into an old-fashioned saloon, dress up like cowboys and Western girls, and even stage some 'tough' incidents for him to intervene and 'save' pretty young Nell from drunken 'baddies', and (after having replaced all the bullets with fake ones) later on even plan a fake 'hold-up' - and Jeff sure gets the thrill of his life! But since, unknown to the peaceful townsfolk, there also are REAL baddies in town, the plot suddenly takes a QUITE different turn... Before achieving his world-wide fame with his great swashbucklers, Douglas Fairbanks had already become a much-loved star of comedies and westerns (a fact which, regrettably, is very often being overlooked today, and many of his early films have almost sunken into oblivion) - but he certainly was at his VERY best in a combination of both; just the kind of movies like \"Wild and Woolly\"! Here, our handsome young hero, romantic, bubbly, temperamental and athletic, is most DEFINITELY in his element when he can finally prove that he's a real 'Westerner' (in fact, Doug WAS a real Westerner, of course: he was born in Denver, Colorado, and in the days when the West still WAS somewhat wild; but he'd also spent quite some years in New York, playing on Broadway), and as always show us his marvelous acrobatic tricks - note HIS way of getting into his room on the second floor, with all the stairs being blocked by the gangsters... The cast is wonderful, with lovely Eileen Percy (who was quite a star in those days, but today unfortunately is one of those many 'forgotten' names...), and the two 'usual suspects', Sam De Grasse and Charles Stevens (Doug's friend, a Native American and great-grandson of the famous Chief Geronimo) as the baddies; storyline and direction are superb, the pace is fast and keeps us entertained, amused and in suspense for EVERY single moment - in short: \"Wild and Woolly\" is one of those films that NEVER lose their freshness! And it'll thrill even 'newbies' to the silent cinema, it's great entertainment for the whole family; and besides that, it might be VERY interesting for fans of the Western genre to have a look for once at the way Westerns were long BEFORE the 'classic' Western era...",
         "By the time of \"Wild and Woolly\", only 18 months after his debut, Douglas Fairbanks was one of Hollywood's highest paid actors, third only after Chaplin and Pickford. His films were totally escapist - not for him the poor boy making good, his characters were usually wealthy so the problem of becoming a success before he could marry the girl never arose. He was free to play the gallant (as in \"A Modern Musketeer\") and the message to most young men in the audience was that they too could be successful if they just faced life with a smile!! This movie had one of his favourite themes - that of the uptight city dweller who longs for the life of a cowboy, which was really just about every kid's dream in those times!! With a photoplay by Anita Loos, photography by Victor Fleming, along with Doug, just a who's who of people at the start of their careers who were really going to make a big impact. From the start Doug's athleticism is on display: he plays Jeff, son of a railroad magnate and his bedroom is decked out like a scene from the Old West. He sleeps in a tepee, cooks his breakfast from a camp fire and even has his own saddle which he uses in his vivid daydreams of life on the open range. When the butler calls him, he ropes in the servant, displays some fancy shooting and ends up carrying him downstairs!! The only place where Jeff can feel a real part of the great outdoors is at the local cinema where the constant stream of cowboy movies keeps him entertained. Meanwhile back at the real ranch (Bitter Creek, Arizona) trouble is brewing - a crooked Indian agent (Sam De Grasse) is selling stock stolen from the Indians, across the border to Mexico, in the meantime keeping the Natives \"lickered up\"!! He also has a keen eye for pretty Nell (Eileen Percy), the hotel keeper's daughter. It just so happens that Jeff's father has mining interests there and he hopes that by sending Jeff out there he will cure his western \"nuttiness\"!! The citizens of Bitter Creek though need his support and they hope that by putting on a Wild West welcome for him - 1880s style, things will go in their favour. They plan a fake hold up of the Arizona Express (Bull Montana is one of the cowboys) but the Indian agent and his cronies get in on the act and decide to make it real. By the end Jeff's derring do and courage under fire saves the town and wins him his Nell!! Even though the print is murky and some of the racial stereotypes leave a lot to be desired this is a hilarious film. Eileen Percy was only 17 at the time \"Wild and Woolly\" was made and really found her fame through being married to songwriter Harry Ruby. Highly Recommended.",
         "Director: JOHN EMERSON. Screenplay: John Emerson, Anita Loos. Story: Horace B. Carpenter. Photography: Victor Fleming. Film editor: William Shea. Art director and construction manager: Bob Fairbanks. Assistant director: William Henabery. Production manager: Jack Fairbanks. Producer: Doug Fairbanks. Copyright 16 June 1917 by Artcraft Pictures Corp. U.S. release: 24 June 1917. Los Angeles opening: 4 July 1917. 5 reels. 72 minutes. Alpha's nice Kodascope cutdown runs 60 minutes. SYNOPSIS: A New York railroad magnate's spoiled, twenty-year-old son is a mad western freak who fondly imagines that America's West is still wild and woolly – and he wants to be part of the action! COMMENT: A movie that pokes fun at itself even way back in 1917? Fortunately, Alpha have a very good print of this one – even if it is a nice 4-reel Kodascope black and white cutdown. It would be great to see a tinted original, but I think prospects there are dim. Be thankful that Oldies have unearthed such a good print! Most of Kodak's cuts seem to have been made in the New York scenes. Anyway, the movie itself as we now have it, is a viewer's delight from go to whoa. The direction is brisk, the script witty, the actors most capable, and Fairbanks himself comes across in fine form. If you've never seen a Fairbanks movie of this vintage, you'll be surprised at how sophisticated it is, both in the making and the telling. In fact it's hard to decide which is the more amusing – the on screen action or the titles that wryly comment upon it all.",
         "I have accompanied on the piano silent movies since 1975, and this one was an absolute treat! The perfect sheet music is \"At That Bully Wooly Wild West Show\" with words by Edgar Leslie and Grant Clarke, and music by Maurice Abrahams (c. 1913, Maurice Abrahams Music Co., Inc., New York). The chorus goes like this (spellings are modified from the original): \"At that wild west show from Idaho, just see those shoot 'em up, shoot 'em up bronco busters. See that big tepee, those robbers came to plunder it, red men under it are shooting, now they're shooting. Hear that Gatling gun, the soldiers, hon, have come to kill 'em all, kill 'em all, don't get nervous. Hug, hug, hug, hug me tight. It's make believe tonight at that bully wooly wild west show...my honey...\" A great movie for watching and for making comparisons to this one is the late 20th century film \"The Hallelujah Trail\".",
         "This is one of the best silent comedies I've ever seen--and I have seen just about every film by the greats such as Harold Lloyd, Charlie Chaplin and Buster Keaton. While today Douglas Fairbanks is known simply for his action-adventure films, he also made some terrific comedies in the 1910s--and I can't imagine one that is better than this film. The film is set in 1917. In New York, the son (Fairbanks) of the President of a railroad is a bit of a nut. He apparently thinks that 'the old West' is alive and well and has brought a lot of this over-idealized version of the West to the city! He dresses in western garb, fires his pistols in the house and ropes his butler like some sort calf!! So, when someone from the railroad is needed to investigate the need for a line in Arizona, the nut's father sends him--hoping to cure him of his silly beliefs. However, the folks of the town decide to give the town a makeover--and make it exactly like the son expects. They reason that if the young man has a grand time playing cowboy, he'll recommend the railroad approve the expansion. So, they schedule an Indian raid, a train robbery and all the clichés of the West. And, to make sure nobody gets hurt, they load all their guns (and Fairbanks') with blanks. What they don't know is that an evil Indian agent is planning on making it all too real--using real bullets and staging a real robbery and kidnapping. When this occurs, it's up to Fairbanks to save the day...just like some sort of Western movie star! This film is a delight. It's the perfect combination of Fairbanks' strengths--amazing athleticism AND comedic timing. I laughed from start to finish and don't know why this film isn't more famous--it's as perfect a comedy as I've seen from the era and better than comedies of the day (the films we generally consider to be the best comedies during the silent era didn't come out until the 1920s). Brilliant. By the way, the copy I saw was from Televista and was duped directly from a Blackhawk film 8mm print!! As a result, it looks really bad. The film sorely needs to be restored and I have no idea if there is a better copy out there."
      ],
      "genres": [
         "Comedy",
         "Western",
         "Romance"
      ],
      "productionCompanies": ["Douglas Fairbanks Pictures"],
      "summaries": [
         "A rich young Easterner who has always wanted to live in \"the Wild West\" plans to move to a Western town. Unknown to him, the town's \"wild\" days are long gone, and it is an orderly, civilized place now. The townsmen, not wanting to lose a rich potential resident, contrive to make over the town to suit the young man's fantasy.",
         "Jeff Hillington, a New Yorker and heir to a railroad, loves the wild west. Trouble is, he imagines it as it was in the 1880s. When he decides to take a trip to Bitter Creek, Arizona, his father arranges that everything will look like it did in 1880, but to protect everyone from accident, everybody packing a pistol will only carry blanks. The local Indians, tired of their lot, get wind of the charade and attack the town with real bullets. It falls to Jeff to get from the saloon to his cache of arms through a hail of bullets, get arms back to the townfolks, and subdue the uprising. Does true love await his heroism?"
      ],
      "budget": 0
   },
   "movielensId": 170879,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1917-06-24",
      "dvdReleaseDate": null,
      "directors": ["John Emerson"],
      "runtime": 72,
      "movieId": 170879,
      "title": "Wild and Woolly",
      "mpaa": "",
      "actors": [
         "Douglas Fairbanks",
         "Eileen Percy",
         "Sam De Grasse",
         "Tom Wilson"
      ],
      "imdbMovieId": "0008775",
      "originalTitle": "Wild and Woolly",
      "genres": [
         "Drama",
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A rich young Easterner who has always wanted to live in \"the Wild West\" plans to move to a Western town. Unknown to him, the town's \"wild\" days are long gone, and it is an orderly, civilized place now. The townsmen, not wanting to lose a rich potential resident, contrive to make over the town to suit the young man's fantasy.",
      "tmdbMovieId": 135275,
      "avgRating": 3.25,
      "releaseYear": "1917",
      "numRatings": 2,
      "posterPath": "/hSs4ti3X9wKhJ9t9na3YXY7l1cT.jpg"
   }
}