{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "gambler",
            "id": 155841
         },
         {
            "name": "duffel bag full of money",
            "id": 187803
         }
      ],
      "imdb_id": "tt3155328",
      "video": false,
      "title": "Win It All",
      "recommendations": [
         426272,
         402582,
         430043,
         451563,
         402370,
         463940,
         364223,
         413417,
         323599,
         486331,
         454854,
         445962,
         458836,
         433018,
         401278,
         390407,
         419700,
         412894,
         408626,
         368993
      ],
      "backdrop_path": "/c3Z2KVeDVnym09AiBZ3NAWWXMU5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Eddie Garrett",
               "gender": 2,
               "credit_id": "5736e27bc3a3680ac00032b8",
               "name": "Jake Johnson",
               "profile_path": "/7X6pb4SDs9RoXi5gI4Nl8ZiPO4l.jpg",
               "id": 543505,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Eva",
               "gender": 0,
               "credit_id": "5736e294c3a36840ec000e07",
               "name": "Aislinn Derbez",
               "profile_path": "/rcN61xNn7UqXgUQwWRF44p81vA9.jpg",
               "id": 1134883,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Ron",
               "gender": 2,
               "credit_id": "58c29e9ec3a36842bd00dd4f",
               "name": "Joe Lo Truglio",
               "profile_path": "/uffxrZs4FieVu7pxneSzSxFAwXe.jpg",
               "id": 21131,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "5736e29cc3a36823dc0024cb",
               "name": "Keegan-Michael Key",
               "profile_path": "/gqPRozx8ppAg2TSjW3ww56LnIZr.jpg",
               "id": 298410,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Paul",
               "gender": 0,
               "credit_id": "58e661aac3a368730203dfeb",
               "name": "Cliff Chamberlain",
               "profile_path": "/nzBEcO3b3eZqKjeBnmyTcbyS2v3.jpg",
               "id": 1383989,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Monet",
               "gender": 1,
               "credit_id": "58e661c1c3a3684aa4031f6c",
               "name": "Tiffany Yvonne Cox",
               "profile_path": "/vkrzdQJ5KU9kA59Kp4FE561LYWY.jpg",
               "id": 1791031,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "58e66254c3a368731a04430e",
               "name": "Steve Berg",
               "profile_path": "/hIJBRInOM37mn24IPXRYay4wPWw.jpg",
               "id": 206311,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 1,
               "credit_id": "58e66262c3a368730203e073",
               "name": "Kris Swanberg",
               "profile_path": "/pktiebuU6WYJB6Z4b6D75xVK2cg.jpg",
               "id": 45423,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Glen",
               "gender": 0,
               "credit_id": "58e66279c3a3684a79033767",
               "name": "Jude Roche",
               "profile_path": null,
               "id": 1770795,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Michael",
               "gender": 2,
               "credit_id": "58e6634292514127ec045372",
               "name": "José Antonio García",
               "profile_path": "/hkUOXka2QlWCF3TFzCl4UgxJt8R.jpg",
               "id": 1791039,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Restaurant Patron",
               "gender": 1,
               "credit_id": "58e66449c3a368730203e1da",
               "name": "Katarina Garcia",
               "profile_path": null,
               "id": 1791050,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Emma",
               "gender": 1,
               "credit_id": "58e664db92514127e804502a",
               "name": "Abigail Garcia",
               "profile_path": null,
               "id": 1791059,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5736e2acc3a3687e1d002f33",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58c29d7cc3a36842f400ddd2",
               "name": "Eon Mora",
               "profile_path": null,
               "id": 1773613,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58c29d88c3a36842ff00f453",
               "name": "Dan Romer",
               "profile_path": null,
               "id": 1155140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58c29dfec3a36842bd00dc96",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58c29e09c3a36842ff00f4ec",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58c29e0fc3a36842c600fa1c",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58c29e1bc3a368429400e460",
               "name": "Jake Johnson",
               "profile_path": "/7X6pb4SDs9RoXi5gI4Nl8ZiPO4l.jpg",
               "id": 543505,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58c29e4292514104ef010026",
               "name": "Aimee Holmberg",
               "profile_path": null,
               "id": 1773614,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58c29e55c3a36842f400def0",
               "name": "Alex Orr",
               "profile_path": null,
               "id": 81334,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58c29e85c3a36842e800ede0",
               "name": "Jake Johnson",
               "profile_path": "/7X6pb4SDs9RoXi5gI4Nl8ZiPO4l.jpg",
               "id": 543505,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 10.010824,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 397442,
      "vote_count": 95,
      "budget": 0,
      "overview": "A gambling addict faces a conflict when entrusted with keeping a bunch of money that isn't his.",
      "similar": [
         32044,
         309242,
         10220,
         36557,
         8065,
         186,
         9029,
         16538,
         210860,
         2034,
         104,
         298,
         646,
         265208,
         396371,
         9464,
         8012,
         12208,
         524,
         146238
      ],
      "original_title": "Win It All",
      "runtime": 88,
      "poster_path": "/aEc69JY0azD9PwYtwS2RFwoyFOT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2017-03-11",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "https://www.netflix.com/title/80134527",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Joe Swanberg"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Jake Johnson",
         "Joe Swanberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3155328/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTEzOTYzOTctMDBjNi00NzMyLTkzNjgtYTIyNDAxOWNiMDIxXkEyXkFqcGdeQXVyMzI3MDEzMzM@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jake Johnson",
         "Rony Shemon",
         "Morgan Ng"
      ],
      "reviews": [
         "Drinking Buddies, the first collaboration between director Joe Swanberg and actor Jake Johnson, was one of my favorite films from 2013. In 2015, they worked together again in Digging for Fire, but in that case, the film was boring and disappointing. And now, in 2017, Swanberg and Johnson worked together once more in Win It All, quite an interesting film which evokes honest emotions with a deceptively simple screenplay and excellent performances. Johnson is best known for his work in the sitcom New Girl (one of my favorite series, by the way), but he has gradually become a brilliant actor, maybe limited to the particular \"likable loser\" niche, but with a big talent to capture the humanity hidden behind the dysfunctions of his characters. In the case of Win It All, said dysfunction is the gambling addiction in every possible way. Then, the unexpected visit of an old \"partner\" presents a unique opportunity for Johnson's character, and the rest of the movie portrays his sincere struggle to overcome his vice and create a new life, while making catastrophic decisions which couldn't only ruin his efforts, but also cost his life. As I previously said, a simple premise, but capable of taking us all over the emotional spectrum in a matter of seconds, without losing the rhythm of the tale and without betraying the nature of the characters. And besides, we also have perfect performances from Joe LoTruglio (best known for his work in Brooklyn Nine Nine, another one of my favorite sitcoms), Keegan Michael-Key, Aislinn Derbez, Nicky Excitement and José Antonio García in supporting roles. On the negative side, I found the ending of Win It All too abrupt, while trying to distract us from the main drama; I don't want to reveal too much, so I will leave that complaint ambiguous. Nevertheless, Win It All deserves a recommendation as a solid combination of comedy and drama in which things are exactly like they seem... and they are still able to keep us interested. In summary, I'm definitely interested in watching more collaborations between Swanberg and Johnson. Maybe a cinematographic \"crossover\" of Drinking Buddies and New Girl?",
         "\"Win It All\" is a film about a guy who is floating through life, never accepting responsibility. He is also a gambling addict, which is partly to blame for his lack of maturity. He knows he needs to reform, but he cannot muster the willpower. Like most gamblers, he is always waiting for the big payoff to pull him out of his hole, and fate sends him an opportunity to regain fiscal fitness--if he can just control his impulses. This is a solid kernel of an idea for a film, and Jake Johnson feels committed to the part of the main character, Eddie, but the film never reaches its potential. Much of the story feels clichéd and the characters are underdeveloped. This is most noticeable with Eddie's romantic relationship--with Eva (Aislinn Derbez, who feels like she has more to contribute). The development of their feelings for each other is cheated by many brief scenes that sometimes feel like a montage. This may be due, in part, to editing, but the writing is the main culprit. In scenes that should carry some weight, there is inadequate exposition. It's like watching a Cliff's Notes version of a film. The ending is abrupt and underwhelming. It's unclear if this was intentional or if it was due to the inadequate build-up of dramatic tension.",
         "Netflix said I will give this a full score. Netflix was right. This is a film about a man who has no job and no prospects. He thinks he is a good gambler but he is not good at all. A friend/colleague is going to prison. The guy leaves the protagonist a bag and says in clear terms, don't open it. I'll take it back when I get out and give you $10k. Our protagonist agrees. But he can't help him self. What follows is a funny, entertaining and hilarious ride. I loved this. This is like an Indie Swingers. This is Jake Johnson's best film since drinking buddies which I really liked. Raw and edgy. Fans of Rounders + Swingers + Owning Mahowny may appreciate it. Whereas Louis Ck fans might wanna try it too. Why am I writing this review? The rating on IMDb is ridiculous and discouraging",
         "Jake Johnson (Let's be cops) stars as Eddie a guy who's down on his luck and addicted to gambling while trying to get his life back on track. Eddie soon gets into trouble after losing money he's supposed to be looking after as a favour. In debt and out of time, needing the money back can he 'win it all\"? Co-staring is Jo Lo Truglio ( Brooklyn nine-nine). Win it all, to me is just a low budget version of The Gambler staring Mark Wahlberg. Which I would say the latter is the better watch. Only just... This Netflix Original film is average at best and just has no real depth to the film, a real lack of direction. Having said all of that the acting in this film is good and I felt there was good chemistry. One or two nice moments in the film but in the end you left feeling like maybe I've just wasted my time. Very forgettable. Review 5/10",
         "Overall, it is such a nice movie to watch, totally recommended and pretty good... But I felt like some emotions that were expressed by Eddie (Jake Johnson), the main character, were a little fake and not original or life-like. And the main idea or story that the movie made was not clear until the very end where he \"Won It All\". (can be a good or a bad thing) But overall a must watch.",
         "Can you change a person who's addicted to gambling? Even more important, should you trust this person with money? Well you will find out once you watch this. The main character is very well cast and you get a nice supporting cast too. It's overall pretty decent for a movie of this kind but nothing special. We also get treated to a love story and we know that there will be drama about the money. The brother figure gives this a whole different spin, though you are excused if you think there are quite a few glitches in logic to enhance drama. But that is how this works most of the time. Good enough, but nothing too exciting",
         "A solid bit of gambling obsession lite. It's an on-the-surface appealing mix of normal Swanberg character driven talk as plot mixed with a more conventional plot about bottoming out in order to be saved from self- destruction by way of addiction. However, neither of those things elevates the other, and what you have is a pleasing diversion with a solid main performance from Jake Johnson. And what can only count as coup for film in the age of the streaming -- this film premiered on Netflix yet it was shot on 16mm (presumably it will never be shown that way?) but because Swanberg opted for 16 over 35 the grain shows all over the screen and constantly reminds you of its origins.",
         "Goes straight to my \" feel good \" movies list. its very simple, yet touching. I smiled almost the whole time. actors were brilliant and everything felt natural and not overacted. if you like happy ending movies, but not the cheezy kind, this movie is for you. 10/10",
         "Leaves you with a smile, Im an amature in terms of actor and crew recognition but i loved this movie. Thought the acting and story was solid. Jake johnson was great and Aislinn Derbez mirrored him as the female lead. Loved the growth and struggle of brothers Joe Truglio and jake johnson. If youre looking for an interesting movie then this is a must watch.",
         "Chicago-centric writer/director Joe Swanberg has teamed up yet again with Netflix and his favorite everyman actor, Jake Johnson, for another straight-shooting comedic drama in \"Win It All.\" Although Swanberg bets once more on his honest-to-goodness, real people living everyday life approach to storytelling, this film has a much stronger narrative focus, marking another step forward for the modern indie auteur. In these last couple Netflix collaborations, starting with the limited anthology series \"Easy,\" Swanberg has improved upon his 2013 breakthrough \"Drinking Buddies\" by finding ways to up the stakes while staying true to the stories he wants to tell. Some audiences will crave more intriguing premises and manufactured melodrama and never quite get on board with him, but \"Win It All\" shows a willingness to compromise, if that's a fair way to put it. Johnson's Eddie is in many respects an ordinary, struggling blue- collar Chicagoan without a job trying to find his way, but the dimension of his gambling addiction puts a fat caveat on his \"everyday\" dealings. When a buddy going off to prison hands him a duffel bag with the promise that if Eddie simply returns it untouched when he gets back, he'll make $10,000, we're already aware of his risk-inclined personality and know this will not go well. Whereas Hollywood would take this plot and turn it into a heist film or crime drama, Swanberg is just interested in Eddie's roller coaster, and we're instantly curious as to which end Eddie will come out when the credits roll. It's not quite accurate to call \"Win It All\" a portrait of gambling addiction; the film is all about Eddie, but there's still a degree of distance between him and us – the objective is sympathy rather than empathy. Per Swanberg's M.O., the real interest is in Eddie's responses and choices, especially as it relates to the relationships in his life. His desire to change leads him to improve his relationship with his brother (Joe Lo Truglio), who wants nothing but to get Eddie on his feet, and lands him a new romantic opportunity in Eva (Aislinn Derbez from \"Easy\" episode \"Controlada\"). Eddie's ups and downs give a real pulse to this film that makes it a much more compelling watch than the casual attitude and mild conflict of \"Drinking Buddies.\" Swanberg captures his characters in such an earnest light, like no one else telling stories today, but that down-to-earth tone can result in dull plots. \"Win It All\" does a lot to mitigate that problem. The intensity still grades out at mild, but there's a distinct hook. Given the moral question hanging above the entire movie, Swanberg finds a really thoughtful and interesting way of ending the film that reminds us that Eddie's journey is about a lot more than whether the film ends with him in the red or the black. It may come off a bit anti- climactic, but if you know Swanberg, you can't watch this film expecting anything different. \"Win It All\" suggests there's at least reason to keep betting on him going forward. ~Steven C Thanks for reading! Visit Movie Muse Reviews for more",
         "Absolute horrible movie and a total waste of time. You can detail this movie in a paragraph. Losing gambler loses money of an acquaintance who went to jail. Losing gambler meets woman. Losing gambler seeks help from ga sponsor. Losing gambler goes to work in family business. Losing gambler dates woman who has kid and lives with mom. Losing gambler not allowed to meet mom or kid. Losing gambler loses more money that is the guys in jail. Losing gambler wins a hand of poker and wins all money back and has a heart attack. Now gambler gets out of hospital in record time and movie ends with gambler eating dinner with girlfriend, daughter and mom. That's it, no need to watch this pile of heap of trash. Go spend your time watching something else or going to sleep. There isn't any type of true action in this movie, there is a major lull of any definitive type action that gets you interested in any of the characters not even the main. It is unrealistic and here's the rub, you don't even see the winning hand played out nor is it feasible that the guy wins all the money back and then some in just one hand after losing hand after hand supposedly. There is a reason it's on Netflix, it wouldn't make it on screen or made for TV. 1 out of 10 and that's being generous.",
         "This is kind of a movie that you would't remember any thing about it right after watched it whatsoever. Nothing impressive, no casting, no directing, no cinematography, absolute nothing, emptiness, void! I rarely watch Netflix sponsored movies or shows and after this terrible experience, I decided that even those rare incidences would definitely drop to zero. This is for Joe Swanberg, please stop making movies, you may have some other talents in some other line of businesses. Go explore the world, start from scratch, try something else, I'm sure you will be way much successful in anything else but directing a movie, I'm sure you will, anything, just try it! Thank you.",
         "Jake Johnson (nerd from Jurassic World) plays an lazy degenerate with just enough likable charisma for me not to shut this off in the fist four minutes. A down on his luck addicted gambler is asked to hold a bag of dirty money while some dude does time. Take a wild guess what happens next? The gambling lows aren't low enough, would like to see this character suffer more. Jake's brother played by Joe Lo Truglio (Wet Hot American Summer/ The State) hits on all levels, would like him to be in more stuff like this, gave it a nice spark. The female lead was hot. It was good enough for me not to cancel my Netflix subscription. Happy Monday. ; ) Scooter",
         "For some reason I just didn't like this film as much as most of Swanberg's output. Straighforward plot is just not what he does best, his strong suit has always been character study, and with this film his characters were all sort of one dimensional; even the main character, though more rounded, falls a bit flat. I just feel like the story did not fit well with Joe Swanberg's easy mumblecore style, and felt a little forced.",
         "Story-wise Win It All is a standard gambling movie. I haven't seen that many, I've seen Rounders and... Does Casino Royale count? But there's a really familiar structure, which can make you feel like you've seen this movie already. That might be good if you're just looking to spend time, but if you're looking for something new, then the story won't do much to you. While the story itself might not be original, it's still well- written. The characters feel like human beings instead of simple characters designed for the story. Especially the main character Eddie is an interesting character. You really want him to get through his problems, maybe because you see yourself in him. Also you really want to yell at him and stop being an idiot. And as the story progresses you get really stressed over how he uses the money. So even though the story isn't original, it takes you with it, and it's the perfect balance between a heavy and a light story. But what is amazing in this movie is the cinematography and just the whole visual feeling to it. It looks like an old 70's movie, even though it takes place in 2000-2010's. The colours look amazing and bright, and the quality look like it's old or even made on an actual film. I especially love the hand-held camera, which makes most of the scenes very feel very intimate as we get so close to the situations at hand. Win It All might not stand out as a really special movie, but it's definitely worth watching at least that one time. It's a bit predictable, but there's something else about it that's special, mostly the cinematography and how just in a short while you already feel very invested in the characters and what happens to them. Definitely well written and directed movie, even though not close to perfect.",
         "This is very much like the script for The Fighter. Sure, that was about a has been, and this one is about a never has been. To mess things up the gambling is added on top. The acting is superb. The naturalism is excellent. It clearly diverts from the Hollywood rigid standard. And the small gestures do make a big difference in delivering the act. Yet the camera is annoying. Swanberg is trying to make the viewer part of the scene. The camera is just a human witness moving around. But he has to work hard on that. Because the result is pretty close to sea sickness. Like The Fighter, the main character is down on his luck. And his annoying brother is helping him at a price. The problem is the price is not too high so why is the main character refusing the help in the first place? By half time the story becomes shaky: is it about a gambler down on his luck or is it about a recovering gambler. In the end we get to know that is the latter, but that is simply because the script said so. And after that it is getting worse and out of scriptwriter's control. Although predictable, the criminal getting early is just there to hasten the closure. And the closure is magical simply because there is no other way to have a happy end. Which is corny the way it was set up. Yet the final is the worse. The script simply cuts to: and than the angel or whatever saw the guy had clean intentions and the angel gave him luck. Which is absurd, but the only way to get a happy end to a bleak story. But the guy wants more, after all he is a gambler. But god gives him a heart attack to take him out. The heart attack is so badly inserted into the script it might just well be inserted while filming. So for half a scene I though the guys went out without the money, simply because the black coat would look the same as the bag. And the rest? There is no rest. He does well. He starts eating his veggies and rests a lot more. And? What about the criminal inserted at the beginning that hastened the meandering and by the time pointless love story plot? How about a big house paid by a sole registered nurse wage? Will his lawnmower man money help? The time is up, the curtain is down and the story is left headless. The acting is good. The small details in camera, minus the shaking, are good. Yet in the end The Fighter is an excellent movie and Win It All is a fail. Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Forager Films",
         "Garrett Doubles Down",
         "Netflix"
      ],
      "summaries": ["Eddie Garrett agrees to watch a duffel bag for an acquaintance who is heading to prison. When he discovers cash in the bag, he's unable to resist the temptation and winds up deeply in debt. When the prison release is shortened, Eddie suddenly has a small window of time to win all the money back."],
      "budget": 0
   },
   "movielensId": 170937,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-03-11",
      "dvdReleaseDate": null,
      "directors": ["Joe Swanberg"],
      "runtime": 88,
      "movieId": 170937,
      "title": "Win It All",
      "mpaa": "",
      "actors": [
         "Jake Johnson",
         "Aislinn Derbez",
         "Joe Lo Truglio",
         "Keegan-Michael Key",
         "Cliff Chamberlain",
         "Tiffany Yvonne Cox",
         "Steve Berg",
         "Kris Swanberg",
         "Jude Roche",
         "José Antonio García",
         "Katarina Garcia",
         "Abigail Garcia"
      ],
      "imdbMovieId": "3155328",
      "originalTitle": "Win It All",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["ScKPEIg62eI"],
      "plotSummary": "A gambling addict faces a conflict when entrusted with keeping a bunch of money that isn't his.",
      "tmdbMovieId": 397442,
      "avgRating": 2.88889,
      "releaseYear": "2017",
      "numRatings": 27,
      "posterPath": "/aEc69JY0azD9PwYtwS2RFwoyFOT.jpg"
   }
}