{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "cheating husband",
            "id": 11513
         },
         {
            "name": "married",
            "id": 193682
         }
      ],
      "imdb_id": "tt5505722",
      "video": false,
      "title": "Only For One Night",
      "recommendations": [],
      "backdrop_path": "/zB4AGt4UMqUBBktChbTsI4mCZeU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "William",
               "gender": 0,
               "credit_id": "58e576559251412819031b5b",
               "name": "Brian J. White",
               "profile_path": "/A5xkyJ0hI6F81hHRm0xBOQEYonz.jpg",
               "id": 31137,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Chloe",
               "gender": 1,
               "credit_id": "58e5766a92514127e8034ded",
               "name": "Karrueche Tran",
               "profile_path": "/7XBNY9kuWq1raAiKer66JHxmg54.jpg",
               "id": 1473345,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Scott",
               "gender": 2,
               "credit_id": "590134a992514155c60037c0",
               "name": "Omar Gooding",
               "profile_path": "/80WbIRQzUvRQKabgvOErk2CAuZW.jpg",
               "id": 88183,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Caroline Waters",
               "gender": 0,
               "credit_id": "58e5768c92514127ec0354fe",
               "name": "Angelique Pereira",
               "profile_path": null,
               "id": 1790585,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bartender",
               "gender": 0,
               "credit_id": "5901349092514155d200395b",
               "name": "Jessica Vanessa DeLeon",
               "profile_path": null,
               "id": 1804523,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mayor Sallerson",
               "gender": 0,
               "credit_id": "590134c792514155f0003961",
               "name": "Dustin Harnish",
               "profile_path": null,
               "id": 78265,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Timothy Morris",
               "gender": 0,
               "credit_id": "590134e992514155d6003b38",
               "name": "Jarell Houston Jr.",
               "profile_path": null,
               "id": 1804524,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Kim",
               "gender": 0,
               "credit_id": "59013508c3a36810e5003b05",
               "name": "Aylya Marzolf",
               "profile_path": null,
               "id": 1804525,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "58e576a09251412810031ef6",
               "name": "Chris Stokes",
               "profile_path": "/dC4TMNac7fzpUC7011mrO1DqF6c.jpg",
               "id": 127936,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59013435c3a36810a8003b6f",
               "name": "Marques Houston",
               "profile_path": "/cSimSmPIFp3d52BUkE3ZUorc1Jn.jpg",
               "id": 77801,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.359774,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 450768,
      "vote_count": 4,
      "budget": 3500000,
      "overview": "A married womans husband with a perfect life cheats with her sister with extreme consequences befalling them all.",
      "similar": [
         11675,
         4170,
         8922,
         9679,
         210577,
         338766,
         347882,
         210479,
         164457,
         19913,
         4951,
         73,
         2064,
         1578,
         334541,
         214756,
         429200,
         416477,
         82633,
         209247
      ],
      "original_title": "Only For One Night",
      "runtime": 87,
      "poster_path": "/krwEgVt7tPzhl2RsCbjgkBX6948.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Footage Films",
         "id": 89529,
         "origin_country": ""
      }],
      "release_date": "2016-10-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Just when you thought BLOOD was thicker than water.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Chris Stokes"],
      "runtime": 86,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5505722/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTc1NTYxMDQwM15BMl5BanBnXkFtZTgwMzA3MjAyODE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Brian White",
         "Karrueche Tran",
         "Angelique Pereira"
      ],
      "reviews": [
         "I spent most of the movie ignoring the absolute horrible acting from the females and spent most of the time admiring the house decor. The house was nicely decorated. Brian White is a great actor but for the rest? Why did they have to cast models, these people are not actors, I've seen better acting at my local high school play.",
         "Am I the only one that was feeling deja vu while watching this movie? It was interesting but it was a lot like Fatal Attraction except it was his sister in law. I love Brian White and he always make his characters believable but Karrueche better take some more acting lessons, the kid was a better actor than her. But loved the effort. In time Karrueche.",
         "Even though this movie's premise has been constantly recycled, I was still willing to give it a chance. Most modern films in the current era are remakes or regurgitation of older films, so I've just learned to accept it for what it is. Originality and creativity is dead. A wise person once said, 'there are no new ideas.' And I'm starting to think they were right. While scrolling through Netflix one Friday night, I stumbled across this film. I had never heard of it, but I saw some names in the opening credits that I recognized. We all know who Karrueche is (mainly for her personal life and not because of any acting work), and I'm familiar with Brian White's work. However, the execution of this film didn't meet my expectations going into it. For one, the acting was pretty meh. Yes, just because you cast attractive people for certain roles don't mean they have the skill to sell it. There were some scenes that made me cringe because the acting was so bad. On top of that, the editing wasn't all that good either. I don't know, but choppy editing paired with sub-par acting is never a good sign of an amazing piece of cinema. Let me tell you. Watching this film made me realize how little research the writer did before embarking on this journey. I know it was written, produced, and directed by the same guy and it shows. The fact that Caroline was supposedly pregnant, yet we saw her drink glasses of wine on two separate occasions after spilling the beans about said pregnancy tells me someone didn't do their research. Sure, William may not have noticed it when she suddenly showed up at his dinner with Chloe. Guys are clueless, and may not know much of anything about pregnancy. But Chloe, who has been pregnant and given birth, should have made a comment about the fact her pregnant sister just revealed the big news to her all while chugging down a large glass of wine. There's no reason for Chloe to not have mentioned in passing about how Caroline should slow down on not drinking alcohol since she's pregnant now. I know this can be considered trivial in the grand scheme of things to some people, but that irritated me. I couldn't stop thinking about it. At one point, I just assumed Caroline was doing what these crazed women usually do in these kinds of films - lie about being pregnant to force the married man's hand in leaving his wife. But then we were shown a scene of her vomiting in a toilet, so that theory was soon nixed. Essentially, we had this pregnant woman drinking throughout the film like it was going out of style and none of the characters commented on it. Which means the writer didn't do his research and he dropped the ball completely. Don't get me wrong - I LOVE bad movies, and some of my favorite movies of all time aren't critically acclaimed pieces of cinema. But I can't say I enjoyed this one. I won't be re-watching this again. Chopping editing & directing + sub-par acting = yes, let's ONLY do this for one night and NEVER again.",
         "Monday, 5 September 2016 I saw this movie on free cable television channel last night. The subject and story line is Not new, but the lead actor, Brian White and actresses, Karrueche Tran as the happy loving wife and Angelique Pereira as the mentally twisted sister all did a good job. Many years ago when I was in college watching old movies for class assignments, a professor told the class that every movie or t.v idea has been done at least once, maybe twice, so there aren't any new ideas, just a twist on an old idea. I knew how this t.v movie would turn out, but it held my attention to the end.",
         "The plot was obviously unoriginal, but I decided to watch this because I love movies like Obsessed. This movie was predictable and unexciting. Some of the acting was unconvincing especially from the lead women but with the exception of the lead man and his best friend. I don't know if I should put more blame on the actors or the script. Brian White is a seasoned, talented actor, but Karrueche really needs to work on delivering lines. I know she is a relatively new actress, so I hope/know she will improve with experience. I'm not sure why movies keep coming out with this overused plot. Nonetheless, I would suggest this movie to people as an example of what results from a weak script and lackluster acting.",
         "Same story you've seen before, rich man in politics apparently so sickeningly in love with his wife that the first chance he gets he sleeps with (drumroll) her sister -multiple times, taking her out on the town etc. Sister goes ballistic after the end of the affair blah blah blah... It is pretty much an all black cast if that makes it any better for you. More of a bad comedy than anything, the fake crying, the bad acting, the guy claiming to be raped/drugged and all the other ridiculous premises.",
         "Going into this movie, I expected a lot since it was recommended and had well known actor Brian White as the leading man, but was quickly let down by the terrible acting (from everyone but Brian). The script itself seemed okay-ish. There were something that were said that I felt could've been just showed or more like implicit than explicit, but that's just me. There was one inconsistency where Caroline constantly drinks wine while pregnant, but is adamant about wanting to keep the baby and start a family which probably bothered me more than it should have. I also feel like there wasn't enough development of some of the characters. For example, Kim, Chloe's bestie (I'm assuming) or Richard, Caroline's late husband (the lack of development on him really irked me especially since they didn't clarify how he died; was nothing suspicious? The police usually always have an ongoing investigation about the crazy person in movies). Overall, this is a good film if it is a first film, but it's probably more fun to watch while drunk.",
         "Where is the soundtrack to the movie because i love every song on the movie please tell mi where mi can find it at i know some of the songs are by Irich but-who sang the rest of the songs this is a great movie cause sisters do be jealous of they sister its crazy but its life but Karachi plays her part good and her husband is everything and they Little pickney is handsome",
         "Like others have mentioned, the story line is not new, however, I did enjoy it. Maybe because it didn't cost me anything to watch it. I watched it twice. I do feel like Karrueche Tran needs more acting lessons. She was not believable in this movie and seemed kind of young for the part. As for the sister-in-law's part, I just wonder how in the world you find out you're pregnant in a matter of days. Someone mentioned above that the story didn't tell how the sister-in-law's husband Richard died, I didn't catch it my first time watching, but I did the second time. The sister-in-law states that she killed Richard.",
         "Horrible acting. This movie was based on the familiar plot of a supposedly happily married man cheating on his wife and the woman becoming obsessed with the man. The story was very poorly written. I think Brian White is a great actor but this movie was a complete fail. I enjoy a variety of types of movies and I can even deal with ideas being very similar to other movies but this one was poorly done.",
         "I wasn't sure whether it was a spoof or just a terrible movie. It is so so terribly bad it gave me a headache. The acting and directing is just the worst. Do not waste your time on this peace of garbage. I literally watched it cause I thought it was a comedy because of how terrible it was and it turns out it just an awful movie.",
         "As several reviews indicated, often, when a movie is made and considered to be very good it spawns others with very similar Plots and story lines. Many times that can work and produce an interesting film/s worth viewing. Ten minutes into \"Just 4 one night\" I felt like I was experiencing Deja vous. 20 minutes into it I was, quite literally, able to predict almost every scene, in chronological order, including much of the dialog and mannerisms of the actors and exactly what was coming next. If the film was touted as a remake of \"Fatal Attraction\" then I would have known what to expect. That is not the case with this piece of C**P film. It is hard to believe that the Producers, Director and Actors have not filed a law suit against the makers of \"J4ON\"! I would typically name the makers of the original film this one ripped off, but did not bother to even google the names as I had already wasted 80'+ minutes of my life on this film. The acting is terrible, the dialog and scene chronology was poorly done and predictable (again, if you have ever seen the very well done thriller \"Fatal Attraction\" with Michael Douglas and Glenn Close...Both were the only names I could recall from FA) and despite some minor differences in the story line, it was almost exactly the same. With the understanding that \"Fatal Attraction\" was an 8 vs. \"J4ON\" being a 1! Not a single redeeming factor in this production other then the fact that the actors were mostly easy on the eyes. I'll close on this....I have no problem with remakes or enhancements on previously made movies. That said, this film literally plagiarizes 90% of \"FA\" and does so shamefully. Please, fellow movie fans, Watch \"Fatal Attraction\", then, for laughs, watch \"Just 4 one night\"...,I think the usage of the number four (4) in the title to replace \"for\" is the most original idea in this whole Train wreck.",
         "I like the movie it was cool only thing how in two days she find out she pregnant am I crazy please somebody help me. But other wise it was nice I will watch again with someone else. The sister also did a good job just don't like she showed up at dinner and just disappeared how she knew she was coming."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Footage Films Studios",
         "Footage Films"
      ],
      "summaries": ["A married womans husband with a perfect life cheats with her sister with extreme consequences befalling them all."],
      "budget": 3500000
   },
   "movielensId": 171091,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-10-01",
      "dvdReleaseDate": null,
      "directors": ["Chris Stokes"],
      "runtime": 87,
      "movieId": 171091,
      "title": "Only For One Night",
      "mpaa": "",
      "actors": [
         "Brian J. White",
         "Karrueche Tran",
         "Omar Gooding",
         "Angelique Pereira",
         "Jessica Vanessa DeLeon",
         "Dustin Harnish",
         "Jarell Houston Jr.",
         "Aylya Marzolf"
      ],
      "imdbMovieId": "5505722",
      "originalTitle": "Only For One Night",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["4jFiaA32oJU"],
      "plotSummary": "A married womans husband with a perfect life cheats with her sister with extreme consequences befalling them all.",
      "tmdbMovieId": 450768,
      "avgRating": 2.75,
      "releaseYear": "2016",
      "numRatings": 2,
      "posterPath": "/krwEgVt7tPzhl2RsCbjgkBX6948.jpg"
   }
}