{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "black",
            "id": 9215
         },
         {
            "name": "mafia",
            "id": 10391
         }
      ],
      "imdb_id": "tt0103128",
      "video": false,
      "title": "True Identity",
      "recommendations": [
         49365,
         48609,
         46924,
         161460,
         49876,
         12774,
         29739,
         85529,
         48135,
         34151,
         20242,
         42010,
         26771,
         38981,
         67307,
         50672,
         25576,
         41971,
         20307,
         38560
      ],
      "backdrop_path": "/mjXSuxS1tD1VLv7av4TBc3V53CN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Miles Pope",
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f11",
               "name": "Lenny Henry",
               "profile_path": "/zoiIpLn2qhfByH1H8IC00XeJnRA.jpg",
               "id": 53519,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Leland Carver",
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f15",
               "name": "Frank Langella",
               "profile_path": "/wMlcjLBQouQjE0iceseNTxUF3BF.jpg",
               "id": 8924,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kristi",
               "gender": 1,
               "credit_id": "52fe48fec3a36847f8183f19",
               "name": "Anne-Marie Johnson",
               "profile_path": "/lbTHZPyuwADcESH7OERo8W5e46a.jpg",
               "id": 82340,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f1d",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe48fec3a36847f8183f21",
               "name": "Peggy Lipton",
               "profile_path": "/ufFeqwjB6GGdZCRnkZtNS2hDoz9.jpg",
               "id": 152759,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Taxi Driver",
               "gender": 0,
               "credit_id": "52fe48fec3a36847f8183f25",
               "name": "Melvin Van Peebles",
               "profile_path": "/ddQPAHTf764jN1V8S34BnGGzRT0.jpg",
               "id": 135650,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Houston",
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f29",
               "name": "J.T. Walsh",
               "profile_path": "/39KZjhJSyDjvBhKGj0IbGVteFAm.jpg",
               "id": 22131,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Anthony",
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f2d",
               "name": "Andreas Katsulas",
               "profile_path": "/z1bbvx6O7VWGrtxCFugo5aCyqMS.jpg",
               "id": 43773,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Duane",
               "gender": 0,
               "credit_id": "53a758550e0a2614490047e5",
               "name": "Charles Lane",
               "profile_path": "/wfQBgxZ0dEZDCmFjiKqDPC5MFcs.jpg",
               "id": 1333477,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Grunfeld",
               "gender": 2,
               "credit_id": "5a03041092514111f4017646",
               "name": "Bill Raymond",
               "profile_path": "/9qUefRsvEzitR2j8CwtXYbddayE.jpg",
               "id": 7576,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Martha",
               "gender": 0,
               "credit_id": "5a1d171a9251410336062424",
               "name": "Ruth Brown",
               "profile_path": "/apVBr2IGrEzh85MaiieM5JAjn0h.jpg",
               "id": 67950,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48fec3a36847f8183f39",
               "name": "Carol Baum",
               "profile_path": null,
               "id": 36131,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe48fec3a36847f8183f3f",
               "name": "Teri Schwartz",
               "profile_path": null,
               "id": 20622,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f45",
               "name": "Andy Breckman",
               "profile_path": null,
               "id": 55373,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fec3a36847f8183f4b",
               "name": "Marc Marder",
               "profile_path": null,
               "id": 129917,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48fec3a36847f8183f57",
               "name": "Kent Beyda",
               "profile_path": null,
               "id": 13584,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53a7582a0e0a2614320048b4",
               "name": "Charles Lane",
               "profile_path": "/wfQBgxZ0dEZDCmFjiKqDPC5MFcs.jpg",
               "id": 1333477,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "548592d29251416a66002a40",
               "name": "Thomas E. Ackerman",
               "profile_path": "/xFDbxk53icM1ofL4iCIwB4GkUxN.jpg",
               "id": 11371,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.382873,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56385,
      "vote_count": 14,
      "budget": 0,
      "overview": "In order to escape from the mob, an African-American man must disguise himself as a white man.",
      "similar": [
         7516,
         8012,
         101,
         1538,
         1422,
         156022,
         10651,
         390043,
         193893,
         787,
         769,
         186,
         27582,
         9366,
         10835,
         1948,
         2252,
         8909,
         2501,
         154400
      ],
      "original_title": "True Identity",
      "runtime": 93,
      "poster_path": "/2M6c3RDoDdxLmPNjeBCywOW2HVM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sandollar Productions",
            "id": 5842,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1991-07-23",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Ever since the mob's been after him...Miles Pope hasn't been himself!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Charles Lane"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Andy Breckman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103128/",
      "coverLink": null,
      "actors": [
         "Lenny Henry",
         "Frank Langella",
         "Charles Lane"
      ],
      "reviews": [
         "I picked a Laserdisc edition of this film up on ebay recently, simply because I was never aware that Lenny had acted in anything other than TV sitcoms. Personally, I thought the film was entertaining enough.... Lenny stars as actor wannabee 'Miles Pope' who is on the run from the mob after finding out that local good guy 'Leland Carver' is in fact a wanted criminal who is assuming a new identity after plastic surgery. Aided by his friend Duane, who is a movie make up artist, Miles is transformed into a White guy so he can escape a hit-man sent by Carver. However, once Miles has dispatched him, he then takes on the role as the hit-man himself, in a bid to undercover the truth about Carver and expose him to the FBI. The makeup that transforms Lenny into a white guy is very well done, however, his attempts at an American accent are less successful. The film has some good comedy moments, and some great one-liners, and it is a shame that it didn't do very well at the box office, in my opinion Lenny is a talented bloke and could have done so much more with his film career. So, to summarise: Nothing ground breaking here, and certainly no Oscars were missed but if you have nothing to do for an hour and a half you could do far worse than watch this. A fun little movie.",
         "Watching \"True Identity,\" I was somehow reminded of an old \"Saturday Night Live\" Eddie Murphy skit where he disguised himself as a white man, then walked around New York City in makeup, realizing that when no black people are around, white people like to get funky. At first I thought it was just a basic idea that bore resemblance, until two gags used in Murphy's skit were used in the film, and I started to wonder how they had ever gotten away with ripping off his materal. Then I realized that the writer of the film, Andy Breckman, used to write for \"SNL,\" and that the film was an unofficial spin-off of Murphy's skit. The problem with \"SNL\" spin-offs is that they take a successful five-minute paper-thin gag and stretch it out to full length. Mary Katherine Gallagher was never very funny, but her skits were watchable; whoever decided to put her oddball, unlikable character into a movie was nuts. Luckily, even though it is far from being a great motion picture, \"True Identity\" has its fair share of good moments, which include British comedian Lenny Henry getting to dress up as a white guy and pose as an Italian-American mobster hit-man, then posing as James Brown's brother. (One of Murphy's trademark characters on \"SNL\" was his impersonation of James Brown in \"James Brown's Hot Tub.\") Miles Pope is an aspiring actor living in the big city with hopes of becoming the lead in \"Othello.\" When he boards a plane, he finds himself seated next to a strange man named Leland Carver. When the plane starts to plummet, Carver (played by Frank Langella) admits that he used to be a criminal, who was believed to have died in an explosion, but in reality survived, had facial alterations, and \"spent thousands setting up a new identity.\" Of course, the plane then regains itself, leaving Miles with the knowledge that he will probably be chased by the gangster's hit men. So his only option is to disguise himself as a white man. This is essentially a very weak setup, with a truly ridiculous and contrived plot (like a mobster would admit his real persona for no reason whatsoever). But the movie does have a fair amount of fun, and a few good belly laughs, including the opening scene. \"You need to get to your roots,\" a director of a play tells Miles. \"Act more black.\" \"But black people don't act like this anymore!\" Miles says. The director doesn't care, so Miles tries to portray a stereotypical black man. The result is very funny. The film, as a whole, is completely harmless and serves its purpose. It's entertaining, with a silly plot but a good amount of funny scenes. Henry is able to show off how good he is at comedy while we are entertained. And for the record, his \"white man makeup\" was much more convincing than Murphy's.",
         "On his way to an audition, second-rate actor Miles Pope finds himself sat next to a businessman with connections to the acting world. However, during an extremely severe bit of turbulence, everyone assumes they will die and the confessions start \u0096 with Leland Carver confessing to Miles that he is really a wanted mobster (Frankie Lucino) assumed dead but hiding thanks to loads of plastic surgery. Of course when the plane doesn't crash, Carver is keen to keep his secret a secret and Miles finds himself on the run from a hit-man hired by Frankie. Few people will come to this film hoping for much; indeed judging by the votes on this site it would appear that few people have come to this film at all. The plot sets up lots of material to be furiously milked and the writers don't disappoint as they take every strained setup they can and wring it dry. The fact that the plot is silly and forced will be no surprise to anyone but this was a price that I was willing to pay in this type of film in exchange for laughs. Sadly the film isn't actually that funny; it has some good moments but they are in the minority compared to the rest of the film that is mostly just so-so. Henry's white makeup is impressive but once the novelty value has worn off there isn't a great deal left. His mimicry is good but his character voice (an American accent for Miles) is weak and generally his performance is only OK. His main problem is with the weak material he is given to work with; I'm not a big fan of him generally but he can do better than this. Langella is OK in support but not given that much to do \u0096 although his role is massive compared to the wasted presence of JT Walsh. Lane is pretty poor \u0096 not sure if he was trying to make himself the comedy Spike Lee but it didn't work. Overall this is a pretty average film at best, but it isn't at its best that often. It is undemanding nonsense that will please some viewers and the white makeup is impressive but it must be said that the majority of viewers will find this comedy rather lacking in laughter and wit. Mindless stuff all round.",
         "Lenny Henry (`Chef!') is a struggling outer borough actor in NYC who accidentally gets aquianted with a mob boss (Frank Langella) who is supposed to be dead. Convinced that his life is in peril, he has his make-up artist friend transform him from a black man to a white/Italian man and hilarious results ensue. I picked this up at a used record store on video used for $1.99. Don't know what happened to the tape, but if you see it listed for even ten bucks it's definitely a keeper.",
         "This one movie and the BBC Television series CHEF are my only connection with Lenny Henry, however I am a fan of his work on both projects. I haven't seen this movie on DVD as it is not released on Region 1 discs as of yet, I truly hope it is planned as I would love to own this title on DVD. My remarks are based on the VHS version, tattered and torn as it is. This film will keep you laughing and engaged from beginning to end, there are enough SNL-ish interactions between the characters to have caused a copyright infringement suit ;)(just kidding). The first time I watched this film it was truly ground breaking in a sense of character and timing, at least in my opinion (not having had much exposure to BBC TV/Celebs). His (Lenny Henry) off beat characters and persona(s) throughout the film are engaging and remarkably funny. Miles Pope seems to be the sort of guy you would not mind helping should he require it, although knowing ahead of time what kind of help he would need with regards to this film would surely have slowed my response time. However from the beginning plane ride on through the ending sequence this movie keeps me interested and laughing, a must see comedy for all ages based upon my perspective. Please, if anyone has any pull with the powers that be, have this title released on Region 1 DVD as soon as possible, thanks.",
         "Its the shame this movie bombed at the box office, it really not that bad at all! The script and direction is maybe so so, but as a first major role for Lenny Henry, he really should have got more movies out of this. Not forgetting that he had a great support cast who did the best with what they had, making a still amusing film at the right time of day. I thought the make up/transformation of Henry was quite amazing and funny and perhaps has been over looked under appreciated ?, (Then again its brilliance may have caused certain people some discomfort?). To sum up,great cast,dodgy script and slightly wobbly direction but still worth seeing.",
         "The comedic verve of Lenny Henry has flourished on both stage and television over 35 years for one of Britain's most loved entertainment personalities. However Dudley's finest son has never managed to translate his talent on to the big screen with much success. One of Lenworth's few attempts to break into Hollywood came in the 1991 release True Identity. True Identity is a Comedy/Crime effort that owes much of it's scope and design to Beverly Hills Cop (1984), which will generate comparisons for those who have seen White Chicks (2004). Henry plays a struggling actor who involuntarily ends up on the Hit List of a want away Mafia crime boss played expertly by Frank Langella. To avoid assassination Henry utilises the make-up prowess of a neighbour to turn himself into a white man, whilst teaming up with burned out FBI agent Houston (JT Walsh). Lets get something True Identity isn't the greatest work you'll ever see, but somehow the film kind of pulls off something worth watching, Henry's talent is obvious and with help from the supporting cast manages to get mileage out of the gags that do work, and the film delivers it's message while hovering around some potentially sensitive themes without ever taking itself too seriously.",
         "The first half hour of this movie could have been shortened by fifteen minutes -- too many minutes are used in set-up. It doesn't start getting good until Frank Langella comes along. Then it gradually improves as it goes along, and reaches and sustains its peak toward the end, starting when Henry introduces his alternate character. There is a somewhat large and famous supporting cast, and for awhile one wonders why so many well-known actors would sign on, but by the end, their involvement becomes justified, although some are not given much to do. This would make a good TV movie, but it would take a lot of bleeping. Too much of the F-word, for example.",
         "A struggling New York City actor enlists the help of a movie make-up artist after finding himself on mafia boss Frank Langella'a hit list (never mind why). The idea was suggested by an old Saturday Night Live skit featuring Eddie Murphy in Caucasian drag, and that one joke is expanded here by its original author into a contrived action-comedy partially redeemed by the enthusiastic efforts of a talented cast, led by newcomer Lenny Henry. The British comedian takes advantage of his feature film debut with an engaging comic performance, highlighting his gift for mimicry while disguised (courtesy of some astonishing prosthetic make-up) as a reluctant white man. But the feature length padding is all too obvious, and it's hard to ignore the script's TV roots when every labored plot complication seems sit-com inspired. To its credit the film doesn't pretend to be anything more than an amusing diversion, but the limited comic potential of the source material is such that the funniest scene (with Henry masquerading as James Brown's younger brother) has nothing to do with the racial identity-switch plot hook.",
         "Very interesting.. I remember when this film came out, and didn't catch it. BBC showed it last night and I saw maybe 2/3 of it.. and thought it hilarious in places. Well.. does ANYONE in the U.S. know Lennie? We in the UK do as a comedian/stand up... full of beans, larger than life. He is in a position to be able to play two 'races'.. he knows both, and I couldn't hear anything wrong with his accents. So, Disney signed him for three films.. pulled out after this flopped. Surprise. What American likes anyone taking the Michael, which they may think watching this. Not quite the 1941 syndrome, but.. Lennie wouldn't be KNOWN?? The story was easy to catch up with.. his 'sidekick' amusing.. WOULD any gangster be as 'slow' in catching on, I don't know. The men who played the parts were, I thought excellent. As in.. it WAS a part of the film.. tongue in cheek.. YES.. even the end.. 'worked'.... We are being told here in the UK now.. even our TV costs are unsustainable.. our movies cant be made without foreign money.. and now we have a Boston company telling commercial TV its costing too much. This to me is sabotage. Iaon Griffiths told us Hornblower would no longer be made due to costs.. that goes for most now. Indies spend the money with help..or nothing gets made? This is madness? I'm saying I fear for the future of our TV..and films.. UK wise.. This film bombs as it has a Brit in its lead role. A VERY good comedy, well made.. by Disney... well.. there you go. Shame.",
         "\"True Identity\" is a kinda/sorta fun little campy comedy about a black man who hides from the mob disguised as a white hit man. Very mediocre stuff, \"TI\" does give the viewer a rare opportunity to see Lenny Henry do his shtick. Worth a look but nothing special.",
         "Lenny Henry is a comedian I have a lot of time for , everytime I see him on the telly I say to myself \" Time for a bath \" or \" Time to mow the lawn \" or \" Time to go to bed \" In short he`s one of the most unfunny men ever to have his own BBC show so I was expecting TRUE IDENTITY to be a major road accident involving a star vehicle . I was nicely surprised Did someone say this was originally written for Eddie Murphy ? I must say that as Miles Pope Henry is actually an improvement over Murphy . Can`t you just imagine Murphy going way , way over the top in the role with the words \" Motherf***er \" appearing in every second sentence . Instead Henry makes Pope a likable affable loser who is very easy to like and boy does he make a very convincing white man . I bet Michael Jackson is asking the make-up team on this movie how it`s done Much of the credit of the film`s enjoyment for me is simply down to the script . It`s beatifully paced and contains a lot of scenes that had me gasping \" How is Miles going to talk himself out of this situation ? \" . If I have a complaint it`s that we don`t see enough of Miles as a white mafia hitman All in all a very entertaining comedy thriller , it`s not a classic and maybe my praise is down to the fact I was expecting to give TRUE IDENTITY one out of ten but it did keep my attention and gets six out of ten",
         "When I heard of Lenny Henry being the main star of a comedy film, I was obviously pretty impressed, same with when I actually watched his performance. Basically Miles Pope (Henry) wants to be an actor in the new Othello play, and he has had trouble getting the part, as James Earl Jones seems to be the one they will consider, he is only a replacement if he can't. Anyway, Miles has more trouble as he upset the member of a gang, and everyone thought he was dead, Leland Carver (Frank Langella). So to hide from him, he disguises himself as a white man who Leland thinks is hired to kill Pope. The comedy comes from both Henry as a white man, and the characters that he can create as an actor, being an actor. Also starring Charles Lane as Duane, J.T. Walsh as Houston, Anne-Marie Johnson as Kristi, Andreas Katsulas as Anthony, Michael McKean as Harvey Cooper, Peggy Lipton as Rita and Bill Raymond as Grunfeld. Henry does a fantastic impression of James Brown. Good!",
         "I have one word to summarise this film...Boring! A boring plot, boring dialogue, boring gags. The plot of a black actor trying to disguise himself as a white man? I mean who came up with this utterly tedious storyline. Remind me again why it was he was being chased by a mob? Exactly my point! Pointless so-called entertainment. Charles Lane made a shambolic attempt to piece together the film and its plot. I mean it's hardly rocket-science to work out what exactly was going to happen in the next scene. The only thing that kept the movie going was Lenny Henry's ability to play three...I think...different characters, each with contrasting characteristics, extremely well. In my opinion, a lazy attempt at comedy. My Rating : A poor 3/10",
         "Lenny Henry who is somewhat under appreciated as an actor was superb in this film he's very funny in 'True Identity' and makes a groundbreaking performance in this in his 'whitesuit'. He makes a fantastic caucasian person looking a little bit like a taller version of Martin Short (comedian/actor). It's unfortunate that this wasn't as big a hit as it should and could have been...It wasn't marketed properly, wasn't on enough Screens etc etc. I 've seen far more mediocre films do far better at the Box Office precisely because the studio put more money into marketing it or opened very wide...and that is a shame. It's business! It would be wise and make great business sense for some studio to do another movie with Lenny Henry as the star; one that mixes comedy with another genre or two eg; Comedy/Action, Comedy/Horror. Comedy/Romance/Action. Comedy/Sci-Fi/Action etc. etc...Lenny Henry is a comedic giant and could make some studio a heck of a lot of money!",
         "It was alright. not a bad little flick and didn't look too expensive to make, handy considering its box office. Still, it has that 1990s TVM look that dates movies horribly. I'm no scholar of film stock and the like but it is an especially unappealing way to photograph a movie. The music is awful too, farty horns and slap bass supplying the cheap, 'funky' incidentals and songs. Also bad (and a major flaw) is Lenny's American accent which is unconvincing and surprising considering his talent to mimic and impersonate. His Mafiosi is oddly more believable than his Harlem bloke. The makers clearly missed a trick here. Lenny should have been allowed to make his white character from Dudley and the difference of voice and behaviour would have been bigger and funnier. I imagine that this didn't happen because 1) It would have required a crowbar to force that into the plot and 2) it would have been ridiculous in extreme. British readers may (like me) relish the idea of Lenny in whiteface talking rubbish about the baggies and yam yam and Wolvo but it would be more or less imcomprehensible to normal people. Lenny is by no means perfect in this but he is the entire reason I give it 6, but then again I remember the bucket of water song. oooooooooooooooookkkaaaaaaaaaaaayyyy",
         "Give a British comedian an American script and this is what we get. Pretty dire if we're honest. I wanted it to be good as I'm a bit of a Lenny Henry fan (remember the OOOOOOOKKKKK guy from Tiswas? That's what I'm talking about!) but felt a bit embarrassed for the guy.",
         "I am also a Lenny Henry fan and have enjoyed this movie each time it's been on (I think 3-4 times) on US cable. Like many movies, one needs to suspend disbelief and just enjoy the ride. Frank Langella is always good as an unexpected bad guy and I thought Lenny's dual role was very well done. This movie is lite fare and fun. Run to your nearest PBS outlet and watch Chef when it's on.",
         "Oh dear. Considering the cast that this film has, I'm surprised that it turned out to be so bad. The usually good Lenny Henry is woefully miscast as an American, and no-one else seems to have remembered that they are in a comedy. Better luck next time, Lenny.",
         "This is one funny comedy. For those of you unfamiliar with Lenny Henry he's rude and sweet, as the jacket says a 'British Eddie Murphy' and that's pretty accurate. Star of the British comedy 'Chef' Lenny puts in a fantastic performance in this delightful 'identity crisis' film. You'll love it."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Sandollar Productions",
         "Silver Screen Partners IV",
         "Touchstone Pictures"
      ],
      "summaries": [
         "True Identity is a comedy about a black actor named Miles Pope who wants to play a part in Othello. After a plane ride home from a failed acting job Miles meets a producer named Leland Carver who slips out his mob identity when the plane is about to crash but after all of that the plane does not crash. Now Miles is the only man who knows the past to this mob man. Miles gets the help of his best friend make-up artist Duane to turn him into a White man. As Miles is packing his stuff to get out of town, the hitman walks in and a struggle is in affect. Miles wins the fight and kills the hitman in an electrical fashion. Now Anthony (Leland Carver's top man) comes in to confirm that Miles is dead. Now Miles is mistaken as the hitman. Now Miles must assume a parade of identity's to get away from the Mob's guns hot on his trail.",
         "In order to escape from the mob, an African-American man must disguise himself as a white man."
      ],
      "budget": 15000000
   },
   "movielensId": 171057,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-07-23",
      "dvdReleaseDate": null,
      "directors": ["Charles Lane"],
      "runtime": 93,
      "movieId": 171057,
      "title": "True Identity",
      "mpaa": "R",
      "actors": [
         "Lenny Henry",
         "Frank Langella",
         "Anne-Marie Johnson",
         "James Earl Jones",
         "Peggy Lipton",
         "Melvin Van Peebles",
         "J.T. Walsh",
         "Andreas Katsulas",
         "Charles Lane",
         "Bill Raymond",
         "Ruth Brown"
      ],
      "imdbMovieId": "0103128",
      "originalTitle": "True Identity",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "In order to escape from the mob, an African-American man must disguise himself as a white man.",
      "tmdbMovieId": 56385,
      "avgRating": 4.5,
      "releaseYear": "1991",
      "numRatings": 1,
      "posterPath": "/2M6c3RDoDdxLmPNjeBCywOW2HVM.jpg"
   }
}