{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0004100",
      "video": false,
      "title": "His Musical Career",
      "recommendations": [
         53390,
         53400,
         53401,
         53392,
         188781,
         53376,
         53387,
         53384,
         22938,
         53393,
         22941,
         54235,
         22870,
         21701,
         53385,
         53421,
         53369,
         33300,
         53422,
         2079
      ],
      "backdrop_path": "/i1QpSy6kgAm0Ckfp1P2bwKIMGuh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charlie, Piano Mover",
               "gender": 2,
               "credit_id": "52fe4863c3a36847f8164b97",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mike, Charlie's Partner",
               "gender": 2,
               "credit_id": "52fe4863c3a36847f8164b9b",
               "name": "Mack Swain",
               "profile_path": "/5sx09KDe6w2SofmPdh2eYUiTbVy.jpg",
               "id": 14435,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Piano Store Manager",
               "gender": 2,
               "credit_id": "52fe4863c3a36847f8164b9f",
               "name": "Charley Chase",
               "profile_path": null,
               "id": 108627,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. Rich",
               "gender": 0,
               "credit_id": "52fe4863c3a36847f8164ba3",
               "name": "Fritz Schade",
               "profile_path": null,
               "id": 89555,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Poor",
               "gender": 0,
               "credit_id": "52fe4863c3a36847f8164ba7",
               "name": "Frank Hayes",
               "profile_path": null,
               "id": 148021,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mrs. Rich",
               "gender": 0,
               "credit_id": "52fe4863c3a36847f8164bab",
               "name": "Cecile Arnold",
               "profile_path": null,
               "id": 89556,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Miss Poor (uncredited)",
               "gender": 0,
               "credit_id": "547ea1a092514124aa00068c",
               "name": "Helen Carruthers",
               "profile_path": null,
               "id": 147984,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Servant (uncredited)",
               "gender": 2,
               "credit_id": "547ea1c1c3a368395c00073d",
               "name": "William Hauber",
               "profile_path": null,
               "id": 150167,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Piano Store Salesman",
               "gender": 2,
               "credit_id": "56fd358c9251415faa0029cf",
               "name": "Billy Gilbert",
               "profile_path": null,
               "id": 1599036,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4863c3a36847f8164b93",
            "name": "Charlie Chaplin",
            "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
            "id": 13848,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.873883,
      "production_countries": [],
      "id": 53397,
      "vote_count": 7,
      "budget": 0,
      "overview": "Charlie and his partner are to deliver a piano to 666 Prospect St. and repossess one from 999 Prospect St.",
      "similar": [
         21385,
         383498,
         460793,
         74643,
         10527,
         568,
         597,
         37724,
         19,
         49026,
         54138,
         52520,
         158852,
         140607,
         157336,
         56292,
         155,
         81003,
         68726,
         75612
      ],
      "original_title": "His Musical Career",
      "runtime": 16,
      "poster_path": "/1gEYtFfsLdPiFhoA8HgmNIOz7w6.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1914-11-07",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Chaplin"],
      "runtime": 16,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0004100/",
      "coverLink": null,
      "actors": [
         "Charles Chaplin",
         "Mack Swain",
         "Fritz Schade"
      ],
      "reviews": [
         "I've seen quite a few Chaplin shorts from early in his career and I've noticed that his early stuff (done for Keystone Studios) is pretty dreadful stuff. Unlike his wonderful full-length films from the 20s and 30s, the films from 1914-1915 are incredibly poorly made--having no script but only vague instructions from the director. In most cases, the films had almost no plot and degenerated to people punching and kicking each other. In this film, Charlie gets a job working for a company selling pianos. While the plot never gets all that deep, there are some unexpectedly funny moments--particularly involving the poor donkey who is pulling the cart filled with people AND a piano as well as the sight of Charlie single-handedly toting what had to have been a prop piano. A cute film but not especially great either.",
         "This is one of the mellower comedies Charlie Chaplin made at Keystone, and therefore, to my way of thinking, one of his more enjoyable efforts for the studio. His Musical Career offers a coherent story which unfolds at a leisurely pace, several amusing gags, scant violence by Sennett standards, and a memorable finale to wrap up the package. But what's really of interest here is the influence this film exerted on Stan Laurel, Chaplin's friend and one-time stage colleague. As far as I know Mr. Laurel never specifically mentioned this short in any interviews, but even if he didn't actually see it I believe he must have heard about it, most likely from one of Chaplin's supporting players, Charley Chase. However it came about, several elements of this 1914 Keystone comedy found their way into Laurel & Hardy's famous Oscar-winning short The Music Box, produced in 1932. I should add that I don't consider this a matter of anyone stealing material; it was common for comedians to borrow gags and routines from one another and rework them, something Chaplin himself did many times. What's interesting, I believe, is to see how this material was used by Chaplin at the dawn of his career, and then adapted almost twenty years later by a pair of great comedians in their prime. The story begins in a piano shop, run by a very dapper-looking young Charley Chase. In the back of the shop, workman Mack Swan is approached by our lead player, who is seeking a job. There's some horsing around when Charlie switches a bucket of varnish for a bucket of beer, and Swain drinks it, but Charlie gets the job anyway, and becomes Mack's assistant. Meanwhile, the manager sells a piano to a prosperous- looking gentleman appropriately named Mr. Rich, and promises to have it delivered. Just then, a theatrical, wild-haired man—apparently a musician—enters. He begins to examine the new instruments in the show room with great excitement. This irritates Chase, who tells him that if he can't make the payments on the piano he already owns, it will be repossessed. Soon afterward, Mack and Charlie receive their instructions: deliver a piano to 666 Prospect Street (i.e. to Mr. Rich), and bring one back from 999 Prospect Street (i.e. from the wild-haired, impecunious musician). They proceed to load a piano into their mule-drawn cart, and head across town. Can you guess how this turns out? Well yes, you probably can, and if you figured they'd mix up the addresses you'd be right, but no matter. The allure of Keystone comedies was never in surprise plot twists, it's in what happens along the way. Incidentally, Keystone comedies aren't often celebrated for their cinematography, perhaps because surviving prints are usually so battered, but this one has several striking shots. I especially like the extended traveling shot of Charlie and Mack in their cart, rolling along in traffic, as Mack nods off and Charlie draws beer from their bucket with his pipe. Nothing especially funny happens, but we get a fascinating glimpse of the world of 1914, when vehicles drawn by horses or mules could still be seen in traffic alongside those newfangled automobiles. Once they arrive—at the wrong address, of course—the parallels with The Music Box become obvious to latter-day viewers. Mack (who is large and rotund) and Charlie (who is neither) must haul their piano up a narrow flight of stairs. Déjà vu! The similarities are there, but so are some differences: Laurel & Hardy built most of their film around what happens on the staircase, whereas Chaplin uses the stairs only briefly. In the Keystone version the piano rolls backward twice, pushing Charlie down the stairs before it, and we're reminded of what would befall Babe Hardy. At another point, Charlie happily steals a ride on the piano while Mack pushes it, as Stan would do. Even so, these are only brief bits of business in His Musical Career. You might say that Chaplin came up with a simple melody, but it took Laurel & Hardy to develop it into a symphony. The finale takes place when Charlie and Mack arrive at Mr. Rich's house and seize his piano, despite the vigorous objections of Mrs. Rich and a servant. Once they have hauled it outside, they are confronted by Mr. Rich, who, of course, is indignant. This is something like the moment in The Music Box when Billy Gilbert comes home to find that Stan & Ollie have trashed the place, but the outcome is quite different: after a brief scuffle in front of the house, Mr. Rich boots Mack in the butt. Consequently, Mack and Charlie sail down the steeply raked sidewalk, clinging to the piano. They roll into a park, and plunge into an inconveniently located pond. Mr. Rich watches in horror as his beloved instrument sinks into the depths, bearing the two workmen. Incongruously, Charlie plays a tune as the water level rises—and—fadeout! For many years I've owned an 8mm print of His Musical Career, courtesy of the folks at Blackhawk Films, but unfortunately their version lacked the climax, and ended abruptly just as Mr. Rich arrived home. It was a long time before I finally saw the finale, but it's a humdinger, well worth the wait. As for that Chaplin-to-Laurel connection, well, it would appear that someone at the Hal Roach Studio in 1932 remembered this Keystone short, and suggested it would make a great premise for Laurel & Hardy. If it wasn't Mr. Laurel himself, it may very well have been his friend and colleague Charley Chase, who, of course, played the dapper young manager of the piano shop. However it happened, it's intriguing to contemplate how a relatively minor entry in the Chaplin canon somehow morphed into a major entry in the career of Laurel & Hardy.",
         "Chaplin and Mack Swain are piano movers for Charley Chase in this fast-moving film. Of course they get the addresses mixed up and deliver a piano to the wrong address while also repossessing one from another customer by mistake. The comedy here isn't slapstick so much as it is gags, mainly sight gags. Chaplin lifting a piano with ease from one end on a sidewalk, and maintaining the same back-breaking shape after carrying a piano are two. The funniest is what happens with the donkey-pulled trailer they use to haul a piano. Still the film is not as developed as several other early Chaplin films. The same premise was later reused by Laurel & Hardy in The Music Box several years later. ** of 4 stars.",
         "His Musical Career, or Musical Tramps, reminds me of my days as a furniture mover in Los Angeles. The company I worked for did work for interior designers, so most of our time was spent delivering astonishingly expensive designer furniture for the rich an famous. I remember one day we had to move a piano across a room in house in the Hollywood Hills so we could get a new table in, and the piano was so heavy that it took six of our guys to move it, and even then we could only move it a few feet at a time. Because of this, I have a feeling that some of the comedy might be lost on a lot of the audience, because most people don't really realize how heavy pianos really are. For now I'll just say that there are moving companies that do nothing but move pianos (they're called \"piano movers,\" surprisingly enough), which is why it's so funny to see Chaplin carrying that piano around the room by himself. Musical Tramps was made in Charlie's first year making short comedies for Mack Sennett, so it's pretty simple, although there is the amusing premise that the diminutive tramp gets a new job as a mover and then messes up his first assignment, which is to deliver one piano and repossess another. He mixes up the order, of course, and goes to repossess the piano of a wealthy man who had just purchased it. (spoilers) But strangely enough, the film ends just when that premise is supposed to come into play. Charlie and his oafish co-worker get to the man's house and repossess it, and when the angry man finds out, he demands to know where they're going with his piano and then they proceed to roll down the sidewalk and into a pond. It seems to end before it's supposed to, but there are some good sight gags here ,such as Charlie carrying the piano around on his back and the donkey getting lifted off the ground by the load he's trying to pull. Also watch for Charliedoing his baseball pitch gag, which was done much more effectively but almost exactly the same in The Immigrant a few years later. Notice, by the way, that when they are repossessing the rich man's piano out of his stately mansion in what looks like Beverly Hills, at one point they bump into the wall, shaking the whole house!"
      ],
      "genres": [
         "Short",
         "Comedy"
      ],
      "productionCompanies": ["Keystone Film Company"],
      "summaries": ["Charlie and his partner are to deliver a piano to 666 Prospect St. and repossess one from 999 Prospect St. They confuse the addresses. The difficulties of delivering the piano by mule cart, and most of the specific gags, appeared later in Laurel and Hardy's \"The Music Box\"."],
      "budget": 0
   },
   "movielensId": 171115,
   "movielens": {
      "languages": [""],
      "releaseDate": "1914-11-07",
      "dvdReleaseDate": null,
      "directors": ["Charlie Chaplin"],
      "runtime": 16,
      "movieId": 171115,
      "title": "His Musical Career",
      "mpaa": "",
      "actors": [
         "Charlie Chaplin",
         "Mack Swain",
         "Charley Chase",
         "Fritz Schade",
         "Frank Hayes",
         "Cecile Arnold",
         "Helen Carruthers",
         "William Hauber",
         "Billy Gilbert"
      ],
      "imdbMovieId": "0004100",
      "originalTitle": "His Musical Career",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["0-rRTSnVP_U"],
      "plotSummary": "Charlie and his partner are to deliver a piano to 666 Prospect St. and repossess one from 999 Prospect St.",
      "tmdbMovieId": 53397,
      "avgRating": 3.66667,
      "releaseYear": "1914",
      "numRatings": 3,
      "posterPath": "/1gEYtFfsLdPiFhoA8HgmNIOz7w6.jpg"
   }
}