{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt1526284",
      "video": false,
      "title": "Ay Lav Yu",
      "recommendations": [
         52089,
         79212,
         27275
      ],
      "backdrop_path": "/aQAu4l3jZ6421JJDuu3FsXaS6PT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Abraham",
               "gender": 2,
               "credit_id": "52fe47aac3a36847f8141a8d",
               "name": "Sermiyan Midyat",
               "profile_path": "/54mrpmBmc6xKKTT0e3gYUJsbfu5.jpg",
               "id": 142839,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Zisan",
               "gender": 0,
               "credit_id": "52fe47aac3a36847f8141a91",
               "name": "Fadik Sevin Atasoy",
               "profile_path": "/hLN9KPVvntBouf0fZiCfbbOV0XY.jpg",
               "id": 142852,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Christopher",
               "gender": 2,
               "credit_id": "52fe47aac3a36847f8141a95",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe47aac3a36847f8141a99",
               "name": "Josh Folan",
               "profile_path": "/cw0hmEMYG0PNniSZBXKSD4gFFyf.jpg",
               "id": 142853,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fehime",
               "gender": 0,
               "credit_id": "52fe47aac3a36847f8141a9d",
               "name": "Ayca Damgaci",
               "profile_path": null,
               "id": 142854,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47aac3a36847f8141aa3",
            "name": "Sermiyan Midyat",
            "profile_path": "/54mrpmBmc6xKKTT0e3gYUJsbfu5.jpg",
            "id": 142839,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.793129,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 49833,
      "vote_count": 9,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Ay Lav Yu",
      "runtime": null,
      "poster_path": "/trfMP9rkEuVKMJk84uobblikDx1.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [],
      "release_date": "2010-03-12",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sermiyan Midyat"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Sermiyan Midyat"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt1526284/",
      "coverLink": null,
      "actors": [
         "Fadik Sevin Atasoy",
         "Cengiz Bozkurt",
         "Ayça Damgaci"
      ],
      "reviews": [
         "This light-hearted movie which sounds like a comedy at first glance is actually a political satire. The movie is set in a village named \"Tinne\" (meaning \"it doesn't exist\" in the local Kurdish dialect)in the Southeastern Anatolia. Its existence is not officially recognized so no villager has identification card. Because of its so called de facto existence, there are no schools, no cottage hospitals and no civil servants. Though Yusuf Agha, who is more like a feudal lord or a landlord for the locals, incessantly writes letters and letters to make the government recognize the existence but his letters somehow never reaches the destination. The only hope for the village is Agha's son Ibrahim. Ibrahim apparently gets an ID thanks to the Syriac priest Hanna who happens to adopt him legally.So, as the fishery engineering graduate, the village expects Ibrahim to turn the village into a prosperous,well-off entity.But Ibrahim has other plans like getting married. While studying in Adana he meets this American girl,Jessica who works as an interpreter in America's military base in Incirlik. When Jessica's family comes to this \"non-existent\" land, a series of absurd,funny events come to pass. If I say I did not enjoy the movie that wouldn't be fair. At some points the movie sounds hilarious,amusing and comical but to make the most of this \"humor\" you need to have a good command of Turkish. For instance when Saido, the guy who is supposed to place the animals in the truck, while seeing the Agha off with the animals in the front seat, he says \"Bovine in front of the car, and ovine in the back\" This may not really sound like a witty remark for a foreigner.All I am saying the wisecracks are too local to be enjoyed by a foreigner. \"Ay Lav Yu\" again brings up the \"Kurdish issue\" by presenting the daily daily lives of Kurdish villagers on silver screen like so many TV-series have done before but it's the first movie that mentions the other side of the coin a bit. Let me put it this way. When the agha tries to send another letter, Saido the laborer says :\" Maybe this way it is much better. We can at least use free electricity. Did you see the new poles I've erected? Even Electricity Institution doesn't have poles like that.Why do you awaken them?\" Yes,it's the first time a movie mentions the fact that in most of the distant parts of the East people do not pay for their electricity.But is this enough? Well I don't think so. Although that never justifies the fact the state has been tied up in excessive bureaucratic rigmarole and neglected the well-fare of its citizens but let us not forget that not just the villages in Eastern and Southeastern Anatolia have been like this.Say,villagers in the Black Sea and Central Anatolia would lack decent water networks, smooth electricity lines, public personnel like teachers and doctors too.Juxtaposing two different cultures,different social mores, different ways of life may look charmingly,surprisingly fun.But reacting to a American chopper's coming to get an American citizen in a way: \" How? I've been writing letters for 40 years, nobody's come over yet.She will have a chopper sent only upon a phone call.\" doesn't make sense either. We know that the Americans have issues too. If some filmmaker, Kurdish or not, questions some facts in the future we may be really enlightened: even in small districts in the East, the pavements are always ladened with luxurious four-wheel-drive cars for traveling over rough terrain.Does that ring a bell? How on earth could this happen in a region where most of the population is poor? Putting the responsibility on \"state\" is easy but why not putting some of that responsibility on these aghas,landlords,feudal lords who were the Shylock of the past and smugglers of today? All in all, Ay Lav You is a light-hearted comedy which you may find entertaining,funny,hilarious and even absurd. As for its political side, the veiled diatribe is again launched into the wrong direction.",
         "Turkish actor and TV scriptwriter Sermiyan Midyat (\"Polis\" & \"Pardon\") re-teams with veteran comedy producer Sinan Çetin (\"Pardon\" & \"Propaganda\") for this fun little culture clash comedy which has had mixed critical reception and only moderate box-office success. Recently graduated İbrahim (Sermiyan Midyat) returns to his family home in the officially unrecognised Kurdish village of Tinne in east Turkey with his American fiancée Jessica and her family in tow for the prerequisite cross-cultural confusion with political undertones. Sermiyan Midyat makes for an amiable if somewhat hammy romantic comedy lead but struggles to generate any apparent chemistry with stilted sometime stunt woman and US TV bit-player Katie Gill (\"Date Night\" & \"The Cellar\") as his supposed love interest. 80s comedy superstar Steve Guttenberg (\"Police Academy\" & \"Short Circuit\") continues his non-come back at the head of a bizarre supporting cast which includes the ever radiant Mariel Hemingway and a brilliant comedy turn from veteran Turkish actor Meray Ülgen. The debut director under the influence of a truly talented producer quickly seems to abandon the romantic comedy elements in favour of a more political satire which misses more targets than it scores but nonetheless provides enough light hearted laughs to be worth a viewing. \"Maybe you will ask, if nothing exists, why do you exist?\""
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Plato Film Production"],
      "summaries": ["Ibrahim returns to Tinne, along with his girlfriend, Jessica, but will the tiny village become their new home?"],
      "budget": 0
   },
   "movielensId": 171383,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2010-03-12",
      "dvdReleaseDate": null,
      "directors": ["Sermiyan Midyat"],
      "runtime": null,
      "movieId": 171383,
      "title": "Ay Lav Yu",
      "mpaa": null,
      "actors": [
         "Sermiyan Midyat",
         "Fadik Sevin Atasoy",
         "Steve Guttenberg",
         "Josh Folan",
         "Ayca Damgaci"
      ],
      "imdbMovieId": "1526284",
      "originalTitle": "Ay Lav Yu",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 49833,
      "avgRating": 3.5,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/trfMP9rkEuVKMJk84uobblikDx1.jpg"
   }
}