{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1972752",
      "video": false,
      "title": "Shockwave Darkside",
      "recommendations": [],
      "backdrop_path": "/4lU0YSG91L82TVsZUZUPcmlY541.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dalton",
               "gender": 2,
               "credit_id": "53b483a80e0a26597d00d2c6",
               "name": "Bill Sage",
               "profile_path": "/2uQv1NMnGrqqhBMKTm5RBCKh7UV.jpg",
               "id": 32029,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Private Lang",
               "gender": 1,
               "credit_id": "53b484030e0a26598900d3ef",
               "name": "Sonequa Martin-Green",
               "profile_path": "/njUz3yY8Wucm7HP3FRNgfVoMqsV.jpg",
               "id": 1031067,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "The Machine",
               "gender": 1,
               "credit_id": "53b483230e0a26598c00d6a3",
               "name": "Mei Melancon",
               "profile_path": "/5qCTPp26NsLkMRp8NWc9u5nDo6z.jpg",
               "id": 963609,
               "order": 2
            },
            {
               "cast_id": 28,
               "character": "Corporal Kim",
               "gender": 0,
               "credit_id": "573dc81592514138d50003d6",
               "name": "Rich Ceraulo",
               "profile_path": "/vE7LcuJgd1APm3DVRhiWLOPcJYr.jpg",
               "id": 141041,
               "order": 3
            },
            {
               "cast_id": 29,
               "character": "Private Schorr",
               "gender": 2,
               "credit_id": "573dc82f92514138d50003e3",
               "name": "Alexander Cendese",
               "profile_path": "/wb9ElAiZQguXwuyLwai1OwBvaqS.jpg",
               "id": 168280,
               "order": 4
            },
            {
               "cast_id": 30,
               "character": "Brooks",
               "gender": 0,
               "credit_id": "573dc846c3a36875840003c1",
               "name": "Nedra Gallegos",
               "profile_path": null,
               "id": 1622415,
               "order": 5
            },
            {
               "cast_id": 31,
               "character": "Private Kiminski",
               "gender": 0,
               "credit_id": "573dc85dc3a3685e4c0011fa",
               "name": "Conan Marchi",
               "profile_path": null,
               "id": 1622416,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53b482070e0a26598300d23d",
               "name": "Jay Weisman",
               "profile_path": null,
               "id": 1336732,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53b482bb0e0a26597d00d29b",
               "name": "Jay Weisman",
               "profile_path": null,
               "id": 1336732,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "573dbfbd92514147d40010e2",
               "name": "Dan DeFilippo",
               "profile_path": null,
               "id": 1622392,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "573dc00c92514138d50002de",
               "name": "Kevin Fox",
               "profile_path": null,
               "id": 58228,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "573dc02192514138d50002e1",
               "name": "Dave Marken",
               "profile_path": null,
               "id": 1622393,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "573dc039925141392b0003a4",
               "name": "Isen Robbins",
               "profile_path": null,
               "id": 61310,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "573dc04dc3a3680190000cb0",
               "name": "Aimee Schoof",
               "profile_path": null,
               "id": 61312,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "573dc060c3a3687518000233",
               "name": "Andreas Weidinger",
               "profile_path": null,
               "id": 45900,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "573dc0c9c3a3685e4c001108",
               "name": "Robert Fiske",
               "profile_path": null,
               "id": 1622394,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "573dc0e19251413e1c000312",
               "name": "Joe Gabriel",
               "profile_path": null,
               "id": 1622395,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "573dc5389251414bd8001153",
               "name": "Eric Dow",
               "profile_path": null,
               "id": 1489549,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "573dc54c92514136720023f8",
               "name": "Doug Fitch",
               "profile_path": null,
               "id": 1622401,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "573dc55d9251413dfc0002f2",
               "name": "Sig De Miguel",
               "profile_path": null,
               "id": 4906,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "573dc573c3a3681b4e00285d",
               "name": "Mike DeMayo",
               "profile_path": null,
               "id": 1622402,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "573dc58b92514147d40011a3",
               "name": "Stephen Vincent",
               "profile_path": null,
               "id": 94470,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "573dc5bdc3a3686dc500038d",
               "name": "Christopher Plummer",
               "profile_path": null,
               "id": 1622403,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "573dc5e59251413db5000328",
               "name": "Ryan O'Rourke",
               "profile_path": null,
               "id": 1622404,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "573dc5f9c3a3687584000360",
               "name": "Leslie Watters",
               "profile_path": null,
               "id": 1459737,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "573dc690c3a3680190000d67",
               "name": "Sam Krueger",
               "profile_path": null,
               "id": 232170,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "573dc6e0c3a3685e4c0011c4",
               "name": "Wayne Harry Johnson Jr.",
               "profile_path": null,
               "id": 1622409,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "573dc70f9251413db5000365",
               "name": "Keith McGregor",
               "profile_path": null,
               "id": 1622411,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "573dc720c3a3681b4e0028b4",
               "name": "Spencer Witter",
               "profile_path": null,
               "id": 1622412,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "573dc731925141392b0004a9",
               "name": "Allison Howe",
               "profile_path": null,
               "id": 1622413,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "573dc781c3a3685e4c0011db",
               "name": "John Northcraft",
               "profile_path": null,
               "id": 1586989,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "573dc7cbc3a3685e4c0011e9",
               "name": "Eric Rodrigues",
               "profile_path": null,
               "id": 1622414,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.680928,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 279965,
      "vote_count": 2,
      "budget": 0,
      "overview": "The nano-plague that poisoned Earth’s water supply has reached its 60-year critical mass. The Unlight enemy forced the first exodus to the moon where the outlawed banished population was supposed to die. But now the Unlights have launched from Earth and are amassing on the south-west sector of the darkside of the moon for a massive ice-mining operation. It will be the last Great War and lunar troops are sent into battle for the precious resource. However one squad is shot down and the five surviving soldiers find themselves stranded. Cut off and behind enemy lines, they start a dangerous journey through snipers and minefields back to their extraction point with only 36 hours of oxygen left. As their numbers dwindle and nerves fray, they make an amazing discovery about Earth’s satellite that just might save their lives. From THE BANSHEE CHAPTER producers comes a space shocker with gravity.",
      "similar": [],
      "original_title": "Shockwave Darkside",
      "runtime": 87,
      "poster_path": "/rSr7kVWqZfiozNvOErSejkXGyeH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Red Giant Media",
            "id": 77029,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Favorit Film",
            "id": 19601,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pipeline Entertainment",
            "id": 77028,
            "origin_country": ""
         }
      ],
      "release_date": "2014-08-22",
      "vote_average": 1.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://shockwavedarkside.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jay Weisman"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Jay Weisman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1972752/",
      "coverLink": null,
      "actors": [
         "Mei Melançon",
         "Bill Sage",
         "Sonequa Martin-Green"
      ],
      "reviews": [
         "Watched this \"movie\" at FrightFest 2014 (a \"world premiere\" and I hope the last ever showing), it was by far the worst movie shown and an embarrassment for anyone involved. Never have I seen a cinema auditorium empty so quickly. Dubbed as a 3D movie, it was the worst use of 3D I have ever seen, with at least 50% of the shots viewable with no 3D at all; I ended up watching most of the movie without 3D glasses. The CG looked unfinished, a very confusing use of HUD (used throughout the movie) made some moments unwatchable and the script was just plain awful. There really was no need to make this into a movie, an audiobook would have been easier to digest. The boxy spacesuits looked like they were made from cereal boxes, you could clearly see tape around the edges! My creativity in writing has waned so I'll bring this to an end, this movie is truly awful, some people should never make movies.",
         "And I'm not talking about \"how bad the movie is\" or me watching this was awful or worst ... ever scenarios. I've seen worse movie, that's not it. But I have never seen anything and talked to people after that, where no one ... let me write that get again -> NO ONE(!), not one single person, had anything good to say about the movie. This happened at Frightfest and if this movie won something, it was worst movie playing in 2014 at the Festival. Having said all that, I normally have a weak spot for movies that put a band of people together, preferably with different skills, diversity in general. One of the few things this almost succeeds in. One of the other being the science factor, where a friend of mine said, they got a couple of things right. But all is rendered useless, by an uninspired script, acting \"wooden\" (which is also attributed to the really bad costumes), bad effects that could be able to make you puke and a general disorientation at times. Which is even worse when it happens during action sequences. It's a shame, but this 3D experiment went completely off the rails .... not in a good way",
         "This was a catastrophic new low in my film watching and cinema going life, easily the worst film I've ever seen and the first time I've walked out of a film at the cinema. For god sake, I even sat through Transformers 2!! An incomprehensible mess of a film with poor sound, pointless ill conceived 3D and a complete lack of plot, structure, anything. CGI reminiscent of my 80's Atari console which only helped confuse the viewer as to what was happening. The actors were stuck inside cardboard space helmets the entire films which meant any attempts they made to act were sadly thwarted by a script which was pure amateur hour I'd give it 0/10 if IMDb let me",
         "I'd rather forget the experience of watching this film altogether than dwell on it, but this is so bad that I feel people have to be warned. Unlike many people who left the screening I was in (at London's FrightFest) I stayed to the bitter end out of morbid curiosity. Shockwave Darkside fails as a piece of filmmaking on every level. Unwatchable 3D, faulty colour grading, dull and unvaried visuals, incredibly basic CGI, awful sound, a ridiculous and nonsensical plot, a terrible and pretentious script, two-dimensional and unbelievable characters, high school-standard acting (though I do feel sorry for the actors, especially Bill Sage who doesn't deserve to have this abomination on his CV), silly costumes, poor and muddled exposition, nonexistent structure and sloppy – at best – direction (at one point a major character dies in a period of relative action, but this is only apparent after a few minutes when you realise she's just not there any more so must have been killed). It also features the sort of cod philosophy that you engage in when drunk or stoned as a teenager at 3am. You might imagine that a film this bad would benefit from a degree of so-bad-it's-good entertainment, but it fails even on that level. While the whole thing is extremely silly, and some quotes are potentially funny, it's way too dull and charmless to justify comparisons with the sort of 70s and 80s low-budget genre films that many of us love to laugh at (or with). The only thing you could possibly credit the filmmakers with is ambition, including an attempt at a pay-off involving a (totally infeasible) \"discovery\" regarding nothing less than the origin of life on Earth (I hope that's vague enough to not be a spoiler, but it really doesn't matter anyway). Unfortunately this sub-Twilight Zone reveal is as poorly executed as the rest of the film, involving arbitrary and unbelievable decisions made by characters and preposterous scientific postulations. I'm genuinely curious as to how this film got made. At any number of points from first draft of the script onwards it must have been clear to at least some of those involved that this was going to be terrible. I feel sorry for the people who made Shockwave Darkside as I can empathise with anyone who tries their best and puts a lot of time and effort into creating something only for people like me to say horrible things about it, but frankly they should consider their futures in filmmaking as I fear it's not for them. In any case any sympathy I had disappeared when I saw that 11 people had given the film 10/10 on here, as this is obviously people involved with the film. While you'd expect that with any film, to make THIS and then do that betrays an unhealthy degree of chutzpah. There are probably worse films in existence than this, but I don't think I've seen any of them.",
         "Avoid this piece of crap at all costs. I really tried to find any redeeming quality in the movie (if it can be called one) but I sincerely can't find any: the script is terrible, the production value is even worse and the direction might as well have come from a high school kid. The movie lacks structure, any decent line of dialog or engaging plot, it has lame HUD's superimposed at random times and shows what might be the worst space suit design even for a low budget film. I can't give it a 1 simply because I can imagine that somewhere there is a worse film worth of that rating, but I have yet to find it.",
         "Shockwave Darkside 3D (as it was at the cinema) is unwatchable. The 3D had big issues; I kept fiddling with my glasses to see if the problem was on my end but nope, it was the movie. That aside, the story is non-existent, or at least well hidden. And another thing, the special effects were truly horrible. Think \"The Last Starfighter\" from 1984 and you might have an idea what I'm talking about, except that at least that movie was doing something new. Who cares if you could argue they look vaguely realistic, they looked crap, like a not so expensive video game. Even budget effects can look good or fitting, or at least fun. These were none of the above. Cold, stark and clinical like Tron (1982), but Tron was meant to look like a video game - this was probably not. But excluding all this, the acting was wooden and it was hard to recognize any of the characters, whose faces were obscured in ridiculous space suits. I walked out after twenty minutes because I couldn't take any more. To those who remained, I applaud you.",
         "I cannot believe anyone would give this movie anymore than 1 star much less 9 or 10. Everything about this movie is bad except maybe the poor actors trapped in this, this, I don't know what to call it. The premise was kinda neat but just so low budget, A scifi movie on the moon is gonna need a CGI budget of some kind. At least more than the hundred bucks it looks like they spent on this one. I'm serious if I could just show a pic of the spacesuits, you would skip this one. They look like cardboard rock'em sock'em robots without the colorful flair. I only watched this one to see which ratings were right because some of the 9/10 star reviews were from people who had been members over a year. Then after watching I went back and realized the reviews were written over a year ago and were the only review they had done. If I had known that I would have skipped it. I apologize to the reviewers that warned me. I should have listened, oh man just laughably bad.",
         "I'm a really big Scifi fan and can endure a lot... this, however was a pain from start to end. The CG is so bad your laughter will get stuck in your throat. The costumes look like they are made in a garage and I feel sorry for the actors that had to wear them. I think they might have abrasions between their thighs still (2016). The lead actor (?) disappears without any explanation, I think she might have died? Half the movie is covered with a silly computer in-helmet interface that would make any interface designer cry blood. So, if your a big Scifi fan like me, go to your bookshelf pick out the worst VHS you can find and I guarantee you will have a better time then this.",
         "I had this flick in my queue for a while saving it for when I was in the mood for something different. Going in with very low expectations I was not disappointed. As a cinematic experience it's not pleasant. There were few things about it that appealed to me visually and much of the time my enjoyment was shattered thinking of all of the ways a given scene could have been made better. And I know nothing about cinematography. I grant many concessions because I know it is not a large budget project. But at the same time I don't think the crew made of the most of what they had to work with. Low budget is not an excuse for gratuitous distractions using CGI that is more annoying than supportive. Just when I start to get into the mood of a given situation I get propelled back to the 80s by 16-bit graphics and cheesy sound. Commercial breaks would have been no more destructive. So as a movie in my mind anyway it's a pretty significant failure. Despite the efforts of a decent cast of actors who could be commended for nothing else than sticking it out with the tortured project to the end. (Although an unplanned exit might explain the sudden disappearance of the lead actress in the final act.) As a concept, however, it has a lot to offer. Although the backstory (and the present for that matter) is clumsily presented it is intriguing, and as far as I know is original. In a nutshell, religion has been outlawed on Earth and religious factions have been driven into space where they eke out survival on the moon in separate societies centered around ice mining operations. At some point hubris prevails among the atheists of earth when they plague the environment with runaway nano-technology. Having destroyed the global water supply they now fight the exiled for access to their ice mines. All the while the religious factions are also busy fighting among themselves (of course). In short it is about the waning days of humanity. That is, until... the discovery. Pretty good stuff. In skilled hands it could likely be made into a series of highly regarded hard scifi novels. So I feel it deserves at least 3 stars for that. Only, the terrible screen version is usually made after a novel has made its mark, not before.",
         "It seems that others comments are just fake haters and fake lovers Because how it can be just 1 stars and just 9-10 stars ? and nothing in between ? So let's speak about this ... what i call an ... essay ? Is the movie interesting ? No, it is even very boring Are the actors bad ? Not so, not good sure, but not as bad as asylum movies, they are at least better. The story , which one ? oh yes they was a story ... somewhere, hum ... no, i do not even recall why they are fighting .. just at the end (2mn before the end) they discover that the moon was displaced by a nuke millions years ago .... seriously ??? and ... that's all !!! 1h30mn for that .... Are the special effects good ? may be, back in the 60's they might be excellent, but nowadays not at all.",
         "The thing most people get wrong about this movie is that they focus on the special effects, and if you watch it as a 3D then it gets weird. Let me say to that: StarWars was pretty sparse in it's 3D for a zillion times the budget. So, purely dollars vs production value this movie still wins. And I'm a sucker for those movies that start with computerized messages and big long quotes Story wise it is an excellent movie: It takes place on the Moon, where religious people, called the Banished have been banned to after a war with the Unlights (maybe some sort atheists), on Earth. They don't use the word God but it is called the Outlaw. But there are various and numerous sects Shingatze Fear Monks, Protisarian (some form of Protestant??), Numero Kabbalists (jewish?), Gnostic Islam (they HAD to make the black girl a Moslim?), Hinbuddists (also very stereotypical religion for the Asian). And the atheist (or un-affiliated) is of course a mercenary. At the beginning of the movie it's said that the Unlights are now fleeing to Moon because the Earth is now too poisoned to live. The tribes already on the Moon are always battling for water, waging great wars actually. A patrol of soldiers is sent on a mission to find water but gets shot down. The heart of the movie is then how the 5 survivors are going on a long trek of 350 kilometres to the Rescue Point. This part of the film is the best and that's because of good acting and a good dialogue. If you cut through the BS of the odd special effects and somewhat unclear helmet displays, what remains is solid drama, carried by A-list or very able actors. This film has very strong right-wing slant, there is a very strong red state conservative Southern states connection. The heroes are all believers, and the villain is the ... atheist. The religious in the move are typically portrayed as rightwingers like to see themselves. Victims of some Evil Godless Big Government but also a scrappy band of rebels, standing up to the Evil Empire of non-believers \"who outlawed God\" and sent the religious \"to the Moon to die\". That's why god is called \"the Outlaw\", ya git it? Their name, Unlights, could be a disparaging of the United Nations: UN-lights, or the light-less from the UN. Rightwingers are always very paranoid about the UN, which in their paranoid world view is just an instrument to bring about the so-called New World Order. I don't like that underlying message of the film, but it didn't really distract all that much from the drama of the movie. And I actually LIKED the suits in all their clunkiness, they were a throwback to early nineties robots in Euro animation. Sure, the special effects clips from inside the helmets were confusing, but do realize that VERY MANY action scenes in Big Hollywood movies are DESIGNED to be confusing, so as to make them more impressive than they really are. And the space ships and out doors special effects were old-ish looking but not as bad as all that. The Melancholic Alcoholic.",
         "Graphics suck, but you have to give credit to the actors who had to visualize everything around them. The story line is different and raises a lot of questions that need to be addressed. I am amazed that the critics were so negative. Maybe they have finally recalibrated their critical thinking to high end graphics and special effects. Ignoring the message within. Se La Vie This is not a great movie by any stretch of the imagination, but way better than some that has gained 4 and 5 stars. So if you have nothing better to do on a Saturday Afternoon, ignore the rating and give it a try. You might be a bit surprised.",
         "Oh, that helmet overlay screen approaches nuisance and I was considering turning the movie off but kept with it. I like small cast movies, I love low budget sci-fi that concentrates on what it means to be human, and this offered both plus reasonable science fiction prediction on space suit functionality and computer interface. The story weaved these all together to a satisfying end. Acting was excellent. Set lighting was realistic as possible. Attention to small details to help build the realism was there. Dialogue defined characters well. All excellence. Problems... the helmet view was annoying and way too often. The satellite antagonist was shown way too often such that the viewer had to wonder what it was doing. All of that \"too often\" disrupted pacing and would have been better spent further developing the interesting characters. Someone in the chain of making this movie should have slapped the editor or director. They made good use of silent moments with characters on screen, but it seemed a good third of the film is wasted space (no pun intended). I say watch it and suffer through the first half for light character development. It builds into a philosophical questioning that made watching the movie worth the time. Gads. This could have been an excellent movie. Watch it with that consideration.",
         "I caught a screening of this film in NYC prior to the Fright Fest debut. It's actually a brilliant reflection of the current state of global affairs with regards to war and religion... driven at the end of the day by resources disguised as fanaticism. The storyline mirrors what is happening right now in places like the Middle East, Russia, Africa -- timely is too passive of a word. It is funny how US audiences are responding more favorably to that message. Especially in NY. (I know we screened a stone's throw from the September 11th attack site -- now the Freedom Tower. Chilling.) This is the type of film that slashes the moral mind -- not a scantly clad actress' left breast. Not the best thrill for a horror film festival crowd. A great film for a crowd tired of the Hollywood Marvel Comics machine! I can't wait to see what Mr. Weisman does when given the Hollywood budget and big guns!",
         "Big spoilers included to explain plot. I felt sorry for the actors suffering in those pitiful bulky spacesuits throughout the entire film. They did their best with a terrible script. Every bad review was correct. Did you notice the 2 good reviews both used the same phrase in the same manner \"thought-provoking?\" Clearly must be related to the actors or production staff or crew. Badly written. Bad Plot. Bad direction. It takes 3/4 of the movie to find out what the plot was & what the characters were fighting about. The intros for the characters they flashed on the screen did not make sense nor were they on the screen long enough to read. So we didn't know who was who until near the end. It wasn't until near the end that the character ID's made sense and by then they were mostly dead. The early ID's flashed on screen included their religions affiliations but never told us they were banished to the moon because it was outlawed on earth until the end. Nor did they explain the movie intro speech telling her daughter to walk into a blade. The entire film had the characters walking to nowhere on the moon & getting picked off. We could scarcely determine who each character was with the bulky suits & face plates. The beginning made no sense and only at the end did we learn the war was about religion banished on Earth which also had poisoned water. Those banished were sent to die on the moon. But the banished were able to mine ice for water & the unlit earthlings wanted it. At the end, the supposed reason they believed they could end the war was when they learned the moon had originally been set into its orbit billions of years earlier by some other race with a nuke which proved life on earth was not created by a deity. Thus, nothing for the religions to fight about. But they left it hanging on that hope. A really dumb ending. I think they should have let the character nuke the city of those earthlings who banished & tried to kill them throughout the film & who had poisoned the earth. Truly a bad script & terrible direction. Who wants to see a mindless trek to nowhere on the moon with a bunch of intermittent screen overlays which make no sense while unidentified armies & satellites try to kill them. You have no clue what it is all about since the plot is not explained until the end & you then read about it on Wikipedia to clarify what you wasted your time watching. As a lifelong star trek fan, I take exception to the reviewer who compared this garbage to Star Trek. It is NOTHING like Star Trek. That was the same reviewer who gave this movie top marks. The reviewer must be a child of one of the actors or director set. I cant imagine any adult making such glowing comments about this movie. I am usually quite forgiving of a movie so when I say it's bad. It IS bad. Do yourself a favor & skip this movie. It is really terrible & boring.",
         "I saw this on Friday at FrightFest. Not every day you see a small budget picture with big effects and payoff. I enjoyed the intellect of the writing, the acting and many of the effects. I really liked how they coloured this film. Felt very immerseive in that sense. I'd say my favourite film from the four I saw at the fest. As a love of the arts in general, I applaud ambitious story telling in all forms, not just cinema. Any piece that can captivate your senses and force you to think, to ponder, to question- is a piece of art that deserves to be acknowledged. The world is filled with brain numbing material that is proved to make our culture and society less endeavored than previous generations. I'm not saying this picture will change the world, but I certainly don't see it making it any worse, if not providing some clarity along the way.",
         "I managed to catch a screening of this movie with my husband and, honestly, I quite enjoyed it. Unlike some science fiction that needs a lot of special effects to fill in for lack of a story with any real substance, I thought Shockwave Darkside had an interesting story-line that was character driven. I found this rather refreshing - a movie that actually required me to do a bit of thinking. It walks a fine line, challenging belief systems without actually beating you over the head with any one particular ideology. I'm very much reminded of early episodes of Star Trek, Doctor Who, and even The Twilight Zone - where the stories used futuristic settings to convey messages about the human condition. I would say, if you are a fan of the genre, it is worth your time.",
         "I have watched this movie three times now and I have come to some realizations about it. 1- Jay and his team spent YEARS trying to get this movie made. They had a VERY limited budget and yet a feature film was still released. I for one have not done that and I tip my hat to anyone who can. 2- The message and the story Jay is trying to tell is a good one. It's thought provoking and one based on character. 3- Do the effects in this movie look like The Avengers or BvS? No, But with the budget they had it works. Watching independent/low budget films is not like going to your multiplex. As a viewer you need to look at the larger picture. I am excited to see what can be done with a Budget."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Favorit Film",
         "Pipeline Entertainment (II)",
         "Red Giant Media"
      ],
      "summaries": [
         "It is the last, great war. Out of the wreckage of a troop transport, five soldiers on the way to battle find themselves stranded on the dark side of the moon. Cut off and behind enemy lines, they start a dangerous journey through snipers and minefields back to their home territory. As their numbers dwindle and nerves fray, they make an amazing discovery about the moon that just might save their lives.",
         "In the near future humanity has settled on the moon to find water in the craters since the earth is contaminated. A fierce fight ensues over limited resources. A spaceship is shot down behind enemy lines and the five surviving soldiers have to get to a rescue point while running out of oxygen."
      ],
      "budget": 0
   },
   "movielensId": 171369,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-08-22",
      "dvdReleaseDate": null,
      "directors": ["Jay Weisman"],
      "runtime": 87,
      "movieId": 171369,
      "title": "Shockwave Darkside",
      "mpaa": null,
      "actors": [
         "Bill Sage",
         "Sonequa Martin-Green",
         "Mei Melancon",
         "Rich Ceraulo",
         "Alexander Cendese",
         "Nedra Gallegos",
         "Conan Marchi"
      ],
      "imdbMovieId": "1972752",
      "originalTitle": "Shockwave Darkside",
      "genres": [
         "Horror",
         "Science Fiction",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The nano-plague that poisoned Earth’s water supply has reached its 60-year critical mass. The Unlight enemy forced the first exodus to the moon where the outlawed banished population was supposed to die. But now the Unlights have launched from Earth and are amassing on the south-west sector of the darkside of the moon for a massive ice-mining operation. It will be the last Great War and lunar troops are sent into battle for the precious resource. However one squad is shot down and the five surviving soldiers find themselves stranded. Cut off and behind enemy lines, they start a dangerous journey through snipers and minefields back to their extraction point with only 36 hours of oxygen left. As their numbers dwindle and nerves fray, they make an amazing discovery about Earth’s satellite that just might save their lives. From THE BANSHEE CHAPTER producers comes a space shocker with gravity.",
      "tmdbMovieId": 279965,
      "avgRating": 1.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": "/rSr7kVWqZfiozNvOErSejkXGyeH.jpg"
   }
}