{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3233904",
      "video": false,
      "title": "My Italian Secret: The Forgotten Heroes",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55159580c3a36803da002404",
               "name": "Oren Jacoby",
               "profile_path": null,
               "id": 139825,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55159587c3a3686195004f05",
               "name": "Oren Jacoby",
               "profile_path": null,
               "id": 139825,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.120004,
      "production_countries": [],
      "id": 329137,
      "vote_count": 3,
      "budget": 0,
      "overview": "MY ITALIAN SECRET tells a heroic story that was all but lost to history, until now. The film recounts how WWII bicycling idol Gino Bartali, physician Giovanni Borromeo and other Italians worked with Jewish leaders and high-ranking officials of the Catholic Church, risking their lives by defying the Nazis to save thousands of Italy’s Jews.",
      "similar": [],
      "original_title": "My Italian Secret: The Forgotten Heroes",
      "runtime": 92,
      "poster_path": "/3NCu93zGCw3N87z05sz5rqsU3Ll.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-10-12",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oren Jacoby"],
      "runtime": 92,
      "synopsis": "Why would someone risk their own skin, and their family, to do the right thing and protect the life of another human being? Dont Talk About It introduces four characters whose personal stories reflect the larger, untold saga of Italians who saved Jews and other refugees fleeing the Nazis in World War II. It also tells the story of Gino Bartali, the charismatic Italian sports idol and Tour de France cycling champion, whose role in this history was never revealed in his lifetime. The films four living characters were children in Italy under Fascism; each survived World War II thanks to Italians, like Bartali, willing to make the ultimate sacrifice to help strangers escape Nazi persecution. The story of Gino Bartali, and the secret underground network he worked with, stands in for the stories of thousands of Italians who risked their own lives to save others from capture and death. As almost the entire continent was engulfed in a genocide, which took the lives of most Jews in Nazi occupied Europe (nearly 6 million people), more than 80% of Italys Jews survived. Most of the rescuers, like Bartali, never sought recognition or reward. Few of those he helped knew his name or what role he played in their rescue. Bartali is a cycling legend, but his most daring triumph came when he risked his life over and over transporting fake identify documents in the frame of his bike for a secret underground working to save Jews threatened by Nazi extermination.",
      "writers": ["Oren Jacoby"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3233904/",
      "coverLink": null,
      "actors": [
         "Robert Loggia",
         "Isabella Rossellini"
      ],
      "reviews": [
         "Gino, thank you so much for your movie. You was in Cinema Village theater when me and my wife saw it. We were too moved to talk about to you. Since then, I think about it every day. I thank to all Italian people who helped Jews, children, families in the face of biggest genocide in history. Yes, Italian people are real heroes! While I always was sympathetic to Italy, love the language, traditions, county I am particular glad to learn that the people and country which I always loved are also great humanists and my heroes. Again, from the bottom of my heart, thank you to all Italians, the country, to you for your movie. You, all people who helped to Jews, generations of their children will be blessed.",
         "I've watched quite a few documentaries and movies about the holocaust. However, this one is unusual because it specifically addresses the Italians and how they dealt with the Jews. Fortunately, although many folks were killed, many more were spared because according to this film, many Italians stepped up and risked their lives to save them. Now this is not to say a tragedy did not occur--but, fortunately, about 80% of the Jews in Italy did survive the war. The beginning of the film talked about a famous Tour de France winner from Italy, Gino Bartali. Then, the film jumps to many other Italians and their stories before returning to Bartali's contributions to the resistance and how he helped fleeing Jews. It's an odd way of framing the story but it worked. What also worked well was seeing folks returning to the country decades later to discuss their stories and meet with folks or their relatives that saved them. Very touching and very well made...and very interesting.",
         "I was looking for Italian films and came across a documentary entitled My Italian Secret. It is about Italian Jews and Italian refugees from other parts of Europe, from the time of Mussolini through German occupation and Allied liberation. They interview elderly people who return to the small Italian villages to thank the families of those who helped save them. I found it fascinating because I didn't know to what extent common Italians risked their lives for strangers of another faith. You always hear jokes about the Italians surrendering, the inference being they were cowards...but it seems that many Italians risked their lives, and many were captured, tortured and killed for hiding Jewish families. So their strength lies in the fact that they give no glory to giving their lives for a political cause they don't believe in, but they took dangerous gambles to help human beings in need. A good lesson for current times. This was a very informative documentary. Sent from my iPad"
      ],
      "genres": [
         "Documentary",
         "History",
         "Sport",
         "War"
      ],
      "productionCompanies": ["Storyville Films"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 171451,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-10-12",
      "dvdReleaseDate": null,
      "directors": ["Oren Jacoby"],
      "runtime": 92,
      "movieId": 171451,
      "title": "My Italian Secret: The Forgotten Heroes",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "3233904",
      "originalTitle": "My Italian Secret: The Forgotten Heroes",
      "genres": [""],
      "youtubeTrailerIds": ["PqOp8RPTTec"],
      "plotSummary": "MY ITALIAN SECRET tells a heroic story that was all but lost to history, until now. The film recounts how WWII bicycling idol Gino Bartali, physician Giovanni Borromeo and other Italians worked with Jewish leaders and high-ranking officials of the Catholic Church, risking their lives by defying the Nazis to save thousands of Italy’s Jews.",
      "tmdbMovieId": 329137,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": "/3NCu93zGCw3N87z05sz5rqsU3Ll.jpg"
   }
}