{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt2368920",
      "video": false,
      "title": "Touch of the Light",
      "recommendations": [
         177822,
         88752,
         81593,
         254679
      ],
      "backdrop_path": "/4oThJ7GjYCmJHTiP88uGoMYzDI7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4beac3a368484e19e775",
               "name": "Sandrine Pinna",
               "profile_path": "/yiM0qPq9uKl0w7t3Ae8y8w8bbRV.jpg",
               "id": 114316,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4beac3a368484e19e779",
               "name": "Huang Yu-Siang",
               "profile_path": null,
               "id": 1100702,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "53d9f54b0e0a2652f00018e0",
               "name": "Harry Chang",
               "profile_path": null,
               "id": 160822,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "53d9f5550e0a2652dc0017b9",
               "name": "Simon Hsueh",
               "profile_path": null,
               "id": 1347978,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "53d9f55c0e0a2652dc0017be",
               "name": "Lian-yu Huang",
               "profile_path": null,
               "id": 1347979,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4beac3a368484e19e771",
            "name": "Chang Jung-Chi",
            "profile_path": null,
            "id": 1100701,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.691489,
      "production_countries": [{
         "iso_3166_1": "TW",
         "name": "Taiwan"
      }],
      "id": 134990,
      "vote_count": 16,
      "budget": 0,
      "overview": "Yu-Siang is blind – but he has a superb sense of hearing. Born in rural Taiwan, this extremely talented musician moves to the capital Taipei to study the piano. But how will he manage on his own? Even the walk across campus from his halls of residence poses a challenge and he must learn how to make the trip step by step. Yu-Siang began winning awards for his piano playing as a young boy but he once overheard somebody saying he only won because of his blindness. Since then he has avoided public competitions – in spite of his teachers' encouragement. Yu-Siang is not interested in recognition: to him his musical development is more important. One day he meets a young woman working in a snack bar. She dreams of becoming a dancer. The encounter proves to be a turning point for both of them.",
      "similar": [],
      "original_title": "逆光飛翔",
      "runtime": 110,
      "poster_path": "/l6DDG9uahgMWpDZY21W10TznoVE.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [],
      "release_date": "2012-09-21",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Taiwan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jung-chi Chang"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Nyssa Li"],
      "originalLanguage": "Min Nan",
      "imdbLink": "http://www.imdb.com/title/tt2368920/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ5MTEwNzEyM15BMl5BanBnXkFtZTgwODIzNTg1MzE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Sandrine Pinna",
         "Yu-Siang Huang",
         "Lieh Lee"
      ],
      "reviews": [
         "2012 Oscar BEST FOREIGN FILM submission from Taiwan, saw it in the local multiplex in Shanghai, a more-than-10-months procrastination from its Taiwan theatrical run, its mainland box-office never really kicked off since it is an an art cinema alternative from a first-time director and without any bankable names in it, still I was intrigued by its warm reviews (also it got 3 Golden Horse Awards nominations last year), so needless to say it is the kind of film I prefer to offer my contribution. Adapted by a true story, a blind pianist prodigy Yu-Siang Huang, who plays himself in the film, and the film stretches out his pristine university life with a college drop-out girl's endeavor to pursue her passion for dancing (played by Yung-Yung Chang, already a three-time Golden Horse Awards BEST ACTRESS nominee at the age of 25, including one she got from this film), the film's greatest merit is the light touch of its tear-jerking scenario, the mother-son affection has managed to deliver a kitchen-sink authenticity without too many embellishments, actress Lieh Li who plays Huang's mother, brilliantly incarnates a subtle flair of humbleness, lovingness and tenderness. It is an encouraging film, exhorts everyone to follow his or her dreams, to strive for it, and it also shuns a hackneyed underdog's victory, neither the quartet performance nor the dance competition has functioned as a means of gaining instant fame or success, more or less it symbolizes Huang's motto - everybody is born equally, although he is blind, it should not be considered as his disadvantage or his perk, his zeal of music is out of his heart, not a tool to grandstand for his own favor, the same can be inducted to Yung-Yung, she may not be pick of the bunch, but when she dances, she radiates with happiness. The uplifting theme is perpetually presented by a hazy cinematography (a nice focus on Huang's eyes with mostly looking-up angle) under the accompany of gentle light and a melodic score, this type of film is categorized as a sub-genre in Taiwan's cinematic scene, in Mandarin we call it \"Xiao Qing Xin\", literally means \"small, fresh and novel\", aiming at youngsters' love and friendship in rural or urban lives. TOUCH OF THE LIGHT is an engrossing storyteller, although all its components are stock-in-trade, the sleight of hand and a competent cast are worth at least some ovations and for me it is always delightful to discover new blood from that insular isle.",
         "This Taiwan treat deals with two protagonists with low self-esteem and limited worlds whose life collide and make the kaleidoscope brighter. Music and dance are their passion and their path to happiness are hampered by handicap, society and family. Being blind and what it entails is explored, but the film falls rarely into cliché. It rings true, it is simple and has two very likable, real and relatable characters. The film, editing, acting, directing (and yes music!) are great but never try to be grandiose. Always humble or the right note to employ the music metaphor, this film finds truth, hope and beauty. Even the friendship romance is just right, not forced, cute and light. See it if you can. At least you can, because blind piano prodigy Huang Yu-Siang who plays himself and compose some of the soundtrack sure wish he had vision. Perhaps he and first feature film director Jung-chi Chang do have vision: artistic vision.",
         "This is a really well-done film revolving around the theme of \"pursue your own dream\" or \"you are your own agent\". In a nutshell it is about a blind pianist fought with his own self- doubt to being recognized as a world-class performer. The standout about this film is the smoothness of the dialogue. I have noticed recent Taiwanese films being plagued by awkward and often cringe- inducing dialogue. But not here, the jokes are genuinely funny and tender moments emotive. The leading actress is gorgeous and this is the first that I have seen her. I really admired this film. Sadly it's likely only to be viewed by a very limited audience."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Block 2 Pictures",
         "Jet Tone Production",
         "Sil-Metropole Organisation"
      ],
      "summaries": [
         "Based on true events related to the life of Taiwanese piano prodigy Huang Yu-Siang (Siang played by himself), this is a story of inspiration, discovery and love. Born to a rural family in Taiwan unprepared for the birth of a blind son, Siang was a curious and precocious child. Touch and sound was everything to him. With the love of his mother and support of his family, he grew up with no barriers - that is until he had to face the real world as he left his family behind in order to attend university where he had to compete on the same playing field as the sighted students and to find his own way. He soon crossed paths with Jie (Sandrine Pinna), a beautiful but frustrated cold drinks vendor who dreams of being a dancer, but whose struggles against the harsh realities of her life render her helpless. However, when she witnesses Siang's fearless determination and understood his optimism and inner peace, she is inspired and determined to hold on to her dream. Touch of the Light - a story of dreams, determination, love, and believing in yourself.",
         "A drama centered on the experiences of a blind piano prodigy."
      ],
      "budget": 0
   },
   "movielensId": 171441,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2012-09-21",
      "dvdReleaseDate": null,
      "directors": ["Chang Jung-Chi"],
      "runtime": 110,
      "movieId": 171441,
      "title": "Touch of the Light",
      "mpaa": null,
      "actors": [
         "Sandrine Pinna",
         "Huang Yu-Siang",
         "Harry Chang",
         "Simon Hsueh",
         "Lian-yu Huang"
      ],
      "imdbMovieId": "2368920",
      "originalTitle": "逆光飛翔",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["eOmn7VWis7Y"],
      "plotSummary": "Yu-Siang is blind – but he has a superb sense of hearing. Born in rural Taiwan, this extremely talented musician moves to the capital Taipei to study the piano. But how will he manage on his own? Even the walk across campus from his halls of residence poses a challenge and he must learn how to make the trip step by step. Yu-Siang began winning awards for his piano playing as a young boy but he once overheard somebody saying he only won because of his blindness. Since then he has avoided public competitions – in spite of his teachers' encouragement. Yu-Siang is not interested in recognition: to him his musical development is more important. One day he meets a young woman working in a snack bar. She dreams of becoming a dancer. The encounter proves to be a turning point for both of them.",
      "tmdbMovieId": 134990,
      "avgRating": 3.75,
      "releaseYear": "2012",
      "numRatings": 2,
      "posterPath": "/l6DDG9uahgMWpDZY21W10TznoVE.jpg"
   }
}