{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "mutation",
         "id": 2766
      }],
      "imdb_id": "tt0140581",
      "video": false,
      "title": "The Suckling",
      "recommendations": [
         117216,
         101054,
         100051,
         23389,
         49222,
         24777,
         26676,
         63087,
         39867,
         34792,
         28450,
         56702,
         109213,
         7234,
         38446,
         86643,
         28156,
         39916,
         89659,
         59744
      ],
      "backdrop_path": "/44RAQbjqaOgYs6WojutUZbzIM4L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "(as Frank Reeves)",
               "gender": 0,
               "credit_id": "52fe48969251416c91091bbb",
               "name": "Frank Rivera",
               "profile_path": null,
               "id": 929435,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "",
               "gender": 1,
               "credit_id": "58682fecc3a3680f5c0032bd",
               "name": "Marie Michaels",
               "profile_path": null,
               "id": 1730666,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "",
               "gender": 0,
               "credit_id": "586830109251414e8a00333c",
               "name": "Gerald Preger",
               "profile_path": null,
               "id": 1730668,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "",
               "gender": 0,
               "credit_id": "586830c09251414e7800356e",
               "name": "Michael Logan",
               "profile_path": null,
               "id": 1730673,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "",
               "gender": 0,
               "credit_id": "586830c99251414e7500352d",
               "name": "Lisa Petruno",
               "profile_path": null,
               "id": 1271531,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "",
               "gender": 0,
               "credit_id": "586830d0c3a3680f540037ec",
               "name": "Janet Sovey",
               "profile_path": null,
               "id": 1730674,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "",
               "gender": 0,
               "credit_id": "586830d99251414e7a003576",
               "name": "Tim Martin Crouse",
               "profile_path": null,
               "id": 1730678,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "",
               "gender": 0,
               "credit_id": "586830e29251414e7a003583",
               "name": "Susan Brodsky",
               "profile_path": null,
               "id": 1351827,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "",
               "gender": 0,
               "credit_id": "586830eac3a3680f580037c8",
               "name": "Natasha Roberts",
               "profile_path": null,
               "id": 1730679,
               "order": 9
            },
            {
               "cast_id": 1015,
               "character": "Doctor #2",
               "gender": 0,
               "credit_id": "58683176c3a3680f4500389e",
               "name": "Allen Lieb",
               "profile_path": null,
               "id": 1545847,
               "order": 10
            },
            {
               "cast_id": 1016,
               "character": "Doctor #1",
               "gender": 0,
               "credit_id": "58683183c3a3680f5c0033e4",
               "name": "Bobby Shapiro",
               "profile_path": null,
               "id": 1730684,
               "order": 11
            },
            {
               "cast_id": 1017,
               "character": "The Suckling",
               "gender": 2,
               "credit_id": "586832449251414e7a003666",
               "name": "Michael Gingold",
               "profile_path": null,
               "id": 99994,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48969251416c91091bb1",
               "name": "Francis Teri",
               "profile_path": null,
               "id": 929433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48969251416c91091bb7",
               "name": "Francis Teri",
               "profile_path": null,
               "id": 929434,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58683108c3a3680f45003852",
               "name": "Joseph Teri",
               "profile_path": null,
               "id": 1730680,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "586831179251414e7500354d",
               "name": "Ralph Cordero",
               "profile_path": null,
               "id": 1730682,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "58683146c3a3680f5c0033ac",
               "name": "Francis Teri",
               "profile_path": null,
               "id": 929434,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.260679,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 83292,
      "vote_count": 12,
      "budget": 0,
      "overview": "A woman goes to a back alley abortion clinic, only to have her aborted fetus attack her, her boyfriend, and everyone else at the clinic.",
      "similar": [
         36586,
         9426,
         19898,
         928,
         4961,
         29343,
         378018,
         9306,
         10496,
         12262,
         2182,
         11071,
         33518,
         10706,
         342927,
         12587,
         841,
         11544,
         17654,
         98566
      ],
      "original_title": "The Suckling",
      "runtime": 89,
      "poster_path": "/4qBK0cdFmYAZJiaduzuQlmaqWIO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1990-01-01",
      "vote_average": 3.2,
      "belongs_to_collection": null,
      "tagline": "He'll always be mommy's little mutant.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Francis Teri"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Francis Teri"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140581/",
      "coverLink": null,
      "actors": [
         "Frank Rivera",
         "Marie Michaels",
         "Gerald Preger"
      ],
      "reviews": [
         "A young girl has an illegal abortion in a house of ill-repute. The foetus is flushed down the toilet and into the sewer where, nurtured by pollution and goodness-knows-what, it survives, harbouring a grudge and glowing greenly. It then sets about popping up out of the toilets and picking off one-by-one all those responsible for its sorry fate. It is aided by the fact that all those involved are the kind of people who - on being told that there is something in the bathroom making a noise like the devil incarnate - proceed to shove their heads down the pan for a really good look. Well, I first saw this on video in the early 90's when it was on release in the UK as \"Sewage Baby\", and it was so awful that I have never forgotten it. There was a kernel of a good idea here, but it was made with such technical ineptitude that even the folks at MST3K would only have been able to watch in gob-smacked silence. The photography is dire. The sound appalling- there are silent gun shots, footsteps that suddenly disappear halfway down a flight of stairs and then suddenly start again. Some of the cast are obviously actors, some are just as obviously not. The special effects are of the \"let's have a Halloween party in the garage\" school, with lots of atmospheric net curtains. After my sides stopped aching with laughter and my jaw returned to its normal position, I was left with many unanswered questions, like; Who ARE these people? How ever did they manage to get the money and film stock to make this movie? And how on earth did they manage to get it released? If anyone knows the answers - please tell me.....",
         "Get the f!ck out of here people...1's and 2's for this film??? I'm well aware that THE SUCKLING is no great feat of exploit cinema - but this is one of the best concepts out there for sleaze and gore fans. It's a shame it wasn't pulled off more competently and with more gore, if it had, this would have been one of my favorite films of all time... THE SUCKLING is about a guy and his girlfriend who go to a whorehouse that doubles as an illegal abortion \"clinic\" (?) to get rid of the unwanted bun-in-the-oven. The chick has reservations about getting rid of it, so boyfriend and the coat-hanger technician unwillingly drug the girl so she doesn't have a choice in the matter (??). After the fetus is yanked, it's flushed down the toilet (???) where it encounters some radioactive material (????) and begins to mutate(?????) (at this point I feel compelled to tell you that this is no joke, this is really the plot of the film - and the fetus-mutation scene is hilariously awesome - think the \"resurrection\" scene from HELLRAISER meets that weird looking baby-thing from COMBAT SHOCK...). The fetus grows into some giant goofy looking monster, puts some sort of membrane around the house so those inside can't get out...and takes it's revenge on the occupants of the whorehouse (including it's \"parents\") for it's mistreatment (????????????)... I couldn't make this sh!t up if I tried...THE SUCKLING has one of the most gloriously sleazy plots I could ever hope to actually witness on screen. But with such a wonderfully insane storyline - this film actually ends up being kind of disappointing. It starts out very strong, and ends very strong - but the middle is pretty dull and uneventful. There are SOOOOOO many things that could have been done with this film (even with a micro-budget) that weren't, and there was too much sitting around and talking by the \"hostages\", where there really should have been more gore and sleaze. Even so, I still dug this one if only for concept alone...but nah, it wasn't just that - there are definitely some \"fun\" things going on in this one. Probably not to everyone's taste as most \"normal\" people would have no interest in watching a radiated aborted fetus kill a bunch of people - but some of us really do - so if this sorta thing's your bag, I suggest giving it the once-over...7.5/10",
         "I actually enjoyed and admired The Suckling in some ways. The plot and the tone of the film are both absurd and disturbing--two properties that I love in artworks. It possesses one of the most important qualities for a film to have--passion from the cast and crew to do something artistically interesting. On the other hand, The Suckling is marred by horrendous performances and a fair amount of technical incompetence. Humorously, the film begins with scrolling text implying that The Suckling is based on a true story. It tells of an unsolved massacre in a \"whorehouse and abortion clinic\", and suggests that the filmmakers, such as director Francis Teri, believe the account of the sole survivor of the massacre--a woman whom the authorities believed to be insane. From there, we cut to a surreal sequence where a woman is accosted in bed and taken to a seedy hospital, complete with a topless nurse walking down the corridor with a bloody axe. Sadly, this turns out to be one of those \"this was all just a dream\" openings. We then change gears to a young couple. We quickly figure out that they are visiting the whorehouse/abortion clinic. The film shows us the \"true story\" of the massacre. The story is set in the early 1970s. The quality of the film (meaning the physical quality of the actual material this was shot on) and various other visual cues all say \"early 70s\". However, the film's publication date was 1990, and there are other visual cues (such as some clothing and hair styles) that set The Suckling firmly in the late 1980s. The crux of the story is that the protagonist is visiting an illegal abortion clinic, which explains why the film would be set in the early 1970s--prior to Roe v. Wade (1973), but this emphasizes two very unusual aspects of this film. One, it's a very low budget independent \"grindhouse\"-styled horror flick that happens to be written and directed as a period film, and two, it very subtly, though inexpertly, captures its period. Those are indications of a concern for a subtler artistry that isn't usually attributed to this film. The abortion stuff could be seen as having a moral/political subtext. Although the graphic scenes are ridiculously humorous in one respect, they're also unsettling. Abortion is shown as a pretty nasty business, but on the other hand, this is an illegal abortion clinic, and Teri could be seen as making the argument that if abortion is made illegal again--even though abortion is disturbing--people are still going to get abortions in places like this. When we consider that subtext, it makes more sense that The Suckling was written and filmed during the Reagan era in the U.S., a time when the \"Moral Majority\" gave it their best shot to turn the country into a fundamentalist Christian theocracy. The overall tone of the film is often close to Frank Henenlotter's early work, such as Basket Case (1982); it has that same heavy 1970s subculture-grime feel. That's one of the assets of the film, as are the creature and other special effects, which are also reminiscent of Henenlotter, who is fond of twisted, darkly comic and ironic \"morality plays\". I'm a huge Henenlotter fan. I don't think his films are \"so bad they're good\", I think they're often legitimate masterpieces. Both Basket Case and Frankenhooker (1990) are among my favorite films of all time. Even though The Suckling does a fair job creating a rough Henenlotter-styled atmosphere, it falls far short of his excellence, primarily because of the performances, the scriptwriting and the awkwardness of many of the technical elements, such as the editing. Not every performance in The Suckling is awful, but too many are. Luckily, some of the worst offenders are in bit roles, such as the short doctor in the bookends. Occasionally, the performances are sublimely bad (\"so bad they're good\") due to a confluence of actor and script. For example, the blonde prostitute has a natural propensity for a combination of cheese and overacted melodrama, but when she utters lines like, \"All these guys want to do these days is shoot their load in your face\", the result is (probably unintentionally) hilarious. The script has our \"heroes\" flabbergasted by a gurgling toilet with a moving but closed lid (\"Try jiggling the handle again\" says the blonde prostitute), it has a bizarre \"comic\" S&M scene, and it has a lot of melodrama caused by conflicting macho attitudes from the house pimps and \"bodyguards\", as well as from the house madam, Big Mama, who is humorously dressed like a clown, complete with Tammy Faye Baker-styled makeup for most of the film. Although Teri is skilled at setting up shots, he runs into problems when it comes to editing them together. The pacing is slightly but frequently off. Worse, there are a couple sections of repeated footage as padding. There is also padding in the plot. It seems like Teri had some good ideas, but had a problem stretching them out to feature length. The middle of the film devolves into a very pedestrian Ten Little Indians knock-off sequence that slows the film to a crawl. The score doesn't help, either. It's hokey at best, annoying at worst. The principal sets/locations are also a bit unimaginative. It's a shame, because a few locations--such as the basement and the sewer--are visually intriguing and work well. Better yet is the bizarre biological stuff surrounding the house. That should have been used more, but it was probably way too expensive to do. The Evil Dead-like stop motion animation should have been dropped instead. Of course, you shouldn't bother with The Suckling unless you have a well-developed taste for this particular kind of low budget, campy but disturbing, taboo-breaking horror. If you like that stuff, there's a good chance you've at least heard about this film. You might not love it, but it's worth a look.",
         "well. you may guess I was being sarcastic. This is probably the worst film I have ever seen. Sewage Baby is ridicule in its purest form, with awful plot, inconsistent characters, poor editing and a puppet that could have come straight from a cereal packet.. in fact I think it did. oh dear, I don't feel I will recommend this film to anyone but those with a very odd sense of humour, or those who really have no idea about film. Vaguely good idea, yet fails to take off in the slightest. I hope you are not one of those actors...",
         "Sometimes, fun and blood go together. THE SUCKLING is under that rule. The plot is, of course, of clase B-films and so the FX and the actors. But the result is really funny: a little creature takes a house and its inhabitants and moves misteriously around it. The final scene is one of the more bizarre shots I have ever seen.",
         "A 2?! Oh c'mon. It deserves at least a 6 for the baby effects alone, which are pretty good for such a low budget film. First of all disregard the box comments that seem to compare it to die hard or alien because its the furthest thing from that. Look at more as an above average Troma film, which is probably who should have released it in the first place. My quest to see the movie began at a flea market in Wallingford , CT where I saw a guy selling the suckling press kit with a badass \"only could have been made in the 90's\" T-shirt. It looked Like an all yellow local metal band shirt. I laughed and had a look and new I had to see the film. The press kit came with a small poster on which someone had written a note in marker on the back. It says\" Mike, See you Friday aug. 23 midnight bleecker theatre if possible. If not there'll be bigger + better movies next. Pete.\" I don't know if the suckling was a CT made film, since the company who made it, JER Pictures has a Port Chester , NY address. Either way its pretty funny, or appropriate depending on your thoughts, that the poster hangs directly above my toilet. I say we need to bring on The Suckling 2: Keep on Suckling.",
         "Francis Teri's \"The Suckling\" is easily one of the worst horror movies ever made.It's sleazy,disgusting and incredibly stupid,so fans of trash cinema won't be disappointed.This time the monster in this movie is created when a teenage couple go to the whorehouse for an abortion.The fetus is flushed whole down the toilet and lands in the sewer,right beneath the leak from a barrel of toxic waste.The small embryo becomes a hideous monster,who promptly starts killing people... This hilariously awful horror film has to be seen to be believed.The acting is horrid,the special effects are downright horrible and the sound is weak.Still there is plenty of gore and nudity and the climax is pretty creepy and rather sick.So if you're a fan of trashy low-budget monster movies give this one a look.5 out of 10.",
         "The Suckling is one of my favourite trashy films for many reasons. For a trashy movie it more than delivers the goods. Scenes such as the topless axe-wielding nurse, the aborted foetus sliding into the sewers and then mutating into a monster - these images will be burnt into my brain forever! Never will you see such images again in a film. The dialogue and acting is terrible but hilarious too. A few quotes: \"You wouldn't know bullshit if you were standing under a bull!\", \"A man comes in to get his penis sucked, and gets shot off instead\". The most hilarious scene is when the monster shrinks back down to foetus size - making a \"ga-ga\" sound - and crawls back into his mothers womb. Priceless! The Suckling is pure trashy entertainment at its best and I would recommend it to all horror b-movie fans. Ignore what everyone else has said - it's not THAT bad. Also - people continually knock the musical score, what's with that?! The opening piano music sounds so dark and haunting and fits a horror theme perfectly. I would even say that it belongs in a better film than this (by that I mean a serious horror film) because it's perfect!",
         "This sublimely sleazy and wonderfully warped jaw-dropper rates highly as the greatest cheeseball low-budget indie fright flick ever made about a grotesquely misshapen murderous mutant fetus. In fact, I'm pretty sure this deliciously dreadful and disgusting doozy might very well be the only horror movie thus far ever made about a grotesquely misshapen murderous mutant fetus. The extremely tasteless plot centers on a young couple who go to a scuzzy bordello on the outskirts of town so they can get an illegal abortion (the film takes place in the early 70's prior to the famous Roe Vs. Wade verdict). The aborted fetus gets rudely disposed of by being flushed down the toilet (yes, you read that correctly). The poor little bugger winds up in the filthy sewer and mutates into a huge, lethal, clawed, fanged, goofy-looking humanoid beast after being exposed to toxic waste. The foul ferocious subhuman fiend proceeds to go back to the squalid brothel and terrorize the occupants inside, which include the fat Southern madame, various skeevy prostitutes and their scummy customers, and even its own scared parents. Man, does this gloriously ghastly marvel possess all the so-thoroughly-wrong-they're-paradoxically-right schlocky stuff to qualify as a real four-star stinkeroonie. For starters, there's the hilariously horrendous acting from a rank amateur no-name cast. The ratty'n'ragged cinematography and annoyingly redundant droning synthesizer score are likewise suitably sub-par. The wonderfully wretched dialogue is absolutely priceless. The fact that the uproariously inane story is treated with utmost seriousness by the filmmakers only makes matters that much more enjoyably absurd and abominable (the filmmakers have the gall to claim said story is based on an actual real-life event!). The murderous mutant monster itself rates as one of the single most laughably ludicrous man-in-a-rubber-suit creatures to ever scamper its way across the screen (the creature strangles and decapitates its victims with its lethal prehensile umbilical cord!). Moreover, this fabulously fetid flick delivers a handy helping of grotty gore and a nice smattering of gratuitous nudity. The Elite Entertainment DVD for this terrifically tacky, trashy and twisted cinematic treasure offers a grainy, but acceptable widescreen (!) presentation with the trailer as the sole extra.",
         "people often forget what the point of a \"monster movie\" is .... um ...its a monster that kills !!!! and to expect more would be to disappoint ... and \"trash\" films ? ...this isn't anything like the trash films I've seen.. maybe im an idiot and don't know what the real definition of \"trash\" films are ..but to me this is a good old fashioned MONSTER MOVIE!! ILLEGALLY ABORTED FETUS FLUSHED DOWN TOILET TURNS INTO EVIL MONSTER BY TOXIC WASTE (i know your thinking \"boy I've heard that story line about a million times, in every tom cruise ever made film\") THEN TRAPS AND KILLS AN ENTIRE HOUSE OF HOOKERS AND THERE \"CUSTOMERS\" AND THEN RETURNS TO THE UTERUS IT CAME FROM !!!! .. \"yeah OK story line sounds great ... but eric, great master of all things cheesy and b goodness, what about the effects?\" well I've see people bash them ...? the baby in the sewer was great ..good job ..sure its a puppet ....but its a good looking puppet ...got a good creepy feel to it you know at times ... the grown up creature is awesome !!! sure its a guy in a suit ...but thats a cool @$$ suit ....lol....if you like MONSTER MOVIES then rent this and you'll be glad ... (4), vocalist GOD IN A MACHINE",
         "This movie is phenomenally well-done. I was skeptical at first, but my friend Bernard convinced me to watch this film. Not only is the dialogue beyond anything I've ever seen, the scenery is gorgeous. This movie was enjoyable from beginning to end. The twists and turns and complications in the plot made it all the more worthwhile. The depth that went into making this masterpiece is unheard of(and I mean that in the best way possible, of course!) I loved the character development, especially of the mother and the fetus. I heard this movie was low budget, but you would NEVER know it. Whoever was in charge of the budget did a first class job, grade A, really. My only complaint was that it was too short! LOVED IT!",
         "Today my good friend Lyle Shelton tweeted that \"The generation that killed its children by abortion will be killed by them through euthanasia\". At first I thought he was just an idiot, but then I realised that he had seen this documentary. He's still an idiot, but this is one of the best documentaries I have ever seen.",
         "A filthy whorehouse with a backroom abortion clinic which was built directly upon a toxic waste dump is the charming setting for THE SUCKLING, one of the trashiest monster movies I have had the pleasure of viewing in ages. When a girl's crudely aborted baby is properly disposed of by flushing it down the toilet, it becomes exposed to toxic chemicals in the sewage system. The fetus then morphs into a rapidly-growing beast with enormous fangs, which returns to the brothel/clinic crazed with vengeance. Sealing everyone inside with a thick, webby goop, the monster-fetus proceeds to savagely massacre the resident hookers and their Johns. The beast's mother is among those trapped inside, and there's no telling what may result when they are finally reunited. There's a big ol' barrel of belly laughs to be had here...this tasteless little grade-Z wonder features some of the stodgiest special effects and acting ever captured on film. Check it out. 5/10",
         "Sewage Baby is a sick little puppy of a film. Repulsive and ridiculous in equal measure. -Possible Spoilers- A boy forces his girlfriend to have an abortion in a back alley house that makes the Texas Chainsaw house look positively inviting. The aborted foetus get flushed, and after a bath in toxic waste it returns as a shape shifting mutant, hell bent on revenge. Yep, I know, and I willingly watched this film. Boy did I get what I deserved. Gobsmacked is not the word. We are treated at first to lots of POV shots of the thing scuttling about (if you've ever seen the Polymorph episode of Red Dwarf, you'll know what territory I'm talking about). Before a couple of cheapo killings. It really hots up when the survivors trek in to the creatures cocoon (or what ever the hell it is), I assume it's supposed to look like a kind of giant womb, what it looks like is the result of two kids let loose in a net curtain shop, really you have to see how poor these effect are. Much 'show as little of the monster as we can to save on budget' shenanigans ensue, before we're treated to one of the most ludicrous ending I've ever seen (girls may wince, though more likely laugh). Truly folks, I'm as partial to a cheesy bit of horror as the next fella, but the words 'scraping' and 'barrel' have never been used more fittingly.",
         "Every once in a while, a movie comes along that forces you to redefine what movies are all about. Sometimes it just looks better than everything else on the market. Sometimes it's just acted better that a lot of other movies in its genre. And sometimes it's just so different that it defies comparison to anything else. There are plenty of movies that live up to the hype and prove themselves, in retrospective articles for years to come, to be the pinnacle of film. Unfortunately, this is not it at all. The Suckling starts off with one of the worst openings ever that has been used too many times before: The prologue for the movie reveals how many people survive! What is the point of that? I mean, in a film like Texas Chainsaw Massacre, it's still irritating but its placement was so that the movie retained a documentary feel. Here, it is completely pointless and ruins any surprise you may have if you pay attention. Regardless of that, the movie begins and seems interesting enough. Sure, the acting is terrible and the filming isn't the greatest, but the story has to do with a woman being tricked by her boyfriend and some sweet drugs into getting an abortion. That's cool! The aborted fetus itself doesn't look too bad, and we get some shots of it growing eyes and nails. Soon, it begins killing people, and that's magnificent. Unfortunately, too much of the film is bogged down by boring moments. As I've said in other reviews, most of the fun of watching a B-Movie like this is to talk about the scenes to your friends later. But there isn't much to talk about here. It's like my complaint with Bubba Ho-Tep: there was so much they could have done with this concept but they totally wasted it. If I were to do this movie, I would have had some Abortion Police come in, armed with coathangers! Instead, this is basically just like every other slasher or monster film we've seen before, except with characters you don't care about (a businessman who says \"whore\" a lot, a CRAZY guy who is SO CRAZY that there is no gun shot sound effect when he fires his gun, a horrible boyfriend to the main character, a bunch of prostitutes, etc). Just not really that enjoyable and surprisingly mean-spirited. And what's up with the ending with the skeleton, the guy, and the boy?!",
         "Hello. Absolutely appalling. There are films that are so bad that may be a little funny to show your friends for a bit of a laugh. This isn't even that. I was in the video shop one evening, looking for a powerful, disturbing film. i came across a film i had never heard of , sewage baby. i read the back and it sounded like a serious film. i thought the film would be about the baby staying alive and growing up to get revenge. I didn't think the baby would turn into a horrendous monster and going on a killing spree. Don't even bother watching this, totally crap. Thank you very much, Afollabi El-Sheikh Al Noor Mohammed",
         "Now if you have the gall to sit through this poorly made pile of puke all the way to the end, besides very woozy you will see a message telling you that the story was based on a true story. Now I might have bought that was based on a true story except when it comes to the climax of the film when the monster shrinks back down into a baby and jumps back into his mother's womb. Either someone is lying or there was no mutant baby. Because they said they put her in an asylum for her crimes, which means they had no proof of a mutant baby. Even if the baby was able to be born, there would be proof, he would be crawling with radiation. Here's a hint to the makers, radiation can be tracked and measured with a little device called a Geiger counter. The monster was pretty good, but that lie about this being a true story and poor effects make this a poor movie. THE NOOSE!",
         "Check out the outrageously tasteless premise for The Suckling (AKA Sewage Baby): an aborted fetus, removed by coat hanger in a back street clinic, is flushed down a toilet and winds up in the sewer where toxic sludge mutates it into a huge monster that attacks the occupants of a brothel. What sounds like a hugely enjoyable trash classic in the making is seriously hampered by terrible performances, a frequently dull script that spends too much time on the characters chatting about escape when it should be delivering scares and piling on the gore, and an incredibly goofy creature that looks like something H.R. Geiger designed for a laugh. In short, it all feels like a wasted opportunity. Made on a tight budget, the film is clearly a labour of love by writer/director Francis Teri, making me feel a bit bad for ragging on it, so here's a few positives to ease my conscience a little: the electronic score is rather effective, there are some fun attempts at stop-motion animation, and Teri achieves one or two genuinely inspired moments of absurdity (the shonky puppet creature returning to the womb being a hilarious highlight).",
         "THE SUCKLING is an indie horror flick from 1990 which offers a nice little experience for fans of so-bad-it's-good cinema. The tale was brought out on UK VHS under the title SEWAGE BABY. The bad-taste story sees an aborted foetus flushed down the toilet, where exposed to raw sewage it grows into a mutant before returning to attack the clinic from which it came. Yes, this film suffers from the usual constraints of low budget cinema. The acting is lamentable and the script is poor, given over to actors giving larger-than-life performances which fail to convince. However, it's also a fast-paced story with lots of death and destruction and melodrama, and it features some surprisingly decent (and icky) prosthetic and model effects which I thought were highly effective. The titular creation is much more interesting than the usual CGI mess we see in films these days, and it's clear that a lot of effort has gone into achieving just the right look. Add in plenty of gore and you have a short, snappy horror flick that might be cheap and clichéd, but which delivers the goods regardless.",
         "A sick, messed-up piece of cinema. I could barely hand on till the end, which is revealed at the beginning of the movie. Too many horrible effects and too little acting. Don't watch it. It's not even in the \"so bad it's funny\" category.",
         "Oh come on! \"Sewage Baby\" can't be the worst movie ever made. But surely it's one of the crappiest, unintentionally funny exploitation/slasher flicks from the past 20 years. The premise can be offensive but after half an hour it gets really cheesy and easy to enjoy. We know that the parents' solution for their \"mistake\" is solved in a truly horrible place where there are whores and also abortion practices. So our classy couple gets rid of their unborn child but little to they know that \"him\" will turn into a super cheesy monster. The now monster fetus returns where he was aborted and starts a killing spree as part of his revenge. My guess is that the producers of this movie knew only the basics of film making : they got low budget, an \"original\" but cheesy idea, and a resolution. The result is almost amateurish film making but with a heart. The movie is entertaining for the bad reasons. There are some things to make fun of. For example, the fetus morph into a mutant is beyond cheesy. The puppet or whatever looks really horrible. The other problem with the movie is the horrid acting. The direction is just bad but not terrible. This isn't by any means a must see. I won't even recommend it for b-movie fans or horror fans in general. This is one of those movies that you should only see if it's the last, last option in the forgotten VHS section in a local video store.",
         "Like others have stated, in England this went by the far better title of Sewage Baby. That was a better name because it had that certain special ring to it that any lover of eighties creature features would have found simply irresistible, whereas The Suckling, was just kinda dull. A movie about a poor unfairly aborted baby that gets callously flushed and then returns as a hideous slavering mutant slaughtering its way through hookers and lowlifes hellbent on returning to its mother-what the hell could be wrong with that? A lot!!! After a moderately moody opening and what I found to be an impressively gruesome sequence where the Sewage Baby is \"born\" everything goes downhill fast in a major way. It doesn't work. Nothing does. If you'll forgive my crudeness, watching this is like watching s**t slide down a wall for eighty minutes... It's so boring! Between the ridiculously gaping-jawed monster bursting out of walls and lashing out of toilets, there's a whole lot of nothing going on with only non-likable ugly bickering jerks to look at. I believe that it's the considerable bore factor that kills this movie. You can forgive monstrous acting effects and possibly plot, but to be boring is the very worst thing a film can ever be. Nowadays it's not really known of at all, and that's not a tragedy, trust me-it's a mercy! :::2::: The toilet of doom... I once found a scene in this film so scary, that it actually rendered me afraid to go to the bathroom-yep, I thought the Sewage Baby was gonna leap out of the bog and get me! It was the scene where the black chick gets her head ripped off. When I look at it now it's dumb. You don't see anything, just kind of a tentacle whipping out and you don't even see the head come off, it's just suddenly stuck in there, while the other lady hilariously blurts out her line:\"Bertha!\" I was only seven at the time by the way, you understand...: The thing being flushed and mutating via handy toxic waste angle is reminiscent of the opening of the 1980 classic Alligator. That was the only part I liked in this whole dang thing. I liked the humorous cliché of a coat hanger being used as an abortion instrument. The outrageous climactic scene where the monster \"returns to mummy\" is especially laughable. As it stomps up to her and somehow shrinks back into a regular sized baby thing that looks as if it's made out of silly putty, you can actually see the strings! And the final scene of the movie after that is still poor, but also surprisingly grim, with the girl in a rotten loony-bin, being abused by wardens. At least she'll always have her little \"Suckling\" to protect her! :::3::: It would've turned out awesome if Frank Henenlotter had been at the helm. In his more than capable hands, I'm sure this would have been a \"cult classic\". I don't like that term, I don't like the word cult-is everyone that loves certain horror movies from various decades-mostly eighties- supposed to wear sinister cloaks and chant and watch them by candlelight or what? Why don't they just call them what they are, POPULAR! But no, because it's horror it's gotta have some stigmatising word attached to it just to smooth everything over for the people who to this day, just don't get it. F*****g stupid label word. I hope nobody ever lumps this effort with Frank's movies. Because although they might be considered of this type of grungy schlocky monster flicks, his films have a grim quality and fruity flair to them, and fairly well-acted colourful characters that compensate well for any perceived poor qualities. Also, not one of his movies could ever be called boring, whereas this film is just a plain and empty joyless waste. Only watch if you wish to see something truly trashy and brainless that may give you one or two cheap laughs purely because it is so bad. It's the celebrated cult horror that never was. As it stank. Just a terrible movie-abort it!",
         "Ohhhhh words can describe how i felt when i finally finished watching the movie. It was so bad when i was watching it the environment of the whorehouse made me want to puke. It was an awful try even for a b- movie. There are b-movies underrated as hell like Carnosaur (1993), The Cellar (1989) which is my favorite b-movie people hated those but i loved them much better than this sh*t. And i watched this movie in a boring winter afternoon and it ruined the whole afternoon. Then i fixed it by watching the much better Thinner (1996). Even for a b-movie fan this movie can't be watched i don't know how i managed to watch that crap."
      ],
      "genres": ["Horror"],
      "productionCompanies": [],
      "summaries": ["A woman goes to a back alley abortion clinic, only to have her aborted fetus attack her, her boyfriend, and everyone else at the clinic."],
      "budget": 0
   },
   "movielensId": 171525,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-01-01",
      "dvdReleaseDate": null,
      "directors": ["Francis Teri"],
      "runtime": 89,
      "movieId": 171525,
      "title": "The Suckling",
      "mpaa": "",
      "actors": [
         "Frank Rivera",
         "Marie Michaels",
         "Gerald Preger",
         "Michael Logan",
         "Lisa Petruno",
         "Janet Sovey",
         "Tim Martin Crouse",
         "Susan Brodsky",
         "Natasha Roberts",
         "Allen Lieb",
         "Bobby Shapiro",
         "Michael Gingold"
      ],
      "imdbMovieId": "0140581",
      "originalTitle": "The Suckling",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman goes to a back alley abortion clinic, only to have her aborted fetus attack her, her boyfriend, and everyone else at the clinic.",
      "tmdbMovieId": 83292,
      "avgRating": 1.75,
      "releaseYear": "1990",
      "numRatings": 2,
      "posterPath": "/4qBK0cdFmYAZJiaduzuQlmaqWIO.jpg"
   }
}