{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "comedian",
            "id": 3485
         },
         {
            "name": "stand-up comedy",
            "id": 9716
         },
         {
            "name": "comedy",
            "id": 10267
         }
      ],
      "imdb_id": "tt0330829",
      "video": false,
      "title": "Robin Williams: Live on Broadway",
      "recommendations": [
         26621,
         75874,
         57941,
         84198,
         74322,
         54108,
         286500,
         216553,
         20147,
         108176,
         37407,
         238408,
         21576,
         21843,
         230170,
         59843,
         103048,
         15372,
         18199,
         18597
      ],
      "backdrop_path": "/m19IjsAhVzO5UBemiNHt8nlk3cT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 2,
            "credit_id": "52fe43ddc3a368484e0028ef",
            "name": "Robin Williams",
            "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
            "id": 2157,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e0028f5",
               "name": "Marty Callner",
               "profile_path": null,
               "id": 80172,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e0028fb",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.637522,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20211,
      "vote_count": 19,
      "budget": 0,
      "overview": "2002 HBO Stand-up Special starring Robin Williams. Recorded and broadcast live from New Your City's Broadway Theater at the culmination of his historic 2002 sold-out tour, this special finds the Oscar-winning actor/writer/comedian returning after 16 years to his stand-up roots to deliver what the Washington Post calls \"...in its madcap way, a seminal cultural event.\"",
      "similar": [
         416477,
         435126,
         35595,
         16290,
         62206,
         49013,
         703,
         812,
         270946,
         23483,
         51828,
         67308,
         289,
         947,
         14564,
         4543,
         200133,
         21575,
         32930,
         228165
      ],
      "original_title": "Robin Williams: Live on Broadway",
      "runtime": 99,
      "poster_path": "/BHXaRTS2rLY0UaF0V377X6Fx0f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
         "name": "HBO",
         "id": 3268,
         "origin_country": "US"
      }],
      "release_date": "2002-07-14",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "Real Time. Real Risk. Real Raw.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marty Callner"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Robin Williams"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0330829/",
      "coverLink": null,
      "actors": ["Robin Williams"],
      "reviews": [
         "The hardest thing in the acting business is to make someone laugh. And laugh hard! Robin Williams succeeds with what seems like ease, he just fires one joke after another and around 20% are so amazingly funny you wonder if you ever saw a funnier stand-up performance in your life. He made me realize one other thing - comedians are the philosophers of modern time, they are hardcore critics of current state of politics, drugs, sports, environment, just name it, they have witty and to the spot anecdotes for every subject. Without them we would be so much emptier, they realize stuff that's true just no one else sees it. A brilliant and amazingly funny, (repeat this about 5 times to get the idea just how much), an unmissable performance. 9/10",
         "While I like seeing Robin Williams explore his darker side in \"Death to Smoochie\" and \"Insomnia\", it is still nice to see him do what he does best: be funny as all hell. The special is essentially one sentence. I saw this because he never really finishes a thought. He starts on something, goes on about whatever topic and then once he reaches another topic, he launches into that one, leaving the previous topic behind never to return to it. It is always nice to see a comedian at the top of his game and this is certainly that. 10/10",
         "Robin Williams used to be a very unique talent (as far as comedy goes) - and his standup was great. But it seems the awkward shift from comedy films to dramas like \"Dead Poet's Society,\" \"Awakenings\" and \"Good Will Hunting\" - no matter how good they may have been - severely altered the public perception and he became something else. Twenty years after his last performance on Broadway, Robin returns once again for his best standup routine - ever. As disappointing as his recent cinematic comedic endeavours may be, this proves he's still got it - at least as far as standup goes. He spits out the jokes faster than you could imagine. He careens from one to the next and before you have the time to stop and laugh at one, he's launching into another. Each time you think you've found a new favorite joke in the program, he tops it. One reviewer on an external site said it's some type of \"fake controversy\" - an old, expired comic pretending to be daring when he's really just under the cover of HBO. Whatever - all I know is that this is hilarious, and really raunchy. The last joke - an extended bit revolving around the topic of a sexual act - is absolutely hysterical and the entire audience can hardly control themselves. If you like Robin Williams, you'll love this. If you don't like Robin Williams - the actor we've come to known through cinema - you'll definitely love this, because it shows a very different side to a man many people consider to be spoiled milk in the comedy-film biz.",
         "The legendary comedian-actor knows how to deliver stand-up comedy in such a way that just leaves you laughing non-stop. Williams is the type of comic who can easily tickle the audience's funny bone to the point where you the viewer can't stop laughing. It's impossible to say the least. Where ever Robin Williams has appeared in movies or talk shows like Letterman, Leno, Carson, Inside the Actor's Studio, and in this case - on Broadway. And here, Williams shows why he's one of the best in the generation and the large variety of topics - ranging from world and national politics, the church scandal, the Winter Olympics, and being 50 is certainly beyond belief. Just watching Robin taking some hilarious shots at some key members of the Bush cabinet and of course, Bush himself are among the best ones delivered. The joke about Ted Kennedy being \"Jabba the Hut\" was a nasty one, too. The show is a non-stop comic romp even though some jokes might offend some people and is definitely one not to let the \"ankle-bitters\" watch.",
         "20 years ago, Robin Williams had his best live stand-up on Broadway. 20 years later, Robin returns (live) to give an even better performance and equally funny. 52 years old and not slowing down for a second, Robin Williams is non-stop for almost 2 hours as he tackles terrorism, sex, drugs, family, golf, drinking, cats, the gay mafia, and everything else you can think of. Less poetic as his first stand up show 20 years before, but Live on Broadway (2002) is one of the best stand up shows of the year, by far!",
         "Already being a huge, lifelong fan I was very eager to view this show/movie. I could not stop laughing the entire time. It was non-stop comedy. Robin Williams is a total comic genius. His jokes ranged from pop-culture, drugs, politics, sex, crazy foreigners, and all those water bottles with minds of their owns. I was never bored waiting for the next joke; it was like one big joke with boundless and endless humor. Not only does it appeal to many audiences and is painfully clever, but he is so physically connected to his spread that he is not only telling his jokes...he IS his jokes. Well done Mr. Williams, well done!",
         "I saw Robin Williams in concert when he came to Portland in April, 2002. By the end of the concert, I was hoarse from laughing; you just can't imagine how hilarious he is unless you hear his monologue. \"Robin Williams: Live on Broadway\" contains most of the same jokes that he made in Portland, but it's still just as funny. I think that my favorite part was his solution to the 2002 Winter Olympics scandal. But also his comments about nuclear bombs, drunken Scottish men inventing golf, and other such things. You gotta see it just to understand how funny it is. You just might die laughing. This proves that Robin Williams does best when he's doing his own stuff.",
         "Wow! Just when you thought he was past his prime, Robin Wiliams is back with one of the funniest stand-up shows in years. Surprisingly though, the funniest moments come when Robin swears. And by god does he ever swear (check the quotes section to see what I mean). As for content, he does everything from improv funniness to jokes about Steve Irwin, Tiger Woods, sex with gorillas, politics and breast implants. This is the funniest thing I have ever seen. Definitely check this out.",
         "Robin is great. Always has been and probably always will be. I have watched everything that I can get my hands on with him in it. This is got to be the best comedy routine I have seen in ages. Not many comedians can keep an audience interested for an hour and a half and also keep them laughing till the very end. If this film gets many more votes it may end up in the top 250 here on imdb. So watch and vote. You will not regret it.",
         "Do yourself a favor - rent or borrow before even considering buying. While amusing, this is nowhere near the quality of Robin's earlier material and, as others have mentioned, the profanity gets a bit old after a while.",
         "Live shows or comedy/stand up material can be too topical, too local and/or not timeless enough. There are jokes here, that over 10 years after the show was made might not work with some (especially if they don't know the area and or some ex-celebrities mentioned). But overall Robin does a great job keeping it just funny. That is if you're not easily offended and can follow his crazy pace and trail. It gets sexual and it does, Robin also ad-libs at times, when he almost loses his train of thought for example. He's good like that. And that's why it's obvious why some people are missing him. Any decent comedian would have a field day with someone like Donald Trump (though let's keep politics out of this). This is evident if you hear him bash George W. Bush in some of his jokes. On the DVD there's one outstanding extra, the interview with the director of the show. Something you wouldn't think of while watching this, but this was hard to actually \"direct\" - if you could actually direct Robin W. on a live show, which seems impossible. But still a great job (not only the camera placement, but also how he handled one specific audience section to get the most out of it and make this TV special ... really special).",
         "I feel bad that my main point of criticism about Robin Williams: Live on Broadway is that its pacing is too often breakneck and incredibly fast-paced, mainly because not a week ago I criticized Bill Cosby: Himself, arguably Cosby's most famous comedy special, for being too slowly-paced and long-winded. Watching Robin Williams' special just two days after was like flooring a car after you had been on the scenic route for about an hour; it's abrupt and causes for an incredible shock to the body and mind. That's not to say Williams' flow is flawed; on the contrary, I view it as a gift, to continue for an hour and forty-minutes, zealously spitting out subjects, some interconnected, some pretty out-of-the- blue, and picking them for their humor. I just wish that Williams would've slowed down a bit so that a point could be made more often, or an idea could be communicated delicately. However, Williams is on go mode, and has no interest in slowing down for us. \"Keep Up or Get Lost,\" would've been a solid subtitle for this comedy special other than the painfully direct one HBO tacked on to it. Williams talks about everything in a rapid-fire, free-form performance akin to the kind he gives in his films, but with no set screenplay to stick to. He discusses the usual topics - politics, women, current events, pop culture, and so forth - but what is consistently interesting about Williams in his stand up special is the way he is vulgar and unfiltered. Whenever Williams obtained an R-rated film role, it was a role where he had to be in a state of gridlocked seriousness. There was nothing wrong with that; Williams is one of the few actors I can't say whether or not I liked him more in a comedic performance or a serious one. However, scarcely did Williams do a comedic film role that was R-rated, which allowed for his completely unrestricted, vulgar presence to be shown. Robin Williams: Live on Broadway is his quintessential stand up comedy special because we see what Williams is about from the moment he begins. He has about ten or twelve water bottles by his side, using maybe three of them during the entire performance. Hydration is a key component of his shows, being that he is constantly running around and talking a mile a minute. Any less than that number of water bottles would permit extreme exhaustion or unconsciousness on Williams' behalf. Director Marty Callner, the man behind the camera for many comedy specials, directs with a certain liveliness as well. Yet it's not like he has much of a choice in this department; Callner must keep up with the craziness unfolding before his eyes and Williams barely stops long enough to take a breath let alone take a solid, still-picture. The stand up special is a must for fans of Williams' work, and shows an artist as a commanding force over his audiences not only in material, but in zealous, incomparable delivery. Directed by: Marty Callner.",
         "Review: Due to the sad passing of this comedic genius, I deceived to watch some of his old material, including his live performances. This particular performance, which was filmed in New York in 2001, is really funny and it shows the fast talking, amazingly witty, Williams at his best. I didn't get some of his American political jokes and he does make fun out of some touchy subjects, but it's all in jest and it really does work. The different elements that his stand-up covers is amazing but you might miss some jokes because he talks so fast. Anyway, this movie is definitely worth a watch, even if your not a fan of his work, because it's funny and extremely entertaining. A Great Watch! Round-Up: After watching the bonus material on the DVD, it's obvious that Robin Williams finds it hard to have a normal conversation without bursting into comedy. I have seen him to some straight roles like the great Insomnia and The Butler, but he really does shine when you let him loose. It's not as good as Delirious, which is an all time classic, but it's still a great watch. He will be greatly missed! I recommend this movie to people who are into there stand-up comedies which covers everything from politics to sex. 7/10",
         "With the passing of Bill Hicks (RIP) we have been left with Robin Williams, who was so funny to begin with in the first place. This show is amazing, I don't think I have ever laughed so hard for 2 hours in my whole entire life. If you are a conservative christian or evangelical, this may not be for you, but it's so good, maybe you should loosen up to enjoy this. For the DVD version, extras aren't spectacular, except for the part that shows him before he goes onstage. Even when he's not in front of a live audience, he is still funnier than ever! If you are a fan of comedy, this is by far a MUST-SEE! See it now!",
         "I want my time back. I'll even pay for it, which gladly I didnt do for this garbage, thank God. Robin Williams in the old days - funny. Robin Williams on TV guest appearances - funny. Robin Williams in interviews or talk show appearances - funny. Robin Williams resorting to the tactics of washed up, dried out losers ala Andrew Dice Clay to buy laughs - not funny. Pardon me that supplanting half of every sentence, with the word \"F**k\" to squeeze out laughs from the audience, or even worse, using it as the punchline to every other joke is just plain tired. *yawn* It's not as though he isnt talented enough not to do it, either; just laziness, I guess. Then the making fun of *ahem* \"retarded people\"?? Yikes! Wha? Et tu, Robin? What's next?, the arrow through the head like Steve Martin of old?, or perhaps Knock-Knock jokes? Puh-lease.",
         "After watching this I'm sick of hearing the 'F' word so many f**king times. Oh great he's making me use it now... He must of said it like 50 times literally. I admire his effort for trying really hard especially to remember his jokes and saying them without pausing too much (even though he jumps around stories a lot) to a big crowd for over an hour. But 90% of his jokes were not that funny. The crowd sounded like they were forcing their laugh. Only when they're really cheering loudly is when it's actually funny. Like out of the hour and 38 minutes of the total show, only 10 minutes or less was some what funny. He likes to talk about balls a lot and other human organ/sexually related stuff which is I guess the idea of it having a 50 year old talking about this is already funny? Uhh, He also talked trash on a lot of people (which most comedians do) like the French, celebrities, religions, and so on. I still like Robbin Williams for his movies like Mrs. Doubtfire, Good Will Hunting, One Hour Photo but this performance didn't impress me. I didn't think the jokes were worth the time but it was surprising to see yet another kind of side Robbin Williams has. If you don't know Robbin Williams (where have you been?) too well then you will definitely be saying after you watch this, \"Is this the same guy in 'Dead Poets Society'?\". People look back at his career and remember all those funny moments he has done so even at the end they will still see Robbin Williams as one of the best in comedy. But I'm sure immature teens will laugh their ass off on this as they are easily amused by swearing and sexual content. To me this was just some lunatic 50 year old swearing and jerking off on stage and not the Robbin Williams I've known to see. It's not bad but it's not that great either. Overall Rating: 4/10",
         "It was disappointing to hear the F*** word every fifty or sixty seconds, or more. What's Robin's problem? Does he think that he needs to cuss, cuss, cuss to be funny? It would have been a lot more funny if he didn't say that word or a variation of it all the time. It's like he had a bet to see how many times he could say it. I'm just a normal, beer drinkin' American, but I didn't find it amusing. I didn't even finish watching the whole thing. Maybe I would have liked it more back when I was a teenager or something. He is one of my favorite actors and I really like a lot of the movies and other things that he has done, but then it was disappointing to watch this and wonder \"Where is that nice, respectable, funny guy that was in the movies that I saw before?\"",
         "Some of the best stand-up comedy I've ever seen by a man who undeniably is a comical genius. If you have seen and liked any movie or TV show featuring Robin Williams, I tell you, this stuff will surely make you laugh! The material in his show might seem offensive to some (maybe to all) and it cannot be viewed politically; it is supposed to be fun, a laughing matter. The world has become a serious place and laughter is one of those things that help us through the day. Mr. Williams amongst several of his peers are the very best people to do just that. Considering the fact that the man is in his fifties making a live show with both verbal and physical humor, making satirical comments on just about everyone and everything, he is doing a job many of us would only be dreaming of doing at his age. Bless you Robin and thank you!",
         "In watching Robin Williams's comedy specials from the 80's, I was struck by how much I didn't actually laugh. Considering it was his prime, a lot of the time I didn't quite 'get' or really just take in most of the jokes he was doing, as a lot of them had him going out into the audience and just ragging on random people's items. Ironically enough he shines in this special, taking on so many topics it would make your head spin for me to list them all. But he's constantly moving here, like in his 80's specials, while still giving the audience some room to breathe here and there, without pounding over the head. He goes after plastic surgery, South American Soccer, the French, (a bit before it started churning up) the US and the Middle East/Iraq, and very memorably a tale of Jesus and his forgotten brother, Jerry. Even when one isn't laughing, it's still putting-a-grin kind of material he's working with. In the year last when he was really on fire (he at least had one good film among three, Death to Smoochy, Insomnia, and One Hour Photo, the latter two in my top 10 of 2002), for me he delivered his best in quite a long time, a wonderful comeback with enough sarcasm, energy, and curses to float a sinking boat.",
         "I have to say I was quite surprised at the language Robin was using all throughout his standup act. It doesn't bother me as I'm quite used to it from other various forms of entertainment but the thought of it coming from him...well I found that to be rather disturbing. I don't mean to sound like a Sally but I guess I'm just not used to seeing an icon of family entertainment use such profane language. I mean I've heard him mutter a swear or two but to go in to graphic sexual detail was a little odd for me. The act was funny, don't get me wrong but some of the jokes did get a little repetitive after awhile. I thought that maybe it was a tad too long and that they could've cut 45 minutes of it and condensed it all down to an hour long special. Robin Williams is extremely talented and is probably one of the best improvisational actors out there. The guy is seriously able to just wing ingenious material off the top of his head and keep going a mile a minute. I'd be happy just to have a tiny smidge of his mental capacity. Also if politically incorrect material offends you then this might be one you'd rather sit out. But if you have some time to kill and are looking for some over-the-top slapstick humor then look no further! Your answer lies within. Final Laugh: Movies: Not applicable. DVD Purchase: Might be worth it for all the extras and different screen shots made available. Rental: I enjoyed it immensely!",
         "I have been a huge fan of Robin Williams' stand-up comedy going right back to his first HBO special from the 70's (Which I recently watched again, and laughed as hard as I did the first time I saw it). I was convinced to purchase this DVD sight unseen by a friend of mine who saw him on this tour. A little part of me was a bit worried that he might not still have \"It\" after all those years away from the stand-up stage. I'm glad to say that my fears were completely unfounded. If anything, he got better with age! I was literally in tears from laughing so hard. One criticism I've heard from some people I've shown this DVD to, was his use of coarse language. They say, \"That's not the Robin Williams I know\". To them I just say, obviously you have never seen his stand-up going right back to the beginning. He's always been like that, definitely for adults only! If you can take it, you will be treated to one the funniest stand-up performances ever!",
         "It has been many years since I saw Robin Williams actually manage to be funny, sure, in lots of films recently I have seen him try but somehow never actually succeed that much. In this stand-up he takes us back to the motor-mouth and \"wacky\" comedy that first made him famous and gave him breaks in Mork & Mindy and Good Morning Vietnam to name a couple of projects. To many viewers this will be a welcome return and it more or less was for me too. Watching the special I was not rolling with laughter but was at least easily enjoying myself with fairly frequent laughs throughout the show. Other reviewers have gushed about it but I don't totally agree. There is an element of Williams playing \"greatest hits\" rather than doing something new or original. I'm not suggesting he is recycling material but just that the act etc is proved and that he is doing it for big cable provider HBO in front of a massive audience \u0096 so it does feel a little \"safer\" than twenty-off years ago. The second slight niggle for me is the fact that I doubted that Williams is really playing off his cuff so much as his delivery suggests \u0096 but this is only a minor niggle because he does react to things as he goes, plus it is not \"wrong\" that he works off script but yet feels fresh \u0096Eddie Izzard is very good at the same thing. Anyway, the show is funny regardless as he covers all sorts of material, from the political to the silly and he never really gives you a break to think too much about it. As a result his delivery is almost as important as his material and he is very good at keeping things moving and the energy high in the crowd. He won't be to everyone's taste because he is a bit silly and those looking for real insight or intelligence will maybe be a bit disappointed but Williams is energetic and imaginative and as a result the show is entertaining and enjoyable.",
         "I didn't know i could laugh that hard. My lungs hurt. This is by far the funniest thing I've ever seen in my life. I've seen it over 10 times, and know almost every joke he's gonna tell. I've been quoting him for the past 3 years, and even when i watch it today its still hilarious. I never really knew robin williams was funny until i saw this. All his jokes are offensive but you have to sort of move past that to really enjoy its laughs. He goes into all aspects of comedy drugs, religion, getting older, sex, sports, and the olympics, he even fits in a little something about martha stewart. And you always have to have some sort of bush jokes."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": [
         "Home Box Office (HBO)",
         "Cream Cheese Films",
         "Blue Wolf Productions"
      ],
      "summaries": ["The fourth HBO stand-up special by Robin Williams."],
      "budget": 0
   },
   "movielensId": 171695,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-07-14",
      "dvdReleaseDate": null,
      "directors": ["Marty Callner"],
      "runtime": 99,
      "movieId": 171695,
      "title": "Robin Williams: Live on Broadway",
      "mpaa": "R",
      "actors": ["Robin Williams"],
      "imdbMovieId": "0330829",
      "originalTitle": "Robin Williams: Live on Broadway",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "2002 HBO Stand-up Special starring Robin Williams. Recorded and broadcast live from New Your City's Broadway Theater at the culmination of his historic 2002 sold-out tour, this special finds the Oscar-winning actor/writer/comedian returning after 16 years to his stand-up roots to deliver what the Washington Post calls \"...in its madcap way, a seminal cultural event.\"",
      "tmdbMovieId": 20211,
      "avgRating": 3.6,
      "releaseYear": "2002",
      "numRatings": 5,
      "posterPath": "/BHXaRTS2rLY0UaF0V377X6Fx0f.jpg"
   }
}