{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "alien",
         "id": 9951
      }],
      "imdb_id": "tt0854667",
      "video": false,
      "title": "Showdown at Area 51",
      "recommendations": [
         30771,
         168802,
         30203,
         36213,
         31394,
         79190,
         42302
      ],
      "backdrop_path": "/2fznOfkpnjPRRXmL0bjwn49WZYd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Jake Townsend",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03daf5",
               "name": "Jason London",
               "profile_path": "/z4eSvvH51WsZppswHVHcqFJJm6L.jpg",
               "id": 52474,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Monica Gray",
               "gender": 1,
               "credit_id": "52fe44e8c3a368484e03daf9",
               "name": "Gigi Edgley",
               "profile_path": "/u2bR7MZguTPYcMeAYL9rJZd8yq6.jpg",
               "id": 26057,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Charlie Weise",
               "gender": 1,
               "credit_id": "52fe44e8c3a368484e03dafd",
               "name": "Christa Campbell",
               "profile_path": "/hWmOTsi5z5wvKcTsaLfWrhAsNJK.jpg",
               "id": 85178,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jude",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03db01",
               "name": "Coby Bell",
               "profile_path": "/cNwvsxcv352ZwRaVbr3rWI4xJ2Q.jpg",
               "id": 102775,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Kronnan",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03db05",
               "name": "Jahidi White",
               "profile_path": null,
               "id": 102776,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Tate",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03db09",
               "name": "Mel Fair",
               "profile_path": "/ylHUvkEKy4gu817JxDbaZRfyP4i.jpg",
               "id": 102777,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Maj 12 OP 1",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03db0d",
               "name": "Brock Roberts",
               "profile_path": null,
               "id": 102778,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Diamond Joe Carson",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03db11",
               "name": "Lee Horsley",
               "profile_path": "/1XzE8QztuBlrljHvFIzXnPPchPm.jpg",
               "id": 47859,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Alex Townsend",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03db15",
               "name": "Kip Martin",
               "profile_path": null,
               "id": 63471,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Ranger #1",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03db19",
               "name": "Tom Lowell",
               "profile_path": null,
               "id": 102779,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "TV Reporter",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03db1d",
               "name": "Michelle Anselmo",
               "profile_path": null,
               "id": 102780,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03dadf",
               "name": "C. Roma",
               "profile_path": null,
               "id": 102772,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03dae5",
               "name": "Ari Graham",
               "profile_path": null,
               "id": 102773,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03daeb",
               "name": "Brook Durham",
               "profile_path": null,
               "id": 102740,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03daf1",
               "name": "Kevin Moore",
               "profile_path": "/dxBYtew7HLcIjqjJV7Z1uqbcA2V.jpg",
               "id": 102774,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.309701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25977,
      "vote_count": 12,
      "budget": 0,
      "overview": "Two aliens who crash on Earth must find a buried weapon that will destroy the planet and their own society if not stopped.",
      "similar": [
         602,
         840,
         20424,
         831,
         10200,
         49849,
         348,
         601,
         126889,
         228161,
         16866,
         401513,
         4858,
         10122,
         8836,
         2675,
         118340,
         44912,
         608,
         644
      ],
      "original_title": "Showdown at Area 51",
      "runtime": 96,
      "poster_path": "/wKlSz9UWtijyxB4bfROYzcn2hSq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-01-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["C. Roma"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Ari Graham",
         "Brook Durham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0854667/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTcwNTQ0MDg1OV5BMl5BanBnXkFtZTgwODgzMTA2MDE@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jason London",
         "Gigi Edgley",
         "Christa Campbell"
      ],
      "reviews": [
         "gigi edgely and coby bell deliver decent acting considering the horrible script and swiss cheese plot full of holes. both are attractive and manage to deliver their lines pretty convincingly in spite of the preposterous situation. At a fundamental level, the plot has potential. Two aliens, one bad, one good, but you aren't sure which is which until the end of the film. Clues point in different directions (especially the girl on the swing part). It's a low budget flick so don't expect much on special effects. That may be an understatement. The problem is that it is really hard to suspend disbelief when so much of the movie borders on the absurd, and most of the acting is so awful. The frat boy scene introducing the brothers is unconvincing but at least short. The military part at the base is in part ruined by the overacting and unbelievable stupidity of the officer in charge. And then come the aliens, one with tattoos and leathers and the other in something that looks like he crawled out of an army navy surplus store. Hoses are are everywhere. He wears a holey summer shirt with a couple tears that apparently repels armor piercing bullets. It's a see to believe mess. The fights are worse. Bullets are bouncing off the aliens, one of whom has a little shield that he waves around that nobody can miss. An RPG (what is Mr. Redneck doing with an RPG?) is used to threaten one of the aliens, held about 2 feet from him -- as it if wouldn't blow up the hero as well. The clunk clunk fat guy gets delivered in an ice cream truck. No, wait, a bulletproof car comes first, then the ice cream truck which has some awful fake bullet holes in the side. They run through a squad of soldiers like a knife through butter -- somehow the vehicles are bulletproof, then, in one of the funniest scenes of the movie someone hits the rear bumper of the car and it falls off. Just... falls off. Nobody in these elite military squads can hit the tires which survive the entire encounter intact. How much budget does it take to deflate a tire? Its not that bad of a way to pass a boring night, primarily because of edgely (at least if you are male), but I'd have a hard time recommending it to anyone.",
         "This movie was bad within the first 5 minutes. It only takes minimal research to find out some basic info about Area 51. 1. It's on a dry lake bed in the Nevada Desert. Not a whole lot of lush green vegetation in the countryside there. 2. It's an actual military installation, not a disguised park. The people at Area 51 are military and in uniform, again no disguises are necessary. So think of a dry fenced in airbase with soldiers. Not a National Park with Rangers. Anyone in uniform has his hair trimmed short and neat. Just putting on a uniform won't fool anyone closer than 50 ft. That was what I noticed in the first 5 minutes. It went downhill from there when I found out that most of the cast can't act and the plot was thin. This doesn't even belong in the Bargain Bin, If anyone makes a DVD of this it's worth more as a coaster.",
         "Let's start with the things that are patently idiotic. Area 51 isn't in the desert as we have all been told, it's actually in a national park near St. Louis! Apparently that whole desert thing is just Government misdirection. Damn clever! Can you say \"tax break for setting your film in our crappy backyard\"? Apparently, a group of bad Aliens, the \"Cronen\" are waiting for us to generate enough pollution to meet their needs when they they will swoop in, kill us all and swipe our toxic waste. When the requisite female scientist asked the obvious question \"Why kill us, we'd be glad to give them all they want for free\" the only answer is \"They don't negotiate\". What are they, the Bush Administration? Not to mention the obvious fact that if they kill us all our ability to generate more pollution is zero, whereas if they just hauled it all away we'd make more than ever (just imagine if the EPA removed all restrictions, we would be a toxic goldmine). This is kind of like harvesting apples by cutting down the trees with a chainsaw and burning the stumps. And what kind of civilization doesn't know how to create pollution? The Bizarro world? \"Me make car runs on smog and makes clean air. Me sad.\" Anyway, the plot revolves around a good alien sent here by someone to try to stop them by shutting down the \"Omega Seed\", which is the alien sensor that determines when the pollution level is adequate for harvesting. Turns out it's buried under a futuristic manhole cover in a barn. Makes you wonder what the farmer thought it was. \"Dang it Clem, I done told ya not to park the tractor on the Omega Seed\". The acting is semi-adequate, with the standout being Gigi Edgely, much missed since Farscape got axed ( a show superior in every conceivable way). Watching her try, and occasionally fail, to hide her Aussie accent is enchanting. The SFX and fight scenes are OK. All in all, better than most SF movies, which makes it just sub-par for anyone else.",
         "When two aliens fighting against each other in their spacecrafts crash on Earth at Area 51, a military group goes to the location but they are killed. The former military Jake Townsend (Jason London) seeks news from his brother in the base where his brother serves, and stumbles with the alien Jude (Coby Bell). He is wounded and explains that he needs to find a weapon before the other alien, Kronnan (Jahidi White), activates it to destroy Earth. They team-up with Jake's former girlfriend Monica Gray (Gigi Edgley) to search the weapon while they are hunted down by Kronnan and a paramilitary team. But when Jake meets Kronnan, he tells that Jude is the one who intends to activate the destructive weapon. Who is telling the truth? \"Showdown at Area 51\" is a lame and dull film with an awfully written story. There are so many flaws that irritates. For example, Jake is angry with Jude in a moment, when the alien is accused of killing his brother, and teams-up with him on the next moment. Jake impersonates a military, trespasses the base perimeter, kills the leader of the paramilitary and the film has a happy end. My vote is three. Title (Brazil): Not Available",
         "The movie is not even worth reviewing, except for the fact that it stars a one-time legitimate actor named Jason London. I know he is pretty much just a pretty boy, but there was a time when he appeared in legit movies. I wonder what happened to him? I can guess, but I dare not say for fear of being sued. Anyhow, the movie is a very bad -- and I mean very bad --- copy of I COME IN PEACE, which was about two enemy aliens duking it out on Earth. In that incredibly silly but fun movie, which starred another has-been, Dolph Lundgren, the aliens at least looked like something from another planet. In this movie, the aliens are an ordinary-looking black guy and someone dressed in what appears to be an ancient aviator outfit. I have seen worse, but not by much. I only watched it for London, who fails to deliver the goods. He reminds me a little of Kyle McLaughlin, another pretty boy who seems unable to act -- at least ever since SHOWGIRLS. Please avoid this one.",
         "This was quite disappointing. I had higher hopes for this movie, although i'm not sure why. The movie started decently enough but soon became worse + worse until it was just hard to watch for how bad it was. The movie doesn't even take place in Area 51. The story (or lack there of) is incoherent and the acting is hardly any better. A few of the actors deliver alright but the dialogue + story just isn't there. Very little about the \"plot\" really makes sense in the film + it seems the writers were making it up as they go. The directing/camera work on the film is also quite shotty. O well, this is what i get for trusting the Sci-Fi channel.",
         "Do you have one of those friends who takes sadistic pleasure in bringing utterly crappy z-grade sci-fi movies back from the video store? Now you know how I was forced to have this travesty irreparably burned into the synapses of my brain. Anyhow, you may have noted that I gave this utter dreck three out of ten. Was it the utterly unnecessary presence of TV's Matt Houston? Nope. The \"I'm in it for the paycheck\" performance of Gigi Edgley? Guess again! That's right, it was the totally unexpected presence of a mint '67 Rambler Rebel SST convertible right in the middle of the picture! \"My God!\" I shouted, frightening the dog and making Dave jump in his chair, \"I have found a redeeming feature in this movie!\" I actually watched the thing all the way to the end based on this fact, and I still could not tell you what the hell happened.",
         "I'll tell you why. It wasn't the best film in the world, and it certainly wasn't the worst. But what it was not, well, it was not BORING!!! And for me, to sit through a two hour TV movie, well, I just sat and watched and enjoyed. The special effects were very well done. I didn't watch it for the acting. I watched it because I enjoy sci-fi and with all the crap out here and yes, most of the crap is on the SCi-fi Channel, with their reptiles, and snakes and whatever, it was nice to just enjoy an Alien movie without having to think about it too much. So if you just want to chill in front of the TV, grab some popcorn, grab your wife or girlfriend and sit and enjoy a not too complicated sci-fi movie. I'm so tired of zombies, vampires etc. We need a sequel to this one. Well done Sci Fi Channel.",
         "I watched this because of the intriguing title, and a bit out of \"Party of Five\" sentiment. I've seen over 2500 films, yet none of the actor I had seen before, so I thought hey nice! unknown actors! But I was thoroughly disappointed by the story. And the cinematography. I just don't like that a film, which is supposed to have sweltering skies and a desert backdrop is played out under a leaden sky. All right, so I like the sun, sue me. Yeah yeah, I know they explained it, and they're Canadians, so can you blame them for using their own country? I guess not. Still, this movie had 2nd rate written all over it. There is nothing which annoys me so much as Stupid Characters. Prime Example: the Tough Sarge. Why was he so stupid as not to distinguish between the two aliens? and on the other hand, Our Hero could just as easily have said: Look, he's the local Interstellar Cop, that is an Intergalactic Hoodlum and he wants to kill us all for profit/food/our minerals. Easy explanation, but yeah that would kinda kill the story .... But wait! that is the mark of a good writer, that presents his lore in such a way that believable obstacles are given, which do not rely on the stupidity of the characters. Wouldn't Our Hero say everything that sounds reasonable to keep the world from being poisoned? It's bad, very bad. Then, they try to throw in a totally unbelievable plot twist near the end, which could explain the rapid progress of the villain to the scene of the Bomb, but TOTALLY unbelievable, since we get no background info on Bad Alien at all, whereas we do get background info on Good Alien, he has a GF, she died, etc etc. Minor detail: They used the same bike they used in Tinman!!! I mean, how cheap can a channel get!! 84 mins of my life ... anyway, it's that I get somewhat paid to review these, or else ...",
         "When an alien crash-lands in Area 51, a former soldier and his girlfriend try to help the being recover a device stolen from a rival alien species that will annihilate Earth before it can launch the initial codes for it to happen. There wasn't a whole lot here that really wowed me over, as it ends up feeling more like a sci-fi film than a true horror with the aliens almost humanoid and not beasts, the focus on the recovery rather than the graphic kills, and an important error within as the ones we did get weren't very violent anyway, and the large sections of time devoted to the unraveling of the mystery surrounding the device instead of the aliens going after people, so as a horror film this one here is sorely lacking and really not worthwhile. Some of the action scenes are pretty nice and get some decent moments in, including the arrival and wiping out of a security troop on the base in a fun shoot-out, but this is totally undone by the rather insipid idea that comes in at the very end where the loyalties might be questioned by both sides, yet nothing is done with it and it's incredibly disappointing and confusing. Not a whole lot here to like at all. Rated Unrated/R: Adult Language and Violence.",
         "Alright... This movie has good special effects. Its fights are good. The acting is decent. That's about it. The story is thin, (something about aliens harvesting pollutants from Earth; to collect them they are going to blow us up. Why not just ask us? \"They don't negotiate\". Duh. Why have a renewable resource when you can be macho and blow stuff up?)the plot twists are about as exciting as watching grass grow, and the inaccuracies (pointed out in other comments) are glaring and decrease any sense of \"it-could-happen-someday\" suspense garnered from well-done movies like Aliens. I honestly don't care if it is a good \"Saturday night film\" (i.e., mindless violence). Why would I waste my life on it? Get this film if you are sick, extremely bored, you have no money or books, and your music player has no battery.",
         "It is hard to imagine that my attention would be directed away from Christa Campbell, but Farscape star Gigi Edgley managed to do just that. Campbell (Death by Engagement, Revamped) was very evident in the first part of the film, but Edgley took over and saved us from the evil aliens. Well, Jason London (Dazed and Confused) helped her a bit. It was the aliens that really stole the show. The good alien (unnamed on IMDb) was trying to stop the evil alien, with massive tricks up his sleeve, from destroying Earth to harvest our spent nuclear fuel. We would have gladly given it to them! The alien battles were very reminiscent of the Terminator. References to Area 51 and the crash at Roswell in 1947 made this more interesting for conspiracy fans.",
         "No matter what mood you are in and how bored you are- do not watch this piece of trash. It's not justifiable to watch yet another such US movie? If you bored, join the US army but don't watch this. How much did it take to make this? I'm a Sci Fi Fan, Independence Day was awesome and so old. What profit is bought to the World creating stupid ass low budget movies like Showdown at Area 51??? How did they get it out onto the screens or straight to video - (wotever u call it). OMG the world will be such a better place if only there was a minimum standard to pass movies as watchable but noooooo, some US people actually like this stuff??? I reckon this should be removed from records because it's not doing anyone any favours to get a chance to watch this.",
         "I recorded this SYFY movie on my DVR today in the hopes it would serve as a guilty pleasure. I finally had a break in my day and decided to watch the movie. The opening credits started with a shot of what I believe to be the Milky Way. As Jason London's name appears (who I have enjoyed in other movies), I see what looks like 4 transparent planets. Kind of corny, but I try to go with the flow of the movie. As the opening credits continue, our solar system comes into view. I am almost positive I did a better model of the solar system in Mr. Yonker's 4th grade than this movie did in the opening credits. In my mind, I am reciting the silly sentence I was taught to remember the planets, \"My (Mercury) Very (Venus) Educated (Earth) Mother (Mars) Just (Jupiter) Served (Saturn) Us (Uranus) Nine (Neptune) Pizzas (Pluto).\" It would take too long to explain the moons and planets that were misrepresented or completely missing from the rest of the opening credits. Let's just say, the only moon shown was Earth's and it appeared to be the same size as our planet and about 500 miles away. Twenty minutes into this movie I am trying to figure out why it was ever released. I decided to go onto IMDb and do some research. I have been more entertained by the people that have left reviews about the movie, than the actual movie itself. My favorite excerpt comes from reviewer, J Bartell: \"Apparently, a group of bad Aliens, the \"Cronen\" are waiting for us to generate enough pollution to meet their needs when they will swoop in, kill us all and swipe our toxic waste. When the requisite female scientist asked the obvious question \"Why kill us, we'd be glad to give them all they want for free\" the only answer is \"They don't negotiate\". What are they, the Bush Administration? Not to mention the obvious fact that if they kill us all our ability to generate more pollution is zero, whereas if they just hauled it all away we'd make more than ever (just imagine if the EPA removed all restrictions, we would be a toxic goldmine). This is kind of like harvesting apples by cutting down the trees with a chainsaw and burning the stumps. And what kind of civilization doesn't know how to create pollution? The Bizarro world? \"Me make car runs on smog and makes clean air. Me sad.\" Anyway, the plot revolves around a good alien sent here by someone to try to stop them by shutting down the \"Omega Seed\", which is the alien sensor that determines when the pollution level is adequate for harvesting. Turns out it's buried under a futuristic manhole cover in a barn. Makes you wonder what the farmer thought it was. 'Dang it Clem, I done told ya not to park the tractor on the Omega Seed'.\" This is the person who should have written the screenplay for this movie.",
         "I enjoyed it. Don't know why some people are complaining - interesting aliens, a fast-paced story, plot twists. Acting wasn't too bad either. And for once, the hero wasn't like a regular guy who all of a sudden becomes superman squared. One could relate to or at least understand the characters, even the 'dumb' ones!! Aliens had their vulnerabilities too. Adding Area 51 added a neat plot depth. I would like to see sequel. Compared to a whole lot of stuff I have seen on Sci-Fi (including one they send a demolition man to repair the moon-HA!) this was a well-written, well-acted movie that held my attention. Where there weaknesses? Sure, but I wasn't expecting Oscar-quality. Not bad for a Saturday evening.",
         "This film was okay, but not great. Apparently, it's original title was Alien vs. Alien, but it was released as \"Showdown in Area 51\". The plot is that two aliens land on Earth, one with the intention of allowing a weapon called the Omega Seed to wipe out all life on Earth so they can harvest our pollution. It really doesn't seem like much of a plan, as others have noted. (Love the Bizarro World comment!) The key to the weapon was lost on the spaceship that crashed in Roswell in 1947, but the real Area 51 is in Missouri guarded by the Forest Service. Yup, the Forest Service is the real Men in Black. Who knew? Okay, so you have slacker dude Jake who got kicked out, introduced by his brother who still works there, doing all the exposition before being vaporized by alien baddies. Slacker Jake teams up with the good alien and looks up his old girlfriend, Farscapes Gigi Edgely. I really wasn't a fan of her performance here. I think she was trying too hard to hide her Aussie accent, and for some reason her posture was bad for much of the film. So after some confusion as to which murdering alien they should trust, they manage to deactive the doomsday device. The aliens decide that they are going to retreat after that. Again, makes no sense whatsoever. If you have a whole invasion fleet, why would you only send down one guy to make sure your bomb goes off. Why not send down a whole team of these guys, and secure the thing? Why not just attack with your fleet and take out the inferior Earth forces? Still, it's better than average for a direct to DVD release.",
         "Military are caught in the crossfire between two alien humanoids, from different races, one planning to detonate an obelisk(..which will release a pathogen that will wipe out the human race so that it's people can inhabit the earth), the other wishing to save mankind from extinction. Jason London once worked for this secret military organization, giving it up for the love of a scientist(Gigi Edgley), both working in concert with Jude(Coby Bell), an alien warrior with an ax to grind. The evil, monstrously large Omega Centurian Cronen, whose armor withstands artillery, equipped with these odd-shaped throwing stars, is Jude's enemy, part of the race wishing to gain control of the \"ether rod\", a tool with cryptic glyphs that is specifically designed to either detonate or incapacitate the Omega seed, the weapon located underneath a barn in the middle of a Missouri farmland. If you have seen your share of sci-fi channel movies, you'll know what to expect, the Computer graphic alien ships and weapons used by the warring warriors are cheap looking against real backdrops and people. Mel Fair is Tate, head of the Area 51 military task force operating under the disguise of a Wildlife reserve office. London's involvement has to do with his brother's disappearance and welfare(..he was disintegrated by a mini-bomb Jude intended for Cronen). The tech-uniforms for Jude and Cronen have fancy armor, masks and body shields. The ships look like something out of a video game, except less stylized or cool. I think this one of those movies carrying the \"Alien vs Predator\" influence, with human paramilitary types casualties of the aliens' combat. There's a western style stare-down between Jude and Cronen certain to amuse. Nice little supporting role for Lee Horsley as a retired military man who has a gem needed for the ether rod to function properly.",
         "The movie takes your mind off the elements of the world as we know it today. It also reminds us that many of our problems are just like the movie.( put in context). If you have to think about what you have read so far there is no hope for you, but don't be blind and lead those of us that can see and THINK. Face it, you guys are just jealous of the hero that you wish you were, just like me. There are not many heroes today except our Firefighters, Police, and our Warriors overseas. So it is like I said, Mel is the hero we wish we were, and if we were, we would have more than half the problems as mentioned earlier solved with no excuses. Is that clear enough!",
         "The energy crisis has been solved. Turns out an alien race can use our carbon emissions for their own planet. Easy answer to all our current issue with the planet. Jude and some dude in ancient alien underwater \"flight\"suit, battle it out on our planet. They are both visitors from outer space. This costume reminded me of the old 50's A whopping 3 million was spent on this flick. I think making these films does provide employment and training ground for film/video folks and good experience before they graduate to making a commercial movie. These SyFy movies are the fast food of the industry. You start flipping burgers and move up to management. Direct a few SyFy movies and move up to theatrical release. The costume for the \"gas mask\" alien was surely inspired by Road Warrior. But the cutout butt cheeks were missing on this thrown together, jury rigged design. Visit a salvage store, buy tons of surplus, thrown them on an alien. His outfit reminded me of the 50's flick with the gorilla with the diving helmet. Jason and GiGi work with Jude, the other alien, to save the planet. Jason seems unable to master the RPG. Perhaps they should have given it to a Russian. Jason took about 5 minutes to aim but never fire the RPG. He should take a training class. At one time he has the aim but is distracted. I like the scene where he \"debates\" the bad alien, who tries to convince him that he is really the good guy. He turns off his squealing vocals to English. \"I am saving the planet the other guy is a terrorist.\" In movies like this you really need a few hot chicks with 36DD cleavage to keep a guys interest. Really. And tight shorts and t-tops. GiGi just doesn't make the grade, but she is cute. And you need a \"get wet\" scene somewhere, like in P2. The only sexy scene is where Jude tells GiGi to \"slide the ether rod into the terminal port\" to save the planet from invasion. She is carrying around a dildo type device for a lot of the movie and this dialog is loaded with innuendo. If it comes on the SyFy channel, you might check it out. The squealing alien sounded like a lifted audio track from a Godzilla movie.",
         "I'm a writer, so I totally get what people are saying about plot holes and such, but it's a good film. Very action-packed, and you could pick out your clichés with your eyes closed, which can be fun. Jake was funny, and I'm so glad he managed to shoot the Jeep; at least -somebody- understands that stopping the vehicle is far more practical than aiming to kill the driver. Monica was okay, as far as relatively unimportant female love interests go, and it amused me that she was shrieking for Jude during the scene in the forest despite obviously being meant to be Jake's love interest. She's only rather pretty, too, which is always a plus when you've gotten used to love interests who exist solely for the male audience to gawk at (Mikaela from the new Transformers movies, I'm staring you down, right between the eyes.). Jude, well, Jude was awesome. He had this amusing twitch in the right side of his face, and I was thinking it would make an interesting drinking game. Also, I found his protectiveness when concerning Jake to be very, very, -very- sweet. This is the sort of thing that differentiates the good aliens from the evil, world-asploding aliens. However, he had a very out-of-character moment when he shot Diamond Joe and kidnapped (for lack of a better term) Monica, which confused me immensely, given that I'd been lead to believe he was a good guy. Kronnan was a useful villain and a good liar, but there's not much else to say about the guy."
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Millennium Films",
         "Headless"
      ],
      "summaries": [
         "When two aliens fighting against each other in their spacecrafts crash on Earth at Area 51, a military group goes to the location but they are killed. The former military Jake Townsend seeks news from his brother in the base where his brother serves, and stumbles with the alien Jude. He is wounded and explains that he needs to find a weapon before the other alien, Kronnan, activates it to destroy Earth. They team-up with Jake's former girlfriend Monica Gray to search the weapon while they are hunted down by Kronnan and a paramilitary team. But when Jake meets Kronnan, he tells that Jude is the one who intends to activate the destructive weapon. Who is telling the truth?",
         "Two aliens who crash on Earth must find a buried weapon that will destroy the planet and their own society if not stopped."
      ],
      "budget": 3000000
   },
   "movielensId": 171739,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": null,
      "directors": ["C. Roma"],
      "runtime": 96,
      "movieId": 171739,
      "title": "Showdown at Area 51",
      "mpaa": "R",
      "actors": [
         "Jason London",
         "Gigi Edgley",
         "Christa Campbell",
         "Coby Bell",
         "Jahidi White",
         "Mel Fair",
         "Brock Roberts",
         "Lee Horsley",
         "Kip Martin",
         "Tom Lowell",
         "Michelle Anselmo"
      ],
      "imdbMovieId": "0854667",
      "originalTitle": "Showdown at Area 51",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two aliens who crash on Earth must find a buried weapon that will destroy the planet and their own society if not stopped.",
      "tmdbMovieId": 25977,
      "avgRating": 2.5,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/wKlSz9UWtijyxB4bfROYzcn2hSq.jpg"
   }
}